{
    "url": "truthlikeness",
    "title": "Truthlikeness",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Graham Oddie\n<oddie@colorado.edu>\nGustavo Cevolani\n<gustavo.cevolani@imtlucca.it>",
        "author_links": [
            {
                "http://spot.Colorado.EDU/~oddie/": "Graham Oddie"
            },
            {
                "mailto:oddie%40colorado%2eedu": "oddie@colorado.edu"
            },
            {
                "http://www.gustavocevolani.it/": "Gustavo Cevolani"
            },
            {
                "mailto:gustavo%2ecevolani%40imtlucca%2eit": "gustavo.cevolani@imtlucca.it"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://spot.Colorado.EDU/~oddie/\" target=\"other\">Graham Oddie</a>\n&lt;<a href=\"mailto:oddie%40colorado%2eedu\"><em>oddie<abbr title=\" at \">@</abbr>colorado<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://www.gustavocevolani.it/\" target=\"other\">Gustavo Cevolani</a>\n&lt;<a href=\"mailto:gustavo%2ecevolani%40imtlucca%2eit\"><em>gustavo<abbr title=\" dot \">.</abbr>cevolani<abbr title=\" at \">@</abbr>imtlucca<abbr title=\" dot \">.</abbr>it</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jul 11, 2001",
        "substantive revision Mon Nov 21, 2022"
    ],
    "preamble": "\n\nTruth is widely held to be the constitutive aim of inquiry.\nEven those who think the aim of inquiry is something more accessible\nthan the truth (such as the empirically discernible truth), as well as\nthose who think the aim is something more robust than possessing truth\n(such as the possession of knowledge) still affirm truth as a\nnecessary component of the end of inquiry. And, other things being\nequal, it seems better to end an inquiry by endorsing the truth rather\nthan falsehoods.\n\nEven if there is something to the thought that inquiry aims at truth,\nit has to be admitted that truth is a rather coarse-grained property\nof propositions. Some falsehoods seem to realize the aim of getting at\nthe truth better than others. Some truths better realize the aim than\nother truths. And perhaps some falsehoods even realize the aim better\nthan some truths do. The dichotomy of the class of propositions into\ntruths and falsehoods needs to be supplemented with a more\nfine-grained ordering – one which classifies propositions\naccording to their closeness to the truth, their degree of\ntruthlikeness, or their verisimilitude.\n\nWe begin with the logical problem of truthlikeness: the problem of\ngiving an adequate account of the concept and determining its logical\nproperties. In §1 we lay at the logical problem and various\npossible solutions to it. In §1.1 we examine the basic\nassumptions which generate the logical problem, which in part explains\nwhy the problem emerged when it did. Attempted solutions to the\nproblem quickly proliferated, but they can be gathered together under\nthree broad lines of attack. The first two, the content\napproach (§1.2) and the consequence approach\n(§1.3), were both initiated by Popper in his ground-breaking\nwork; although Popper’s specific proposals did not capture the\nintuitive concept (and were technically inadequate), the content and\nconsequence approaches are still being actively developed and refined.\nThe third, the likeness (or similarity)\napproach, takes the likeness in\ntruthlikeness seriously; the main results and problems facing\nthe likeness approach are outlined in §1.4.\n\nThere are two further problems of truthlikeness, both of which\npresuppose the solution of the logical problem. One is the\nepistemological problem of truthlikeness (§2). Even\ngiven a solution to the logical problem, there remains a question\nabout our epistemic access to truthlikeness. The other is the\naxiological problem: what kind of cognitive values\nare truth and truthlikeness? The relations between truth,\ntruthlikeness, and cognitive value are explored in §3.\n",
    "toc": [
        {
            "#LogPro": "1. The Logical Problem"
        },
        {
            "#WhatProb": "1.1 What’s the problem?"
        },
        {
            "#ConApp": "1.2 The content approach"
        },
        {
            "#ConsApp": "1.3 The consequence approach"
        },
        {
            "#LikApp": "1.4 The likeness approach"
        },
        {
            "#LikWorRidSimLogSpa": "1.4.1 Likeness of worlds in a simple propositional framework"
        },
        {
            "#LikProTru": "1.4.2 The likeness of a proposition to the truth"
        },
        {
            "#FraDep": "1.4.3 The framework dependence of likeness"
        },
        {
            "#TheEpiProb": "2. The Epistemological Problem"
        },
        {
            "#CogVal": "3. The Axiological Problem"
        },
        {
            "#Conclusion": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Logical Problem\n\nTruth, perhaps even more than beauty and goodness, has been the target\nof an extraordinary amount of philosophical dissection and\nspeculation. By comparison with truth, the more complex and much more\ninteresting concept of truthlikeness has only recently become the\nsubject of serious investigation. The logical problem of truthlikeness\nis to give a consistent and materially adequate account of the\nconcept. But first, we have to make it plausible that there is a\ncoherent concept in the offing to be investigated.\n1.1 What’s the problem?\n\nSuppose we are interested in what is the number of planets in the\nsolar system. With the demotion of Pluto to planetoid status, the\ntruth of this matter is that there are precisely 8 planets. Now, the\nproposition the number of planets in our solar system is 9\nmay be false, but quite a bit closer to the truth than the proposition\nthat the number of planets in our solar system is 9 billion.\n(One falsehood may be closer to the truth than another falsehood.) The\ntrue proposition the number of the planets is between 7 and 9\ninclusive is closer to the truth than the true proposition that\nthe number of the planets is greater than or equal to 0. (So\na truth may be closer to the truth than another truth.) Finally, the\nproposition that the number of the planets is either less than or\ngreater than 9 may be true but it is arguably not as close to the\nwhole truth as its highly accurate but strictly false\nnegation: that there are 9 planets.\n\nThis particular numerical example is admittedly simple, but a wide\nvariety of judgments of relative likeness to truth crop up both in\neveryday parlance as well as in scientific discourse. While some\ninvolve the relative accuracy of claims concerning the value of\nnumerical magnitudes, others involve the sharing of properties,\nstructural similarity, or closeness among putative laws.\n\nConsider a non-numerical example, also highly simplified but quite\ntopical in the light of the recent rise in status of the concept of\nfundamentality. Suppose you are interested in the truth about\nwhich particles are fundamental. At the outset of your inquiry all you\nknow are various logical truths, like the tautology either\nelectrons are fundamental or they are not. Tautologies are pretty\nmuch useless in helping you locate the truth about fundamental\nparticles. Suppose that the standard model is actually on the right\ntrack. Then, learning that electrons are fundamental edges you a\nlittle bit closer to your goal. It is by no means the complete truth\nabout fundamental particles, but it is a piece of it. If you go on to\nlearn that electrons, along with muons and tau particles, are a kind\nof lepton and that all leptons are fundamental, you have presumably\nedged closer.\n\nIf this is right, then some truths are closer to the truth about\nfundamental particles than others.\n\nThe discovery that atoms are not fundamental, that they are in fact\ncomposite objects, displaced the earlier hypothesis that atoms are\nfundamental. For a while the proposition that protons,\nneutrons and electrons are the fundamental components of atoms\nwas embraced, but unfortunately it too turned out to be false. Still,\nthis latter falsehood seems closer to the truth than its predecessor\n(assuming, again, that the standard model is true). And even if the\nstandard model contains errors, as surely it does, it is presumably\ncloser to the truth about fundamental particles than these other\nfalsehoods.\n\nSo again, some falsehoods may be closer to the truth about fundamental\nparticles than other falsehoods.\n\nAs we have seen, a tautology is not a terrific truth locator, but if\nyou moved from the tautology that electrons either are or are not\nfundamental to embrace the false proposition that electrons\nare not fundamental you would have moved further from your\ngoal.\n\nSo, some truths are closer to the truth than some falsehoods.\n\nBut it is by no means obvious that all truths about fundamental\nparticles are closer to the whole truth than any falsehood. The false\nproposition that electrons, protons and neutrons are the\nfundamental components of atoms, for instance, may well be an\nimprovement over the tautology.\n\nIf this is right, certain falsehoods are closer to the truth than some\ntruths.\n\nInvestigations into the concept of truthlikeness only began in earnest\nin the early nineteen sixties. Why was truthlikeness such a\nlatecomer to the philosophical scene? It wasn’t until the latter\nhalf of the twentieth century that mainstream philosophers gave up on\nthe Cartesian goal of infallible knowledge. The idea that we are quite\npossibly, even probably, mistaken in our most cherished beliefs, that\nthey might well be just false, was mostly considered\ntantamount to capitulation to the skeptic. By the middle of the\ntwentieth century, however, it was clear that many of our commonsense\nbeliefs, as well as previous scientific theories, are strictly\nspeaking, false. Further, the increasingly rapid turnover of\nscientific theories suggested that, far from being certain, they are\never vulnerable to refutation, and typically are eventually refuted\nand replaced by some new theory. The history of inquiry is one of a\nparade of refuted theories, replaced by other theories awaiting their\nturn at the guillotine. (This is the “dismal induction”,\nsee also the entry\n on realism and theory change in science.)\n\nRealism holds that the constitutive aim of inquiry is the\ntruth of some matter. Optimism holds that the history of\ninquiry is one of progress with respect to its constitutive aim. But\nfallibilism holds that our theories are false or very likely\nto be false, and to be replaced by other false theories. To combine\nthese three ideas, we must affirm that some false propositions better\nrealize the goal of truth – are closer to the truth – than\nothers. We are thus stuck with the logical problem of\ntruthlikeness.\n\nWhile a multitude of apparently different solutions to the problem\nhave been proposed, they can be classified into three main\napproaches, each with its own heuristic – the content\napproach, the consequence approach and the likeness\napproach. Before exploring these possible solutions to the logical\nproblem, it could be useful to dispel a couple of common confusions,\nsince truthlikeness should not be conflated with either epistemic\nprobability or with vagueness. We discuss this latter notion in the\n supplement Why truthlikeness is not probability or vagueness (see\n also the entry on\n vagueness);\n as for the former, we shall discuss the difference between (expected)\ntruthlikeness and probability when discussing the epistemological\nproblem (§2).\n1.2 The content approach\n\nKarl Popper was the first philosopher to take the logical problem of\ntruthlikeness seriously enough to make an assay on it. This is not\nsurprising, since Popper was also the first prominent realist to\nembrace a very radical fallibilism about science while also trumpeting\nthe epistemic superiority of the enterprise. In his early work, he\nimplied that the only kind of progress an inquiry can make consists in\nfalsification of theories. This is a little depressing, to say the\nleast. It is almost as depressing as the pessimistic induction. What\nit lacks is a positive account of how a succession of falsehoods might\nconstitute positive cognitive progress. Perhaps this is why\nPopper’s early work received a pretty short shrift from other\nphilosophers. If a miss is as good as a mile, and all we can ever\nestablish with confidence is that our inquiry has missed its target\nonce again, then epistemic pessimism seems inevitable. Popper\neventually realized that falsificationism is compatible with optimism\nprovided we have an acceptable notion of verisimilitude (or\ntruthlikeness). If some false hypotheses are closer to the truth than\nothers, then the history of inquiry may turn out to be one of progress\ntowards the goal of truth. Moreover, it may even be reasonable, on the\nbasis of our evidence, to conjecture that our theories are in fact\nmaking such progress, even though we know they are all false or highly\nlikely to be false.\n\nPopper saw clearly that the concept of truthlikeness should not be\nconfused with the concept of epistemic probability, and that it has\noften been so confused. (See Popper 1963 for a history of the\nconfusion and the supplement\n Why truthlikeness is not probability or vagueness\n for an explanation of the difference between the two concepts.)\nPopper’s insight here was facilitated by his deep but largely\nunjustified antipathy to epistemic probability. He thought that his\nstarkly falsificationist account favored bold, contentful theories.\nDegree of informative content varies inversely with probability\n– the greater the content the less likely a theory is to be\ntrue. So if you are after theories which seem, on the evidence, to be\ntrue, then you will eschew those which make bold – that is,\nhighly improbable – predictions. On this picture, the quest for\ntheories with high probability is simply misguided.\n\nTo see this distinction between truthlikeness and probability clearly,\nand to articulate it, was one of Popper’s most significant\ncontributions, not only to the debate about truthlikeness, but to\nphilosophy of science and logic in general. However, his deep\nantagonism to probability, combined with his love of boldness, was\nboth a blessing and a curse. The blessing: it led him to produce not\nonly the first interesting and important account of truthlikeness, but\nto initiate an approach to the problem in terms of content. The curse:\ncontent alone, as Popper envisaged it, is insufficient to characterize\ntruthlikeness.\n\nPopper made the first attempt to solve the problem in his famous\ncollection Conjectures and Refutations. As a great admirer of\nTarski’s assay on the concept of truth, he modelled his theory\nof truthlikeness on Tarski’s theory. First, let a matter for\ninvestigation be circumscribed by a formalized language \\(L\\) adequate\nfor discussing it. Tarski showed us how each possible world, or model\nof the language, induces a partition of sentences of \\(L\\) into those\nthat are true and those that are false. The set of all sentences true\nin the actual world is thus a complete true account of the world, as\nfar as that language goes. It is aptly called the Truth, \\(T\\). \\(T\\)\nis the target of the investigation couched in \\(L\\). It is the theory\n(relative to the resources in \\(L)\\) that we are seeking. If\ntruthlikeness is to make sense, theories other than \\(T\\), even false\ntheories, come more or less close to capturing \\(T\\).\n\n\\(T\\), the Truth, is a theory only in the technical Tarskian sense,\nnot in the ordinary everyday sense of that term. It is a set of\nsentences closed under the consequence relation: \\(T\\) may not be\nfinitely axiomatizable, or even axiomatizable at all. However, it is a\nperfectly good set of sentences all the same. In general, we will\nfollow the Tarski-Popper usage here and call any set of sentences\nclosed under consequence a theory, and we will assume that\neach proposition we deal with is identified with a theory in this\nsense. (Note that theory \\(A\\) logically entails theory \\(B\\) just in\ncase \\(B\\) is a subset of \\(A\\).)\n\nThe complement of \\(T\\), the set of false sentences \\(F\\), is not a\ntheory even in this technical sense. Since falsehoods always entail\ntruths, \\(F\\) is not closed under the consequence relation. (This may\nbe the reason why we have no expression like the Falsth: the\nset of false sentences does not describe a possible alternative to the\nactual world.) But \\(F\\) too is a perfectly good set of sentences. The\nconsequences of any theory \\(A\\) that can be formulated in \\(L\\) will\nthus divide between \\(T\\) and \\(F\\). Popper called the intersection of\n\\(A\\) and \\(T\\), the truth content of \\(A\\) (\\(A_T\\)), and\nthe intersection of \\(A\\) and \\(F\\), the falsity content of\n\\(A\\) (\\(A_T\\)). Any theory \\(A\\) is thus the union of its\nnon-overlapping truth content and falsity content. Note that since\nevery theory entails all logical truths, these will constitute a\nspecial set, at the center of \\(T\\), which will be included in every\ntheory, whether true or false.\n\n\n\nDiagram 1. Truth and falsity contents of\nfalse theory \\(A\\)\n\n\nA false theory will cover some of \\(F\\), but because every false\ntheory has true consequences, including all logical truths, it will\nalso overlap with \\(T\\) (Diagram 1).\n\nA true theory, however, will only overlap \\(T\\) (Diagram 2):\n\n\n\nDiagram 2. True theory \\(A\\) is\nidentical to its own truth content\n\n\nAmongst true theories, then, it seems that the more true sentences\nthat are entailed, the closer we get to \\(T\\), hence the more\ntruthlike. Set theoretically that simply means that, where \\(A\\) and\n\\(B\\) are both true, \\(A\\) will be more truthlike than \\(B\\) just in\ncase \\(B\\) is a proper subset of \\(A\\) (which for true theories means\nthat \\(B_T\\) is a proper subset of \\(A_T\\)). Call this principle:\nthe value of content for truths.\n\n\n\nDiagram 3. True theory \\(A\\) has more\ntruth content than true theory \\(B\\)\n\n\nThis essentially syntactic account of truthlikeness has some nice\nfeatures. It induces a partial ordering of truths, with the whole\nTruth \\(T\\) at the top of the ordering: \\(T\\) is closer to the Truth\nthan any other true theory. The set of logical truths is at the\nbottom: further from the Truth than any other true theory. In between\nthese two extremes, true theories are ordered simply by logical\nstrength: the more logical content, the closer to the Truth. Since\nprobability varies inversely with logical strength, amongst truths the\ntheory with the greatest truthlikeness \\((T)\\) must have the smallest\nprobability, and the theory with the largest probability (the logical\ntruth) is the furthest from the Truth. Popper made a simple and\nperhaps plausible generalization of this. Just as truth content\n(coverage of \\(T)\\) counts in favor of truthlikeness, falsity content\n(coverage of \\(F)\\) counts against. In general then, a theory \\(A\\) is\ncloser to the truth if it has more truth content without engendering\nmore falsity content, or has less falsity content without sacrificing\ntruth content (diagram 4):\n\n\n\nDiagram 4. False theory \\(A\\) closer to\nthe Truth than false theory \\(B\\)\n\n\nThe generalization of the truth content comparison, by incorporating\nfalsity content comparisons, also has some nice features. It preserves\nthe comparisons of true theories mentioned above. The truth content\n\\(A_T\\) of a false theory \\(A\\) (itself a theory in the Tarskian\nsense) will clearly be closer to the truth than \\(A\\) (Diagram 1). And\nthe whole truth \\(T\\) will be closer to the truth than any falsehood\n\\(B\\) because the truth content of \\(B\\) must be contained within\n\\(T\\), and the falsity content of \\(T\\) (the empty class) must be\nproperly contained within the non-empty falsity content of \\(B\\).\n\nDespite its attractive features, the account has a couple of\ndisastrous consequences. Firstly, since a falsehood has some false\nconsequences, and no truth has any, it follows that no falsehood can\nbe as close to the truth as a logical truth – the weakest of all\ntruths. A logical truth leaves the location of the truth wide open, so\nit is rather worthless as an approximation to the whole truth. On\nPopper’s account, no falsehood can ever be more worthwhile than\na worthless logical truth. (We could call this result the absolute\nworthlessness of falsehoods).\n\nFurthermore, it is impossible to add a true consequence to a false\ntheory without thereby adding additional false consequences (or\nsubtract a false consequence without subtracting true consequences).\nSo the account entails that no false theory is closer to the truth\nthan any other. We could call this result the relative\nworthlessness of all falsehoods. These worthlessness results were\nproved independently by Pavel Tichý and David Miller (Miller\n1974, and Tichý 1974) – for a proof, see the supplement\n on Why Popper’s definition of truthlikeness fails: the Tichý-Miller theorem.\n\nIt is tempting (and Popper was so tempted) to retreat in the face of\nthese results to something like the comparison of truth contents\nalone. That is to say, \\(A\\) is as close to the truth as \\(B\\) if\n\\(B_T\\) is contained in \\(A_T\\), and \\(A\\) is closer to the truth than\n\\(B\\) just in case \\(B_T\\) is properly contained in \\(B_T\\). Call this\nthe Simple Truth Content account.\n\nThis Simple Truth Content account preserves what many consider to be\nthe chief virtue of Popper’s account: the value of content for\ntruths. And while it delivers the absolute worthlessness of falsehoods\n(no falsehood is closer to the truth than a tautology) it avoids the\nrelative worthlessness of falsehoods. If \\(A\\) and \\(B\\) are both\nfalse, then \\(A_T\\) may well properly contain \\(B_T\\). But that holds\nif and only if \\(A\\) is logically stronger than \\(B\\). That is to say,\na false proposition is the closer to the truth the stronger it is.\nAccording to this principle – call it the value of content\nfor falsehoods – the false proposition that there are\nnine planets, and all of them are made of green cheese is more\ntruthlike than the false proposition there are nine planets.\nAnd so once one knows that a certain theory is false one can be\nconfident that tacking on any old arbitrary proposition, no matter how\ninaccurate it is, will lead us inexorably closer to the truth. This is\nsometimes called the child’s play objection. Among\nfalse theories, brute logical strength becomes the sole\ncriterion of a theory’s likeness to truth.\n\nEven though Popper’s particular proposals were flawed, his idea\nof comparing truth-content and falsity-content is nevertheless worth\nexploring. Several philosophers have developed variations on the idea.\nSome stay within Popper’s essentially syntactic paradigm,\nelucidating content in terms of consequence classes (e.g., Newton\nSmith 1981; Schurz and Weingartner 1987, 2010; Cevolani and Festa\n2020). Others have switched to a semantic conception of content,\nconstruing semantic content in terms of classes of possibilities, and\nsearching for a plausible theory of distance between those.\n\nA variant of this approach takes the class of models of a language as\na surrogate for possible states of affairs (Miller 1978a). The other\nutilizes a semantics of incomplete possible states like those favored\nby structuralist accounts of scientific theories (Kuipers 1987b,\nKuipers 2019). The idea which these accounts have in common is that\nthe distance between two propositions \\(A\\) and \\(B\\) is measured by\nthe symmetric difference \\(A\\mathbin{\\Delta} B\\) of the two\nsets of possibilities: \\((A - B)\\cup(B - A)\\). Roughly speaking, the\nlarger the symmetric difference, the greater the distance between the\ntwo propositions. Symmetric differences might be compared\nqualitatively – by means of set-theoretic inclusion – or\nquantitatively, using some kind of probability measure. Both can be\nshown to have the general features of a measure of distance.\n\nThe fundamental problem with the content approach lies not in the way\nit has been articulated, but rather in the basic underlying\nassumption: that truthlikeness is a function of just two variables\n– content and truth value. This assumption has several rather\nproblematic consequences.\n\nFirstly, any given proposition \\(A\\) can have only two degrees of\nverisimilitude: one in case it is false and the other in case it is\ntrue. This is obviously wrong. A theory can be false in very many\ndifferent ways. The proposition that there are eight planets\nis false whether there are nine planets or a thousand planets, but its\ndegree of truthlikeness is much higher in the first case than in the\nlatter. Secondly, if we combine the value of content for truths and\nthe value of content for falsehoods, then if we fix truth value,\nverisimilitude will vary only according to amount of content. So, for\nexample, two equally strong false theories will have to have the same\ndegree of verisimilitude. That’s pretty far-fetched. That\nthere are ten planets and that there are ten billion\nplanets are (roughly) equally strong, and both are false in fact,\nbut the latter seems much further from the truth than the former.\n\nFinally, how might strength determine verisimilitude amongst false\ntheories? There seem to be just two plausible candidates: that\nverisimilitude increases with increasing strength (the principle of\nthe value of content for falsehoods) or that it decreases with\nincreasing strength (the principle of the disvalue of content for\nfalsehoods). Both proposals are at odds with attractive judgements and\nprinciples, which suggest that the original content approach is in\nneed of serious revision (see, e.g., Kuipers 2019 for a recent\nproposal).\n1.3 The Consequence Approach\n\nPopper crafted his initial proposal in terms of the true and false\nconsequences of a theory. Any sentence at all that follows from a\ntheory is counted as a consequence that, if true, contributes to its\noverall truthlikeness, and if false, detracts from that. But it has\nstruck many that this both involves an enormous amount of double\ncounting, and that it is the indiscriminate counting of arbitrary\nconsequences that lies behind the Tichý-Miller trivialization\nresult.\n\nConsider a very simple framework with three primitive sentences: \\(h\\)\n(for the state hot), \\(r\\) (for rainy) and \\(w\\)\n(for windy). This framework generates a very small space of\neight possibilities. The eight maximal conjunctions (like \\(h \\amp r\n\\amp w, {\\sim}h \\amp r \\amp w,\\) etc.) of the three primitive\nsentences and of their negations express those possibilities.\n\nSuppose that in fact it is hot, rainy and windy (expressed by the\nmaximal conjunction \\(h \\amp r \\amp w)\\). Then the claim that it is\ncold, dry and still (expressed by the sentence \\({\\sim}h \\amp{\\sim}r\n\\amp{\\sim}w)\\) is further from the truth than the claim that it is\ncold, rainy and windy (expressed by the sentence \\({\\sim}h \\amp r \\amp\nw)\\). And the claim that it is cold, dry and windy (expressed by the\nsentence \\({\\sim}h \\amp{\\sim}r \\amp w)\\) is somewhere between the two.\nThese kinds of judgements, which seem both innocent and intuitively\ncorrect, Popper’s theory cannot accommodate. And if they are to\nbe accommodated we cannot treat all true and false consequences alike.\nFor the three false claims mentioned here have exactly the same number\nof true and false consequences (this is the problem we called the\nrelative worthlessness of all falsehoods).\n\nClearly, if we are going to measure closeness to truth by counting\ntrue and false consequences, some true consequences should count more\nthan others. For example, \\(h\\) and \\(r\\) are both true, and\n\\({\\sim}h\\) and \\({\\sim}r\\) are false. The former should surely count\nin favor of a claim, and the latter against. But\n\\({\\sim}h\\rightarrow{\\sim}r\\) is true and \\(h\\rightarrow{\\sim}r\\) is\nfalse. After we have counted the truth \\(h\\) in favor of a\nclaim’s truthlikeness and the falsehood \\({\\sim}r\\) against it,\nshould we also count the true consequence\n\\({\\sim}h\\rightarrow{\\sim}r\\) in favor, and the falsehood\n\\(h\\rightarrow{\\sim}r\\) against? Surely this is both unnecessary and\nmisleading. And it is precisely counting sentences like these that\nrenders Popper’s account susceptible to the Tichý-Miller\nargument.\n\nAccording to the consequence approach, Popper was right in thinking\nthat truthlikeness depends on the relative sizes of classes of true\nand false consequences, but erred in thinking that all consequences of\na theory count the same. Some consequences are relevant, some\naren’t. Let \\(R\\) be some criterion of relevance of\nconsequences; let \\(A_R\\) be the set of relevant consequences\nof \\(A\\). Whatever the criterion \\(R\\) is it has to satisfy the\nconstraint that \\(A\\) be recoverable from (and hence equivalent to)\n\\(A_R\\). Popper’s account is the limiting one – all\nconsequences are relevant. (Popper’s relevance criterion is the\nempty one, \\(P\\), according to which \\(A_P\\) is just \\(A\\) itself.)\nThe relevant truth content of A (abbreviated \\(A_R^T\\)) can\nbe defined as \\(A_R\\cap T\\) (or \\(A\\cap T_R\\)), and similarly the\nrelevant falsity content of \\(A\\) can be defined as \\(A_R\\cap\nF\\). Since \\(A_R = (A_R\\cap T)\\cup(A_R\\cap F)\\) it follows that the\nunion of true and false relevant consequences of \\(A\\) is equivalent\nto \\(A\\). And where \\(A\\) is true \\(A_R\\cap F\\) is empty, so that A is\nequivalent to \\(A_R\\cap T\\) alone.\n\nWith this restriction to relevant consequences we can basically apply\nPopper’s definitions: one theory is more truthlike than another\nif its relevant truth content is larger and its relevant falsity\ncontent no larger; or its relevant falsity content is smaller, and its\nrelevant truth content is no smaller.\n\nThis idea was first explored by Mortensen in his 1983, but he\nabandoned the basic idea as unworkable. Subsequent proposals within\nthe broad program have been offered by Burger and Heidema 1994, Schurz\nand Weingartner 1987 and 2010, and Gemes 2007. (Gerla 2007 also uses\nthe notion of the relevance of a “test” or factor, but his\naccount is best located more squarely within the likeness\napproach.)\n\nOne possible relevance criterion that the \\(h\\)-\\(r\\)-\\(w\\) framework\nmight suggest is atomicity. This amounts to identifying\nrelevant consequences as basic ones, i.e., atomic sentences\nor their negations (Cevolani, Crupi and Festa 2011; Cevolani, Festa\nand Kuipers 2013). But even if we could avoid the problem of saying\nwhat it is for a sentence to be atomic, since many distinct\npropositions imply the same atomic sentences, this criterion would not\nsatisfy the requirement that \\(A\\) be equivalent to \\(A_R\\). For\nexample, \\((h\\vee r)\\) and \\(({\\sim}h\\vee{\\sim}r)\\), like tautologies,\nimply no atomic sentences at all. This latter problem can be solved by\nresorting to the notion of partial consequence;\ninterestingly, the resulting account becomes virtually indentical to\none version of the likeness approach (Cevolani and Festa 2020).\n\nBurger and Heidema 1994 compare theories by positive and negative\nsentences. A positive sentence is one that can be constructed out of\n\\(\\amp,\\) \\(\\vee\\) and any true basic sentence. A negative sentence is\none that can be constructed out of \\(\\amp,\\) \\(\\vee\\) and any false\nbasic sentence. Call a sentence pure if it is either positive\nor negative. If we take the relevance criterion to be purity,\nand combine that with the relevant consequence schema above, we have\nBurger and Heidema’s proposal, which yields a reasonable set of\nintuitive judgments. Unfortunately purity (like atomicity) does not\nquite satisfy the constraint that \\(A\\) be equivalent to the class of\nits relevant consequences. For example, if \\(h\\) and \\(r\\) are both\ntrue then \\(({\\sim}h\\vee r)\\) and \\((h\\vee{\\sim}r)\\) both have the\nsame pure consequences (namely, none).\n\nSchurz and Weingartner 2010 use the following notion of relevance\n\\(S\\): being equivalent to a disjunction of atomic propositions or\ntheir negations. With this criterion they can accommodate a range of\nintuitive judgments in the simple weather framework that\nPopper’s account cannot.\n\nFor example, where \\(\\gt_S\\) is the relation of greater\nS-truthlikeness we capture the following relations among false\nclaims, which, on Popper’s account, are mostly\nincommensurable: \n\\[ (h \\amp{\\sim}r) \\gt_S ({\\sim}r) \\gt_S ({\\sim}h \\amp{\\sim}r). \\]\n\n\nand \n\\[ (h\\vee r) \\gt_S ({\\sim}r) \\gt_S ({\\sim}h\\vee{\\sim}r) \\gt_S ({\\sim}h \\amp{\\sim}r). \\]\n\n\nThe relevant consequence approach faces three major hurdles.\n\nThe first is an extension problem: the approach does produce some\nintuitively acceptable results in a finite propositional framework,\nbut it needs to be extended to more realistic frameworks – for\nexample, first-order and higher-order frameworks (see Gemes 2007 for\nan attempt along these lines).\n\nThe second is that, like Popper’s original proposal, it judges\nno false proposition to be closer to the truth than any truth,\nincluding logical truths. Schurz and Weingartner (2010) have answered\nthis objection by quantitatively extending their qualitative account\nby assigning weights to relevant consequences and summing; one problem\nwith this is that it assumes finite consequence classes.\n\nThe third involves the language-dependence of any adequate relevance\ncriterion. This problem will be outlined and discussed below in\nconnection with the likeness approach (§1.4.3).\n1.4 The Likeness Approach\n\nIn the wake of the difficulties facing Popper’s approach,\ntwo philosophers, working quite independently, suggested a radically\ndifferent approach: one which takes the likeness in\ntruthlikeness seriously (Tichý 1974, Hilpinen 1976). This shift\nfrom content to likeness was also marked by an immediate shift from\nPopper’s essentially syntactic approach (something it shares\nwith the consequence program) to a semantic approach.\n\nTraditionally the semantic contents of sentences have been taken to be\nnon-linguistic, or rather non-syntactic, items –\npropositions. What propositions are is highly contested, but\nmost agree that a proposition carves the class of possibilities into\ntwo sub-classes – those in which the proposition is true and\nthose in which it is false. Call the class of worlds in which the\nproposition is true its range. Some have proposed that\npropositions be identified with their ranges (for example,\nDavid Lewis, in his 1986). This is implausible since, for example, the\ninformative content of \\(7+5=12\\) seems distinct from the informative\ncontent of \\(12=12\\), which in turn seems distinct from the\ninformative content of Gödel’s first incompleteness theorem\n– and yet all three have the same range: they are all true in\nall possible worlds. Clearly, if semantic content is supposed to be\nsensitive to informative content, classes of possible worlds will are\nnot discriminating enough. We need something more fine-grained for a\nfull theory of semantic content.\n\nDespite this, the range of a proposition is certainly an important\naspect of informative content, and it is not immediately obvious why\ntruthlikeness should be sensitive to differences in the way a\nproposition picks out its range. (Perhaps there are cases of logical\nfalsehoods some of which seem further from the truth than others. For\nexample \\(7+5=113\\) might be considered further from the truth than\n\\(7+5=13\\) though both have the same range – namely, the empty\nset of worlds; see Sorensen 2007.) But as a first approximation, we\nwill assume that it is not hyperintensional and that logically\nequivalent propositions have the same degree of truthlikess. The\nproposition that the number of planets is eight for example,\nshould have the same degree of truthlikeness as the proposition that\nthe square of the number of the planets is sixty four.\n\nLeaving apart the controversy over the nature of possible worlds, we\nshall call the complete collection of possibilities, given some array\nof features, the logical space, and call the array of\nproperties and relations which underlie that logical space, the\nframework of the space. Familiar logical relations and\noperations correspond to well-understood set-theoretic relations and\noperations on ranges. The range of the conjunction of two propositions\nis the intersection of the ranges of the two conjuncts. Entailment\ncorresponds to the subset relation on ranges. The actual world is a\nsingle point in logical space – a complete specification of\nevery matter of fact (with respect to the framework of features)\n– and a proposition is true if its range contains the actual\nworld, false otherwise. The whole Truth is a true proposition that is\nalso complete: it entails all true propositions. The range of the\nTruth is none other than the singleton of the actual world. That\nsingleton is the target, the bullseye, the thing at which the most\ncomprehensive inquiry is aiming.\n\nWithout additional structure on the logical space we have just three\nfactors for a theorist of truthlikeness to work with – the size\nof a proposition (content factor), whether it contains the actual\nworld (truth factor), and which propositions it implies (consequence\nfactor). The likeness approach requires some additional structure to\nthe logical space. For example, worlds might be more or less\nlike other worlds. There might be a betweenness relation\namongst worlds, or even a fully-fledged distance metric. If\nthat’s the case, we can start to see how one proposition might\nbe closer to the Truth – the proposition whose range contains\njust the actual world – than another. The core of the likeness\napproach is that truthlikeness supervenes on the likeness between\nworlds.\n\nThe likeness theorist has two tasks: firstly, making it plausible that\nthere is an appropriate likeness or distance function on worlds; and\nsecondly, extending likeness between individual worlds to likeness of\npropositions (i.e., sets of worlds) to the actual world. Suppose, for\nexample, that worlds are arranged in similarity spheres nested around\nthe actual world, familiar from the Stalnaker-Lewis approach to\ncounterfactuals. Consider Diagram 5.\n\n\n\nDiagram 5. Verisimilitude by similarity\ncircles\n\n\nThe bullseye is the actual world and the small sphere which includes\nit is \\(T\\), the Truth. The nested spheres represent likeness to the\nactual world. A world is less like the actual world the larger the\nfirst sphere of which it is a member. Propositions \\(A\\) and \\(B\\) are\nfalse, \\(C\\) and \\(D\\) are true. A carves out a class of worlds which\nare rather close to the actual world – all within spheres two to\nfour – whereas \\(B\\) carves out a class rather far from the\nactual world – all within spheres five to seven. Intuitively\n\\(A\\) is closer to the bullseye than is \\(B\\).\n\nThe largest sphere which does not overlap at all with a proposition is\nplausibly a measure of how close the proposition is to being true.\nCall that the truth factor. A proposition \\(X\\) is closer to\nbeing true than \\(Y\\) if the truth factor of \\(X\\) is included in the\ntruth factor of \\(Y\\). The truth factor of \\(A\\), for example, is the\nsmallest non-empty sphere, \\(T\\) itself, whereas the truth factor of\n\\(B\\) is the fourth sphere, of which \\(T\\) is a proper subset: so\n\\(A\\) is closer to being true than \\(B\\).\n\nIf a proposition includes the bullseye, then of course it is true\nsimpliciter and it has the maximal truth factor (the empty set).\nSo all true propositions are equally close to being true. But\ntruthlikeness is not just a matter of being close to being true. The\ntautology, \\(D,\\) \\(C\\) and the Truth itself are equally true, but in\nthat order they increase in their closeness to the whole truth.\n\nTaking a leaf out of Popper’s book, Hilpinen argued that\ncloseness to the whole truth is in part a matter of degree of\ninformativeness of a proposition. In the case of the true\npropositions, this correlates roughly with the smallest sphere which\ntotally includes the proposition. The further out the outermost\nsphere, the less informative the proposition is, because the larger\nthe area of the logical space which it covers. So, in a way which\nechoes Popper’s account, we could take truthlikeness to be a\ncombination of a truth factor (given by the likeness of that world in\nthe range of a proposition that is closest to the actual world) and a\ncontent factor (given by the likeness of that world in the range of a\nproposition that is furthest from the actual world):\n\n\\(A\\) is closer to the truth than \\(B\\) if and only if \\(A\\) does as\nwell as \\(B\\) on both truth factor and content factor, and better on\nat least one of those.\n\n\nApplying Hilpinen’s definition we capture two more particular\njudgements, in addition to those already mentioned, that seem\nintuitively acceptable: that \\(C\\) is closer to the truth than \\(A\\),\nand that \\(D\\) is closer than \\(B\\). (Note, however, that we have here\na partial ordering: \\(A\\) and \\(D\\), for example, are not ranked.) We\ncan derive from this various apparently desirable features of the\nrelation closer to the truth: for example, that the relation\nis transitive, asymmetric and irreflexive; that the Truth is closer to\nthe Truth than any other theory; that the tautology is at least as far\nfrom the Truth as any other truth; that one cannot make a true theory\nworse by strengthening it by a truth (a weak version of the value of\ncontent for truths); that a falsehood is not necessarily improved by\nadding another falsehood, or even by adding another truth (a\nrepudiation of the value of content for falsehoods).\n\nBut there are also some worrying features here. While it avoids the\nrelative worthlessness of falsehoods, Hilpinen’s account, just\nlike Popper’s, entails the absolute worthlessness of all\nfalsehoods: no falsehood is closer to the truth than any truth. So,\nfor example, Newton’s theory is deemed to be no more truthlike,\nno closer to the whole truth, than the tautology.\n\nCharacterizing Hilpinen’s account as a combination of a truth\nfactor and an information factor seems to mask its quite radical\ndeparture from Popper’s account. The incorporation of similarity\nspheres signals a fundamental break with the pure content approach,\nand opens up a range of possible new accounts: what such accounts have\nin common is that the truthlikeness of a proposition is a\nnon-trivial function of the likeness to the actual world of worlds\nin the range of the proposition.\n\nThere are three main problems for any concrete proposal within the\nlikeness approach. The first concerns an account of likeness between\nstates of affairs – in what does this consist and how can it be\nanalyzed or defined? The second concerns the dependence of the\ntruthlikeness of a proposition on the likeness of worlds in its range\nto the actual world: what is the correct function? (This can be called\n“the extension problem”.) And finally, there is the famous\nproblem of “translation variance” or “framework\ndependence” of judgements of likeness and of truthlikeness. This\nlast problem will be taken up in §1.4.3.\n1.4.1 Likeness of worlds in a simple propositional framework\n\nOne objection to Hilpinen’s proposal (like Lewis’s\nproposal for counterfactuals) is that it assumes the similarity\nrelation on worlds as a primitive, there for the taking. At the end of\nhis 1974 paper, Tichý not only suggested the use of similarity\nrankings on worlds, but also provided a ranking in propositional\nframeworks and indicated how to generalize this to more complex\nframeworks.\n\nExamples and counterexamples in Tichý 1974 are exceedingly\nsimple, utilizing the little propositional framework introduced above,\nwith three primitives – \\(h\\) (for the state hot),\n\\(r\\) (for rainy) and \\(w\\) (for windy).\nCorresponding to the eight-members of the logical space generated by\ndistributions of truth values through the three basic conditions,\nthere are eight maximal conjunctions (or constituents):\n\n\n\n\\(w_1\\)\n\\(h \\amp r \\amp w\\)\n       \n\\(w_5\\)\n\\({\\sim}h \\amp r \\amp w\\) \n\n\\(w_2\\)\n\\(h \\amp r \\amp{\\sim}w\\)\n       \n\\(w_6\\)\n\\({\\sim}h \\amp r \\amp{\\sim}w\\) \n\n\\(w_3\\)\n\\(h \\amp{\\sim}r \\amp w\\)\n         \n\\(w_7\\)\n\\({\\sim}h \\amp{\\sim}r \\amp w\\) \n\n\\(w_4\\)\n\\(h \\amp{\\sim}r \\amp{\\sim}w\\)\n         \n\\(w_8\\)\n\\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\)  \n\n\nWorlds differ in the distributions of these traits, and a natural,\nalbeit simple, suggestion is to measure the likeness between two\nworlds by the number of agreements on traits. This is tantamount to\ntaking distance to be measured by the size of the symmetric difference\nof generating states – the so-called city-block measure. As is\nwell known, this will generate a genuine metric, in particular\nsatisfying the triangular inequality. If \\(w_1\\) is the actual world\nthis immediately induces a system of nested spheres, but one in which\nthe spheres come with numbers attached:\n\n\n\nDiagram 6. Similarity circles for the\nweather space\n\n\nThose worlds orbiting on the sphere \\(n\\) are of distance \\(n\\) from\nthe actual world.\n\nIn fact, the structure of the space is better represented not by\nsimilarity circles, but rather by a three-dimensional cube:\n\n\n\nDiagram 7. The three-dimensional weather\nspace\n\n\nThis way of representing the space makes a clearer connection between\ndistances between worlds and the role of the atomic propositions in\ngenerating those distances through the city-block metric. It also\neliminates inaccuracies in the relations between the worlds that are\nnot at the center that the similarity circle diagram suggests.\n1.4.2 The likeness of a proposition to the truth\n\nNow that we have numerical distances between worlds, numerical\nmeasures of propositional likeness to, and distance from, the truth\ncan be defined as some function of the distances, from the actual\nworld, of worlds in the range of a proposition. But which function is\nthe right one? This is the extension problem.\n\nSuppose that \\(h \\amp r \\amp w\\) is the whole truth about the weather.\nFollowing Hilpinen, we might consider overall distance of a\npropositions from the truth to be some function of the distances from\nactuality of two extreme worlds. Let truth\\((A)\\) be the\ntruth value of \\(A\\) in the actual world. Let min\\((A)\\) be\nthe distance from actuality of that world in \\(A\\) closest to the\nactual world, and max\\((A)\\) be the distance from actuality\nof that world in \\(A\\) furthest from the actual world. Table 1 display\nthe values of the min and max functions for some\nrepresentative propositions.\n\n\n\n\n\\(\\boldsymbol{A}\\)\ntruth\\((\\boldsymbol{A})\\)\nmin\\((\\boldsymbol{A})\\)\nmax\\((\\boldsymbol{A})\\) \n\n\\(h \\amp r \\amp w\\)\ntrue\n0\n0 \n\n\\(h \\amp r\\)\ntrue\n0\n1 \n\n\\(h \\amp r \\amp{\\sim}\\)w\nfalse\n1\n1 \n\n\\(h\\)\ntrue\n0\n2 \n\n\\(h \\amp{\\sim}r\\)\nfalse\n1\n2 \n\n\\({\\sim}h\\)\nfalse\n1\n3 \n\n\\({\\sim}h \\amp{\\sim}r \\amp w\\)\nfalse\n2\n2 \n\n\\({\\sim}h \\amp{\\sim}r\\)\nfalse\n2\n3 \n\n\\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\)\nfalse\n3\n3  \n\n\nTable 1. The min and\nmax functions.\n\n\nThe simplest proposal (made first in Niiniluoto 1977) would be to take\nthe average of the min and the max (call this\nmeasure min-max-average). This would remedy a rather glaring\nshortcoming which Hilpinen’s qualitative proposal shares with\nPopper’s proposal, namely that no falsehood is closer to the\ntruth than any truth (even the worthless tautology). This numerical\nequivalent of Hilpinen’s proposal renders all propositions\ncomparable for truthlikeness, and some falsehoods it deems more\ntruthlike than some truths.\n\nBut now that we have distances between all worlds, why take only the\nextreme worlds in a proposition into account? Why shouldn’t\nevery world in a proposition potentially count towards its overall\ndistance from the actual world?\n\nA simple measure which does count all worlds is average distance from\nthe actual world. Average delivers all of the particular\njudgements we used above to motivate Hilpinen’s proposal in the\nfirst place, and in conjunction with the simple metric on worlds it\ndelivers the following ordering of propositions in our simple\nframework:\n\n\n\n\n\\(\\boldsymbol{A}\\)\ntruth\\((\\boldsymbol{A})\\)\naverage\\((\\boldsymbol{A})\\) \n\n\\(h \\amp r \\amp w\\)\ntrue\n0 \n\n\\(h \\amp r\\)\ntrue\n0.5 \n\n\\(h \\amp r \\amp{\\sim}\\)w\nfalse\n1.0 \n\n\\(h\\)\ntrue\n1.3 \n\n\\(h \\amp{\\sim}r\\)\nfalse\n1.5 \n\n\\({\\sim}h\\)\nfalse\n1.7 \n\n\\({\\sim}h \\amp{\\sim}r \\amp w\\)\nfalse\n2.0 \n\n\\({\\sim}h \\amp{\\sim}r\\)\nfalse\n2.5 \n\n\\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\)\nfalse\n3.0  \n\n\nTable 2. The average\nfunction.\n\n\nThis ordering looks promising. Propositions are closer to the truth\nthe more they get the basic weather traits right, further away the\nmore mistakes they make. A false proposition may be made either worse\nor better by strengthening \\((h \\amp r \\amp{\\sim}w\\) is better than\n\\({\\sim}w\\) while \\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\) is worse). A\nfalse proposition (like \\(h \\amp r \\amp{\\sim}w)\\) can be closer to the\ntruth than some true propositions (like \\(h)\\). And so on.\n\nThese judgments may be sufficient to show that average is\nsuperior to min-max-average, at least on this group of\npropositions, but they are clearly not sufficient to show that\naveraging is the right procedure. What we need are some\nstraightforward and compelling general desiderata which jointly yield\na single correct function. In the absence of such a proof, we can only\nresort to case by case comparisons.\n\nFurthermore average has not found universal favor. Notably,\nthere are pairs of true propositions such that average deems\nthe stronger of the two to be the further from the truth. According to\naverage, the tautology is not the true proposition furthest\nfrom the truth. Averaging thus violates the Popperian principle of the\nvalue of content for truths, see Table 3 for an example.\n\n\n\n\n\\(\\boldsymbol{A}\\)\ntruth\\((\\boldsymbol{A})\\)\naverage\\((\\boldsymbol{A})\\) \n\n\\(h \\vee{\\sim}r \\vee w\\)\ntrue\n1.4 \n\n\\(h \\vee{\\sim}r\\)\ntrue\n1.5 \n\n\\(h \\vee{\\sim}h\\)\ntrue\n1.5  \n\n\nTable 3. average violates the\nvalue of content for truths.\n\n\nLet’s then consider other measures, like the sum\nfunction – the sum of the distances of worlds in the range of a\nproposition from the actual world (Table 4).\n\n\n\n\n\\(\\boldsymbol{A}\\)\ntruth\\((\\boldsymbol{A})\\)\nsum\\((\\boldsymbol{A})\\) \n\n\\(h \\amp r \\amp w\\)\ntrue\n0 \n\n\\(h \\amp r\\)\ntrue\n1 \n\n\\(h \\amp r \\amp{\\sim}\\)w\nfalse\n1 \n\n\\(h\\)\ntrue\n4 \n\n\\(h \\amp{\\sim}r\\)\nfalse\n3 \n\n\\({\\sim}h\\)\nfalse\n8 \n\n\\({\\sim}h \\amp{\\sim}r \\amp w\\)\nfalse\n2 \n\n\\({\\sim}h \\amp{\\sim}r\\)\nfalse\n5 \n\n\\(h \\amp{\\sim}r \\amp{\\sim}w\\)\nfalse\n3  \n\n\nTable 4. The sum function.\n\n\nThe sum function is an interesting measure in its own right.\nWhile, like average, it is sensitive to the distances of\nall worlds in a proposition from the actual world, it is not plausible\nas a measure of distance from the truth, and indeed no one has\nproposed it as such a measure. What sum does measure is a\ncertain kind of distance-weighted logical weakness. In\ngeneral the weaker a proposition is, the larger its sum\nvalue. But adding words far from the actual world makes the\nsum value larger than adding worlds closer to it. This\nguarantees, for example, that of two truths the sum of the\nlogically weaker is always greater than the sum of the\nstronger. Thus sum might play a role in capturing the value\nof content for truths. But it also delivers the implausible value of\ncontent for falsehoods. If you think that there is anything to the\nlikeness program it is hardly plausible that the falsehood \\({\\sim}h\n\\amp{\\sim}r \\amp{\\sim}w\\) is closer to the truth than its consequence\n\\({\\sim}h\\). Niiniluoto argues that sum is a good\nlikeness-based candidate for measuring Hilpinen’s\n“information factor”. It is obviously much more sensitive\nthan is max to the proposition’s informativeness about\nthe location of the truth.\n\nNiiniluoto thus proposes, as a measure of distance from the truth, the\naverage of this information factor and Hilpinen’s truth factor:\nmin-sum-average. Averaging the more sensitive information\nfactor (sum) and the closeness-to-being-true factor\n(min) yields some interesting results (see Table 5).\n\n\n\n\n\\(\\boldsymbol{A}\\)\ntruth\\((\\boldsymbol{A})\\)\nmin-sum-average\\((\\boldsymbol{A})\\)\n\n\n\\(h \\amp r \\amp w\\)\ntrue\n0 \n\n\\(h \\amp r\\)\ntrue\n0.5 \n\n\\(h \\amp r \\amp{\\sim}\\)w\nfalse\n1 \n\n\\(h\\)\ntrue\n2 \n\n\\(h \\amp{\\sim}r\\)\nfalse\n2 \n\n\\({\\sim}h\\)\nfalse\n4.5 \n\n\\({\\sim}h \\amp{\\sim}r \\amp w\\)\nfalse\n2 \n\n\\({\\sim}h \\amp{\\sim}r\\)\nfalse\n3.5 \n\n\\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\)\nfalse\n3  \n\n\nTable 5. The min-sum-average\nfunction.\n\n\nFor example, this measure deems \\(h \\amp r \\amp w\\) more truthlike\nthan \\(h \\amp r\\), and the latter more truthlike than \\(h\\). And in\ngeneral min-sum-average delivers the value of content for\ntruths. For any two truths the min factor is the same (0),\nand the sum factor increases as content decreases.\nFurthermore, unlike the symmetric difference measures,\nmin-sum-average doesn’t deliver the objectionable value\nof contents for falsehoods. For example, \\({\\sim}h \\amp{\\sim}r\n\\amp{\\sim}w\\) is deemed further from the truth than \\({\\sim}h\\). But\nmin-sum-average is not quite home free, at least from an\nintuitive point of view. For example, \\({\\sim}h \\amp{\\sim}r\n\\amp{\\sim}w\\) is deemed closer to the truth than \\({\\sim}h\n\\amp{\\sim}r\\). This is because what \\({\\sim}h \\amp{\\sim}r\n\\amp{\\sim}w\\) loses in closeness to the actual world (min) it\nmakes up for by an increase in strength (sum).\n\nIn deciding how to proceed here we confront a methodological problem.\nThe methodology favored by Tichý is very much bottom-up. For\nthe purposes of deciding between rival accounts it takes the intuitive\ndata very seriously. Popper (along with Popperians like Miller) favor\na more top-down approach. They are suspicious of folk intuitions, and\nsometimes appear to be in the business of constructing a new concept\nrather than explicating an existing one. They place enormous weight on\ncertain plausible general principles, largely those that fit in with\nother principles of their overall theory of science: for example, the\nprinciple that strength is a virtue and that the stronger of two true\ntheories (and maybe even of two false theories) is the closer to the\ntruth. A third approach, one which lies between these two extremes, is\nthat of reflective equilibrium. This recognizes the claims of both\nintuitive judgements on low-level cases, and plausible high-level\nprinciples, and enjoins us to bring principle and judgement into\nequilibrium, possibly by tinkering with both. Neither intuitive\nlow-level judgements nor plausible high-level principles are given\nadvance priority. The protagonist in the truthlikeness debate who has\nargued most consistently for this approach is Niiniluoto.\n\nHow might reflective equilibrium be employed to help resolve the\ncurrent dispute? Consider a different space of possibilities,\ngenerated by a single magnitude like the number of the planets\n\\((N).\\) Suppose that \\(N\\) is in fact 8 and that the further \\(n\\) is\nfrom 8, the further the proposition that \\(N=n\\) from the Truth.\nConsider the three sets of propositions in Table 6. In the left-hand\ncolumn we have a sequence of false propositions which, intuitively,\ndecrease in truthlikeness while increasing in strength. In the middle\ncolumn we have a sequence of corresponding true propositions, in each\ncase the strongest true consequence of its false counterpart on the\nleft (Popper’s “truth content”). Again members of\nthis sequence steadily increase in strength. Finally on the right we\nhave another column of falsehoods. These are also steadily increasing\nin strength, and like the left-hand falsehoods, seem (intuitively) to\nbe decreasing in truthlikeness as well.\n\n\n\n\nFalsehood (1)\nStrongest True Consequence\nFalsehood (2) \n\n\\(10 \\le N \\le 20\\)\n\\(N=8\\) or \\(10 \\le N \\le 20\\)\n\\(N=9\\) or \\(10 \\le N \\le 20\\) \n\n\\(11 \\le N \\le 20\\)\n\\(N=8\\) or \\(11 \\le N \\le 20\\)\n\\(N=9\\) or \\(11 \\le N \\le 20\\) \n\n……\n……\n…… \n\n\\(19 \\le N \\le 20\\)\n\\(N=8\\) or \\(19 \\le N \\le 20\\)\n\\(N=9\\) or \\(19 \\le N \\le 20\\) \n\n\\(N= 20\\)\n\\(N=8\\) or \\(N= 20\\)\n\\(N=9\\) or \\(N= 20\\)  \n\n\nTable 6.\n\n\nJudgements about the closeness of the true propositions in the center\ncolumn to the truth may be less intuitively clear than are judgments\nabout their left-hand counterparts. However, it would seem highly\nincongruous to judge the truths in Table 6 to be steadily increasing\nin truthlikeness, while the falsehoods both to the left and the right,\nboth marginally different in their overall likeness relations to\ntruth, steadily decrease in truthlikeness. This suggests that that all\nthree are sequences of steadily increasing strength combined with\nsteadily decreasing truthlikeness. And if that’s right,\nit might be enough to overturn Popper’s principle that amongst\ntrue theories strength and truthlikeness must covary (even while\ngranting that this is not so for falsehoods).\n\nIf this argument is sound, it removes an objection to averaging\ndistances, but it does not settle the issue in its favor, for there\nmay still be other more plausible counterexamples to averaging that we\nhave not considered.\n\nSchurz and Weingartner argue that this extension problem is the main\ndefect of the likeness approach:\n\nthe problem of extending truthlikeness from possible worlds to\npropositions is intuitively underdetermined. Even if we are granted an\nordering or a measure of distance on worlds, there are many very\ndifferent ways of extending that to propositional distance, and\napparently no objective way to decide between them. (Schurz and\nWeingartner 2010, 423)\n\n\nOne way of answering this objection head on is to identify principles\nthat, given a distance function on worlds, constrain the distances\nbetween worlds and sets of worlds, principles perhaps powerful enough\nto identify a unique extension.\n\nApart from the extension problem, two other issues affect the likeness\napproach. The first is how to apply it beyond simple propositional\nexamples as the ones considered above (Popper’s content\napproach, whatever else its shortcomings, can be applied in principle\nto theories expressible in any language, no matter how sophisticated).\nWe discuss this in the supplement on\n Extending the likeness approach to first-order and higher-order frameworks.\n\nThe second has to do with the fact that assessments of relative\nlikeness are sensitive to how the framework underlying the logical\nspace is defined. This “framework dependence” issue is\ndiscussed in the next section.\n1.4.3 The framework dependence of likeness\n\nThe single most powerful and influential argument against the whole\nlikeness approach is the charge that it is “language\ndependent” or “framework dependent” (Miller 1974a,\n197 a, 1976, and most recently defended, vigorously as usual, in his\n2006). Early formulations of the likeness approach (Tichý 1974,\n1976, Niiniluoto 1976) proceeded in terms of syntactic surrogates for\ntheir semantic correlates – sentences for propositions,\npredicates for properties, constituents for partitions of the logical\nspace, and the like. The question naturally arises, then, whether we\nobtain the same measures if all the syntactic items are translated\ninto an essentially equivalent language – one capable of\nexpressing the same propositions and properties with a different set\nof primitive predicates. Newton’s theory can be formulated with\na variety of different primitive concepts, but these formulations are\ntypically taken to be equivalent. If the degree of truthlikeness of\nNewton’s theory were to vary from one such formulation to\nanother, then while such a concept might still might have useful\napplications, it would hardly help to vindicate realism.\n\nTake our simple weather-framework above. This trafficks in three\nprimitives – hot, rainy, and windy.\nSuppose, however, that we define the following two new weather\nconditions:\n\n\nminnesotan \\( =_{df}\\) hot if and only if\nrainy\n\narizonan \\( =_{df}\\) hot if and only if\nwindy\n\n\nNow it appears as though we can describe the same sets of weather\nstates in the new \\(h\\)-\\(m\\)-\\(a\\)-ese language based on the above\nconditions. Table 7 shows the translations of four representative\ntheories between the two languages.\n\n\n\n\n \n\\(h\\)-\\(r\\)-\\(w\\)-ese\n\\(h\\)-\\(m\\)-\\(a\\)-ese \n\n\\(T\\)\n\\(h \\amp r \\amp w\\)\n\\(h \\amp m \\amp a\\) \n\n\\(A\\)\n\\({\\sim}h \\amp r \\amp w\\)\n\\({\\sim}h \\amp{\\sim}m \\amp{\\sim}a\\) \n\n\\(B\\)\n\\({\\sim}h \\amp{\\sim}r \\amp w\\)\n\\({\\sim}h \\amp m \\amp{\\sim}a\\) \n\n\\(C\\)\n\\({\\sim}h \\amp{\\sim}r \\amp{\\sim}w\\)\n\\({\\sim}h \\amp m \\amp a\\)  \n\n\nTable 7.\n\n\nIf \\(T\\) is the truth about the weather then theory \\(A\\), in\n\\(h\\)-\\(r\\)-\\(w\\)-ese, seems to make just one error concerning the\noriginal weather states, while \\(B\\) makes two and \\(C\\) makes three.\nHowever, if we express these two theories in \\(h\\)-\\(m\\)-\\(a\\)-ese\nhowever, then this is reversed: \\(A\\) appears to make three errors and\n\\(B\\) still makes two and \\(C\\) makes only one error. But that means\nthe account makes truthlikeness, unlike truth, radically\nlanguage-relative.\n\nThere are two live responses to this criticism. But before detailing\nthem, note a dead one: the likeness theorist cannot object that\n\\(h\\)-\\(m\\)-\\(a\\) is somehow logically inferior to \\(h\\)-\\(r\\)-\\(w\\),\non the grounds that the primitives of the latter are essentially\n“biconditional” whereas the primitives of the former are\nnot. This is because there is a perfect symmetry between the two sets\nof primitives. Starting within \\(h\\)-\\(m\\)-\\(a\\)-ese we can arrive at\nthe original primitives by exactly analogous definitions:\n\nrainy \\( =_{df}\\) hot if and only if\nminnesotan\n\nwindy \\( =_{df}\\) hot if and only if\narizonan\n\n\nThus if we are going to object to \\(h\\)-\\(m\\)-\\(a\\)-ese it will have\nto be on other than purely logical grounds.\n\nFirstly, then, the likeness theorist could maintain that certain\npredicates (presumably “hot”, “rainy” and\n“windy”) are primitive in some absolute, realist, sense.\nSuch predicates “carve reality at the joints” whereas\nothers (like “minnesotan” and “arizonan”) are\ngerrymandered affairs. With the demise of predicate nominalism as a\nviable account of properties and relations this approach is not as\nunattractive as it might have seemed in the middle of the last\ncentury. Realism about universals is certainly on the rise. While this\nversion of realism presupposes a sparse theory of properties –\nthat is to say, it is not the case that to every definable predicate\nthere corresponds a genuine universal – such theories have been\nchampioned both by those doing traditional a priori metaphysics of\nproperties (e.g. Bealer 1982) as well as those who favor a more\nempiricist, scientifically informed approach (e.g. Armstrong 1978,\nTooley 1977). According to Armstrong, for example, which predicates\npick out genuine universals is a matter for developed science. The\nprimitive predicates of our best fundamental physical theory will give\nus our best guess at what the genuine universals in nature are. They\nmight be predicates like electron or mass, or more likely something\neven more abstruse and remote from the phenomena – like the\nprimitives of String Theory.\n\nOne apparently cogent objection to this realist solution is that it\nwould render the task of empirically estimating degree of\ntruthlikeness completely hopeless. If we know a priori which\nprimitives should be used in the computation of distances between\ntheories it will be difficult to estimate truthlikeness, but not\nimpossible. For example, we might compute the distance of a theory\nfrom the various possibilities for the truth, and then make a weighted\naverage, weighting each possible true theory by its probability on the\nevidence. That would be the credence-mean estimate of truthlikeness\n(see §2). However, if we don’t even know which features\nshould count towards the computation of similarities and distances\nthen it appears that we cannot get off first base.\n\nTo see this consider our simple weather frameworks. Suppose that all I\nlearn is that it is rainy. Do I thereby have some grounds for thinking\n\\(A\\) is closer to the truth than \\(B\\)? I would if I also knew that\n\\(h\\)-\\(r\\)-\\(w\\)-ese is the language for calculating distances. For\nthen, whatever the truth is, \\(A\\) makes one fewer mistake than \\(B\\)\nmakes. \\(A\\) gets it right on the rain factor, while \\(B\\)\ndoesn’t, and they must score the same on the other two factors\nwhatever the truth of the matter. But if we switch to\n\\(h\\)-\\(m\\)-\\(a\\)-ese then \\(A\\)’s epistemic superiority is no\nlonger guaranteed. If, for example, \\(T\\) is the truth then \\(B\\) will\nbe closer to the truth than \\(A\\). That’s because in the\n\\(h\\)-\\(m\\)-\\(a\\) framework raininess as such doesn’t count in\nfavor or against the truthlikeness of a proposition.\n\nThis objection would fail if there were empirical indicators not just\nof which atomic states obtain, but also of which are the genuine ones,\nthe ones that really carve reality at the joints. Obviously the\nframework would have to contain more than just \\(h, m\\) and \\(a\\). It\nwould have to contain resources for describing the states that\nindicate whether these were genuine universals. Maybe whether they\nenter into genuine causal relations will be crucial, for example. Once\nwe can distribute probabilities over the candidates for the real\nuniversals, then we can use those probabilities to weight the various\npossible distances which a hypothesis might be from any given\ntheory.\n\nThe second live response is both more modest and more radical. It is\nmore modest in that it is not hostage to the objective priority of a\nparticular conceptual scheme, whether that priority is accessed a\npriori or a posteriori. It is more radical in that\nit denies a premise of the invariance argument that at first blush is\napparently obvious. It denies the equivalence of the two conceptual\nschemes. It denies that \\(h \\amp r \\amp w\\), for example, expresses\nthe very same proposition as \\(h \\amp m \\amp a\\) expresses. If we deny\ntranslatability then we can grant the invariance principle, and grant\nthe judgements of distance in both cases, but remain untroubled. There\nis no contradiction (Tichý 1978).\n\nAt first blush this response seems somewhat desperate. Haven’t\nthe respective conditions been defined in such a way that\nthey are simple equivalents by fiat? That would, of course, be the\ncase if \\(m\\) and \\(a\\) had been introduced as defined terms into\n\\(h\\)-\\(r\\)-\\(w\\). But if that were the intention then the likeness\ntheorist could retort that the calculation of distances should proceed\nin terms of the primitives, not the introduced terms. However, that is\nnot the only way the argument can be read. We are asked to contemplate\ntwo partially overlapping sequences of conditions, and two spaces of\npossibilities generated by those two sequences. We can thus think of\neach possibility as a point in a simple three dimensional space. These\npoints are ordered triples of 0s and 1s, the \\(n\\)th entry being 0 if\nthe \\(n\\)th condition is satisfied and 1 if it isn’t. Thinking\nof possibilities in this way, we already have rudimentary geometrical\nfeatures generated simply by the selection of generating conditions.\nPoints are adjacent if they differ on only one dimension. A path is a\nsequence of adjacent points. A point \\(q\\) is between two points \\(p\\)\nand \\(r\\) if \\(q\\) lies on a shortest path from \\(p\\) to \\(r\\). A\nregion of possibility space is convex if it is closed under the\nbetweenness relation – anything between two points in the region\nis also in the region (Oddie 1987, Goldstick and O’Neill\n1988).\n\nEvidently we have two spaces of possibilities, S1 and S2, and the\nquestion now arises whether a sentence interpreted over one of these\nspaces expresses the very same thing as any sentence interpreted over\nthe other. Does \\(h \\amp r \\amp w\\) express the same thing as \\(h \\amp\nm \\amp a\\)? \\(h \\amp r \\amp w\\) expresses (the singleton of) \\(u_1\\)\n(which is the entity \\(\\langle 1,1,1\\rangle\\) in S1 or \\(\\langle\n1,1,1\\rangle_{S1})\\) and \\(h \\amp m \\amp a\\) expresses \\(v_1\\) (the\nentity \\(\\langle 1,1,1\\rangle_{S2}). {\\sim}h \\amp r \\amp w\\) expresses\n\\(u_2 (\\langle 0,1,1\\rangle_{S1})\\), a point adjacent to that\nexpressed by \\(h \\amp r \\amp w\\). However \\({\\sim}h \\amp{\\sim}m\n\\amp{\\sim}a\\) expresses \\(v_8 (\\langle 0,0,0\\rangle_{S2})\\), which is\nnot adjacent to \\(v_1 (\\langle 1,1,1\\rangle_{S2})\\). So now we can\nconstruct a simple proof that the two sentences do not express the\nsame thing.\n\n\\(u_1\\) is adjacent to \\(u_2\\).\n\\(v_1\\) is not adjacent to \\(v_8\\).\nTherefore, either \\(u_1\\) is not identical to \\(v_1\\), or\n\\(u_2\\) is not identical \\(v_8\\).\nTherefore, either \\(h \\amp r \\amp w\\) and \\(h \\amp m \\amp\na\\) do not express the same proposition, or \\({\\sim}h \\amp r \\amp w\\)\nand \\({\\sim}h \\amp{\\sim}m \\amp{\\sim}a\\) do not express the same\nproposition.\n\n\nThus at least one of the two required intertranslatability claims\nfails, and \\(h\\)-\\(r\\)-\\(w\\)-ese is not intertranslatable with\n\\(h\\)-\\(m\\)-\\(a\\)-ese. The important point here is that a space of\npossibilities already comes with a structure and the points in such a\nspace cannot be individuated without reference to rest of the space\nand its structure. The identity of a possibility is bound up with its\ngeometrical relations to other possibilities. Different relations,\ndifferent possibilities. This kind of response has also been endorsed\nin the very different truth-maker proposal put forward in Fine (2021,\n2022).\n\nThis kind of rebuttal to the Miller argument would have radical\nimplications for the comparability of actual theories that appear to\nbe constructed from quite different sets of primitives. Classical\nmechanics can be formulated using mass and position as basic, or it\ncan be formulated using mass and momentum. The classical concepts of\nvelocity and of mass are different from their relativistic\ncounterparts, even if they were “intertranslatable” in the\nway that the concepts of \\(h\\)-\\(r\\)-\\(w\\)-ese are intertranslatable\nwith \\(h\\)-\\(m\\)-\\(a\\)-ese.\n\nThis idea meshes well with recent work on conceptual spaces in\nGärdenfors (2000). Gärdenfors is concerned both with the\nsemantics and the nature of genuine properties, and his bold and\nsimple hypothesis is that properties carve out convex regions of an\n\\(n\\)-dimensional quality space. He supports this hypothesis with an\nimpressive array of logical, linguistic and empirical data. (Looking\nback at our little spaces above it is not hard to see that the convex\nregions are those that correspond to the generating (or atomic)\nconditions and conjunctions of those. See Burger and Heidema 1994.)\nWhile Gärdenfors is dealing with properties, it is not hard to\nsee that similar considerations apply to propositions, since\npropositions can be regarded as 0-ary properties.\n\nUltimately, however, this response may seem less than entirely\nsatisfactory by itself. If the choice of a conceptual space is merely\na matter of taste then we may be forced to embrace a radical kind of\nincommensurability. Those who talk \\(h\\)-\\(r\\)-\\(w\\)-ese and\nconjecture \\({\\sim}h \\amp r \\amp w\\) on the basis of the available\nevidence will be close to the truth. Those who talk\n\\(h\\)-\\(m\\)-\\(a\\)-ese while exposed to the “same”\ncircumstances would presumably conjecture \\({\\sim}h \\amp{\\sim}m\n\\amp{\\sim}a\\) on the basis of the “same” evidence (or the\ncorresponding evidence that they gather). If in fact \\(h \\amp r \\amp\nw\\) is the truth (in \\(h\\)-\\(r\\)-\\(w\\)-ese) then the \\(h\\)-\\(r\\)-\\(w\\)\nweather researchers will be close to the truth. But the\n\\(h\\)-\\(m\\)-\\(a\\) researchers will be very far from the truth.\n\nThis may not be an explicit contradiction, but it should be worrying\nall the same. Realists started out with the ambition of defending a\nconcept of truthlikeness which would enable them to embrace both\nfallibilism and optimism. But what the likeness theorists seem to have\nended up with here is something that suggests a rather unpalatable\nincommensurability of competing conceptual frameworks. To avoid this,\nthe realist will need to affirm that some conceptual frameworks really\nare better than others. Some really do “carve reality at the\njoints” and others don’t. But is that something the\nrealist should be reluctant to affirm?\n2. The Epistemological Problem\n\nThe quest to nail down a viable concept of truthlikeness is motivated,\nat least in part, by fallibilism (§1.1). It is certainly true\nthat a viable notion of distance from the truth\nrenders progress in an inquiry through a succession of false\ntheories at least possible. It is also true that if there is no such\nviable notion, then truth can be retained as the goal of inquiry only\nat the cost of making partial progress towards it virtually\nimpossible. But does the mere possibility of making progress\ntowards the truth improve our epistemic lot? Some have argued that it\ndoesn’t (see for example Laudan 1977, Cohen 1980, Newton-Smith\n1981). One common argument can be recast in the form of a simple\ndilemma. Either we can ascertain the truth, or we can’t. If we\ncan ascertain the truth then we do not need a concept of truthlikeness\n– it is an entirely useless addition to our intellectual\nrepertoire. But if we cannot ascertain the truth, then we cannot\nascertain the degree of truthlikeness of our theories either. So\nagain, the concept is useless for all practical purposes. (See the\nentry on\n scientific progress,\n especially §2.4.)\n\nConsider the second horn of this dilemma. Is it true that if we\ncan’t know what the (whole) truth of some matter is, we also\ncannot ascertain whether or not we are making progress towards it?\nSuppose you are interested in the truth about the weather tomorrow.\nSuppose you learn (from a highly reliable source) that it will be hot.\nEven though you don’t know the whole truth about the\nweather tomorrow, you do know that you have added a truth to your\nexisting corpus of weather beliefs. One does not need to be able to\nascertain the whole truth to ascertain some less-encompassing truths.\nAnd it seems to follow that you can also know you have made at least\nsome progress towards the whole weather truth.\n\nThis rebuttal is too swift. It presupposes that the addition of a new\ntruth \\(A\\) to an existing corpus \\(K\\) guarantees that your revised\nbelief \\(K\\)*\\(A\\) constitutes progress towards the truth. But whether\nor not \\(K\\)*\\(A\\) is closer to the truth than \\(K\\) depends not only\non a theory of truthlikeness but also on a theory of belief revision.\n(See also the entry on the\n logic of belief revision.)\n\nLet’s consider a simple case. Suppose \\(A\\) is some newly\ndiscovered truth, and that \\(A\\) is compatible with \\(K\\). Assume that\nbelief revision in such cases is simply a matter of so-called\nexpansion – i.e., conjoining \\(A\\) to \\(K\\). Consider\nthe case in which \\(K\\) also happens to be true. Then any account of\ntruthlikeness that endorses the value of content for truths (e.g.\nNiiniluoto’s min-sum-average) guarantees that\n\\(K\\)*\\(A\\) is closer to the truth than \\(K\\). That’s a welcome\nresult, but it has rather limited application. Typically one\ndoesn’t know that \\(K\\) is true: so even if one knows that \\(A\\)\nis true, one cannot use this fact to celebrate progress.\n\nThe situation is more dire when it comes to falsehoods. If \\(K\\) is in\nfact false then, without the disastrous principle of the value of\ncontent for falsehoods, there is certainly no guarantee that\n\\(K\\)*\\(A\\) will constitute a step toward the truth. (And even if one\nendorsed the disastrous principle one would hardly be better off. For\nthen the addition of any proposition, whether true or false, would\nconstitute an improvement on a false theory.) Consider again the\nnumber of the planets, \\(N\\). Suppose that the truth is N\\(=8\\), and\nthat your existing corpus \\(K\\) is (\\(N=7 \\vee N=100)\\). Suppose you\nsomehow acquire the truth \\(A\\): \\(N\\gt 7\\). Then \\(K\\)*\\(A\\) is\n\\(N=100\\), which (on average, min-max-average and\nmin-sum-average) is further from the truth than \\(K\\). So\nrevising a false theory by adding truths by no means guarantees\nprogress towards the truth.\n\nFor theories that reject the value of content for truths (e.g., the\naverage proposal) the situation is worse still. Even if \\(K\\)\nhappens to be true, there is no guarantee that expanding \\(K\\) with\ntruths will constitute progress. Of course, there will be certain\ngeneral conditions under which the value of content for truths holds.\nFor example, on the average proposal, the expansion of a true\n\\(K\\) by an atomic truth (or, more generally, by a convex truth) will\nguarantee progress toward the truth.\n\nSo under very special conditions, one can know that the acquisition of\na truth will enhance the overall truthlikeness of one’s\ntheories, but these conditions are exceptionally narrow and provide at\nbest a very weak defense against the dilemma. (See Niiniluoto 2011.\nFor rather more optimistic views of the relation between truthlikeness\nand belief revision see Kuipers 2000, Lavalette, Renardel & Zwart\n2011, Cevolani, Crupi and Festa 2011, and Cevolani, Festa and Kuipers\n2013.)\n\nA different tack is to deny that a concept is useless if there is no\neffective empirical decision procedure for ascertaining whether it\napplies. For even if we cannot know for sure what the value of a\ncertain unobservable magnitude is, we might well have better or worse\nestimates of the value of the magnitude on the evidence. And\nthat may be all we need for the concept to be of practical value.\nConsider, for example, the propensity of a certain coin-tossing set-up\nto produce heads – a magnitude which, for the sake of the\nexample, we assume to be not directly observable. Any non-extreme\nvalue of this magnitude is compatible with any number of heads in a\nsequence of \\(n\\) tosses. So we can never know with certainty what the\nactual propensity is, no matter how many tosses we observe. But we can\ncertainly make rational estimates of the propensity on the basis of\nthe accumulating evidence. Suppose one’s initial state of\nignorance of the propensity is represented by an even distribution of\ncredences over the space of possibilities for the propensity (i.e.,\nthe unit interval). Using Bayes theorem and the Principal Principle,\nafter a fairly small number of tosses we can become quite confident\nthat the propensity lies in a small interval around the observed\nrelative frequency. Our best estimate of the value of the\nmagnitude is its expected value on the evidence.\n\nSimilarly, suppose we don’t and perhaps cannot know which\nconstituent is in fact true. But suppose that we do have a good\nmeasure of distance between constituents (or the elements of some\nsalient partition of the space) \\(C_i\\) and we have selected the right\nextension function. So we have a measure \\(TL(A\\mid C_i)\\)of the\ntruthlikeness of a proposition \\(A\\) given that constituent \\(C_i\\) is\ntrue. Provided we also have a measure of epistemic probability \\(P\\)\n(where \\(P(C_i\\mid e)\\) is the degree of rational credence in \\(C_i\\)\ngiven evidence \\(e)\\) we also have a measure of the expected\ndegree of truthlikeness of \\(A\\) on the evidence (call this\n\\(\\mathbf{E}TL(A\\mid e))\\) which we can identify with the best\nepistemic estimate of truthlikeness. (Niiniluoto, who first explored\nthis concept in his 1977, calls the epistemic estimate of degree of\ntruthlikeness on the evidence, or expected degree of truthlikeness,\nverisimilitude. Since verisimilitude is typically\ntaken to be a synonym for truthlikeness, we will not follow\nhim in this, and will stick instead with expected\ntruthlikeness for the epistemic notion. See also Maher\n(1993).) \n\\[ \\mathbf{E}TL(A\\mid e) = \\sum_i TL(A\\mid C_i)\\times P(C_i \\mid e). \\]\n\n\nClearly, the expected degree of truthlikeness of a proposition \\(is\\)\nepistemically accessible, and it can serve as our best empirical\nestimate of the objective degree of truthlikeness. Progress occurs in\nan inquiry when actual truthlikeness increases. And apparent progress\noccurs when the expected degree of truthlikeness increases. (See the\nentry on\n scientific progress,\n §2.5.) This notion of expected truthlikeness is comparable to,\nbut sharply different from, that of epistemic probability: the\nsupplement on\n Expected Truthlikeness\n discusses some instructive differences between the two concepts.\n\nWith this proposal, Niiniluoto also made a connection with the\napplication of decision theory to epistemology. Decision theory is an\naccount of what it is rational to do in light of one’s beliefs\nand desires. One’s goal, it is assumed, is to maximize utility.\nBut given that one does not have perfect information about the state\nof the world, one cannot know for sure how to accomplish that. Given\nuncertainty, the rule to maximize utility or value cannot be applied\nin normal circumstances. So under conditions of uncertainty, what it\nis rational to do, according to the theory, is to maximize\nsubjective expected utility. Starting with Hempel’s\nclassic 1960 essay, epistemologists conjectured that\ndecision-theoretic tools might be applied to the problem of theory\nacceptance – which hypothesis it is rational to accept\non the basis of the total available evidence to hand. But, as Hempel\nargued, the values or utilities involved in a decision to accept a\nhypothesis cannot be simply regular practical values. These are\ntypically thought to be generated by one’s desires for various\nstates of affairs to obtain in the world. But the fact that one would\nvery much like a certain favored hypothesis to be true does not\nincrease the cognitive value of accepting that hypothesis.\n\nThis much is clear: the utilities should reflect the value or disvalue\nwhich the different outcomes have from the point of view of pure\nscientific research rather than the practical advantages or\ndisadvantages that might result from the application of an accepted\nhypothesis, according as the latter is true or false. Let me refer to\nthe kind of utilities thus vaguely characterized as purely scientific,\nor epistemic, utilities. (Hempel 1960, 465)\n\n\nIf we had a decent theory of epistemic utility (also known as\ncognitive utility or cognitive value), perhaps what\nhypotheses one ought to accept, or what experiments one ought to\nperform, or how one ought to revise one’s corpus of belief in\nthe light of new information, could be determined by the rule:\nmaximize expected epistemic utility (or maximize expected cognitive\nvalue). Thus decision-theoretic epistemology was born.\n\nHempel went on to ask what epistemic utilities are implied in the\nstandard conception of scientific inquiry –\n“…construing the proverbial ’pursuit of\ntruth’ in science as aimed at the establishment of a maximal\nsystem of true statements…” Hempel (1960), p 465)\n\nAlready we have here the germ of the idea central to the truthlikeness\nprogram: that the goal of an inquiry is to end up accepting (or\n“establishing”) the theory that yields the whole truth of\nsome matter. It is interesting that, around the same time that Popper\nwas trying to articulate a content-based account of truthlikeness,\nHempel was attempting to characterize partial fulfillment of the goal\n(that is, of maximally contentful truth) in terms of some combination\nof truth and content. These decision-theoretic considerations lead\nnaturally to a brief consideration of the axiological problem of\ntruthlikeness.\n3. The Axiological Problem \n\nOur interest in the concept of truthlikeness seems grounded in the\nvalue of highly truthlike theories. And that, in turn, seems grounded\nin the value of truth.\n\nLet’s start with the putative value of truth. Truth is not, of\ncourse, a good-making property of the objects of belief states. The\nproposition \\(h \\amp r \\amp w\\) is not a better proposition\nwhen it happens to be hot, rainy and windy than when it happens to be\ncold, dry and still. Rather, the cognitive state of believing\n\\(h \\amp r \\amp w\\) is often deemed to be a good state to be in if the\nproposition is true, not good if it is false. So the state of\nbelieving truly is better than the state of believing\nfalsely.\n\nAt least some, perhaps most, of the value of believing truly can be\naccounted for instrumentally. Desires mesh with beliefs to produce\nactions that will best achieve what is desired. True beliefs will\ngenerally do a better job of this than false beliefs. If you are\nthirsty and you believe the glass in front of you contains safe\ndrinking water rather than lethal poison then you will be motivated to\ndrink. And if you do drink, you will be better off if the belief you\nacted on was true (you quench your thirst) rather than false (you end\nup dead).\n\nWe can do more with decision theory utilizing purely practical or\nnon-cognitive values. For example, there is a well-known,\ndecision-theoretic, value-of-learning theorem, the\nRamsey-Good theorem, which partially vindicates the value of gathering\nnew information, and it does so in terms of “practical”\nvalues, without assuming any purely cognitive values. (Good 1967.)\nSuppose you have a choice to make, and you can either choose now, or\nchoose after doing some experiment. Suppose further that you are\nrational (you always choose by expected value) and that the experiment\nis cost-free. It follows that performing the experiment and then\nchoosing always has at least as much expected value as choosing\nwithout further ado. Further, doing the experiment has higher expected\nvalue if one possible outcome of the experiment would alter the\nrelative values of some your options. So, you should do the experiment\njust in case the outcome of the experiment could make a difference to\nwhat you choose to do. Of course, the expected gain of doing the\nexperiment has to be worth the expected cost. Not all information is\nworth pursuing when you have limited time and resources.\n\nDavid Miller notes the following serious limitation of the Ramsey-Good\nvalue-of-learning theorem:\n\nThe argument as it stands simply doesn’t impinge on the question\nof why evidence is collected in those innumerable cases in theoretical\nscience in which no decisions will be, or anyway are envisaged to be,\naffected. (Miller 1994, 141).\n\n\nThere are some things that we think are worth knowing about, the\nknowledge of which would not change the expected value of any action\nthat one might be contemplating performing. We spent billions of\ndollars conducting an elaborate experiment to determine whether the\nHiggs boson exists, and the results were promising enough that Higgs\nwas awarded the Nobel Prize for his prediction. The discovery may also\nyield practical benefits, but it is the cognitive change it\ninduces that makes it worthwhile. It is valuable simply for what it\ndid to our credal state – not just our credence in the existence\nof the Higgs, but our overall credal state. We may of course be wrong\nabout the Higgs – the results might be misleading – but\nfrom our new epistemic viewpoint it certainly appears to us that we\nhave made cognitive gains. We have a little bit more evidence for the\ntruth, or at least the truthlikeness, of the standard model.\n\nWhat we need, it seems, is an account of pure cognitive value, one\nthat embodies the idea that getting at the truth is itself valuable\nwhatever its practical benefits. As noted this possibility was first\nexplicitly raised by Hempel, and developed in various difference ways\nin the 1960s and 1970s by Levi (1967) and Hilpinen (1968), amongst\nothers. (For recent developments see the entry\n epistemic utility arguments for probabilism,\n §6.)\n\nWe could take the cognitive value of believing a single proposition\n\\(A\\) to be positive when \\(A\\) is true and negative when \\(A\\) is\nfalse. But acknowledging that belief comes in degrees, the idea might\nbe that the stronger one’s belief in a truth (or of one’s\ndisbelief in a falsehood), the greater the cognitive value. Let \\(V\\)\nbe the characteristic function of answers, both complete and partial,\nto the question \\(\\{C_1, C_2 , \\ldots ,C_n , \\ldots \\}\\). That is to\nsay, where \\(A\\) is equivalent to some disjunction of complete\nanswers:\n\n\\(V_i (A) = 1\\) if \\(A\\) is entailed by the complete answer\n\\(C_i\\) (i.e \\(A\\) is true according to \\(C_i)\\);\n\\(V_i (A) = 0\\) if the negation of \\(A\\) is entailed by the\ncomplete answer \\(C_i\\) (i.e., \\(A\\) is false according to\n\\(C_i)\\).\n\n\nThen the simple view is that the cognitive value of believing \\(A\\) to\ndegree \\(P(A)\\) (where \\(C_i\\) is the complete true answer) is greater\nthe closer \\(P(A)\\) is to the actual value of \\(V_i (A)\\)– that\nis, the smaller \\(|V_i (A)-P(A)|\\) is. Variants of this idea have been\nendorsed, for example by Horwich (1982, 127–9), and Goldman\n(1999), who calls this “veristic value”.\n\n\\(|V_i (A)-P(A)|\\) is a measure of how far \\(P(A)\\) is from \\(V_i\n(A)\\), and \\(-|V_i (A)-P(A)|\\) of how close it is. So here is the\nsimplest linear realization of this desideratum: \n\\[ Cv^1 _i (A, P) = - |V_i (A)-P(A)|. \\]\n\n\nBut there are of course many other measures satisfying the basic idea.\nFor example we have the following quadratic measure: \n\\[ Cv^2 _i (A, P) = -((V_i (A)- P(A))^2. \\]\n\n\nBoth \\(Cv^1\\) and \\(Cv^2\\) reach a maximum when \\(P(A)\\) is maximal\nand \\(A\\) is true, or \\(P(A)\\) is minimal and \\(A\\) is false; and a\nminimum when \\(P(A)\\) is maximal and \\(A\\) is false, or \\(P(A)\\) is\nminimal and \\(A\\) is true.\n\nThese are measures of local value – the value of\ninvesting a certain degree of belief in a single answer \\(A\\) to the\nquestion \\(Q\\). But we can agglomerate these local values into the\nvalue of a total credal state \\(P\\). This involves a substantive\nassumption: that the value of a credal state is some additive function\nof the values of the individual beliefs states it underwrites. A\ncredal state, relative to inquiry \\(Q\\), is characterized by its\ndistribution of credences over the elements of the partition \\(Q\\). An\nopinionated credal state is one that assigns credence 1 to\njust one of the complete answers. The best credal state to be in,\nrelative to the inquiry \\(Q\\), is the opinionated state that assigns\ncredence 1 to the complete correct answer. This will also assign\ncredence 1 to every true answer, and 0 to every false answer, whether\npartial or complete. In other words, if the correct answer to \\(Q\\) is\n\\(C_i\\) then the best credal state to be in is the one identical to\n\\(V_i\\): for each partial or complete answer \\(A\\) to \\(Q, P(A) = V_i\n(A)\\). This credal state is the state of believing the truth, the\nwhole truth and nothing but the truth about \\(Q\\). Other total credal\nstates (whether opinionated or not) should turn out to be less good\nthan this perfectly accurate credal state. But there will, of course,\nhave to be more constraints on the accuracy and value of total\ncognitive states.\n\nAssuming additivity, the value of the credal state \\(P\\) can be taken\nto be the (weighted) sum of the cognitive values of local belief\nstates.\n\n\\(CV_i(P) = \\sum_A \\lambda_A Cv_i(A,P)\\) (where \\(A\\) ranges over all\nthe answers, both complete and incomplete, to question \\(Q)\\), and the\n\\(\\lambda\\)-terms assign a fixed (non-contingent) weight to the\ncontribution of each answer \\(A\\) to overall accuracy.\n\n\nPlugging in either of the above local cognitive value measures, total\ncognitive value is maximal for an assignment of maximal probability to\nthe true complete answer, and falls off as confidence in the correct\nanswer falls away.\n\nSince there are many different measures that reflect the basic idea of\nthe value of true belief how are we to decide between them? We have\nhere a familiar problem of underdetermination. Joyce (1998) lays down\na number of desiderata, most of them very plausible, for a measure of\nwhat he calls the accuracy of a cognitive state. These\ndesiderata are satisfied by the \\(Cv^2\\) but not by \\(Cv^1\\). In fact\nall the members of a family of closely related measures, of which\n\\(Cv^2\\) is a member, satisfy Joyce’s desiderata:\n\n\\[ CV_i(P) = \\sum_A -\\lambda_A [(V_i (A) - P(A))^2]. \\]\n\n\nGiving equal weight to all propositions \\((\\lambda_A =\\) some non-zero\nconstant \\(c\\) for all \\(A)\\), this is equivalent to the\nBrier measure (see the entry on\n epistemic utility arguments for probabilism,\n §6). Given the \\(\\lambda\\)–weightings can vary, there is\nconsiderable flexibility in the family of admissible measures.\n\nOur main interest here is whether any of these so-called scoring\nrules (rules which score the overall accuracy of a credal state)\nmight constitute an acceptable measure of the cognitive value of a\ncredal state.\n\nAbsent specific refinements to the \\(\\lambda\\)–weightings, the\nquadratic measures seem unsatisfactory as a solution either to the\nproblem of accuracy or to the problem of cognitive value. Suppose you\nare inquiring into the number of the planets and you end up fully\nbelieving that the number of the planets is 9. Given that the correct\nanswer is 8, your credal state is not perfect. But it is pretty good,\nand it is surely a much better credal state to be in than the\nopinionated state that sets probability 1 on the number of planets\nbeing 9 billion. It seems rather natural to hold that the cognitive\nvalue of an opinionated credal state is sensitive to the degree of\ntruthlikeness of the complete answer that it fixes on, not\njust to its truth value. But this is not endorsed by\nquadratic measures.\n\nJoyce’s desiderata build in the thesis that accuracy is\ninsensitive to the distances of various different complete answers\nfrom the complete true answer. The crucial principle is\nExtensionality.\n\nOur next constraint stipulates that the “facts” which a\nperson’s partial beliefs must “fit” are exhausted by\nthe truth-values of the propositions believed, and that the only\naspect of her opinions that matter is their strengths. (Joyce 1998,\n591)\n\n\nWe have already seen that this seems wrong for opinionated states that\nconfine all probability to a false hypothesis. Being convinced that\nthe number of planets in the solar system is 9 is better than being\nconvinced that it is 9 billion. But the same idea holds for truths.\nSuppose you believe truly that the number of the planets is either 7,\n8, 9 or 9 billion. This can be true in four different ways. If the\nnumber of the planets is 8 then, intuitively, your belief is a little\nbit closer to the truth than if it is 9 billion. (This judgment is\nendorsed by both the average and the min-sum-average\nproposals.) So even in the case of a true answer to some query, the\nvalue of believing that truth can depend not just on its truth and the\nstrength of the belief, but on where the truth lies. If this is right\nExtensionality is misguided.\n\nJoyce considers a variant of this objection: namely, that given\nExtensionality Kepler’s beliefs about planetary motion would be\njudged to be no more accurate than Copernicus’s. His response is\nthat there will always be propositions which distinguish between the\naccuracy of these falsehoods:\n\nI am happy to admit that Kepler held more accurate beliefs than\nCopernicus did, but I think the sense in which they were more accurate\nis best captured by an extensional notion. While Extensionality rates\nKepler and Copernicus as equally inaccurate when their false beliefs\nabout the earth’s orbit are considered apart from their effects\non other beliefs, the advantage of Kepler’s belief has to do\nwith the other opinions it supports. An agent who strongly believes\nthat the earth’s orbit is elliptical will also strongly believe\nmany more truths than a person who believes that it is circular (e.g.,\nthat the average distance from the earth to the sun is different in\ndifferent seasons). This means that the overall effect of\nKepler’s inaccurate belief was to improve the extensional\naccuracy of his system of beliefs as a whole. Indeed, this is why his\ntheory won the day. I suspect that most intuitions about falsehoods\nbeing “close to the truth” can be explained in this way,\nand that they therefore pose no real threat to Extensionality. (Joyce\n1998, 592)\n\n\nUnfortunately, this contention – that considerations of accuracy\nover the whole set of answers which the two theories give will sort\nthem into the right ranking – isn’t correct (Oddie\n2019).\n\nWallace and Greaves (2005) assert that the weighted quadratic measures\n“can take account of the value of verisimilitude.” They\nsuggest this can be done “by a judicious choice of the\ncoefficients” (i.e., the \\(\\lambda\\)–values). They go on\nto say: “… we simply assign high \\(\\lambda_A\\) when \\(A\\)\nis a set of ’close’ states.” (Wallace and Greaves\n2005, 628). ’Close’ here presumably means ’close to\nthe actual world’. But whether an answer \\(A\\) contains complete\nanswers that are close to the actual world – that is, whether\n\\(A\\) is truthlike – is clearly a world-dependent\nmatter. The coefficients \\(\\lambda_A\\) were not intended by the\nauthors to be world-dependent. (But whether or not the co-efficients\nof world-dependent or world-independent the quadratic measures cannot\ncapture truthlikeness. See Oddie 2019.)\n\nOne defect of the quadratic class of measures, combined with\nworld-independent weights, corresponds to a problem familiar from the\ninvestigation of attempts to capture truthlikeness simply in terms of\nclasses of true and false consequences, or in terms of truth value and\ncontent alone. Any two complete false answers yield precisely the same\nnumber of true consequences and the same number of false consequences.\nThe local quadratic measure accords the same value to each true answer\nand the same disvalue to each false answer. So if, for example, all\nanswers are given the same \\(\\lambda\\)–weighting in the global\nquadratic measure, any two opinionated false answers will be accorded\nthe same degree of accuracy by the corresponding global measure.\n\nIt may be that there are ways of tinkering with the\n\\(\\lambda\\)–terms to avoid the objection, but on the face of it\nthe notions of local cognitive value embodied in both the linear and\nquadratic rules seem to be deficient because they omit considerations\nof truthlikeness even while valuing truth. It seems that any adequate\nmeasure of the cognitive value of investing a certain degree of belief\nin \\(A\\) should take into account not just whether \\(A\\) is true or\nfalse, but here the truth lies in relation to the worlds in \\(A\\).\n\nWhatever our account of cognitive value, each credal state \\(P\\)\nassigns an expected cognitive value to every credal state \\(Q\\)\n(including \\(P\\) itself of course). \n\\[ \\mathbf{E}CV_P(Q) = \\sum_i P(C_i) CV_i(Q). \\]\n\n\nSuppose we accept the injunction that one ought to maximize expected\nvalue as calculated from the perspective of one’s current credal\nstate. Let us say that a credal state \\(P\\) is self-defeating\nif to maximize expected value from the perspective of \\(P\\) itself one\nwould have to adopt some distinct credal state \\(Q\\), without the\nbenefit of any new information:\n\n\\(P\\) is self-defeating = for some \\(Q\\) distinct from \\(P\\),\n\\(\\mathbf{E}\\)CV\\(_P\\)\\((Q) \\gt\\)\n\\(\\mathbf{E}\\)CV\\(_P\\)\\((P)\\).\n\n\nThe requirement of propriety requires that no credal state be\nself-defeating. No credal state demands that you shift to another\ncredal state without new information. One feature of the quadratic\nfamily of proper scoring rules is that they guarantee\npropriety, and propriety is an extremely attractive\nfeature of cognitive value. From propriety alone, one can\nconstruct arguments for the various elements of probabilism. For\nexample, propriety effectively guarantees that the credence\nfunction must obey the standard axioms governing additivity (Leitgeb\nand Pettigrew 2010); propriety guarantees a version of the\nvalue-of-learning theorem in purely cognitive terms (Oddie, 1997);\npropriety provides an argument that conditionalization is the\nonly method of updating compatible with the maximization of expected\ncognitive value (Oddie 1997, Greaves and Wallace 2005, and Leitgeb and\nPettigrew 2010). Not only does propriety deliver these goods for\nprobabilism, but any account of cognitive value that doesn’t\nobey propriety entails that self-defeating probability\ndistributions should be eschewed a priori. (And that might\nappear to violate a fundamental commitment of empiricism.)\n\nThere is however a powerful argument that any measure of cognitive\nvalue that satisfies propriety cannot deliver a fundamental\ndesideratum on an adequate theory of truthlikeness (or accuracy): the\nprinciple of proximity. Every serious account of\ntruthlikeness satisfies proximity. But proximity and\npropriety turn out to be incompatible, given only very weak\nassumptions (see Oddie 2019 and, for an extended critique, also\nSchoenfield 2022). If this is right then the best account of\ngenuine accuracy cannot provide a vindication of pure\nprobabilism.\n4. Conclusion\n\nWe are all fallibilists now, but we are not all skeptics, or\nantirealists or nihilists. Most of us think inquiries can and do\nprogress even when they fall short of their goal of locating the truth\nof the matter. We think that an inquiry can progress by moving from\none falsehood to another falsehood, or from one imperfect credal state\nto another. To reconcile epistemic optimism with realism in the teeth\nof the dismal induction we need a viable concept of truthlikeness, a\nviable account of the empirical indicators of truthlikeness, and a\nviable account of the role of truthlikeness in cognitive value. And\nall three accounts must fit together appropriately.\n\nThere are a number of approaches to the logical problem of\ntruthlikeness but, unfortunately, there is as yet little consensus on\nwhat constitutes the best or most promising approach, and prospects\nfor combining the best features of each approach do not at this stage\nseem bright. In fact, recent work on whether the three main approaches\nto the logical problem of truthlikeness presented above are compatible\nseems to point to a negative answer (see the supplement on\n The compatibility of the approaches).\n There is, however, much work to be done on both the epistemological\nand the axiological aspects of truthlikeness, and it may well be that\nnew constraints will emerge from those investigations that will help\nfacilitate a fully adequate solution to the logical problem as\nwell.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aronson, J., Harré, R., and Way, E.C., 1995, <em>Realism\nRescued: How Scientific Progress is Possible</em>, Chicago: Open\nCourt.",
                "Aronson, J., 1997, “Truth, Verisimilitude, and Natural\nKinds”, <em>Philosophical Papers</em>, 26: 71–104.",
                "Armstrong, D. M., 1983, <em>What is a Law of Nature?</em>,\nCambridge: Cambridge University Press.",
                "Barnes, E., 1990, “The Language Dependence of\nAccuracy”, <em>Synthese</em>, 84: 54–95.",
                "–––, 1991, “Beyond Verisimilitude: A\nLinguistically Invariant Basis for Scientific Progress”,\n<em>Synthese</em>, 88: 309–339.",
                "–––, 1995, “Truthlikeness, Translation,\nand Approximate Causal Explanation”, <em>Philosophy of\nScience</em>, 62/2: 15–226.",
                "Bealer, G., 1982, <em>Quality and Concept</em>, Oxford:\nClarendon.",
                "Brink, C., &amp; Heidema, J., 1987, “A verisimilar ordering\nof theories phrased in a propositional language”, <em>The\nBritish Journal for the Philosophy of Science</em>, 38:\n533–549.",
                "Britton, T., 2004, “The problem of verisimilitude and\ncounting partially identical properties”, <em>Synthese</em>,\n141: 77–95.",
                "Britz, K., and Brink, C., 1995, “Computing\nverisimilitude”, <em>Notre Dame Journal of Formal Logic</em>,\n36(2): 30–43.",
                "Burger, I. C., and Heidema, J., 1994, “Comparing theories by\ntheir positive and negative contents”, <em>British Journal for\nthe Philosophy of Science</em>, 45: 605–630.",
                "–––, 2005, “For better, for worse:\ncomparative orderings on states and theories”, in R. Festa, A.\nAliseda, and J. Peijnenburg (eds.), <em>Confirmation, Empirical\nProgress, and Truth Approximation</em>, Amsterdam, New York: Rodopi,\n459–488.",
                "Carnap, R., 1952, <em>The Continuum of Inductive Methods</em>.\nChicago: University of Chicago Press.",
                "Cevolani, G. and Festa, R., 2020, “A partial consequence\naccount of truthlikeness”, <em>Synthese</em>, 197(4):\n1627–1646.",
                "Cevolani, G., Crupi, V. and Festa, R., 2011, “Verisimilitude\nand Belief Change for Conjunctive Theories”,\n<em>Erkenntnis</em>, 75(2): 183–202.",
                "Cevolani, G., Festa, R, &amp; Kuipers, T. A. F., 2013,\n“Verisimilitude and belief change for nomic conjunctive\ntheories”, <em>Synthese</em>, 190(16): 3307–3324.",
                "Cohen, L.J., 1980, “What has science to do with\ntruth?”, <em>Synthese</em>, 45: 489–510.",
                "–––, 1987, “Verisimilitude and\nlegisimilitude”, in Kuipers 1987a, 129–45.",
                "Fine, K., 2021, “Verisimilitude and Truthmaking”,\n<em>Erkenntnis</em>, 86(5): 1239–1276.",
                "–––, 2022, “Some Remarks on Popper’s\nQualitative Criterion of Verisimilitude”, <em>Erkenntnis</em>,\n87(1): 213–236.",
                "Gärdenfors, P., 2000, <em>Conceptual Spaces</em>, Cambridge:\nMIT Press.",
                "Gemes, K., 2007, “Verisimilitude and Content”,\n<em>Synthese</em>, 154(2): 293–306.",
                "Gerla, G., 1992, “Distances, diameters and verisimilitude of\ntheories”, <em>Archive for mathematical Logic</em>, 31(6):\n407–14.",
                "–––, 2007, “Point free geometry and\nverisimilitude of theories”, <em>Journal of Philosophical\nLogic</em>, 36: 707–733.",
                "Gärdenfors, P., 2000, <em>Conceptual Spaces</em>, Cambridge:\nMIT Press.",
                "Goldstick, D. and B. O’Neill, 1988. “Truer” in\n<em>Philosophy of Science</em>, 55: 583–597.",
                "Goldman, A., 1999, <em>Knowledge in a Social World</em>, Oxford:\nOxford University Press.",
                "Good, I.J., 1967, “On the Principle of Total\nEvidence”, in <em>The British Journal for the Philosophy of\nScience</em>, 17(4): 319–321.",
                "Harris, J., 1974, “Popper’s definition of\n‘Verisimilitude’”, <em>The British Journal for the\nPhilosophy of Science</em>, 25: 160–166.",
                "Hempel, C. G., 1960, “Inductive inconsistencies”, in\n<em>Synthese</em>, 12(4): 439–69.",
                "Hilpinen, R., 1968, <em>Rules of acceptance and inductive\nlogic</em>. Amsterdam: North Holland.",
                "–––, 1976, “Approximate truth and\ntruthlikeness”, in Przelecki, <em>et al</em>. (eds.), <em>Formal\nMethods in the Methodology of the Empirical Sciences</em>, Dordrecht:\nReidel, 19–42",
                "Hintikka, J., 1963, “Distributive normal forms in\nfirst-order logic” in <em>Formal Systems and Recursive\nFunctions</em> (Proceedings of the Eighth Logic Colloquium), J.N.\nCrossley and M.A.E. Dummett (eds.), Amsterdam: North-Holland,\n47-90.",
                "–––, 1966, “A two-dimensional continuum of\ninductive methods”, in J. Hintikka and P. Suppes, <em>Aspects of\nInductive Logic</em>. Dordrecht: Reidel. 113–32.",
                "Horwich, P., 1982, <em>Probability and Evidence</em>, Cambridge:\nCambridge University Press.",
                "Kieseppa, I.A., 1996, <em>Truthlikeness for Multidimensional,\nQuantitative Cognitive Problems</em>, Dordrecht: Kluwer.",
                "–––, 1996, “Truthlikeness for Hypotheses\nExpressed in Terms of n Quantitative Variables”, <em>Journal of\nPhilosophical Logic</em>, 25: 109–134.",
                "–––, 1996, “On the Aim of the Theory of\nVerisimilitude”, <em>Synthese</em>, 107: 421–438",
                "Kuipers, T. A. F. (ed.), 1987a, <em>What is closer-to-the-truth? A\nparade of approaches to truthlikeness</em> (Poznan Studies in the\nPhilosophy of the Sciences and the Humanities, Volume 10), Amsterdam:\nRodopi.",
                "–––, 1987b, “A structuralist approach to\ntruthlikeness”, in Kuipers 1987a, 79–99.",
                "–––, 1987c, “Truthlikeness of stratified\ntheories”, in Kuipers 1987a, 177–186.",
                "–––, 1992, “Naive and refined truth\napproximation”, <em>Synthese</em>, 93: 299–341.",
                "–––, 2000, <em>From Instrumentalism to\nConstructive Realism</em>, Dordrecht: Reidel.",
                "–––, 2011, “Basic and Refined Nomic Truth\nApproximation by Evidence-Guided Belief Revision in AGM-Terms”,\n<em>Erkenntnis</em>, 75(2): 223–236.",
                "–––, 2019, <em>Nomic Truth Approximation\nRevisited</em>, Cham: Springer",
                "Laudan, Larry, 1977, <em>Progress and Its Problems: Towards a\nTheory of Scientific Growth</em>, Berkeley: University of California\nPress.",
                "Leitgeb, H. and R. Pettigrew, 2010, “An Objective\nJustification of Bayesianism I: Measuring Inaccuracy”,\nPhilosophy of Science, 77: 201–235.",
                "Levi, Isaac, 1967, <em>Gambling with Truth</em>. Cambridge, MA:\nMIT Press.",
                "Lewis, David, 1988, “Statements Partly About\nObservation”, in <em>Philosophical Papers</em>, 17:\n1–3",
                "Maher, Patrick, 1993, <em>Betting on Theories</em>, Cambridge:\nCambridge University Press.",
                "Miller, D., 1974a, “Popper’s Qualitative Theory of\nVerisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 25: 166–177.",
                "–––, 1974b, “On the Comparison of False\nTheories by Their Bases”, <em>The British Journal for the\nPhilosophy of Science</em>, 25(2): 178–188",
                "–––, 1975a, “The Accuracy of\nPredictions”, <em>Synthese</em> 30(1–2):\n159–191.",
                "–––, 1975b, “The Accuracy of Predictions:\nA Reply”, <em>Synthese</em>, 30(1–2): 207–21.",
                "–––, 1976, “Verisimilitude\nRedeflated”, <em>The British Journal for the Philosophy of\nScience</em>, 27(4): 363–381.",
                "–––, 1978a, “The Distance Between\nConstituents”, <em>Synthese</em>, 38(2): 197–212.",
                "–––, 1978b, “On Distance from the Truth as\na True Distance”, in Hintikka <em>et al</em>. (eds.), <em>Essays\non Mathematical and Philosophical Logic</em>, Dordrecht: Reidel,\n415–435.",
                "–––, 1994, <em>Critical Rationalism: A\nRestatement and Defence</em>, Chicago: Open Court.",
                "–––, 2006, <em>Out Of Error: Further Essays on\nCritical Rationalism</em>, Aldershot: Ashgate.",
                "Mormann, T., 2005, “Geometry of Logic and Truth\nApproximation”, in Festa, R., et al. (eds.), <em>Poznan Studies\nin the Philosophy of the Sciences and the Humanities: Confirmation,\nEmpirical Progress and Truth Approximation</em>, 83:\n431–54.",
                "–––, 2006, “Truthlikeness for Theories on\nCountable Languages”, Jarvie, I. et al. (eds.) <em>Karl Popper:\nA Centenary Assessment. Volume III: Science</em>, Aldershot: Ashgate,\n3–15.",
                "Newton-Smith, W.H., 1981, <em>The Rationality of Science</em>,\nBoston: Routledge &amp; Kegan Paul.",
                "Niiniluoto, I., 1977, “On the Truthlikeness of\nGeneralizations”, in Butts <em>et al</em>. (eds.), <em>Basic\nProblems in Methodology and Linguistics</em>, Dordrecht: Reidel,\n121–147.",
                "–––, 1978a, “Truthlikeness: Comments on\nRecent Discussion”, <em>Synthese</em>, 38: 281–329.",
                "–––, 1978b, “Verisimilitude,\nTheory-Change, and Scientific Progress”, in I. Niiniluoto <em>et\nal</em>. (eds.), <em>The Logic and Epistemology of Scientific\nChange</em>, <em>Acta Philosophica Fennica</em>, 30(2–4),\nAmsterdam: North-Holland, 243–264.",
                "–––, 1979a, “Truthlikeness in First-Order\nLanguages”, in I. Niiniluoto <em>et al</em>. (eds.), <em>Essays\non Mathematical and Philosophical Logic</em>, Dordrecht: Reidel,\n437–458.",
                "–––, 1979b, “Degrees of Truthlikeness:\nFrom Singular Sentences to Generalizations”, <em>The British\nJournal for the Philosophy of Science</em>, 30: 371–376.",
                "–––, 1982a, “Scientific Progress”,\n<em>Synthese</em>, 45(3): 427–462.",
                "–––, 1982b, “What Shall We Do With\nVerisimilitude?”, <em>Philosophy of Science</em>, 49:\n181–197.",
                "–––, 1983, “Verisimilitude vs.\nLegisimilitude”, <em>Studia Logica</em>, 42(2–3):\n315–329.",
                "–––, 1986, “Truthlikeness and Bayesian\nEstimation”, <em>Synthese</em>, 67: 321–346.",
                "–––, 1987a, “How to Define\nVerisimilitude”, in Kuipers 1987a, 11–23.",
                "–––, 1987b, “Verisimilitude with\nIndefinite Truth”, in Kuipers 1987a, 187–195.",
                "–––, 1987c, <em>Truthlikeness</em>, Dordrecht:\nReidel.",
                "–––, 1997, “Reference Invariance and\nTruthlikeness”, in <em>Philosophy of Science</em>, 64:\n546–554.",
                "–––, 1998, “Survey Article:\nVerisimilitude: The Third Period”, in <em>The British Journal\nfor the Philosophy of Science</em>, 49: 1–29.",
                "–––, 1999, <em>Critical Scientific Realism</em>,\nOxford: Clarendon.",
                "–––, 2003, “Content and likeness\ndefinitions of verisimilitude”, in Hintikka et al. (eds.)\n<em>Philosophy and Logic: In Search of the Polish Tradition</em>,\nDordrecht: Kluwer, 27–36.",
                "–––, 2005, “Abduction and\ntruthlikeness”, in. <em>Poznan Studies in the Philosophy of the\nSciences and the Humanities</em>, 83(1): 255–275.",
                "–––, 2011, “Revising beliefs towards the\ntruth”, in <em>Erkenntnis</em>, 75: 165–181.",
                "Oddie, G., 1978, “Verisimilitude and distance in logical\nspace”, <em>Acta Philosophica Fennica</em>, 30(2–4):\n227–243.",
                "–––, 1982, “Cohen on verisimilitude and\nnatural necessity”, <em>Synthese</em>, 51: 355–79.",
                "–––, 1986a, <em>Likeness to Truth</em>, (Western\nOntario Series in Philosophy of Science), Dordrecht: Reidel.",
                "–––, 1987, “Truthlikeness and the\nconvexity of propositions” in <em>What is\nCloser-to-the-Truth?</em>, T. Kuipers (ed.), Amsterdam: Rodopi,\n197–217.",
                "–––, 1990, “Verisimilitude by power\nrelations”, <em>British Journal for the Philosophy of\nScience</em>, 41: 129–35.",
                "–––, 1997, “Conditionalization, cogency\nand cognitive value”, <em>The British Journal for the Philosophy\nof Science</em>, 48: 533–41.",
                "–––, 2013, “The content, consequence and\nlikeness approaches to verisimilitude: compatibility,\ntrivialization,and underdetermination”, <em>Synthese</em>, 190:\n1647–1687",
                "–––, 2019, “What accuracy could not\nbe”, <em>British Journal for the Philosophy of Science</em>,\n70(2): 551–580.",
                "Oddie, G. and P. Milne, 1991, “Act and value: expectations\nand the representability of moral theories”, <em>Theoria</em>,\n48: 165–82.",
                "Pearce, D., 1983, “Truthlikeness and translation: a comment\non Oddie”, <em>The British Journal for the Philosophy of\nScience</em>, 34: 380–5.",
                "Popper, K. R., 1963, <em>Conjectures and Refutations</em>, London:\nRoutledge.",
                "–––, 1976, “A note on\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 27(2): 147–159.",
                "Psillos, S., 1999, <em>Scientific Realism: How Science Tracks\nTruth</em>, London: Routledge.",
                "Renardel de Lavalette, G. R. &amp; Zwart, Sjoerd D., 2011,\n“Belief Revision and Verisimilitude Based on Preference and\nTruth Orderings”. <em>Erkenntnis</em>, 75(2):\n237–254.",
                "Rosenkrantz, R., 1975, “Truthlikeness: comments on David\nMiller”, <em>Synthese</em>, 30(1–2): 193–7.",
                "Ryan, M. and P.Y. Schobens, 1995, “Belief revision and\nverisimilitude”, <em>Notre Dame Journal of Formal Logic</em>,\n36: 15–29.",
                "Schoenfield, M., 2022, “Accuracy and verisimilitude: The\ngood, the bad, and the ugly”, <em>British Journal for the\nPhilosophy of Science</em>, 73(2): 373–406.",
                "Schurz, G., and Weingartner, P., 1987, “Verisimilitude\ndefined by relevant consequence-elements”, in Kuipers 1987a,\n47–77.",
                "–––, 2010, “Zwart and Franssen’s\nimpossibility theorem holds for possible-world-accounts but not for\nconsequence-accounts of verisimilitude”, <em>Synthese</em>\n172(3): 415–36.",
                "Smith, N., 2005, “Vagueness as closeness”,\n<em>Australasian Journal of Philosophy</em>, 83: 157–83",
                "Sorenson, R. 2007, “Logically Equivalent: But Closer to the\nTruth”, <em>British Journal for the Philosophy of Science</em>,\n58: 287–97.",
                "Tarski, A., 1969, “The concept of truth in formalized\nlanguages” in J. Woodger (ed.), <em>Logic, Semantics, and\nMetamathematics</em>, Oxford: Clarendon.",
                "Teller, P., 2001, “The Twilight of the Perfect Model\nModel”, <em>Erkenntnis</em>, 55: 393–415.",
                "Tichý, P., 1974, “On Popper’s definitions of\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 25: 155–160.",
                "–––, 1976, “Verisimilitude\nRedefined”, <em>The British Journal for the Philosophy of\nScience</em>, 27: 25–42.",
                "–––, 1978, “Verisimilitude\nRevisited” <em>Synthese</em>, 38: 175–196.",
                "Tooley, M., 1977, “The Nature of Laws”, <em>Canadian\nJournal of Philosophy</em>, 7: 667–698.",
                "Urbach, P., 1983, “Intimations of similarity: the shaky\nbasis of verisimilitude”, <em>The British Journal for the\nPhilosophy of Science</em>, 34: 166–75.",
                "Vetter, H., 1977, “A new concept of verisimilitude”,\n<em>Theory and Decision</em>, 8: 369–75.",
                "Volpe, G., 1995, “A semantic approach to comparative\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 46: 563–82.",
                "Weston, T., 1992, “Approximate truth and scientific\nrealism”, <em>Philosophy of Science</em>, 59: 53–74.",
                "Zamora Bonilla, J. P., 1992, “Truthlikeness Without Truth: A\nMethodological Approach”, <em>Synthese</em>, 93:\n343–72.",
                "–––, 1996, “Verisimilitude, Structuralism\nand Scientific Progress”, <em>Erkenntnis</em>, 44:\n25–47.",
                "–––, 2000, “Truthlikeness, Rationality and\nScientific Method”, <em>Synthese</em>, 122: 321–335.",
                "–––, 2002, “Verisimilitude and the\nDynamics of Scientific Research Programmes”, <em>Journal for the\nGeneral Philosophy of Science</em>, 33: 349–368",
                "Zwart, S. D., 2001, <em>Refined Verisimilitude</em>, Dordrecht:\nKluwer.",
                "Zwart, S. D., and M. Franssen, 2007, “An impossibility\ntheorem for verisimilitude”, <em>Synthese</em>, 158(1):\n75–92."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Aronson, J., Harré, R., and Way, E.C., 1995, <em>Realism\nRescued: How Scientific Progress is Possible</em>, Chicago: Open\nCourt.</li>\n<li>Aronson, J., 1997, “Truth, Verisimilitude, and Natural\nKinds”, <em>Philosophical Papers</em>, 26: 71–104.</li>\n<li>Armstrong, D. M., 1983, <em>What is a Law of Nature?</em>,\nCambridge: Cambridge University Press.</li>\n<li>Barnes, E., 1990, “The Language Dependence of\nAccuracy”, <em>Synthese</em>, 84: 54–95.</li>\n<li>–––, 1991, “Beyond Verisimilitude: A\nLinguistically Invariant Basis for Scientific Progress”,\n<em>Synthese</em>, 88: 309–339.</li>\n<li>–––, 1995, “Truthlikeness, Translation,\nand Approximate Causal Explanation”, <em>Philosophy of\nScience</em>, 62/2: 15–226.</li>\n<li>Bealer, G., 1982, <em>Quality and Concept</em>, Oxford:\nClarendon.</li>\n<li>Brink, C., &amp; Heidema, J., 1987, “A verisimilar ordering\nof theories phrased in a propositional language”, <em>The\nBritish Journal for the Philosophy of Science</em>, 38:\n533–549.</li>\n<li>Britton, T., 2004, “The problem of verisimilitude and\ncounting partially identical properties”, <em>Synthese</em>,\n141: 77–95.</li>\n<li>Britz, K., and Brink, C., 1995, “Computing\nverisimilitude”, <em>Notre Dame Journal of Formal Logic</em>,\n36(2): 30–43.</li>\n<li>Burger, I. C., and Heidema, J., 1994, “Comparing theories by\ntheir positive and negative contents”, <em>British Journal for\nthe Philosophy of Science</em>, 45: 605–630.</li>\n<li>–––, 2005, “For better, for worse:\ncomparative orderings on states and theories”, in R. Festa, A.\nAliseda, and J. Peijnenburg (eds.), <em>Confirmation, Empirical\nProgress, and Truth Approximation</em>, Amsterdam, New York: Rodopi,\n459–488.</li>\n<li>Carnap, R., 1952, <em>The Continuum of Inductive Methods</em>.\nChicago: University of Chicago Press.</li>\n<li>Cevolani, G. and Festa, R., 2020, “A partial consequence\naccount of truthlikeness”, <em>Synthese</em>, 197(4):\n1627–1646.</li>\n<li>Cevolani, G., Crupi, V. and Festa, R., 2011, “Verisimilitude\nand Belief Change for Conjunctive Theories”,\n<em>Erkenntnis</em>, 75(2): 183–202.</li>\n<li>Cevolani, G., Festa, R, &amp; Kuipers, T. A. F., 2013,\n“Verisimilitude and belief change for nomic conjunctive\ntheories”, <em>Synthese</em>, 190(16): 3307–3324.</li>\n<li>Cohen, L.J., 1980, “What has science to do with\ntruth?”, <em>Synthese</em>, 45: 489–510.</li>\n<li>–––, 1987, “Verisimilitude and\nlegisimilitude”, in Kuipers 1987a, 129–45.</li>\n<li>Fine, K., 2021, “Verisimilitude and Truthmaking”,\n<em>Erkenntnis</em>, 86(5): 1239–1276.</li>\n<li>–––, 2022, “Some Remarks on Popper’s\nQualitative Criterion of Verisimilitude”, <em>Erkenntnis</em>,\n87(1): 213–236.</li>\n<li>Gärdenfors, P., 2000, <em>Conceptual Spaces</em>, Cambridge:\nMIT Press.</li>\n<li>Gemes, K., 2007, “Verisimilitude and Content”,\n<em>Synthese</em>, 154(2): 293–306.</li>\n<li>Gerla, G., 1992, “Distances, diameters and verisimilitude of\ntheories”, <em>Archive for mathematical Logic</em>, 31(6):\n407–14.</li>\n<li>–––, 2007, “Point free geometry and\nverisimilitude of theories”, <em>Journal of Philosophical\nLogic</em>, 36: 707–733.</li>\n<li>Gärdenfors, P., 2000, <em>Conceptual Spaces</em>, Cambridge:\nMIT Press.</li>\n<li>Goldstick, D. and B. O’Neill, 1988. “Truer” in\n<em>Philosophy of Science</em>, 55: 583–597.</li>\n<li>Goldman, A., 1999, <em>Knowledge in a Social World</em>, Oxford:\nOxford University Press.</li>\n<li>Good, I.J., 1967, “On the Principle of Total\nEvidence”, in <em>The British Journal for the Philosophy of\nScience</em>, 17(4): 319–321.</li>\n<li>Harris, J., 1974, “Popper’s definition of\n‘Verisimilitude’”, <em>The British Journal for the\nPhilosophy of Science</em>, 25: 160–166.</li>\n<li>Hempel, C. G., 1960, “Inductive inconsistencies”, in\n<em>Synthese</em>, 12(4): 439–69.</li>\n<li>Hilpinen, R., 1968, <em>Rules of acceptance and inductive\nlogic</em>. Amsterdam: North Holland.</li>\n<li>–––, 1976, “Approximate truth and\ntruthlikeness”, in Przelecki, <em>et al</em>. (eds.), <em>Formal\nMethods in the Methodology of the Empirical Sciences</em>, Dordrecht:\nReidel, 19–42</li>\n<li>Hintikka, J., 1963, “Distributive normal forms in\nfirst-order logic” in <em>Formal Systems and Recursive\nFunctions</em> (Proceedings of the Eighth Logic Colloquium), J.N.\nCrossley and M.A.E. Dummett (eds.), Amsterdam: North-Holland,\n47-90.</li>\n<li>–––, 1966, “A two-dimensional continuum of\ninductive methods”, in J. Hintikka and P. Suppes, <em>Aspects of\nInductive Logic</em>. Dordrecht: Reidel. 113–32.</li>\n<li>Horwich, P., 1982, <em>Probability and Evidence</em>, Cambridge:\nCambridge University Press.</li>\n<li>Kieseppa, I.A., 1996, <em>Truthlikeness for Multidimensional,\nQuantitative Cognitive Problems</em>, Dordrecht: Kluwer.</li>\n<li>–––, 1996, “Truthlikeness for Hypotheses\nExpressed in Terms of n Quantitative Variables”, <em>Journal of\nPhilosophical Logic</em>, 25: 109–134.</li>\n<li>–––, 1996, “On the Aim of the Theory of\nVerisimilitude”, <em>Synthese</em>, 107: 421–438</li>\n<li>Kuipers, T. A. F. (ed.), 1987a, <em>What is closer-to-the-truth? A\nparade of approaches to truthlikeness</em> (Poznan Studies in the\nPhilosophy of the Sciences and the Humanities, Volume 10), Amsterdam:\nRodopi.</li>\n<li>–––, 1987b, “A structuralist approach to\ntruthlikeness”, in Kuipers 1987a, 79–99.</li>\n<li>–––, 1987c, “Truthlikeness of stratified\ntheories”, in Kuipers 1987a, 177–186.</li>\n<li>–––, 1992, “Naive and refined truth\napproximation”, <em>Synthese</em>, 93: 299–341.</li>\n<li>–––, 2000, <em>From Instrumentalism to\nConstructive Realism</em>, Dordrecht: Reidel.</li>\n<li>–––, 2011, “Basic and Refined Nomic Truth\nApproximation by Evidence-Guided Belief Revision in AGM-Terms”,\n<em>Erkenntnis</em>, 75(2): 223–236.</li>\n<li>–––, 2019, <em>Nomic Truth Approximation\nRevisited</em>, Cham: Springer</li>\n<li>Laudan, Larry, 1977, <em>Progress and Its Problems: Towards a\nTheory of Scientific Growth</em>, Berkeley: University of California\nPress.</li>\n<li>Leitgeb, H. and R. Pettigrew, 2010, “An Objective\nJustification of Bayesianism I: Measuring Inaccuracy”,\nPhilosophy of Science, 77: 201–235.</li>\n<li>Levi, Isaac, 1967, <em>Gambling with Truth</em>. Cambridge, MA:\nMIT Press.</li>\n<li>Lewis, David, 1988, “Statements Partly About\nObservation”, in <em>Philosophical Papers</em>, 17:\n1–3</li>\n<li>Maher, Patrick, 1993, <em>Betting on Theories</em>, Cambridge:\nCambridge University Press.</li>\n<li>Miller, D., 1974a, “Popper’s Qualitative Theory of\nVerisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 25: 166–177.</li>\n<li>–––, 1974b, “On the Comparison of False\nTheories by Their Bases”, <em>The British Journal for the\nPhilosophy of Science</em>, 25(2): 178–188</li>\n<li>–––, 1975a, “The Accuracy of\nPredictions”, <em>Synthese</em> 30(1–2):\n159–191.</li>\n<li>–––, 1975b, “The Accuracy of Predictions:\nA Reply”, <em>Synthese</em>, 30(1–2): 207–21.</li>\n<li>–––, 1976, “Verisimilitude\nRedeflated”, <em>The British Journal for the Philosophy of\nScience</em>, 27(4): 363–381.</li>\n<li>–––, 1978a, “The Distance Between\nConstituents”, <em>Synthese</em>, 38(2): 197–212.</li>\n<li>–––, 1978b, “On Distance from the Truth as\na True Distance”, in Hintikka <em>et al</em>. (eds.), <em>Essays\non Mathematical and Philosophical Logic</em>, Dordrecht: Reidel,\n415–435.</li>\n<li>–––, 1994, <em>Critical Rationalism: A\nRestatement and Defence</em>, Chicago: Open Court.</li>\n<li>–––, 2006, <em>Out Of Error: Further Essays on\nCritical Rationalism</em>, Aldershot: Ashgate.</li>\n<li>Mormann, T., 2005, “Geometry of Logic and Truth\nApproximation”, in Festa, R., et al. (eds.), <em>Poznan Studies\nin the Philosophy of the Sciences and the Humanities: Confirmation,\nEmpirical Progress and Truth Approximation</em>, 83:\n431–54.</li>\n<li>–––, 2006, “Truthlikeness for Theories on\nCountable Languages”, Jarvie, I. et al. (eds.) <em>Karl Popper:\nA Centenary Assessment. Volume III: Science</em>, Aldershot: Ashgate,\n3–15.</li>\n<li>Newton-Smith, W.H., 1981, <em>The Rationality of Science</em>,\nBoston: Routledge &amp; Kegan Paul.</li>\n<li>Niiniluoto, I., 1977, “On the Truthlikeness of\nGeneralizations”, in Butts <em>et al</em>. (eds.), <em>Basic\nProblems in Methodology and Linguistics</em>, Dordrecht: Reidel,\n121–147.</li>\n<li>–––, 1978a, “Truthlikeness: Comments on\nRecent Discussion”, <em>Synthese</em>, 38: 281–329.</li>\n<li>–––, 1978b, “Verisimilitude,\nTheory-Change, and Scientific Progress”, in I. Niiniluoto <em>et\nal</em>. (eds.), <em>The Logic and Epistemology of Scientific\nChange</em>, <em>Acta Philosophica Fennica</em>, 30(2–4),\nAmsterdam: North-Holland, 243–264.</li>\n<li>–––, 1979a, “Truthlikeness in First-Order\nLanguages”, in I. Niiniluoto <em>et al</em>. (eds.), <em>Essays\non Mathematical and Philosophical Logic</em>, Dordrecht: Reidel,\n437–458.</li>\n<li>–––, 1979b, “Degrees of Truthlikeness:\nFrom Singular Sentences to Generalizations”, <em>The British\nJournal for the Philosophy of Science</em>, 30: 371–376.</li>\n<li>–––, 1982a, “Scientific Progress”,\n<em>Synthese</em>, 45(3): 427–462.</li>\n<li>–––, 1982b, “What Shall We Do With\nVerisimilitude?”, <em>Philosophy of Science</em>, 49:\n181–197.</li>\n<li>–––, 1983, “Verisimilitude vs.\nLegisimilitude”, <em>Studia Logica</em>, 42(2–3):\n315–329.</li>\n<li>–––, 1986, “Truthlikeness and Bayesian\nEstimation”, <em>Synthese</em>, 67: 321–346.</li>\n<li>–––, 1987a, “How to Define\nVerisimilitude”, in Kuipers 1987a, 11–23.</li>\n<li>–––, 1987b, “Verisimilitude with\nIndefinite Truth”, in Kuipers 1987a, 187–195.</li>\n<li>–––, 1987c, <em>Truthlikeness</em>, Dordrecht:\nReidel.</li>\n<li>–––, 1997, “Reference Invariance and\nTruthlikeness”, in <em>Philosophy of Science</em>, 64:\n546–554.</li>\n<li>–––, 1998, “Survey Article:\nVerisimilitude: The Third Period”, in <em>The British Journal\nfor the Philosophy of Science</em>, 49: 1–29.</li>\n<li>–––, 1999, <em>Critical Scientific Realism</em>,\nOxford: Clarendon.</li>\n<li>–––, 2003, “Content and likeness\ndefinitions of verisimilitude”, in Hintikka et al. (eds.)\n<em>Philosophy and Logic: In Search of the Polish Tradition</em>,\nDordrecht: Kluwer, 27–36.</li>\n<li>–––, 2005, “Abduction and\ntruthlikeness”, in. <em>Poznan Studies in the Philosophy of the\nSciences and the Humanities</em>, 83(1): 255–275.</li>\n<li>–––, 2011, “Revising beliefs towards the\ntruth”, in <em>Erkenntnis</em>, 75: 165–181.</li>\n<li>Oddie, G., 1978, “Verisimilitude and distance in logical\nspace”, <em>Acta Philosophica Fennica</em>, 30(2–4):\n227–243.</li>\n<li>–––, 1982, “Cohen on verisimilitude and\nnatural necessity”, <em>Synthese</em>, 51: 355–79.</li>\n<li>–––, 1986a, <em>Likeness to Truth</em>, (Western\nOntario Series in Philosophy of Science), Dordrecht: Reidel.</li>\n<li>–––, 1987, “Truthlikeness and the\nconvexity of propositions” in <em>What is\nCloser-to-the-Truth?</em>, T. Kuipers (ed.), Amsterdam: Rodopi,\n197–217.</li>\n<li>–––, 1990, “Verisimilitude by power\nrelations”, <em>British Journal for the Philosophy of\nScience</em>, 41: 129–35.</li>\n<li>–––, 1997, “Conditionalization, cogency\nand cognitive value”, <em>The British Journal for the Philosophy\nof Science</em>, 48: 533–41.</li>\n<li>–––, 2013, “The content, consequence and\nlikeness approaches to verisimilitude: compatibility,\ntrivialization,and underdetermination”, <em>Synthese</em>, 190:\n1647–1687</li>\n<li>–––, 2019, “What accuracy could not\nbe”, <em>British Journal for the Philosophy of Science</em>,\n70(2): 551–580.</li>\n<li>Oddie, G. and P. Milne, 1991, “Act and value: expectations\nand the representability of moral theories”, <em>Theoria</em>,\n48: 165–82.</li>\n<li>Pearce, D., 1983, “Truthlikeness and translation: a comment\non Oddie”, <em>The British Journal for the Philosophy of\nScience</em>, 34: 380–5.</li>\n<li>Popper, K. R., 1963, <em>Conjectures and Refutations</em>, London:\nRoutledge.</li>\n<li>–––, 1976, “A note on\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 27(2): 147–159.</li>\n<li>Psillos, S., 1999, <em>Scientific Realism: How Science Tracks\nTruth</em>, London: Routledge.</li>\n<li>Renardel de Lavalette, G. R. &amp; Zwart, Sjoerd D., 2011,\n“Belief Revision and Verisimilitude Based on Preference and\nTruth Orderings”. <em>Erkenntnis</em>, 75(2):\n237–254.</li>\n<li>Rosenkrantz, R., 1975, “Truthlikeness: comments on David\nMiller”, <em>Synthese</em>, 30(1–2): 193–7.</li>\n<li>Ryan, M. and P.Y. Schobens, 1995, “Belief revision and\nverisimilitude”, <em>Notre Dame Journal of Formal Logic</em>,\n36: 15–29.</li>\n<li>Schoenfield, M., 2022, “Accuracy and verisimilitude: The\ngood, the bad, and the ugly”, <em>British Journal for the\nPhilosophy of Science</em>, 73(2): 373–406.</li>\n<li>Schurz, G., and Weingartner, P., 1987, “Verisimilitude\ndefined by relevant consequence-elements”, in Kuipers 1987a,\n47–77.</li>\n<li>–––, 2010, “Zwart and Franssen’s\nimpossibility theorem holds for possible-world-accounts but not for\nconsequence-accounts of verisimilitude”, <em>Synthese</em>\n172(3): 415–36.</li>\n<li>Smith, N., 2005, “Vagueness as closeness”,\n<em>Australasian Journal of Philosophy</em>, 83: 157–83</li>\n<li>Sorenson, R. 2007, “Logically Equivalent: But Closer to the\nTruth”, <em>British Journal for the Philosophy of Science</em>,\n58: 287–97.</li>\n<li>Tarski, A., 1969, “The concept of truth in formalized\nlanguages” in J. Woodger (ed.), <em>Logic, Semantics, and\nMetamathematics</em>, Oxford: Clarendon.</li>\n<li>Teller, P., 2001, “The Twilight of the Perfect Model\nModel”, <em>Erkenntnis</em>, 55: 393–415.</li>\n<li>Tichý, P., 1974, “On Popper’s definitions of\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 25: 155–160.</li>\n<li>–––, 1976, “Verisimilitude\nRedefined”, <em>The British Journal for the Philosophy of\nScience</em>, 27: 25–42.</li>\n<li>–––, 1978, “Verisimilitude\nRevisited” <em>Synthese</em>, 38: 175–196.</li>\n<li>Tooley, M., 1977, “The Nature of Laws”, <em>Canadian\nJournal of Philosophy</em>, 7: 667–698.</li>\n<li>Urbach, P., 1983, “Intimations of similarity: the shaky\nbasis of verisimilitude”, <em>The British Journal for the\nPhilosophy of Science</em>, 34: 166–75.</li>\n<li>Vetter, H., 1977, “A new concept of verisimilitude”,\n<em>Theory and Decision</em>, 8: 369–75.</li>\n<li>Volpe, G., 1995, “A semantic approach to comparative\nverisimilitude”, <em>The British Journal for the Philosophy of\nScience</em>, 46: 563–82.</li>\n<li>Weston, T., 1992, “Approximate truth and scientific\nrealism”, <em>Philosophy of Science</em>, 59: 53–74.</li>\n<li>Zamora Bonilla, J. P., 1992, “Truthlikeness Without Truth: A\nMethodological Approach”, <em>Synthese</em>, 93:\n343–72.</li>\n<li>–––, 1996, “Verisimilitude, Structuralism\nand Scientific Progress”, <em>Erkenntnis</em>, 44:\n25–47.</li>\n<li>–––, 2000, “Truthlikeness, Rationality and\nScientific Method”, <em>Synthese</em>, 122: 321–335.</li>\n<li>–––, 2002, “Verisimilitude and the\nDynamics of Scientific Research Programmes”, <em>Journal for the\nGeneral Philosophy of Science</em>, 33: 349–368</li>\n<li>Zwart, S. D., 2001, <em>Refined Verisimilitude</em>, Dordrecht:\nKluwer.</li>\n<li>Zwart, S. D., and M. Franssen, 2007, “An impossibility\ntheorem for verisimilitude”, <em>Synthese</em>, 158(1):\n75–92.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "epistemic utility arguments for epistemic norms",
            "logic: of belief revision",
            "Popper, Karl",
            "properties",
            "realism: and theory change in science",
            "scientific progress",
            "truth"
        ],
        "entry_link": [
            {
                "../epistemic-utility/": "epistemic utility arguments for epistemic norms"
            },
            {
                "../logic-belief-revision/": "logic: of belief revision"
            },
            {
                "../popper/": "Popper, Karl"
            },
            {
                "../properties/": "properties"
            },
            {
                "../realism-theory-change/": "realism: and theory change in science"
            },
            {
                "../scientific-progress/": "scientific progress"
            },
            {
                "../truth/": "truth"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=truthlikeness\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/truthlikeness/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=truthlikeness&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/truthlikeness/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=truthlikeness": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/truthlikeness/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=truthlikeness&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/truthlikeness/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}