{
    "url": "wilson",
    "title": "John Cook Wilson",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Mathieu Marion\n<marion.mathieu@uqam.ca>",
        "author_links": [
            {
                "mailto:marion%2emathieu%40uqam%2eca": "marion.mathieu@uqam.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nMathieu Marion\n&lt;<a href=\"mailto:marion%2emathieu%40uqam%2eca\"><em>marion<abbr title=\" dot \">.</abbr>mathieu<abbr title=\" at \">@</abbr>uqam<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Dec 8, 2009",
        "substantive revision Wed Jun 1, 2022"
    ],
    "preamble": "\n\nJohn Cook Wilson (1849–1915) was Wykeham Professor of Logic at\nNew College, Oxford. His ideas are at the origin of ‘Oxford\nRealism’, a philosophical movement that flourished at Oxford\nduring the first decades of the twentieth century. Although trained as\na classicist and a mathematician, his most important contributions\nwere to the theory of knowledge, where he argued that knowledge is\nfactive in conjunction with the thesis that, as a state of mind, it is\nnot definable in terms of belief—they share no ‘highest\ncommon factor’—and he thus rejected ‘hybrid’\nand ‘externalist’ accounts of knowledge. He also argued\nfor direct realism in perception, criticizing both empiricism and\nidealism, and argued for a view of universals as tropes. His influence\nswayed Oxford away from idealism and, through figures such as H. A.\nPrichard, Gilbert Ryle and J. L. Austin, his ideas were also to some\nextent at the origin of ‘moral intuitionism’ and\n‘ordinary language philosophy’, which defined in turn much\nof Oxford philosophy until the second half of the twentieth century.\nCook Wilson’s name was, however, all but forgotten by the end of\nthe century, but the influence of his ideas is still felt today in the\nwritings of philosophers as diverse as John McDowell, Charles Travis\nand Timothy Williamson.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Work"
        },
        {
            "#AnciPhil": "2. Ancient Philosophy"
        },
        {
            "#MethOrdiLang": "3. On Method: Ordinary Language"
        },
        {
            "#ApprJudg": "4. Apprehension & Judgement"
        },
        {
            "#KnowBeli": "5. Knowing & Believing"
        },
        {
            "#Perc": "6. Perception"
        },
        {
            "#Univ": "7. Universals"
        },
        {
            "#PhilLogi": "8. Philosophy of Logic"
        },
        {
            "#PhilLang": "9. Philosophy of Language"
        },
        {
            "#MoraPhil": "10. Moral Philosophy"
        },
        {
            "#Lega": "11. Legacy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Work\n\nDetails about the life of John Cook Wilson, or ‘Cook\nWilson’ as he is commonly called, may be found in a memoir\npublished in 1926 by his pupil A. S. L. Farquharson, in his edition of\nCook Wilson’s posthumous writings, Statement and Inference\nwith other Philosophical Papers (SI, xii–lxiv). He was born\nin Nottingham on June 6, 1849, the son of a Methodist minister.\nEducated at Derby Grammar School, he went up to Balliol College in\n1868, elected on an exhibition set up by Benjamin Jowett for students\nfrom less privileged schools. At Balliol, Cook Wilson read classics\nwith Henry Chandler, from whom he certainly got his penchant for\nminutiae, and mathematics with Henry J. S. Smith. He also studied\nphilosophy with Jowett and T. H. Green, who steered him towards Kant\nand idealism (SI, 880), along with other students from his generation,\nsuch as Bernard Bosanquet, F. H. Bradley, Richard Lewis Nettleship and\nWilliam Wallace. He even went to Göttingen in 1873–74 to\nattend lectures by Hermann Lotze (SI, xxvii), whose portrait he kept\nin his study. Cook Wilson wrote late in his life that “from the\nfirst I would not commit myself even to the most attractive form of\nidealism, tho’ greatly attracted by it” (SI, 815).\nFarquharson also mentions Friedrich Ueberweg’s System of\nLogic and History of Logical Doctrines (Ueberweg 1871) as an\nearly ‘realist’ influence (SI, 880). If we are to follow\nPrichard, however, Cook Wilson abandoned idealism “with extreme\nhesitation” (Prichard 1919, 309) and “it was only towards\nthe close of his life that he really seemed to find himself”\n(Prichard 1919, 318). (See also on this point Farquharson’s\nreminiscence in (SI, xix).)\n\nCook Wilson was elected fellow of Oriel College in 1873 and he\nsucceeded Thomas Fowler as Wykeham Professor of Logic, New College in\n1889. Bernard Bosanquet, Thomas Case, and John Venn had been among his\nrivals. He finally moved to New College in 1901, where he remained\nuntil his death from pernicious anemia on 11 August 1915. His wife\nCharlotte, whom he had met in Germany, predeceased him; they had a son\n(Joseph 1916b, 557). Cook Wilson lived the uneventful life of an\nOxford don. Among his awards, he became Fellow of the British Academy\nin 1907. A Liberal in his convictions (SI, xxix), he did not get\ninvolved in politics, nor did he take a prominent part in the affairs\nof his university. (He is, for example, seldom mentioned in (Engel\n1983).) His most cherished extra-curricular activity appears to have\nbeen the development of tactics for military bicycle units.\n\nCook Wilson published little during his lifetime. Setting apart\npublications on military cycling and other incidental writings, the\nbulk of his publications were in his chosen fields of study, classics\nand mathematics. His work in Ancient philosophy, which form the bulk\nof his publications, is discussed in the next section.\n\nIn mathematics, he published a strange treatise that arose out of his\nfailed attempt at proving the four-colour theorem, On the\nTraversing of Geometrical Figures (TGF). It had virtually no\necho. Farquharson quoted the mathematician E. W. Hobson explaining\nthat Cook Wilson “hardly gave sufficient time and thought to the\nsubject to make himself really conversant with the modern aspects of\nthe underlying problems” (SI, xxxviii). Cook Wilson also\npublished two short papers on probability (IP, PBT) in which he gave\nnew proofs of the discrete Bayes’ formula and of Jacob\nBernouilli’s theorem (this last being known today as the weak\nlaw of large numbers). Edgeworth called the former an “elegant\nproof” (Edgeworth 1911, 378, n.10), but Cook Wilson was\nseemingly ignorant of an already better proof of the latter via the\nBienaymé-Chebyshev inequality (Seneta 2012, 448 & 2013,\n1104). His mathematical endeavours were otherwise largely wasted on\ntrying to prove the inconsistency of non-Euclidean geometries. Cook\nWilson claimed that he had ‘apprehended’ and thus\n‘knows’ the truth of Euclid’s axiom of the\nparallels—he held it to be “absolutely self-evident”\n(SI, 561)—calling the idea of a non-Euclidean space a\n“chimera” (SI, 456) and non-Euclidean geometries\n“the mere illusion of specialists” (SI, xxxix). He thus\ntried in vain to find a contradiction to “convince the rank and\nfile of mathematicians” so that “they would at least not\nsuppose the philosophic criticism, by which I intended anyhow to\nattack, somehow wrong” (SI, xcvi). (See section 5 for further\ndiscussion of the point about knowledge.)\n\nCook Wilson published very little in philosophy: his inaugural\nlecture, On an Evolutionist Theory of the Axioms (ETA, see\nalso SI, 616–634), a critique of Spencer opening with a very\nshort encomium to Green and Lotze (ETA, 3–4), and a short piece\nin Mind (CLP) on the ‘Barber Shop Paradox’. In\nthe former, he argued that Spencer’s claim that the criterion of\ntruth p is the impossibility to think its contradictory and\nthat this criterion is the product of evolution is based on a circular\nreasoning: to prove that the criterion results from evolution, one\nmust apply it. The ‘Barber Shop Paradox’—not to be\nconfused with the ‘Barber’s Paradox’—is\nattributed to Lewis Carroll (Carroll 1894), but it originated in a\nprivate debate about ‘hypotheticals’ with Cook Wilson, who\nattempted his own solution in CLP (Moktefi 2007a, chap. v, sect. 2),\n(Moktefi 2007b), (Moktefi 2008, sect. 5.2), while Russell had already\nsatisfactorily resolved it in a footnote to The Principles of\nMathematics (Russell 1903, 18). Cook Wilson was also involved on\nthe same occasion in the genesis of Carroll’s better-known\n‘paradox of inference’, in ‘What the Tortoise Said\nto Achilles’ (Carroll 1895), which will be discussed in section\n8.\n\nCook Wilson’s reluctance to publish was partly caused by the\nfact that he constantly kept revising his views. As mentioned, he\napparently reached a more or less stable viewpoint only late in his\nlife. One of his better-known sayings is that\n\n\n… the (printed) letter killeth, and it is extraordinary how it\nwill prevent the acutest from exercising their wonted clearness of\nvision. (SI, 872) [See also Collingwood (2013, 19–20).]\n\n\nHis argument was that authors that have committed to print their views\non a given issue would, should they prove to be erroneous, more often\nthan not feel obliged to defend them and to engage in pointless\nrhetorical exchanges instead of seeing immediately the validity of\narguments against them.\n\nAs a result, Cook Wilson resorted throughout his career to the\nprinting for private circulation of pamphlets, known as\nDictata, which he began revising for publication shortly\nbefore his death. Only 11 years later did the two volumes of\nStatement and Inference appear, in 1926, put together by\nFarquharson from his lecture notes and Dictata, along with\nsome letters. These volumes are subdivided in five parts and 582\nsections. Their arrangement, which is not Cook Wilson’s, betrays\ntheir origin in his lectures in logic and in the theory of knowledge;\nalso interspersed are texts that originate from his study of and\nlectures on Plato and Aristotle. As the chronological table of the\nvarious sections shows (SI, 888–9), the texts thus assembled\nwere written at different dates and, in light of Cook Wilson’s\nfrequent change of mind (including his move away from idealism), they\nexpress views that are at times almost contradictory. This makes any\nstudy of his philosophy particularly difficult and, more often than\nnot, accounts of his views are influenced by those, equally important,\nof his pupil H. A. Prichard.\n2. Ancient Philosophy\n\nCook Wilson published over 50 papers in Ancient philosophy, in\nscholarly journals such as Classical Review, Classical\nQuarterly, Transactions of the Oxford Philological\nSociety and Philologische Rundschau, and a few\nbook-length studies on Aristotle’s Nicomachean Ethics\n(AS) and on Plato’s Timaeus. His main philological\nclaim concerning the structure of the seventh book of Nicomachean\nEthics was that it contained traces of three versions probably\nwritten by some Peripatetic later than Eudemus. To this he added a\nyear later a discussion (ASV) of interpolations in\nCategories, Posterior Analytics and Eudemian\nEthics. In a postscript to the revised version of AS (1912), he\nclaimed, however, that the variants were probably different drafts\nwritten by Aristotle himself. His pamphlet on the Timaeus\n(IPT) was mainly polemical, painstakingly detailing R. D.\nArcher-Hind’s ‘obligations’ in his 1888 edition of\nthe Timaeus to earlier authors, J. G. Stallbaum more than any\nother.\n\nCook Wilson is mainly remembered today for two contributions to Plato\nstudies, foremost for his paper ‘On the Platonist Doctrine of\nthe ἀσύμβλητοι\nἀριθμοί’ (OPD), which bears\non the debate on ‘intermediates’ in Plato. This issue\noriginates in Aristotle’s claim in Met. A 6\n987b14–17 that Plato believed that the objects of mathematics\noccupy an “intermediate position” between sensible things\nand Ideas/Forms. Since there is no explicit commitment to this claim\nin Plato, scholars either rejected Aristotle’s testimony or\nlooked for passages where Plato might be said to have implicitly\nendorsed it, such as the Line at the end of Book VI of the\nRepublic. Cook Wilson argued against reading this passage as\nimplicitly endorsing ‘intermediates’, claiming that\nobjects of thought (διάνοια) are\nIdeas, because Plato stated in Rep. 511d2–3 that they\nare “intelligible given a principle”\n(καίτοι\nνοητῶν ὂντων\nμετ’ ἀρκῆς), and, as\nCook Wilson saw the matter: “nothing but an\nιδέα can be an object of\nνοῦς” (OPD, 259).\n\nHe also argued that universals being ‘one’ in contrast\nwith the ‘many’ to which they correspond, there could be\nonly one ‘Circularity’, one ‘number Two’, etc.\nThis means that, for example, ‘the number Two’ or the\nuniversal ‘twoness’ being one, it cannot be a plurality\ncomposed of units and thus that ‘two and two make four’ is\nnot an addition of universals such as ‘twoness and twoness make\nfourness’ or ‘the number Two added to the number Two makes\nthe number Four’. These expressions have no sense according to\nCook Wilson, for whom ‘two and two make four’ merely means\nthat ‘any two things added to any other two things make four\nthings’ (OPD, 249). This is why numbers qua universals\nare ‘unaddible’ or ‘uncombinable’\n(ἀσύμβλητοι) as\nAristotle put it in, e.g., Met. M 8 1083a34, a view that Cook\nWilson takes to be “exactly the Platonic doctrine” (OPD,\n250).\n\nThe need to posit ‘intermediates’ can be seen as arising\nfrom the fact that one cannot perform arithmetical operations on these\n‘Idea numbers’, as Cook Wilson called them, while one\nwould need entities that are ‘in between’ (τά\nμεταξύ) sensible things and Idea numbers\nto account for arithmetical truths as elementary as ‘two and two\nmake four’. Cook Wilson nevertheless argued against commitment\nto ‘intermediates’ (OPD, §4), his view being that\narithmetical operations are always on particulars and if the\n‘monadic numbers’ of arithmetic are plurality of units,\nIdea numbers are properties of these numbers. That Plato had reached\nthis view of Idea numbers as\nἀσύμβλητοι\nἀριθμοί at the time he wrote the\nRepublic or later on would be yet another issue.\n\nCook Wilson also argued (OPD, §5) that Idea numbers form a series\nordered by a relation of ‘before and after’\n(πρότερον καὶ\nὔστερον) and, following\nAristotle’s testimony in Eth. Nic. I 6,\n1096a17–19 and Met. B 3, 999a6–14, that there\ncould be no genus of the species forming such ordered series (for a\ncritique of this reading of Aristotle, see Lloyd (1962)). In other\nwords, there can be no Form or universal of the Idea numbers. He would\nthus claim that in the proposition ‘The number Two is a\nuniversal’, the expression ‘a universal’ cannot\ndenote in turn a particularization of ‘universalness’,\nbecause the latter is not a true universal as it lacks an\n“intrinsic character” (SI, 342 n.1 & 351), and this he\ntook to be the point of Plato’s doctrine of “unaddible\nnumbers” (SI, 352).\n\nCook Wilson not only believed that these views are the true\ninterpretation of Plato, but also that they are true\nsimpliciter and he criticized Dedekind’s definition of\ncontinuity in Stetigkeit und die irrationale Zahlen (Dedekind\n1872) for “not realising the truth attained so long ago in Greek\nphilosophy that [numbers] are Universals” and not magnitudes\n(OPD, 250, n.1 & SI, ciii) (Joseph 1948, 59–60). He never\nexplained in any details how this critique is supposed to work against\nDedekind, but provided instead lengthy and unconvincing arguments for\nalso rejecting Russell’s logicist definition of natural numbers\non similar ground (see section 8).\n\nDespite the fact that he drew such preposterous consequences from it,\nCook Wilson’s reading of Plato and Aristotle in OPD remained\ninfluential, albeit controversial, throughout the last century,\nthrough Ross’ edition of Aristotle’s Metaphysics\n(1924, liii–lvii, ad B 3, 999a6–10 & M 6,\n1080a15–b4) and especially through its advocacy by Harold\nCherniss in Aristotle’s Criticism of Plato and the\nAcademy (Cherniss 1944, App. vi) and The Riddle of the Early\nAcademy (Cherniss 1945, 34–37 & 76). Cherniss’\nstudent Reginald Allen still claimed in the 1980s that Cook\nWilson’s is the “true view of Plato’s\narithmetic” (Allen 1983, 231–233). (For further\nendorsements of Cook Wilson’s reading see (Joseph 1948, 33 &\nchap. v), (Klein 1968, 62) or (Tarán 1981, 13–18) and for\ncriticisms see (Hardie 1936, chap. vi), (Austin 1979, 302) or\n(Burnyeat 2012, 166–167).)\n\nCook Wilson’s other notable contribution is the provision, in\n‘On the Geometrical Problem in Plato’s Meno, 86e\nsqq.’ (GPP), of a key addition to S. H. Butcher’s\nclarification (1888) of the notoriously obscure geometrical\nillustration of Meno 86e–87b, showing that Plato did\nnot intend to offer an actual solution to the problem of the\ninscription of an area as a triangle within a circle, but simply to\ndetermine, while alluding to the method of analysis, the possibility\nof its solution. An analogous explanation of that passage was provided\nlater on by T. L. Heath (1921, 298–303) and A. S. L. Farquharson\n(1923), while Knorr (1986, 71–74) and Menn (2002, 209–214)\ndefended this interpretation without mention of Cook Wilson. (See also\nthe critical discussion of the ‘Cook Wilson/Heath/Knorr\ninterpretation’ in (Lloyd 1992), as well as (Scott 2006,\n133–137) and (Wolfsdorf 2008, 164–169).)\n\nApart from these, Cook Wilson’s impact seems to have been\nlimited to minute points of philology, such as the references to his\ncritical comments on Apelt’s edition of De Melisso Xenophane\nGorgia (APT) in (Kerferd 1955) or to his pamphlet on the\nTimaeus in A. E. Taylor’s and F. M. Cornford’s\nown commentaries of that dialogue, and the critical discussion of his\nviews in Ross’ edition of Aristotle’s Prior and\nPosterior Analytics (Ross 1949, 496–497).\n\nGiven that Cook Wilson’s views on knowledge and belief (see\nsection 5) are linked to Plato’s own distinction between\nἐπιστήμη and\nδόξα, it is worth mentioning that they also had an\nimpact on the study of Plato’s dialogues. For example, although\nA. D. Woozley held a different view of knowledge as “not\nsomething generically different from belief, but as the limited case\nof belief” (Woozley 1949, 193), Cook Wilson’s distinction\nbetween knowledge and belief is introduced as an interpretative tool\nin chapter 8 of R. C. Cross and A. D. Woozley, Plato’s\nRepublic. A Philosophical Commentary (Cross & Woozley 1964),\nwhile the idea that knowledge involves ‘reflection’ (the\n‘accretion’ described in section 5) and the concept of\n‘being under the impression that’ are involved in\nRyle’s discussion of knowledge in Plato’s\nTheaetetus (Ryle 1990, 23 & 27–28). (For a similar\nclaim about Theaetetus, see Prichard (1950, 88), and for Ryle\non Cook Wilson on Parmenides, see end of section 7.) The\nimpact of Cook Wilson’s views was at any rate not limited to\nPlato studies: they form, for example, the basis for H. A.\nPrichard’s critique of Kant in his Kant’s\nTheory of Knowledge (Prichard 1909) or of his lectures on the\nDescartes, Locke, Berkeley and Hume on knowledge (Prichard 1950, chap.\n5). (See in particular Prichard (1909, 245), quoted below or (1950,\n86, 88 & 96) for statements of the distinction between knowledge\nand belief.)\n3. On Method: Ordinary Language\n\nIf Cook Wilson’s reverence towards ordinary language derived\nfrom his training as a philologist, it was not limited to occasional\nreferences to instances of usage to buttress his arguments. He\nbelieved that in philosophy one must above all “uncompromisingly\n[…] try to find out what a given activity of thought\npresupposes as implicit or explicit in our consciousness”, i.e.,\nto “try to get at the facts of consciousness and not let them be\noverlaid as is so commonly done with preconceived theories” (SI,\n328). He also spoke of the latter as originating in ‘reflective\nthought’ and argued it has two major defects. First, it is based\non principles that, for all we know, might be false and,\nconcomitantly, it is too abstract, because it is not based on the\nconsideration of particular concrete examples. Indeed, in a passage\nwhere he criticized Bradley’s regress arguments against the\nreality of relations (Bradley 1897, chap. III), Cook Wilson begins by\npointing out that “throughout this chapter there is not a single\nillustration, though it is of the last importance that there should\nbe” (SI, 692). (On this critique of Bradley, see also Joseph\n(1916a, 37).) This is, however, slightly misleading, given that\nBradley opens his discussion in his previous chapter, where a first\nregress is deployed, with the case of a lump of sugar (Bradley 1897,\n16).) As H. H. Price put it later, for Cook Wilson and his epigones\n“to philosophize without instances would be merely a waste of\ntime” (Price 1947, 336).\n\nSecondly, Cook Wilson thought that philosophers are most likely to\nintroduce distinctions of their own that do not correspond to the\n‘facts of consciousness’ and thus distort our\nunderstanding of them. He therefore strove to uncover these\n‘facts of consciousness’ through an analysis of concrete\nexamples which would be free of philosophical jargon. This is strongly\nreminiscent of the ‘descriptive psychology’ of the\nBrentano School. As a matter of fact, Gilbert Ryle, who described\nhimself as a “fidgetty Cook Wilsonian” in his youth (Ryle\n1993, 106) and who was also probably the only Oxonian who knew\nsomething about phenomenology in the 1920s, believed Cook\nWilson’s descriptive analyses to be as good as any from Husserl\n(Ryle 1971, vol. I, 176 & 203n.).\n\nIn what may be deemed a variant of the ‘linguistic turn’,\nCook Wilson believed that an examination of the “verbal\nform of statement” was needed in order “to see what light\nthe form of expression might throw upon problems about the mental\nstate” (SI, 90), thus that ordinary language would be the guide\nto the ‘facts of consciousness’, because it embodies\nphilosophically relevant distinctions:\n\nIt is not fair to condemn the ordinary view wholly, nor is it safe:\nfor, if we do, we may lose sight of something important behind it.\nDistinctions in current language can never safely be neglected. (SI,\n46)\n\n\nThe authority of language is too often forgotten in philosophy, with\nserious results. Distinctions made or applied in ordinary language are\nmore likely to be right than wrong. Developed, as they have been, in\nwhat may be called the natural course of thinking, under the influence\nof experience and in the apprehension of particular truths, whether of\neveryday life or of science, they are not due to any preconceived\ntheory. In this way the grammatical forms themselves have arisen; they\nare not the issue of any system, they are not invented by any one.\nThey have been developed unconsciously in accordance with distinctions\nwhich we come to apprehend in our experience. (SI, 874)\n\n\nReflective thought tends to be too abstract, while experience which\nhas developed the popular distinctions recorded in language is always\nin contact with the particular facts. (SI, 875)\n\n\nFor this reason, Cook Wilson considered it “repugnant to create\na technical term out of all relation to ordinary language” (SI,\n713) and SI is replete with appeals to ordinary language. For example,\nhe argued in support of his views on universals that “ordinary\nlanguage reflects faithfully a true metaphysics of universals”\n(SI (208), see section 7). But such appeals were not just meant to\nundermine ‘preconceived theories’, they were also\nconstructive, e.g., when he distinguished between the activity of\nthinking and ‘what we think’, i.e., between\n‘act’ and ‘content’ (SI, 63–64), arguing\nthat this is “likely to be right” because “it is the\nnatural and universal mode of expression in ordinary untechnical\nlanguage, ancient and modern” (SI, 67) and “it comes from\nthe very way of speaking which is natural and habitual with those who\ndo not believe in any form of idealism” (SI, 64). As it turns\nout, Cook Wilson believed that the ‘content’, i.e.,\n‘what we think’ is not about the thing we think\nabout, but the thing itself (so knowledge contains its object, see\nsection 6). \n\nThese views were to prove particularly influential in the case of J.\nL. Austin, who began his studies at Oxford four years after the\npublication of SI. It is a common mistake to think of Wittgenstein as\nhaving had some formative influence on Austin, as he was arguably the\nleast influenced by Wittgenstein of the Oxford philosophers (Hacker\n1996, 172). (On this point see also Marion (2011), for the contrary\nclaim, Harris & Unnsteinsson (2018).) At any rate, the evidence\nadduced here and elsewhere since Marion (2000) ought not to be ignored\nand, the philosophy of G. E. Moore notwithstanding, it is rather Cook\nWilson and epigones such as Prichard that are the source of the\npeculiar brand of ‘analytical philosophy’ that was to take\nroot in Oxford in the 1930s, known as ‘Oxford philosophy’\nor ‘ordinary language philosophy’. One merely needs here\nto recall the following well-known passage from Austin’s\n‘A Plea for Excuses’, which is almost a paraphrase of Cook\nWilson:\n\nOur common stock of words embodies all the distinctions men have found\nworth drawing, and the connections they have found worth marking, in\nthe lifetimes of many generations: these surely are likely to be more\nnumerous, more sound, since they have stood up to the long test of the\nsurvival of the fittest, and more subtle, at least in all ordinary and\nreasonably practical matters, than any that you or I are likely to\nthink up in our arm-chairs of an afternoon—the most favoured\nalternative method. (Austin 1979, 182)\n\n\nNeither Cook Wilson nor Austin believed, however, that ordinary\nlanguage was not open to improvements. Cook Wilson was explicit about\nthis when detailing his procedure:\n\n\nObviously we must start from the facts of the use of a name, and shall\nbe guided at first certainly by the name: and so far we may appear to\nbe examining the meaning of a name. Next we have to think about the\nindividual instances, to see what they have in common, what it is that\nhas actuated us. […] At this stage we must take first what\nseems to us common in certain cases before us: next test what we have\ngot by considering other instances of our own application of\nthe name, other instances in which has been working in us. Now when\nthus thinking of other instances, we may see that they do not come\nunder the formula that we have generalized. […] There is a\nfurther stage when we have, or think we have, discovered the nature of\nthe principle which has really actuated us. We may now correct some of\nour applications of the name because we see that some instances do not\nreally possess the quality which corresponds to what we now understand\nthe principle to be. This explains how it should be possible to\ncriticize the facts out of which we have been drawing our data. (SI,\n44–45)\n\n\nAustin’s ‘linguistic phenomenology’ (Austin 1979,\n182) was devised along similar lines (on this point, see Longworth\n2018a), and he also thought that ordinary language could be improved\nupon:\n\n\nCertainly ordinary language has no claim to be the last word, if there\nis such a thing. […] ordinary language is not the last\nword: in principle it can everywhere be supplemented and improved upon\nand superseded. Only remember, it is the first word. (Austin\n1979, 185)\n\n\nIt is worth noting that Cook Wilson uses in the above passage the\nexample of Socrates’ search for definitions as an illustration\nof his procedure. This strongly suggests that he derived it from\nconsideration of the method of induction\n(ἐπαγωγή) in Ancient philosophy:\ncollect first a number of applications of a given term and, focussing\non salient features of these cases, formulate as an hypothesis a\ngeneral claim covering them, then test it for counterexamples against\nnovel applications. (Longworth (2018a) has also drawn some interesting\nparallels with ‘experimental mathematics’ (see Baker\n(2008) and the entry to this Encyclopedia).)\n4. Apprehension & Judgement\n\nSince Cook Wilson’s philosophy was largely defined in opposition\nto British Idealism, it is worth beginning with some points of\nexplicit disagreement. Roughly put, under the idealist view knowledge\nis constituted by a coherent set of mutually supporting beliefs, none\nof which are basic, while others would be derivative. Surprisingly,\nwhen H. H. Joachim published The Nature of Truth (1906),\nperhaps the best statement of the coherence theory of truth usually\nattributed to the British Idealists, Cook Wilson criticized him for\nrelying on a discredited ‘correspondence’ theory (SI,\n809–810). Cook Wilson did not argue directly against the\ncoherence theory, as Russell did (Russell 1910, 131–146), but\nsimply took the opposite foundationalist stance. He reasoned that the\nchain of justification ought to come to an end and that this end point\nis some non-derivative knowledge, which he called\n‘apprehension’ (SI, 816). As he put it: “it becomes\nevident that there must be apprehensions not got by inference or\nreasoning” (UL, § 18).\n\nAs Farquharson noted (SI, 78 n.), Cook Wilson did not define his key\nnotion of ‘apprehension’. (This is related with Cook\nWilson’s claim discussed in section 5 that knowledge is\nundefinable.) The notion appears to be at the same time close to\nAristotle’s ‘noesis’ and to Russell’s\n‘acquaintance’. Cook Wilson obviously took his lead from a\ntradition beginning with Posterior Analytics B 19 and his\ncomments are reminiscent of Thomas Reid, who argues in his Essays\non the Intellectual Powers of Man (Bk. II, chap. v) that\nperception involves some conception of the object and the conviction\nof its existence, this conviction being immediate, non-inferential and\nnot open to doubt. Cook Wilson was not exactly faithful to Aristotle\nand Reid, however, since he argued that apprehensions can be both\nperceptual and non-perceptual (SI, 79), and that some are obtained by\ninference while some are not, the latter being the material of\ninference (SI, 84–85). Furthermore, he argued that perceptual\napprehensions should not be confused with sensations, as the mere\nhaving of a sensation is not yet to know what the sensation is, an\nidea that has echoes in Austin (Austin 1979, 91–94 & 122\nn.2). For this, one needs an “originative act of\nconsciousness” that goes beyond mere passivity and compares the\nsensation in order to apprehend its definite character. As Cook Wilson\nput it: “we are really comparing but we do not recognize that we\nare” (SI, 46).\n\nCook Wilson thought it misleading to base logic on\n‘judgement’ instead of ‘proposition’ or\n‘statement’ (SI, 94) and he questioned the traditional\nanalysis of proposition under the form ‘S is\nP’, which he saw has having various meanings (Joseph\n(1916a, 6), see also section 9 for a related point). In his polemics\nagainst idealism, Cook Wilson’s main target was the traditional\ntheory of judgement that one finds, e.g., in Bradley’s\nPrinciples of Logic (Bradley 1928), where the topic is simply\ndivided into ‘judgement’ and ‘inference’.\nThere would thus be a common form of thinking called the\n‘judgement’ that ‘S is P’,\nwhich would include non-inferred knowledge, opinion, and belief, but\nwould exclude inferred knowledge. One would be misled, he argued, by\nthe common verbal form ‘S is P’ that\nknowledge, belief, and opinion are species of the same genre called\n‘judgement’ (SI, 86–7). He claimed instead to follow\n‘ordinary usage’ in adopting a ‘judicial’\naccount of ‘judgement’:\n\nA judgement is a decision. To judge is to decide. It implies previous\nindecision; a previous thinking process, in which we were doubting.\nThose verbal statements, therefore, which result from a state of mind\nnot preceded by such doubt, statements which are not decisions, are\nnot judgements, though they may have the same verbal form as\njudgements. (SI, 92–3)\n\n\nHe further argued first that inferring is thus one of the forms of\njudgement: “if we take judging in its most natural sense, that\nis as decision on evidence after deliberation, then inferring is just\none of those form of apprehending to which the words judging and\njudgement most properly apply” (SI, 86). Some inferences are,\nhowever, immediately apprehended, e.g., when one recognizes that it\nfollows from ‘if p, then q’ and\n‘p’, that ‘q’. Furthermore,\nthe presence of a prior indecision or doubt, as opposed to confidence,\nis deemed an essential ingredient of judgement. It does not, however,\nfully put an end to doubt: as a judge may well be mistaken, our\nordinary judgements “form fallible opinions only” (Joseph\n1916a, 160).\n\nNow, if indecision and doubt are involved prior to judgement,\napprehension or knowledge (perceptual or not) could not be judgement,\nbecause, by definition, there is no room for doubt in these cases.\nWhen one is of the opinion that p, one has found the evidence\nbeing in favour of p, without being conclusive. But Cook\nWilson thought statements of opinion as not involving the expression\nof a decision, so they not judgement either:\n\n\nIt is a peculiar thing—the result of estimate—and we call\nit by a peculiar name, opinion. For it, taken in its strict and proper\nsense, we can use no term that belongs to knowing. For the opinion\nthat A is B is founded on evidence we know to be insufficient, whereas\nit is of the very nature of knowledge not to make its statements at\nall on grounds recognized to be insufficient, nor to come to any\ndecision except that the grounds are insufficient; for it is here that\nin the knowing activity we stop. (SI, 99–100)\n\n\nMoreover, there is no ‘common mental attitude’ involved in\n‘knowing’ and ‘opining’:\n\n\nOne need hardly add that there is no verbal form corresponding to any\nsuch fiction as a mental activity manifested in a common mental\nattitude to the object about which we know or about which we have an\nopinion. Moreover it is vain to seek such a common quality in belief,\non the ground that the man who knows that A is B and the\nman who has that opinion both believe\nthat A is B. (SI, 100)\n\n\nIt is an important characteristic of ‘believing’, setting\nit apart from other ‘activities of consciousness’, that it\nis accompanied with a feeling of confidence, greater than in\nopining:\n\nTo a high degree of such confidence, where it naturally exists, is\nattached the word belief, and language here, as not infrequently, is\ntrue to distinctions which have value in our consciousness. It is not\nopinion, it is not knowledge, it is not properly even judgement. (SI,\n102)\n\n\nThe upshot of these remarks is that ‘knowledge’,\n‘belief’, and ‘opinion’ are not, as idealists\nwould have it, species of the same genre, ‘judgement’ or\n‘thinking’: these are all distinct and sui\ngeneris. This leads to the all-important distinction between\n‘knowledge’ and ‘belief’, discussed in the\nnext section: they do not merely differ in kind, they are not even two\nspecies of the same genus (Prichard 1950, 87). But Cook Wilson also\nheld the view that knowing is more foundational, so to speak, as it is\npresupposed by other ‘activities of thinking’ such as\njudging and opining. For example, opinion involves knowledge, but goes\nbeyond it:\n\n\nThere will be something else besides judgement to be recognized in the\nformation of opinion, that is to say knowledge, as manifested in such\nactivities as occur in ordinary perception; activities, in other\nwords, which are not properly speaking decisions. (SI,\n96)\n\n5. Knowing & Believing\n\nGiven that “our experience of knowing [is] the presupposition of\nany inquiry we can undertake”, Cook Wilson reasoned that\n“we cannot make knowing itself a subject of inquiry in the sense\nof asking what knowing is” (SI, 39). It follows immediately from\nthis impossibility of inquiring about the nature of knowledge that a\n‘theory of knowledge’ is itself impossible, a consequence\nhe first expressed in a letter to Prichard in 1904:\n\nWe cannot construct knowing—the act of\napprehending—out of any elements. I remember quite early in my\nphilosophic reflection having an instinctive aversion to the very\nexpression ‘theory of knowledge’. I felt the\nwords themselves suggested a fallacy. (SL, 803)\n\n\nKnowledge is sui generis and therefore a ‘theory’\nof it is impossible. Knowledge is simply knowledge, and an attempt to\nstate it in terms of something else must end in describing something\nwhich is not knowledge. (Prichard 1909, 245)\n\n\nThus, knowledge, as obtained in ‘apprehension’, could not\nbe defined in terms of belief augmented by some other property or\nproperties, as in the definition of knowledge as ‘justified true\nbelief’. Cook Wilson is thus to be counted among early\n20th-century opponents of this view (Dutant (2015), Le\nMorvan (2017) & Antognazza (2020)). This view is known since\nTimothy Williamson’s Knowledge and its Limits as\n‘knowledge first’ (see Williamson (2000, v) and Adam\nCarter, Gordon & Jarvis (2017) for recent developments of this\nview).\n\nAt the turn of the last century, it was also held by the neo-Kantian\nphilosopher Leonard Nelson (Nelson 1908 & 1949), to whom Cook\nWilson alludes in SI (872), but it was also held unbeknownst to him by\nmembers of the Brentano school, such as Adolf Reinach, Max Scheler,\nand Edmund Husserl. (See Mulligan (2014) for a survey.) It was to\nbecome the central plank of ‘Oxford Realism’. For the\nOxonians and the Brentanians one knows that p only if one\n‘apprehends’ that p. As Kevin Mulligan put it:\n“one knows that p in the strict sense only if one has\nperceived that p and such perceiving is not itself any sort\nof belief or judging” (Mulligan 2014, 382). A version of this\nview is defended today by Timothy Williamson, according to whom\nknowledge is a mental state “being in which is necessary and\nsufficient for knowing p” (Williamson 2000, 21),\nand which “cannot be analysed into more basic concepts”\n(Williamson 2000, 33). The claim is, however, about ‘knowledge\nthat p’ and not anymore about ‘apprehending that\np’.\n\nIf knowledge is indeed distinct from belief, then the difference\ncannot be one of degree in the feeling of confidence or in the amount\nof evidential support:\n\nIn knowing, we can have nothing to do with the so-called\n‘greater strength’ of the evidence on which the opinion is\ngrounded; simply because we know that this ‘greater\nstrength’ of evidence of A’s being B is compatible with\nA’s not being B after all. (SI, 100)\n\n\nTo know is not to have a belief of a special kind, differing from\nbeliefs of other kinds; and no improvement in a belief and no increase\nin the feeling of conviction which it implies will convert it into\nknowledge. (Prichard 1950, 87)\n\n\nAustin has a nice supporting example in Sense and Sensibilia,\nusing the fact that ‘seeing that’ is factive: if no pig is\nin sight, I might accumulate evidence that one lives here: buckets of\npig food, pig-like marks on the ground, the smell, etc. But if the pig\nsuddenly appears:\n\n\n… there is no longer any question of collecting evidence; its\ncoming into view doesn’t provide me with more evidence\nthat it’s a pig, I can now just see that it is, the\nquestion is settled. (Austin 1962, 115)\n\n\nThere is a parallel move by John McDowell in ‘Criteria,\nDefeasibility and Knowledge’ against the notion of\n‘criteria’, deployed by some commentators of Wittgenstein\nas a sort of ‘highest common factor’ between evidence and\nproof (McDowell 1998, 369–394). Here, a ‘highest common\nfactor’ would be a state of mind that would count as knowing,\ndepending on one or more added factors, but would count in their\nabsence as something else such as believing (McDowell 1998, 386).\nMcDowell is now seen as having thus put forward a form of\n‘disjunctivism’ about knowledge and belief (more on\ndisjunctivism in section 6). Although McDowell does not mention these\nauthors, Travis (2005) has shown that this move has roots in both Cook\nWilson and Austin. The fact that there is no highest common factor to\nknowledge and belief entails for Cook Wilson a rejection of\n‘hybrid’ and ‘externalist’ accounts of\nknowledge. Any ‘hybrid’ account would factor knowledge\ninto an internal part, possibly a copy of the object known, and a\nrelation of that copy to the object itself (see immediately below and\nsection 6). Since there is no such highest common factor, this view,\nintegral to ‘externalist’ accounts of knowledge, had to be\nrejected (Travis 2005, 287).\n\nBut Cook Wilson was led here to a further thesis. If one is prepared\nto say ‘I believe p’, when one is not sure that\nevidence already known is sufficient to claim that ‘I know that\np’, then it looks as if one should always be in a\nposition to know if one knows or if one merely believes. He argued,\nhowever, that ‘knowing that one knows’ should not mean\nthat, once a particular piece of knowledge has been obtained, one\nshould then decide if it counts as knowledge or not, because this\ndecision would count again as a piece knowledge and “we should\nget into an unending series of knowings” (SI, 107). This is why\nhe insisted that knowing that one knows “must be contained\nwithin the knowing process itself”:\n\n\nBelief is not knowledge and the man who knows does not believe at all\nwhen he knows: he knows it. (SI, 101)\n\nThe consciousness that the knowing process is a knowing process must\nbe contained within the knowing process itself. (SI, 107)\n\n\nThis claim was given further emphasis by Prichard, but his own\nformulation differ in an important respect, since he introduces the\nidea of a “reflection” in virtue of which when one knows\nthat p, one is able to know that one knows that p\nand, when one believes that p, one is also able to know that\none believes that p, so that it would be impossible to\nmistake knowledge for belief and vice-versa:\n\n\nWe must recognize that whenever we know something we either do, or at\nleast can, by reflecting, directly know that we are knowing it, and\nthat whenever we believe something, we similarly either do or can\ndirectly know that we are believing it and not knowing it. (Prichard\n1950, 86 & 88)\n\n\nOne can see that this is not quite Cook Wilson’s position, given\nhis regress argument. Prichard assumes that, whenever one does not\nknow, one knows that one does not know:\n\n\nWhen knowing, for example, that the noise we are hearing is loud, we\ndo or can know that we are knowing this and so cannot be mistaken, and\nwhen believing that the noise is due to a car we know or can know that\nwe are believing and not knowing this. (Prichard 1950, 89)\n\n\nCharles Travis called the claim that in knowing that p one\ncan always distinguish one’s condition from all states in which\nnot-p the ‘accretion’ (Travis (2005, 290) &\nKalderon & Travis (2013, 501)) and he argued that it damages the\ncore of Cook Wilson’s and Prichard’s positions (Travis\n2005, 289–294). To use the above example of the pig suddenly\ncoming into view, the claim is that, although one can know by\nreflection that one knows that one is seeing a pig, one cannot by mere\nreflection exclude the possibility that one is in fact seeing some\ncleverly engineered ‘ringer’. The upshot of this argument\nis not immediately clear: if it is the case that one knows p\nonly if p and one knows that one knows that p, how\ncould one be unable to exclude the case that not-p, hence\nthat one does not know p? At all events, Travis sees this as\nreinstalling the argument from illusion (Travis 2005, 291), that had\nalready been subjected to numerous critiques from an early paper by\nPrichard to Austin’s Sense and Sensibilia:\n\n\nThat statements about appearances imply that we at least know enough\nof reality to say that real things have certain possible\npredicates, e.g., bent or convergent. To deny this is to be wholly\nunable to state how things look. […] It is only because we know\nthat our distance from an object affects its apparent size that we can\ndraw a distinction between the size it looks and the size it is. If we\nforget this we can draw no distinction at all. (Prichard 1906,\n225–226)\n\n… it is important to remember that all talk of deception only\nmakes sense against a background of general non-deception.\n(You can’t fool all the people all of the time.) It must be\npossible to recognize a case of deception by checking the odd\ncase against more normal ones. (Austin 1962, 11)\n\n\nGuy Longworth (2019) has detailed how much Austin owed to Cook Wilson\non knowledge (see Urmson (1988) for a discussion in relation to\nPrichard): Austin held the ‘knowledge first’ view and,\nconcomitantly, rejected the possibility of a theory of knowledge\n(Austin 1962, 124), he viewed knowledge as akin to proof, thus as\nbeing different in kind from belief on accumulation of evidence (see\nAustin (1962, 115) & (1979, 99)). But Austin dropped the\n‘accretion’ in ‘Other Minds’ as he shifted the\nanalysis of the claim that ‘If I know, I can’t be\nwrong’ (SI (69) & Prichard (1950, 88)) to that of ‘I\nknow that p’ as providing a form of warrant,\none’s authority for saying that p (Austin 1979,\n99–100). Krista Lawlor (2013) recently suggested that Austin\nintroduced here the speech act of ‘assurance’. (Although\nit has been claimed that the idea of ‘performatives’\noriginates in an exchange of letters on promises with Prichard\n(Warnock 1963, 347), that dimension remained unexplored in Oxford\nRealism before Austin, who was consciously moving away here from\nstrict focus on ‘statements’.) \n\nThe ‘accretion’ raises indeed an issue concerning\n‘other minds’, given that it is one’s reflective\nview that, supposedly, authoritatively determines that one knows:\ncould there be other ways to determine whether someone else knows?\n(See Longworth (2019).) This is how Austin, who also viewed knowledge\nas a state of mind, was arguably led to explore the ramifications the\nchallenge ‘How do you know?’ to the person claiming\n‘I know’. Although he warned against the\n‘descriptive fallacy’ (Austin 1979, 103), Austin’s\nclaim appears to be, rather, that ‘I know’ has functions\n“over and above describing the subjective mental state of\nknowing” (Longworth (2019, 195), see Austin (1979,\n78–79)).\n\nTo come back to Cook Wilson, he grappled here with related problems.\nIt is implied by the above that knowledge requires a sort of warrant\nvery much akin to a proof and, consequently, “we are forced to\nallow that we are certain of very much less than we should have said\notherwise” (Prichard 1950, 97). Mathematical knowledge appears\nparadigmatic. As Prichard put it: “In mathematics we have,\nwithout real possibility of question, an instance of knowledge; we are\ncertain, we know” (Prichard 1919, 302). (Joseph used\nthis view to argue against Mill’s empiricist account of\nmathematics, using ‘intuition’ where Cook Wilson would use\n‘apprehension’ (Joseph 1916a, 543–553).) Alas, Cook\nWilson put forth the axiom of parallels in Euclidean geometry as an\nexample of knowledge, and dismissed non-Euclidean geometries as\ninconsistent (see section 1). If for any p such as the axiom\nof parallels, someone fails to ‘apprehend’ it, then all he\ncould do is, somehow lamely, ask them to try and “remove\n[…] whatever confusions or prejudices […] prevent them\nfrom apprehending the truth of the disputed proposition”\n(Furlong 1941, 128).\n\nThis reply raises a prima facie problem for Cook Wilson,\nbecause he could not have known, in the sense of ‘knowing\np only if p’, that ‘non-Euclidean\ngeometries are inconsistent’, since it has been proved that they\nare not. He thus unwittingly provided an illustration of the need to\naccount, from his own internalist standpoint, for the sort of error\n(or ‘false judgement’) committed when one claims to know\nthat p, while it is the case that not-p. For someone\nto know or to be in error while thinking that one knows would just be\ntwo undistinguishable states, since which of the two happens to be the\ncase would depend on some external factors:\n\n… the two states of mind in which the man conducts his\narguments, the correct and the erroneous one, are quite\nundistinguishable to the man himself. But if this is so, as the man\ndoes not know in the erroneous state of mind, neither can he know in\nthe other state. (SI, 107)\n\n\nCook Wilson saw this a threat to the very possibility of demonstrative\nknowledge, since one would never be sure that any demonstration is\ntrue (SI, 107–108). Answering the threat, he would need here is\nthus to make room for errors—when one thinks that one knows but\none does not—but without excluding by the same token the\npossibility that knowing entails being in a position that one knows\nthat one knows.\n\nCook Wilson was thus led to distinguish, in some of his most\nintriguing descriptive analyses, a further ‘form of\nconsciousness’, different from both knowledge and belief (or\nopinion), which he called ‘being under the impression\nthat’ (SI, 109–113). A typical example being when one sees\nthe back of Smith on the street and, ‘being under the impression\nthat’ it is a friend, say Jones, one slaps him on the back, only\nto realize one’s mistake when he turns his head. The\n“essential feature” of this state of mind is, according to\nCook Wilson, “the absence of any sense of uncertainty or doubt,\nthe action being one which would not be done if we felt the slightest\nuncertainty” (SI, 110). Thus, one did not falsely judge that the\nman on the street was Jones, because there was no judgement at all:\none was merely ‘under the impression that’ it was him.\nMaybe one had some evidence that it was Jones, but the point is that\none acted on it without questioning the evidence: it was not used as\nevidence, there was no assessment out of which one may be said to\nprefer this possibility that other possibility, because no other\npossibility was entertained. In this state of mind, the possibility of\nerror is somehow excluded, given that it does not occur to one that\n‘This man is Jones’ might be false. It is thus not the\ncase that one thought that one knew but really did not, because it is\nnot true that to begin with one thought one knew, since one had not\nreflected on one’s evidence. The absence of doubt or uncertainty\nopens the door to the possibility of being mistaken while taking\noneself as being certain.\n\nThe notion of ‘being under the impression that’ played a\nsignificant role in the writings of the Oxford Realists, not just\nthose of Prichard, who also spoke of the ‘an unquestioning frame\nof mind’, ‘thinking without question’ or\n‘taking for granted’ (Prichard 1950, 79 &\n96–98), but also those of William Kneale, H. H. Price and J. L.\nAustin—see, e.g., Kneale (1949, 5 & 18), Price (1935), and\nAustin (1962, 122). Perhaps most strikingly, Prichard was to drop the\n‘accretion’ and argue in a late essay,\n‘Perception’, that perception is not a kind of knowing: we\nmerely see colour extensions, which we systematically mistake for\nobjects or ‘take for granted’ to be objects (Prichard\n1950, 52–68). Still, the notion of ‘being under the\nimpression that’ had its critics at Oxford, such as H. P. Grice,\nwho was aware of the difficulties raised by the\n‘accretion’:\n\n\nThis difficulty led Cook Wilson and his followers to the admission of\na state of “taking for granted”, which supposedly is\nsubjectively indistinguishable from knowledge but unlike knowledge\ncarried no guarantee of truth. But the modification amounts to\nsurrender; for what enables us to deny that all of our so-called\nknowledge is really only “taking for granted”? (Grice\n1989, 383–384)\n\n\nOne may also justifiably feel that Cook Wilson has not fully explained\naway cases of error such as his own in being certain that\n‘non-Euclidean geometries are inconsistent’, because his\nconviction was not the result of merely ‘being under the\nimpression that’.\n\nNevertheless, the influence of Cook Wilson’s conceptions was\nfelt in a variety of ways in the second half of the last century. H.\nH. Price offered in Belief an important commentary on Cook\nWilson’s notion of ‘being under the impression that’\n(Price (1969, 204–220), reprising some of the content of Price\n(1935)). He deemed it an important addition to the traditional\n‘occurrence’ analysis of belief, as opposed to the\n‘dispositional’ analysis. Price usefully contrasted\n‘being under the impression that’ with\n‘assent’ (Price 1969, 211–212), which is usually\nsaid to involve preference and confidence: in prefering p one\nwould decide in favour of p having alternatives q\nand r in mind, but this is precisely not the case when\n‘being under the impression that’, since in this state one\ndoes not entertain alternatives. As Cook Wilson points out,\n“there is a certain passivity and helplessness” involved\n(SI, 113). There is no confidence either, since in this state of mind\ndoubt is not an option, hence no degree of certainty is involved.\nPrice also explored (1969, 212–216) connections between this\nunquestioning state of mind and the notion of ‘primitive\ncredulity’ (Bain 1888, 511), i.e., the idea harking back to\nSpinoza (Ethics IIp49s) that one naturally believes in the\nreality of anything that is presented to one’s mind, unless some\ncontradicting evidence is also occurring.\n\nIn contrast to Price, Jonathan Cohen argued that beliefs are\ndispositions (Cohen (1989, 368) & (1992, 5)). He also rejected the\nCook Wilson’s claim that belief involves confidence (see section\n4), but, without crediting him (except privately), Cohen made use of\n‘being under the impression that’ to define belief as a\ndisposition to ‘normally to feel that p’ or\n‘to feel it true that p’ (Cohen (1989, 368) &\n(1992, 7)). So defined, belief would thus differ from\n‘acceptance’, which results from a conscious and voluntary\nchoice and involves, like Price’s ‘assent’,\npreference and confidence. Cohen further added to these differences\nthat acceptance is also subjectively closed under deductibility, while\nthis is not the case with belief:\n\n\n… you may well feel it true that p and that\nif p then q, without feeling it true\nthat q. You will just be failing to put two and two together,\nas it were. And detective-story writers, for example, show us how\noften and easily we can fail to do this with our beliefs. (Cohen 1992,\n31–32)\n\n\nSo acceptance of p involves ‘premissing’, i.e.,\nthe decision to use p as a premise or rule of inference in\nfurther reasonings, and Cohen thought that he was carving nature at\nits joint here: “Belief is a disposition to feel, acceptance a\npolicy for reasoning” (Cohen 1992, 5). This is in many ways not\nfaithful to Cook Wilson’s original ideas, but one can sense\ntheir presence within the idea of being unreflectively disposed to\nfeel that p being conceptually distinct from accepting\np.\n\nOn another note, John McDowell described knowledge in ‘Knowledge\nand the Internal’ as a “standing in the space of\nreasons” and argued against an “interiorization of the\nspace of reasons” that would occur if one were to think of\nknowledge as achieving flawless standings in the space of reason,\n“without needing the world to do us any favours” (McDowell\n1998 395–396). If appearances were to be misleading, it would be\nargued that this not be the result of faulty moves within the space of\nreason but simply an “unkindness of the world”. This\nconception, McDowell sees as opening the door to an\n‘hybrid’ account of knowledge, with flawless standings in\nthe space of reasons as an internal part, which would provide\nnecessary conditions for knowledge, and favours from the\nworld—when thing are as they appear to be—as an extra\ncondition (McDowell 1998, 400). But, McDowell concludes, “the\nvery idea of reason as having a sphere of operation within which it is\ncapable of ensuring, without being beholden to the world that\none’s postures are all right […] has the look of a\nfantasy” (McDowell 1998, 405). This is so precisely because the\nresources from the space of reasons could not provide factiveness on\ntheir own, so knowledge could not be completely constituted\nby standings within it. To rid oneself of the fantasy, one needs\nsimply to recognize that on occasions when the world is what it\nappears to be, this favour is “not extra to the person’s\nstanding in the space of reasons” (McDowell 1998, 405) and that\n“we are vulnerable to the world’s playing us false; and\nwhen the world does not play us false we are indebted to it”\n(McDowell 1998, 407). Here too, although the terminology is taken from\nWilfrid Sellars, there is a recognizable source in Cook Wilson.\n\nFinally, another significant development related to the\n‘accretion’ is its connection with the ‘knowing that\none knows’ principle in epistemic logic, first introduced in\nJaakko Hintikka’s ground-breaking Knowledge and Belief\n(Hintikka 1962). Hintikka argued for the equivalence between ‘I\nknow that p’ and ‘I know that I know that\np’ or, more generally, that ‘i knows\nthat p’ (Kip) implies\n‘i knows that i knows that p’\n(KiKip) (Hintikka 1962, chap. 5). In\nconnection with this, he noticed that Prichard’s introduction\nthe idea of “reflection” (see Prichard (1950, 88) quoted\nabove) turns the argument into an argument from introspection that\ndoes not sustain the more general claim that ‘i\nbelieves that p’ (Bip) implies\n‘i knows that i believes that\np’ (KiBip) (Hintikka\n1962, 109–110). Still, Hintikka thought that Cook Wilson and\nPrichard would be right, if their remarks were to be understood as\nrestricted to the case where i is the first-person pronoun\n‘I’ (Hintikka 1962, 110). \n\nAlthough Williamson has picked up the Oxonian banner of\n‘knowledge first’, this is one point where he did not\nfollow Cook Wilson and Prichard, since he argued against the\n‘knowing that one knows’ principle with help of the notion\nof ‘luminosity’. A condition C is said to be\n‘luminous’ if and only if for every case a, if C\nobtains in a then in a one is in a position to know\nthat C obtains (Williamson 2000, 95). Williamson (2000, chap. 4)\nprovided arguments against ‘luminosity’, thus that one can\nknow without being able to know that one knows. \n6. Perception\n\nCook Wilson also argued against idealism that in apprehension it is\nneither the case that the object exists only within the apprehending\nconsciousness, nor that it is constituted by it: the object is\nindependent of the apprehending consciousness. As he wrote: “the\napprehension of an object is only possible through a being of the\nobject other than its being apprehended, and it is this being, no part\nitself of the apprehending thought, which is what is\napprehended” (SI, 74). This independence, he considered to be\npresupposed by the very idea of knowledge expounded above. But he\nfurther rejected the distinction between act, content and object of\nperception, first by negating the act-object distinction:\n\n\nIn our ordinary experience and in the sciences, the thinker or\nobserver loses himself in a manner in the particular object he is\nperceiving or the truth he is proving. That is what he is thinking\nabout, and not about himself; and, though knowledge and perception\nimply both the distinction of the thinker from the object and the\nactive working of that distinction, we must not confuse this with the\nstatement that the thinking subject, in actualizing this distinction,\nthinks explicitly about himself, and his own activity, as distinct\nfrom the object. (SI, 79)\n\n\nAnd, secondly, by rejecting the notion of ‘content’:\n“For the only thing that can be found as ‘content’\nof the apprehending thought is the nature of the object\napprehended” (SI, 75). Austin echoed this last point saying that\n“our senses are dumb” (Austin 1962, 11). (There is an\nextensive literature on this claim, see, e.g., (Travis 2004) or\n(Massin 2011).) The point is not that perception does not aim at an\nobject, but merely to deny that it does so through a\n‘content’ acting as intermediary:\n\nwhat I think of the red object is its own redness, not some mental\ncopy of redness in my mind. I regard it as having real redness and not\nas having my copy of redness. […] If we ask in any instance\nwhat it is we think of a given object of knowledge, we find it always\nconceived as the nature or part of the nature of the thing known. (SI,\n64)\n\n\nWhat one apprehends must be the real object itself, not “some\nmental copy” of it, so Cook Wilson is claiming here that, as a\nstate of mind, knowledge contains its object: “what we apprehend\n[…] is included in the apprehension as a part of the activity\nor reality of apprehending” (SI, 70). A long letter to G. F.\nStout (SI, 764–800) is of particular importance here, where Cook\nWilson criticized Stout on ‘Primary and Secondary\nQualities’ (Stout 1904), with this key diagnosis, of the\n‘objectification of the appearing as appearance’:\n\n\nThis is sometimes spoken from the side of the object as the\nappearance of the object to us. This ‘appearance’\nthen gets distinguished from the object […] But next the\nappearance, though properly the appearing of the\nobject, gets itself to be looked on as itself an object and the\nimmediate object of our consciousness, and being already, as we have\nseen, distinguished from the object and related to our subjectivity,\nbecomes, so to say, a merely subjective\n‘object’—‘appearance’ in that sense. and\nso, as appearance of the object, it has now to be represented\nnot as the object but as some phenomenon caused in our consciousness\nby the object. Thus for the true appearance (= appearing) to us of the\nobject is substituted, through the\n‘objectification’ of the appearing as appearance, the\nappearing to us of an appearance, the appearing of a\nphenomenon caused in us by the object. (SI, 796)\n\n\nCook Wilson’s rejection of ‘hybrid’ accounts of\nknowledge (see the previous section) is linked to his rejection of\nepistemological ‘intermediaries’, so that knowledge could\nnot be of some such ‘objectified’ appearance. He\nconsidered all such intermediaries (‘images’,\n‘copies’, ‘representative’, tertium\nquid, etc.) as “not only useless in philosophy but\nmisleading as tending to obscure the solution of a difficult\nproblem” (SI, 772). In this he stood in the tradition of Thomas\nReid, his arguments were as a matter of fact first developed against\nthe empiricism of Locke, Berkeley and Hume (for example in UL (§\n10)). In his letter to Stout, Cook Wilson put it thus:\n\n\nYou begin an important section of your argument by assuming the idea\nof sensations being representative.\n\nThey {represent—express—stand for} something other than\nthemselves.\n\nNow, I venture to think that the idea of such representation\nin philosophy, or psychology rather, is very loose and treacherous\nand, if used at all, should be preceded by a ‘critique’ of\nsuch representative character, and an explanation of the\nexact sense in which the word representative is used. (SI, 769)\n\n\nAgainst views of this kind, Cook Wilson developed three arguments in\nhis letter. First, he pointed out that it is impossible to know\nanything about the relation between the representative and the object,\nsince one can never truly compare the former to the latter. Secondly,\nhe claimed that representationalist theories are always in danger of\nleading towards idealism, since one must then somehow\n‘prove’ the existence of the object which is, so to speak,\n‘behind’ its representatives—there might be none.\nThirdly, he claimed that all such theories beg the question, since the\nrepresentative has to be apprehended in turn by the mind, and not only\nthis further ‘apprehension’ remains unexplained, it would\nrequire that the mind be equipped with the very apparatus that the\nrepresentationalist theories were, to begin with, devised to\nexplain:\n\nWe want to explain knowing an object and we explain it solely in terms\nof the object known, and that by giving the mind not the object but\nsome idea of it which is said to be like it—an image (however\nthe fact may be disguised). The chief fallacy of this is not so much\nthe impossibility of knowing such image is like the object, or that\nthere is any object at all, but that it assumes the very thing it is\nintended to explain. The image itself has to be apprehended and the\ndifficulty is only repeated. (SI, 803)\n\n\nCook Wilson also inveighed against Stout’s notion of\n‘sensible extension’ pointing out inter alia that\nit makes no sense to claim that these are extended without being in\nspace (SI, 783) and he tried to explain how a given object may appear\nto have different shapes from different perspectives, without making\nan appeal to any representative (SI, 790f.).\n\nStout answered these criticisms in print (for a discussion see Nasim\n2008, 30–40 & 94–98). He argued that he had not been\nholding a view akin to Locke’s representationalism, claiming\nthat the ‘representative function’ of his\n‘presentations’ is of a different nature, more like a\nmemory-image would represent what is remembered (Stout 1911, 14f.),\nbut it is at first blush unclear what he meant by this. Against Cook\nWilson’s first argument, he claimed that in his conception\npresentations and presented objects form an “inseparable\nunity” (Stout 1911, 22), this being, once more, unclear. At all\nevents, both Stout and Russell, in his theory of\n‘sense-data’ as ‘objects of perception’\n(Russell 1912), insisted that the physical object and the\nrepresentative are ‘real’. But one might say that this\n‘objectification of the appearing as appearance’, does not\nannul Cook Wilson’s diagnosis of the difficulties inherent in\nthat position. At least Russell was clearer about its implications,\nrequiring a ‘logical construction’ of physical objects as\nfunctions of ‘sense-data’. One way to counter Cook Wilson\non the absurdity of the locution ‘sensible extensions’ is\nto distinguish between ‘private’ and ‘public’\nspace, as Russell was to do in ‘The Relation of Sense-Data to\nPhysics’ (Russell 1917, 139–171); as it is well-known,\nthis postulation generates its own set of difficulties, e.g., the\nclaim that space must have 6 dimensions (Russell 1917, 154). Russell\non ‘sense-data’ was to become a favourite target for\nPrichard’s acerbic wit (Prichard 1915 & 1928).\n\nCook Wilson also wove his joint critique of the ‘objectification\nof the appearing as appearance’ and of representationalism into\na broad historical narrative according to which “empiricism ends\nin the Subjective Idealism it was intended to avoid” (UL, §\n10, see also SI, 60–63); he spoke of an “insidious and\nscarcely ‘conscious’ dialectic” that “has done\nmuch mischief in modern metaphysics and theories of perception”\n(SI, 797). Wilfrid Sellars, who attended Prichard’s classes as a\nRhodes Scholar at Oxford in the mid-1930s, found the idea of such a\n‘dialectic’ appealing:\n\nI soon came under the influence of H. A. Prichard and, through him, of\nCook Wilson. I found here, or at least seemed to find, a clearly\narticulated approach to philosophical issues which undercut the\ndialectic, rooted in Descartes, which led to both Hume and 19th\nCentury Idealism. At the same time, I discovered Thomas Reid and found\nhim appealing for much the same reasons. (Sellars 1975, 284)\n\n\nAlthough Cook Wilson’s philosophy may be construed as a\ncontinuation of sorts of the Scottish School of Hutcheson and Reid\n(see also section 10), it is striking that there are hardly any\nreferences to these authors in his writings, even more so given that\nthey contain critiques of Locke, Berkeley and Hume from a similar\nstandpoint. (See Alsaleh (2003), focussing on attacks on Hume and\ntheir impact on Price (1932) and Austin (1962), and Marion (2009) for\nan overview of the 19th-century stages of this\n‘dialectic’).\n\nThere was, however, no doctrinal unity on perception among Cook\nWilson’s epigones. Prichard was probably the first to put Cook\nWilson’s views into print in ‘Appearances and\nReality’ (Prichard 1906) but, as already pointed out, he ended\nup arguing that in perception we systematically mistake colour\nexpanses for objects. H. H. Price, who was at first close to Cook\nWilson (Price 1924), incorporated a sense-data theory while rejecting\nphenomenalism in Perception (Price 1932). He became for that\nreason one of Austin’s targets in Sense and Sensibilia\n(Austin 1962), which remains, for all its novelty, faithful to Cook\nWilson’s orthodoxy on knowledge. At all events, a form of direct\nrealism in the theory of perception is one of the characteristic\nfeatures of Oxford Realism. It is an ancestor to contemporary variants\nsuch as the position argued for by John McDowell in Mind and\nWorld (McDowell 1994) and, after a long eclipse, Cook\nWilson’s views are once more playing a role in current debates\nabout perception. (See for example references to them in Kalderon\n(2011, 241; 2018, xv, 49, 88 & 184), Siegel (2018, 2), Stoneham\n(2008, 319–320).)\n\nOne topic of particular interest in this respect is\n‘disjunctivism’ (see Soteriou (2016) for an overview).\nThis is the view that in perception one is faced either with\ncases of genuine perception or with cases of illusion or\nhallucination, as in ‘I see a flash of light or I am\nhaving the perfect illusion of doing so’ (Hinton 1973, 39). Such\ndisjunctions were first analysed in detail by Michael Hinton (see\nHinton (1973) and Snowdon (2008)), but there have been suggestions\nthat disjunctivism harks back to Austin or even Cook Wilson and\nPrichard (Kalderon & Travis (213, 498–499), for\nAustin’s case, see also Longworth (2019)). Adjudicating such\nclaims depends on one’s understanding of disjunctivism itself,\nbut a few points can be adduced. Disjunctivism should not be confused\nwith any ‘naïve’ or ‘direct realism’, but\none may appeal to it to defend such views, therefore one should expect\nCook Wilson and Oxford Realists to have taken some steps towards it.\nThe sharp distinction between knowledge and belief (section 5), with\nthe rejection of any ‘highest common factor’ between the\ntwo, should count as a first step. (The above-mentioned critiques of\nthe argument from illusion reinforce this point.) A further step\ntowards a form of disjunctivism is also taken when, having\ndistinguished knowledge from belief, Cook Wilson also claimed that\nbelief presupposes knowledge: it is only when assessing what I may\nknow about some thing that I might realize that it is not sufficient\nto claim that ‘I know that p’, so that I remain\ncircumspect and merely claim that ‘I believe that\np’ (see sections 4 & 5).\n7. Universals\n\nIn metaphysics too, Cook Wilson had first to cope with idealism, thus\nwith the looming threat of Bradley’s regress about relations\n(Bradley 1897, chaps. II–III). Given a relation R between\na and b, a regress arises when one asks what relates\nthe relation to its relata, e.g., what relates a to R\n(and R to b), and one assumes as an answer that\na further relation, say, R*, is needed to tie a and\nR, a bit like a string that ties two objects together that\nneeds a further string to both of its ends to tie it to the objects.\nSince a need to explain the tie between a and R*\narises by the same token, one needs to introduce yet another relation\nR**, and so forth. In a brief chapter (SI, 692–695),\nCook Wilson argued that the first move here—supposing that\nR* is needed to tie a to R—is simply\n‘unreal’, because there could not be a new\nrelation that relates a relation to one of its terms. Thus, the\nregress would not be generated. One problem with Cook Wilson’s\nobjections is that they admittedly aim at the regress concerning\n‘external relations’ (SI, 692), but they are not fully\ndeveloped against ‘internal relations’ that Bradley also\nentertains (Bradley 1897, 17–18). Cook Wilson may not have a\nfull and appropriate answer to Bradley, but he thought he was thus\nfree to entertain the relation of a subject to its attributes.\n\nAlthough this is rarely noted, Cook Wilson is one of the forerunners\nof what we now call ‘trope theories’. What Edmund Husserl\ncalled ‘moments’ and later on G. F. Stout called\n‘characters’ and D. C. Williams ‘tropes’, Cook\nWilson called instead ‘particularization of the universal’\n(SI, 336) or ‘particularized qualities’ (SI (713),\nMulligan et al. (1984, 293 n.13)). Among his contemporaries, Cook\nWilson’s ideas stand indeed closest to both Stout’s and\nHusserl’s. He seems not to have known about the latter, but one\nnoticeable common feature concerns ‘dependence’ (Mulligan\net al. 1984, 294). Cook Wilson suggested towards the end of his life\nthat ‘things’ taken in themselves should be called\n‘existences’ (SI, 713) and, keeping close to the language\nof Aristotle (τόδε τι, ‘a\nthis’), he defined an ‘existence’ as ‘a this\nsuch and such’ (SI, 713). Starting with the subject-attribute\ndistinction, in the case of an existence where the subject is said to\nbe a ‘substance’, he argued that the “ordinary\nconception” of its ‘attribute-element’ is that it is\n“always a dependent reality” (SI, 157), with these\n“dependent existences” having in turn further existences\ndependent on them (SI, 153).\n\nUnder his conception ‘existences’ are, one might say,\n‘bundles’ of particularized qualities. But he did not\nconsider ‘substance’ as a sort of substrate in which\nuniversals are particularized, as many defenders of tropes do: the\n‘thing’ is according to him a mere ‘unity’ of\nelements, “not something over and above them. which has them,\nbut their unified existence” (SI, 155). He also expressed this\nby saying that the universal “covers the whole nature of the\nsubstance” (SI, 349), as “the particular does not have the\nuniversal in it and something also besides the\nuniversal to make it particular” (SI, 336, see also Joseph\n(1916a, 23)). It contains nothing besides the particularization of the\nuniversal: “the particular is not something that has the\nquality, it is the particularized quality. This animal is\nparticularized animality” (SI, 713). Likewise, “the\ndifferentia cannot be separated from the genus as something added on\nto it” (SI, 359), the species are just the forms that the\nuniversal, as genus, takes (SI, 335). Stout, citing Cook Wilson with\napproval, put it thus: “square shape is not squareness plus\nshape; squareness itself is a special way of being a shape”\n(Stout 1930, 398). (The view harks back to Aristotle, Met. I\n8 1058a21–26, see also on this point Joseph (1916a,\n85–86), Wisdom (1934, 29), Prior (1949, 5–6) and Butcharov\n(1966, 147–153)).\n\nTrope theories usually explain the fact that two things\n‘share’, say, a particular shade of yellow with help of a\nresemblance class. Here, Cook Wilson parts company, claiming that the\nuniversal is “something identical in the particulars, which\nidentity cannot be done away by substituting the term similar\nfor same” (SI, 344 & 347). Although the universal\nis, according to Cook Wilson, nothing outside its particularizations,\nit is claimed to be a “unity and identity in particulars”\nor a “real unity in objects” (SI, 344). It is meant to\npossess an ‘intrinsic character’ (SI, 342n. & 351),\nfor which Cook Wilson reluctantly introduced a technical term:\n“the characteristic being of the universal” (SI, 342). But\nhe introduced no equivalent to Stout’s fundamentum\nrelationis or ‘distributive unity of a class’ (Stout\n1930, 388), because he did not define the universal in terms of\nmembership of a class. Although he recognized that universals have an\nextension, i.e., the “total being of the universal”\ncomposed of the “whole of the particulars as the\nparticularization of this unity”, he did not identify the\nuniversal with it (SI, 338).\n\nFor this reason and in virtue of the realist epistemology which he\ntied to this conception (immediately below), Cook Wilson is often read\nas having held a form of ‘immanent realism’, as opposed to\nthe moderate forms of nominalism more typical of trope theories\n(Armstrong (1978, 85) or Moreland (2001, 165 n. 16)). One objection\nagainst this stance is that there is not much point having both\nuniversals and tropes. As David Armstrong put it, one of the two is\nbound to be redundant: “Either get rid of universals, embrace a\ntrope version of Resemblance Nominalism or else cut out the middlemen,\nnamely, the tropes” (Armstrong 1989, 17 & 132). This reading\ncannot be the last word, though, since Cook Wilson also appears only\nto have admitted one sort of entities, the tropes or\n‘particularizations of the universal’. Thus, there seems\nto be a tension, at best unresolved, in Cook Wilson’s stance,\nwhich could explain why it has found few supporters, one exception\nbeing J. R. Jones (1949, 1950 & 1951).\n\nCook Wilson’s ‘particularizations of the universal’\nare thus “strictly objective” and “not a mere\nthought of ours” (SI, 335–336); they thus cannot be\nphenomenal entities. His thinking here is of apiece with his\nanti-idealist views on ‘apprehension’. He had argued\nagainst T. H. Green’s neo-Kantian stance, that apprehension has\nno ‘synthetic’ character: any synthesis apprehended is\nattributed to the object and not the result of an activity of the\n‘apprehending mind’. As he put it, “in the judgement\nof knowledge and the act of knowledge in general we do not combine our\napprehensions, but apprehend a combination” (SI, 279), and it is\n“the nature of the elements themselves” which\n“determines which unity they have or can have”; the\n‘apprehending mind’ has “no power whatever to\nmake a complex idea out of simple ones” (SI, 524). This\nview implies that universals and connections between them, as\nparticularized, are in rebus and to be apprehended as such\n(Price 1947, 336). The view is, therefore, that there is no possible\napprehension of the universal except as particularized:\n\n\nJust as the universal cannot be, except as particularized, so we\ncannot apprehend it except in the apprehension of a particular. (SI,\n336)\n\n\nCook Wilson further reasoned that, when one states that\n‘a is a triangle’, one is predicating of\na the universal ‘triangularity’ and that,\nanalogously, in stating that ‘triangularity is a\nuniversal’ one would then put the universal\n‘triangularity’ in the subject position—the\n‘nominative case to the verb’ as he quaintly puts it (SI,\n349)—and treat it as if it were a particular, while putting\n‘universal’ in the predicate position. But to talk about\nthe universal in this way would require per impossibile that\none apprehends the universal in abstraction from any of its\nparticularizations. Cook Wilson held his conception as being, if not\npopular among philosophers, at least in accordance with ordinary\nlanguage and common sense (SI, 344–345).\n\nIt is thus the particularization of a given ‘characteristic\nbeing’ which we are said to apprehend, but “neither as\nuniversal nor as particularized” (SI, 343). There is no\nsuggestion in Cook Wilson’s writings of something akin to\nHusserl’s act of ‘categorial intuition’ or\n‘ideational abstraction’, in virtue of which the universal\nwould be “brought to consciousness and […] actual\ngivenness” (Husserl 2001, 292). He believed instead that the\n‘intrinsic character’ of any universal is inexplicable,\nbecause the relation between particular and universal, although\nfundamental and thus presupposed by any explanation (SI, 335 &\n345), is sui generis, therefore not explainable in terms of\nsomething else:\n\n\nI seem to have discovered that the true source of our metaphysical\ndifficulties lies in the attempt, a mistaken attempt too frequent in\nphilosophy, to explain the nature of the universal in terms of\nsomething other than itself. In fact the relation of the universal to\nthe particular is something sui generis, presupposed in any\nexplanation of anything. The nature of the universal therefore\nnecessarily and perpetually eludes any attempt to explain itself. The\nrecognition of this enable one to elucidate the whole puzzle of the\nParmenides of Plato. (SI, 348, see also SI, 361)\n\n\nCook Wilson thus believed to have found an answer to the notorious set\nof regress arguments known as the ‘third man’ in\nParm. 132a-143e. (Ryle argued later on that Cook\nWilson’s answer would not do, developing his own regress\nargument against the notion of ‘being an instance of’,\nthat Ryle read Cook Wilson as presupposing, while merely claiming that\nit is sui generis (Ryle 1971, vol. I, 9–10).)\n8. Philosophy of Logic\n\nCook Wilson did not contribute to logic. His inclination was at any\nrate conservative. For example, there was for him no room even to try\nand make a case for an alternative logic, since he held the\nAristotelian principles (the principle of syllogism, the law of\nexcluded middle and the principle of contradiction) to be “those\nsimple laws or forms of thoughts to which thought must conform to be\nthought at all. Thought therefore cannot throw any doubt on them\nwithout committing suicide” (ETA, 17 & SI, 626). Cook Wilson\nalso rejected new developments in symbolic logic from Boole to\nRussell. He was not as such adverse to the “symbolization of\nforms of statements”: when criticizing Boole’s he alluded\nto “an improved calculus of [his] own” (SI, 638), which he\ncalled “fractional method” (SI, 662). But he did not\npublish it and all we have is the beginnings of an outline (SI,\n192–210). His main objection to Boole—a common one at the\ntime—was to the algebraist’s use of equations, perceived\nas an intrusion of mathematics in logic (SI, 635–636). (See the\nwhole chapter (SI, 635–662).) And the little he knew of\nmathematical logic, Cook Wilson ferociously opposed. He did think of\nsyllogistic as “a science in the same sense as pure\nmathematics” (SI, 437), but he was opposed to the very idea of\nlogical foundations for mathematics because he believed that logical\ninferences are exhausted by syllogistic and, “mathematical\ninference as such is not syllogistic” (SI, xcvi). This\nis a misunderstanding, common at the time, of the expressive power of\nquantification theory as developed among others by Gottlob Frege and\nC. S. Peirce, of which he was clearly insufficiently cognizant, if not\nplainly ignorant.\n\nCook Wilson used his interpretation of Plato’s doctrine of Idea\nnumbers as\nἀσύμβλητοι\nἀριθμοί as a basis for an attack\non Russell and the logicist definition of numbers, Plato’s\ndoctrine being understood (see section 2) as entailing that there\ncannot be a universal of the members of the ordered series of\nuniversals: 1-ness, 2-ness, 3-ness, etc. because they do not share an\n‘intrinsic character’. Confusing this series with that of\nthe natural numbers, he concluded that the logicist definition in\nterms of classes of classes, e.g., of the number 5 as the class of all\nclasses equinumerous with a given quintuplet, is “a mere\nfantastic chimera” (SI, 352). In line with the argument about\nputting the universal ‘triangularity’ in the subject\nposition (previous section), Cook Wilson reasoned for the case of\nnatural numbers that there would be an alleged ‘universal of\nnumberness’ and that this would lead straight to a\ncontradiction: since all particulars of a universal are said to\npossess its quality, a group of 5 as a particular of\n‘5-ness’ would thus possess the ‘universal of\nnumberness’, thus contradicting his claim that a particular\ncannot be a universal (SI, 353). \n\nBy the same token, Cook Wilson thought that this line of reasoning\nshows that Russell’s paradox of the class of all classes that do\nnot contain themselves (Russell 1903, chap. X) is a “mere\nfallacy of language” (SI, cx). He thus argued at length (SI,\n§§ 422–32), including in his correspondence with\nBosanquet (SI, §§ 477–518) that there can no more be a\n‘class of classes’ than ‘universalness’ could\nbe a ‘universal of universals’ and that a class can no\nmore be a member of itself than ‘universalness’ could be a\nparticular of itself: the implied ‘universal of\nuniversals’ or ‘universalness’, of which universals\nwould be the particulars, would be a particular of itself, which is,\nCook Wilson claims, “obviously absurd” (SI, 350). For bad\nreasons such as these, Cook Wilson was contemptuous of what he called\n“the puerilities of certain paradoxical authors” (SI,\n348). He even wrote to Bosanquet:\n\nI am afraid I am obliged to think that a man is conceited as well as\nsilly to think such puerilities are worthy to be put in print: and\nit’s simply exasperating to think that he finds a publisher\n(where was the publisher’s reader?), and that in this way such\ncontemptible stuff can even find its way into examinations. (SI, 739)\n\n\nThe problem with Cook Wilson’s arguments is that they are based\non an elementary confusion between membership of a class and inclusion\nof classes (see for example SI, cx & 733–734). Peter Geach\ncalled Cook Wilson “an execrably bad logician” (Geach\n1978, 123) for committing blunders such as this. (Cook Wilson’s\nclaim in a letter to Lewis Carroll that it is not possible to know\nthat ‘Some S is P’ without knowing which\nS it is which is P is another such elementary\nblunder (Carroll 1977, 376).)\n\nFortunately, Cook Wilson made a more interesting contribution to\nphilosophy of logic in his discussion of Lewis Carroll’s paradox\nof inference (Carroll 1895), of which he gave the following\nformulation:\n\n\n… let the argument be A1 = B1, B1\n= C1, therefore A1 = C1. The\nrule which has to be put as the major premiss is, things being equal\nto the same thing are equal to one another. Under this we subsume\nA1 and C1 are things equal to the same thing,\nand so draw the conclusion that they are equal to one another. This is\nsyllogism I. Now syllogism I, which is of the form MP, SM, SP, in turn\nexemplifies another rule of inference which is the so-called\ndictum de omni et nullo. This must now appear as a major\npremiss. The resulting syllogism may be put variously; the following\nshort form will serve. Every inference which obey the dictum is\ncorrect; the inference of syllogism I obeys the dictum; therefore it\nis correct. This is a new syllogism (II) which again has for rule of\ninference the same dictum; hence a new syllogism (III) and so on\nin saecula saeculorum. (SI, 444)\n\n\nLeaving aside the incorrect identification of the inference rule as\nthe dictum de omni, this is recognizably the infinite regress\nin Carroll’s paradox and, while Carroll did not provide one,\nCook Wilson offered the following diagnosis:\n\n\n… it is clearly a fallacy to represent the rule according to\nwhich the inference is to be drawn from premisses as one of the\npremisses themselves. We should anticipate that this must somehow\nproduce an infinite regress. (SI, 443)\n\n\nThese passages cannot be precisely dated and his correspondence with\nCarroll for the relevant period is lost, so one cannot tell who framed\nthe paradox first (Moktefi 2007, chap. V, sect. 3.1). They were both\nanticipated, however, by Bernard Bolzano, who already stated the\nparadox in his Wissenschaftslehre (1837) and provided a\nsimilar diagnosis (Bolzano 1972, § 199). (For a discussion, see\nMarion (2016).) Interestingly, Cook Wilson’s diagnosis is linked\nto his own views on the apprehension of universals via their\nparticularizations (see the previous section):\n\n\nA direct refutation may, however, be given as follows. In the above\nprocedure the rule of inference is made a premiss and a particular\ninference is represented as deduced from it. But, as we have seen,\nthat its an inversion of the true order of thought. The validity of\nthe general rule of inference can only be apprehended in a particular\ninference. If we could not see the truth directly in the particular\ninference, we should never get the general rule at all. Thus it is\nimpossible to deduce the particular inference from the general rule.\n(SI, 445)\n\n\nIn Lewis Carroll’s presentation of the paradox, the Tortoise\nrefuses to infer the conclusion when faced with an instance of the\nrule of Modus Ponens and Achilles suggests that one should\nthen add the rule as a further premise, but the Tortoise still refuses\nto infer, so that Achilles then suggest to add the whole formula\nresulting from adding the rule as a premise as yet a further premise\nto no avail, and so forth. It is often claimed that the\nTortoise’s repeated refusals indicates that rules of inference\nare in themselves normatively inert, so that a further ingredient is\nneeded for one to infer, e.g., a ‘‘rational\ninsight’’ (Bonjour 1998, 106–107). Cook\nWilson’s claim that one can only ‘apprehend’ the\nvalidity of the rule in a particular inference, thus ‘seeing the\ntruth directly’ or possessing a ‘direct intuition’\n(SI, 441), is an analogous move.\n\nThe idea that a rule of inference cannot be introduced as a premise in\nan inference in accordance with it, on pains of an infinite regress,\nwas also reprised by Ryle (Ryle 1971, vol. II, 216 & 238). But he\nused it to argue for his celebrated distinction between ‘knowing\nhow’ and ‘knowing that’: ‘‘Knowing a\nrule of inference is not possessing a bit of extra information.\nKnowing a rule is knowing how. It is realised in performances which\nconform to the rule, not in theoretical citations of it.’’\n(Ryle 1971, vol. II, 217). However, if ‘knowing how’ is no\nlonger a state of mind (even dispositionally), then the view is no\nlonger Cook Wilson’s.\n\nCook Wilson believed that all statements are\n‘categorical’, arguing away ‘hypothetical\njudgements’ with the claim that “in the hypothetical\nattitude”, we apprehend “a relation between two\nproblems” (SI, 542–543 & Joseph (1916a, 185)). In\nother words, conditionals do not express judgements but connections\nbetween questions. This view was elaborated by Ryle into his\ncontroversial stance on indicative conditionals as\n‘inference-tickets’ in ‘‘If’,\n‘So’, and ‘Because’’ (Ryle 1971, vol.\nII, 234–249). Ryle compared conditionals of the form ‘If\np, then q’, to “bills for statements\nthat statements could fill” (Ryle 1971, vol. II, 240) and he\nrejected the form ‘If p then q, but\np, therefore q’, claiming that in some way the\np in the major premise cannot for that reason be the same as\np asserted by itself. This, of course, runs afoul of\nGeach’s ‘Frege Point’ (Geach 1972).\n9. Philosophy of Language\n\nCook Wilson also questioned superficial uniformity of the form\n‘S is P’, calling the subject of\nattributes ‘metaphysical’ (SI, 158) in order to\ndistinguish it from the subject of predication. He thus distinguished\nthe ontological distinction between substance and attribute\nfrom the logical subject-predicate distinction. Using the\ntraditional definition of the subject as ‘what supports the\npredicate’ and the predicate as ‘what is said concerning\nthe subject’ (quoting Boethius, SI, 114–115), he noted\nthat a ‘statement’ such as ‘That building is the\nBodleian’ has different analyses, depending on the occasion in\nwhich it is used. If in answer to ‘What building is\nthat?’, with the ‘stress accent’ on ‘the\nBodleian’ as in ‘That building is the\nBodleian’, the subject is ‘that building’ and\nthe predicate as ‘what is said concerning the subject’ is\n‘that that building is the Bodleian’ (SI, 117 & 158).\nBut, if in answer to the question ‘Which building is the\nBodleian?’ with the ‘stress accent’ now on\n‘that’ as in ‘That building is the\nBodleian’, then the Bodleian is the subject and the predicate is\n‘that building pointed out was it’ (SI, 119). The same\ngoes for ‘glass is elastic’, where elasticity is\npredicated of glass and ‘glass is elastic’, when\nit is stated in answer to someone looking for substances that are\nelastic. This shows that the relation of subject to predicate is\nsomehow symmetric, but it is not the case, however, with the\nsubject/attribute distinction because ‘‘The subject cannot\nbe an attribute of one of its own attributes’’ (SI, 158).\nCook Wilson also noted that ‘‘the stress accent is upon\nthe part of the sentence which conveys the new\ninformation’’ (SI, 118), and he would thus say that the\nsubject-predicate relation depends on the subjective order in\nwhich we apprehend them (SI, 139), while the relation between\n‘subject’ and ‘attribute’ is objective\nin the sense that it is holding between a particular thing and a\n‘particularized quality’, it is a ‘‘relation\nbetween realities without reference to our apprehension of\nthem’’ (Robinson 1931, 103).\n\nIn ‘How to Talk’ (Austin 1979, 134–153), Austin\nfurther developed distinctions akin to Cook Wilson’s\ndifferentiation between the logical subject/predicate and metaphysical\nsubject/attribute distinctions, and this differentiation was shared by\nP. F. Strawson (Strawson 1959, 144), who also believed in\n‘particularized qualities’ (Strawson (1959, 168) &\n(1974, 131)). In a bid to avoid Bradley’s regress (Strawson\n1959, 167), he introduced the idea of ‘non-relational\nties’ between subject and attribute, leaving\n‘relations’ for the link between logical subject and\npredicate. Some non-relational ties are thus said to hold between\nparticulars and particulars: to the relation between Socrates and the\nuniversal ‘dying’ corresponds an ‘attributive\ntie’ between the particulars that are both Socrates and\nthe event of his death. That such ‘ties’ are less obscure\nthan ‘relations’ and that this maneuver actually succeeds\nin stopping the regress are further issues, but it is interesting to\nnote that Strawson chose the name ‘attributive tie’ in\nhonour of Cook Wilson (Strawson (1959, 168), see SI, 193).\n\nStrawson also noted that Cook Wilson’s argument for\ndifferentiating between the logical subject/predicate and metaphysical\nsubject/attribute distinctions involves an appeal to\n‘‘pragmatic considerations’’ (Strawson 1957,\n476). Cook Wilson’s claim that a sentence such as ‘glass\nis elastic’ may state something different depending on the\noccasion in which it is used also had an important continuation in J.\nL. Austin’s more general point that, although the meaning of\nwords plays a role in determining truth-conditions, it is not an\nexhaustive one: it “does not fix for them a\ntruth-condition” because that depends on how truth is to be\ndecided on the occasion of their use (see Travis (1996, 451) and\nKalderon & Travis (2013, 492 & 496)):\n\n\n… the question of truth and falsehood does not turn only on\nwhat a sentence is, nor yet on what it means, but\non, speaking very broadly, the circumstances in which it is uttered.\n(Austin 1962, 111)\n\n\nThis line of thought has been pursued further by Charles Travis under\nthe name of ‘occasion-sensitivity’, i.e.,\n‘‘the fact that the same state of the world may require\ndifferent answers on different occasions to the question of whether\nwhat was said in a given statement counts as true’’\n(Travis (1981, 147), see also (1989, 255)), this being a recurring\ntheme, see the papers collected in Part 1 of (Travis 2008)). Thus,\nCook Wilson’s above examples, ‘That building is the\nBodleian’ or ‘glass is elastic’, are genealogically\nrelated to what are commonly known as ‘Travis cases’,\ni.e., sentences used to make a true statement about an item in one\noccasion and a false one about the same item in another. (For examples\nof these, see Travis (1989, 18–19), (1997, 89), (2008, 26 &\n111–112).)\n\nR. G. Collingwood also took Cook Wilson as putting forth a slightly\ndifferent thesis, namely that the meaning of a statement is determined\nby the question to which it is an answer (Collingwood 1938, 265 n.).\nHe used this idea as the basis for his ‘logic of questions and\nanswers’ (Collingwood 2013, chap. 5) and for his theory of\npresuppositions (Collingwood 1998, chaps. 3–4), this last being\nfurther developed by the French linguist Oswald Ducrot (1980, 42f.).\nCollingwood was reluctant, however, to recognize Cook Wilson as an\ninspiration, since he thought ill of the idea of\n‘apprehensions’ as a non-derivative basis for knowledge\nand he believed instead that knowledge comes from asking questions\nfirst (Collingwood 2013, 25), and thus that knowledge depends on a\n‘complex of questions and answers’ (Collingwood 2013,\n37).\n10. Moral Philosophy\n\nCook Wilson hardly wrote on topics outside the theory of knowledge and\nlogic, but two remarks ought to be made concerning moral philosophy.\nFirst, the last piece included in Statement and Inference is\ncomposed of notes for an address to a discussion society in 1897, that\nwas announced as ‘The Ontological Proof for God’s\nExistence’. In this text, which opens with a discussion of\nHutcheson and Butler, Cook Wilson argued that in the case of\n“emotions as are proper to the moral consciousness”, such\nas the feeling of gratitude:\n\nWe cannot separate the judgement from the act as something in itself\nspeculative and in itself without the emotion. We cannot judge here\nexcept emotionally. This is true also of all moral and aesthetic\njudgements. Reason in them can only manifest itself emotionally. (SI,\n860)\n\n\nHe argued further, in what amounts to a form of moral realism, that\nthere must be a real experience, i.e., in the case of gratitude,\n“Goodwill of a person, then, must here be a real\nexperience” (SI, 861), and that the feeling of “reverence\nwith its solemnity and awe” is in itself “not fear, love,\nadmiration, respect, but something quite sui generis”\n(SI, 861). It is a feeling that, Cook Wilson argued, “seems\ndirected to one spirit and one alone, and only possible for spirit\nconceived as God” (SI, 864). In other words, the existence of\nthe feeling of reverence presupposes that God exists. Cook Wilson thus\nsketched within the span of a few pages a theory of emotions, which is\nechoed today in the moral realism that has been developed, possibly\nwithout knowledge of it, in the wake of David Wiggins’\n‘Truth, Invention and the Meaning of Life’ (Wiggins 1976)\nand a series of influential papers by John McDowell—now\ncollected in McDowell (2001).\n\nCook Wilson’s ideas had a limited impact on Oxford theology.\nAcknowledging his debt, the theologian and philosopher C. C. J. Webb\ndescribed religious experience as one that “cannot be adequately\naccounted for except as apprehension of a real object” (Webb\n1945, 38), but he nevertheless chose to describe his standpoint as a\nform of ‘Platonic idealism’ (Webb 1945, 35). Cook\nWilson’s realism also formed part of the philosophical\nbackground to C. S. Lewis’ “new look” in the 1920s,\nvia E. F. Carritt’s teaching. In Surprised by Joy,\nLewis also described awe as “a commerce with something\nwhich […] proclaims itself sheerly objective” (Lewis\n1955, 221), but he quickly moved away from this position (see Lewis\n(1955, chaps. XIII–XIV) and McGrath (2014, chap. 2)).\n\nSecondly, Prichard is also responsible for an extension of Cook\nWilson’s conception of knowledge to moral philosophy, with his\npaper ‘Does Moral Philosophy Rest on a Mistake?’ (Prichard\n1912), whose main argument is analogous to Cook Wilson’s\nargument for the impossibility of defining knowledge. In a nutshell,\nduty is sui generis and not definable in terms of anything\nelse. The parallel is explicit in Prichard (1912, 21 &\n35–36). That we ought to do certain things, we are told, arises\n“in our unreflective consciousness, being an activity of moral\nthinking occasioned by the various situations in which we find\nourselves”, and the demand that it is proved that we ought to do\nthese things is “illegitimate” (Prichard 1912, 36). In\norder to find out our duty, “the only remedy lies in actually\ngetting into a situation which occasions the obligation” and\n“then letting our moral capacities of thinking do their\nwork” (Prichard 1912, 37). This paper became so influential that\nPrichard was elected in 1928 to the White’s Chair of Moral\nPhilosophy at Corpus Christi, although his primary domain of\ncompetence had been the theory of knowledge. His papers in moral\nphilosophy were edited after his death as Prichard (1949, now 2002).\nPrichard stands at the origin of the school of ‘moral’ or\n‘Oxford intuitionism’, of which another pupil of Cook\nWilson, the Aristotle scholar W. D. Ross (Ross 1930, 1939) remains the\nforemost representative, along with H. W. B. Joseph, E. F. Carritt,\nand J. Laird. Some of the views they expressed have recently gained\nnew currency within ‘moral particularism’, e.g., in the\nwritings of Jonathan Dancy (Dancy 1993, 2004).\n11. Legacy\n\nThe historical importance of Cook Wilson’s influence ought not\nto be underestimated. In his obituary, H. W. B. Joseph described him\nas being “by far the most influential philosophical teacher in\nOxford”, adding that no one had held a place so important since\nT. H. Green (Joseph 1916b, 555). This should be compared with the\nclaim that in the 1950s Wittgenstein was “the most powerful and\npervasive influence” (Warnock 1958, 62). The\n‘realist’ reaction against British Idealism at the turn of\nthe 20th century was at any rate not confined to the\nwell-known rebellion of G. E. Moore and Bertrand Russell at Cambridge.\nThere were also ‘realisms’ sprouting in Manchester (with\nRobert Adamson and Samuel Alexander), and in Oxford too, where Thomas\nCase had already argued for realism in Physical Realism (Case\n1888) (Marion 2002b), although it is clearly Cook Wilson’s\ninfluence that swayed Oxford away from idealism. Since he published so\nlittle, it is therefore mainly through teaching and personal contact\nthat he made a significant impact on Oxford philosophy, not only\nthrough the peculiar tutorial style to which generations of\n‘Greats’ students were subjected—as described in\nWalsh (2000) or Ackrill (1997, 2–5)—but also through\nmeetings that he initiated, which were to become the\n‘Philosophers’ Teas’ under Prichard’s\ntutelage, the ‘Wee Teas’ under Ryle’s and\n‘Saturday Mornings’ under Austin’s.\n\nHis legacy can thus be plotted through successive generations of\nOxford philosophers. E. F. Carritt, R. G. Collingwood (who reverted to\na form of idealism later on), G. Dawes Hicks, H. W. B. Joseph, H. A.\nPrichard, W. D. Ross and C. C. J. Webb are among his better-known\npupils at the turn of the century. After his death, his influence\nextended through the teaching of Carritt, Joseph and Prichard, and the\nposthumous volumes of Statement and Inference to the\npost-World War I generation of the 1920s, including Frank Hardie, W.\nC. Kneale, J. D. Mabbott, H. H. Price, R. Robinson and G. Ryle, and\nthe early analytic philosophers of the 1930s, J. L. Austin, I. Berlin,\nJ. O. Urmson, and H. L. A. Hart, in particular. For example, Isaiah\nBerlin’s described Hart as “an excellent solid Cook\nWilsonian” in a letter to Price (Berlin 2004, 509), and admitted\nhimself to have been at first an Oxford Realist (Jahanbegloo 1992,\n153). (See Marion (2000, 490–508) for further details.) Thus,\nOxford Realism first dislodged British Idealism from its position of\nprominence at Oxford and then transformed itself into ordinary\nlanguage philosophy and, as pointed out in the previous section, moral\nintuitionism. In the post-World War II years, Cook Wilson’s name\ngradually faded away, however, while ‘ordinary language\nphilosophy’, which owed a lot to his constant reliance on\nordinary language against philosophical jargon, blossomed. It became\none of the strands that go under the name of ‘analytic\nphilosophy’, so Cook Wilson should perhaps be seen as one of its\nmany ancestors.\n\nThe only Oxford philosopher of note who opposed the\n‘realists’ before World War II was R. G. Collingwood, who\ndied too soon in 1943. He felt increasingly alienated and ended up\nreduced to invective, describing their theory of knowledge as\n“based upon the grandest foundation a philosophy can have,\nnamely human stupidity” (Collingwood 1998, 34) and their\nattitude towards moral philosophy as a “mental kind of\ndecaudation” (Collingwood 2013, 50). Collingwood objected to\nCook Wilson’s anti-idealist claim that ‘knowing makes no\ndifference to the object known’, that in order to vindicate it\none would need to compare the object as it is being known with the\nobject independently of its being known, which is the same as knowing\nsomething unknown, a contradiction (Collingwood 2013, 44). But\nCollingwood’s argument did not rule out the possibility of\ncoming to know an object, while knowing that it was not altered in the\nprocess. (For critical appraisals, see Donagan (1985, 285–289)\nJacquette (2006) and Beaney (2013).) In another telling complaint, he\ncriticized the Oxford Realists for being interested in assessing the\ntruth or falsity of specific philosophical theses without paying\nattention to the fact that the meaning of the concepts involved may\nhave evolved through history, and so there is simply no ‘eternal\nproblem’ (Collingwood 2013, chap. 7). This points to a lack of\nhistorical sensitivity, which is indeed another feature of analytic\nphilosophy that arguably originates in Cook Wilson.\n\nThere was another deleterious side to Cook Wilson’s influence in\nOxford: his contempt for mathematical logic. It explains why one had\nto wait until the appointment of Hao Wang in the 1950s for modern\nformal logic first to be taught at Oxford. In the 1930s, H. H. Price\nwas still teaching deductive logic from H. W. B. Joseph’s An\nIntroduction to Logic (Joseph 1916a) and inductive logic from J.\nS. Mill’s System of Logic. This reactionary attitude\ntowards modern logic and later objections to ‘ordinary language\nphilosophy’ go a long way to explain why Cook Wilson’s\nreputation dropped significantly in the second half of last century.\nIn the 1950s, Wilfrid Sellars was virtually alone in his praise:\n\n\nI can say in all seriousness that twenty years ago I regarded\nWilson’s Statement and Inference as the philosophical\nbook of the century, and Prichard’s lectures on perception and\non moral philosophy, which I attended with excitement, as veritable\nmodels of exposition and analysis. I may add that while my\nphilosophical ideas have undergone considerable changes since 1935, I\nstill think that some of the best philosophical thinking of the past\nhundred years was done by these two men. (Sellars 1957, 458).\n\n\nAs the tide of ‘ordinary language philosophy’ ebbed, Cook\nWilson’s views on knowledge showed more resilience. In the\n1960s, Phillips Griffiths’ anthology on Knowledge and\nBelief included excerpts from Cook Wilson (Phillips Griffiths\n1967, 16–27) and John Passmore was able to write that\n“Cook Wilson’s logic may have had few imitators; but his\nsoul goes marching on in Oxford theories of knowledge” (Passmore\n1968, 257).\n\nAs shown in sections 5 and 6, Cook Wilson’s views on knowledge\nand perception are now once more involved in contemporary debates.\nThey had remained influential all along, although his name was often\nnot mentioned. His peculiar combination of the claims that knowledge\nis a factive state of mind and that it is undefinable, argued for anew\nby J. L. Austin, has been taken up and further developed by John\nMcDowell (McDowell 1994, 1998), Charles Travis (Travis 1989, 2008),\nand Timothy Williamson (Williamson 2000, 2007), who is currently\nWykeham Professor of Logic, New College. One has, therefore, what\nCharles Travis once described as “an Oxford tradition despite\nitself” (Travis (1989, xii), on this last point, see also\nWilliamson (2007, 269–270n)).\n\nDuring the twentieth century, secondary literature on Cook\nWilson’s philosophy was not considerable, with a few papers of\nunequal value by Foster (1931), Furlong (1941), Lloyd Beck (1931) and\nRobinson (1928a, 1928b), along with a few studies on universals in the\npost-war years (see section 7), and only one valuable commentary,\nRichard Robinson’s The Province of Logic (Robinson\n1931). Interest in the study of his philosophy was only revived at the\nbeginning of this century, with Marion (2000) giving a first overview\nof Oxford Realism. In a short book, Kohne (2010) charts the views of\nCook Wilson, Prichard and Austin on knowledge as a mental state. An\nimportant contribution, Kalderon & Travis (2013) secured Oxford\nRealism’s place in the history of analytic philosophy, comparing\nit with other forms of realism in Frege, Russell and Moore, while\ndrawing links with later developments in the writings of J. L. Austin,\nJ. M. Hinton and John McDowell. As a result of this revival of\ninterest, the philosophies of J. L. Austin (Longworth 2018a, 2018b\n& 2019, and the entry to this Encyclopedia) and of Wilfrid Sellars\n(Brandhoff 2020) are now being re-interpreted in light of Cook\nWilson’s legacy.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<h4>Writings by Cook Wilson</h4>\n<ul class=\"hanging\">",
                "[AS] <em>Aristotelian Studies I. On the Structure of the Seventh\nBook of the Nicomachean Ethics, ch. i–x</em>, Oxford, Clarendon\nPress, 1871, second edition, 1912.",
                "[ASV] ‘<em>Aristotelian Studies I. On the Structure of the\nSeventh Book of the Nicomachean Ethics, ch. i–x</em>, vom\nVerfasser’, <em>Göttingische gelehrte Anzeige</em>, April\n14, 1880, pp. 449–474.",
                "[IPT] <em>On the Interpretation of Plato’s Timaeus. Critical\nStudies with Reference to a Recent Edition</em>, Oxford, Clarendon\nPress, 1889.",
                "[ETA] <em>On an Evolutionist Theory of the Axioms, An Inaugural\nLecture</em>, Oxford, Clarendon Press, 1889.",
                "[APT] ‘Apelt’s Pseudo-Aristotelian Treatises’,\n<em>The Classical Review</em> 6 (1892): pp. 16–19,\n100–107, 156–162, 209–214, 441–446 &amp; 7\n(1893): 33–39.",
                "[IP] ‘Inverse or “a posteriori”\nProbability’, <em>Nature</em>, December 13, 1900, pp.\n154–6. Reproduced partly as (SI, §§\n325–327).",
                "[PBT] ‘Probability—James Bernoulli’s\nTheorem’, <em>Nature</em>, March 14, 1901, pp. 465–6.",
                "[GPP] ‘On the Geometrical Problem in Plato’s\n<em>Meno</em>, 86e sqq.: With a Note on a Passage in the Treatise De\nLineis Insecabilibus’, <em>The Journal of Philology</em>,\nJanuary 1, 1903, pp. 222–240",
                "[OPD] ‘On the Platonist Doctrine of the\nἀσύμβλητοι\nἀριθμοί’, <em>The Classical\nReview</em>, 18 (1904): 247–60.",
                "[TGF] <em>On the Traversing of Geometrical Figures</em>, Oxford,\nClarendon Press, 1905.",
                "[CLP] ‘Lewis Carroll’s Logical Paradox’,\n<em>Mind</em>, 14 (1905): 292–293. With correction,\n<em>Mind</em>, 14 (1905): 439.",
                "[SI] <em>Statement and Inference with other Philosophical\nPapers</em>, 2 vols., Oxford, Clarendon Press, 1926; reprint: Bristol\n2002.",
                "[UL] <em>Unpublished Lectures from 1913–1914</em>\n(Charlottesville VA, Intelex, 2005). Electronic edition in the Past\nMasters series\n <a href=\"http://www.nlx.com/collections/141\" target=\"other\">available online</a>.\n</ul>\n<p>\nFor a complete list of Cook Wilson’s publications during his\nlifetime, see (SI, lxv–lxxii). Cook Wilson’s papers were\ndeposited at the Bodleian Library, University of Oxford in 1970, ref.\nGB 161 MSS. Top. Oxon. c. 580–4, and a carbon copy of his\nlecture notes on Plato’s <em>The Republic</em>, that had been in\npossession of A. D. Woozley, was donated to the Houghton Library,\nHarvard University in 2008. Another such typescript was deposited\namong the papers of Percy William Dodd at Jesus College, Oxford\n(JC:F12/MS5/I).</p>\n<h4>Oxford Philosophy</h4>\n<ul class=\"hanging\">",
                "Ackrill, J. L. (1997), <em>Essays on Plato and Aristotle</em>,\nOxford: Clarendon Press.",
                "Austin, J. L. (1962), <em>Sense and Sensibilia</em>, Oxford:\nClarendon Press.",
                "––– (1979), <em>Philosophical Papers</em>, third\nedition, Oxford: Clarendon Press.",
                "Berlin, I. (2004), <em>Flourishing. Letters 1928–1946</em>,\nLondon: Chatto &amp; Windus.",
                "Cross, R. C. &amp; A. D. Woozley (1964), <em>Plato’s\nRepublic. A Philosophical Commentary</em>, London: MacMillan.",
                "Joseph, H. W. B. (1916a), <em>An Introduction to Logic</em>,\nOxford: Clarendon Press.",
                "––– (1916b), ‘Professor John Cook\nWilson’, <em>Proceedings of the British Academy</em>, 7:\n555–565.",
                "––– (1948), <em>Knowledge and the Good in\nPlato’s Republic</em>, H. L. A. Hart (ed.), London: Oxford\nUniversity Press.",
                "Kneale, W. C. (1949), <em>Probability and Induction</em>, Oxford:\nClarendon Press.",
                "Price, H. H. (1924), ‘Reality and Sensible\nAppearance’, <em>Mind</em>, 33: 20–43.",
                "––– (1932) <em>Perception</em>, London: Methuen,\n2nd edition, 1950.",
                "––– (1935), ‘Some Considerations about\nBelief’, <em>Proceedings of the Aristotelian Society</em>, 35:\n229–52",
                "––– (1947) ‘Harold Arthur Prichard\n1871–1947’, <em>Proceedings of the British Academy</em>,\n33: 331–350.",
                "––– (1969), <em>Belief. The Gifford Lectures\ndelivered at the University of Aberdeen in 1960</em>, London: Allen\n&amp; Unwin. Reprint: Thoemmes Press, 1996.",
                "Prichard, H. A. (1906), ‘Appearances and Reality’,\n<em>Mind</em>, 15: 223–229.",
                "––– (1909), <em>Kant’s Theory of\nKnowledge</em>, Oxford: Clarendon Press.",
                "––– (1912), ‘Does Moral Philosophy Rest on\na Mistake?’, <em>Mind</em>, 21: 21–37.",
                "––– (1915), ‘Mr. Bertrand Russell on\n<em>Our Knowledge of the External World</em>’, <em>Mind</em>,\n24: 145–185.",
                "––– (1919), ‘Professor John Cook\nWilson’, <em>Mind</em>, 28: 297–318.",
                "––– (1928), ‘Mr. Bertrand Russell’s\n<em>Outline of Philosophy</em>’, <em>Mind</em>, 37:\n265–282.",
                "––– (1949) <em>Moral Obligation</em>, W. D. Ross\n(ed.), Oxford: Clarendon Press.",
                "––– (1950), <em>Knowledge and Perception. Essays\nand Lectures</em>, Oxford: Clarendon Press.",
                "––– (2002), <em>Moral Writings</em>, J. MacAdam\n(ed.), Oxford: Clarendon Press.",
                "Ross, W. D. (1924), <em>Aristotle’s Metaphysics. With\nIntroduction and Commentary</em>, 2 volumes, Oxford: Clarendon\nPress.",
                "––– (1930), <em>The Right and the Good</em>,\nOxford: Clarendon Press.",
                "––– (1939), <em>Foundations of Ethics. The\nGifford Lectures delivered in the University of Aberdeen\n1935–6</em>, Oxford: Clarendon Press.",
                "––– (1949), <em>Aristotle’s Prior and\nPosterior Analytics. With Introduction and Commentary</em>, 2 volumes,\nOxford: Clarendon Press.",
                "Ryle, G., (1971) <em>Collected Papers</em>, 2 vols., London:\nHutchinson. Reprint: Bristol, Thoemmes Press, 1990.",
                "––– (1990), ‘The Logical Atomism in\nPlato’s <em>Theaetetus</em>’, <em>Phronesis</em>, 35(1):\n21–46.",
                "––– (1993) ‘Paper Read at the Oxford\nPhilosophical Society 500th Meeting, 1968’, in <em>Aspects of\nMind</em>, Oxford: Blackwell.",
                "Strawson, P. F. (1952), <em>Introduction to Logical Theory</em>,\nLondon: Methuen.",
                "––– (1959), <em>Individuals. An Essay in\nDescriptive Metaphysics</em>, London: Methuen.",
                "Urmson, J. O. (1988), ‘Prichard and Knowledge’, in J.\nDancy, J. M. E. Moravcsik &amp; C. C. W. Taylor (eds.), <em>Human\nAgency. Language, Duty and Value</em>, Stanford CA: Stanford\nUniversity Press, pp. 11–24.",
                "Woozley, A. D. (1949), <em>Theory of Knowledge</em>, London:\nHutchinson.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Adam Carter, J., E. C. Gordon &amp; B. W. Jarvis (2017),\n<em>Knowledge First. Approaches in Epistemology and Mind.</em> Oxford:\nOxford University Press.",
                "Allen, R. E. (1983), <em>Plato’s Parmenides. Translation and\nAnalysis</em>, Minneapolis, MN: University of Minnesota Press.",
                "Al-Saleh, C. (2003), ‘La place de la critique de Hume dans\nla formation du réalisme à Oxford dans la\npremière moitié du XXe siècle: quelques\naspects’, <em>Revue de métaphysique et de morale</em>,\n2003/2: 199–212.",
                "Antognazza, M. R. (2020), ‘The Distinction in Kind between\nKnowledge and Belief’, <em>Proceedings of the Aristotelian\nSociety</em>, 120: 277–308.",
                "Armstrong, D. M. (1978), <em>Nominalism and Realism. Universals\nand Scientific Realism. Volume 1</em>, Cambridge: Cambridge University\nPress.",
                "Armstrong, D. M. (1989), <em>Universals. An Opinionated\nIntroduction</em>. Boulder: Westview.",
                "Bain, A. (1888), <em>The Emotions and the Will</em>, 3rd edition,\nLondon: Longmans, Green, and Co.",
                "Baker, A. (2008), ‘Experimental Mathematics’,\n<em>Erkenntnis</em>, 68: 331–344.",
                "Beaney, M. (2013), ‘Collingwood’s Critique of Oxbridge\nRealism’, in D. Boucher &amp; T. Smith (eds.), <em>R. G.\nCollingwood: An Autobiography &amp; other Writings</em>, Oxford:\nClarendon Press, pp. 247–269.",
                "Bradley, F. H. (1897), <em>Appearance and Reality</em>, 2nd\nedition, Oxford: Clarendon Press.",
                "––– (1922), <em>The Principles of Logic</em>,\n2nd edition, Oxford: Clarendon Press.",
                "Brandhoff, B. (2020), ‘Cook Wilson, Sellars, and the\nExplication of Language’, in S. Brandt &amp; A. Breunig (eds.),\n<em>Wilfrid Sellars and Twentieth-Century Philosophy</em>, New York\n&amp; London: Routledge, pp. 11–28.",
                "Bolzano, B. (1972), <em>Theory of Science</em>, Berkeley &amp; Los\nAngeles: Universiy of California Press.",
                "Bonjour, L. (1998), <em>In Defense of Pure Reason</em>, Cambridge:\nCambridge University Press.",
                "Burnyeat, M. F. (2012), ‘Platonism and Mathematics: A\nPrelude to Discussion’, in <em>Explorations in Ancient\nPhilosophy. Volume II</em>, Cambridge, Cambridge University Press,\n70–98.",
                "Butcharov, P. (1966), <em>Resemblance and Identity. An Examination\nof the Problem of Universals</em>. Bloomington IN: Indiana University\nPress.",
                "Butcher, S. H. (1888), ‘The Geometrical Problem of the\n<em>Meno</em> (p. 86e-87a)’, <em>Journal of Philology</em>, 17:\n219–225.",
                "Carroll, L. (1895), ‘What the Tortoise Said to\nAchilles’, <em>Mind</em> (New Series), 4: 278–280.",
                "––– (1977), <em>Symbolic Logic</em>, W. W.\nBartley III (ed.), New York, NY: Clarkson N. Potter.",
                "Case, T. (1888), <em>Physical Realism</em>, Oxford: Clarendon\nPress.",
                "Cherniss, H. F. (1944), <em>Aristotle’s Criticism of Plato\nand the Academy. Volume 1</em>, Baltimore: John Hopkins University\nPress.",
                "Cherniss, H. F. (1945), <em>The Riddle of the Early Academy</em>,\nLos Angeles: University of California Press.",
                "Cohen, L. J. (1989), ‘Belief and Acceptance’,\n<em>Mind</em>, 98: 367–389.",
                "––– (1992), <em>An Essay on Belief and\nAcceptance</em>, Oxford: Clarendon Press.",
                "Collingwood, R. G. (1938), <em>The Principles of Art</em>, Oxford:\nClarendon Press.",
                "––– (1998), <em>An Essay on Metaphysics</em>,\nrevised edition, Oxford: Clarendon Press.",
                "––– (2013), <em>An Autobiography and other\nWritings</em>, D. Boucher &amp; T. Smith (eds.), Oxford: Clarendon\nPress.",
                "Dancy, J. (1993), <em>Moral Reasons</em>, Oxford: Blackwell.",
                "––– (2004), <em>Ethics without Principles</em>,\nOxford: Clarendon Press.",
                "Dedekind, R. (1872), <em>Stetigkeit und irrationale Zahlen</em>,\nBraunschweig: Vieweg &amp; Sohn. English translation:\n‘Continuity and Irrational Numbers’ in <em>Essays in the\nTheory of Numbers</em>, New York, Dover, 1963, pp. 1–27.",
                "Donagan, A. (1985), <em>The Later Philosophy of R. G.\nCollingwood</em>, Chicago: University of Chicago Press.",
                "Ducrot, O. (1980), <em>Dire et ne pas dire. Principes de\nsémantique linguistique</em>, Paris: Hermann.",
                "Dutant, J. (2015), ‘The Legend of the Justified True Belief\nAnalysis’, <em>Philosophical Perspectives</em>,\n95–145.",
                "Edgeworth, F. Y. (1911), ‘Probability’,\n<em>Encyclopaedia Britannica</em>, 11<sup>th</sup> Edition, vol. 22,\npp. 376–403.",
                "Engel, A. J. (1983), <em>From Clergyman to Don. The Rise of the\nAcademy Profession in Nineteenth-Century Oxford</em>, Oxford:\nClarendon Press.",
                "Farquharson, A. S. L. (1923), ‘Socrates’s Diagram in\nthe Meno of Plato, pp. 86e–87a’, <em>Classical\nQuarterly</em>, 17: 21–26.",
                "Foster, M. B. (1931), ‘The Concrete Universal: Cook Wilson\nand Bosanquet’, <em>Mind</em>, 40: 1–22.",
                "Furlong, E. J. (1941), ‘Cook Wilson and the\nNon-Euclideans’, <em>Mind</em>, 50: 122–139.",
                "Geach, P. T. (1972), ‘Assertions’, in <em>Logic\nMatters</em>, Oxford: Blackwell pp. 254–255.",
                "––– (1978), ‘Review of <em>Symbolic\nLogic</em>. By Lewis Carroll. Edited by W. W. Bartley III’,\n<em>Philosophy</em>, 53: 123–125.",
                "Grice, H. P. (1989), <em>Studies in the Way of Words</em>,\nCambridge MA: Harvard University Press.",
                "Hacker, P. M. S. (1996), <em>Wittgenstein’s Place in\nTwentieth-Century Analytic Philosophy</em>, Oxford: Blackwell.",
                "Hardie, W. F. R. (1936), <em>A Study in Plato</em>, Oxford:\nClarendon Press.",
                "Harris, D. W. &amp; E. Unnsteinsson (2018),\n‘Wittgenstein’s Influence on Austin’s Philosophy of\nLanguage’, <em>British Journal for the History of\nPhilosophy</em>, 26: 371–395.",
                "Heath, T. L. (1921), <em>A History of Greek Mathematics. Volume 1:\nFrom Thales to Euclid</em>, Oxford: Clarendon Press.",
                "Hintikka, J. (1962), <em>Knowledge and Belief. An Introduction to\nthe Logic of Two Notions</em>, Ithaca, NY: Cornell University\nPress.",
                "Hinton, J. M. (1973), <em>Experience: An Inquiry into Some\nAmbiguities</em>, Oxford: Clarendon Press.",
                "Husserl, E. (2001), <em>Logical Investigations. Volume 2</em>,\nLondon &amp; New York: Routledge.",
                "Jacquette, D. (2006), ‘Collingwood against Metaphysical\nRealism’, <em>Collingwood and British Idealism Studies\nincorporating Bradley Studies</em>, 12(2): 103–114.",
                "Jahanbegloo, R. (1992), <em>Conversations with Isaiah Berlin</em>,\nLondon: Peter Halban.",
                "Joachim, H. H. (1906), <em>The Nature of Truth</em>, Oxford:\nClarendon Press.",
                "Jones, J. R. (1949), ‘Are the Qualities of Particular Things\nUniversal or Particulars?’, <em>Philosophical Review</em> 58:\n152–170.",
                "––– (1950), ‘What Do We Mean By An\n‘Instance’?’, <em>Analysis</em>, 11:\n11–18.",
                "––– (1951), ‘Characters and\nResemblances’, <em>Philosophical Review</em> 60:\n551–562.",
                "Kalderon, M. E. (2011), ‘Before the Law’,\n<em>Philosophical Issues. A Supplement to Noûs</em>: 21,\n219–244.",
                "––– (2018), <em>Sympathy in Perception</em>,\nCambridge: Cambridge University Press.",
                "Kalderon, M. E. &amp; C. Travis (2013), ‘Oxford\nRealism’, in M. Beaney (ed.) <em>Oxford Handbook of the History\nof Analytic Philosophy</em>, Oxford: Clarendon Press,\n489–517.",
                "Kerferd, G. B. (1955), ‘Gorgias on Nature and That Which is\nNot’, <em>Phronesis</em> 1: 3–24.",
                "Klein, J. (1962), <em>Greek Mathematical Thought and the Origin of\nAlgebra</em>, New York: Dover.",
                "Knorr, W. R. (1986), <em>The Ancient Tradition of Geometric\nProblems</em>, Basel: Birkhauser.",
                "Kohne, J. (2010), <em>Knowledge as a Mental State? A Study in\nOxford Realism</em>, Berlin: Logos.",
                "Lawlor, K. (2013), <em>Assurance. An Austinian View of Knowledge\nand Knowledge Claims</em>, Oxford: Oxford University Press.",
                "Le Morvan, P. (2017), ‘Knowledge before Gettier’,\n<em>British Journal for the History of Philosophy</em>, 25:\n1216–1238.",
                "Lewis, C. S. (1955), <em>Surprised by Joy. The Shape of my Early\nLife</em>, London: Geoffrey Bles.",
                "Longworth, G. (2018a), ‘The Ordinary and the Experimental:\nCook Wilson and Austin on Method in Philosophy’, <em>British\nJournal for the History of Philosophy, 26</em>: 939–960.",
                "––– (2018b), ‘Enough is Enough: Austin on\nKnowing’, in S. L. Tsohadzidis (ed.), <em>Interpreting J. L.\nAustin. Critical Essays</em>. Cambridge: Cambridge University Press,\n186–205.",
                "––– (2019), ‘Settling a Question: Austin\non Disjunctivism’, in C. Doyle, J. Milburn &amp; D. Pritchard\n(eds.), <em>New Issues in Epistemological Disjunctivism.</em> London:\nRoutledge, 131–150.",
                "Lloyd, A. C. (1962), ‘Genus, Species and Ordered Series in\nAristotle’, <em>Phronesis</em>, 7: 67–90.",
                "Lloyd, G. E. R. (1992), ‘The <em>Meno</em> and the Mysteries\nof Mathematics’, <em>Phronesis</em>, 37: 166–183.",
                "Lloyd Beck, R. (1931), ‘John Cook Wilson’s Doctrine of\nthe Universal’, <em>The Monist</em>, 41: 552–582.",
                "Marion, M. (2000), ‘Oxford Realism: Knowledge and\nPerception’, <em>British Journal for the History of\nPhilosophy</em>, 8: 299–338 &amp; 485–519.",
                "––– (2002a), ‘Introduction’, in J.\nCook Wilson, <em>Statement and Inference</em>, reprint, Bristol:\nThoemmes Press, pp. v–xxvii.",
                "––– (2002b), ‘Case, Thomas’, <em>The\nDictionary of Nineteenth-Century British Philosophers</em>, Bristol:\nThoemmes Press, pp. 227–231.",
                "––– (2009), ‘Theory of Knowledge in\nBritain From 1860 to 1950: A Non-Revolutionary Account’,\n<em>Baltic International Yearbook of Cognition, Logic and\nCommunication</em>, 4,\n <a href=\"http://newprairiepress.org/cgi/viewcontent.cgi?article=1019&amp;context=biyclc\" target=\"other\">available online</a>.\n doi:10.4148/biyclc.v4i0.129",
                "––– (2011), ‘Cook Wilson and Austin on\nKnowledge, Wittgenstein, and the Rise of Ordinary Language\nPhilosophy’, in C. Al-Saleh &amp; S. Laugier (eds.), <em>John L.\nAustin et la philosophie du langage ordinaire</em>, Hildesheim: Georg\nOlms, pp. 81–105.",
                "––– (2016), ‘Lessons from Lewis\nCarroll’s Paradox of Inference’, <em>The Carrollian</em>,\n28: 48–75.",
                "Marion, M. &amp; A. Moktefi (2014),‘La logique symbolique en\ndébat à Oxford à la fin du XIXe siècle:\nles disputes logiques de Lewis Carroll et John Cook Wilson’,\n<em>Revue d’histoire des sciences</em> 67(2):\n185–205.",
                "Massin, O. (2011), ‘Le mutisme des sens’, in C.\nAl-Saleh &amp; S. Laugier (eds.), <em>John L. Austin et la philosophie\ndu langage ordinaire</em>, Hildesheim: Georg Olms, pp.\n321–345.",
                "McDowell, J. (1994), <em>Mind and World</em>, Cambridge, MA:\nHarvard University Press.",
                "––– (1998), <em>Meaning, Knowledge and\nReality</em>, Cambridge, MA: Harvard University Press.",
                "––– (2001), <em>Mind, Value and Reality</em>,\nCambridge, MA: Harvard University Press.",
                "McGrath, A. E. (2014), <em>The Intellectual World of C. S.\nLewis</em>, Chichester: Wiley-Blackwell.",
                "Moktefi, A. (2007b), <em>Déduire et séduire: la\nlogique symbolique de Lewis Carroll</em>, Ph.D. thesis,\nUniversité Louis Pasteur-Strasbourg 1.",
                "––– (2007b), ‘Lewis Carroll and the\nBritish Nineteenth-Century Logicians on the Barber Shop\nProblem’, <em>Proceedings of the Canadian Society for History\nand Philosophy of Mathematics</em>, 20: 189–199.",
                "––– (2008), ‘Lewis Carroll’s\nLogic’, in D. M. Gabbay &amp; J. Woods (eds.), <em>Handbook of\nthe History of Logic. Volume 4: British Logic in the Nineteenth\nCentury</em>, Amsterdam: North Holland, 457–505.",
                "Mulligan, K. (2014), ‘Knowledge First—a German\nFolly?’, in J. Dutant, D. Fassio &amp; A. Meylan (eds.),\n<em>Liber Amicorum Pascal Engel</em>, Geneva: Université de\nGenève, Faculté des Lettres, pp. 380–400.\n <a href=\"http://www.unige.ch/lettres/philo/publications/engel/liberamicorum/LiberAmicorum_PascalEngel.pdf\" target=\"other\">available online</a>.",
                "Mulligan, K., P. Simons &amp; B. Smith (1984),\n‘Truth-Makers’, <em>Philosophy and Phenomenological\nResearch</em>, 44: 287–321.",
                "Nasim, O. (2008), <em>Bertrand Russell and the Edwardian\nPhilosophers. Constructing the World</em>, Basingstoke: Palgrave\nMacMillan.",
                "Nelson, L. (1908) <em>Über das sogenannte\nErkenntnisproblem</em>, Göttingen, Vandenhoeck &amp;\nRuprecht.",
                "––– (1949), ‘The Impossibility of a Theory\nof Knowledge’, in <em>Socratic Method and Critical Philosophy.\nSelected Essays</em>, New York: Dover, pp. 185–205.",
                "Passmore, J. (1968), <em>A Hundred Years of Philosophy</em>,\nsecond edition, Harmondsworth: Penguin.",
                "Phillips Griffiths, A. (ed.) (1967), <em>Knowledge and\nBelief</em>, Oxford: Oxford University Press.",
                "Prior, A. N. (1949), ‘Determinables, Determinates and\nDeterminants’, <em>Mind</em>, 58: 2–20 &amp;\n179–194.",
                "Robinson, R. (1928a), ‘Cook Wilson’s View of\nJudgement’, <em>Mind</em>, 37: 304–317.",
                "––– (1928b) ‘Cook Wilson’s View of\nthe Origin of “Judgement”’, <em>Mind</em>, 37:\n454–470",
                "––– (1931) <em>The Province of Logic. An\nInterpretation of Certain Parts of Cook Wilson’s\n“Statement and Inference”</em>, London: Routledge.",
                "Russell, B. (1903), <em>The Principles of Mathematics</em>,\nLondon: Allen &amp; Unwin.",
                "––– (1910), <em>Philosophical Essays</em>,\nLondon: Longmans &amp; Green.",
                "––– (1912), <em>Problems of Philosophy</em>,\nOxford: Oxford University Press.",
                "––– (1917), <em>Mysticism and Logic</em>,\nLondon: Longmans &amp; Green. Quoted from <em>Mysticism and\nLogic</em>, London: Routledge, 2004.",
                "Scott, D. (2006), <em>Plato’s Meno</em>, Cambridge:\nCambridge University Press.",
                "Sellars, W. (1957), ‘Logical Subjects and Physical\nObjects’, <em>Philosophy and Phenomenological Research</em>,\n17(4), 458–472.",
                "––– (1975), ‘Autobiographical\nReflections’, in H.-N. Castaneda (ed.), <em>Action, Knowledge\nand Reality. Critical Studies in Honor of Wilfrid Sellars</em>,\nIndianapolis: Bobbs-Merrill, pp. 276–293.",
                "Seneta, E. (2012), ‘Victorian Probability and Lewis\nCarroll’,<em>Journal of the Royal Statistical Society</em>,\n175(2), 435–451.",
                "––– (2013), ‘A Tricentenary History of the\nLaw of Large Numbers’, <em>Bernoulli</em>, 19(4),\n1088–1121.",
                "Siegel, S. (2019), ‘The Uneasy Heirs of Acquaintance’,\n<em>Philosophical Issues. A Supplement to Noûs</em>: 29,\n1–18.",
                "Snowdon, P. (2008), ‘Hinton and the Origins of\nDisjunctivism’, in A. Haddock &amp; F. Macpherson (eds.),\n<em>Disjunctivism. Perception, Action, Knowledge</em>, Oxford: Oxford\nUniversity Press, pp. 35–56.",
                "Soteriou, M. (2016), <em>Disjunctivism</em>. London &amp; New\nYork: Routledge.",
                "Stoneham, T. (2008), ‘A Neglected Account of\nPerception’, <em>Dialectica</em>, 62: 307–322.",
                "Stout, G. F. (1904), ‘Primary and Secondary\nQualities’, <em>Proceedings of the Aristotelian Society</em>, 4:\n141–160.",
                "––– (1911), <em>Some Fundamental Points in the\nTheory of Knowledge</em>, Glasgow: Robert Maclehose &amp; Co.",
                "––– (1921), <em>The Nature of Universals and\nPropositions</em>, Oxford: Oxford University Press, reprinted in\n<em>Studies in Philosophy and Psychology</em>, London: MacMillan, pp.\n384–403.",
                "Tarán, L. (1981), <em>Speusippus of Athens</em>, Leiden:\nBrill.",
                "Travis, C. (1981), <em>The True and the False: the Domain of the\nPragmatic</em>, Amsterdam: John Benjamins.",
                "––– (1989), <em>The Uses of Sense.\nWittgenstein’s Philosophy of Language</em>, Oxford: Oxford\nUniversity Press.",
                "––– (1996), ‘Meaning’s Role in\nTruth’, <em>Mind</em> 105: 451–466.",
                "––– (1997), ‘Pragmatics’, in B. Hale\n&amp; C. Wright (eds.), <em>A Companion to the Philosophy of\nLanguage</em>, Oxford: Blackwell, pp. 87–107.",
                "––– (2004), ‘The Silence of the\nSenses’, <em>Mind</em>, 113: 57–94.",
                "––– (2005), ‘A Sense of Occasion’,\n<em>The Philosophical Quarterly</em>, 55: 286–314.",
                "––– (2008), <em>Occasion-Sensitivity. Selected\nEssays</em>, Oxford: Oxford University Press.",
                "Ueberweg, F. (1871), <em>System of Logic and History of Logical\nDoctrines</em>, London: Longmans &amp; Green.",
                "Walsh, W. H. (2000), ‘The Zenith of Greats’, in M. G.\nBrock &amp; M. C. Curthoys (eds.), <em>The History of the University\nof Oxford. Volume VII: Nineteenth-Century Oxford, Part 2</em>, Oxford:\nClarendon Press, pp. 311–326.",
                "Warnock, G. J. (1958), <em>English Philosophy since 1900</em>,\nLondon: Oxford University Press.",
                "Warnock, G. J. (1963), ‘John Langshaw Austin\n1911–1960’, <em>Proceedings of the British Academy</em>,\n49: 345–363.",
                "Webb, C. C. J. (1945), <em>Religious Experience</em>, London:\nOxford University Press.",
                "Wiggins, D. (1976), ‘Truth, Invention, and the Meaning of\nLife’, <em>Proceedings of the British Academy</em>, 62:\n331–378.",
                "Williamson, T. (2000), <em>Knowledge and its Limits</em>, Oxford:\nClarendon Press.",
                "Williamson, T. (2007), <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell.",
                "Wisdom, J. (1934), <em>Problems of Mind and Matter</em>,\nCambridge: Cambridge University Press.",
                "Wolfsdorf, D. (2008), <em>Trials of Reason. Plato and the Crafting\nof Philosophy</em>, New York: Oxford University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<h4>Writings by Cook Wilson</h4>\n<ul class=\"hanging\">\n<li>[AS] <em>Aristotelian Studies I. On the Structure of the Seventh\nBook of the Nicomachean Ethics, ch. i–x</em>, Oxford, Clarendon\nPress, 1871, second edition, 1912.</li>\n<li>[ASV] ‘<em>Aristotelian Studies I. On the Structure of the\nSeventh Book of the Nicomachean Ethics, ch. i–x</em>, vom\nVerfasser’, <em>Göttingische gelehrte Anzeige</em>, April\n14, 1880, pp. 449–474.</li>\n<li>[IPT] <em>On the Interpretation of Plato’s Timaeus. Critical\nStudies with Reference to a Recent Edition</em>, Oxford, Clarendon\nPress, 1889.</li>\n<li>[ETA] <em>On an Evolutionist Theory of the Axioms, An Inaugural\nLecture</em>, Oxford, Clarendon Press, 1889.</li>\n<li>[APT] ‘Apelt’s Pseudo-Aristotelian Treatises’,\n<em>The Classical Review</em> 6 (1892): pp. 16–19,\n100–107, 156–162, 209–214, 441–446 &amp; 7\n(1893): 33–39.</li>\n<li>[IP] ‘Inverse or “a posteriori”\nProbability’, <em>Nature</em>, December 13, 1900, pp.\n154–6. Reproduced partly as (SI, §§\n325–327).</li>\n<li>[PBT] ‘Probability—James Bernoulli’s\nTheorem’, <em>Nature</em>, March 14, 1901, pp. 465–6.</li>\n<li>[GPP] ‘On the Geometrical Problem in Plato’s\n<em>Meno</em>, 86e sqq.: With a Note on a Passage in the Treatise De\nLineis Insecabilibus’, <em>The Journal of Philology</em>,\nJanuary 1, 1903, pp. 222–240</li>\n<li>[OPD] ‘On the Platonist Doctrine of the\nἀσύμβλητοι\nἀριθμοί’, <em>The Classical\nReview</em>, 18 (1904): 247–60.</li>\n<li>[TGF] <em>On the Traversing of Geometrical Figures</em>, Oxford,\nClarendon Press, 1905.</li>\n<li>[CLP] ‘Lewis Carroll’s Logical Paradox’,\n<em>Mind</em>, 14 (1905): 292–293. With correction,\n<em>Mind</em>, 14 (1905): 439.</li>\n<li>[SI] <em>Statement and Inference with other Philosophical\nPapers</em>, 2 vols., Oxford, Clarendon Press, 1926; reprint: Bristol\n2002.</li>\n<li>[UL] <em>Unpublished Lectures from 1913–1914</em>\n(Charlottesville VA, Intelex, 2005). Electronic edition in the Past\nMasters series\n <a href=\"http://www.nlx.com/collections/141\" target=\"other\">available online</a>.</li>\n</ul>\n<p>\nFor a complete list of Cook Wilson’s publications during his\nlifetime, see (SI, lxv–lxxii). Cook Wilson’s papers were\ndeposited at the Bodleian Library, University of Oxford in 1970, ref.\nGB 161 MSS. Top. Oxon. c. 580–4, and a carbon copy of his\nlecture notes on Plato’s <em>The Republic</em>, that had been in\npossession of A. D. Woozley, was donated to the Houghton Library,\nHarvard University in 2008. Another such typescript was deposited\namong the papers of Percy William Dodd at Jesus College, Oxford\n(JC:F12/MS5/I).</p>\n<h4>Oxford Philosophy</h4>\n<ul class=\"hanging\">\n<li>Ackrill, J. L. (1997), <em>Essays on Plato and Aristotle</em>,\nOxford: Clarendon Press.</li>\n<li>Austin, J. L. (1962), <em>Sense and Sensibilia</em>, Oxford:\nClarendon Press.</li>\n<li>––– (1979), <em>Philosophical Papers</em>, third\nedition, Oxford: Clarendon Press.</li>\n<li>Berlin, I. (2004), <em>Flourishing. Letters 1928–1946</em>,\nLondon: Chatto &amp; Windus.</li>\n<li>Cross, R. C. &amp; A. D. Woozley (1964), <em>Plato’s\nRepublic. A Philosophical Commentary</em>, London: MacMillan.</li>\n<li>Joseph, H. W. B. (1916a), <em>An Introduction to Logic</em>,\nOxford: Clarendon Press.</li>\n<li>––– (1916b), ‘Professor John Cook\nWilson’, <em>Proceedings of the British Academy</em>, 7:\n555–565.</li>\n<li>––– (1948), <em>Knowledge and the Good in\nPlato’s Republic</em>, H. L. A. Hart (ed.), London: Oxford\nUniversity Press.</li>\n<li>Kneale, W. C. (1949), <em>Probability and Induction</em>, Oxford:\nClarendon Press.</li>\n<li>Price, H. H. (1924), ‘Reality and Sensible\nAppearance’, <em>Mind</em>, 33: 20–43.</li>\n<li>––– (1932) <em>Perception</em>, London: Methuen,\n2nd edition, 1950.</li>\n<li>––– (1935), ‘Some Considerations about\nBelief’, <em>Proceedings of the Aristotelian Society</em>, 35:\n229–52</li>\n<li>––– (1947) ‘Harold Arthur Prichard\n1871–1947’, <em>Proceedings of the British Academy</em>,\n33: 331–350.</li>\n<li>––– (1969), <em>Belief. The Gifford Lectures\ndelivered at the University of Aberdeen in 1960</em>, London: Allen\n&amp; Unwin. Reprint: Thoemmes Press, 1996.</li>\n<li>Prichard, H. A. (1906), ‘Appearances and Reality’,\n<em>Mind</em>, 15: 223–229.</li>\n<li>––– (1909), <em>Kant’s Theory of\nKnowledge</em>, Oxford: Clarendon Press.</li>\n<li>––– (1912), ‘Does Moral Philosophy Rest on\na Mistake?’, <em>Mind</em>, 21: 21–37.</li>\n<li>––– (1915), ‘Mr. Bertrand Russell on\n<em>Our Knowledge of the External World</em>’, <em>Mind</em>,\n24: 145–185.</li>\n<li>––– (1919), ‘Professor John Cook\nWilson’, <em>Mind</em>, 28: 297–318.</li>\n<li>––– (1928), ‘Mr. Bertrand Russell’s\n<em>Outline of Philosophy</em>’, <em>Mind</em>, 37:\n265–282.</li>\n<li>––– (1949) <em>Moral Obligation</em>, W. D. Ross\n(ed.), Oxford: Clarendon Press.</li>\n<li>––– (1950), <em>Knowledge and Perception. Essays\nand Lectures</em>, Oxford: Clarendon Press.</li>\n<li>––– (2002), <em>Moral Writings</em>, J. MacAdam\n(ed.), Oxford: Clarendon Press.</li>\n<li>Ross, W. D. (1924), <em>Aristotle’s Metaphysics. With\nIntroduction and Commentary</em>, 2 volumes, Oxford: Clarendon\nPress.</li>\n<li>––– (1930), <em>The Right and the Good</em>,\nOxford: Clarendon Press.</li>\n<li>––– (1939), <em>Foundations of Ethics. The\nGifford Lectures delivered in the University of Aberdeen\n1935–6</em>, Oxford: Clarendon Press.</li>\n<li>––– (1949), <em>Aristotle’s Prior and\nPosterior Analytics. With Introduction and Commentary</em>, 2 volumes,\nOxford: Clarendon Press.</li>\n<li>Ryle, G., (1971) <em>Collected Papers</em>, 2 vols., London:\nHutchinson. Reprint: Bristol, Thoemmes Press, 1990.</li>\n<li>––– (1990), ‘The Logical Atomism in\nPlato’s <em>Theaetetus</em>’, <em>Phronesis</em>, 35(1):\n21–46.</li>\n<li>––– (1993) ‘Paper Read at the Oxford\nPhilosophical Society 500th Meeting, 1968’, in <em>Aspects of\nMind</em>, Oxford: Blackwell.</li>\n<li>Strawson, P. F. (1952), <em>Introduction to Logical Theory</em>,\nLondon: Methuen.</li>\n<li>––– (1959), <em>Individuals. An Essay in\nDescriptive Metaphysics</em>, London: Methuen.</li>\n<li>Urmson, J. O. (1988), ‘Prichard and Knowledge’, in J.\nDancy, J. M. E. Moravcsik &amp; C. C. W. Taylor (eds.), <em>Human\nAgency. Language, Duty and Value</em>, Stanford CA: Stanford\nUniversity Press, pp. 11–24.</li>\n<li>Woozley, A. D. (1949), <em>Theory of Knowledge</em>, London:\nHutchinson.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Adam Carter, J., E. C. Gordon &amp; B. W. Jarvis (2017),\n<em>Knowledge First. Approaches in Epistemology and Mind.</em> Oxford:\nOxford University Press.</li>\n<li>Allen, R. E. (1983), <em>Plato’s Parmenides. Translation and\nAnalysis</em>, Minneapolis, MN: University of Minnesota Press.</li>\n<li>Al-Saleh, C. (2003), ‘La place de la critique de Hume dans\nla formation du réalisme à Oxford dans la\npremière moitié du XXe siècle: quelques\naspects’, <em>Revue de métaphysique et de morale</em>,\n2003/2: 199–212.</li>\n<li>Antognazza, M. R. (2020), ‘The Distinction in Kind between\nKnowledge and Belief’, <em>Proceedings of the Aristotelian\nSociety</em>, 120: 277–308.</li>\n<li>Armstrong, D. M. (1978), <em>Nominalism and Realism. Universals\nand Scientific Realism. Volume 1</em>, Cambridge: Cambridge University\nPress. </li>\n<li>Armstrong, D. M. (1989), <em>Universals. An Opinionated\nIntroduction</em>. Boulder: Westview.</li>\n<li>Bain, A. (1888), <em>The Emotions and the Will</em>, 3rd edition,\nLondon: Longmans, Green, and Co.</li>\n<li>Baker, A. (2008), ‘Experimental Mathematics’,\n<em>Erkenntnis</em>, 68: 331–344.</li>\n<li>Beaney, M. (2013), ‘Collingwood’s Critique of Oxbridge\nRealism’, in D. Boucher &amp; T. Smith (eds.), <em>R. G.\nCollingwood: An Autobiography &amp; other Writings</em>, Oxford:\nClarendon Press, pp. 247–269.</li>\n<li>Bradley, F. H. (1897), <em>Appearance and Reality</em>, 2nd\nedition, Oxford: Clarendon Press.</li>\n<li>––– (1922), <em>The Principles of Logic</em>,\n2nd edition, Oxford: Clarendon Press.</li>\n<li>Brandhoff, B. (2020), ‘Cook Wilson, Sellars, and the\nExplication of Language’, in S. Brandt &amp; A. Breunig (eds.),\n<em>Wilfrid Sellars and Twentieth-Century Philosophy</em>, New York\n&amp; London: Routledge, pp. 11–28.</li>\n<li>Bolzano, B. (1972), <em>Theory of Science</em>, Berkeley &amp; Los\nAngeles: Universiy of California Press.</li>\n<li>Bonjour, L. (1998), <em>In Defense of Pure Reason</em>, Cambridge:\nCambridge University Press.</li>\n<li>Burnyeat, M. F. (2012), ‘Platonism and Mathematics: A\nPrelude to Discussion’, in <em>Explorations in Ancient\nPhilosophy. Volume II</em>, Cambridge, Cambridge University Press,\n70–98.</li>\n<li>Butcharov, P. (1966), <em>Resemblance and Identity. An Examination\nof the Problem of Universals</em>. Bloomington IN: Indiana University\nPress.</li>\n<li>Butcher, S. H. (1888), ‘The Geometrical Problem of the\n<em>Meno</em> (p. 86e-87a)’, <em>Journal of Philology</em>, 17:\n219–225.</li>\n<li>Carroll, L. (1895), ‘What the Tortoise Said to\nAchilles’, <em>Mind</em> (New Series), 4: 278–280.</li>\n<li>––– (1977), <em>Symbolic Logic</em>, W. W.\nBartley III (ed.), New York, NY: Clarkson N. Potter.</li>\n<li>Case, T. (1888), <em>Physical Realism</em>, Oxford: Clarendon\nPress.</li>\n<li>Cherniss, H. F. (1944), <em>Aristotle’s Criticism of Plato\nand the Academy. Volume 1</em>, Baltimore: John Hopkins University\nPress.</li>\n<li>Cherniss, H. F. (1945), <em>The Riddle of the Early Academy</em>,\nLos Angeles: University of California Press.</li>\n<li>Cohen, L. J. (1989), ‘Belief and Acceptance’,\n<em>Mind</em>, 98: 367–389.</li>\n<li>––– (1992), <em>An Essay on Belief and\nAcceptance</em>, Oxford: Clarendon Press.</li>\n<li>Collingwood, R. G. (1938), <em>The Principles of Art</em>, Oxford:\nClarendon Press.</li>\n<li>––– (1998), <em>An Essay on Metaphysics</em>,\nrevised edition, Oxford: Clarendon Press.</li>\n<li>––– (2013), <em>An Autobiography and other\nWritings</em>, D. Boucher &amp; T. Smith (eds.), Oxford: Clarendon\nPress.</li>\n<li>Dancy, J. (1993), <em>Moral Reasons</em>, Oxford: Blackwell.</li>\n<li>––– (2004), <em>Ethics without Principles</em>,\nOxford: Clarendon Press.</li>\n<li>Dedekind, R. (1872), <em>Stetigkeit und irrationale Zahlen</em>,\nBraunschweig: Vieweg &amp; Sohn. English translation:\n‘Continuity and Irrational Numbers’ in <em>Essays in the\nTheory of Numbers</em>, New York, Dover, 1963, pp. 1–27.</li>\n<li>Donagan, A. (1985), <em>The Later Philosophy of R. G.\nCollingwood</em>, Chicago: University of Chicago Press.</li>\n<li>Ducrot, O. (1980), <em>Dire et ne pas dire. Principes de\nsémantique linguistique</em>, Paris: Hermann.</li>\n<li>Dutant, J. (2015), ‘The Legend of the Justified True Belief\nAnalysis’, <em>Philosophical Perspectives</em>,\n95–145.</li>\n<li>Edgeworth, F. Y. (1911), ‘Probability’,\n<em>Encyclopaedia Britannica</em>, 11<sup>th</sup> Edition, vol. 22,\npp. 376–403.</li>\n<li>Engel, A. J. (1983), <em>From Clergyman to Don. The Rise of the\nAcademy Profession in Nineteenth-Century Oxford</em>, Oxford:\nClarendon Press.</li>\n<li>Farquharson, A. S. L. (1923), ‘Socrates’s Diagram in\nthe Meno of Plato, pp. 86e–87a’, <em>Classical\nQuarterly</em>, 17: 21–26.</li>\n<li>Foster, M. B. (1931), ‘The Concrete Universal: Cook Wilson\nand Bosanquet’, <em>Mind</em>, 40: 1–22.</li>\n<li>Furlong, E. J. (1941), ‘Cook Wilson and the\nNon-Euclideans’, <em>Mind</em>, 50: 122–139.</li>\n<li>Geach, P. T. (1972), ‘Assertions’, in <em>Logic\nMatters</em>, Oxford: Blackwell pp. 254–255.</li>\n<li>––– (1978), ‘Review of <em>Symbolic\nLogic</em>. By Lewis Carroll. Edited by W. W. Bartley III’,\n<em>Philosophy</em>, 53: 123–125.</li>\n<li>Grice, H. P. (1989), <em>Studies in the Way of Words</em>,\nCambridge MA: Harvard University Press.</li>\n<li>Hacker, P. M. S. (1996), <em>Wittgenstein’s Place in\nTwentieth-Century Analytic Philosophy</em>, Oxford: Blackwell.</li>\n<li>Hardie, W. F. R. (1936), <em>A Study in Plato</em>, Oxford:\nClarendon Press.</li>\n<li>Harris, D. W. &amp; E. Unnsteinsson (2018),\n‘Wittgenstein’s Influence on Austin’s Philosophy of\nLanguage’, <em>British Journal for the History of\nPhilosophy</em>, 26: 371–395.</li>\n<li>Heath, T. L. (1921), <em>A History of Greek Mathematics. Volume 1:\nFrom Thales to Euclid</em>, Oxford: Clarendon Press.</li>\n<li>Hintikka, J. (1962), <em>Knowledge and Belief. An Introduction to\nthe Logic of Two Notions</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Hinton, J. M. (1973), <em>Experience: An Inquiry into Some\nAmbiguities</em>, Oxford: Clarendon Press.</li>\n<li>Husserl, E. (2001), <em>Logical Investigations. Volume 2</em>,\nLondon &amp; New York: Routledge.</li>\n<li>Jacquette, D. (2006), ‘Collingwood against Metaphysical\nRealism’, <em>Collingwood and British Idealism Studies\nincorporating Bradley Studies</em>, 12(2): 103–114.</li>\n<li>Jahanbegloo, R. (1992), <em>Conversations with Isaiah Berlin</em>,\nLondon: Peter Halban.</li>\n<li>Joachim, H. H. (1906), <em>The Nature of Truth</em>, Oxford:\nClarendon Press.</li>\n<li>Jones, J. R. (1949), ‘Are the Qualities of Particular Things\nUniversal or Particulars?’, <em>Philosophical Review</em> 58:\n152–170.</li>\n<li>––– (1950), ‘What Do We Mean By An\n‘Instance’?’, <em>Analysis</em>, 11:\n11–18.</li>\n<li>––– (1951), ‘Characters and\nResemblances’, <em>Philosophical Review</em> 60:\n551–562.</li>\n<li>Kalderon, M. E. (2011), ‘Before the Law’,\n<em>Philosophical Issues. A Supplement to Noûs</em>: 21,\n219–244.</li>\n<li>––– (2018), <em>Sympathy in Perception</em>,\nCambridge: Cambridge University Press.</li>\n<li>Kalderon, M. E. &amp; C. Travis (2013), ‘Oxford\nRealism’, in M. Beaney (ed.) <em>Oxford Handbook of the History\nof Analytic Philosophy</em>, Oxford: Clarendon Press,\n489–517.</li>\n<li>Kerferd, G. B. (1955), ‘Gorgias on Nature and That Which is\nNot’, <em>Phronesis</em> 1: 3–24.</li>\n<li>Klein, J. (1962), <em>Greek Mathematical Thought and the Origin of\nAlgebra</em>, New York: Dover.</li>\n<li>Knorr, W. R. (1986), <em>The Ancient Tradition of Geometric\nProblems</em>, Basel: Birkhauser.</li>\n<li>Kohne, J. (2010), <em>Knowledge as a Mental State? A Study in\nOxford Realism</em>, Berlin: Logos.</li>\n<li>Lawlor, K. (2013), <em>Assurance. An Austinian View of Knowledge\nand Knowledge Claims</em>, Oxford: Oxford University Press.</li>\n<li>Le Morvan, P. (2017), ‘Knowledge before Gettier’,\n<em>British Journal for the History of Philosophy</em>, 25:\n1216–1238.</li>\n<li>Lewis, C. S. (1955), <em>Surprised by Joy. The Shape of my Early\nLife</em>, London: Geoffrey Bles.</li>\n<li>Longworth, G. (2018a), ‘The Ordinary and the Experimental:\nCook Wilson and Austin on Method in Philosophy’, <em>British\nJournal for the History of Philosophy, 26</em>: 939–960.</li>\n<li>––– (2018b), ‘Enough is Enough: Austin on\nKnowing’, in S. L. Tsohadzidis (ed.), <em>Interpreting J. L.\nAustin. Critical Essays</em>. Cambridge: Cambridge University Press,\n186–205.</li>\n<li>––– (2019), ‘Settling a Question: Austin\non Disjunctivism’, in C. Doyle, J. Milburn &amp; D. Pritchard\n(eds.), <em>New Issues in Epistemological Disjunctivism.</em> London:\nRoutledge, 131–150.</li>\n<li>Lloyd, A. C. (1962), ‘Genus, Species and Ordered Series in\nAristotle’, <em>Phronesis</em>, 7: 67–90.</li>\n<li>Lloyd, G. E. R. (1992), ‘The <em>Meno</em> and the Mysteries\nof Mathematics’, <em>Phronesis</em>, 37: 166–183.</li>\n<li>Lloyd Beck, R. (1931), ‘John Cook Wilson’s Doctrine of\nthe Universal’, <em>The Monist</em>, 41: 552–582.</li>\n<li>Marion, M. (2000), ‘Oxford Realism: Knowledge and\nPerception’, <em>British Journal for the History of\nPhilosophy</em>, 8: 299–338 &amp; 485–519.</li>\n<li>––– (2002a), ‘Introduction’, in J.\nCook Wilson, <em>Statement and Inference</em>, reprint, Bristol:\nThoemmes Press, pp. v–xxvii.</li>\n<li>––– (2002b), ‘Case, Thomas’, <em>The\nDictionary of Nineteenth-Century British Philosophers</em>, Bristol:\nThoemmes Press, pp. 227–231.</li>\n<li>––– (2009), ‘Theory of Knowledge in\nBritain From 1860 to 1950: A Non-Revolutionary Account’,\n<em>Baltic International Yearbook of Cognition, Logic and\nCommunication</em>, 4,\n <a href=\"http://newprairiepress.org/cgi/viewcontent.cgi?article=1019&amp;context=biyclc\" target=\"other\">available online</a>.\n doi:10.4148/biyclc.v4i0.129</li>\n<li>––– (2011), ‘Cook Wilson and Austin on\nKnowledge, Wittgenstein, and the Rise of Ordinary Language\nPhilosophy’, in C. Al-Saleh &amp; S. Laugier (eds.), <em>John L.\nAustin et la philosophie du langage ordinaire</em>, Hildesheim: Georg\nOlms, pp. 81–105.</li>\n<li>––– (2016), ‘Lessons from Lewis\nCarroll’s Paradox of Inference’, <em>The Carrollian</em>,\n28: 48–75.</li>\n<li>Marion, M. &amp; A. Moktefi (2014),‘La logique symbolique en\ndébat à Oxford à la fin du XIXe siècle:\nles disputes logiques de Lewis Carroll et John Cook Wilson’,\n<em>Revue d’histoire des sciences</em> 67(2):\n185–205.</li>\n<li>Massin, O. (2011), ‘Le mutisme des sens’, in C.\nAl-Saleh &amp; S. Laugier (eds.), <em>John L. Austin et la philosophie\ndu langage ordinaire</em>, Hildesheim: Georg Olms, pp.\n321–345.</li>\n<li>McDowell, J. (1994), <em>Mind and World</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>––– (1998), <em>Meaning, Knowledge and\nReality</em>, Cambridge, MA: Harvard University Press.</li>\n<li>––– (2001), <em>Mind, Value and Reality</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>McGrath, A. E. (2014), <em>The Intellectual World of C. S.\nLewis</em>, Chichester: Wiley-Blackwell.</li>\n<li>Moktefi, A. (2007b), <em>Déduire et séduire: la\nlogique symbolique de Lewis Carroll</em>, Ph.D. thesis,\nUniversité Louis Pasteur-Strasbourg 1.</li>\n<li>––– (2007b), ‘Lewis Carroll and the\nBritish Nineteenth-Century Logicians on the Barber Shop\nProblem’, <em>Proceedings of the Canadian Society for History\nand Philosophy of Mathematics</em>, 20: 189–199.</li>\n<li>––– (2008), ‘Lewis Carroll’s\nLogic’, in D. M. Gabbay &amp; J. Woods (eds.), <em>Handbook of\nthe History of Logic. Volume 4: British Logic in the Nineteenth\nCentury</em>, Amsterdam: North Holland, 457–505.</li>\n<li>Mulligan, K. (2014), ‘Knowledge First—a German\nFolly?’, in J. Dutant, D. Fassio &amp; A. Meylan (eds.),\n<em>Liber Amicorum Pascal Engel</em>, Geneva: Université de\nGenève, Faculté des Lettres, pp. 380–400.\n <a href=\"http://www.unige.ch/lettres/philo/publications/engel/liberamicorum/LiberAmicorum_PascalEngel.pdf\" target=\"other\">available online</a>.</li>\n<li>Mulligan, K., P. Simons &amp; B. Smith (1984),\n‘Truth-Makers’, <em>Philosophy and Phenomenological\nResearch</em>, 44: 287–321.</li>\n<li>Nasim, O. (2008), <em>Bertrand Russell and the Edwardian\nPhilosophers. Constructing the World</em>, Basingstoke: Palgrave\nMacMillan.</li>\n<li>Nelson, L. (1908) <em>Über das sogenannte\nErkenntnisproblem</em>, Göttingen, Vandenhoeck &amp;\nRuprecht.</li>\n<li>––– (1949), ‘The Impossibility of a Theory\nof Knowledge’, in <em>Socratic Method and Critical Philosophy.\nSelected Essays</em>, New York: Dover, pp. 185–205.</li>\n<li>Passmore, J. (1968), <em>A Hundred Years of Philosophy</em>,\nsecond edition, Harmondsworth: Penguin.</li>\n<li>Phillips Griffiths, A. (ed.) (1967), <em>Knowledge and\nBelief</em>, Oxford: Oxford University Press.</li>\n<li>Prior, A. N. (1949), ‘Determinables, Determinates and\nDeterminants’, <em>Mind</em>, 58: 2–20 &amp;\n179–194.</li>\n<li>Robinson, R. (1928a), ‘Cook Wilson’s View of\nJudgement’, <em>Mind</em>, 37: 304–317.</li>\n<li>––– (1928b) ‘Cook Wilson’s View of\nthe Origin of “Judgement”’, <em>Mind</em>, 37:\n454–470</li>\n<li>––– (1931) <em>The Province of Logic. An\nInterpretation of Certain Parts of Cook Wilson’s\n“Statement and Inference”</em>, London: Routledge.</li>\n<li>Russell, B. (1903), <em>The Principles of Mathematics</em>,\nLondon: Allen &amp; Unwin.</li>\n<li>––– (1910), <em>Philosophical Essays</em>,\nLondon: Longmans &amp; Green.</li>\n<li>––– (1912), <em>Problems of Philosophy</em>,\nOxford: Oxford University Press.</li>\n<li>––– (1917), <em>Mysticism and Logic</em>,\nLondon: Longmans &amp; Green. Quoted from <em>Mysticism and\nLogic</em>, London: Routledge, 2004.</li>\n<li>Scott, D. (2006), <em>Plato’s Meno</em>, Cambridge:\nCambridge University Press.</li>\n<li>Sellars, W. (1957), ‘Logical Subjects and Physical\nObjects’, <em>Philosophy and Phenomenological Research</em>,\n17(4), 458–472.</li>\n<li>––– (1975), ‘Autobiographical\nReflections’, in H.-N. Castaneda (ed.), <em>Action, Knowledge\nand Reality. Critical Studies in Honor of Wilfrid Sellars</em>,\nIndianapolis: Bobbs-Merrill, pp. 276–293.</li>\n<li>Seneta, E. (2012), ‘Victorian Probability and Lewis\nCarroll’,<em>Journal of the Royal Statistical Society</em>,\n175(2), 435–451.</li>\n<li>––– (2013), ‘A Tricentenary History of the\nLaw of Large Numbers’, <em>Bernoulli</em>, 19(4),\n1088–1121.</li>\n<li>Siegel, S. (2019), ‘The Uneasy Heirs of Acquaintance’,\n<em>Philosophical Issues. A Supplement to Noûs</em>: 29,\n1–18.</li>\n<li>Snowdon, P. (2008), ‘Hinton and the Origins of\nDisjunctivism’, in A. Haddock &amp; F. Macpherson (eds.),\n<em>Disjunctivism. Perception, Action, Knowledge</em>, Oxford: Oxford\nUniversity Press, pp. 35–56.</li>\n<li>Soteriou, M. (2016), <em>Disjunctivism</em>. London &amp; New\nYork: Routledge.</li>\n<li>Stoneham, T. (2008), ‘A Neglected Account of\nPerception’, <em>Dialectica</em>, 62: 307–322.</li>\n<li>Stout, G. F. (1904), ‘Primary and Secondary\nQualities’, <em>Proceedings of the Aristotelian Society</em>, 4:\n141–160.</li>\n<li>––– (1911), <em>Some Fundamental Points in the\nTheory of Knowledge</em>, Glasgow: Robert Maclehose &amp; Co.</li>\n<li>––– (1921), <em>The Nature of Universals and\nPropositions</em>, Oxford: Oxford University Press, reprinted in\n<em>Studies in Philosophy and Psychology</em>, London: MacMillan, pp.\n384–403.</li>\n<li>Tarán, L. (1981), <em>Speusippus of Athens</em>, Leiden:\nBrill.</li>\n<li>Travis, C. (1981), <em>The True and the False: the Domain of the\nPragmatic</em>, Amsterdam: John Benjamins.</li>\n<li>––– (1989), <em>The Uses of Sense.\nWittgenstein’s Philosophy of Language</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>––– (1996), ‘Meaning’s Role in\nTruth’, <em>Mind</em> 105: 451–466.</li>\n<li>––– (1997), ‘Pragmatics’, in B. Hale\n&amp; C. Wright (eds.), <em>A Companion to the Philosophy of\nLanguage</em>, Oxford: Blackwell, pp. 87–107.</li>\n<li>––– (2004), ‘The Silence of the\nSenses’, <em>Mind</em>, 113: 57–94.</li>\n<li>––– (2005), ‘A Sense of Occasion’,\n<em>The Philosophical Quarterly</em>, 55: 286–314.</li>\n<li>––– (2008), <em>Occasion-Sensitivity. Selected\nEssays</em>, Oxford: Oxford University Press.</li>\n<li>Ueberweg, F. (1871), <em>System of Logic and History of Logical\nDoctrines</em>, London: Longmans &amp; Green.</li>\n<li>Walsh, W. H. (2000), ‘The Zenith of Greats’, in M. G.\nBrock &amp; M. C. Curthoys (eds.), <em>The History of the University\nof Oxford. Volume VII: Nineteenth-Century Oxford, Part 2</em>, Oxford:\nClarendon Press, pp. 311–326.</li>\n<li>Warnock, G. J. (1958), <em>English Philosophy since 1900</em>,\nLondon: Oxford University Press.</li>\n<li>Warnock, G. J. (1963), ‘John Langshaw Austin\n1911–1960’, <em>Proceedings of the British Academy</em>,\n49: 345–363.</li>\n<li>Webb, C. C. J. (1945), <em>Religious Experience</em>, London:\nOxford University Press.</li>\n<li>Wiggins, D. (1976), ‘Truth, Invention, and the Meaning of\nLife’, <em>Proceedings of the British Academy</em>, 62:\n331–378.</li>\n<li>Williamson, T. (2000), <em>Knowledge and its Limits</em>, Oxford:\nClarendon Press.</li>\n<li>Williamson, T. (2007), <em>The Philosophy of Philosophy</em>,\nOxford: Blackwell.</li>\n<li>Wisdom, J. (1934), <em>Problems of Mind and Matter</em>,\nCambridge: Cambridge University Press.</li>\n<li>Wolfsdorf, D. (2008), <em>Trials of Reason. Plato and the Crafting\nof Philosophy</em>, New York: Oxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Austin, John Langshaw",
            "knowledge: analysis of",
            "moral non-naturalism",
            "perception: the problem of",
            "Prichard, Harold Arthur",
            "properties",
            "tropes"
        ],
        "entry_link": [
            {
                "../austin-jl/": "Austin, John Langshaw"
            },
            {
                "../knowledge-analysis/": "knowledge: analysis of"
            },
            {
                "../moral-non-naturalism/": "moral non-naturalism"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../prichard/": "Prichard, Harold Arthur"
            },
            {
                "../properties/": "properties"
            },
            {
                "../tropes/": "tropes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=wilson\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/wilson/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=wilson&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/wilson/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=wilson": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/wilson/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=wilson&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/wilson/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}