{
    "url": "alexander-humboldt",
    "title": "Alexander von Humboldt",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Dalia Nassar\n<dalia.nassar@sydney.edu.au>",
        "author_links": [
            {
                "mailto:dalia%2enassar%40sydney%2eedu%2eau": "dalia.nassar@sydney.edu.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nDalia Nassar\n&lt;<a href=\"mailto:dalia%2enassar%40sydney%2eedu%2eau\"><em>dalia<abbr title=\" dot \">.</abbr>nassar<abbr title=\" at \">@</abbr>sydney<abbr title=\" dot \">.</abbr>edu<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jan 16, 2023"
    ],
    "preamble": "\n\nAlexander (Friedrich Wilhelm Heinrich Alexander) von Humboldt\n(1769–1859) was a scientific explorer and natural philosopher,\nwho achieved fame following his return from South America in 1804.\nAlready during his lifetime, biographies celebrating Humboldt began to\nappear (Rupke 2008), and upon his death in 1859, Humboldt was\ncommemorated across the world—from Alexandria to New York City,\nfrom Paris and Moscow to Adelaide and Melbourne (Wulf 2015). An ocean\ncurrent was named after him, as were numerous national parks, regions,\nand a penguin species. He has been described as the first ecologist\n(Bertaux 1985), the “father of American\nenvironmentalism” (Sachs 2004), the inspiration behind the\nNational Parks Movement in the United States and Great Britain, and a\nmajor influence on environmentalism in India (Grove 1990). \n\nThe younger brother of the linguist, Wilhelm von Humboldt, Alexander\nwas personally acquainted with some of the leading thinkers of his\ntime, including Goethe, Schiller, and Schelling. His distinctive\nsynthesizing approach to knowledge, which has been described as\n“Humboldtian Science” (Cannon 1978), and his view that\nartistic insights and practices support and facilitate empirical\nresearch, can be seen as a realization of what Friedrich Schlegel\ncalled the “romantic imperative” to unite science and art.\nHumboldt influenced a generation of researchers after him, including\nCharles Darwin (Richards 2002), as well as artists, writers,\nphilosophers, and activists (Bunkse 1981; Sachs 2004; Walls 2009).\nThough Humboldt’s fame waned in the twentieth century, in the\nlast two decades he has once again become a household name—first\nthrough Daniel Kehlmann’s comedic novel, Die Vermessung der\nWelt (2004), and more recently through Andrea Wulf’s\nThe Invention of Nature (2015).\n\nWhile Kehlmann situates Humboldt squarely within the Enlightenment\ntradition—the book’s title, “measuring the\nworld”, makes jest of Humboldt’s desire to measure\neverything with the most sophisticated instruments—the majority\nof scholars regard Humboldt’s legacy as lying between\nEnlightenment and romanticism (Nicholson 1990, Dettelbach 2001; Reill\n2002; Steigerwald 2000; Tang 2008; Ette 2009; Millán 2011).\nHumboldt’s emphasis on careful measurements and detailed\nobservations was always wedded to an aesthetic approach to\nnature—an approach that regards feeling as integral to\nunderstanding, and art as furnishing crucial tools for expanding\nempirical knowledge. For this reason, Humboldt criticized the\nfragmentation of knowledge, and argued that the history of science\ncannot be divorced from the history of art. Furthermore, and in\ncontrast to the increasingly strong foothold of the ideal of\nobjectivity in science, Humboldt highlighted both the situatedness and\nresponsibility of the knowing subject. \n\nHumboldt’s view that science and art should not be separated\ngoes hand in hand with his understanding of nature and culture as\ndeeply intertwined. To conceive of them as distinct entities, he\nargued, was not only false, but also dangerous. In his research in\nSouth America, Humboldt witnessed first-hand the devastating\nconsequences of colonial practices on both land and people, and\nconcluded that the destruction of nature will lead to the destruction\nof culture, and in particular Indigenous cultures. His critique of\nimperialism, and the ways in which colonial powers thoughtlessly\ndestroyed the homes of the Indigenous peoples, was not disconnected\nfrom his critique of slavery, the institution that he described as\n“the greatest of all evils that afflict humanity”\n(L’ile de Cuba 1: 309; DA 3: 156; PN 7: 263). \n",
    "toc": [
        {
            "#LifeWork": "1. Life and Works"
        },
        {
            "#EarlLifeEduc": "1.1 Early Life and Education"
        },
        {
            "#JenaConn": "1.2 Jena Connections"
        },
        {
            "#TravAmer": "1.3 Travel to the Americas"
        },
        {
            "#Pari": "1.4 Paris"
        },
        {
            "#Berl": "1.5 Berlin"
        },
        {
            "#SibeExpe": "1.6 Siberian Expedition"
        },
        {
            "#HumbWritScopGenrTran": "2. Humboldt’s Writings: Scope, Genre, and Translations"
        },
        {
            "#Meth": "3. Methodology"
        },
        {
            "#PhilNatu": "4. The Philosophy of Nature"
        },
        {
            "#Ecol": "4.1 Ecology"
        },
        {
            "#PhysPlanPhysNatu": "4.2 The Physiognomy of Plants and the Physiognomy of Nature"
        },
        {
            "#TreeFore": "4.3 The Trees and the Forest"
        },
        {
            "#PhilArt": "5. Philosophy of Art"
        },
        {
            "#HumbHistArtStudNatu": "5.1 Humboldt’s History of Art and the Study of Nature"
        },
        {
            "#TrutNatuEpisSignArt": "5.2 “Truth to Nature”: The Epistemic Significance of Art"
        },
        {
            "#Natu": "6. Naturgemälde "
        },
        {
            "#SociPoliThou": "7. Social and Political Thought"
        },
        {
            "#Cont": "8. Controversies"
        },
        {
            "#ConcHumbInfl": "9. Conclusion: Humboldt’s Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#HumbPrimLiteAbbr": "Humboldt Primary Literature and Abbreviations"
        },
        {
            "#OrigGerm": "Original German"
        },
        {
            "#OrigFren": "Original French"
        },
        {
            "#NewGermEdit": "New German Edition"
        },
        {
            "#EnglTran": "English Translations"
        },
        {
            "#OthePrimLiteAbbr": "Other Primary Literature and Abbreviations"
        },
        {
            "#SecoLite": "Secondary literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n1.1 Early Life and Education\n\nAlexander von Humboldt—the son of Alexander Georg Humboldt, a\nPrussian army officer, and the widow Marie-Elisabeth von Holwede\n(née Colomb)—was born in Berlin on 14 September 1769. His\nbrother, Wilhelm, was born two years earlier, and both children were\nraised at the Tegel Castle, in the east of Berlin. The later King\nFriedrich Wilhelm II was Humboldt’s godfather.\n\nAs was common for aristocratic families at the time, the Humboldt\nbrothers received their education from private tutors, including\nJoachim Heinrich Campe and Gottlob Johann Christian Kunth, and had\nlessons with Kant’s former student, Markus Herz. Herz introduced\nthem to physical geography, and to his wife’s salon. The two\nbrothers were regular attendees at Henriette Herz’s salon, and\nAlexander exchanged a significant set of letters with Herz\n(Hey’l 2007). In addition, the brothers were tutored by the\nbotanist, Karl Ludwig Willdenow (1765–1812), whose writing on\nBerlin’s flora influenced Humboldt.\n\nFollowing his mother’s wishes, Humboldt (alongside his brother)\nmatriculated at the University of Frankfurt an der Oder in 1787 to\nstudy law, with the goal of becoming a Prussian government servant. In\n1789, the two brothers moved to the University of Göttingen,\nwhere Humboldt studied under (among others) Blumenbach. In\nGöttingen, he met August Wilhelm Schlegel, Friedrich Heinrich\nJacobi, and Georg Forster, the explorer and radical thinker who had\ntravelled with Captain Cook on his second world trip (1772) and\nauthored (with his father) Reise um die Welt [Voyage\nAround the World] (1777). From March to July 1790, Humboldt\ntravelled with Forster across western Europe, and went on to dedicate\nhis first publication, Beobachtungen über einige Basalte am\nRhein [Observations of some Basalt at the Rhine] (1790),\nto Forster. Like Forster, Humboldt sought to detail both the\nenvironmental and the cultural landscapes, and describe their mutual\ninfluence.\n\nIn 1791, Humboldt began training at the Freiberg School of Mines\n(where Friedrich von Hardenberg [i.e., Novalis] also trained), under\nthe geologist Abraham Werner. Following successful completion, he\nassumed a post in the Prussian Department of Mines.\n1.2 Jena Connections\n\nHumboldt began to visit Jena and Weimar in the mind 1790s, after his\nbrother Wilhelm assumed a position at the University of Jena. Though\nhe had met Schiller some two years earlier (in 1792), it was at this\ntime that he met Goethe and Herder and over the years became\nacquainted with Friedrich Schlegel and Schelling as well. While\nHumboldt mentions Kant, Schelling, Herder, and Schiller in his\nwritings, it was Goethe to whom he felt the greatest affinity, both in\nterms of personality and interests. As he put it in a letter composed\nsoon after their first encounter in March 1794, “he is in fact\nmy favorite here” (JB 254, letter no. 388).\n\nDuring one of his visits, Humboldt undertook a number of experiments\nwith Goethe, which resulted in what has been touted as\nHumboldt’s “major work” in morphology, Versuche\nüber die gereizte Muskel- und Nervenfaser [Essays on the\nIrritability of Muscle and Nerve Fibers] (1797–8)\n(Meyer-Abich 1970: 121). Following Goethe, Humboldt employs the notion\nof “type” to explicate the structure of animal bodies and\nrelations among animal species.\n\nHumboldt went on to dedicate the German edition of\nGéographie des Plantes (1805), Ideen zu einer\nGeographie der Pflanzen (1807), to Goethe. The dedication appears\nin a frontispiece based on a sculpture by the Danish artist Bertel\nThorvaldsen. It depicts Orpheus holding a lyre while unveiling the\nstatue of the Egyptian goddess, Isis: the goddess of fertility,\nsymbolizing nature. Sitting at the feet of Isis is Goethe’s 1790\nessay Metamorphose der Pflanzen [The Metamorphosis of\nPlants]. The implication is clear: through his creative\nimagination Goethe, the poet-scientist, was able to reveal nature.\n\n\nAnother important figure in Humboldt’s development during this\nperiod is Friedrich Schiller. In 1794 Schiller invited Humboldt to\nsubmit to his journal, Die Horen. The result was\nHumboldt’s essay, “Die Lebenskraft oder der Rhodische\nGenius: eine Erzählung” (Life Force or the Rhodian\nGenius: A Tale; 1795). Though Humboldt went on to recant the idea of a\nlife force (by 1797, as he claims [DA 5: 325; VN: 265]), he\nrepublishes the essay some thirty years later in the second edition of\nAnsichten der Natur—an indication of his admiration for\nSchiller and his desire to celebrate their connection (DA 5: xi).\nIndeed, it appears that Humboldt had originally planned to dedicate\nIdeen zu einer Geographie der Pflanzen not to Goethe, but to\nSchiller, and only changed his mind after learning of Schiller’s\ndeath (Ette 2018: 225).\n\nHumboldt’s affinity to Schiller’s ideas is perhaps most\nevident in his response to Schiller invitation to write for Die\nHoren. Following a long list of tasks he aims to accomplish,\nHumboldt writes to Schiller, “You sense with me that there is\nsomething higher to look for, and to find”. This something\nhigher, Humboldt continues, is “aesthetic sense and\neducation”, which he connects to “a more expansive\nperspective than that of our contemporary archivers of nature\n[Registratoren der natur]” (JB: 346–347, letter\nno. 238).\n1.3 Travel to the Americas\n\nFollowing his mother’s death in 1797, Humboldt received a\nsizable inheritance that allowed him to leave his post at the mines\nand begin to think seriously about travelling beyond Europe. In that\nsame year, he moved to Paris, with the aim of securing travel to one\nof the French colonies. After a number of failed attempts in\nFrance—largely on account of political events—Humboldt,\nalongside his scientific companion, the French botanist Aimé\nBonpland (1773–1858), travelled to Spain. There they were\ngranted permission from the Spanish Crown to visit South America. On 5\nJune 1799, they set sail on the Pizarro, stopping in Tenerife\non the way, and arriving some six weeks later in Cumana, in\npresent-day Venezuela.\n\nHumboldt took with him a significant number of expensive\ninstruments—many of which were difficult to transport—for\nmeasuring altitude, latitude, air pressure, the blueness of the sky,\natmospheric composition, and magnetism. As Humboldt explains in a\nletter to the Spanish King from 22 March 1799, his desire to travel to\nSouth America has to do with his interest in “analyzing the\natmosphere”, and “recognizing the general relationships\nthat bind organized beings” (quoted in Puig-Samper 1999).\n\nOver the next five years, Humboldt and Bonpland explored the northern\nand western parts of South America, canoed down the Orinoco River,\ntrekked in the Andes, visited scientific luminaries in Quito, Bogota,\nand Havana, and travelled through Mexico and Cuba. During their time\nin Cuba (from December 1800 to March 1801), Humboldt observed the\nsituation of the slave laborers in the plantations. From there they\nsailed to Columbia, and then to Ecuador. On 23 June 1802, with the\nhelp of an Indigenous guide, the two companions, alongside their new\nfriend, Carlos Montufár (1780–1816), climbed Chimborazo,\nwhich at the time was considered to be the highest peak. Though they\ndid not reach its summit, they achieved a record that was not\nsurpassed until 1838.\n\nIn 1804, Humboldt and Bonpland travelled to the United States of\nAmerica, where Humboldt met with Thomas Jefferson in the spring of\nthat year. A key topic of discussion was the American economic\ndependence on slavery, which Humboldt challenged on moral grounds.\n1.4 Paris\n\nUpon returning to Europe, Humboldt spent a short time in Berlin, but\nquickly decided to move to Paris, which he made his home from the end\nof 1807 until 1827. It was in Paris that he compiled and published his\nworks on the Americas, which were mainly in French. But he also\npublished in German during this period, most notably the work he later\ndescribed as his “favorite”, Ansichten der Natur\n(BVE: 244). Ansichten der Natur, a collection of essays,\noriginally contained only three essays (1808) but in its final\niteration (1846) included eight essays. In each new edition, Humboldt\nalso added annotations, which in some instances became longer than the\noriginal text. The annotations sought to updated readers with new\nfindings, draw on Humboldt’s later expeditions, or, in the case\nof the “Rhodische Genius”, recant earlier\nviews.\n\nIn 1811, Humboldt published Essai politique sur le royaume de la\nNouvelle-Espagne [Political Essay on the Kingdom of New\nSpain](2 vols, 1811), in which he criticizes the Spanish colonial\nadministration for its mismanagement of the natural world, points to\nthe variety of injustices faced by the Indigenous peoples of Mexico\n(Nouvelle-Espagne 2: 128–9; KNS 1: 328), and argues\nthat the destruction of nature will inevitably result in the\ndestruction of culture. It was around the same time that he published\nVues des Cordillères, et monumens des peuples\nindigènes de l’Amérique (1810–1813),\nwhich includes sixty-nine expensive artistic plates that present\nartifacts of the Indigenous peoples of the Americas, and thereby\nchallenges the view that the Americas are a “realm of\nnature” with neither culture, nor agriculture. As in the\nEssai politique sur le royaume de la Nouvelle-Espagne, so\nalso in this text, Humboldt criticizes claims concerning the\ninferiority of Indigenous American cultures. \n\nBetween 1805 and 1834 Humboldt published Voyage aux regions\néquinoxiales du nouveau continent, fait en 1799, 1800, 1802,\n1803 et 1804 [Voyage to the Equinoctial Regions of the New\nContinent, from the years 1799–1804], which includes thirty\nfolio and quarto volumes. This work is a compilation of some of\nHumboldt’s major writings alongside his unfinished narrative of\nthe American journey, Relation historique du voyage aux regions\néquinoxiales du Nouveau Continent (3 volumes: 1814)\n[Personal Narrative of Travels to the Equinoctial Regions of the\nNew Continent during the Years 1799–1804].\n\nIn 1826, Humboldt published Essai politique sur l’ile de\nCuba [Political Essay on the Island of Cuba]. In Chapter\n6 Humboldt highlights Cuba’s growing dependency on slavery, and\nargues for the need to change the policy: \n\n\nTo remedy evil, to avoid public danger, to console the misfortunes of\na race who suffer, and who are feared more than is acknowledged, the\nwound must be probed. (L’ile de Cuba 1: 123; DA 3: 66;\nPN 7: 106) \n\n\nImportantly, Humboldt did not simply call for the end of slavery, but\nalso provided insights into how this can be brought about\n(L’ile de Cuba 1: 317–8, 333; DA 3: 157–8,\n167–9; see also Walls 2009–5).\n1.5 Berlin\n\nHumboldt moved to Berlin in 1827 at the behest of the Prussian King.\nIt was at the University of Berlin that Humboldt delivered his famous\nKosmos lectures (seventy-seven in total), between 3 November 1827, and\n27 April 1828. Although Humboldt planned to publish the lectures soon\nafter delivering them, it took another two decades before he began\npublishing his five-volume Kosmos: eine physische\nWetlbeschreibung [Cosmos: A Physical Description of the\nWorld] (1845–1862). The final volume was published\nposthumously.\n\nAs both the title and subtitle indicate, Humboldt’s goals are\ndistinctive. The dual significance of the term\ncosmos—which in ancient Greek means elegance and\nworld—implies that Humboldt’s goal is to understand nature\nand capture its beauty. As he puts it, the word\n“Kosmos” signifies both the “order of the\nworld, and adornment [Schmuck] of this universal\norder…” (Kosmos 1: 33; CO 1 69n). This goes hand\nin hand with Humboldt’s larger vision of the world as a dynamic\nand harmonious unity of interrelated parts.\n\nIn Berlin, Humboldt assumed the role of court advisor, and often\ntravelled on diplomatic missions. Despite his proximity to the King,\nHumboldt was supportive of the King’s critics, including Bettina\nBrentano von Arnim (1785–1859), who had been sentenced to prison\non account of her evasion of publication laws. Humboldt helped to\nabsolve her of the sentence. Furthermore, Humboldt used his connection\nto help American slaves. With Humboldt’s prodding, the Prussian\nKing enacted a law in 1857 that any slave would become free once on\nPrussian soil.\n1.6 Siberian Expedition\n\nIn 1829 Humboldt undertook a six-month journey through Siberia,\nsupported by Emperor Nicholas I. The trip, which began in St.\nPetersburg, took Humboldt through the Ural Mountains, the West Siberian\nPlains, and across to the Central Asian Altai Mountains. On the way\nback, the party passed through the Caspian Sea. In total, Humboldt and\nhis travel companions covered some 9,000 miles. As with his trip to\nSouth America, so here, Humboldt took with him the most advanced\ninstruments for measurement. He surveyed the geography, climate, and\ngeomagnetic features of the regions through which he travelled. Later\neditions of his writings—in particular Ansichten der\nNatur—reflect observations and measurements made during\nthis time, and include comparisons between these regions and the ones\nhe had observed in Europe and South America. \n2. Humboldt’s Writings: Scope, Genre, and Translations\n\nHumboldt lived a long life, during which he published amply. In his\nwritings, Humboldt brings together scientific, historical,\nphilosophical, and aesthetic perspectives, while also drawing on\npersonal experience. His aims were to convey nature and culture as\ninterconnected, articulate a vision of nature as an interrelated\nunity, and enable his readers to imaginatively experience the natural\nworld that he had witnessed. To realize these aims, Humboldt used a\nnumber of means—careful measurements, detailed observations, and\nartistic approaches—all of which are intended to support one\nanother. Humboldt composed essays which he described as\nNaturgemälde (nature-paintings), modelled on landscape\npaintings, and which can themselves be regarded as “scientific\nworks of art”, in that they at once deepen scientific knowledge\nand heighten aesthetic experience. As Humboldt sees it, the essays\nmove in a “dual direction”, joining “a literary with\na purely scientific goal” (DA 5: xi; VN: 27).\n\nWhether Humboldt successfully realized his aims remains, however, a\nmatter of dispute. Some argue that Humboldt did indeed achieve this\ngoal—and, in so doing, developed an entirely new genre, which\nOttmar Ette has described as “Humboldtian Writing” on\nanalogy with Humboldtian science (Ette 2001). Others, however, see in\nHumboldt’s writings more confusion than seamless cohesion\n(Böhme 2001). As an early reviewer put it: \n\n\nExamples and comparisons… by their number and variety, impair\nthe unity … of the descriptions, and present collateral objects\nwithout a sufficient subordination of the principle. (Edinburgh\nReview 1815: 111)\n\n\nHumboldt’s joining of genres is also evident in the\nmulti-mediality of other works—above all, in\nGéographie des plantes and the Tableau\nphysique included in the essay. The French tableau,\nwhich Humboldt translates as Naturgemäldein the German\nedition, refers ambiguously to both text and image. This\nambiguity, as Sylvie Romanowski writes, \n\n\nsuggests that the words and the picture are inseparable—the two\nwork together to form one work, and only combined into one work can\nthey convey Humboldt’s knowledge. (Romanowski 2009: 161)\n\n\nHumboldt’s works were translated into many languages, with\nEnglish translations often appearing in the same year as the original\nFrench (or German). Humboldt often played a role in seeking out\ncompetent translators, and at times may have aided with the\ntranslations. Many of his translators were women: Helen Maria Williams\ntranslated Relation historique soon after it was published,\nwhile Thomasina Ross translated it some fifty years later. Elizabeth\nSabine translated Ansichten der Natur in 1849, and with her\nhusband, Edward, she translated Kosmosbetween 1846 and 1858.\nElise C. Otté translated both Ansichten der Natur\n(1850) and Kosmos (1848–1858). The translations were\noften diverging, with the most explicit difference being between\nWilliams’ seven-volume translation of Relation\nhistorique (1814–1829) and Ross’s three-volume\nrendition (1852–3). As Alison Martin notes, the differences are\nnot only in size, but also in language, and in the way in which the\nscientist is portrayed (Martin 2018). Ross, for instance, eliminates\nsections in which Humboldt acknowledges a debt to his\npredecessors—thereby furnishing an image of Humboldt as a lone\ngenius-scientist. Humboldt’s advice was often sought by his\ntranslators—in particular the Sabines—who in some cases\nmade significant changes or additions to the original (Martin 2018:\n206, 221).\n\nHumboldt was deeply dissatisfied with the first English translation of\nKosmos, by Augustin Prichard. Pritchard had translated\nBeschreibungin the work’s subtitle as\n“history” rather than “description”. Humboldt\npractically begged Edward and Elizabeth Sabine to undertake a second\ntranslation, writing to Edward that \n\n\nI have striven to demonstrate that Weltbeschreibung is not\nWeltgeschichte, that the history of the revolutions which our\nplanet has undergone, as exemplified by the Milky Way, should not be\nconfused with the description of the earth and of the celestial\nspaces…. (quoted in Martin 2018: 203)\n\n\nA far more egregious translation of Humboldt’s works is Sidney\nThrasher’s 1856 The Island of Cuba, by Alexander\nHumboldt—a significantly censored version of\nHumboldt’s Essai Politique sur l’ile de\nCuba. Thrasher, an American who lived in Cuba for many years, was\nof the view—along with President Polk—that Cuba should be\npart of the United States. He was also pro-slavery. His edition of\nHumboldt’s work not only excluded the chapter on slavery, but\nalso included an essay by Thrasher, in which slavery is defended. Upon\nreading an advance copy of Thrasher’s translation,\nHumboldt’s was furious. In an open letter to a Berlin newspaper\npublished in July 1856, Humboldt complained that while the Spanish and\nBritish translations of his work did not censor him, the American\ntranslation did. He adds that the censored portions of the work are\nthe ones to which he attaches greatest significance.  This open letter\nwas quickly translated into English and published in the New York\nTimes, the New York Tribune and the New York\nHerald (Foner 1983). As Laura Dassow Walls observes, Humboldt\nwas aware that Americans would read his letter, and took the\nopportunity to summarize his main arguments in it (Walls 2009).\n3. Methodology\n\nIn Kosmos, Humboldt refers to Schelling’s dynamic\naccount of nature—of nature not as a set of finished and fixed\nproducts, but as productivity—as an inspiration for his own\nwork. “To the enthusiastic researcher”, Humboldt writes\nciting Schelling, nature appears as “the holy primordial power\n[Urkraft] of the world, which brings forth all things from\nitself…” (Kosmos 1: 25; CO 1: 55; see also\nKosmos 1: 38). This reiterates earlier expressions of\nenthusiasm toward Schelling’s Naturphilosophie (Werner\n2000; Pinsdorf 2020). In a letter from January 1805, Humboldt\ndescribes Schelling’s Naturphilosophie as having\nbrought about “a revolution” in the empirical\nsciences—a revolution which, Humboldt continues, has ushered in\n“one of the most beautiful periods in these crazy times”\n(Fuhrmans 1975: 180). A year later, in the introduction to Ideen\nzu einer Geographie der Pflanzen, Humboldt writes, \n\n\nI am not wholly unfamiliar with Schelling’s system, and far from\nthe view that the true nature-philosophical system can be destructive\nfor the advance of empirical science. (DA 1: 45)\n\n\nThese statements can be regarded as an indication of Humboldt’s\nopenness to certain forms of idealism (Pinsdorf 2020). But Humboldt\nwas also clear that his own methodology differed from that of the\nidealists—whether Schelling, Hegel, or Kant—in that he did\nnot seek to “construct” nature on the basis of an a priori\nprinciple. As he elaborates in the Introduction to Kosmos,\nhis is not a “rational science of nature”, which aims to\n“derive” nature from “a few rational\nprinciples”. And in a letter to his friend Varnhagen, Humboldt\ncomplains about speculative philosophies of nature, writing that it is\nlike “a chemistry, in which one cannot wet his hands”\n(BVE: 90).\n\nHumboldt, however, also distinguishes his methodology from what he\ncalls “a raw and incomplete empiricism”. While the\nidealist position remains one-sidedly abstract and empirically\ndeficient, the empiricist position, he maintains, fails to deliver any\ninsight, or discern necessity (Kosmos 1: 13; CO 1: 38). In\ncontrast to both, Humboldt describes his approach as a “thinking\nobservation [denkende Betrachtung]”, which involves\n\n\n\na meaningful ordering [sinnvolle Anordnung]of the appearances\nof nature … [that is] deeply penetrated with the belief in an\nancient internal necessity [eine alte innere Notwendigkeit]\n…. (Kosmos 1: 22; CO 1: 50)\n\n\nHumboldt’s methodology bears a clear affinity to the approach\nthat Schiller dubbed “rational empiricism” and which he\nidentified with Goethe’s methodology. In fact, in E. C.\nOtté’s English translation of Kosmos,\nHumboldt’s approach is described as a form of “rational\nempiricism” (CO 1, 39). Furthermore, scholars have noted,\nHumboldt’s notion of “thinking observation” echoes\nGoethe’s idea of “intuitive judgment” and his\n“gentle empiricism [zarte Empirie]” (Böhme\n2016; Millán 2011; Nassar 2022). Indeed, Humboldt himself\nacknowledged his deep debt to Goethe’s methodology, in a letter\nto Caroline von Wolzogen from May 1806. It was Goethe’s\n“views of nature [Ansichten der Natur]”, he\nrelates to Wolzogen, that transformed his own approach and most\ninfluenced his observations in South America. By working alongside\nGoethe, Humboldt continues, he was “granted new organs [mit\nneuen Organen ausgerüstet]” of perception, through\nwhich he was able to discern relations and connections between the\nmost varied living and non-living beings (AML: 180).\n\nLike Goethe, Humboldt’s form of empiricism aims to grasp the\nphenomenon and, as Goethe puts it, “remain” with it. This\nmeans resisting the move to abstraction, and locating\nnecessity—meaning, order—in the phenomenon itself. It also\nmeans, as Goethe explains, that the knower must become “flexible\nand plastic” like the natural phenomena (MA 12: 13).\n\nTo achieve these ends, Goethe developed the notion of\nmetamorphosis—which aims to describe the transforming forms of\nliving beings, and discern how these forms are meaningfully (rather\nthan contingently or randomly) related to one another. In\nKosmos Humboldt maintains that Goethe’s greatest\ncontribution to science amounts to the “solution” he\noffered to the “problem of metamorphosis”. This solution,\nhe continues, is nothing other than the notion of “an ideal form\nthat corresponds to certain fundamental types [auf gewisse\nGrundtypen entspricht]” (Kosmos 1: 22; CO 1:\n41).\n\nAs Humboldt explains in the remarks preceding his mention of Goethe,\nthe “problem of metamorphosis” has to do with the dual\ndifficulties of the proliferation of organic forms (the infinite\ndiversity of nature) and the relation between the currently existing\norganic forms and those long extinct. These two difficulties map onto\nthe ancient problem of the one and the many—of discerning unity,\nrelation, connection, in diversity. It is a problem that many had\ntried to resolve. But, according to Humboldt, it was Goethe and his\nnotion of metamorphosis that offered a solution.\n\nFor Goethe, the study of metamorphosis involves discerning how the\nparts that make up a living being (e.g., a plant) transform in\nrelation to one another and their larger context (the plant, and also\ntheir surrounding). This involves a focus on form—on\nthe leaf form, for instance—and seeing how this form\nreappears differently at various stages of the plant’s\ndevelopment (e.g., how the leaf form is reiterated in the petal, or\nhow the congregating tendency of the cotyledons reappears in the calyx\nand again in the corolla). This allows the observer to discern unity\n(continuity, relation) in and through the transforming forms.\n\n\nWhile for Goethe metamorphosis primarily (though not exclusively)\ndescribes the relations between the various parts of a living being\n(e.g., the parts of a plant), for Humboldt the concept was extended to\ndescribe the ways in which the same “fundamental forms\n[Urformen]” reappear across the earth (DA 1: 53; EGP:\n67; translation altered). Like Herder before him, Humboldt’s aim\nwas not simply to discern necessity in the structure of individual\nbeings, but also in the relations between beings—and\nbetween beings and their contexts.\n\nHumboldt introduces the idea of a “physiognomy of nature”\nto explicate his approach. Just as we discern a person’s\ncharacter through their gestures, body language and expressions, so\nthe physiognomist of nature discerns the character of a\nlandscape through the expressions and gestures of plant and\nanimal life. Thus, the physiognomist of plants focuses on the\n“form” of the plant—those aspect of a plant that\nmake the greatest impression on the viewer: whether it attains to\ngreat heights (like palms) or twists and turns (like lianas), whether\nits leaves are broad like those of the banana tree or narrow like\nconifer needles. The emphasis is on visibility and expressiveness,\nwith the goal of discerning reappearing forms across regions\nand in different contexts. By studying the Urformen of\nplants, and discerning how they reappear across regions, Humboldt\nelaborates, we begin to develop a physiognomy of nature—that is,\nan understanding of the environments, in which the plants grow. In\nthis way, we begin to grasp where and when plants appear, how they\ninfluence their contexts and how their context influences them. This,\nHumboldt contends, is the goal of the student of nature—and\nforms the foundations of the geography of plants and bio-geography more\ngenerally.\n\nThe emphasis on visibility, expressiveness, and remaining with the\nempirical phenomenon in order to discern meaning and necessity\ntherein, clearly underpins Humboldt’s philosophy of nature. But\nit also underpins his philosophy of culture, widely construed.\n4. The Philosophy of Nature\n4.1 Ecology\n\nAlthough it was Ernst Haeckel who coined the term “ecology\n[Oecologie]” some seven years after Humboldt’s\ndeath, it was Humboldt’s way of thinking and his understanding\nof the natural world that made Haeckel’s coinage of the term\npossible. In fact, some scholars (Pausas & Bond 2019) have argued\nthat Haeckel had Humboldt in mind when he wrote that \n\n by ecology, we understand the whole science of the relationships\nbetween organisms and their surrounding external world, which we could\ncount as their “conditions of existence” in a wider sense.\n(Haeckel 1866 (Volume 2), 286, translation by author) \n\n\nThus, while Haeckel gave us the term ecology, it was Humboldt\nwho elaborated the idea of nature as a “household (oikos)”\nin which living beings mutually influence and support one another\n(Kosmos 1: 33 n. 27; CO 1: 69n).\n\nHumboldt’s first concrete ecological observations have been\ntraced back to his research at Lake Valencia (Lake Tacarigua) in\npresent-day Venezuela. Humboldt and Bonpland arrived in Lake Valencia\nin March 1800. In contrast to their expectations, they encountered a\nregion suffering from drought. Through conversations with Indigenous\nlocals, Creole farmers and his own investigations, Humboldt came to a\nsurprising conclusion: the felling of trees, and the replacement of\nforests by farms, had fundamentally transformed the climate and soil.\nWhat was once a verdant region, with regular rain, had become a\ndesert. The trees, Humboldt realized, were crucial to maintaining the\nintegrity of the soil and bringing the rain. While a number of\nthinkers before Humboldt—including Buffon, Kant and\nHerder—had acknowledged the influence of the environment on\nliving beings, none had realized that the influence was mutual. Living\nbeings transform their environment just as they are transformed by it.\nThe trees determine the soil and the seasons, as much as they are\ndetermined by them. Accordingly, the felling of the trees\nfundamentally altered both. This is how Humboldt put it: \n\n\nWhen forests are destroyed … as they are everywhere in America\nby the European colonists, the springs … dry up, or become less\nabundant. The beds of the rivers, remaining dry during a part of the\nyear, become torrents whenever heavy rain falls on the heights. With\nthe disappearance of sward and moss from the sides of the mountains,\nthe waters falling in rain are no longer impeded in their course: and,\nduring heavy showers, instead of slowly augmenting the level of the\nrivers by progressive filtrations, they furrow the sides of the hills,\nbear down the loosened soil, and form those sudden inundations that\ndevastate the country. And so it results that the destruction of the\nforests, the want of permanent springs, and the existence of torrents\nare three phenomena closely connected to one another. (Voyage\n2: 71; PN 4: 143–4; translation altered)\n\n\nHumboldt’s statement, which had a profound impact on\nenvironmental policy across the world (Grove 1990; Sachs 2004), points\nto two fundamental (but at that point hardly recognized) facts: the\ninfluence of trees (forests) on the environment and the influence of\nhuman beings on the environment. The implication is that environments\nare not stable backdrops of animal and human activity, but dynamic\nentities, themselves the outcome of ongoing activity, transformation,\nand collaboration.\n4.2 The Physiognomy of Plants and the Physiognomy of Nature\n\nHumboldt first introduced the notion of a physiognomy of nature in a\nlecture delivered at the Prussian Academy of the Sciences in Berlin in\nJanuary 1805. Titled “Ideen zu einer Physiognomik der\nGewächse [Ideas for a Physiognomy of Plants]”, the\nlecture was later published in the first edition of Ansichten der\nNatur. Its aim is to introduce Humboldt’s audience to a new\nway of looking at the natural world: physiognomy. \n\nHumboldt is clear that the work of the physiognomist of nature\ncontrasts with that of the botanist, who generally focuses on small,\nalmost hidden parts of the plant—the sexual organs or, at times,\nthe fruit. This goes hand in hand with the fact that the physiognomist\naims to discern the “fundamental forms” of plants. These\nforms do not align with taxonomic categories.\n\nThough Humboldt offers different fundamental forms in his writings (at\ntimes adding, at times subtracting a form), he is clear that his list\nis incomplete, given that it is based on his knowledge and research,\nand that new plants will be discovered and perhaps also new forms.\nWhen he distinguishes a form, Humboldt describes both its individual\ncharacteristics—detailing, for instance, the shape of its\nleaves, its usual size (height and width), its overall\ngesture—and its growth patterns—where and when it grows,\nunder which conditions, next to which other plants, and so on.\n\nBy focusing on forms, Humboldt recognizes that certain plant\nforms—whether tall grasses, or conifers, myrtles, or\nmosses—reappear across the earth. This leads him to conclude\nthat there are fundamental forms which are “repeated” or\n“replaced”, even though they are “separated by\noceans or broad expanses of land” (DA 5: 266; VN: 219).\nHumboldt’s insight paved the way for Carl Troll’s later\nresearch on “convergent evolution” (Beck 1989:\n266–7; Troll 1959). It also allowed Humboldt to discern a deep\nconnection between plants and their contexts: certain forms only\nappear next to certain neighbors, while others only appear at certain\naltitudes, and so on. Humboldt was not, however, an environmental\ndeterminist. For, he emphasized, plant forms persist across\nthe earth, and although they are sensitive to their contexts, they are\nnot entirely determined by them. The form of the willow, for instance,\npersists despite the fact that a willow growing on a windy and cold\nmountainside will never achieve the shape and size of a willow growing\nnear a river (DA 5: 287; VN: 234). \n4.3 The Trees and the Forest\n\nTo elucidate the task of the physiognomist of nature, Humboldt looks\nto the landscape painter. Like the landscape painter, the\nphysiognomist is interested in the overall impression that a landscape\nmakes—in those aspects, which give the landscape its unique\ncharacter. Furthermore, in contrast to a botanist, who aims to\ncategorize, distinguish, and separate plants, the physiognomist, like\nthe landscape painter, binds them together. This means that the\nphysiognomist’s aims is not to focus on separating trees or\ndistinguishing species, but rather seeing trees in relation to one\nanother, seeing them as members of a forest, and seeing\nthe forest in them.\n\nTo give his audience a concrete sense of what he means, Humboldt\nconsiders the diverging ways that a painter and a botanist treat leafy\nhardwoods. While the botanist distinguishes different hardwoods (oak,\nbeech, walnut), the landscape painter allows them, as Humboldt puts\nit, “to run one into the other”, portraying them as\nmembers of a forest (DA 5: 184; VN: 162). This is because the painter\nis interested in capturing the overall impression that hardwoods make\non the viewer—an impression that is connected to the fact that\ndifferent hardwoods grow in relation to one another and together form\na distinctive forest.\n\nJust as a willow on the mountainside looks different to a willow by\nthe river, so also an oak (a hardwood) growing in a forest of\nhardwoods looks different from a solitary oak on a hill. The crown of\na solitary oak spreads out in all directions, eventually achieving a\ndome shape. By contrast, the forest oak develops a small crown, and\nits growth is patterned on the growth of the other trees in the\nforest. An oak in a hardwood forest is an expression not only of the\nindividual tree or the genus oak, but also of the forest itself. The\nforest is not “outside” the individual oak tree, but\nliterally inscribed in it its very form.\n\nThe same, Humboldt maintains, holds for the forest. The kind\nof forest it is—whether it is cool and humid, or temperate and\ndry, whether its soil is nutrient rich or poor, and how much rain it\nreceives—depends on its particular trees. The forest\nenvironment, in other words, is realized in and maintained through the\nactivities of its trees. The forest is an expression of its trees as\nmuch as the trees are an expression of the forest.\n\nBy working with form, expression, and gesture, the landscape painter\ncaptures this relationship, and thereby presents trees and forest,\norganism and environment, as interdependent realities—as beings\nthat emerge with and through one another. Thus, by invoking the\nlandscape painter, Humboldt’s goal was to introduce a new\napproach to the study of nature—one that regards nature as an\nongoing and dynamic collaboration between beings that are internally\ndependent on one another.\n\nIt was this ecological insight, and this way of observing nature, that\nunderpinned Humboldt’s research at Lake Valencia. For what he\nsaw there was that the climate cannot exist without the trees, and the\ntrees cannot exist without this climate. This means that the one does\nnot pre-exist the other, because both—tree and\nclimate—mutually influence and determine one another.\n5. Philosophy of Art\n\nHumboldt is hardly known as a philosopher or historian of art and\naesthetics. Yet, the second volume of Kosmosoffers a lengthy\nexploration of the relationship between the history of art and the\nhistory of science. As Humboldt explains in volume three of\nKosmos, while the first volume examines “the pure\nobjectiveness of external phenomena”, in the second his aim is\nto consider nature “as the reflection of the image impressed by\nthe senses upon the inner human being, that is, upon his ideas and\nfeelings” (Kosmos 3: 386; CO 3: 1; translation\naltered). The goal, in other words, is to see nature through\nhuman ideas and feelings about nature, which are most clearly\nand eloquently expressed in art.\n\nThough some scholars have expressed confusion about Humboldt’s\nsudden shift to art and feeling in this second volume (Dettelbach\n1997), in light of Humboldt’s use of the arts (e.g., landscape\npainting), it is clear that, for Humboldt, art does not only carry\naesthetic value but also cognitive value. Indeed, Humboldt took issue\nwith philosophers who—like Edmund Burke and Kant—argued\nthat aesthetic experience and intellectual interest occupy two\ndifferent (and unrelated) spheres in the human mind (Kosmos\n1: 18; CO 1: 40). As he saw it, aesthetic presentation has the\npotential to transform the very way we know nature. By furnishing a\nhistorical exposition of the relation between artistic expression and\nempirical investigation, and showing how the arts aided in the\nexpansion of knowledge, Humboldt’s goal is to furnish a\nhistorical justification of this view.\n5.1 Humboldt’s History of Art and the Study of Nature\n\nHumboldt begins volume two of Kosmosby drawing on\nSchiller’s distinction between “naïve” and\n“sentimental” poetry, as articulated in his 1795–6\nwork Über naive und sentimentalische Dichtung [On\nNaïve and Sentimental Poetry]. Although Humboldt agrees with\nSchiller’s historicization of art as a development from a more\nimmediate or naïve unity of humanity and nature to a more\nabstracted and self-reflexive (sentimental) human consciousness, he is\naware of its limits. It only holds for European art, and says nothing\nabout the human relation to the natural world outside of Europe\n(Kosmos 2: 191; CO 2: 21–22). Examining poetry from the\nHindu Vedas, for instance, Humboldt remarks on their vastly different\ninterest in nature, which contrasts not only to Greek and Roman\npoetry, but also to Hebrew poetry. While the Greeks expressed\nlittle—if any—interest in direct depictions of the natural\nworld, Humboldt notes that in certain Vedas, the “main\nsubject…is the veneration and praise of nature”\n(Kosmos 2: 206; CO 2: 50). Accordingly, a more sensitive\napproach to the history of art would also be comparative.\n\nHumboldt goes on to distinguish crucial moments in the history of art\nand situates them in their larger historic and geographic context. In\nso doing, he connects transformations in artistic depictions of nature\nto transformations in our knowledge about nature. Speaking of the\nemergence of landscape painting in the seventeenth century, for\ninstance, he writes that landscape painting is indebted to the new\ninstruments and tools of observation that became available in the\nseventeenth century, just as these instruments are themselves indebted\nto discoveries in perspective in art in earlier periods\n(Kosmos 2: 228; CO 2: 89). \n5.2 “Truth to Nature”: The Epistemic Significance of Art\n\nIn addition to a historical account, Humboldt articulates the idea of\n“truth to nature [Naturwahrheit]”\n(Kosmos 2: 207; CO 2: 51) to describe art’s potential\nto present the natural world in a “living”\n(Kosmos 2: 216–217; CO 2: 68) rather than\n“dead” way (DA 5: 142; VN: 159; see also Kosmos\n1: 55). This presentation, Humboldt emphasized, must be imbued with\naesthetic feeling—which includes the feeling of pleasure, but\nalso feelings of awe and wonder, fear and shock, loneliness, sadness,\nthe sense of constraint and bewilderment.\n\nAs Humboldt saw it, art had a twofold significance. On the one hand,\nby presenting the natural world in an aesthetic way, art has the\npotential to transport the reader or viewer to a place she may not\notherwise visit (DA 1: 61–62; EGP: 75). On the other hand, the\naesthetic presentation of nature can reveal the extent to which we are\nourselves part of nature, and can thus shift the way we think about\nand engage with nature. Accordingly, an aesthetic presentation of\nnature offers an alternative mode of knowledge—one that is not\nobjective, distanced, or pure, but embodied and embedded, and, in the\nwords of Caroline Schaumann “dirty” (Schaumann 2011).\n\nHumboldt introduces the idea of “truth to nature” in his\nexamination of the poem “The Messenger of Clouds\n[Megaduta]”. Composed by the fourth-century Sanskrit\npoet, Kalidasa, the poem, Humboldt writes, \n\n\ndescribes with admirable truth to nature [Naturwahrheit] the\njoy which, after long drought, the first appearance of a rising cloud\nis hailed as the harbinger of the approaching season of rain.\n(Kosmos 2: 207; CO 2: 51) \n\n\nWhat Humboldt describes as “truth to nature” is not only a\nportrait of a natural event but also the “joy” associated\nwith it. To this he adds a reference to the Sanskrit scholar, Theodor\nGoldstücker. According to Goldstücker, the poem depicts\n“the influence of external nature on human feelings”\n(Kosmos 2: 209; CO 2: 53).\n\nNot all writing, Humboldt emphasizes, achieves “truth to\nnature”. He criticizes Buffon’s works, for instance, on\naccount of their “style and rhetorical pomp”, which\ninspire a feeling of the “sublime” in the reader that has\nless to do with what is presented, and more to do with Buffon’s\nstyle. By contrast, the works of Rousseau, Bernardin de St. Pierre,\nand Chateaubriand express a “depth of feeling” through\n“individualizing true depictions [individualisirend\nwahr]” (Kosmos 2: 220; CO 2: 75–6).\n\nIn the works of these authors, the feelings depicted are inspired by\nthe landscape and thus speak of and about the\nlandscape. They are thus neither subjective and interior feelings\n(having only to do with the specific individual experiencing them) nor\narbitrary (random associations, for instance). Rather, they reveal\nsomething about the landscape. Furthermore, as feelings for the\nlandscape, they heighten one’s interest in the landscape. They\ndraw the observer’s attention to the landscape, leading her to\nbecome aware of aspects of the landscape she may have otherwise\nmissed. \n\nHumboldt’s notion of “truth to nature” involves a\nform of presentation in which thinking and feeling mutually support\none another—where thinking is imbued by and anchored in feeling,\nand feeling inspires thinking. Both feeling and thinking reflect and\nrefer to a natural landscape or a natural process and are connected to\ncareful observations. Yet, as feeling and thinking, they also belong\nto a human subject. Thus, “truth to nature” occupies a\nspace between inner and outer, subjective and objective. It is truth\nthat emerges in the embodied encounter with a living world—and,\nas Humboldt sees it, it is truth that has cognitive and moral value.\nIt can transform the way we think about nature and the way we relate\nto nature.\n\nWhile Humboldt described a number of works as achieving truth to\nnature, the question remains as to whether Humboldt himself was\nsuccessful in realizing truth to nature in his own works. In other\nwords, do Humboldt’s Naturgemälde achieve the\n“dual direction” he set out for them?\n6. Naturgemälde \n\nHumboldt coined the term Naturgemäldeto describe the\nworks of authors he regards as having achieved truth to nature, and\nhis own works, including the essays he published in Ansichten der\nNatur. He also used it to translate the French tableau,\nwhich he had originally applied to describe his drawing of Chimborazo.\nIn that context, and as noted above, tableau refers to two\ndifferent media—the plate and the text, each of which supports\nand illuminates the other. The plate offers a visual presentation of a\nparticular landscape and its inhabitants through a cross-sectional\nprofile of the Andes from the Atlantic to the Pacific at the latitude\nof Chimborazo. It also includes information about animals and plants\nat different altitudes. The text provides further information about\nthe landscape, draws analogies, and makes connections more explicit.\nThe aim, Humboldt writes, is \n\n\nto gather in one single tableau the sum of the physical phenomena\npresent in equinoctial regions, from the sea level of the South Sea to\nthe very highest peak of the Andes. \n\n\nBy integrating the two media, Humboldt’s aim is to enliven\n“both our imagination and our spirit at the same time”,\nand in this way “stimulate people to study” (DA 1: 71;\nEGP: 79–80).\n\nSimilarly, Humboldt’s essays employ different modes of\npresentation—the personal, the scientific, the literary and the\nphilosophical—with the goal of, as he puts it,\n“occupy[ing] the imagination and at the same time, through the\nincrease of knowledge, enrich[ing] life with ideas…” (DA\n5: xi; VN: 27). In both instances, the outcome is a new genre, which\ninterweaves science and art, and draws on aesthetic pleasure and\nexperience to incite reflection and careful observation, and vice\nversa.\n\nHumboldt opens Ansichten der Natur with the essay that he\nlater described as his most “daring” (DA 5: 128; VN: 117).\nTitled “Über die Steppen und Wüsten\n[Concerning the Steppes and Deserts]”, it begins by situating\nthe reader, imaginatively placing her in a particular spot: the foot\nof a high granite mountain—or as Humboldt describes it, a\ngranite spine. Immediately, the reader is invited not only to\npicture the mountain, but also to stand at its foot.\nFrom there her gaze turns southward, and rests on “a broad,\nimmeasurable plain”, the steppes or llanos. What the reader sees\nis not a God’s eye-view of the landscape, but the steppes as\nthey appear from a particular angle. This angle colors her impression.\nThe steppes seem to “climb and dwindle into the\nhorizon”. Having walked to the steppes from the lush valleys of\nCaracas, the reader is also struck by the sudden change in landscape\nfrom the “luxuriant fullness of organic life” to\n“the barren edge of a sparse and treeless desert…”\nand feels astonished (DA 5: 3; VN: 29).\n\nIn this opening paragraph, Humboldt makes no mention of himself. The\nreader presumes, however, that what is being described is the path\nthat Humboldt had trodden, and the view he had seen. However, by the\nend of the paragraph, any evidence of Humboldt, the explorer,\ndisappears and in his place stands the “astonished\nwanderer”. That Humboldt invokes the astonished\nwanderer—rather than himself—allows the reader to take on\nthe perspective of the wanderer, to imaginatively become the\nwanderer. In turn, by appealing to all of the reader’s senses,\nher feelings and imagination, as well as her body, Humboldt’s\nessay invites the reader to imaginatively walk from the verdant\nvalleys to the strikingly barren steppes; to watch the clouds\nthickening overhead, portending months of rain, and sense the\nconstriction in the atmosphere; to smell the oncoming deluge, and\nobserve with wonder the changed behavior of the animals. In reading\nthese descriptions, the reader does not only think about a\nparticular aspect of nature, nor does she simply see it from\na specific standpoint. She also imagines herself in\nthe landscape, experiencing it in an embodied and emotive way.\n\nInterwoven with vivid descriptions of embodied experience are careful\nobservations and detailed measurements of various natural phenomena,\nas well as comparative, historical and geographical analyses. The\ntechnical details and scientific explanations are not separated from\nthe embodied experiences, but emerge from them. This is particularly\nclear in Humboldt’s description of an internal sense of\n“constriction” in relation to a shift in atmospheric\npressure preceding an electric storm. In this passage, which Humboldt\nincludes in other works—and which is mentioned in reference\nworks on electrical\n storms[1]—he\n offers both a detailed account of the atmosphere prior to an\nelectrical storm, pointing to the various elements that contribute to\nthe physical transformations, and the experience of witnessing the\ntransformation in the atmosphere. Humboldt begins by taking note of\nthe low-hanging clouds, the narrowing of the horizon, the thickening\nof the air, and the smothering heat and dust. He proceeds to describe\nthe experience of witnessing these events, highlighting the ways in\nwhich the shifts in the atmosphere are connected to a shift in the\nwanderer’s mood. By the end of the analysis, Humboldt writes\nthat the wanderer experiences a sense of “constriction”\nwhich, while felt internally, has its source in the\natmosphere itself, and is thus an expression of (a human way of\npresenting) the atmospheric event. As Humboldt puts it, “It\nconstricts the steppe and the mood of the wanderer as well” (DA\n5: 14; VN: 37).\n\nHumboldt’s detailed description of the shift in the atmosphere\nallows the reader to imaginatively experience what it is like to stand\nin the midst of an oncoming electrical storm. Thus, by the time that\nthe reader is told about the feeling of constriction, she is\nalready gripped by this feeling. In this way, the reader recognizes\nthat there is nothing random about the internally felt sense of\nconstriction: it is inspired by the natural process and\nreveals something—via the medium of feeling—about it.\n\nFor this reason, critics have argued that Humboldt’s description\nof the electric storm realizes the goal he set out, achieving\n“truth to nature” (Nassar 2022). While this passage is not\nunique in Humboldt’s writings, it is the most explicit and\nconcise demonstration of Humboldt’s “dual\ndirection”: it conveys aesthetic feeling and enriches\nour understanding of a natural phenomenon—seamlessly moving from\none to the other.\n7. Social and Political Thought\n\nAs Laura Dassow Walls has noted, Humboldt’s political analysis\nand critique of imperialism and slavery, “however valuable, did\nnot lie at the core of his thinking on race”. This is because,\nWalls explicates, Humboldt “thought of himself above all as a\nnatural scientist…” (Walls 2009: 181). Thus, despite his\nardent critique of slavery and of the colonial project more generally,\nhe did not articulate this critique in a systematic way, nor did he\nwrite any one work that directly deals with political and social\nquestions. Instead, we find statements concerning slavery strewn\nthroughout his works, without a detailed analysis or critique of the\npractice, or of the European treatment of Indigenous peoples.\n\nWhile Humboldt may have not systematically addressed social and\npolitical questions, it is clear that these questions were deeply\nimportant to him. As he puts it in an 1858 letter to the German\nintellectual Julius Fröbel (1805–1893), the future of\nAmerican slavery is “nearer my heart” than the elevations\nof mountains. In the same letter, Humboldt describes his Essai\npolitique sur l’ile de Cuba as a “book against\nslavery”, deploring the fact that while the book is widely\naccessible in Madrid, it remains censored in the United States (Foner\n1984: 23–24).\n\nHumboldt’s understanding of the idea of a “race” and\nhis critique of slavery were well-established prior to his arrival in\nthe Americas (L’ile de Cuba 1: 307; DA 3: 155; PN 7:\n260). His view, which contrasts with Kant’s but coheres with\nHerder’s and Forster’s, was that there are no different\nraces, but, as he puts it in Kosmos, that all human beings\nare of “one species”, and all “are alike designed\nfor freedom” (Kosmos 1: 187; CO 1: 368). For this\nreason, Humboldt criticizes those philosophers who used philosophical\nmeans to support the idea that human beings belong to different and\nunequal races, writing that \n\n\nthe very cheerless and in recent times too often discussed doctrine of\nunequal human rights to freedom, and of slavery as an institution in\nconformity with nature, is unhappily found most systematically\ndeveloped in Aristotle’s Politica. (Kosmos 1:\n187 n. 442; CO 1: 368n)\n\n\nFrom this one might suspect that Humboldt’s views on slavery and\nhis critique of the colonial social system may be connected to his\nlarger project: to his understanding of nature as an integrated whole,\nto his view that nature and culture are interconnected, and to his\naesthetic approach to the study of both.\n\nThis is evident, for instance, in his caution towards ethnographic\nresearch that is often hasty in drawing conclusions, and tends to\nessentialize race without adequately recognizing differences\nwithin cultures—or the connections among\ncultures. Both differences within cultures and connections across\ncultures are evident, Humboldt writes, as soon as one pays close\nattention to languages, which reveals that \n\n\ntotally different linguistic families have been found to exist in one\nand the same race [and] the same idioms can be found among people of\nvery different descent. (Kosmos 1: 187; CO 1: 368) \n\n\nThe diversity within languages, in other words, points to a diversity\nwithin cultures—such that speaking of cultures as monolithic and\nisolated entities, and, on that basis, essentializing and\nhierarchizing cultures and races, is nothing other than a false\nabstraction based on overhasty (or simply bad) research.\n\nIn the same volume in which Humboldt describes slavery as the greatest\nevil humanity has wrought upon itself, he notes the significance not\nonly of our natural environment on our sensibility, but also of our\nsocial-political environment, and the ways in which certain political\ncontexts can inhibit moral concerns. “In climates where slavery\nexists”, he writes, “the mind is familiarized with\nsuffering, and that instinct of pity is stifled which characterizes\nand ennobles our nature” (PN 7: 464). Just as the natural\nenvironment affects sensibility, so also does our social and political\nenvironment. In a context where slavery is accepted and widely\npracticed, Humboldt claims, moral instincts are disturbed and\nsuppressed. This is because, as Humboldt repeatedly argues in relation\nto the natural environment, how one perceives and thinks\ncannot be separated from the world of which one is part. Sensibility\nand understanding are enmeshed in the world, even as they also\nconstruct it. A world in which slavery is practiced is a world that\ndisturbs our moral compass.\n\nFurthermore, by placing human cultures squarely within the natural\nworld, and showing how “nature” and “culture”\ncannot be conceptually separated from one another, Humboldt arrives at\nthe conclusion that the destruction of nature will lead to the\ndestruction of culture. Though he notes that these effects are most\nacutely felt by Indigenous cultures, he is clear that it is human\nculture at large that will suffer from the destruction of nature.\nWhether it is the mass deforestation connected to the Spanish desire\nto transform the South American landscape to resemble “in every\nway the soil of Castile, arid and devoid of vegetation”, or the\nthoughtless construction of new cities, dams and underground tunnels,\nthe destruction of nature has been catastrophic for all cultures\n(Nouvelle-Espagne 2: 128–9; KNS 1: 328). Or, as he puts\nit in Voyage,\n\n\nThe changes which the destruction of forests, the clearing of plants\nand the cultivation of indigo have produced within half a\ncentury—in the quantity of water flowing in, on the one hand,\nand on the other, the evaporation from the soil and the dryness of the\natmosphere—present causes sufficiently powerful to explain the\nsuccessive diminution of the lake of Valencia. I am not of the opinion\nof a scientific traveller [M. Depons] (who was in these countries\nafter I was there) “that to set the mind at rest, and for the\nhonour of science [l’honneur de la physique]”, a\nsubterranean issue must be admitted. By felling the trees which cover\nthe tops and the sides of mountains, men in every climate prepare at\nonce two calamities for future generations: want of fuel and scarcity\nof water. (Voyage 2: 71–2; PN 4: 142–3;\ntranslation altered)\n\n\nIn contrast to Depons, who claims that significant changes to the\nnatural landscape have nothing to do with the colonial project and\ninstead points to “subterranean issues”, Humboldt\ncontends—some two-hundred years before the coinage of the term\nAnthropocene—that the European transformation of the landscape\ndirectly resulted in the decrease of Lake Valencia, and, as he\nconcludes with some horror, will result in further future calamities.\n\n8. Controversies\n\nHumboldt’s cross-sectional profile of Chimborazo—the\nTableau physique—shows the zone occurrence of plant\nlife at different altitudes. It thus served as the foundation for\nHumboldt’s law of vegetational distribution, which claims that\nchanges in plants in relation to latitude match those by altitude.\nSome have argued that Humboldt learned this practice of depicting\nvegetation at different altitudes from the South American scientists\nhe met—in particular, the Colombian Francisco José de\nCaldas (1768–1816).\n\nCaldas joined Humboldt’s party in 1801 for several weeks, and it\nappears that this period was fruitful for Humboldt and Bonpland, as\nwell as for Caldas. From Humboldt and Bonpland, Caldas learned the\nformal elements of botany (Appel 1994). Caldas, in turn, taught\nHumboldt about the novel method he developed to measure air-pressure\nin relation to vegetation, and it is likely that he also shared with\nHumboldt maps he made in order to depict visually the distribution of\nvegetation.\n\nWhile Humboldt acknowledges Caldas’s innovative method of\nmeasuring air-pressure, he does not discuss Caldas’s maps. This,\nas some have contended, may have to do with Humboldt’s desire to\npresent his own maps—in particular, the Tableau\nphysique—as entirely original (Serje 2005). Accordingly,\nthe question has arisen concerning Humboldt’s originality. In\nother words, the question, in Jorge Cañizares-Esguerra’s\nwords, is: “how derivative was Humboldt?”\n(Cañizares-Esguerra 2006). \n\nOne answer to this question, given by Cañizares-Esguerra,\nconsiders the extent to which Caldas himself was original. For it\nappears that Caldas’ way of presenting the relation between\nvegetation, climate, and altitude, and depicting it on maps, was a\nwidespread practice in late eighteenth-century South America,\nparticularly in the Andes, which were regarded as a\n“microcosm” of the universe. The assumption was that\nstudying Andean vegetation in relation to latitude would yield\nknowledge about other similar environments (Cañizares-Esguerra\n2006). Thus, while the fact that Humboldt does not acknowledge his\ndebts is problematic, these debts may not be specifically to\nCaldas—but to South American researchers and mapmakers more\ngenerally, whose practices most likely provided inspiration for\nHumboldt’s own. \n\nAnother questionable aspect of Humboldt’s thinking came to the\nfore following the publication of Mary Louise Pratt’s\ninfluential study on imperialistic modes of knowing, seeing, and\npresenting. As Pratt sees it, Humboldt’s vision of South\nAmerica, as presented in Ansichten der Natur, problematically\nerases the peoples living in South America by focusing entirely on a\npresentation of nature. Accordingly, Pratt contends, Humboldt’s\nwriting directly or indirectly supported an imperialist agenda of\nterra nullius. Pratt writes: \n\n\nThree images in particular, all canonized by Humboldt’s\nViews, combined to form the standard metonymic presentation\nof the “new continent”: superabundant tropical\nforests…snow-capped mountains…and vast interior plains.\n\n\n\nTo this she adds: \n\n\nWhat is shared with scientific travel writing is the erasure of the\nhuman… The human inhabitants of the Llanos are absent.\n(Pratt 1992: 125) \n\n\nPratt’s analysis has, however, come under criticism, above all\nfor its failure to consider Humboldt’s other works. Most\nrelevant in this regard are the Essai politique sur le royaume de\nNouvelle-Espagne, which, as Nicolaas Rukpe notes, was the work\nthat brought Humboldt to prominence and made him a household name\n(Rupke 1999), and the Essai politique sur l’ile de\nCuba. The latter includes a chapter on slavery, which details the\nsituation of slaves on Cuban plantations, and decries their treatment,\nwhile the Essai politique sur le royaume de Nouvelle-Espagne\nincludes detailed descriptions of the cultures of the Indigenous\npeoples of South America, and seeks to reconstruct these cultures\nprior to contact. Humboldt’s presentation of pre-contact\nIndigenous Americans, as Lee Schweninger has shown, reveals them to be\ndeeply cultured, possessing a clear sense of their own history, with\nsophisticated writing systems and arts comparable to the best European\nworks (Schweninger 2016). Or, in Humboldt’s words, Indigenous\nAmerican pre-contact arts and writing systems “are strikingly\nsimilar to many monuments of the most civilized nations”\n(Nouvelle-Espagne 1: 82; KNS 1: 235).\n\nFurthermore, while Pratt is right to note that Ansichten der\nNatur does not offer a detailed examination of the human\ninhabitants, strewn throughout the text are remarks that—like\nthe one above—emphasize the creativity of Indigenous Americans\nand compare their cultures favorably to European culture (Schweninger\n2016).\n9. Conclusion: Humboldt’s Influence\n\nHumboldt is perhaps the most famous scientist of the nineteenth\ncentury, and has been described as the second most famous person in\nEurope after Napoleon. His Kosmos-lectures drew thousands of\nBerliners, as well as international visitors, who had come especially\nto listen to Humboldt. These lectures were decisive for the\npopularization of science, as was Kosmos, the first volume of\nwhich (over 1000 pages long) sold out in two months and was translated\ninto almost every major language. But already earlier in the century\nHumboldt had become a household name, thanks to his political works,\nespecially his essay on Cuba, and the Relation Historique\n(Personal Narrative ), which had been a favorite by the likes\nof Charles Darwin and Russell Alfred Wallace. \n\nDarwin, who described Humboldt as “the greatest traveler who\never lived”, boarded the Beagle in imitation of\nHumboldt’s travels to South America, and wrote in his diary that\nit was Humboldt’s Personal Narrative that he repeatedly\nread while on the Beagle (Sloan 2009). Wallace, in turn,\nwrote that among all the works he read, the one which most influenced\nhis future “were Humboldt’s ‘Personal Narrative of\nTravels in South America’” (Wallace 1905: vol. 1, 232).\nIndeed, Robert Richards has argued that the origins of the theory of\nevolution can be traced back to Humboldt and the German romantic\ntradition of which he was part (Richards 2002).\n\nHumboldt’s synthesizing approach to\nscience—“Humboldtian Science”—was, as Susan\nCannon put it, “the great new thing in professional science in\nthe first half of the 19th century” (Cannon 1978).\nHumboldtian scientists travelled across the world, founding botanical\ngardens or leading expeditions. In a speech commemorating Humboldt,\nFerdinand von Müller, founder of the Melbourne Botanical Gardens,\nexplains that for the Humboldtian scientist the most important goal is\nnot to perfect individual disciplines, but \n\n\nto explore the inner connections of the sciences, to discover their\nreciprocal relations, and thereby to extend the whole empire of\nknowledge simultaneously. (Müller 1859: 20)\n\n\nUS Congressman George Perkins Marsh read Humboldt’s writings\nbefore the US Congress in 1847, to provide evidence of the negative\nimpact of human activity on the environment, and three years later, in\n1850, the US Commissioner of Patents Thomas Ewbank cited\nHumboldt’s observations at Lake Valencia in support of the\ncampaign for national parks. Yellowstone National Park was established\nin 1872—the first in the world—though the campaign for\ndesignating it a national park had begun in the 1860s (Lindstrom 2011:\n836). In 1890 Yosemite became a national park, thanks to the efforts\nof John Muir, who was also influenced by Humboldt—however, as\nAaron Sachs has noted, by the later stage of his life, Muir had moved\naway from his Humbolditan origins, in that he came to prioritize\nnature over the human cultures that inhabited it (Sachs 2004: 28; see\nalso Wulf 2015).\n\nHumboldt’s descriptions of Latin and South American landscapes\nsupported the development of national identities independent of Spain.\nThe Mexican historian and politician Lucas Ignacio Alamán y\nEscalada invited Humboldt to work with him to bring about an\nindependent Mexico and regarded Humboldt’s Essai Politique\nsur le royaume de la Nouvelle-Espagne as furnishing a compelling\npresentation of a liberal Mexican constitution (Ortega y Medina 1960:\n25–26). Furthermore, and as Juan Ortega y Medina has argued,\nHumboldt’s work encouraged Mexican mapmakers and geographers to\ndraw maps of an independent Mexico (Ortega y Medina 1960). In turn, it\nappears to have been after a meeting with Humboldt at a Paris salon in\n1804 that Simón Bolívar was inspired to carry out an\nindependence movement in South America (Walls 2009: 17).\nBolívar led the Venezuelan revolution, and went on to lead\nrevolutions in Colombia, Ecuador, Peru, and Bolivia. \n\nMany artists, in particular visual artists, followed in\nHumboldt’s footsteps, travelling to South American to depict\nvisually and with exactness the landscape that Humboldt described in\nhis writings. These include the American Frederic Edwin Church, a\nmember of the Hudson River school of art (Harvey 2020), and the\nGerman, Johann Moritz Rugendas. Rugendas met Humboldt in Paris in 1825\nand in 1830 travelled to Mexico with Humboldt’s assistance\n(Bunkse 1981). This was followed by trips to Chile and Argentina.\nChurch, in turn, retraced Humboldt’s footsteps in Ecuador and\nMexico (Baron 2005). Like Humboldt, Church and Rugendas—among\nothers—sought to combine precision with artistic feeling and\nthereby realize Humboldt’s ideal in the visual arts.\n\nHumboldt’s works and ideas were, however, also\ncensored—and not only in Sidney Thrasher’s translation of\nthe Cuba essay. Humboldt tried to travel to India on a number of\noccasions but was repeatedly denied permission on account of his\ncritique of colonialism (Grove 1995: 375). Furthermore, Americans who\nrespected Humboldt for his scientific works either ignored or\nintentionally misrepresented his social and political views. In a\nmeeting held in Boston to honor Humboldt, the Harvard anthropologist,\nLouis Aggasiz—who had argued in his 1850 essay, “The\nDiversity of the Origin of the Human Race”, that Africans are an\ninferior race—provided an overview of Humboldt’s ideas,\nbut failed to mention Humboldt’s views on slavery. In a eulogy\nfollowing Humboldt’s death, the American diplomat George\nBancroft falsely claimed that Humboldt was in favor of American\nexpansion into Cuba (Foner 1983). Nonetheless—and in large part\nthanks to his open letter—Humboldt became known as an\nabolitionist in the United States, and became an important voice\nsupporting the cause (Harvey 2020).\n\nWhile Humboldt’s influence on philosophers has been less\nstudied, it is evident that he played a significant role in the\ndevelopment of American Transcendentalism. Emerson claims to have\nunderstood nature’s “unity in variety” by reading\nHumboldt, while Thoreau began classifying New England’s climate\nzones using Humboldt’s model (Walls 1995;\nWorster 1977). Furthermore,\nHumboldt’s use of analogy seems to have influenced Charles\nSanders Pierce’s semiotics (Walls 2009).\n\nIn Germany, Humboldt inspired Goethe, Schelling, and even Hegel.\nGoethe describes Humboldt as \n\n\na fountain with many ducts, under which one need only hold a vessel\nand from which refreshing and inexhaustible streams are ever flowing.\n(MA 19: 168; dated 13 December 1826) \n\n\nImportantly, Goethe felt encouraged by Humboldt’s interest in\nhis work. It was, for instance, following the Humboldt brothers’\nvisit to Weimar 1795, during which Goethe had discussed his notion of\nthe animal “type [Typus]”, that Goethe began to\nwrite down his ideas. As Goethe reflects on this moment years later,\nit was the Humboldt brothers’ prodding that led him to pursue\nthe matter further (MA 12, 181).\n\nSchelling, in turn, saw in Humboldt the exemplary natural\nscientist—not despite his empirical research, but because of it\n(Pinsdorf 2020). In fact, Schelling regarded Humboldt’s research\nas providing empirical foundations for Naturphilosophie, and\nsaw him as playing a crucial spiritual role in European culture. As he\nput it in a letter to Humboldt composed soon after the latter’s\nreturn to Europe, Humboldt’s work will “restore to the\nhuman spirit its ancient possession, nature” (quoted in\nDettelbach 2001: 18). Hegel, though dismayed by Humboldt’s\ncritical remarks on Naturphilosophie in his Kosmos lectures,\nsought to determine—along Humboldtian lines—the\n“geographic foundations of world history” (Bond 2014).\n\nFurthermore, Humboldt paved new paths for the study and estimation of\nIndigenous American culture and language—not only by helping his\nbrother acquire one of the largest collections of languages in Europe,\nincluding the Kawi language, but also by inspiring US Treasury\nSecretary, Albert Gallatin, to write his major work in American\nethnology, A Synopsis of the Indian Tribes within the United\nStates (1836) (Sachs 2004).\n\nAll in all, it is difficult to imagine the nineteenth century without\nHumboldt, and the scientific, artistic, and philosophical traditions\nthat he founded and supported.\n",
    "bibliography": {
        "categories": [
            "Humboldt Primary Literature and Abbreviations",
            "Other Primary Literature and Abbreviations",
            "Secondary literature"
        ],
        "cat_ref_text": {
            "Humboldt Primary Literature and Abbreviations": [
                "</h3>\n<h4 id=\"OrigGerm\">Original German</h4>\n<ul class=\"hanging\">",
                "[AN] 1808, <em>Ansichten der Natur mit wissenschaftlichen\nErläuterungen</em>, Tübingen: Cotta.",
                "[AML] <em>Aus meinem Leben</em>, edited by Kurt-R. Biermann,\nLeipzig: Urania Verlag, 1987.",
                "[BVE] <em>Briefe von Alexander von Humboldt an Varnhagen von\nEnse</em>, edited by Ludmilla Assing, Leipzig: Brockhaus, 1870.",
                "[JB] <em>Die Jugendbriefe Alexander von Humboldts.\n1787–1799</em>, edited by Ilse Jahn and Fritz Lange, Berlin:\nAkademie Verlag, 1973.",
                "[<em>Kosmos</em>] 1845–1862, <em>Kosmos: eine physische\nWetlbeschreibung</em>, 5 volumes, Stüttgart: Johann Georg\nCotta.",
                "[VMN] 1797–8, <em>Versuche über die gereizte Muskel-\nund Nervenfaser nebst Vermuthungen über den chemischen Process\ndes Lebens in der Thier- und Pflanzenwelt</em>, 2 volumes, Posen:\nDecker und Compagnie/Berlin: Heinrich August Rottman.",
                "1790, <em>Beobachtungen über einige Basalte am Rhein</em>\n[<em>Observations of some Basalt at the Rhine</em>], Braunschweig:\nSchulbuchhandlung.",
                "1795, “Die Lebenskraft oder der Rhodische Genius: eine\nErzählung” [Life Force or the Rhodian Genius: A Tale],\n<em>Die Horen. Eine Monatsschrift</em> (Tübingen), 1:\n90–96.",
                "1830, <em>Über die Haupt-Ursachen der\nTemperatur-Verschiedenheit auf dem Erdkörper</em>, Berlin:\nPreussische Akademie der Wissenschaften.\n</ul>\n<h4 id=\"OrigFren\">Original French</h4>\n<ul class=\"hanging\">",
                "[<em>Nouvelle-Espagne</em>] 1811, <em>Essai Politique sur le\nroyaume de la Nouvelle-Espagne</em>, 2 volumes, Paris: Schoell.",
                "[<em>L’ile de Cuba</em>] 1826, <em>Essai Politique sur\nl’ile de Cuba</em>, 2 volumes, Paris: Gide Fils.",
                "[<em>Relation historique</em>] 1814, <em>Relation historique du\nvoyage aux regions équinoxiales du Nouveau Continent</em>, 3\nvolumes. Part of <em>Voyage</em>.",
                "[<em>Voyage</em>] 1814–1831, <em>Voyage aux régions\néquinoxiales du Nouveau Continent par Al. de Humboldt et A.\nBonpland</em>, with Aimé Bonpland, 7 volumes, Paris: F.\nSchoell.",
                "1810–1813, <em>Vues des Cordillères, et monumens des\npeuples indigènes de l’Amérique</em>, Paris: F.\nSchoell. \n</ul>\n<h4 id=\"NewGermEdit\">New German Edition</h4>\n<ul class=\"hanging\">",
                "[DA] <em>Darmstädter Ausgabe</em>, edited with commentary by\nHanno Beck, 7 volumes, Darmstadt: Wissenschaftliche Buchgesellschaft,\n1989–.\n\n<ul class=\"hanging\">",
                "Bd. 1: <em>Schriften zur Geographie der Pflanzen</em>",
                "Bd. 2: <em>Die Forschungsreise in den Tropen Amerika</em>, 3\nbooks",
                "Bd. 3: <em>Cuba-Werk</em>,",
                "Bd. 4: <em>Mexico-Werk</em>",
                "Bd. 5: <em>Ansichten der natur</em>",
                "Bd. 6: <em>Schriften zur Physikalischen Geographie</em>",
                "Bd. 7: <em>Kosmos, Entwurf einer physischen Weltbeschreibung</em>,\n2 books\n</ul> \n</ul>\n<h4 id=\"EnglTran\">English Translations</h4>\n<ul class=\"hanging\">",
                "[CO 1] <em>Cosmos</em>, Volume 1, edited and translated by E. C.\nOtté, London: Bohn, 1849. Reprinted 1858–59, New York:\nHarper &amp; Brothers. Reprint of the latter with introduction by\nNicolaas A. Rupke, Baltimore, MD: Johns Hopkins University Press,\n1997].",
                "[CO 2] <em>Cosmos</em>, Volume 2, edited and translated by E. C.\nOtté, London: Bohn, 1850. New printing with introduction by\nMichael Dettelbach, Baltimore, MD: Johns Hopkins University Press,\n1997].",
                "[CO 3] <em>Cosmos</em>, Volume 3, edited and translated by E. C.\nOtté, London: Bohn, 1851.",
                "[KNS] <em>Essay on the Kingdom of New Spain, Volume 1: A Critical\nEdition</em>, edited with an Introduction by Vera M. Kutzinski and\nOttmar Ette, Chicago: University of Chicago Press, 2019.",
                "[VN] <em>Views of Nature</em>, edited by Stephen T. Jackson and\nLaura Dassow Walls; translated by Mark W. Person, Chicago: University\nof Chicago Press, 2014.",
                "[EGP] <em>Essay on the Geography of Plants</em>, with Aimé\nBonpland, edited with an introduction by Stephen T. Jackson,\ntranslated (from French) by Sylvie Romanowski, Chicago: University of\nChicago Press, 2009.",
                "[PN] <em>Personal Narrative of Travels to the Equionoctial Regions\nof America, During the Years 1799–1804</em>, with Aimé\nBonpland, edited and translated by Helen Maria Williams, 7 volumes,\nLondon: Longman, Hurst, Rees, Orme, and Brown, 1814–1829. \n</ul>\n<h3 id=\"OthePrimLiteAbbr\">"
            ],
            "Other Primary Literature and Abbreviations": [
                "</h3>\n<ul class=\"hanging\">",
                "[MA] Goethe, Johann Wolfgang von, <em>Sämtliche Werke nach\nEpochen seines Schaffens</em> (Münchner Ausgabe), edited by K.\nRichter et al., Munich: Carl Hanser, 1985–1998.",
                "[NA] Schiller, Friedrich, <em>Schillers Werke.\nNationalausgabe</em>, edited by Julius Petersen et al. 43 volumes,\nWeimar: Hermann Böhlaus Nachfolger, 1943–.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Appel, John Wilton, 1994, “Francisco José de Caldas:\nA Scientist at Work in Nueva Granada”, <em>Transactions of the\nAmerican Philosophical Society</em>, 84(5): 1–154.\ndoi:10.2307/1006650",
                "Baron, Frank, 2005, “From Alexander von Humboldt to Frederic\nEdwin Church: Voyages of Scientific Exploration and Artistic\nCreativity”, <em>HiN — Alexander von Humboldt Im Netz\nInternationale Zeitschrift Für Humboldt-Studien</em>, 6(10):\n7–20. doi:10.18443/56",
                "Beck, Hanno, 1959, <em>Alexander von Humboldt, Volume 1: Von der\nBildungsreise zur Forschungsreise, 1769–1804</em>, Wiesbaden:\nFranz Steiner.",
                "–––, 1989, “Kommentar”, on Alexander\nvon Humboldt, <em>Ideen zu einer Physiognomik der Gewächse</em>,\nin DA 1: 287–328.",
                "Bertaux, Pierre, 1985, “Vorwort”, in <em>Alexander von\nHumboldt. Leben und Werk</em>, ed. Hanno Beck, Frankfurt am Main:\nWeisbecker.",
                "Bies, Michael, 2012, <em>Im Grunde ein Bild: Die Darstellung der\nForschung bei Kant, Goethe und Alexander von Humboldt</em>,\nGöttingen: Wallstein.",
                "Böhme, Hartmut, 2001, “Ästhetische Wissenschaft:\nAporien der Forschung im Werk Alexander von Humboldts”, in Ette\net al. 2001: 17–32.",
                "–––, 2016, “Alexander von Humboldts\nEntwurf einer neuen Wissenschaft”, in his <em>Natur und Figur:\nGoethe im Kontext</em>, Munich: Fink, 495–512.",
                "Bond, Dean W, 2014, “Hegel’s Geographical\nThought”, <em>Environment and Planning D: Society and\nSpace</em>, 32(1): 179–198. doi:10.1068/d19112",
                "Brewster, David (ed.), 1832, <em>The Edinburgh Encyclopedia of\nPhilosophy</em>, Volume 15, Philadelphia: Joseph and Edward\nParker.",
                "Bunkse, Edmunds V., 1981, “Humboldt and an Aesthetic\nTradition in Geography”, <em>Geographical Review</em>, 71(2):\n127–146. doi:10.2307/214183",
                "Cañizares-Esguerra, Jorge, 2006, “How Derivative was\nHumboldt?” in his <em>Nature, Empire, and Nation: Explorations\nof the History of Science in the Iberian World</em>, Stanford, CA:\nStanford University Press, 96–111.",
                "Cannon, Susan Faye, 1978, <em>Science in Culture: The Early\nVictorian Period</em>, New York: Science History Publications.",
                "Dettelbach, Michael, 1997, “Introduction to the 1997\nEdition”, in Humboldt CO 2: xxvi–xxvii",
                "–––, 2001, “Alexander von Humboldt:\nBetween Enlightenment and Romanticism”, <em>Northeastern\nNaturalist</em>, 8(sp1): 9–20.\ndoi:10.1656/1092-6194(2001)8[9:AVHBEA]2.0.CO;2",
                "<em>Edinburgh Review</em>, 1815, “Review: <em>Personal\nNarrative of Travels to the Equinoctial Regions of the New Continent\nduring the Years 1799–1804</em>. By Alexander de Humboldt and\nAimé Bonpland. Written in French by Alexander de Humboldt, and\ntranslated into English by Helen Maria Williams. London, 1814”,\n25: 86–111 (Article IV).",
                "Ette, Ottmar, 2001, “Eine ‘Gemütsverfassung\nmoralische Unruhe’—<em>Humboldtian Writing:</em> Alexander\nvon Humboldt und das Schreiben in der Moderne”, in Ette et al.\n2001: 33–42.",
                "–––, 2009, <em>Alexander von Humboldt und die\nGlobalisierung. Das Mobile des Wissens</em>, Frankfurt am Main:\nInsel.",
                "––– (ed.), 2018, <em>Alexander von\nHumboldt-Handbuch. Leben-Werk-Wirkung</em>, Stuttgart: Metzler.",
                "Ette, Ottmar, Ute Hermanns, Bernd M. Scherer, and Christian Suckow\n(eds.), 2001, <em>Alexander von Humboldt: Aufbruch in die\nModerne</em>, (Beiträge zur Alexander-von-Humboldt-Forschung 21),\nBerlin: Akademie Verlag.",
                "Foner, Philip S., 1983, “Alexander Von Humboldt on Slavery\nin America”, <em>Science &amp; Society</em>, 47(3):\n330–342.",
                "Fuhrmans, Horst (ed.), 1975, <em>F. W. J. Schelling. Briefe und\nDokumente, Volume 3, 1803–1809</em>, Bonn: Bouvier.",
                "Graczyk, Annette, 2004, <em>Das literarische Tableau zwischen\nKunst und Wissenschaft</em>, Munich: Wilhelm Fink.",
                "Grove, Richard, 1990, “Colonial Conservation, Ecological\nHegemony and Popular Resistance: Towards a Global Synthesis”, in\n<em>Imperialism and the Natural Word</em>, edited by John MacKenzie,\nManchester: Manchester University Press, 15–50.",
                "–––, 1995, <em>Green Imperialism: Colonial\nExpansion, Tropical Island Edens and the Origins of Environmentalism,\n1600–1860</em>, Cambridge: Cambridge University Press.",
                "Haeckel, Ernst, 1866, <em>Generelle Morphologie der Organismen</em>\n(Volume 2), Berlin: Georg Reimer.",
                "Harvey, Eleanor Jones, 2020, <em>Alexander von Humboldt and the\nUnites States: Art, Nature and Culture</em>, Princeton, NJ: Princeton\nUniversity Press.",
                "Hey’l, Bettina, 2007, <em>Das Ganze der Natur und die\nDifferenzierung des Wissens. Alexander von Humboldt als\nSchriftsteller</em>, Berlin: de Gruyter.\ndoi:10.1515/9783110958157",
                "Kehlmann, Daniel, 2005, <em>Die Vermessung der Welt</em>, Reinbek\nbei Hamburg: Rowohlt.",
                "Lindstrom, Matthew (ed.), 2011, <em>Encyclopedia of the U.S.\nGovernment and the Environment: History, Policy, and Politics</em>,\nSanta Barbara, CA: ABC-CLIO.",
                "Martin, Alison, 2018, <em>Nature Translated: Alexander von\nHumboldt’s Works in Nineteenth-Century Britain</em>, Edinburgh:\nEdinburgh University Press.",
                "Meyer-Abich, Adolf, 1970, <em>Die Vollendung der Morphologie\nGoethes durch Alexander von Humboldt. Ein Beitrag zur\nNaturwissenschaft der Goethezeit</em>, Göttingen: Vandenhoeck und\nRuprecht.",
                "Millán, Elizabeth, 2011, “The Quest for the Seeds of\nEternal Growth: Goethe and Humboldt’s Presentation of\nNature”, <em>Goethe Yearbook</em>, 18: 97–114.\ndoi:10.1353/gyr.2011.0477",
                "Müller, Ferdinand von, 1859, “Zur Humboldt-Feier in\nMelbourne: Rede von Herrn Dr. Ferd. Muller”. <em>Melbourner\nDeutsche Zeitung</em>, 30 September: 20–21 and 21 October:\n42–43.",
                "Nassar, Dalia, 2022, <em>Romantic Empiricism: Nature, Art, and\nEcology from Herder to Humboldt</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780190095437.001.0001",
                "Nicholson, Malcom, 1990, “Alexander von Humboldt and the\nGeography of Vegetation”, in <em>Romanticism and the\nSciences</em>, Andres Cunningham and Nicholas Jardine (eds),\nCambridge/New York: Cambridge University Press, 169–185.",
                "Ortega y Medina, Juan A., 1960, <em>Humboldt desde\nMéxico</em>, Mexico City: Universidad Autónoma de\nMéxico.",
                "Pausas, Juli G. and William J. Bond, 2019, “Humboldt and the\nReinvention of Nature”, <em>Journal of Ecology</em>, 107(3):\n1031–1037. doi:10.1111/1365-2745.13109",
                "Pinsdorf, Christina, 2020, “Romantischer Empirismus im\nAnthropozän A. v. Humboldts und F. W. J. Schellings Ideen\nfür die Environmental Humanities”, <em>HiN — Alexander von\nHumboldt im Netz. Internationale Zeitschrift für\nHumboldt-Studien</em>, 21(40): 59–97. doi:10.18443/288",
                "Pratt, Mary Louise, 1992, <em>Imperial Eyes: Travel Writing and\nTransculturation</em>, New York: Routledge.",
                "Puig-Samper, Miguel Ángel, 1999, “Humboldt, un\nprusiano en la Corte del Rey Carlos IV”, <em>Revista de\nIndias</em>, 59(216): 329–355.\ndoi:10.3989/revindias.1999.i216.725",
                "Reill, Peter Hanns, 2002, <em>Vitalizing Nature in the\nEnlightenment</em>, Berkeley, CA: University of California Press.",
                "Richards, Robert, 2002, <em>The Romantic Conception of Life:\nScience and Philosophy in the Age of Goethe</em>, Chicago: University\nof Chicago Press.",
                "Romanowski, Sylvie, 2009, “Humboldt’s Pictorial\nScience: An Analysis of the <em>Tableau physique des Andes et pays\nvoisins</em>”, in EGP: 157–198.",
                "Rupke, Nicolaas, 1999, “A Geography of Enlightenment: The\nCritical Reception of Alexander von Humboldt’s Mexico\nWork”, in <em>Geography and Enlightenment</em>, David N.\nLivingstone and Charles W. J. Withers (eds), Chicago, IL, University\nof Chicago Press, 319–339..",
                "–––, 2008, <em>Alexander von Humboldt: A\nMetabiography</em>, Chicago, IL: University of Chicago Press.",
                "Sachs, Aaron, 2004, <em>The Humboldt Current: Nineteenth-Century\nExploration and the Roots of American Environmentalism</em>, New York:\nViking.",
                "Schweninger, Lee, 2016, “A Return to Nature ‘Order:\nIndigenous Peoples and the Politics of Alexander von Humboldt’\n<em>Political Essay on the Kingdom of New Spain</em>”,\n<em>ELOHI. Peuples indigènes et environnement</em>, 9:\n87–102. doi:10.4000/elohi.1061",
                "Schaumann, Caroline, 2011, “Humboldt’s Dirty\nNature”, <em>Colloquia Germanica</em>, 44(2):\n133–147.",
                "Serje, Margarita, 2005, “The National Imagination in New\nGranada”, in <em>Alexander von Humboldt: From the Americas to\nthe Cosmos</em>, Coordinated by R. Erickson, M. A. Font, and B.\nSchwarts, New York: Bildner.",
                "Sloan, Phillip R., 2009, “The Making of a Philosophical\nNaturalist”, in <em>The Cambridge Companion to Darwin</em>,\nJonathan Hodge and Gregory Radick (eds.), second edition, Cambridge:\nCambridge University Press, 21–43.\ndoi:10.1017/CCOL9780521884754.002",
                "Steigerwald, Joan, 2000, “The Cultural Enframing of Nature:\nEnvironmental Histories during the Early German Romantic\nPeriod”, <em>Environment and History</em>, 6(4): 451–496.\ndoi:10.3197/096734000129342370",
                "Tang, Chenxi, 2008, <em>The Geographic Imagination of Modernity:\nGeography, Literature and Philosophy in German Romanticism</em>,\nStanford, CA: Stanford University Press.",
                "Thrasher, Sidney (trans.), 1856, <em>The Island of Cuba, by\nAlexander Humboldt</em>, New York: Derby and Jackson.",
                "Troll, Carl, 1959, <em>Die tropischen Gebirge: Ihre\ndreidimensionale klimatische und pflanzengeographische Zonierung</em>,\n(Bonner Geographische Abhandlungen, 25), Bonn: Ferd. Immlers\nVerlag.",
                "Wallace, Alfred Russell, 1905, <em>My Life: a Record of Events and\nOpinions</em>, 2 volumes, London: Chapman and Hall.",
                "Walls, Laura Dassow, 1995, <em>Seeing New Worlds: Henry David\nThoreau and Nineteenth-century Natural Science</em>, Madison:\nUniversity of Wisconsin Press.",
                "Walls, Laura Dassow, 2009, <em>The Passage to Cosmos: Alexander\nvon Humboldt and the Shaping of America</em>, Chicago: University of\nChicago Press.",
                "Werner, Petra, 2000, “Übereinstimmung oder Gegensatz?\nZum widersprüchlichen Verhältnis zwischen A. v. Humboldt und\nF. W. J. Schellin”, in <em>Berliner Manuskripte zur\nAlexander-von-Humboldt-Forschung 15</em>, Berlin-Brandenburgische\nAkademie der Wissenschaften (ed.), Berlin: Alexander\nvon-Humboldt-Forschungsstelle.",
                "Worster, Donald, 1977, <em>Nature’ Economy: A History of\nEcological Ideas</em>, Cambridge: Cambridge University Press.",
                "Wulf, Andrea, 2015, <em>The Invention of Nature: Alexander von\nHumboldt’s New World</em>, New York: Knopf.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\nI have provided references to English translations of Humboldt’s\nworks following reference to the French and (or) German original. As\nnoted above, however, translators were often liberal with their\ntranslations. Thus, although I reference English translations, the\ntranslations of passages provided here are my largely my own.\nAccordingly, exact replicas of the English renditions provided here\nmay not be found in the translations referred to (this is especially\nthe case with Otté’s <em>Cosmos</em> [CO] which remains\nthe most easily accessible version of the work). Furthermore, in cases\nwhere a passage only appears in the German edition, I have only\nreferred to the German. </p>\n<h3 id=\"HumbPrimLiteAbbr\">Humboldt Primary Literature and Abbreviations</h3>\n<h4 id=\"OrigGerm\">Original German</h4>\n<ul class=\"hanging\">\n<li>[AN] 1808, <em>Ansichten der Natur mit wissenschaftlichen\nErläuterungen</em>, Tübingen: Cotta.</li>\n<li>[AML] <em>Aus meinem Leben</em>, edited by Kurt-R. Biermann,\nLeipzig: Urania Verlag, 1987.</li>\n<li>[BVE] <em>Briefe von Alexander von Humboldt an Varnhagen von\nEnse</em>, edited by Ludmilla Assing, Leipzig: Brockhaus, 1870.</li>\n<li>[JB] <em>Die Jugendbriefe Alexander von Humboldts.\n1787–1799</em>, edited by Ilse Jahn and Fritz Lange, Berlin:\nAkademie Verlag, 1973.</li>\n<li>[<em>Kosmos</em>] 1845–1862, <em>Kosmos: eine physische\nWetlbeschreibung</em>, 5 volumes, Stüttgart: Johann Georg\nCotta.</li>\n<li>[VMN] 1797–8, <em>Versuche über die gereizte Muskel-\nund Nervenfaser nebst Vermuthungen über den chemischen Process\ndes Lebens in der Thier- und Pflanzenwelt</em>, 2 volumes, Posen:\nDecker und Compagnie/Berlin: Heinrich August Rottman.</li>\n<li>1790, <em>Beobachtungen über einige Basalte am Rhein</em>\n[<em>Observations of some Basalt at the Rhine</em>], Braunschweig:\nSchulbuchhandlung.</li>\n<li>1795, “Die Lebenskraft oder der Rhodische Genius: eine\nErzählung” [Life Force or the Rhodian Genius: A Tale],\n<em>Die Horen. Eine Monatsschrift</em> (Tübingen), 1:\n90–96.</li>\n<li>1830, <em>Über die Haupt-Ursachen der\nTemperatur-Verschiedenheit auf dem Erdkörper</em>, Berlin:\nPreussische Akademie der Wissenschaften.</li>\n</ul>\n<h4 id=\"OrigFren\">Original French</h4>\n<ul class=\"hanging\">\n<li>[<em>Nouvelle-Espagne</em>] 1811, <em>Essai Politique sur le\nroyaume de la Nouvelle-Espagne</em>, 2 volumes, Paris: Schoell. </li>\n<li>[<em>L’ile de Cuba</em>] 1826, <em>Essai Politique sur\nl’ile de Cuba</em>, 2 volumes, Paris: Gide Fils.</li>\n<li>[<em>Relation historique</em>] 1814, <em>Relation historique du\nvoyage aux regions équinoxiales du Nouveau Continent</em>, 3\nvolumes. Part of <em>Voyage</em>. </li>\n<li>[<em>Voyage</em>] 1814–1831, <em>Voyage aux régions\néquinoxiales du Nouveau Continent par Al. de Humboldt et A.\nBonpland</em>, with Aimé Bonpland, 7 volumes, Paris: F.\nSchoell.</li>\n<li>1810–1813, <em>Vues des Cordillères, et monumens des\npeuples indigènes de l’Amérique</em>, Paris: F.\nSchoell. </li>\n</ul>\n<h4 id=\"NewGermEdit\">New German Edition</h4>\n<ul class=\"hanging\">\n<li>[DA] <em>Darmstädter Ausgabe</em>, edited with commentary by\nHanno Beck, 7 volumes, Darmstadt: Wissenschaftliche Buchgesellschaft,\n1989–.\n\n<ul class=\"hanging\">\n<li>Bd. 1: <em>Schriften zur Geographie der Pflanzen</em></li>\n<li>Bd. 2: <em>Die Forschungsreise in den Tropen Amerika</em>, 3\nbooks</li>\n<li>Bd. 3: <em>Cuba-Werk</em>, </li>\n<li>Bd. 4: <em>Mexico-Werk</em></li>\n<li>Bd. 5: <em>Ansichten der natur</em></li>\n<li>Bd. 6: <em>Schriften zur Physikalischen Geographie</em></li>\n<li>Bd. 7: <em>Kosmos, Entwurf einer physischen Weltbeschreibung</em>,\n2 books</li>\n</ul> </li>\n</ul>\n<h4 id=\"EnglTran\">English Translations</h4>\n<ul class=\"hanging\">\n<li>[CO 1] <em>Cosmos</em>, Volume 1, edited and translated by E. C.\nOtté, London: Bohn, 1849. Reprinted 1858–59, New York:\nHarper &amp; Brothers. Reprint of the latter with introduction by\nNicolaas A. Rupke, Baltimore, MD: Johns Hopkins University Press,\n1997].</li>\n<li>[CO 2] <em>Cosmos</em>, Volume 2, edited and translated by E. C.\nOtté, London: Bohn, 1850. New printing with introduction by\nMichael Dettelbach, Baltimore, MD: Johns Hopkins University Press,\n1997].</li>\n<li>[CO 3] <em>Cosmos</em>, Volume 3, edited and translated by E. C.\nOtté, London: Bohn, 1851.</li>\n<li>[KNS] <em>Essay on the Kingdom of New Spain, Volume 1: A Critical\nEdition</em>, edited with an Introduction by Vera M. Kutzinski and\nOttmar Ette, Chicago: University of Chicago Press, 2019.</li>\n<li>[VN] <em>Views of Nature</em>, edited by Stephen T. Jackson and\nLaura Dassow Walls; translated by Mark W. Person, Chicago: University\nof Chicago Press, 2014.</li>\n<li>[EGP] <em>Essay on the Geography of Plants</em>, with Aimé\nBonpland, edited with an introduction by Stephen T. Jackson,\ntranslated (from French) by Sylvie Romanowski, Chicago: University of\nChicago Press, 2009.</li>\n<li>[PN] <em>Personal Narrative of Travels to the Equionoctial Regions\nof America, During the Years 1799–1804</em>, with Aimé\nBonpland, edited and translated by Helen Maria Williams, 7 volumes,\nLondon: Longman, Hurst, Rees, Orme, and Brown, 1814–1829. </li>\n</ul>\n<h3 id=\"OthePrimLiteAbbr\">Other Primary Literature and Abbreviations</h3>\n<ul class=\"hanging\">\n<li>[MA] Goethe, Johann Wolfgang von, <em>Sämtliche Werke nach\nEpochen seines Schaffens</em> (Münchner Ausgabe), edited by K.\nRichter et al., Munich: Carl Hanser, 1985–1998.</li>\n<li>[NA] Schiller, Friedrich, <em>Schillers Werke.\nNationalausgabe</em>, edited by Julius Petersen et al. 43 volumes,\nWeimar: Hermann Böhlaus Nachfolger, 1943–.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary literature</h3>\n<ul class=\"hanging\">\n<li>Appel, John Wilton, 1994, “Francisco José de Caldas:\nA Scientist at Work in Nueva Granada”, <em>Transactions of the\nAmerican Philosophical Society</em>, 84(5): 1–154.\ndoi:10.2307/1006650</li>\n<li>Baron, Frank, 2005, “From Alexander von Humboldt to Frederic\nEdwin Church: Voyages of Scientific Exploration and Artistic\nCreativity”, <em>HiN — Alexander von Humboldt Im Netz\nInternationale Zeitschrift Für Humboldt-Studien</em>, 6(10):\n7–20. doi:10.18443/56</li>\n<li>Beck, Hanno, 1959, <em>Alexander von Humboldt, Volume 1: Von der\nBildungsreise zur Forschungsreise, 1769–1804</em>, Wiesbaden:\nFranz Steiner.</li>\n<li>–––, 1989, “Kommentar”, on Alexander\nvon Humboldt, <em>Ideen zu einer Physiognomik der Gewächse</em>,\nin DA 1: 287–328.</li>\n<li>Bertaux, Pierre, 1985, “Vorwort”, in <em>Alexander von\nHumboldt. Leben und Werk</em>, ed. Hanno Beck, Frankfurt am Main:\nWeisbecker.</li>\n<li>Bies, Michael, 2012, <em>Im Grunde ein Bild: Die Darstellung der\nForschung bei Kant, Goethe und Alexander von Humboldt</em>,\nGöttingen: Wallstein.</li>\n<li>Böhme, Hartmut, 2001, “Ästhetische Wissenschaft:\nAporien der Forschung im Werk Alexander von Humboldts”, in Ette\net al. 2001: 17–32.</li>\n<li>–––, 2016, “Alexander von Humboldts\nEntwurf einer neuen Wissenschaft”, in his <em>Natur und Figur:\nGoethe im Kontext</em>, Munich: Fink, 495–512.</li>\n<li>Bond, Dean W, 2014, “Hegel’s Geographical\nThought”, <em>Environment and Planning D: Society and\nSpace</em>, 32(1): 179–198. doi:10.1068/d19112</li>\n<li>Brewster, David (ed.), 1832, <em>The Edinburgh Encyclopedia of\nPhilosophy</em>, Volume 15, Philadelphia: Joseph and Edward\nParker.</li>\n<li>Bunkse, Edmunds V., 1981, “Humboldt and an Aesthetic\nTradition in Geography”, <em>Geographical Review</em>, 71(2):\n127–146. doi:10.2307/214183</li>\n<li>Cañizares-Esguerra, Jorge, 2006, “How Derivative was\nHumboldt?” in his <em>Nature, Empire, and Nation: Explorations\nof the History of Science in the Iberian World</em>, Stanford, CA:\nStanford University Press, 96–111. </li>\n<li>Cannon, Susan Faye, 1978, <em>Science in Culture: The Early\nVictorian Period</em>, New York: Science History Publications.</li>\n<li>Dettelbach, Michael, 1997, “Introduction to the 1997\nEdition”, in Humboldt CO 2: xxvi–xxvii</li>\n<li>–––, 2001, “Alexander von Humboldt:\nBetween Enlightenment and Romanticism”, <em>Northeastern\nNaturalist</em>, 8(sp1): 9–20.\ndoi:10.1656/1092-6194(2001)8[9:AVHBEA]2.0.CO;2</li>\n<li><em>Edinburgh Review</em>, 1815, “Review: <em>Personal\nNarrative of Travels to the Equinoctial Regions of the New Continent\nduring the Years 1799–1804</em>. By Alexander de Humboldt and\nAimé Bonpland. Written in French by Alexander de Humboldt, and\ntranslated into English by Helen Maria Williams. London, 1814”,\n25: 86–111 (Article IV).</li>\n<li>Ette, Ottmar, 2001, “Eine ‘Gemütsverfassung\nmoralische Unruhe’—<em>Humboldtian Writing:</em> Alexander\nvon Humboldt und das Schreiben in der Moderne”, in Ette et al.\n2001: 33–42. </li>\n<li>–––, 2009, <em>Alexander von Humboldt und die\nGlobalisierung. Das Mobile des Wissens</em>, Frankfurt am Main:\nInsel.</li>\n<li>––– (ed.), 2018, <em>Alexander von\nHumboldt-Handbuch. Leben-Werk-Wirkung</em>, Stuttgart: Metzler.</li>\n<li>Ette, Ottmar, Ute Hermanns, Bernd M. Scherer, and Christian Suckow\n(eds.), 2001, <em>Alexander von Humboldt: Aufbruch in die\nModerne</em>, (Beiträge zur Alexander-von-Humboldt-Forschung 21),\nBerlin: Akademie Verlag.</li>\n<li>Foner, Philip S., 1983, “Alexander Von Humboldt on Slavery\nin America”, <em>Science &amp; Society</em>, 47(3):\n330–342.</li>\n<li>Fuhrmans, Horst (ed.), 1975, <em>F. W. J. Schelling. Briefe und\nDokumente, Volume 3, 1803–1809</em>, Bonn: Bouvier.</li>\n<li>Graczyk, Annette, 2004, <em>Das literarische Tableau zwischen\nKunst und Wissenschaft</em>, Munich: Wilhelm Fink.</li>\n<li>Grove, Richard, 1990, “Colonial Conservation, Ecological\nHegemony and Popular Resistance: Towards a Global Synthesis”, in\n<em>Imperialism and the Natural Word</em>, edited by John MacKenzie,\nManchester: Manchester University Press, 15–50.</li>\n<li>–––, 1995, <em>Green Imperialism: Colonial\nExpansion, Tropical Island Edens and the Origins of Environmentalism,\n1600–1860</em>, Cambridge: Cambridge University Press.</li>\n<li>Haeckel, Ernst, 1866, <em>Generelle Morphologie der Organismen</em>\n(Volume 2), Berlin: Georg Reimer.</li>\n<li>Harvey, Eleanor Jones, 2020, <em>Alexander von Humboldt and the\nUnites States: Art, Nature and Culture</em>, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Hey’l, Bettina, 2007, <em>Das Ganze der Natur und die\nDifferenzierung des Wissens. Alexander von Humboldt als\nSchriftsteller</em>, Berlin: de Gruyter.\ndoi:10.1515/9783110958157</li>\n<li>Kehlmann, Daniel, 2005, <em>Die Vermessung der Welt</em>, Reinbek\nbei Hamburg: Rowohlt.</li>\n<li>Lindstrom, Matthew (ed.), 2011, <em>Encyclopedia of the U.S.\nGovernment and the Environment: History, Policy, and Politics</em>,\nSanta Barbara, CA: ABC-CLIO.</li>\n<li>Martin, Alison, 2018, <em>Nature Translated: Alexander von\nHumboldt’s Works in Nineteenth-Century Britain</em>, Edinburgh:\nEdinburgh University Press.</li>\n<li>Meyer-Abich, Adolf, 1970, <em>Die Vollendung der Morphologie\nGoethes durch Alexander von Humboldt. Ein Beitrag zur\nNaturwissenschaft der Goethezeit</em>, Göttingen: Vandenhoeck und\nRuprecht.</li>\n<li>Millán, Elizabeth, 2011, “The Quest for the Seeds of\nEternal Growth: Goethe and Humboldt’s Presentation of\nNature”, <em>Goethe Yearbook</em>, 18: 97–114.\ndoi:10.1353/gyr.2011.0477</li>\n<li>Müller, Ferdinand von, 1859, “Zur Humboldt-Feier in\nMelbourne: Rede von Herrn Dr. Ferd. Muller”. <em>Melbourner\nDeutsche Zeitung</em>, 30 September: 20–21 and 21 October:\n42–43.</li>\n<li>Nassar, Dalia, 2022, <em>Romantic Empiricism: Nature, Art, and\nEcology from Herder to Humboldt</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780190095437.001.0001</li>\n<li>Nicholson, Malcom, 1990, “Alexander von Humboldt and the\nGeography of Vegetation”, in <em>Romanticism and the\nSciences</em>, Andres Cunningham and Nicholas Jardine (eds),\nCambridge/New York: Cambridge University Press, 169–185.</li>\n<li>Ortega y Medina, Juan A., 1960, <em>Humboldt desde\nMéxico</em>, Mexico City: Universidad Autónoma de\nMéxico.</li>\n<li>Pausas, Juli G. and William J. Bond, 2019, “Humboldt and the\nReinvention of Nature”, <em>Journal of Ecology</em>, 107(3):\n1031–1037. doi:10.1111/1365-2745.13109</li>\n<li>Pinsdorf, Christina, 2020, “Romantischer Empirismus im\nAnthropozän A. v. Humboldts und F. W. J. Schellings Ideen\nfür die Environmental Humanities”, <em>HiN — Alexander von\nHumboldt im Netz. Internationale Zeitschrift für\nHumboldt-Studien</em>, 21(40): 59–97. doi:10.18443/288</li>\n<li>Pratt, Mary Louise, 1992, <em>Imperial Eyes: Travel Writing and\nTransculturation</em>, New York: Routledge.</li>\n<li>Puig-Samper, Miguel Ángel, 1999, “Humboldt, un\nprusiano en la Corte del Rey Carlos IV”, <em>Revista de\nIndias</em>, 59(216): 329–355.\ndoi:10.3989/revindias.1999.i216.725</li>\n<li>Reill, Peter Hanns, 2002, <em>Vitalizing Nature in the\nEnlightenment</em>, Berkeley, CA: University of California Press.</li>\n<li>Richards, Robert, 2002, <em>The Romantic Conception of Life:\nScience and Philosophy in the Age of Goethe</em>, Chicago: University\nof Chicago Press.</li>\n<li>Romanowski, Sylvie, 2009, “Humboldt’s Pictorial\nScience: An Analysis of the <em>Tableau physique des Andes et pays\nvoisins</em>”, in EGP: 157–198.</li>\n<li>Rupke, Nicolaas, 1999, “A Geography of Enlightenment: The\nCritical Reception of Alexander von Humboldt’s Mexico\nWork”, in <em>Geography and Enlightenment</em>, David N.\nLivingstone and Charles W. J. Withers (eds), Chicago, IL, University\nof Chicago Press, 319–339..</li>\n<li>–––, 2008, <em>Alexander von Humboldt: A\nMetabiography</em>, Chicago, IL: University of Chicago Press.</li>\n<li>Sachs, Aaron, 2004, <em>The Humboldt Current: Nineteenth-Century\nExploration and the Roots of American Environmentalism</em>, New York:\nViking.</li>\n<li>Schweninger, Lee, 2016, “A Return to Nature ‘Order:\nIndigenous Peoples and the Politics of Alexander von Humboldt’\n<em>Political Essay on the Kingdom of New Spain</em>”,\n<em>ELOHI. Peuples indigènes et environnement</em>, 9:\n87–102. doi:10.4000/elohi.1061</li>\n<li>Schaumann, Caroline, 2011, “Humboldt’s Dirty\nNature”, <em>Colloquia Germanica</em>, 44(2):\n133–147.</li>\n<li>Serje, Margarita, 2005, “The National Imagination in New\nGranada”, in <em>Alexander von Humboldt: From the Americas to\nthe Cosmos</em>, Coordinated by R. Erickson, M. A. Font, and B.\nSchwarts, New York: Bildner.</li>\n<li>Sloan, Phillip R., 2009, “The Making of a Philosophical\nNaturalist”, in <em>The Cambridge Companion to Darwin</em>,\nJonathan Hodge and Gregory Radick (eds.), second edition, Cambridge:\nCambridge University Press, 21–43.\ndoi:10.1017/CCOL9780521884754.002</li>\n<li>Steigerwald, Joan, 2000, “The Cultural Enframing of Nature:\nEnvironmental Histories during the Early German Romantic\nPeriod”, <em>Environment and History</em>, 6(4): 451–496.\ndoi:10.3197/096734000129342370</li>\n<li>Tang, Chenxi, 2008, <em>The Geographic Imagination of Modernity:\nGeography, Literature and Philosophy in German Romanticism</em>,\nStanford, CA: Stanford University Press.</li>\n<li>Thrasher, Sidney (trans.), 1856, <em>The Island of Cuba, by\nAlexander Humboldt</em>, New York: Derby and Jackson.</li>\n<li>Troll, Carl, 1959, <em>Die tropischen Gebirge: Ihre\ndreidimensionale klimatische und pflanzengeographische Zonierung</em>,\n(Bonner Geographische Abhandlungen, 25), Bonn: Ferd. Immlers\nVerlag.</li>\n<li>Wallace, Alfred Russell, 1905, <em>My Life: a Record of Events and\nOpinions</em>, 2 volumes, London: Chapman and Hall.</li>\n<li>Walls, Laura Dassow, 1995, <em>Seeing New Worlds: Henry David\nThoreau and Nineteenth-century Natural Science</em>, Madison:\nUniversity of Wisconsin Press.</li>\n<li>Walls, Laura Dassow, 2009, <em>The Passage to Cosmos: Alexander\nvon Humboldt and the Shaping of America</em>, Chicago: University of\nChicago Press.</li>\n<li>Werner, Petra, 2000, “Übereinstimmung oder Gegensatz?\nZum widersprüchlichen Verhältnis zwischen A. v. Humboldt und\nF. W. J. Schellin”, in <em>Berliner Manuskripte zur\nAlexander-von-Humboldt-Forschung 15</em>, Berlin-Brandenburgische\nAkademie der Wissenschaften (ed.), Berlin: Alexander\nvon-Humboldt-Forschungsstelle.</li>\n<li>Worster, Donald, 1977, <em>Nature’ Economy: A History of\nEcological Ideas</em>, Cambridge: Cambridge University Press.</li>\n<li>Wulf, Andrea, 2015, <em>The Invention of Nature: Alexander von\nHumboldt’s New World</em>, New York: Knopf.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "colonialism",
            "ecology",
            "Hegel, Georg Wilhelm Friedrich",
            "Humboldt, Wilhelm von",
            "idealism",
            "Schelling, Friedrich Wilhelm Joseph von",
            "Schiller, Friedrich",
            "Thoreau, Henry David",
            "transcendentalism"
        ],
        "entry_link": [
            {
                "../colonialism/": "colonialism"
            },
            {
                "../ecology/": "ecology"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../wilhelm-humboldt/": "Humboldt, Wilhelm von"
            },
            {
                "../idealism/": "idealism"
            },
            {
                "../schelling/": "Schelling, Friedrich Wilhelm Joseph von"
            },
            {
                "../schiller/": "Schiller, Friedrich"
            },
            {
                "../thoreau/": "Thoreau, Henry David"
            },
            {
                "../transcendentalism/": "transcendentalism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=alexander-humboldt\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/alexander-humboldt/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=alexander-humboldt&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/alexander-humboldt/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=alexander-humboldt": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/alexander-humboldt/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=alexander-humboldt&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/alexander-humboldt/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.hin-online.de/index.php/hin\" target=\"other\">HiN: Humboldt im Netz</a>,\n an online, open-access journal focusing on Humboldt."
        ],
        "listed_links": [
            {
                "https://www.hin-online.de/index.php/hin": "HiN: Humboldt im Netz"
            }
        ]
    }
}