{
    "url": "arabic-islamic-judaic",
    "title": "Influence of Arabic and Islamic Philosophy on Judaic Thought",
    "authorship": {
        "year": "Copyright © 2016",
        "author_text": "Mauro Zonta",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2016</a> by\n\n<br/>\nMauro Zonta\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Dec 10, 2007",
        "substantive revision Fri May 6, 2016"
    ],
    "preamble": "\n\nThe ‘influence’ of Arabic and Islamic philosophy on Judaic\nthought has never been studied as a whole: as a matter of fact, in\nrecent times it has not yet been the object of a comprehensive and\ndetailed analysis, apart from that made in a general article (Zonta\n1997a; see also a wide table and a short sketch of the\nArabic-to-Hebrew philosophical works: Zonta 2011b and 2011c). That\narticle concentrated on some particular subjects of this\n‘influence’, i.e. on the quotations, translations and\ninterpretations of the texts written by some Arab-Islamic philosophers\n(the Brethren of Purity, Avicenna, and Averroes), but did not include\nother authors, as al-Kindi, al-Ghazali or Ibn Bajja, nor some minor\nfigures which left some traces in Medieval Jewish philosophy. Of\ncourse, the question of the general ‘influence’ of\nArab-Islamic philosophers on prominent authors as Ibn Gabirol and\nMaimonides has been examined in specific articles and parts of books\n(see in particular Pessin 2007, Davidson 2011, Pessin 2013). However,\nthis has not happened in the case of other Jewish authors, although a\nnumber of more or less explicit or implicit references to Medieval\nArabic and Islamic philosophy have been found by modern scholars in\nmany Jewish authors, active in the period 900–1500: among the\nmost well-known of them, are Jacob al-Qirqisani, Isaac Israeli,\nSolomon Ibn Gabirol, Bahya Ibn Paquda, Abraham bar Hiyya, Joseph Ibn\nZaddik, Moses Ibn Ezra, Judah Halevi, Abraham Ibn Daud, Moses\nMaimonides, Samuel Ibn Tibbon, Shem Tov Ibn Falaquera, Levi ben\nGershom (Gersonides), Moses Narboni, and Hasdai Crescas. Usually, the\ndiscovery of these references has not driven modern scholars to arrive\nat even tentative conclusions about the real extent of this\n‘influence’ and the ways of its spreading among Jewish\nauthors, apart from some particular cases – for example, that of\nArabic sources of 14th-century Jewish logic in Provence\n(see Zonta 1997b).\n\nDue to the complexity of the theme and the substantial shortage of\nprevious works especially and systematically devoted to it, a\ncomprehensive, if not detailed, analysis of the\n‘influence’ of Arabic and Islamic philosophy on Judaic\nthought should observe some limits. The concept of\n“influence” in itself should be restricted to the cases\nwhere a direct and evident, if not necessarily explicit, employment of\nArabic and Islamic sources by Jewish authors has been or can be\nclearly ascertained. (For example, it is well-known that Maimonides\ndirectly knew and employed a number of Arabic philosophical sources;\nhowever, it should be admitted that, in many cases, Late Medieval\nJewish authors knew and employed these sources not directly, but\nthrough Maimonides.) This analysis should not limit itself to the\ncases when the text (or the texts) of an author were merely\n“translated” into Hebrew or literally quoted in their\nArabic originals. These cases have been studied in some books\n(Steinschneider 1893, Zonta 1996) and in a number of recent articles,\nbut such analysis should now spread to the cases where these texts\nwere commented on and in some cases directly and actually employed by\nJewish thinkers for building up their own philosophy. (In that regard,\nit should be noted that many Late Medieval Jewish philosophers seem to\nhave known Avicenna’s philosophy; in reality, some of them might\nhave known it not directly, but mostly through al-Ghazali – as\nmight have happened even in the case of Maimonides too.) A historical\nexamination of this influence should proceed not according to the main\nlines of the history of Jewish philosophy, but according to the\nchronological order of the various Arabic and Islamic philosophers who\nwere read by Jewish authors, either in their original texts, or in\nMedieval Hebrew translations, or in some cases even in Medieval Latin\nversions – and it should be clear that Jewish philosophers\napparently did not employ as sources Arabic authors active after 1200\ncirca. Such examination should consider that “Arabic\nphilosophy” and “Islamic philosophy” cannot be\ntotally identified, but their relationship appears at times to be just\nlike the intersection of two not completely identical concepts. (For\nexample, some major works of Islamic philosophy like Avicenna’s\nThe Book of Science [Danesh name], were written in\nPersian, while there were some Medieval Christian philosophers active\nin the Near East who wrote their works in Arabic, and who should\nbetter be put among the cases of “influence of\n[Christian-]Arabic philosophy on Judaic thought”.)\n",
    "toc": [
        {
            "#AlKin": "1. al-Kindi"
        },
        {
            "#AbuBakAlRaz": "2. Abu Bakr al-Razi"
        },
        {
            "#BrePurTheFol": "3. The Brethren of Purity (Ikhwan al-Safa) and Their Followers"
        },
        {
            "#AlFar": "4. al-Farabi"
        },
        {
            "#Avi": "5. Avicenna"
        },
        {
            "#AlGha": "6. al-Ghazali"
        },
        {
            "#IbnBaj": "7. Ibn Bajja"
        },
        {
            "#IbnTuf": "8. Ibn Tufayl"
        },
        {
            "#AveSomHisFol": "9. Averroes (Ibn Rushd) and Some of His Followers"
        },
        {
            "#FakAlDinAlRazSihAlDinAlSuh": "10. Fakhr al-din al-Razi and Sihab al-din al-Suhrawardi"
        },
        {
            "#ChrAraAut": "11. Christian Arabic Authors"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. al-Kindi\n\nThe traces of the ‘influence’ of al-Kindi (796-866) on\nMedieval Judaic thought appear to have been rather scanty, apart from\nsome quotations and passages surely taken from his works, and from one\nof them in particular; in any case they appeared to have been\nsubstantially limited to the first period of it, when the influence of\nNeoplatonism (or, better, of the first Arab-Islamic Aristotelianism,\nwhere a key role was played by Plotinus and Proclus as interpreters of\nmetaphysics) shows to have been stronger. As a matter of fact, rather\nthan speaking of al-Kindi’s influence on Judaic thought, one\nshould speak of a sort of Jewish “Kindism” through the\ninfluence of some of al-Kindi’s Arabic (in particular Christian\nArabic) followers (see below, 11).\n\nThe first traces of al-Kindi’s influence have been found in\nJacob al-Qirqisani, a Karaite Jewish author living in Mesopotamia\n(where al-Kindi himself was living one century before) in the first\nhalf of the 10th century. In al-Qirqisani’s main\npublished non-philosophical work, the Book On the Lights and\nOn the Guard Towers (Kitab al-anwar wa-l-maraqib), a\nstudy of the legal parts of the Pentateuch, Georges Vajda identified\nsome passages of al-Kindi’s Epistle On the Quiddity of the\nSleep and the Vision (Risala fi mahiyya al-nawm\nwa-l-ru’ya), who al-Qirqisani would have employed for his\ndescription of the concept of “sleep” (Vajda\n1941–1945, 115–122). Other traces of a philosophical work\nby al-Kindi, his Epistle On the Cause Producing Ebb and Flow\n(Risala fi l-‘illa al-fa‘ila li-l-madd\nwa-l-jazr), have been found by Bruno Chiesa in a passage about\nthe world’s creation in al-Qirqisani’s most important (and\nstill unpublished) theological-philosophical work, the Book of\nGardens (Kitab al-riyad), a study of the non-legal parts\nof the Pentateuch (Chiesa 1989, 95). Of course, a complete analysis of\nal-Qirqisani’s own “philosophy”, as found in the\nlatter work, is still needed, so that the real force of\nal-Kindi’s influence on his thought can be evaluated.\n\nAfter al-Qirqisani, other traces of al-Kindi’s philosophical\ninfluence can be found in later Jewish thinkers. The most important of\nthem appears in Isaac Israeli, living in Egypt and Tunisia between ca.\n850 and 950 (according to other scholars, between ca. 830 and 932).\nOne of Israeli’s main philosophical works, his Book of\nDefinitions (Kitab al-hudud), is substantially a Jewish\nadaptation of al-Kindi’s work on the same subject, the\nEpistle On Definitions and Descriptions of Things (Risala\nfi hudud al-ashya’ wa-rusumiha): Israeli adapted to the\nJewish readers and sometimes commented on a number of al-Kindi’s\nown definitions of philosophical and theological terms – as it\nhas been shown by Samuel Miklos Stern (Altmann and Stern 1958,\n3–78). Israeli’s employment of al-Kindi’s philosophy\nfor building his own philosophical work appears to be the most\nrelevant case of al-Kindi’s influence on Medieval Jewish\nphilosophy. A second case is that of Shem Tov Ibn Falaquera\n(1225–1295 circa), a Spanish Jewish philosopher who wrote a\nnumber of works by fitting quotations (translated into Hebrew and\noccasionally adapted by him to his own use) from many Arabic sources:\nin his Balm for Sorrow (Seri ha-yagon), he was\nstrongly influenced by, and inserted a number of quotations from,\nal-Kindi’s On the Way of Dispelling Worry (Fi hila\nli-daf‘ al-ahzan), as proved by a number of scholars\n(Ritter and Walzer 1938 [1943], Klugman-Barkan 1971). Apart from these\ntwo cases, only very scanty traces of the knowledge of\nal-Kindi’s work have been found in Medieval Jewish philosophy:\none can mention a reference to al-Kindi’s zoology found in Moses\nIbn Ezra’s still unpublished philosophic-philological work, the\nTreatise of the Garden On the Metaphorical and the True Meanings\n(of the Bible) (Maqala al-hadiqa fi ma‘na l-majaz\nwa-l-haqiqa), written in Christian Spain around 1130 (see ms. of\nJerusalem, Jewish National and University Library, 8° 570, pages\n206, line 8 – 207, line 7).\n2. Abu Bakr al-Razi\n\nThe bad reputation of Abu Bakr al-Razi (850-925 circa) as a\n“heterodox” and “unbelieving” philosopher of\nMedieval Islam seems to have generally influenced most of the Medieval\nJewish authors, as it appears in particular in Maimonides. However,\nthis did not prevent some of them from quoting and employing some of\nhis works as sources for building their own thought.\n\nAs for Maimonides’ harsh judgement of al-Razi as a philosopher,\nit was clearly based upon the knowledge of the general contents of his\nmetaphysics and theology as found in al-Razi’s Book of\nDivine Science (Kitab al-‘ilm al-ilahi), as found\nboth in his Guide of the Perplexed (Dalalat\nal-ha’irin) and in one of his letters to the\n“official” translator of his work, Samuel Ibn Tibbon. In\nthe latter, he affirms that al-Razi’s book on Divine\nScience is not useful, since al-Razi was only a physician (and\nnot a real philosopher) (Marx 1934–1935, 378; about the real\ninfluence of Maimonides’ letter, see also Harvey 1992). In part\nthree, chapter 12, of the Guide, in a more explicit way he\naffirms that al-Razi’s book is full of raving ideas and\nignorance: according to him, al-Razi thought that in human life there\nis surely more evil than good, so that even the divine goodness should\nbe seriously questioned (Moses Maimonides 1963, 2:441–442).\nNotwithstanding this, two other Jewish philosophers at least mentioned\nal-Razi and employed some of his ideas. Moses Ibn Ezra, in chapter 5\nof his Treatise of the Garden, quotes a passage of al-Razi\nabout motion and comments on it by affirming that al-Razi is contrary\nto Aristotle’s opinion and supports Plato’s instead (see\nms. of Jerusalem, Jewish National and University Library, 8° 570,\npage 51, lines 5–8). Abu l-Barakat Ibn Malka al-Baghdadi,\nworking in Baghdad around 1150, in his Book about the Point of\nView (Kitab al-mu‘tabar) — mostly based upon\nAvicenna’s philosophy and possibly written before the\nauthor’s conversion to Islam – followed in some cases\nal-Razi’s doctrines, in particular his idea of two different\nideas of time, “eternal time” and “created\none” (see Pines 1979, 151–153).\n3. The Brethren of Purity (Ikhwan al-Safa) and Their Followers\n\nThe scientific-philosophical Arabo-Islamic encyclopedia bearing the\ntitle Epistles of the Brethren of Purity and of the Lovers of\nFaith (Rasa’il ikhwan al-safa’ wa-khullan\nal-wafa’), which includes 52 treatises about\nmathematical sciences, logic, physical sciences, metaphysics,\nanthropology, and theology, had a relevant, although unexpected and\nnot usually studied influence on Medieval Judaic thought in the\n11th-15th centuries in Spain and Provence, and\nin Yemen as well.\n\nAccording to a tradition, the encyclopedia, possibly written in the\nNear East in the first half of the 9th century by a still\nunknown author (maybe Abu-l Qasim Maslama al-Majriti, d. 964: see\nCarusi 2000, 500–502), was known in Spain around 1050; as a\nmatter of fact, there might be some traces of its influence on Solomon\nIbn Gabirol (Avicebron, 1021–1058 or 1070), one of the most\nwell-known Medieval Jewish philosophers, living and working in\nAndalusia in the first half of the 11th century. According\nto Jacques Schlanger (see Schlanger 1968, 94–97), Ibn Gabirol\nmight have taken from the Brethren of Purity the correspondence\nbetween the hierarchy of the beings and the series of the first ten\nnumbers, as well as the reference to the doctrine of some sages about\nthe necessity to “cultivate” our souls through the study\nof celestial things. According to Georges Vajda (see Vajda 1947,\n24–33), more relevant traces might be found in chapter two of\nthe Introduction to the Duties of the Hearth (Hidaya ila\nfara’id al-qulub), written by the Spanish Jewish author\nBahya Ibn Paquda in the period 1050–1080, where there might be\nsome agreements with the Brethren’s cosmological doctrines, as\nwell as a very similar style in defending them. As a matter of fact,\nboth these cases do not prove a direct use of the Brethren’s\nwork by these two Jewish philosophers. The first sure traces of a\ndirect influence of the doctrines of the Brethren of Purity are found\nin two works written in two different Spanish areas in Judaeo-Arabic\n(the language of Jews living in Arabic countries) around 1130, and\npossibly influencing each other: the Book of Microcosm\n(Kitab al-‘alam al-sagir) by Joseph Ibn Zaddiq (d.\n1149), and the Treatise of the Garden by Moses Ibn Ezra. The\noriginal text of the work by Joseph Ibn Zaddiq, a rabbinical judge\nliving in Cordoba, is lost, but an anonymous Medieval Hebrew\ntranslation is still preserved in some manuscripts, and has been\npublished twice. It includes a number of evident but not literal\nreferences to the doctrines of the Brethren of Purity (see Vajda\n1949), and its relationship to them was implicitly admitted by the\nauthor himself at the very beginning of his work, as follows:\n“It seems to me that the way for arriving to this great and\nterrible knowledge (i.e. that of theological truths) consists in\nunderstanding the books written by the pure philosophers and the\ndivine sages” (Horovitz 1903, 3). Moreover, in his letter to\nSamuel Ibn Tibbon Maimonides explicitely affirmed: “I have not\nread Joseph Ibn Zaddiq’s Microcosm, but I know the\nauthor, his value and the value of his book: surely he follows the\nideas of the Brethren of Purity” (Marx 1934–1935, 379)\n– an affirmation which, according to Sarah Stroumsa, should be\ninterpreted as a substantial critique to Ibn Zaddiq’s\nphilosophical views (Stroumsa 1990). As for Moses Ibn Ezra, his\nTreatise of the Garden is clearly full of references to\npassages and doctrines indirectly inspired by, and in some cases\nliterally taken from the Brethren of Purity. As recently shown by Paul\nFenton in his book about the contents of Ibn Ezra’s work (Fenton\n1997; see also Fenton 1976, 297), the Treatise of the Garden\nincludes at least thirty-six passages of the Epistles of the\nBrethren of Purity, as well as a number of\ncases where their influence appears to be rather evident. For example,\nthe Brethren of Purity clearly influenced Ibn Ezra’s doctrines\nabout the creation of the world from the First Intellect and the\nprocession of the beings from God to matter, about nature as a power\nof the Universal Soul, as well as about man as a microcosm. In the\nsame period, even Abraham Ibn Ezra, the well-known Spanish Jewish\nauthor and scientist active in Italy, France and England in the period\n1140–1160, knew and employed the Brethren of Purity (see Jospe\n1994, 46–48).\n\nPossibly as a consequence of the diffusion of the above works, the\ninfluence of the Brethren of Purity seems to have spread among a\nnumber of Jewish philosophers working in Spain during the\n13th century. In some cases, this influence passed through\nother minor Arab-Islamic authors, whose work was well-known among\nSpanish Jewish readers. The Spanish Islamic philosopher Ibn al-Sid\nal-Batalyawsi (from Badajoz, d. 1127) wrote a sort of compendium of\nthe Brethren’s doctrines, the Book of the Gardens\n(Kitab al-hada’iq), which was widespread among Jewish\nauthors (Kaufmann 1880, 32–63) either in its original Arabic\ntext, or in its three Medieval Hebrew translations (written between\n1200 and 1370: see Steinschneider 1893, 286–288; Richler 1977),\noften under the title Book of Intellectual Circles (Sefer\nha-‘agullot ha-re‘yoniyyot); it was one of the direct\nsources of a Spanish philosopher and kabbalist, Isaac Ibn Latif, who\nspoke about the Brethren’s doctrine of the five degrees of soul\n(vegetal, animal, human, sapiential, prophetical) in his Hebrew book\nThe Gate of Heavens (Sha‘ar ha-shamayim),\nwritten in the period 1230–1250 (see Heller-Wilensky 1967, 199).\nAnother anonymous work, The Balance of\nSpeculations (Me’ozney ha-‘iyyunim),\nwritten in Hebrew (or in a Judaeo-Arabic lost original version) in\n13th-century Spain, is full of passages about numerology,\ncosmology, theology and natural sciences: some of them might have been\ninspired by al-Batalyawsi’s compendium, but some others were\nevidently taken from the Epistle of the Brethren of Purity,\nin particular those concerning the essence of faith, mineralogy and\nbotany (Abrahamov 1995). Finally, it should be noted that the Brethren\nof Purity were employed as a direct philosophical source by Shem Tov\nIbn Falaquera in a number of occasions. In his Neoplatonic\nphilosophical anthology, The Book of\nDegrees (Sefer ha-ma‘alot), a Hebrew quotation\nascribed to a “sage” (did Falaquera know that the work was\nmade by al-Majriti?) is in reality a literal passage of the\nEpistle of the Brethren of Purity dealing with the\nrelationship between the Universal Soul and the particular souls.\nFalaquera’s The Book of the\nSeeker (Sefer ha-Mevaqqesh), a sort of short popular\nencyclopedia written in 1263, is full of quotations from most of the\nBrethren’s treatises: these quotations deal with several themes,\nlike the difference between science and faith, some mathematical\nquestions, the principles of astronomy and music, the meaning of the\nterm “nature”, the doctrine of anima mundi, the\nclimates, as well as some doctrines about logic, meteorology, music\n(about this point, see Shiloah 1968), astrology and natural sciences,\nand even some moral tales. Also the Brethren’s scientific\ndoctrines exerted a considerable influence over\n13th-century Jewish authors. In books three and four of his\nbulky scientific-philosophical encyclopedia, The\nOpinions of the Philosophers\n(De‘ot ha-filosofim), written around 1270 and still\nunpublished, Falaquera quotes a number of passages of the Brethren\nconcerning mineralogy and botany, where a sort of mixture of\nAristotelian doctrines and alchemy can be found. Falaquera’s\nmineralogical doctrines should have directly influenced the treatment\nof mineralogy in other Hebrew texts, written around 1300, in\nparticular in Gershom ben Solomon of Arles’ The Gate of\nHeavens and in an alchemical treatise falsely ascribed to an\nArabic author. Finally, the zoology and the mathematics of the\nBrethren of Purity were employed by Qalonymos ben Qalonymos for\nwriting down his own Hebrew books on morals (Epistle On\nAnimals, Iggeret ba‘aley hayyim) and on\nmathematics (Book of Kings, Sefer ha-melakim: see\nLévy 1996, 69).\n\nThe supposed connection between the Epistle of the Brethren of\nPurity and the Ismailism should have suggested the adoption of\nthis work as one of the main sources of the so-called “Jewish\nIsmailism” as found in Late Medieval Yemenite Judaism. This\n“Jewish Ismailism” consisted in adapting to Judaism some\nIsmaili doctrines about cosmology, prophecy, and hermeneutics (Kiener\n1984). There are a number of cases showing that the Brethren of Purity\ninfluenced some Yemenite Jewish philosophers and authors in the period\n1150–1550 (Langermann 1996). For example, chapter two of the\nJudaeo-Arabic theologic-philosophical work by Natanael Ibn al-Fayyumi,\nthe Garden of Intellects (Bustan al-‘uqul),\nwritten in Yemen in 1165, includes a correspondence between numbers\n1–10 and ten scientific and philosophical concepts (soul’s\nfaculties, senses, directions, bodily substances and parts, etc.) most\nof which are identical to those listed by the Brethren of Purity. Some\ntraces of the Brethren’s doctrine of the procession of beings\nfrom the First Intellect, as well as of their numerology, are found in\ntwo Yemenite philosophical midrashim, i.e. Judaeo-Arabic\ninterpretations of Biblical texts, written in 1420–1430: the\nGlad Learning (Midrash ha-hefez) by Zerahyah\nha-Rofé (Yahya al-Tabib) and the Lamp of Intellects\n(Siraj al-‘uqul) by Hoter ben Solomon (Mansur ibn\nSulayman al-Dhamari) (see Blumenthal 2007).\n4. al-Farabi\n\nThe ‘influence’ of the Arabic “second Master”\n(i.e. the second Aristotle), Abu Nasr al-Farabi (870-950), is evident\nin many fields of Medieval Jewish philosophy: epistemology, logic,\nmetaphysics and theology, ethics, and even physics.\n\nAs for epistemology, al-Farabi’s major work on it, the\nEnumeration of Sciences (Ihsa’\nal-‘ulum), about the general contents of linguistics,\nlogic, mathematical sciences, physics and metaphysics, ethics and even\nIslamic jurisprudence and religion, exerted an important influence\nover a number of Jewish scholars in the period 1200–1400. Joseph\nben Judah Ibn ‘Aqnin (d. 1226), a Moroccan Jewish follower of\nMaimonides, inserted long sections of the original Arabic text in\nchapter 27 of his main ethical work, The Medicine of Souls\n(Tibb al-nufus); in his commentary on the Song of\nSongs, The Revealing of Secrets (Inkishaf\nal-asrar), he quoted a number of other Farabian works on\nepistemology, logic, metaphysics, and even music. Shem Tov Ibn\nFalaquera inserted a number of its passages (in Hebrew) into his own\n“enumeration of sciences”, part two of the Beginning\nof Science (Reshit hokhmah), probably written around\n1250 (Efros 1935; Strauss 1936; about Falaquera’s knowledge of\nal-Farabi’s works, see Harvey 2002). Qalonymos ben Qalonymos\ntranslated the whole work into Hebrew in 1314, together with another\nshort “introduction to Aristotle” by al-Farabi himself;\nrather significantly, he himself inserted into it his own treatment of\nsome subjects which were lacking in the original Arabic text, very\nprobably since al-Farabi rejected them as real sciences: medicine,\nalchemy, magic. Qalonymos’ version was later quoted by some\nJewish scholars, mainly during the 14th and 15th\ncenturies. As far as philosophy in general is concerned, it should be\nnoted that Falaquera made a sort of complete Hebrew abridgement of\nthree main works by al-Farabi, and inserted them into part three of\nthe Beginning of Science: the Attainment of\nHappiness (Tahsil al-sa‘ada), the Philosophy\nof Plato (Falsafa Aflatun) and the Philosophy of\nAristotle (Falsafa Aristu), so spreading among Jews the\nknowledge of the general contents of all works by Plato and Aristotle\n(Strauss 1936; see also Mahdi 1962). Falaquera also quoted a short\nintroductory passage of al-Farabi’s Epistle On the Knowledge\nof Philosophy in his Book of Degrees (as pointed out in\nChiesa and Rigo 1993).\n\nAs for logic, al-Farabi even exerted a stronger influence over\nMedieval Jewish philosophy, which was apparently almost like that\nexerted by the most highly reputed, “official” commentator\nof Aristotelian logic: Averroes. According to Maimonides, there was no\nneed to study logical texts, apart from those by al-Farabi, since\n“all that he wrote… is full of wisdom, and… he was\na very valid author” (Marx 1934–1935, 379). Surely,\nal-Farabi’s logical (and also non-logical) works influenced the\nTreatise On the Art of Logic (Maqala fi sina‘a\nal-mantiq) usually ascribed to Maimonides, and probably written\naround 1160 (see Brague 1996; Maimonides’ authorship has been\nrecently challenged by Davidson 2005, 313–322): this text was\nthrice translated into Hebrew in the 13th and\n14th centuries and was obviously widespread among Jewish\nreaders in the Late Middle Ages. As a matter of fact, almost all his\nlogical works were either translated into Hebrew, or at least widely\nemployed by a number of Medieval Jewish philosophers in the\n13th-15th centuries (among the others, by Samuel\nIbn Tibbon in his Commentary on the Difficult Terms\n[Perush ha-millot ha-zarot]: Robinson 2009), although the\nreal extent of his influence on Jewish logic has not yet been examined\nin all its aspects. As for the many Hebrew translations of his\nsummaries or “short commentaries” on Porphyry’s\nIsagoge and Aristotle’s Organon, probably five\ngroups of these translations (not covering the whole series of the\nsummaries) can be identified: some translations were made very early,\npossibly before 1200; some others should be ascribed to a Spanish Jew,\nMoses Ibn Lagis; some others were made by members of the family of the\nIbn Tibbons, during the 13th century, and were often\nemployed as sources by some 14th- and\n15th-centuries Jewish philosophers (Judah ben Isaac Cohen,\nAbraham Avigdor); other translations consisted in revisions of the\nTibbonian ones, were made before 1320 and were surely known to\nHezekiah bar Halafta (see below, 7); finally, two translations (the\nonly ones of al-Farabi’s summaries of Aristotle’s\nRhetoric and Poetics) were probably made by Todros\nTodrosi, a philosophical translator working in Arles, around 1330\n(about all these translations, see Zonta 1996, 189–193). In\nparticular, al-Farabi’s summary of the Categories was\nquoted and commented on by an otherwise unknown Jewish philosopher,\nSar Shalom, possibly active in Provence around 1300 (Zonta 1997b,\n523). Also some of al-Farabi’s “long commentaries”\n(tafasir) on Aristotle’s logic, even those now lost in\ntheir Arabic original text, can be shown to have influenced Jewish\nphilosophers: the Long Commentary on Categories is preserved\nalmost only due to the many quotations made by a Late Medieval Jewish\nauthor, Judah ben Isaac Cohen, and has very recently been published\n(Zonta 2006a); the Long Commentary on De interpretatione,\nfound in Arabic, was translated into Hebrew before 1334 (the text of\nits introduction in Hebrew is still extant) and appears to have\ninfluenced Gersonides too (Glasner 2002, 252–254); many passages\nfrom the Long Commentary on Book Eight of Topics, lost in\nArabic, were translated into Hebrew by Todros Todrosi in 1334. As\nproved by Georges Vajda (Vajda 1965), Maimonides knew and implicitely\nemployed al-Farabi’s summary of Topics, book one,\nchapter 11, as a source of a passage of his Guide of the\nPerplexed, part two, chapter 25, concerning a discussion between\nthe two different doctrines of the eternity of the world according to\nAristotle and Plato; he also knew and paraphrased some passages from\nother logical works by al-Farabi (the summary of De\ninterpretatione, the Long Commentary on Prior Analytics:\nsee Davidson 2005, 113–114).\n\nAs for al-Farabi’s most famous work, the Book of the\nOpinions of the People of the Virtuous City (Kitab ara’\nahl al-madina al-fadila), apart from some short quotations found\nin Moses Ibn Ezra’s Treatise of the Garden (Fenton\n1976, 297) and in Isaac Ibn Latif’s above mentioned work (Chiesa\n1986, 80), the most relevant employment of this text as a source for\nmetaphysics and theology is found in Falaquera’s Book of\nDegrees and in particular in book ten of his encyclopedia The\nOpinions of the Philosophers, where his general treatment of the\nnature of God mixed up al-Farabi’s and Averroes’ opinions\nabout it (Chiesa 1986, 81–84). Al-Farabi’s Virtuous\nCity appears to have been ignored by most of Medieval Jewish\nphilosophers: as a matter of fact, Moses Ibn Tibbon did not translate\nit into Hebrew, but preferred to translate al-Farabi’s The\nPolitical Regimen (al-Siyasa al-madaniyya) instead\n(Steinschneider 1893, 290–292) – another Farabian text\nknown and quoted by Falaquera (Plessner 1956, 189–193).\nAccording to Pines, although al-Farabi’s former work is not\nexplicitely quoted in the Guide of the Perplexed, it was\nsurely among the main sources of Maimonides’ doctrine about the\ndifferent roles played by the philosopher and by the prophet (see\nMoses Maimonides 1962, 1:lxxxvii-xcii). Al-Farabi’s idea about\nthe relationship between philosophy and religion, according to which\nthe former is in a substantially higher position with respect to the\nlatter, as found in his Book on Letters (Kitab\nal-huruf) and Book on Religion (Kitab\nal-milla), strongly influenced Maimonides’ ideas about this\n(see Berman 1974); moreover, the Book on Letters was later\nemployed as a source for Falaquera’s treatment of linguistics in\nhis Beginning of Science. According to Davidson, Maimonides\nexplicitly quoted and employed al-Farabi’s Political\nRegime under the title The Changing Beings\n(al-Mawjudat al-mutaghayyira) for discussing the question of\nthe world’s eternity in part two, chapter 74, of the\nGuide (Davidson 2005, 113). It should be noted that European\nJewish philosophers active in the 13th and 14th\ncenturies show even more interest in another work by al-Farabi: his\ntreatise On the Intellect (Risala fi l-‘aql).\nThis interest was apparently raised by Maimonides, who quoted and\ncommented on some passages of this book about the theologians’\nidea of the human intellect and the role of the active intellect in\nhis Guide (see what has been written by Pines in Moses\nMaimonides 1962, 1:lxxxii-lxxxiii). As recently shown by Gad\nFreudenthal, at least three Arabic-into-Hebrew versions of the work\n(one by Qalonymos ben Qalonymos, and two anonymous) were written, read\nand in one case at least commented on in Western Europe between about\n1150 and 1320 (Freudenthal 2003). Moreover, Farabian doctrines (if not\ndirect references to al-Farabi’s works) about some key concepts\nof metaphysics and theology (the First Cause, the prophecy, etc.) were\nstill circulating in Spain around 1350 (see Vajda 1962, 216–217,\nwhere these doctrines are found in Joseph Ibn Waqqar’s work).\n\n\nAs for ethics, the first traces of al-Farabi’s doctrine about\nthe difference between the philosophers and inferior classes of men\nare found in Abraham bar Hiyya (Vajda 1938). However,\nal-Farabi’s affirmation, as found in his lost commentary on\nAristotle’s Nicomachean Ethics, about human moral\nperfection and its connection to an intellectual perfection apparently\nlimited to man’s life in this world seems to have influenced\nMaimonides’ idea of perfection as found in part three, chapter\n18, of the Guide of the Perplexed (Moses Maimonides 1962,\n1:lxxix-lxxxii; Davidson 2005, 113). Other ethical works by al-Farabi,\nthe Epistle of the Guide to the Way of Happiness (Risala\nfi l-tanbih ‘ala sabil al-sa‘ada) and the\nSelected Aphorisms (Fusul muntaza‘a), were\nalso both translated into Hebrew, probably around 1300, and quoted by\nsome Jewish philosophers: Shem Tov Ibn Falaquera (Plessner 1956,\n179–183), Qalonymos ben Qalonymos, Josef Ibn ‘Aqnin\n(Steinschneider 1893, 290–292).\n\nAccording to Yair Shiffman, a lost work by al-Farabi on physics, his\nLong Commentary on Aristotle’s Physics, was also\nimplicitly quoted by Falaquera in his Guide to the Guide\n(Moreh ha-Moreh), a philosophical commentary on\nMaimonides’ Guide written in 1280 (Shem Tov Ibn\nFalaquera 2001, 234); as a matter of fact, a passage of it about the\nformal and material differences between the heavens and the stars is\nexplicitly quoted and commented on by Maimonides himself in chapter 19\nof part two of the Guide of the Perplexed (see Moses\nMaimonides 1962, 2:239).\n5. Avicenna\n\nThe main reason for the interest of a number of Medieval Jewish\nphilosopher towards Avicenna (Ibn Sina, 980–1037) might have\nbeen Avicenna’s own interest in a tentative conciliation between\nAristotelian philosophy and religion (see Harvey 2009). Such interest\nwas due to the philosopher’s special attitude towards Islam, and\ntowards Shi‘ite Islam in particular, an attitude which the\nAvicennian Jewish philosophers obviously applied to Judaism. It seems\nthat these philosophers regarded Avicenna as a substantial defender of\nreligion over philosophy, so associating him with al-Ghazali’s\nown position with regard to philosophy. In this way, “Jewish\nAvicennism” was slowly absorbed into a sort of “Jewish\nGhazalism”, aiming at a defense of Judaism against Averroism\n(see below, 6). However, according to a more recent, in-depth, and\nwider examination of all the extant Judeo-Arabic and Hebrew materials\nabout Avicenna as philosopher, mystic, and physician in the Jewish\nMiddle Ages, it is evident that, among Jewish philosophical authors,\nthe ‘committed Avicennians’ were really few, while the\n‘eclectic Avicennians’, who employed a number of more or\nless Avicennian ideas, were very many – even if some of them did\nnot read Avicenna directly (Freudenthal and Zonta 2012).\n\nAvicenna was the main source of an important doctrine which spread\namong a number of 11th- and 12th-century Jewish\nphilosophers, as once shown by Harry A. Wolfson (Wolfson 1935):\naccording to this doctrine, there are in man’s mind five\ninternal senses (common sense, estimation, imagination, thought, and\nmemory). A first trace of this doctrine was found in Bahya Ibn Paquda:\nhowever, he might have taken it from an Arabic philosophical or\ntheological compendium inspired by Avicenna. Such occasional\nemployment of Avicenna as a source for one particular point of a\nMedieval Jewish philosopher’s thought might have happened in the\ncase of Joseph Ibn Zaddiq’s Book of the Microcosm, as\nobserved by Vajda in his study about the philosophical sources of the\nlatter (see Vajda 1949, 180). A more important case is that of the\nwell-known Spanish Jewish author Judah Halevi (1085–1141). In\nhis main Judaeo–Arabic work, the Book of the Khazar (in\nHebrew, Sefer ha-Kuzari), an explicit defence of Judaism with\nrespect to the other religions and to philosophy as well, he\nsignificantly employed Avicenna’s Epistle On the Soul\n(Risala fi l-nafs) as a direct and literal, albeit implicit\nsource for his description of man’s soul in chapter 12 of book\nfive, as definitively shown by David H. Baneth (see his introduction\nto Judah Halevi 1977). Also a more “mystical” work by\nAvicenna, Living Son of the Watchful (Hayy ibn\nYaqzan), apparently inspired Abraham Ibn Ezra in writing his own\nwork in Hebrew on the same subject, the Iggeret Hay ben\nMeqits (around 1150), as shown by Israel Levin (see Levin\n1983).\n\nIn any case, a wider influence of Avicenna’s philosophy on\nMedieval Judaic thought appeared after 1150. The first significant\ncase is that of Abraham Ibn Daud, living in Toledo between 1110 and\n1180 circa. As it is clear from his philosophical work, the\nExalted Faith (al-‘Aqida al-rafi’a, lost\nin its Judaeo-Arabic original, but preserved in two\n14th-century Hebrew translations), he was the first Jewish\nAristotelian, but surely employed as his main sources both Avicenna\nand al-Ghazali. As shown in recent studies by Amira Eran, and in\nparticular in her book about the contents of Ibn Daud’s work\n(Eran 1998, 27), Avicennian influences appear mostly in book one of\nthe Exalted Faith, where such philosophical themes as\ncategories, matter and motion, souls and celestial bodies are studied.\nHowever, in treating these themes, Ibn Daud did not directly refer to\nthe contents of Avicenna’s main extant encyclopedia, The\nCure (al-Shifa’), but to his minor encyclopedia of\nlogic, physics and metaphysics: The Salvation\n(al-Najat). Moreover, it might be suggested that in reality\ninstead Ibn Daud employed al-Ghazali as his main source for\nconstructing his own “Avicennism” rather than Avicenna\nhimself (see below, 6), just as a number of later Medieval Jewish\nphilosophers did, beginning with Maimonides. Maimonides appears to\nhave regarded Avicenna not as a really direct and important\nphilosophical source. Although clear echoes of Avicennian doctrines\nabout the distinction between essence and existence, between necessary\nand contingent beings, as well as the well-known Avicennian proof of\nthe existence of God, have been found in the Guide of the\nPerplexed (see Moses Maimonides 1962, 1:xciii-ciii), the explicit\njudgement of Maimonides about Avicenna’s thought appears to be\nsubstantially cool (for a different interpretation of this judgement,\nsee however Dobbs-Weinstein 2002). In his letter to Samuel Ibn Tibbon,\nhe affirms that “Avicenna’s books, although they are\nsubtle and difficult, are not like those by al-Farabi; however, they\nare useful, and he too is an author whose words should be studied and\nunderstood” (Marx 1934–1935: 380).\n\nMaimonides’ lukewarm judgement about Avicenna did not prevent\nmany later Jewish scholars from studying his works and employing them\nas sources for their own philosophy. Even the translator of\nMaimonides’ Guide, Samuel Ibn Tibbon, directly referred\nto Avicenna’s doctrines and affirmations about meteorology both\nin his Hebrew translation (including some comments) of\nAristotle’s Meteorology, and in his work Treatise\non “Waters Did Gather” (Ma’amar be-yiqqawu\nha-mayim), as shown by Resianne Fontaine in her critical edition\nand English translation of the former (Fontaine 1995); this Jewish\nphilosopher can be even tentatively seen as a ‘committed\nAvicennian’. Shem Tov Ibn Falaquera, whose many works appear to\nhave been a sort of “basin of quotations”, referred to a\nnumber of Avicenna’s philosophical works, and employed them as\nsources for his own expositions of Maimonides’ and\nAristotle’s thought, in the Guide to the Guide and in\nthe Opinions of the Philosophers, as well as for some other\nminor works. In particular, he quoted some passages from The\nCure about celestial bodies, mineralogy, zoology, psychology, and\nmetaphysics; he quoted a number of passages of The Salvation\nabout logic and psychology; he made an abridgement of the contents of\nthe Epistle On the Soul; he even quoted short passages from\nAvicenna’s Remarks and Admonitions (al-Isharat\nwa-l-tanbihat); finally, Avicenna was probably one of the main\nsources for Falaquera’s philosophical dictionary, put at the\nbeginning of the Opinions of the Philosophers, as well as for\nhis own classification of sciences in part two of the Beginning of\nWisdom. The influence of Avicenna on Jewish scientific thought\ncontinued after 1300: for example, some traces of it are found also in\nthe Hebrew paraphrase of a pseudo-Avicennian work, made by a\nProvençal Jewish scholar, Solomon ben Moses of Melgueil (d.\nbetween 1306 and 1309) (see Glasner 1996).\n\nProbably, an important case of eclectic “Jewish\nAvicennism” appeared in 14th-century Provence and\nSpain. Its main character was the employment of some aspects of\nAvicenna’s philosophy in favor of the Jewish religious tradition\n– although this aspects are not evidently employed against the\nAristotelian philosophical tradition as represented by Averroes’\nrationalism. As a matter of fact, some of these eclectic “Jewish\nAvicennians” tried to arrive at a substantial agreement between\nJewish religion and philosophy; some others might have had an opposite\neffect, as happened for example in the case of Abner of Burgos.\n\nJudah ben Solomon Natan, a physician and translator active in Provence\naround 1330, explicitly declared the reason for his interest in\nAvicenna in the introduction to his Hebrew translation of\nal-Ghazali’s Intentions of the Philosophers\n(Maqasid al-falasifa), where he affirmed that he translated\nthat book since it was very useful for reconciling religious tradition\nand philosophy, and he found a substantial correspondence between that\nbook and some parts of Avicenna’s The Cure about\nphysics and metaphysics, as well as Avicenna’s The\nSalvation. Judah Natan’s translation was employed by his\nfriend Todros Todrosi for his own translation of the\n“Avicennist” work The Sources of Questions\n(‘Uyun al-masa’il): in the introduction to the\nlatter, he affirms to have found there the same opinion expressed in\nal-Ghazali’s above mentioned book. Here and in his philosophical\nanthology (dating back to 1334) Todros quoted some of Avicenna’s\npassages about logical, physical and metaphysical questions: he took\nthem both from the logical sections of The Cure (he also\nquoted a passage about infinite motion from book three, chapter 8 of\nthe physical section of this work), and from Avicenna’s\nRemarks and Admonitions. Finally, he was the unique Medieval\nHebrew author who wrote an almost complete translation of one of\nAvicenna’s philosophical works: books two and three of The\nSalvation, about physics and metaphysics. Two other\nProvençal Jewish authors employed Avicenna: Judah Cohen, who\nmight have been active in Provence around 1350, was apparently\ninspired by Avicenna’s Epistle On Love (Risala fi\nl-‘ishq) (Vajda 1977, 136); the well-known Jewish\nphilosopher and commentator of Averroes Moses Narboni, living there in\nthe period 1300–1360, occasionally quoted some passage from\nThe Cure and The Salvation in his own\n“Averroistic” commentary on the Intentions of the\nPhilosophers (Steinschneider 1893, 318). Various approaches to\nAvicenna are found in 13th- and 14th-century\nSpain: Avicenna’s metaphysics was the main source of Moses\nha-Levi’s Metaphysical (lit.\n“divine”)Treatise (Maqala ilahiyya),\nwritten in Judaeo-Arabic probably before 1300, whose contents were\nstudied in detail by Vajda (see Vajda 1948) – here there is one\nof the few cases of ‘committed Avicennism’; the Jewish\nphilosopher Abner of Burgos (1270–1350 circa), both before and\nafter having converted to Christianity, seems to have often employed\nAvicenna in favor of determinism and against Averroes (he claims to\nhave transmitted some lost passages of Avicenna’s The\nOriental Wisdom [al-Hikma al-mashriqiyya]; but see\nSzpiech 2010); Josef Ibn Waqqar, in his Treatise for Reconciling\nPhilosophy and Religious Law (Maqala al-jami‘a bayna\nl-falsafa wa-l-shari‘a), written in Judaeo-Arabic around\n1360 and analyzed by Vajda, even tried to reconcile Averroes, Avicenna\nand al-Ghazali in a very difficult field: metaphysics (Vajda 1962,\n132). In a different, indirect way the Neoplatonic circle of Jewish\nauthors of Hebrew supercommentaries on Abraham Ibn Ezra’s\nBiblical commentaries, active in Spain in the second half of the\n14th century and in Provence in the first decades of the\n15th century, could have employed Avicennian ideas for\ndefending the doctrine of astral determinism (see Schwartz 1996);\nstill indirectly, Avicenna’s thought might have influenced some\naspect of Hasdai Crescas’ philosophy (see below, 6). According\nto Dov Schwartz, the role played by Avicenna in influencing some\naspects of 14th- and also 15th-century Judaic\nthought was even more widespread than that played by Averroes, who was\nuntil now regarded as the most important “master” in Late\nMedieval Jewish philosophy after Maimonides (Schwartz 1995, 420).\n6. al-Ghazali\n\nRemarkably, there are clues that even the main representative of\nArab-Islamic Sunnite theology, al-Ghazali (1058-1111), exerted an\nimportant ‘influence’ over some aspects of Medieval Jewish\nphilosophy and thought. This fact has not yet been systematically\nstudied and explained by scholars, but it cannot be easily neglected.\nMoreover, in the 14th century there was apparently a sort\nof “Jewish Ghazalism”, based upon al-Ghazali’s works\n(both philosophical and theological ones), so that many aspects of his\nthought as a typical Islamic thinker were curiously employed for\ndefending some similar aspects of Jewish religious tradition.\n\nThe first sure traces of an influence of al-Ghazali on Judaic thought\nappeared rather early, around 1160, when Abraham Ibn Daud employed his\nmajor philosophical work, The Intentions of the Philosophers,\nas one of the main unavowed sources of his Exalted Faith (see\nEran 1998, 27). Significantly enough, al-Ghazali’s work\ninfluenced not only the contents of book one of the Exalted\nFaith, about some aspects of Aristotelian philosophy (logic,\nphysics, and metaphysics), but also book two of it, about theology\n(God’s incorporeity, unity, attributes, as well as divine\ncreation, prophecy, and providence). Possibly, al-Ghazali might have\nexerted a similar influence over Maimonides too, and over his\nphilosophical thought in particular. As a matter of fact, there are no\ndirect and explicit mentions of al-Ghazali either in the Guide of\nthe Perplexed or in Maimonides’ above mentioned letter to\nSamuel Ibn Tibbon; but some traces of Avicennian doctrines in some of\nMaimonides’ works (both in the Guide and in other ones)\ncould also be explained as the results of an influence of Avicenna by\nmeans of al-Ghazali, and of the latter’s Intentions of the\nPhilosophers in particular, as pointed out by Herbert Davidson\nand other scholars (Davidson 2005, 104; see also Pines 1971, 958; for\na particular case-study, see Eran 2001). Davidson, in particular,\naffirms that “virtually every of a metaphysical character\nattributed by Maimonides to Aristotle but actually deriving from\nAvicenna was available to him through Ghazali”: according to\nhim, there are striking similarities, even in some points of the\nphraseology, between Maimonides and al-Ghazali, about these points\n(Davidson 2004, 732; see also Davidson 2005, 115).\n\nDirect and explicit proofs of the influence of al-Ghazali on Medieval\nJewish philosophy appeared in Spain and Provence from 1270 onwards.\nThe first case is found in Shem Tov Ibn Falaquera’s Book of\nDegrees, two passages of which were surely taken from the\nIntentions of the Philosophers (Chiesa 1986, 86). The second\nand more important case is that of Isaac Albalag, a Catalan or\nProvençal Jewish philosopher who first translated the work into\nHebrew, and then commented on it in his work Correction of the\nOpinions (of the Philosophers) (Tiqqun ha-de‘ot),\nwritten at the end of the 13th century. As shown by Vajda,\nwho published a critical edition of Albalag’s commentary and\nstudied its philosophical contents in detail (Vajda 1960, Yishaq\nAlbalag 1973), he did not employ al-Ghazali for defending him, but for\ncriticizing him instead: contrary to al-Ghazali, Albalag even seems to\nhave adopted the doctrine of the existence of two truths, the\nphilosophical one (reserved for wise and experienced philosophers) and\nthe religious one (reserved for common people). After Albalag, in the\nfirst half of the 14th century al-Ghazali’s\nIntentions were translated into Hebrew in Provence twice: by\nJudah Natan, who allegedly wrote this translation for refuting the\narguments of the “philosophists” (in Hebrew,\nmitfalsefim), i.e. the Averroists (see above, 5); and by an\nanonymous translator, possibly identical to, or working for, Moses\nNarboni. As a matter of fact, Narboni commented on the\nIntentions in a totally different, substantially Averroist\nway (see Steinschneider 1893, 311–319). Other evident proofs of\nthe direct influence of al-Ghazali’s philosophical work on\n14th-century Judaic thought are found in some Spanish\nauthors, active after 1350, for example in Moses ben Judah’s\nphilosophical encyclopedia, The Love of (Intellectual)\nPleasures (Ahavah ba-ta‘anugim), written in 1354\n(Eisenmann 2000). In 15th-century Spain and even later,\nmany commentaries, mostly on the metaphysical section of the\nIntentions, were written by some philosophers (Isaac Ibn Shem\nTov, Eli Habillo, Moses Almosnino, and some anonymous authors): they\nwere identified by Steinschneider (Steinschneider 1893, 320–325)\nbut are still in need of a deeper study. This wide employment of\nal-Ghazali’s work as a philosophical source might be explained\nas an easier way to the knowledge of the general contents of\nAristotelian logic, physics, and metaphysics (see Harvey 2001).\n\nHowever, al-Ghazali’s Intentions was not his only work\nknown and employed as a source by Late Medieval Jewish authors. They\nwere surely influenced by other two philosophical works by him about\nlogic: The Balance of Knowledge (Mi‘yar\nal-‘ilm) and The Touchstone of Intellect\n(Mihakk al-nazar). Both were explicitly quoted by Todros\nTodrosi in his philosophical anthology, and the first of them,\npossibly translated into Hebrew before the end of the 15th\ncentury, was surely employed as a source by two Jewish philosophers,\nZerahyah Hen (active in Rome, 1277–1290) and Moses Narboni. Some\nof these authors, mostly living in the Northern Spanish area, knew and\nemployed some of al-Ghazali’s ethical and even theological works\n(see Steinschneider 1893, 328–330, 342–347): the\nBalance of Actions (Mizan al-a‘mal) was\ntranslated into Hebrew by Abraham Ibn Hasdai of Barcelona around\n1210–1230; the Lamps of Lights (Mishkat\nal-anwar) was twice translated in the 14th century;\nthe Incoherence of Philosophy (Tahafut al-falasifa)\nwas translated before 1411 by Zerahyah ha-Levi Saladin –\nprobably, a member of the Catalan circle of Hasdai Crescas, who might\nhave employed al-Ghazali’s work as one of the undeclared sources\nof his famous Light of the Lord (Or Adonai), a deep\ncritique of some key points of Aristotelian philosophy. (However, this\nhypothesis has been criticized by Harry A. Wolfson: see Wolfson 1929a,\n11–16.)\n7. Ibn Bajja\n\nA number of philosophical works by the Spanish Arabo-Islamic author\nAbu Bakr Ibn Bajja (d. 1138), usually called “Ibn\nal-Sa’igh” by the Jewish tradition, were known and\nemployed by Medieval Jewish philosophers.\n\nThe first of these philosophers who gives evidence of having been\n’influenced’ by him is a well-known Jewish\nfellow-countryman and contemporary, Judah Halevi: as shown by Shlomo\nPines (see Pines 1980, 210–217), in chapter 1 of book one of his\nBook of the Khazar he reflects not Avicenna’s\nphilosophy (as in another place of his work: see above, 5), rather Ibn\nBajja’s as expounded in his Epistle On the Conjunction of\nthe Agent Intellect with Man (Risala al-ittisal), and\ngives a sort of summary of his main ideas about God and the world.\nMaimonides had the highest esteem of Ibn Bajja: he affirmed that\n“he was a great and wise philosopher, and all his works are\nright and correct”, and possibly appreciated him as a\ncommentator of Aristotle too (Marx 1934–1935, 379). In some\ncases he was surely influenced by Ibn Bajja’s thought: in the\nGuide of the Perplexed, he explicitly refers to some of his\nphilosophical and scientific ideas, and reveals in particular the\ninfluence of his doctrines about the existence of only one intellect\nafter death, the possibility of the conjunction between man and the\nActive Intellect, the division of men into three classes (according to\ntheir different degrees of knowledge of the highest truths), as well\nas the idea of the prophet as a perfect solitary man, which seems to\nhave been inspired by Ibn Bajja’s well-known work, the\nRegimen of the Solitary Man (Tadbir al-mutawahhid);\nmoreover, Maimonides knew also Ibn Bajja’s hypothesis, according\nto which God would be the spirit of the celestial body which includes\nall that is around the earth (see Pines’ observations in Moses\nMaimonides 1963, 1:ciii-cvii; about Maimonides’ knowledge of Ibn\nBajja’s doctrines, see also Davidson 2005, 114–115). The\nlast idea was found by Maimonides in Ibn Bajja’s commentary on\nAristotle’s Physics, a work which appears to have been\nwell-known to a later Medieval Jewish philosopher: Shem Tov Ibn\nFalaquera. As shown by Bruno Chiesa and Yair Shiffman (Chiesa 1986,\n85–86; Shem Tov Ibn Falaquera 2001, 156–157, 180, 207,\n221–223, 265–266, 277, 318, 323–328, 331–332),\nfor commenting on Maimonides’ Guide Falaquera more or\nless literally quoted and shortly commented on a number of passages\ntaken from various works by Ibn Bajja: not only his Regimen of the\nSolitary Man and his Epistle On the Conjunction, but\nalso his Epistle of Farewell (Risala al-wada‘)\nand some less known works, like the already mentioned commentary on\nPhysics and the commentary on Aristotle’s De\nanima; some of these quotations are found in Falaquera’s\nBook of Degrees too.\n\nA substantial interest in Ibn Bajja’s philosophical thought was\nshown by three other Jewish philosophers living in the first half of\nthe 14th century: Hezekiah bar Halafta, David Ibn Bilia and\nMoses Narboni. Hezekiah bar Halafta (nicknamed “Bonenfant de\nMillau”), a Provençal Jewish philosopher, wrote in 1320 a\nsupercommentary to Petrus Hispanus’ Summulae, where a\nnumber of passages taken from Ibn Bajja’s supercommentaries on\nal-Farabi’s own summaries of Porphyry’s Isagoge\nand Aristotle’s Categories and De\ninterpretatione are found and commented on: this was the first\nand possibly unique case of the influence of Ibn Bajja as a logician\nand as an interpreter of al-Farabi on Medieval Jewish treatment of\nlogic (Zonta 1997b, 576–583). David Ibn Bilia, a Portuguese Jew\nworking in the period 1320–1340, commissioned a translation of\nthe Epistle of Farewell to a certain Hayyim Ibn Vivas: he\nwrote marginal notes on some points of it (see Steinschneider 1893,\n358–359). Moses Narboni too commented on this Epistle\n(see Hayoun 1990a; critical edition in Hayoun 1990b); moreover, he\ncommissioned (or wrote himself) and commented on a Hebrew compendium\nof Ibn Bajja’s Regimen (critical edition in Hayoun\n1987). Narboni’s positive approach to this Arab-Islamic\nphilosopher might have been suggested by Maimonides’\naffirmations about Ibn Bajja. Narboni was a declared Averroist (see\nbelow, 9), but he might have tried to find in Ibn Bajja something in\nagreement with Averroes’ philosophical thought.\n8. Ibn Tufayl\n\nThe unique well-known work by the Spanish Arabo-Islamic philosopher\nIbn Tufayl (d. 1185), the Living Son of the Watchful\n(Hayy ben Yaqzan), exerted a substantially limited\n‘influence’ over Medieval Jewish philosophy. For example,\nPines affirms that “there is no evidence to show that Maimonides\nwas in any way influenced by Ibn Tufayl’s philosophic\ntale”, although this influence cannot be totally excluded (Moses\nMaimonides 1963, 1:cviii; see also Davidson 2005, 115–116).\n\nThe main one among the very few cases of a direct influence of Ibn\nTufayl on a relevant figure of Medieval Judaic thought is the\nanonymous Hebrew translation of his work (bearing the title\nIggeret Hayawan ben Yaqtsan), which was commented on by Moses\nNarboni; Narboni’s commentary (apparently, the only extant one\non this text) was written in 1349 and has been very recently published\nby Maurice-Ruben Hayoun (Hayoun 2002). Narboni’s commentary\nbears the title Epistle of Conjunction (Iggeret\nha-devequt), so showing that Narboni might have commented on this\nparticular text in order to find in it a substantial confirmation of\nthe well-known doctrine about the conjunction between man and the\nActive Intellect. As a matter of fact, like in the case of Ibn\nBajja’s philosophical works, Narboni himself might have been the\ntranslator of this work from Arabic into Hebrew, or at least might\nhave assigned this translation to a member of his “team”.\nNarboni’s interpretation of Ibn Tufayl’s work influenced a\nnumber of 15th-century Jewish philosophers, mostly in Spain\nand Italy, who knew and in some cases were strongly connected to\nAverroism (see Steinschneider 1893, 366–368): Joseph Ibn Shem\nTov (living around 1450), Abraham Bibago (d. 1489), Isaac Arama, Isaac\nAbravanel (1437–1508), Yohanan Alemanno (living in the second\nhalf of the 15th century). Finally, it should be noted that\nIbn Tufayl’s works (not only the Living Son of the\nWatchful, but also some minor works, apparently lost in their\noriginal Arabic texts) appeared among the main sources of a typical\nexample of eclectic “Jewish Avicennism” in\n14th-century Spain: Joseph Ibn Waqqar’s Treatise\nfor Reconciling Philosophy and Religious Law (see Vajda 1962,\n128, 132).\n9. Averroes (Ibn Rushd) and Some of His Followers\n\nAverroes (Ibn Rushd, 1126–1198) is usually regarded to have been\nthe major “master” of Islamic philosophy among Jews in the\nLate Middle Ages – although he might have had to share this key\nposition with Avicenna and al-Ghazali. Almost all his philosophical\nworks were translated from Arabic into Hebrew in the period\n1230–1330, sometimes even more than once (only one of them was\nlater translated from Latin into Hebrew, around 1480); almost all of\nthem were quoted, summarized, paraphrased, annotated and commented on\nby a number of philosophers during the 14th and\n15th centuries. As a matter of fact, some of these texts\nare preserved only through these translations, due to the loss of\ntheir original versions, and their success among Jewish philosophers\nwas surely wider than the success they gained among Arabic thinkers,\nand probably equal to the success they gained among Latin Christian\nones. A real history of “Jewish Averroism” has not yet\nbeen written, so that most information about it can be found in\nSteinschneider’s book about Medieval Jewish translations\n(Steinschneider 1893, 49–339).\n\nMaimonides set the tone of this Jewish approach to Averroes by\naffirming in his letter to Samuel Ibn Tibbon: “Take care not to\nread Aristotle’s books without the commentaries on them: those\nby Alexander (of Aphrodisias), those by Themistius, and those by\nAverroes” (Marx 1934–1935, 378). There are some clues to\nthe fact that Maimonides and Averroes agreed in some key points of\ntheir doctrines, especially in the fields of metaphysics and theology;\nhowever, Maimonides explicitely declared in a letter to his disciple\nJoseph ben Judah, written when he had just completed some parts of the\nGuide, that he had received a copy of most of Averroes’\ncommentaries on Aristotle, but had not yet read them (about the\nrelationship between Maimonides and Averroes, see Pines’\nobservations in Moses Maimonides 1963, 1:cviii-cxxi). As a matter of\nfact, a concrete, sure proof of Averroes’ influence on\nMaimonides’ philosophical thought has not yet been found; but\nthis does not exclude that he really knew well Averroes’\nphilosophy. In any case, Maimonides opened the way to a sort of\nadoption of Averroes as an unofficial, “Judaizing”\ninterpreter of Aristotle: the many Western European Jewish followers\nof Maimonides’ thought (active in Spain, Provence, and Italy in\nthe 13th-15th centuries) seem to have referred\nto the above words as a justification for employing the commentaries\nof Averroes in reading and interpreting Aristotle’s works.\nSignificantly, they did not usually employ either Alexander or\nThemistius, i.e., the other two commentators recommended by\nMaimonides. Their particular choice of Averroes might be explained\neither because of the example given by contemporary Latin Christian\ncommentators, or because of the easier availability of his\ncommentaries in Spain (where they had been written and had spread\nduring Averroes’ life) with respect of those by al-Farabi,\nAvicenna and Ibn Bajja, or because of the didactic usefulness of them\nfor knowing in detail Aristotle’s words and the opinions of all\nthe other Greek and Arabic commentators, whom Averroes quoted and\ndiscussed in his works. Shem Tov Ibn Falaquera, in the introduction to\nhis work The Opinions of the Philosophers (a detailed\ncommentary on Aristotle’s physics and metaphysics), affirms:\n“All that I have written here corresponds to Aristotle’s\nwords, as they are commented on by the sage Averroes. He was the last\nof the commentators (of Aristotle), and collected the cream of the\nworks of the previous commentators, as well as of Aristotle’s\nwords”.\n\nA key role in transmitting to Jewish philosophers a direct knowledge\nof Averroes’ philosophy was obviously played by the\nArabic-into-Hebrew translations of his works, including\nAverroes’ various commentaries on Aristotle’s texts. This\ntranslation process involved a number of scholars: in approximate\nchronological order, they were Jacob Anatoli (who finished in Naples\nin 1232 his translation of Averroes’ “middle\ncommentaries” [talkhisat] on Porphyry’s\nIsagoge, as well as on Aristotle’s Categories\n[both published in a critical edition in Averrois Cordubensis 1969],\nDe interpretatione, Prior and Posterior Analytics),\nMoses Ibn Tibbon (who wrote in Provence in the period 1244–1261\nhis translations of Averroes’ summaries of Aristotle’s\nPhysics, De caelo, De generatione [critical edition:\nAverrois Cordubensis 1958], Meteorology, De anima, De sensu et\nsensato [critical edition: Averrois Cordubensis 1954],\nMetaphysics, as well as that of the “middle\ncommentary” on the De anima [critical edition: Ivry\n2003]), Solomon Ibn Ayyub (who wrote in Béziers in 1259 his\ntranslation of the “middle commentary” on the De\ncaelo), Shem Tov ben Isaac of Tortosa (who wrote around\n1255–1260 his translation of the “middle commentary”\non the De anima), Zerahyah Hen (who finished in Rome in 1284\nhis translation of the “middle commentaries” on the\nPhysics and the Metaphysics [critical edition: Zonta\n2011]), Jacob ben Makhir (who finished in Provence in 1289 his\ntranslation of the summaries of Porphyry’s Isagoge and\nAristotle’s Organon, including Rhetoric and\nPoetics, and translated in 1302 Averroes’ “middle\ncommentary” on Aristotle’s De partibus and De\ngeneratione animalium), Qalonymos ben Qalonymos (who translated\nin Arles in the period 1313–1317 the “middle\ncommentaries” on Aristotle’s Topics, Sophistical\nConfutations, Physics, De generatione [critical edition: Averrois\nCordubensis 1958], Meteorology, and Metaphysics [see\nZonta 2010 and 2011], as well as the “long commentaries”\non the Posterior Analytics, the Physics, and\npossibly on the Metaphysics too [about the last work,\nhowever, see Halper 2010 and 2013]), Samuel of Marseilles (who\ntranslated in Beaucaire in 1320–1322 the “middle\ncommentary” on the Nicomachean Ethics [critical\nedition: Berman 1999], as well as that on Plato’s\nRepublic [critical edition: Rosenthal 1956, 1966], and\nrevised the previous Arabic-to-Hebrew versions of Averroes’\nEpitome of the Organon and Middle Commentary on\nPorphyry's Isagoge), Moses of Salon (who translated around 1320\nthe “long commentary” on the Metaphysics,\npossibly employing Qalonymos’ previous translation), and Todros\nTodrosi (who translated in Trinquetaille in 1337 the “middle\ncommentaries” on Rhetoric and Poetics\n[critical editions: Goldenthal 1842, Lasinio 1872]). Also the first\npart of Averroes’ commentary on the De intellectu\nascribed to Alexander of Aphrodisias was translated into Hebrew\n(critical edition: Davidson 1988). Other philosophical works by\nAverroes are known through the Arabic-into-Hebrew versions made in the\n14th century: they include Averroes’ Questions on\nLogic (some of which were written by some Spanish Arabo-Islamic\nfollowers of him) and Questions on Physics (English\ntranslation: Goldstein 1990), the De substantia orbis (Fi\nl-jirm al-samawi) — which is lost in Arabic, but is\npreserved in an anonymous Medieval Hebrew translation published in a\ncritical edition by Arthur Hyman (Averroes 1986; about another aspect\nof the Medieval Hebrew tradition of this work, see Rigo 1992) —\nthe Epistle on the Possibility of the Conjunction of the\nIntellect — which is lost in Arabic, but is preserved in an\nanonymous Hebrew translation commented on by Moses Narboni (critical\nedition by Kalman P. Bland in Ibn Rushd 1982) — and the treatise\nOn the First Mover (Fi l-muharrik al-awwal) –\nwhich is lost in Arabic, and is preserved in some Medieval Hebrew\nquotations by Moses ha-Levi (see Wolfson 1950) and Shem Tov Ibn\nFalaquera. Moreover, Averroes’ defence of Aristotelian (and his\nown) philosophy against al-Ghazali’s attacks, The\nIncoherence of the Incoherence (Tahafut al-tahafut), was\nfirst employed as a major source for Falaquera’s Guide to\nthe Guide, and then translated twice into Hebrew in Provence\nbefore 1340, by an anonymous author (Moses Narboni?) and by Qalonymos\nben David Todrosi (maybe, a Jewish Averroist) – by the former\nfor defending Aristotelianism, and by the latter for showing its\ninternal contradictions (Steinschneider 1893, 332–337). Finally,\neven a very short work on the intellect by Averroes’ son, Abu\nMuhammad ‘Abdallah Ibn Rushd, was translated into Hebrew and\nmight have had some influence on Late Medieval Judaic thought (Burnett\nand Zonta 2000).\n\nAlmost all these works were quoted and commented on by a number of\n14th- and 15th-centuries Jewish philosophers (as for the important\ncase of Aristotle’s Physics, see Glasner 2011). More or\nless literal passages taken from the commentaries on Aristotle are\nfound in part one of Judah ben Solomon ha-Cohen’s encyclopedia,\nThe Learning of Science (Midrash ha-hokhmah),\nwritten in Judaeo-Arabic and then translated into Hebrew in the period\n1235–1247 (Fontaine 2000), and in Falaquera’s Opinions\nof the Philosophers (Harvey 2000). However, the influence of this\ncommentaries was widespread in Provence, in the first half of the\n14th century, when a number of supercommentaries on them\nwas written down. The famous Jewish philosopher and scientist Levi ben\nGershom (Gersonides, 1288–1344), active in Avignon and in other\nProvençal places from 1319 onwards, wrote a series of\nsupercommentaries on Averroes’ commentaries on Aristotle in the\nperiod 1320–1324; some of his “students” (S.\nha-Levi, Porfash, Solomon of Urgul, Vital), as well as the\nProvençal Jewish philosopher Yeda‘yah ha-Penini of\nBéziers (1280–1340 circa), followed his example (see\nGlasner 1995). Due to his innovative and sometimes critical approach\nto the study of Averroes’ Aristotelianism, Gersonides was surely\nthe most original 14th-century Jewish interpreter of\nAverroes’ philosophy; but he was not the only major one. A more\nfaithful approach to Averroes is found in Moses Narboni, who wrote a\nnumber of still unpublished commentaries on his works (not only\nsupercommentaries on his Aristotelian commentaries, but also\ncommentaries on some other philosophical texts by Averroes), and\nregarded him as the ideal interpreter of Aristotelianism. He affirmed\nthat there was no need to verify Aristotle’s teaching, since it\nwas surely true, as confirmed by Averroes’ assertion that\nAristotle had the first and the last word on everything.\n\nJewish Averroism, in the sense of a substantial agreement with\nAverroes’ interpretation of Aristotle’s works, continued\nin 15th-century Spain and Italy. For example, it was found\nin the philosophical supercommentaries on Averroes’\n“middle commentaries” on the Posterior Analytics\nand the Metaphysics written around 1450 by the Aragonese Jew\nAbraham Bibago, as well as in the works of a member of a family of\nSpanish Jewish philosophers, the Ibn Shem Tovs: Isaac ben Josef Ibn\nShem Tov, active in the period 1470–1490, wrote a series of\nsupercommentaries on Averroes’ commentaries on Aristotle’s\nPhysics (Wolfson 1929b). Evident traces of it can be found\nalso in Elijah Delmedigo (1460–1493), who praised Averroes as\nthe best philosopher after Aristotle and Alexander of Aphrodisias.\nHowever, in some cases it seems that this form of Averroism was\ncuriously influenced by some Latin Scholastic trends, like Thomism and\nLatin Averroism. This might have happened in the anonymous Hebrew\nsupercommentary on Averroes’ “middle commentary” on\nthe Nicomachean Ethics, probably written in Spain around\n1440, as well as in the works written by a 15th-century\nItalian author: Judah Messer Leon (1425–1498 circa), whose bulk\ncommentary on books one, two and three of Aristotle’s\nPhysics was explicitly based upon Averroes’\n“middle” and “long commentaries” on Aristotle,\nbut employed a lot of direct or indirect Scholastic sources (see Zonta\n2006b, 214–217). In other cases, some 15th-century\nSpanish Jewish philosophers even openly attacked Averroism as an\nold-fashioned trend: Eli Habillo did this around 1470, in introducing\nhis own translation of Antonius Andreas’ questions on\nAristotle’s Metaphysics.\n\nFinally, it should be noted that even some of Averroes’\n“religious” works were translated into Hebrew and employed\nas sources by some Jewish philosophers: the Decisive Treatise\n(Fasl al-maqal) (a critical edition of the Hebrew translation\nappeared in Golb 1956–1957), the Appendix\n(Damima) to it (see Vajda 1954), and the Disclosure of\nthe Proof Methods Concerning the Principles of Religion\n(Kashf fi manahig al-adilla fi ‘aqa’id al-milla)\n(see Di Donato 2006). All these works inspired some parts of\nFalaquera’s commentary on Maimonides’ Guide, as\nwell as his defence of philosophy in the Epistle of Debate for\nExplaining the Concordance between Religious Law and Science\n(Iggeret ha-wikkuah be-ve’ur ha-haskamah asher beyn ha-Torah\nwe-ha-hokhmah; critical edition: Harvey 1987); however, apart\nfrom this case, they seems to have had no extensive influence on Late\nMedieval Jewish philosophy.\n10. Fakhr al-din al-Razi and Sihab al-din al-Suhrawardi\n\nTwo Islamic authors pertaining to different ways of Islamic\nAvicennism, Fakhr al-din al-Razi (d. 1210) and Sihab al-din\nal-Suhrawardi (1155-1191), give evidence of having exerted their\n’influence’ over some Jewish philosophers, both in Europe\nand in the Near East.\n\nFakhr al-din al-Razi, a faithful follower and commentator of Avicenna\nand his works as an interpreter of Aristotle, was explicitely\nmentioned and employed as a source by three 14th-century\n“Jewish Avicennist” authors (see above, 5). Judah ben\nSolomon Natan mentioned al-Razi’s Oriental Researches\n(al-Mabahit al-mashriqiyya) as one of his reference points in\nthe introduction to his translation of al-Ghazali’s\nIntentions of the Philosophers. Todros Todrosi put some\npassages of the same work, which he personally translated from Arabic\ninto Hebrew, in the margin of his own translation of\npseudo-Farabi’s work, The Sources of Questions: they\nare al-Razi’s definition of the concept of\n“notification” or “definition”, and a\nmetaphysical passage about his “Avicennian” explanation of\nthe chain of the emanations of the intellects from the First\nIntellect, which Todros compares with a similar passage taken from\nAvicenna’s The Salvation. Moreover, in his\nphilosophical anthology Todros mentions other passages about logic\nallegedly taken from al-Razi, which have not yet been identified.\nFinally, Joseph Ibn Waqqar explicitely quotes two passages of\nal-Razi’s commentary on Avicenna’s Remarks and\nAdmonitions, the Core of the Remarks (Lubab\nal-isharat) (see Vajda 1962, 125-126).\n\nAs for Suhrawardi, one of the “mystical” Islamic\ninterpreters of Avicenna, he might have been inspired by some of the\nphilosophical ideas of Abu l-Barakat’s Book About the Point\nof View, in particular his idea about the angels (see Pines 1979,\n254–255), and was explicitly quoted by David ben Joshua\nMaimonides (see Fenton 1984, 36–37).\n11. Christian Arabic Authors\n\nSome Christian Arabic philosophers working in the 9th and\n10th centuries give evidence of having exerted their\n’influence’ upon Medieval Judaic thought. The first of\nthem was Abd al-Masih Ibn Na‘ima al-Himsi, a collaborator of\nal-Kindi: his famous Arabic philosophical work, the “shorter\nversion” of the Theology of Aristotle (a reworking of\nparts of books four, five, and six of Plotinus’\nEnneads), as well as other Arabic texts connected to it (the\nSayings of the Greek Sage, the De causis and\npseudo-Empedocles’ Book of the Five Substances), might\nhave exerted their direct influence over Solomon Ibn Gabirol, as\nsuggested by Jacques Schlanger (see Schlanger 1968, 52–109).\nMoreover, a “longer version” of the Theology of\nAristotle might have been written by a Judaeo-Arabic scholar in\n10th- or 11th-century Egypt: it was apparently\nquoted by Shem Tov Ibn Falaquera (Langermann 1999), who in any case\nknew and employed also the “shorter version” of it (Fenton\n1992), and was translated into Hebrew in the 16th century\nby Moses Arovas (about this translation, now lost, see Fenton 1986).\nFalaquera wrote also a summary of the Book of the Five\nSubstances (edited in Kaufmann 1899, 17–37), which proves\nto be useful for reconstructing the contents of the lost original text\n(see the French translation by Győngy Hegedüs in De Smet\n1998, 208–231). The main role in influencing Jewish philosophy\nwas played by the De causis, an Arabic work mixing up some\naspects of Plotinus’ and Proclus’ theology and probably\nwritten in the 9th century in al-Kindi’s circle by a\nstill unidentified author (a Christian-Arabic one?): it was translated\ninto Hebrew four times in the period 1260–1480, and exerted its\n‘influence’ over a number of Jewish philosophers (see\nRothschild 1985, 1994).\n\nAlso a minor philosophical work by a 9th-century Christian\nArabic author, the Book On the Difference between Spirit and\nSoul (Kitab al-fasl bayna l-ruh wa-l-nafs), was\ntranslated into Hebrew in the Middle Ages (Steinschneider 1893, 289):\nit was quoted by some Medieval Jewish authors. Finally, in the first\nhalf of the 10th century, in the circle of\nal-Farabi’s followers there was an “exchange of\nopinions” about some metaphysical doctrines: it involved the\nChristian Arabic philosopher Yahya Ibn ‘Adi and two minor Jewish\nscholars, Ibn Abi Sa‘id al-Mawsili and Bishr ibn Sam‘an\nibn ‘Irs, as shown by Shlomo Pines (Pines 1955).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abrahamov, B. (1995) “The Sources of the Book Mozney\nha-‘iyyunim le-sedeq ha-sar‘efim (in Hebrew),”\n<em>Daat</em>, 34: 83–86.",
                "Altmann, A. and S.M. Stern (1958) <em>Isaac Israeli. A Neoplatonic\nPhilosopher of the Early Tenth Century</em> (Oxford: Oxford University\nPress).",
                "Averroes (1986) <em>De Substantia Orbis: Critical Edition of the\nHebrew Text, With English Translation and Commentary</em>, ed. A.\nHyman (Cambridge, Mass. and Jerusalem: The Medieval Academy of America\nand Israel Academy of Arts and Sciences).",
                "Averrois Cordubensis (1954) <em>Compendia librorum Aristotelis qui\nParva naturalia vocantur</em>, ed. H. Blumberg (Cambridge, Mass.: The\nMedieval Academy of America).",
                "––– (1958) <em>Commentarium medium et Epitome in\nAristotelis De generatione et corruptione libros</em>, ed. S. Kurland\n(Cambridge, Mass.: The Medieval Academy of America).",
                "––– (1969) <em>Commentarium medium in Porphyrii\nIsagogen et Aristotelis Categorias</em>, ed. H. Davidson (Cambridge,\nMass. and Los Angeles: The Medieval Academy of America).",
                "Berman, L.V. (1974) “Maimonides, The Disciple of\nAlfarabi,” <em>Israel Oriental Studies</em>, 4:\n54–78.",
                "––– (1999) <em>Middle Commentary on\nAristotle’s Nicomachean Ethics in the Hebrew Version of Samuel\nben Judah</em> (Jerusalem: Israel Academy of Arts and Sciences).",
                "Blumenthal, D.R. (2007) “Hoter ben Shelomo and His\nWorldview,” in D.R. Blumenthal, <em>Philosophic Mysticism.\nStudies in Rational Religion</em> (Ramat Gan: Bar-Ilan University),\n155–171.",
                "Brague, R. (1996) <em>Maïmonide, Traité de\nlogique</em> (Paris: Desclée de Brouwer).",
                "Burnett, Ch. and M. Zonta (2000), “Abu Muhammad\n‘Abdallah Ibn Rusd (Averroes Junior), On Whether the Active\nIntellect Unites with the Material Intellect Whilst it is Clothed with\nthe Body,” <em>Archives d’histoire doctrinale et\nlittéraire du Moyen Age</em>, 67: 295–335.",
                "Carusi, P. (2000) “Il trattato alchemico Rutbat al-hakim.\nAlcune note sulla sua introduzione,” <em>Oriente Moderno</em>\n(n.s.), 80 (19): 491–502.",
                "Chiesa, B. (1986) “Note su al-Farabi, Averroè e Ibn\nBagga (Avempace) nella tradizione ebraica,” <em>Henoch</em>, 8:\n79–86.",
                "––– (1989) <em>Creazione e caduta\ndell’uomo nell’esegesi giudeo-araba medievale</em>\n(Brescia: Paideia).",
                "Chiesa B. and C. Rigo (1993) “La tradizione manoscritta del\nSefer ha-ma‘alot e una citazione ignorata della Risala fi\n‘ilm al-falsafa di al-Farabi,” <em>Sefarad</em>, 53:\n3–15.",
                "Davidson, H. (1988) “Averroes’ Commentary on <em>De\nintellectu</em> by Alexander of Aphrodisias (in Hebrew),”\n<em>Jerusalem Studies in Jewish Thought</em>, 7: 205–217.",
                "––– (2004) “Maimonides, Aristotle, and\nAvicenna,” in <em>De Zénon d’Elée à\nPoincaré</em>. <em>Recueil d’études en hommage\nà Roshdi Rashed</em>, ed. R. Morelon and A. Hasnawi (Louvain\nand Paris: Peeters), 719–734.",
                "––– (2005) <em>Moses Maimonides. The Man and His\nWorks</em> (Oxford and New York: Oxford University Press).",
                "––– (2011) <em>Maimonides the Rationalist</em>\n(Oxford: The Littman Library of Jewish Civilization).",
                "De Smet, D. (1998) <em>Empedocles Arabus. Une lecture\nnéoplatonicienne tardive</em> (Brussels: Koninkljike Accademie\nvoor Wetenschappen, Letteren en Schone Kunsten van Belgie).",
                "Di Donato, S. (2006) “La trasmissione del Kitab al-kasf\n‘an manahig al-adilla fi ‘aqa’id al-milla: gli\nindizi delle diverse tradizioni del trattato nella traduzione\nebraica,” paper read at the 14th Annual Symposium of the\nSociété Internationale pour l’Etude de la\nPhilosophie Médiévale <em>Averroès,\nl’averroïsme, l’antiaverroïsme</em>\n(Genève, October 4<sup>th</sup>-6<sup>th</sup>, 2006).",
                "Dobbs-Weinstein, I. (2002) “Maimonides’ Reticence\nTowards Ibn Sina,” in <em>Avicenna and His Heritage</em>, ed. J.\nJanssens and D. De Smet (Leuven: Leuven University Press),\n281–296.",
                "Efros, I. (1935) “Palquera’s Reshit Hokmah and\nAlfarabi’s Ihsa’ al-‘Ulum,” <em>The Jewish\nQuarterly Review</em> (n.s.), 25: 227–235.",
                "Eisenmann, E. (2000) “Ahavah ba-Ta‘anugim: A\nFourteenth-Century Encyclopedia of Science and Theology,” in\n<em>The Medieval Hebrew Encyclopedias of Science and Philosophy</em>,\ned. S. Harvey (Dordrecht, Boston and London: Kluwer),\n429–440.",
                "Eran, A. (1998) <em>From Simple Faith to Sublime Faith. Ibn\nDaud’s Pre-Maimonidean Thought</em> (in Hebrew) (Hakibbutz\nHameuhad).",
                "––– (2001) “Al-Ghazali and Maimonides On\nthe World to Come and Spiritual Pleasures,” <em>Jewish Studies\nQuarterly</em>, 8: 137–166.",
                "Fenton, P. (1976) “Gleanings from Moseh Ibn\n‘Ezras’ Maqalat al-Hadiqa,” <em>Sefarad</em>, 36:\n285–298.",
                "––– (1984) “The Literary Legacy of David\nben Joshua Maimonides, Last of the Maimonidean\n<em>Negidim</em>,” <em>The Jewish Quarterly Review</em> (n.s.),\n75: 1–56.",
                "––– (1986) “The Arabic and Hebrew Versions\nof the Theology of Aristotle,” in <em>Pseudo-Aristotle in the\nMiddle Ages. The Theology and Other Texts</em>, ed. Jill Kraye,\nWilliam F. Ryan and Charles B. Schmitt (London: The Warburg\nInstitute), 241–264.",
                "––– (1992) “Shem Tov Ibn Falaquera and the\n‘Theology of Aristotle’ (in Hebrew),” <em>Daat</em>,\n29: 27–39.",
                "––– (1997) <em>Philosophie et\nexégèse dans</em> Le Jardin de la métaphore\n<em>de Moïse Ibn ‘Ezra, philosophe et poète andalou\ndu XIIe siècle</em> (Leiden: Brill).",
                "Fontaine, R. (1995) <em>Otot ha-shamayim. Samuel Ibn\nTibbon’s Hebrew Version of Aristotle’s Meteorology</em>\n(Leiden: Brill).",
                "––– (2000) “Judah ben Solomon\nha-Cohen’s Midrash ha-Hokhmah: Its Sources and Use of\nSources,” in <em>The Medieval Hebrew Encyclopedias of Science\nand Philosophy</em>, ed. S. Harvey (Dordrecht, Boston and London:\nKluwer), 191–210.",
                "Freudenthal, G. (2003) “Ketav ha-da‘at or Sefer\nha-Sekhel we-ha-muskalot: The Medieval Hebrew Translations of\nal-Farabi’s Risalah fî’l-‘aql. A Study in Text\nHistory and in the Evolution of Medieval Hebrew Philosophical\nTerminology,” <em>The Jewish Quarterly Review</em> (n.s.), 93:\n29–115.",
                "––– (2011a) “The Assimilation of\nGreco-Arabic Learning by Medieval Jewish Cultures: A Brief\nBibliographic Introduction,‘ in <em>Science in Medieval Jewish\nCultures</em>, ed. G. Freudenthal (Cambridge: Cambridge University\nPress), 13–16.",
                "––– (2011b) “Arabic and Latin Cultures as\nResources for the Hebrew Translation Movement: Comparative\nConsiderations, Both Quantitative and Qualitative,‘ in\n<em>Science in Medieval Jewish Cultures</em>, ed. G. Freudenthal\n(Cambridge: Cambridge University Press), 74–105.",
                "Freudenthal, G. and M. Zonta (2012) “Avicenna Among Medieval\nJews. The Reception of Avicenna’s Philosophical, Scientific and\nMedical Writings in Jewish Cultures, East and West,” <em>Arabic\nSciences and Philosophy</em>, 22: 217–287.",
                "Glasner, R. (1995) “Levi ben Gershom and the Study of Ibn\nRushd in the Fourteenth Century,” <em>The Jewish Quarterly\nReview</em> (n.s.), 86: 51–90.",
                "––– (1996) “The Hebrew Version of De celo\net mundo Attributed to Ibn Sina,” <em>Arabic Sciences and\nPhilosophy</em>, 6: 89–112.",
                "––– (2002) “On Gersonides’ Knowledge\nof Languages,” <em>Aleph</em>, 2, 235–257.",
                "––– (2011) “The Evolution of the Genre of\nPhilosophical-Scientific Commentary: Hebrew Supercommentaries on\nAristotle’s Physics,‘ in <em>Science in Medieval Jewish\nCultures</em>, ed. G. Freudenthal (Cambridge: Cambridge University\nPress), 182–206.",
                "Golb, N. (1956–1957) “The Hebrew Translation of\nAverroes’ Fasl al-Maqal,” <em>Proceedings of the American\nAcademy for Jewish Research</em>, 25: 91–113; 26:\n41–64.",
                "Goldenthal, J. (1842) <em>Be’ur Even Rushd le-Sefer\nha-halasah le-Aristu</em> (Leipzig: H. Franke).",
                "Goldstein, H.T. (1990) <em>Averroes’ Questions in\nPhysics</em> (Dordrecht: Springer).",
                "Halper, Y. (2010) <em>Averroes on Metaphysical Terminology. An\nAnalysis and Critical Edition of the Long Commentary on\nAristotle’s Metaphysics Delta</em>, Ph. D. Thesis, 2 vols.,\nBar-Ilan University of Ramat-Gan.",
                "––– (2013) “Revision and Standardization\nof Hebrew Philosophical Terminology in the Fourteenth Century: The\nExample of Averroes’ Long Commentary on Aristotle’s\nMetaphysics D,” <em>Aleph</em>, 13: 95–137.",
                "Harvey, S. (1987) <em>Falaquera’s Epistle of the Debate. An\nIntroduction to Jewish Philosophy</em> (Cambridge, Mass.: Harvard\nUniversity Center for Jewish Studies).",
                "––– (1992) “Did Maimonides’ Letter\nto Samuel Ibn Tibbon Determine Which Philosophers Would Be Studied by\nLater Jewish Thinkers?,” <em>The Jewish Quarterly Review</em>\n(n.s.), 83: 51–70.",
                "––– (2000) “Shem-Tov Ibn Falaquera’s\nDe‘ot ha-Filosofim: Its Sources and Use of Sources,” in\n<em>The Medieval Hebrew Encyclopedias of Science and Philosophy</em>,\nS. Harvey (ed.), Dordrecht, Boston and London: Kluwer,\n211–247.",
                "––– (2001) “Why did Fourteenth-Century\nJews Turn to Alghazali’s Account of Natural Science?,”\n<em>The Jewish Quarterly Review</em> (n.s.), 91: 359–376.",
                "––– (2002) “Falaquera’s Alfarabi. An\nExample of the Judaization of the Islamic Falasifah,”\n<em>Trumah</em>, 12: 97–112.",
                "––– (2009) “Avicenna’s Influence on\nJewish Thought: Some Reflections,” <em>Avicenna and his Legacy:\nA Golden Age of Science and Philosophy</em>, ed. Y. T. Langermann\n(Turnhout: Brepols), 327–340.",
                "Hayoun, M.-R. (1987) “Moses of Narbonne and Ibn Bajja (I):\nthe edition of the Hebrew translation of the Regimen of the Solitary\nMan (in Hebrew),” <em>Daat</em>, 18: 27–44.",
                "––– (1990a) “Ibn Bajja et Moïse de\nNarbonne: édition de l’Iggeret ha-Petirah,” in\n<em>Alei Shefer. Studies in the Literature of Jewish Thought</em>, ed.\nM. Hallamish (Ramat Gan: Bar-Ilan University Press), 75-93.",
                "––– (1990b), “Moses of Narbonne and Ibn\nBajja (II): the Hebrew version of the Epistle of Farewell (in\nHebrew),” <em>Daat</em>, 25: 93–125.",
                "––– (2002) “Moses Narbonis Kommentar zum\nHayy ibn Yaqzan des ibn Tufayl,” <em>Trumah</em>, 12:\n199–204, and Hebrew section.",
                "Heller-Wilensky, S.O. (1967) “Isaac Ibn Latif –\nPhilosopher or Kabbalist?,” in <em>Jewish</em> <em>Medieval</em>\n<em>and</em> <em>Renaissance</em> <em>Studies</em>, ed. A. Altmann\n(Cambridge, Mass.: Harvard University Press), 185–223.",
                "Horovitz, S. (1903) <em>Der</em> <em>Mikrokosmos der Josef Ibn\nSaddik</em> (Breslau: Schatzky).",
                "Ibn Rushd (1982) <em>The Epistle on the Possibility of Conjunction\nwith the Active Intellect, with the Commentary of Moses Narboni</em>,\ned. K.P. Bland (New York: Ktav Publishing House).",
                "Ivry, A.L. (2003) <em>The Commentary of Averroes on\nAristotle’s De Anima in the Hebrew Translation of Moses b.\nSamuel Ibn Tibbon</em> (in Hebrew) (Jerusalem: Israel Academy of Arts\nand Sciences).",
                "Jospe, R. (1994) “Torah and Astrology According to Abraham\nIbn Ezra (in Hebrew),” <em>Daat</em>, 32/33: 31–52.",
                "Judah Halevi (1977) <em>Kitab al-radd wa ’l-dalil fi\n’l-din al-dhalil</em>, ed. D.H. Baneth (Jerusalem: Magnes).",
                "Kaufmann, D. (1880) <em>Die Spuren al-Batlajusi’s in der\njuedischen Religionsphilosophie</em> (Budapest: Jahresbericht des\nLandes-Rabbinerschule in Budapest).",
                "––– (1899) <em>Studien ueber Salomon ibn\nGabirol</em> (Budapest: Jahresbericht des Landes-Rabbinerschule in\nBudapest).",
                "Kiener, R. (1984) “Jewish Isma’ilism in Twelfth\nCentury Yemen,” <em>The Jewish Quarterly Review</em> (n.s.), 74:\n249–266.",
                "Klugman-Barkan, R. (1971) <em>Shem Tob ben Joseph Ibn\nFalaquera’s “Sori Yagon” or “Balm for\nAssuaging Grief”. Its Literary Sources and Traditions</em>,\nPh.D. Thesis, Columbia University (Ann Arbour, Michigan: Xerox\nUniversity Microfilms).",
                "Langermann, Y.T. (1996) <em>Yemenite Midrash. Philosophical\nCommentaries on the Torah</em> (San Francisco: Harper).",
                "––– (1999) “A New Hebrew Passage from the\n”Theology of Aristotle“ and Its Significance,”\n<em>Arabic Sciences and Philosophy</em>, 9: 247–259.",
                "Lasinio, F. (1872) <em>Il commento medio di Averroè alla\nPoetica di Aristotele</em> (Pisa: Annali delle Università\nToscane).",
                "Levin, I. (1983) <em>Igeret Hay ben Mekitz by Abraham Ibn Ezra. A\nCritical Edition Supplemented with a Hebrew Translation of the Arabic\nOriginal Hay Ibn Yaqizian by Abu Abi Alhusain Ibn Abdalla Ibn\nSina</em> (in Hebrew) (Tel Aviv: Katz Institute for the Study of\nHebrew Literature, Tel Aviv University).",
                "Lévy, T. (1996) “L’histoire des nombres\namiables: le témoignage des textes hébreux\nmédievaux,” <em>Arabic Sciences and Philosophy</em>, 6:\n63–87.",
                "Mahdi, M. (1962) <em>Alfarabi’s Philosophy of Plato and\nAristotle</em> (New York: The Free Press of Glencoe).",
                "Marx, A. (1934–1935) “Texts By and About\nMaimonides,” <em>The Jewish Quarterly Review</em> (n.s.), 25:\n371–428.",
                "Moses Maimonides (1963) <em>The Guide of the Perplexed</em>, tr.\nS. Pines, 2 vols. (Chicago: University of Chicago Press).",
                "Pessin, S. (2007) “The Influence of Islamic Thought on\nMaimonides,” in <em>Stanford Encyclopedia of Philosophy</em>,\nSummer 2007 Edition, Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2007/entries/maimonides-islamic/\">https://plato.stanford.edu/archives/sum2007/entries/maimonides-islamic/</a>&gt;.",
                "––– (2013) <em>Ibn Gabirol’s Theology of\nDesire. Matter and Method in Jewish Medieval Neoplatonism</em>\n(Cambridge: Cambridge University Press).",
                "Pines, S. (1955) “A Tenth Century Philosophical\nCorrespondence,” <em>Proceedings of the American Academy for\nJewish Research</em>, 24: 103–136.",
                "––– (1971) “Avicenna,” in\n<em>Encyclopaedia Judaica</em> (Jerusalem: Keter), 3:\n955–960.",
                "––– (1979) <em>Studies in Abu ’l-Barakat\nal-Baghdadi Physics and Metaphysics</em> (Leiden and Jerusalem: Brill\nand Magnes Press).",
                "––– (1980) “Shi‘ite Terms and\nConceptions in Judah Halevi’s Kuzari,” <em>Jerusalem\nStudies in Arabic and Islam</em>, 2: 165–251.",
                "Plessner, M. (1956) “The Importance of R. Shem Tov Ibn\nFalaquera for the Study of the History of Philosophy (in\nHebrew),” in <em>Homenaje à Millas-Vallicrosa</em>, vol.\nII (Barcelona: Consejo Superior de Investigaciones Cientificas),\n161–186.",
                "Richler, B. (1977) “Identification of the Anonymous\nTranslation of the Book of Intellectual Circles (in Hebrew),”\n<em>Kiryath sepher</em>, 53: 577.",
                "Rigo, C. (1992) <em>Il De substantia orbis di Averroè:\nedizione della traduzione latino-ebraica con commento di Yehudah b.\nMosheh Romano</em>, Ph.D. Thesis, 2 vols. (Università di\nTorino).",
                "Ritter, H. and R. Walzer (1938 [1943]) “Studi su al-Kindi\nII. Uno scritto morale inedito di al-Kindi (Temistio\n<em>Perì</em> <em>alypìas</em>?),” <em>Memorie\ndella Reale Accademia Nazionale dei Lincei, Classe di Scienze\nMorali</em>, s. VI, vol. 8, 1–63.",
                "Robinson, J. (2009) “Samuel Ibn Tibbon’s <em>Perush\nha-Millot ha-Zarot</em> and al-Farabi’s <em>Eisagoge</em> and\n<em>Categories</em>,” <em>Aleph</em>, 9 (1): 41–76.",
                "Rosenthal, E.I.J. (1956) <em>Averroes’ Commentary on\nPlato’s Republic</em> (Cambridge: Cambridge University Press).\nSecond revised edition: 1966.",
                "Rothschild, J.-P. (1985) <em>Les traductions\nhébraïques du</em> Liberde causis <em>latin</em>, Ph.D.\nThesis, 2 vols. (Université de Paris).",
                "––– (1994) “Les traductions du <em>Livre\ndes causes</em> et leur copies,” <em>Revue d’histoire des\ntextes</em>, 24: 393–484.",
                "Schlanger, J. (1968) <em>La philosophie de Salomon Ibn\nGabirol</em> (Leiden: Brill).",
                "Schwartz, D. (1995) “Chapters on the Doctrine of the\nDivinities by the Circle of the Commentators on the Kuzari in Provence\n(in Hebrew),” <em>Tarbiz</em>, 64: 401–421.",
                "––– (1996) <em>Old Things in a New Bottle. The\nSpeculative Doctrine of the Neoplatonic Circle in\n14<sup>th</sup>-Century Jewish Philosophy</em> (in Hebrew) (Jerusalem:\nMossad Bialik and Ben Tzvi Institute).",
                "Shem Tov Ibn Falaquera (2001) <em>Moreh ha-Moreh</em>, ed. Y.\nShiffman (Jerusalem: The World Union of Jewish Studies).",
                "Shiloah, A. (1968) “Falaquera’s Sources in the Chapter\non Music in the Seeker (in Hebrew),” in <em>Papers of the Fourth\nWorld Congress of Jewish Studies</em> (Jerusalem: The World Union of\nJewish Studies), 2: 373–377.",
                "Szpiech, R. (2010) “In Search of Ibn Sina’s\n”Oriental Philosophy“ in Medieval Castile,” in\n<em>Arabic Sciences and Philosophy</em>, 20: 185–206.",
                "Steinschneider, M. (1893) <em>Die hebraeischen Uebersetzungen des\nMittelalters und die Juden als Dolmetscher</em> (Berlin:\nKommissionsverlag des Bibliographischen Bureaus).",
                "Strauss, L. (1936) “Eine vermisste Schrift Farabis,”\n<em>Monatschrift zur Geschichte und Wissenschaft des Judentums</em>,\n80: 96–106.",
                "Stroumsa, S. (1990) “A Note on Maimonides Attitude to Joseph\nIbn Saddiq (in Hebrew),” <em>Jerusalem Studies in Jewish\nThought</em>, 9: 33–38.",
                "Vajda, G. (1938) “Abraham bar Hiyya et al-Farabi,”\n<em>Revue des études juives</em>, 104: 113–119.",
                "––– (1941–1945) “Etudes sur\nQirqisani,” <em>Revue des études juives</em>, 106:\n87–123.",
                "––– (1947) <em>La théologie\nascétique de Bahya Ibn Paquda</em> (Paris: Imprimérie\nnationale).",
                "––– (1948) “Un champion de\nl’avicennisme. Le problème de l’identité de\nDieu et du premier moteur d’après un opuscule\njudéo-arabe inédit du XIIIe siècle,”\n<em>Revue thomiste</em>, 56: 480–508.",
                "––– (1949) “La philosophie et la\nthéologie de Joseph Ibn Çaddiq,” <em>Archives\nd’histoire doctrinale et littéraire du Moyen Age</em>,\n17: 93–181.",
                "––– (1954) “Les deux versions\nhébraïques de la dissertation d’Averroès sur\nla science divine,” <em>Revue des études juives</em>,\n113: 63–66.",
                "––– (1960) <em>Isaac Albalag, averroïste\njuif, traducteur et annotateur d’al-Ghazali</em> (Paris:\nVrin).",
                "––– (1962) <em>Recherches sur la philosophie et\nla kabbale dans la pensée juive du Moyen Age</em> (Paris and La\nHaye: Mouton).",
                "––– (1965) “A propos d’une citation\nnon identifiée d’Al-Farabi dans la Guide des\négarés,” <em>Journal Asiatique</em>, 254:\n43–50.",
                "––– (1977) “La question disputée de\nl’essence et de l’existence vue par Juda Cohen, philosophe\njuif de Provence,” <em>Archives d’histoire doctrinale et\nlittéraire du Moyen Age</em>, 44: 127–147.",
                "Wolfson, H.A. (1929a) <em>Crescas’ Critique of\nAristotle</em> (Cambridge, Mass.: Harvard University Press).",
                "––– (1929b) “Isaac Ibn Shem-Tov Unknown\nCommentaries on the Physics and His Other Unknown Works,” in\n<em>Studies in Jewish Bibliography and Related Subjects in Memory of\nA.S. Freidus</em> (New York: The Alexander Kohut Memorial Foundation),\n279–290.",
                "––– (1935) “The Internal Senses in Arabic,\nLatin, and Hebrew Philosophic Texts,” <em>Harvard Theological\nReview</em>, 28: 69–133.",
                "––– (1950) “Averroes’ Lost Treatise\non the Prime Mover,” <em>Hebrew Union College Annual</em>, 23:\n683–710.",
                "Yishaq Albalag (1973) <em>Sefer tiqqun ha-de‘ot</em>, ed. G.\nVajda (Jerusalem: Israel Academy of Arts and Sciences).",
                "Zonta, M. (1996) <em>La filosofia antica nel Medioevo ebraico</em>\n(Brescia: Paideia).",
                "––– (1997a) “Linee del pensiero islamico\nnella storia della filosofia ebraica medievale,” <em>Annali\ndell’Istituto Orientale di Napoli</em>, 57: 101–144,\n450–483.",
                "––– (1997b) “Fonti antiche e medievali\ndella logica ebraica nella Provenza del Trecento,”\n<em>Medioevo</em>, 23: 515–594.",
                "––– (2006a) “Al-Farabi’s Long\nCommentary on Aristotle’s Categoriae in Hebrew and Arabic: a\ncritical edition and English translation of the newly-found extant\nfragments,” in <em>Studies in Arabic and Islamic Culture</em>,\ned. B. Abrahamov, vol. II (Ramat Gan: Bar-Ilan University Press),\n185–254.",
                "––– (2006b) <em>Hebrew Scholasticism in the\nFifteenth Century. A History and Source Book</em> (Dordrecht:\nSpringer).",
                "––– (2010) “The Revisions of Qalonymos ben\nQalonymos’s Medieval Hebrew Version of Averroes’s Middle\nCommentary on Aristotle’s Metaphysics,” <em>Documenti e\nstudi sulla tradizione filosofica medievale</em>, 21:\n457–473.",
                "––– (2011a) <em>Il Commento medio di Averroè\nalla Metafisica di Aristotele nella tradizione ebraica. Edizione delle\nversioni ebraiche medievali di Zerahyah Hen e di Qalonymos ben\nQalonymos con introduzione storica e filologica</em>, 3 vols. (Pavia:\nPavia University Press).",
                "––– (2011b) “Medieval Hebrew Translations\nof Philosophical and Scientific Texts: A Chronological Table,‘\nin <em>Science in Medieval Jewish Cultures</em>, ed. G. Freudenthal\n(Cambridge: Cambridge University Press), 17–73.",
                "––– (2011c) “Arabic Philosophical Texts,\nJewish Translations of,‘ in <em>Encyclopedia of Medieval\nPhilosophy. Between 500 and 1500,</em> ed. H. Lagerlund (Dordrecht:\nSpringer), 1: 84–88."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Abrahamov, B. (1995) “The Sources of the Book Mozney\nha-‘iyyunim le-sedeq ha-sar‘efim (in Hebrew),”\n<em>Daat</em>, 34: 83–86.</li>\n<li>Altmann, A. and S.M. Stern (1958) <em>Isaac Israeli. A Neoplatonic\nPhilosopher of the Early Tenth Century</em> (Oxford: Oxford University\nPress).</li>\n<li>Averroes (1986) <em>De Substantia Orbis: Critical Edition of the\nHebrew Text, With English Translation and Commentary</em>, ed. A.\nHyman (Cambridge, Mass. and Jerusalem: The Medieval Academy of America\nand Israel Academy of Arts and Sciences).</li>\n<li>Averrois Cordubensis (1954) <em>Compendia librorum Aristotelis qui\nParva naturalia vocantur</em>, ed. H. Blumberg (Cambridge, Mass.: The\nMedieval Academy of America).</li>\n<li>––– (1958) <em>Commentarium medium et Epitome in\nAristotelis De generatione et corruptione libros</em>, ed. S. Kurland\n(Cambridge, Mass.: The Medieval Academy of America).</li>\n<li>––– (1969) <em>Commentarium medium in Porphyrii\nIsagogen et Aristotelis Categorias</em>, ed. H. Davidson (Cambridge,\nMass. and Los Angeles: The Medieval Academy of America).</li>\n<li>Berman, L.V. (1974) “Maimonides, The Disciple of\nAlfarabi,” <em>Israel Oriental Studies</em>, 4:\n54–78.</li>\n<li>––– (1999) <em>Middle Commentary on\nAristotle’s Nicomachean Ethics in the Hebrew Version of Samuel\nben Judah</em> (Jerusalem: Israel Academy of Arts and Sciences).</li>\n<li>Blumenthal, D.R. (2007) “Hoter ben Shelomo and His\nWorldview,” in D.R. Blumenthal, <em>Philosophic Mysticism.\nStudies in Rational Religion</em> (Ramat Gan: Bar-Ilan University),\n155–171.</li>\n<li>Brague, R. (1996) <em>Maïmonide, Traité de\nlogique</em> (Paris: Desclée de Brouwer).</li>\n<li>Burnett, Ch. and M. Zonta (2000), “Abu Muhammad\n‘Abdallah Ibn Rusd (Averroes Junior), On Whether the Active\nIntellect Unites with the Material Intellect Whilst it is Clothed with\nthe Body,” <em>Archives d’histoire doctrinale et\nlittéraire du Moyen Age</em>, 67: 295–335.</li>\n<li>Carusi, P. (2000) “Il trattato alchemico Rutbat al-hakim.\nAlcune note sulla sua introduzione,” <em>Oriente Moderno</em>\n(n.s.), 80 (19): 491–502.</li>\n<li>Chiesa, B. (1986) “Note su al-Farabi, Averroè e Ibn\nBagga (Avempace) nella tradizione ebraica,” <em>Henoch</em>, 8:\n79–86.</li>\n<li>––– (1989) <em>Creazione e caduta\ndell’uomo nell’esegesi giudeo-araba medievale</em>\n(Brescia: Paideia).</li>\n<li>Chiesa B. and C. Rigo (1993) “La tradizione manoscritta del\nSefer ha-ma‘alot e una citazione ignorata della Risala fi\n‘ilm al-falsafa di al-Farabi,” <em>Sefarad</em>, 53:\n3–15.</li>\n<li>Davidson, H. (1988) “Averroes’ Commentary on <em>De\nintellectu</em> by Alexander of Aphrodisias (in Hebrew),”\n<em>Jerusalem Studies in Jewish Thought</em>, 7: 205–217.</li>\n<li>––– (2004) “Maimonides, Aristotle, and\nAvicenna,” in <em>De Zénon d’Elée à\nPoincaré</em>. <em>Recueil d’études en hommage\nà Roshdi Rashed</em>, ed. R. Morelon and A. Hasnawi (Louvain\nand Paris: Peeters), 719–734.</li>\n<li>––– (2005) <em>Moses Maimonides. The Man and His\nWorks</em> (Oxford and New York: Oxford University Press).</li>\n<li>––– (2011) <em>Maimonides the Rationalist</em>\n(Oxford: The Littman Library of Jewish Civilization).</li>\n<li>De Smet, D. (1998) <em>Empedocles Arabus. Une lecture\nnéoplatonicienne tardive</em> (Brussels: Koninkljike Accademie\nvoor Wetenschappen, Letteren en Schone Kunsten van Belgie).</li>\n<li>Di Donato, S. (2006) “La trasmissione del Kitab al-kasf\n‘an manahig al-adilla fi ‘aqa’id al-milla: gli\nindizi delle diverse tradizioni del trattato nella traduzione\nebraica,” paper read at the 14th Annual Symposium of the\nSociété Internationale pour l’Etude de la\nPhilosophie Médiévale <em>Averroès,\nl’averroïsme, l’antiaverroïsme</em>\n(Genève, October 4<sup>th</sup>-6<sup>th</sup>, 2006).</li>\n<li>Dobbs-Weinstein, I. (2002) “Maimonides’ Reticence\nTowards Ibn Sina,” in <em>Avicenna and His Heritage</em>, ed. J.\nJanssens and D. De Smet (Leuven: Leuven University Press),\n281–296.</li>\n<li>Efros, I. (1935) “Palquera’s Reshit Hokmah and\nAlfarabi’s Ihsa’ al-‘Ulum,” <em>The Jewish\nQuarterly Review</em> (n.s.), 25: 227–235.</li>\n<li>Eisenmann, E. (2000) “Ahavah ba-Ta‘anugim: A\nFourteenth-Century Encyclopedia of Science and Theology,” in\n<em>The Medieval Hebrew Encyclopedias of Science and Philosophy</em>,\ned. S. Harvey (Dordrecht, Boston and London: Kluwer),\n429–440.</li>\n<li>Eran, A. (1998) <em>From Simple Faith to Sublime Faith. Ibn\nDaud’s Pre-Maimonidean Thought</em> (in Hebrew) (Hakibbutz\nHameuhad).</li>\n<li>––– (2001) “Al-Ghazali and Maimonides On\nthe World to Come and Spiritual Pleasures,” <em>Jewish Studies\nQuarterly</em>, 8: 137–166.</li>\n<li>Fenton, P. (1976) “Gleanings from Moseh Ibn\n‘Ezras’ Maqalat al-Hadiqa,” <em>Sefarad</em>, 36:\n285–298.</li>\n<li>––– (1984) “The Literary Legacy of David\nben Joshua Maimonides, Last of the Maimonidean\n<em>Negidim</em>,” <em>The Jewish Quarterly Review</em> (n.s.),\n75: 1–56.</li>\n<li>––– (1986) “The Arabic and Hebrew Versions\nof the Theology of Aristotle,” in <em>Pseudo-Aristotle in the\nMiddle Ages. The Theology and Other Texts</em>, ed. Jill Kraye,\nWilliam F. Ryan and Charles B. Schmitt (London: The Warburg\nInstitute), 241–264.</li>\n<li>––– (1992) “Shem Tov Ibn Falaquera and the\n‘Theology of Aristotle’ (in Hebrew),” <em>Daat</em>,\n29: 27–39.</li>\n<li>––– (1997) <em>Philosophie et\nexégèse dans</em> Le Jardin de la métaphore\n<em>de Moïse Ibn ‘Ezra, philosophe et poète andalou\ndu XIIe siècle</em> (Leiden: Brill).</li>\n<li>Fontaine, R. (1995) <em>Otot ha-shamayim. Samuel Ibn\nTibbon’s Hebrew Version of Aristotle’s Meteorology</em>\n(Leiden: Brill).</li>\n<li>––– (2000) “Judah ben Solomon\nha-Cohen’s Midrash ha-Hokhmah: Its Sources and Use of\nSources,” in <em>The Medieval Hebrew Encyclopedias of Science\nand Philosophy</em>, ed. S. Harvey (Dordrecht, Boston and London:\nKluwer), 191–210.</li>\n<li>Freudenthal, G. (2003) “Ketav ha-da‘at or Sefer\nha-Sekhel we-ha-muskalot: The Medieval Hebrew Translations of\nal-Farabi’s Risalah fî’l-‘aql. A Study in Text\nHistory and in the Evolution of Medieval Hebrew Philosophical\nTerminology,” <em>The Jewish Quarterly Review</em> (n.s.), 93:\n29–115.</li>\n<li>––– (2011a) “The Assimilation of\nGreco-Arabic Learning by Medieval Jewish Cultures: A Brief\nBibliographic Introduction,‘ in <em>Science in Medieval Jewish\nCultures</em>, ed. G. Freudenthal (Cambridge: Cambridge University\nPress), 13–16.</li>\n<li>––– (2011b) “Arabic and Latin Cultures as\nResources for the Hebrew Translation Movement: Comparative\nConsiderations, Both Quantitative and Qualitative,‘ in\n<em>Science in Medieval Jewish Cultures</em>, ed. G. Freudenthal\n(Cambridge: Cambridge University Press), 74–105.</li>\n<li>Freudenthal, G. and M. Zonta (2012) “Avicenna Among Medieval\nJews. The Reception of Avicenna’s Philosophical, Scientific and\nMedical Writings in Jewish Cultures, East and West,” <em>Arabic\nSciences and Philosophy</em>, 22: 217–287.</li>\n<li>Glasner, R. (1995) “Levi ben Gershom and the Study of Ibn\nRushd in the Fourteenth Century,” <em>The Jewish Quarterly\nReview</em> (n.s.), 86: 51–90.</li>\n<li>––– (1996) “The Hebrew Version of De celo\net mundo Attributed to Ibn Sina,” <em>Arabic Sciences and\nPhilosophy</em>, 6: 89–112.</li>\n<li>––– (2002) “On Gersonides’ Knowledge\nof Languages,” <em>Aleph</em>, 2, 235–257.</li>\n<li>––– (2011) “The Evolution of the Genre of\nPhilosophical-Scientific Commentary: Hebrew Supercommentaries on\nAristotle’s Physics,‘ in <em>Science in Medieval Jewish\nCultures</em>, ed. G. Freudenthal (Cambridge: Cambridge University\nPress), 182–206.</li>\n<li>Golb, N. (1956–1957) “The Hebrew Translation of\nAverroes’ Fasl al-Maqal,” <em>Proceedings of the American\nAcademy for Jewish Research</em>, 25: 91–113; 26:\n41–64.</li>\n<li>Goldenthal, J. (1842) <em>Be’ur Even Rushd le-Sefer\nha-halasah le-Aristu</em> (Leipzig: H. Franke).</li>\n<li>Goldstein, H.T. (1990) <em>Averroes’ Questions in\nPhysics</em> (Dordrecht: Springer).</li>\n<li>Halper, Y. (2010) <em>Averroes on Metaphysical Terminology. An\nAnalysis and Critical Edition of the Long Commentary on\nAristotle’s Metaphysics Delta</em>, Ph. D. Thesis, 2 vols.,\nBar-Ilan University of Ramat-Gan.</li>\n<li>––– (2013) “Revision and Standardization\nof Hebrew Philosophical Terminology in the Fourteenth Century: The\nExample of Averroes’ Long Commentary on Aristotle’s\nMetaphysics D,” <em>Aleph</em>, 13: 95–137.</li>\n<li>Harvey, S. (1987) <em>Falaquera’s Epistle of the Debate. An\nIntroduction to Jewish Philosophy</em> (Cambridge, Mass.: Harvard\nUniversity Center for Jewish Studies).</li>\n<li>––– (1992) “Did Maimonides’ Letter\nto Samuel Ibn Tibbon Determine Which Philosophers Would Be Studied by\nLater Jewish Thinkers?,” <em>The Jewish Quarterly Review</em>\n(n.s.), 83: 51–70.</li>\n<li>––– (2000) “Shem-Tov Ibn Falaquera’s\nDe‘ot ha-Filosofim: Its Sources and Use of Sources,” in\n<em>The Medieval Hebrew Encyclopedias of Science and Philosophy</em>,\nS. Harvey (ed.), Dordrecht, Boston and London: Kluwer,\n211–247.</li>\n<li>––– (2001) “Why did Fourteenth-Century\nJews Turn to Alghazali’s Account of Natural Science?,”\n<em>The Jewish Quarterly Review</em> (n.s.), 91: 359–376.</li>\n<li>––– (2002) “Falaquera’s Alfarabi. An\nExample of the Judaization of the Islamic Falasifah,”\n<em>Trumah</em>, 12: 97–112.</li>\n<li>––– (2009) “Avicenna’s Influence on\nJewish Thought: Some Reflections,” <em>Avicenna and his Legacy:\nA Golden Age of Science and Philosophy</em>, ed. Y. T. Langermann\n(Turnhout: Brepols), 327–340.</li>\n<li>Hayoun, M.-R. (1987) “Moses of Narbonne and Ibn Bajja (I):\nthe edition of the Hebrew translation of the Regimen of the Solitary\nMan (in Hebrew),” <em>Daat</em>, 18: 27–44.</li>\n<li>––– (1990a) “Ibn Bajja et Moïse de\nNarbonne: édition de l’Iggeret ha-Petirah,” in\n<em>Alei Shefer. Studies in the Literature of Jewish Thought</em>, ed.\nM. Hallamish (Ramat Gan: Bar-Ilan University Press), 75-93.</li>\n<li>––– (1990b), “Moses of Narbonne and Ibn\nBajja (II): the Hebrew version of the Epistle of Farewell (in\nHebrew),” <em>Daat</em>, 25: 93–125.</li>\n<li>––– (2002) “Moses Narbonis Kommentar zum\nHayy ibn Yaqzan des ibn Tufayl,” <em>Trumah</em>, 12:\n199–204, and Hebrew section.</li>\n<li>Heller-Wilensky, S.O. (1967) “Isaac Ibn Latif –\nPhilosopher or Kabbalist?,” in <em>Jewish</em> <em>Medieval</em>\n<em>and</em> <em>Renaissance</em> <em>Studies</em>, ed. A. Altmann\n(Cambridge, Mass.: Harvard University Press), 185–223.</li>\n<li>Horovitz, S. (1903) <em>Der</em> <em>Mikrokosmos der Josef Ibn\nSaddik</em> (Breslau: Schatzky).</li>\n<li>Ibn Rushd (1982) <em>The Epistle on the Possibility of Conjunction\nwith the Active Intellect, with the Commentary of Moses Narboni</em>,\ned. K.P. Bland (New York: Ktav Publishing House).</li>\n<li>Ivry, A.L. (2003) <em>The Commentary of Averroes on\nAristotle’s De Anima in the Hebrew Translation of Moses b.\nSamuel Ibn Tibbon</em> (in Hebrew) (Jerusalem: Israel Academy of Arts\nand Sciences).</li>\n<li>Jospe, R. (1994) “Torah and Astrology According to Abraham\nIbn Ezra (in Hebrew),” <em>Daat</em>, 32/33: 31–52.</li>\n<li>Judah Halevi (1977) <em>Kitab al-radd wa ’l-dalil fi\n’l-din al-dhalil</em>, ed. D.H. Baneth (Jerusalem: Magnes).</li>\n<li>Kaufmann, D. (1880) <em>Die Spuren al-Batlajusi’s in der\njuedischen Religionsphilosophie</em> (Budapest: Jahresbericht des\nLandes-Rabbinerschule in Budapest).</li>\n<li>––– (1899) <em>Studien ueber Salomon ibn\nGabirol</em> (Budapest: Jahresbericht des Landes-Rabbinerschule in\nBudapest).</li>\n<li>Kiener, R. (1984) “Jewish Isma’ilism in Twelfth\nCentury Yemen,” <em>The Jewish Quarterly Review</em> (n.s.), 74:\n249–266.</li>\n<li>Klugman-Barkan, R. (1971) <em>Shem Tob ben Joseph Ibn\nFalaquera’s “Sori Yagon” or “Balm for\nAssuaging Grief”. Its Literary Sources and Traditions</em>,\nPh.D. Thesis, Columbia University (Ann Arbour, Michigan: Xerox\nUniversity Microfilms).</li>\n<li>Langermann, Y.T. (1996) <em>Yemenite Midrash. Philosophical\nCommentaries on the Torah</em> (San Francisco: Harper).</li>\n<li>––– (1999) “A New Hebrew Passage from the\n”Theology of Aristotle“ and Its Significance,”\n<em>Arabic Sciences and Philosophy</em>, 9: 247–259.</li>\n<li>Lasinio, F. (1872) <em>Il commento medio di Averroè alla\nPoetica di Aristotele</em> (Pisa: Annali delle Università\nToscane).</li>\n<li>Levin, I. (1983) <em>Igeret Hay ben Mekitz by Abraham Ibn Ezra. A\nCritical Edition Supplemented with a Hebrew Translation of the Arabic\nOriginal Hay Ibn Yaqizian by Abu Abi Alhusain Ibn Abdalla Ibn\nSina</em> (in Hebrew) (Tel Aviv: Katz Institute for the Study of\nHebrew Literature, Tel Aviv University).</li>\n<li>Lévy, T. (1996) “L’histoire des nombres\namiables: le témoignage des textes hébreux\nmédievaux,” <em>Arabic Sciences and Philosophy</em>, 6:\n63–87.</li>\n<li>Mahdi, M. (1962) <em>Alfarabi’s Philosophy of Plato and\nAristotle</em> (New York: The Free Press of Glencoe).</li>\n<li>Marx, A. (1934–1935) “Texts By and About\nMaimonides,” <em>The Jewish Quarterly Review</em> (n.s.), 25:\n371–428.</li>\n<li>Moses Maimonides (1963) <em>The Guide of the Perplexed</em>, tr.\nS. Pines, 2 vols. (Chicago: University of Chicago Press).</li>\n<li>Pessin, S. (2007) “The Influence of Islamic Thought on\nMaimonides,” in <em>Stanford Encyclopedia of Philosophy</em>,\nSummer 2007 Edition, Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2007/entries/maimonides-islamic/\">https://plato.stanford.edu/archives/sum2007/entries/maimonides-islamic/</a>&gt;.</li>\n<li>––– (2013) <em>Ibn Gabirol’s Theology of\nDesire. Matter and Method in Jewish Medieval Neoplatonism</em>\n(Cambridge: Cambridge University Press).</li>\n<li>Pines, S. (1955) “A Tenth Century Philosophical\nCorrespondence,” <em>Proceedings of the American Academy for\nJewish Research</em>, 24: 103–136.</li>\n<li>––– (1971) “Avicenna,” in\n<em>Encyclopaedia Judaica</em> (Jerusalem: Keter), 3:\n955–960.</li>\n<li>––– (1979) <em>Studies in Abu ’l-Barakat\nal-Baghdadi Physics and Metaphysics</em> (Leiden and Jerusalem: Brill\nand Magnes Press).</li>\n<li>––– (1980) “Shi‘ite Terms and\nConceptions in Judah Halevi’s Kuzari,” <em>Jerusalem\nStudies in Arabic and Islam</em>, 2: 165–251.</li>\n<li>Plessner, M. (1956) “The Importance of R. Shem Tov Ibn\nFalaquera for the Study of the History of Philosophy (in\nHebrew),” in <em>Homenaje à Millas-Vallicrosa</em>, vol.\nII (Barcelona: Consejo Superior de Investigaciones Cientificas),\n161–186.</li>\n<li>Richler, B. (1977) “Identification of the Anonymous\nTranslation of the Book of Intellectual Circles (in Hebrew),”\n<em>Kiryath sepher</em>, 53: 577.</li>\n<li>Rigo, C. (1992) <em>Il De substantia orbis di Averroè:\nedizione della traduzione latino-ebraica con commento di Yehudah b.\nMosheh Romano</em>, Ph.D. Thesis, 2 vols. (Università di\nTorino).</li>\n<li>Ritter, H. and R. Walzer (1938 [1943]) “Studi su al-Kindi\nII. Uno scritto morale inedito di al-Kindi (Temistio\n<em>Perì</em> <em>alypìas</em>?),” <em>Memorie\ndella Reale Accademia Nazionale dei Lincei, Classe di Scienze\nMorali</em>, s. VI, vol. 8, 1–63.</li>\n<li>Robinson, J. (2009) “Samuel Ibn Tibbon’s <em>Perush\nha-Millot ha-Zarot</em> and al-Farabi’s <em>Eisagoge</em> and\n<em>Categories</em>,” <em>Aleph</em>, 9 (1): 41–76.</li>\n<li>Rosenthal, E.I.J. (1956) <em>Averroes’ Commentary on\nPlato’s Republic</em> (Cambridge: Cambridge University Press).\nSecond revised edition: 1966.</li>\n<li>Rothschild, J.-P. (1985) <em>Les traductions\nhébraïques du</em> Liberde causis <em>latin</em>, Ph.D.\nThesis, 2 vols. (Université de Paris).</li>\n<li>––– (1994) “Les traductions du <em>Livre\ndes causes</em> et leur copies,” <em>Revue d’histoire des\ntextes</em>, 24: 393–484.</li>\n<li>Schlanger, J. (1968) <em>La philosophie de Salomon Ibn\nGabirol</em> (Leiden: Brill).</li>\n<li>Schwartz, D. (1995) “Chapters on the Doctrine of the\nDivinities by the Circle of the Commentators on the Kuzari in Provence\n(in Hebrew),” <em>Tarbiz</em>, 64: 401–421.</li>\n<li>––– (1996) <em>Old Things in a New Bottle. The\nSpeculative Doctrine of the Neoplatonic Circle in\n14<sup>th</sup>-Century Jewish Philosophy</em> (in Hebrew) (Jerusalem:\nMossad Bialik and Ben Tzvi Institute).</li>\n<li>Shem Tov Ibn Falaquera (2001) <em>Moreh ha-Moreh</em>, ed. Y.\nShiffman (Jerusalem: The World Union of Jewish Studies).</li>\n<li>Shiloah, A. (1968) “Falaquera’s Sources in the Chapter\non Music in the Seeker (in Hebrew),” in <em>Papers of the Fourth\nWorld Congress of Jewish Studies</em> (Jerusalem: The World Union of\nJewish Studies), 2: 373–377.</li>\n<li>Szpiech, R. (2010) “In Search of Ibn Sina’s\n”Oriental Philosophy“ in Medieval Castile,” in\n<em>Arabic Sciences and Philosophy</em>, 20: 185–206.</li>\n<li>Steinschneider, M. (1893) <em>Die hebraeischen Uebersetzungen des\nMittelalters und die Juden als Dolmetscher</em> (Berlin:\nKommissionsverlag des Bibliographischen Bureaus).</li>\n<li>Strauss, L. (1936) “Eine vermisste Schrift Farabis,”\n<em>Monatschrift zur Geschichte und Wissenschaft des Judentums</em>,\n80: 96–106.</li>\n<li>Stroumsa, S. (1990) “A Note on Maimonides Attitude to Joseph\nIbn Saddiq (in Hebrew),” <em>Jerusalem Studies in Jewish\nThought</em>, 9: 33–38.</li>\n<li>Vajda, G. (1938) “Abraham bar Hiyya et al-Farabi,”\n<em>Revue des études juives</em>, 104: 113–119.</li>\n<li>––– (1941–1945) “Etudes sur\nQirqisani,” <em>Revue des études juives</em>, 106:\n87–123.</li>\n<li>––– (1947) <em>La théologie\nascétique de Bahya Ibn Paquda</em> (Paris: Imprimérie\nnationale).</li>\n<li>––– (1948) “Un champion de\nl’avicennisme. Le problème de l’identité de\nDieu et du premier moteur d’après un opuscule\njudéo-arabe inédit du XIIIe siècle,”\n<em>Revue thomiste</em>, 56: 480–508.</li>\n<li>––– (1949) “La philosophie et la\nthéologie de Joseph Ibn Çaddiq,” <em>Archives\nd’histoire doctrinale et littéraire du Moyen Age</em>,\n17: 93–181.</li>\n<li>––– (1954) “Les deux versions\nhébraïques de la dissertation d’Averroès sur\nla science divine,” <em>Revue des études juives</em>,\n113: 63–66.</li>\n<li>––– (1960) <em>Isaac Albalag, averroïste\njuif, traducteur et annotateur d’al-Ghazali</em> (Paris:\nVrin).</li>\n<li>––– (1962) <em>Recherches sur la philosophie et\nla kabbale dans la pensée juive du Moyen Age</em> (Paris and La\nHaye: Mouton).</li>\n<li>––– (1965) “A propos d’une citation\nnon identifiée d’Al-Farabi dans la Guide des\négarés,” <em>Journal Asiatique</em>, 254:\n43–50.</li>\n<li>––– (1977) “La question disputée de\nl’essence et de l’existence vue par Juda Cohen, philosophe\njuif de Provence,” <em>Archives d’histoire doctrinale et\nlittéraire du Moyen Age</em>, 44: 127–147.</li>\n<li>Wolfson, H.A. (1929a) <em>Crescas’ Critique of\nAristotle</em> (Cambridge, Mass.: Harvard University Press).</li>\n<li>––– (1929b) “Isaac Ibn Shem-Tov Unknown\nCommentaries on the Physics and His Other Unknown Works,” in\n<em>Studies in Jewish Bibliography and Related Subjects in Memory of\nA.S. Freidus</em> (New York: The Alexander Kohut Memorial Foundation),\n279–290.</li>\n<li>––– (1935) “The Internal Senses in Arabic,\nLatin, and Hebrew Philosophic Texts,” <em>Harvard Theological\nReview</em>, 28: 69–133.</li>\n<li>––– (1950) “Averroes’ Lost Treatise\non the Prime Mover,” <em>Hebrew Union College Annual</em>, 23:\n683–710.</li>\n<li>Yishaq Albalag (1973) <em>Sefer tiqqun ha-de‘ot</em>, ed. G.\nVajda (Jerusalem: Israel Academy of Arts and Sciences).</li>\n<li>Zonta, M. (1996) <em>La filosofia antica nel Medioevo ebraico</em>\n(Brescia: Paideia).</li>\n<li>––– (1997a) “Linee del pensiero islamico\nnella storia della filosofia ebraica medievale,” <em>Annali\ndell’Istituto Orientale di Napoli</em>, 57: 101–144,\n450–483.</li>\n<li>––– (1997b) “Fonti antiche e medievali\ndella logica ebraica nella Provenza del Trecento,”\n<em>Medioevo</em>, 23: 515–594.</li>\n<li>––– (2006a) “Al-Farabi’s Long\nCommentary on Aristotle’s Categoriae in Hebrew and Arabic: a\ncritical edition and English translation of the newly-found extant\nfragments,” in <em>Studies in Arabic and Islamic Culture</em>,\ned. B. Abrahamov, vol. II (Ramat Gan: Bar-Ilan University Press),\n185–254.</li>\n<li>––– (2006b) <em>Hebrew Scholasticism in the\nFifteenth Century. A History and Source Book</em> (Dordrecht:\nSpringer).</li>\n<li>––– (2010) “The Revisions of Qalonymos ben\nQalonymos’s Medieval Hebrew Version of Averroes’s Middle\nCommentary on Aristotle’s Metaphysics,” <em>Documenti e\nstudi sulla tradizione filosofica medievale</em>, 21:\n457–473.</li>\n<li>––– (2011a) <em>Il Commento medio di Averroè\nalla Metafisica di Aristotele nella tradizione ebraica. Edizione delle\nversioni ebraiche medievali di Zerahyah Hen e di Qalonymos ben\nQalonymos con introduzione storica e filologica</em>, 3 vols. (Pavia:\nPavia University Press).</li>\n<li>––– (2011b) “Medieval Hebrew Translations\nof Philosophical and Scientific Texts: A Chronological Table,‘\nin <em>Science in Medieval Jewish Cultures</em>, ed. G. Freudenthal\n(Cambridge: Cambridge University Press), 17–73.</li>\n<li>––– (2011c) “Arabic Philosophical Texts,\nJewish Translations of,‘ in <em>Encyclopedia of Medieval\nPhilosophy. Between 500 and 1500,</em> ed. H. Lagerlund (Dordrecht:\nSpringer), 1: 84–88.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Abner of Burgos",
            "al-Farabi",
            "al-Ghazali",
            "al-Kindi",
            "Crescas, Hasdai",
            "Delmedigo, Elijah",
            "Falaquera, Shem Tov Ibn",
            "Gersonides",
            "Halevi, Judah",
            "Ibn Bâjja [Avempace]",
            "Ibn Daud, Abraham",
            "Ibn Ezra, Abraham",
            "Ibn Gabirol, Solomon [Avicebron]",
            "Ibn Rushd [Averroes]",
            "Ibn Sina [Avicenna]",
            "Ikhwân al-Safâ’",
            "Israeli, Isaac",
            "Maimonides",
            "Maimonides: the influence of Islamic thought on",
            "Theology of Aristotle",
            "Tibbon, Samuel Ibn"
        ],
        "entry_link": [
            {
                "../abner-burgos/": "Abner of Burgos"
            },
            {
                "../al-farabi/": "al-Farabi"
            },
            {
                "../al-ghazali/": "al-Ghazali"
            },
            {
                "../al-kindi/": "al-Kindi"
            },
            {
                "../crescas/": "Crescas, Hasdai"
            },
            {
                "../delmedigo/": "Delmedigo, Elijah"
            },
            {
                "../falaquera/": "Falaquera, Shem Tov Ibn"
            },
            {
                "../gersonides/": "Gersonides"
            },
            {
                "../halevi/": "Halevi, Judah"
            },
            {
                "../ibn-bajja/": "Ibn Bâjja [Avempace]"
            },
            {
                "../abraham-daud/": "Ibn Daud, Abraham"
            },
            {
                "../ibn-ezra/": "Ibn Ezra, Abraham"
            },
            {
                "../ibn-gabirol/": "Ibn Gabirol, Solomon [Avicebron]"
            },
            {
                "../ibn-rushd/": "Ibn Rushd [Averroes]"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            },
            {
                "../ikhwan-al-safa/": "Ikhwân al-Safâ’"
            },
            {
                "../israeli/": "Israeli, Isaac"
            },
            {
                "../maimonides/": "Maimonides"
            },
            {
                "../maimonides-islamic/": "Maimonides: the influence of Islamic thought on"
            },
            {
                "../theology-aristotle/": "Theology of Aristotle"
            },
            {
                "../tibbon/": "Tibbon, Samuel Ibn"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arabic-islamic-judaic\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/arabic-islamic-judaic/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=arabic-islamic-judaic&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/arabic-islamic-judaic/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arabic-islamic-judaic": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/arabic-islamic-judaic/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=arabic-islamic-judaic&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/arabic-islamic-judaic/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.muslimphilosophy.com/\" target=\"other\">Islamic Philosophy Online</a>"
        ],
        "listed_links": [
            {
                "http://www.muslimphilosophy.com/": "Islamic Philosophy Online"
            }
        ]
    }
}