{
    "url": "arnauld",
    "title": "Antoine Arnauld",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Elmar Kremer\n<elmar.kremer@utoronto.ca>",
        "author_links": [
            {
                "mailto:elmar%2ekremer%40utoronto%2eca": "elmar.kremer@utoronto.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nElmar Kremer\n&lt;<a href=\"mailto:elmar%2ekremer%40utoronto%2eca\"><em>elmar<abbr title=\" dot \">.</abbr>kremer<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Jan 27, 2007",
        "substantive revision Fri Nov 5, 2021"
    ],
    "preamble": "\n\nAntoine Arnauld (1612–1694) was a powerful figure in the\nintellectual life of seventeenth-century Europe. He had a long and\nhighly controversial career as a theologian, and was an able and\ninfluential philosopher. His writings were published and widely read\nover a period of more than fifty years and were assembled in\n1775–1782 in forty-two large folio volumes.\n\nEvaluations of Arnauld’s work as a theologian vary. Ian Hacking,\nfor example, says that Arnauld was “perhaps the most brilliant\ntheologian of his time” (Hacking 1975a, 25). Ronald Knox, on the\nother hand, says, “It was the fashion among the Jansenists to\nrepresent Antoine Arnauld as a great theologian; he should be\nremembered, rather as a great controversialist… A theologian by\ntrade, Arnauld was a barrister by instinct” (Knox 1950, 196). It\nis agreed on all sides, however, that Arnauld was acute and learned in\ntheology as well as in philosophy.\n\nArnauld was an important participant in the philosophical debates of\nhis century, and carried out famous intellectual exchanges with\nDescartes, Malebranche, and Leibniz. In addition, the Port-Royal\nLogic, l’Art de penser, which he co-authored with\nPierre Nicole, was a standard text in the field for two centuries.\nLess attention has been paid to Arnauld’s lifelong efforts to\nreconcile the doctrine of grâce efficace par\nelle-même with freedom of will, though they have many\nconnections with the debate about determinism and free will that\ncontinues to this day.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Works"
        },
        {
            "#ArnDisBetThe": "2. Arnauld on the Distinction between Philosophy and Theology"
        },
        {
            "#ArnCar": "3. Arnauld’s Cartesianism"
        },
        {
            "#PhiMet": "3.1 Philosophical method"
        },
        {
            "#ArnIdenIde": "3.2 Arnauld’s identification of ideas with perceptions, a new interpretation"
        },
        {
            "#MinBodDua": "3.3 Mind-body dualism"
        },
        {
            "#CreEteTru": "3.4 The Creation of the eternal truths"
        },
        {
            "#AreGodActRea": "3.5 Are God’s actions reeasonable?"
        },
        {
            "#ArnMal": "4. Arnauld and Malebranche"
        },
        {
            "#MalPosTreNatGra": "4.1 Malebranche’s position in the Treatise of Nature and Grace"
        },
        {
            "#TwoTheArnCriTreNatGra": "4.2 Two themes in Arnauld’s criticism of the Treatise of Nature and Grace"
        },
        {
            "#DoeGodActOnlGenVol": "4.3 Does God act only by general volitions?"
        },
        {
            "#ArnCriMalOcc": "4.4 Arnauld’s criticism of Malebranche’s occasionalism"
        },
        {
            "#ArnLei": "5. Arnauld and Leibniz"
        },
        {
            "#LeibNotiIndi": "5.1 Leibniz’s notion of an individual substance"
        },
        {
            "#ArnaCritLeib": "5.2 Arnauld’s criticism of Leibniz’s modal metaphysics; Arnauld’s alternative"
        },
        {
            "#ArnCom": "6. Arnauld’s Compatibilism"
        },
        {
            "#ConDeAuxSevCenConAboGra": "6.1 The Congregationes de Auxiliis and seventeenth-century controversy about grace"
        },
        {
            "#BanJanArnNatEffActGraWil": "6.2 Bañez, Jansen, and Arnauld on the nature of efficacious actual grace of the will"
        },
        {
            "#LimArnCom": "6.3 The limits of Arnauld’s compatibilism"
        },
        {
            "#ArnLatPosNatFreWil": "6.4 Arnauld’s late position on the nature of free will"
        },
        {
            "#AdvArnClaForHisNewTheOveJanThe": "6.5 The advantages Arnauld claims for his new theory over Jansen’s theory"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ArnWor": "Arnauld’s Works"
        },
        {
            "#RelEarModWor": "Related Early Modern Works"
        },
        {
            "#SecWorCit": "Secondary Works Cited"
        },
        {
            "#OthRecSecWor": "Other Recommended Secondary Works"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nAntoine Arnauld was born in Paris on February 6, 1612, the twentieth\nand last child of an important French family. He is often referred to\nin the French literature as Le Grand Arnauld. Another famous\nmember of the family was his sister, Mère Angélique\nArnauld. Installed by her wealthy and powerful father as abbess of the\nconvent of Port-Royal in 1602 at the age of eleven, she later reformed\nthe convent and it became a center of intense religious life. Several\nof Arnauld’s sisters were nuns at Port-Royal, where his mother\njoined them after the death of his father in 1621.\n\nThe young Antoine attended the Collège de\nCalvi-Sorbonne, where one of his fellow students was his nephew,\nIsaac Lemaître de Sacy. Arnauld went on to study philosophy at\nthe Collège de Lisieux, and then decided to follow in\nhis father’s steps as a lawyer. However, under the influence of\nhis mother and her confessor, Jean Duvergier, the abbé de\nSaint-Cyran¸ he changed his mind and began studies in\ntheology in 1633.\n\nAbout 1640, he joined a small group of solitaires who lived\nin the countryside near Port-Royal and were associated with the\nconvent. They included Pierre Nicole, Claude Launcelot, and Sacy. The\nsolitaires initiated the petites écoles de\nPort-Royal which continued in various locations from the late\n1630s until 1660. Their students included the dramatist Jean Racine.\nLater on, Arnauld cooperated with Sacy in the first important French\ntranslation of the\n Bible.[1]\n He also co-authored the Grammaire générale et\nraisonnée with Lancelot and La Logique ou l’Art\nde penser (hereinafter Logic), with Nicole. All of these\ncollaborative projects had their origins in the petites\nécoles. Blaise Pascal was closely associated with the\nsolitaires beginning in 1655.\n\nThe year 1641 was an eventful one for Arnauld. He was ordained a\npriest on September 21. During the year, he completed the\n“Fourth Objections” to Descartes’\nMeditations and wrote De la Fréquente\ncommunion (published in 1643). The first work established his\nreputation as a philosopher. The second went through many editions and\nhad an effect on Catholic sacramental practice up to the end of the\nnineteenth century. Jansen’s Augustinus was also\npublished in Paris in 1641, having been published posthumously in the\nNetherlands a year earlier. It was attacked by the official theologian\nof Paris, Isaac Habert, who preached a series of sermons against\nJansen in the cathedral of Paris during Lent, 1643. Arnauld, who had\narrived at an interpretation of Augustine similar to, though not\nidentical with, that of Jansen, undertook, at the request of\nSaint-Cyran, to defend Jansen against the accusation of heresy. This\nhe did in his Première Apologie pour Jansénius,\n1644, and Seconde Apologie, 1645. Although Arnauld did not\nagree with important details of Jansen’s view, he continued to\ndefend Jansen against the charge of heresy off and on for the rest of\nhis life.\n\nIn 1653 the famous five propositions attributed to Jansen were\ndeclared to be heretical by Pope Innocent X in the Constitution\n“Cum Occasione.” Arnauld and most of the\nPort-Royal group claimed that the five propositions, although\nheretical on their most likely interpretation, were not in fact in\nJansen’s work. The dispute led to Arnauld’s expulsion from\nthe Sorbonne after a celebrated trial, which lasted from December 1,\n1655 to January 30, 1656. Pascal came to Arnauld’s defense with\nthe Provincial Letters, published in installments from\nJanuary 23, 1656 to May, 1657. The dispute lasted until 1669, when the\nFrench bishops who supported Arnauld worked out a compromise with Pope\nClement IX, and Arnauld enjoyed almost a decade in the good graces of\nboth the court and the Pope. During this time, Arnauld wrote\nvoluminously on the Eucharist, but he also found time to co-author the\nPort-Royal Grammar and Logic, and to write his\nNouveaux éléments de géométrie.\nHowever, in the late 1670s, the attacks on Port-Royal by civil and\nreligious authorities resumed, and in 1679 Arnauld fled to the\nNetherlands, where he remained until his death, in Liège, on\nAugust 8, 1694.\n\nThe last fifteen years of Arnauld’s life, spent in self-imposed\nexile, were among his most fruitful in philosophy. During this period,\nhe carried on his debates with Malebranche and Leibniz, and also\nreexamined his position on human free will. Arnauld’s published\ncriticism of Malebranche began in 1683 with On True and False\nIdeas (hereinafter Ideas). But the central topic of the\nexchange was Malebranche’s use of occasionalism to explain how\nit is that not all human beings are saved. Arnauld provided a\nsystematic criticism of that position in the three volumes of\nRéflexions philosophiques et théologiques sur le\nnouveau système de la nature et de la grâce\n(hereinafter Réflexions), published in 1685 and 1686.\nArnauld’s famous correspondence with Leibniz was initiated by\nLeibniz in 1686, when he sent Arnauld the section headings of his\nprojected Discourse on Metaphysics.\n2. Arnauld on the Distinction between Philosophy and Theology\n\nArnauld considered it important to be clear about the distinction\nbetween philosophy and theology. This concern is present in his work\nfrom the beginning, in 1641, to the end of his published writings.\nThus, he divides the “Fourth Objections” to\nDescartes’ Meditations into “the possible\nphilosophical objections regarding the major issues of the nature of\nour mind and of God” and “the problems which a theologian\nmight come up against in the work as a whole”\n(Descartes, 2:169). One of Arnauld’s criticisms of\nMalebranche is that he does not establish many of the principles in\nhis system of nature and grace either by the proper methods of\nphilosophy or of theology. Again, in Règles du bon\nsens, written the year before his death, Arnauld warns,\n\nBe very careful about the nature of the question in dispute, whether\nit is philosophical or theological. For if it is theological, it must\nbe decided principally by authority, whereas if it is philosophical,\nit must be decided principally by\n reason.[2]\n\n\nAccording to Arnauld, the chief purpose of theology is to defend the\ntruths revealed by God through Sacred Scripture and the teaching\ntradition of the Church. Part of the ceremony in which he received the\ndoctorate in theology from the Sorbonne was a vow, made before the\naltar of the Holy Martyrs, “that we will give our life before\nleaving the truth undefended.” In the speech he gave on that\noccasion, Arnauld emphasized the vow, which he said was instituted\nbecause\n\nthe obligation to defend the truth with force and courage is so\nindispensable in a theologian that those whose courage in this regard\ncould weaken, should be committed to it by the holiness and piety of a\nsolemn public vow (Traduction du Discours latin prononcé\npar M. Arnauld en recevant le Bonnet de Docteur, OA, 43:12).\n\n\nThis intense religious commitment to his role as a theologian\ncontinued throughout his life. Combined with his combative\npersonality, it helps to explain the passion with which he defended\nindividual theologians, especially Saint-Cyran and Jansen, as well as\nwhat he took to be the truths of revelation.\n\nRegarding philosophy, Arnauld, like Descartes, held that its purpose\nwas to acquire useful knowledge through reason. That reason ought to\nbe employed only in the pursuit of useful knowledge is emphasized in\nthe opening pages of the Logic. Arnauld and Nicole say that\n“speculative sciences, such as geometry, astronomy, and\nphysics” can be used as instruments for perfecting judgment and\nreason. This provides a use for some of the “nooks and\ncrannies” of those sciences, which would otherwise be\n“completely worthless.” They go on to say,\n\nPeople are not born to spend their time measuring lines, examining the\nrelations between angles, or contemplating different motions of\nmatter. The mind is too large, life too short, time too precious to\noccupy oneself with such trivial objects. But they are obligated to be\njust, fair, and judicious in all their speech, their actions, and the\nbusiness they conduct. Above all they ought to train and educate\nthemselves for this (Logic, 5).\n\n\nArnauld did not think, however, that philosophical sciences are useful\nonly as instruments for acquiring virtues. Natural philosophy or\nphysics can be made to serve the good of human life in many ways and\neven metaphysics is useful in that it can help the theologian in the\ntask of defending the truth.\n\nAn outstanding example of that sort of usefulness, in Arnauld’s\nview, was Descartes’ argument for the distinction of the soul or\nmind from the body. Arnauld refers to Descartes as a “Christian\nphilosopher,” echoing Descartes’ own use of the phrase in\nthe letter dedicating the Meditations on First Philosophy to\nthe Faculty of Theology of the Sorbonne, where Descartes says that he\ncarried out the injunction of the Fourth Lateran Council\n(1512–17) that “Christian philosophers” should try\nto prove the immateriality of the soul (Descartes, 2:4).\n\nThe authorities most often cited by Arnauld are Augustine and Aquinas\nin theology, and Augustine, Aquinas, and Descartes in philosophy.\nArnauld’s attitude toward these predecessors is complex. From\nthe outset of his published work in philosophy, he claimed that\nAugustinian themes were present in Descartes. However, in his late\nwork, beginning with On True and False Ideas in 1683, he\nbegan to cite Aquinas frequently, as well as Augustine, both in\nphilosophy and theology. Thus, in the 181 folio pages of\nIdeas, which Arnauld describes as dealing with a purely\nphilosophical topic, he cites Augustine twenty times and Aquinas six\ntimes, always claiming that they agree with Descartes and with his own\nposition. Similarly, in the theological part of\nRéflexions, Arnauld relies heavily on Aquinas’s\nChristology while arguing that Malebranche’s theodicy leads him\ninto heterodox, if not downright heretical, positions (OA\n39:777). Again, in his late work on the problem of human free will and\ngrâce efficace par elle-même, Arnauld took over\nwhat he says is the Thomistic position that the will is free when it\nis a potestas ou facultas ad opposita. And in the controversy\nwith Nicole and others over Nicole’s theory of a grâce\ngénérale, Arnauld relied heavily on Aquinas’s\naccount of cognition. So frequently did Arnauld rely on Thomistic\nformulations in his late work that his friends reproached him for\n“abandoning Augustine in order to follow Aquinas, thus\npreferring the disciple to the master” (Règles du bon\nsens, OA, 10:154). This reproach had to do directly with\nArnauld’s rejection of the “Platonism” in Augustine\nand Jansen. But as shown below, Arnauld, late in his career, also\nparted company with Augustine and Jansen on the nature of human free\nwill, and with Jansen’s account of the nature of actual\ngrace.\n\nArnauld had a scholarly knowledge of the history of philosophy and\ntheology, and was certainly aware of the important differences among\nAugustine, Aquinas, and Descartes on such issues as the role of sense\nperception in human knowledge, the relation of the mind to the body,\nand the nature of human freedom. But Arnauld wanted to emphasize the\ncontinuity of Descartes with the Christian past. Arnauld feared that\nDescartes’ philosophy would be made into a weapon against the\nChristian tradition. Emphasizing those elements in Descartes’\nphilosophy that are in continuity with Augustine and Aquinas was part\nof Arnauld’s effort to make of Cartesianism an ally, rather than\nan enemy, of the faith.\n3. Arnauld’s Cartesianism\n\nUnlike Saint-Cyran, Jansen, and most of the Port-royalists, Arnauld\nhad a positive appreciation of philosophy, and a lively interest in\nthe subject (See Nadler 1989, 18 ff.). His philosophy is typically,\nand correctly, classified as Cartesian. Indeed, Leibniz said, in 1691,\nthat Arnauld had been “in all ways for Descartes for a long\n time.”[3]\n Arnauld enthusiastically endorsed Descartes’ physics and the\napproach to mind-body dualism to which it gave rise. He also adopted\nsome parts of Descartes’ views on philosophical method.\n\nArnauld’s Descartes, however, is unlike the Descartes who is\nseen as the father of the enlightenment and who anticipated many of\nthe preoccupations of recent analytical philosophy. Arnauld claims to\nset forth the gist of Descartes’ philosophy, but he did not\nhesitate to replace parts of Descartes’ philosophy with\ndifferent though related propositions, especially when doing so made\nDescartes a more reliable ally in what Arnauld took to be his primary\ntask, to defend the truths of the faith.\n3.1 Philosophical method\n\nIn the Fourth Part of the Logic, “On Method,”\nArnauld and Nicole present an account of the distinction between\nanalysis and synthesis that they say is taken from a manuscript of\nDescartes lent to them by Clerselier. What they present is a free\ntranslation of Rule Thirteen of the Rules for the Direction of the\nMind. They then paraphrase the four rules given by Descartes in\nPart Two of the Discourse on the Method, saying that although\nthe rules are “often difficult to follow,” yet “it\nis always helpful to bear them in mind, and to heed them as much as\npossible whenever we try to find the truth by means of reason”\n(Logic, 234–39). But Arnauld developed the Cartesian\nposition on philosophical method in a distinctive way. In particular,\nhe reshaped the notion of an idea, of a confused idea, of a clear and\ndistinct idea, and of methodic doubt.\n\nAn idea, according to Arnauld, is the same thing as a perception (in\nthe broad sense of the term characteristic of seventeenth-century\nphilosophy), and every perception has an object distinct from the\nperception itself. Every idea, i.e., every perception, is, in\naddition, a consciousness of itself. But this “implicit\nreflexion” makes present to the mind a perception that is, in\nthe first place, of an object distinct from itself. As Arnauld puts\nit, “I know myself in knowing other things”\n(Ideas, 6). It is obviously true, he says, that we can know\nobjects only through the mediation of our perceptions, i.e., our\nideas, of them:\n\nBut if, by not knowing them immediately, is meant being able\nto know them only by representative beings distinct from\nperceptions, I hold that in this sense we can know material things, as\nwell as God and our soul, not only mediately but also\nimmediately, i.e., that we can know them without there being\nany intermediary between our perceptions and the object (Of True\nand False Ideas, hereinafter Ideas, 31).\n\n\nArnauld says that the object of any perception has objective\nbeing in the perception. Furthermore, the object has objective\nbeing in the perception as having properties. If an object\nexists objectively in a given perception as having a given property,\nthen Arnauld says that the perception represents the object\nas having that property, that is, makes the object present to the mind\nas having that\n property.[4]\n Furthermore, an idea (or perception) can represent its object to the\nperceiving mind as having this or that property contingently or\nnecessarily. Arnauld cites the dictum, “it is in the idea of\neach thing that we see its properties,” and takes it to refer to\nan explicit reflection upon an idea that represents its object as\nhaving certain properties necessarily.\n\nArnauld argues at length that this theory of ideas was also held by\nDescartes (Ideas, 26ff.). This claim has puzzled philosophers\nfrom Thomas Reid to the present (Reid 1785, 169). A good example of\nthe more common interpretation of Descartes’ theory is provided\nby Ian Hacking, who also attributes the theory, as he understands it,\nto the Port-Royal Logic. Hacking begins with the first\nsentence of the First Part of the Logic: “We have no\nknowledge of what is outside us except by the mediation of\nthe ideas within us,” and continues,\n\nThe Cartesian ego has set the stage. The ego able to\ncontemplate what is within it ponders what lies outside. There are\nsome objects that we can contemplate without being logically committed\nto the existence of anything other than the ego. These objects are\nideas (Hacking 1975b, 29).\n\n\nBorrowing an example from Elizabeth Anscombe’s comment on\nBerkeley, Hacking says that in the Cartesian (and Port-royalist)\ntheory, “Ideas [in the mind] are paradigm ‘objects’\nand coins [in a man’s pocket] are not” (Hacking 1975b,\n28–30). But the sentence that Hacking quotes from the First Part\nof the Logic does not demand the interpretation he gives it.\nIt is consistent with the position Arnauld develops in Ideas\n(published in the same year as the fifth and last edition of the\nLogic), according to which ideas are primarily perceptions of\nexternal objects distinct from the perceiver, objects like coins in a\nman’s pocket; and only secondarily objects of reflexive\nperception. Arnauld makes a good case for the claim that this position\nwas also held by Descartes, but the claim is not universally\naccepted.\n\nArnauld’s account of clarity and distinctness, obscurity and\nconfusion of ideas can be found in the First Part, Chapter 9, of the\nLogic. The discussion proceeds by way of examples, rather\nthan general definitions, but it can be summarized as follows: The\nbasic properties of ideas are clarity and confusion. Clarity of ideas\nis the same as vividness, and this is a matter of degree; the opposite\nof clarity is obscurity. Confusion of ideas results when a number of\nideas are connected by false judgments, and confusion produces\nobscurity. Opposite to confusedness of ideas is distinctness. Arnauld\nand Nicole apply these distinctions to the idea of pain:\n\nWe can say that all ideas are distinct insofar as they are clear, and\nthat their obscurity derives only from their confusion, just as in\npain the simple sensation which strikes us is clear and also distinct.\nBut what is confused, namely that the sensation is in the hand, is by\nno means clear in us (Logic, 48).\n\n\nAgain, Arnauld and Nicole speak of “the obscure and confused\nideas we have of sensible qualities, the soul adding its false\njudgments to what nature causes us to know” (Logic,\n49–50). The simple idea of pain, for example, is a clear and\ndistinct idea of a sensory state in the mind, and the idea of the pain\nin the hand is a compound and confused idea of something in the hand\nthat exactly resembles pain. Being confused, the idea is also obscure,\nbecause what it is in the hand that exactly resembles pain is\n“by no means clear to us.” Arnauld’s theory of clear\nand confused ideas implies that ideas, as they are given to us by\nnature, and thus by God, are clear and distinct, and therefore cannot\nbe deceptive, or “materially false.” Any deceptiveness in\nour ideas derives from their confusedness and is the result of our\nmisuse of freedom. It is not God who confuses us, but we who confuse\nourselves.\n\nArnauld’s comments on the idea of pain are part of a larger\nposition on “ideas of sensation.” In a famous passage in\nthe “Fourth Objections,” Arnauld objected to\nDescartes’ statement, “If cold is merely the absence of\nheat, the idea of cold which represents it to me as a positive thing\nwill be materially false” (Descartes, 2:145). As part\nof his reply, Descartes says,\n\nIf cold is simply an absence, the idea of cold is not coldness itself\nas it exists objectively in the intellect, but something else, which I\nerroneously mistake for this absence, namely a sensation which in fact\nhas no existence outside the intellect (Descartes, 2:163).\n\n\nArnauld developed a general account of sensory ideas that builds on\nthis part of Descartes’ reply. He sets out his account clearly\nin aIdeas: Sensory ideas, like the idea of pain and the idea\nof cold, are perceptions of mental states. Taken apart from the\njudgments in which we falsely identify these mental states with states\nof material things, sensory ideas are clear and distinct. They become\nconfused, and hence obscure, only as a result of the precipitous,\nfalse judgments of childhood. Arnauld quotes Descartes’\nPrinciples of Philosophy, Part I, #68 in support of his\naccount:\n\nWe know pain, color and the other sensations clearly and distinctly\nwhen we consider them simply as thoughts, but when we would judge that\ncolor, pain, etc., are things which subsist outside our thought, we do\nnot conceive in any way what that color, that pain, etc., is (Quoted\nby Arnauld in Ideas, 132).\n\n\nArnauld also gave a distinctive interpretation of Descartes’\nmethod of doubt. In the “Fourth Objections,” Arnauld\noffers, as the first of “the problems which a theologian might\ncome up against in the work as a whole,” the following: “I\nam afraid that the author’s somewhat free style of\nphilosophizing, which calls everything into doubt, may cause offence\nto some people” (Descartes, 2:151). Arnauld recommends\nthat the First Meditation be “furnished with a brief preface\nwhich explains that there is no serious doubt cast on these matters\nbut that the purpose is to isolate temporarily those matters which\nleave room for even the ‘slightest’ and most\n‘exaggerated’ doubt,” and that the clause\n“since I did not know the author of my being” be replaced\nby “since I was pretending that I did not know the author of my\nbeing.”\n\nArnauld was asking Descartes to make clear that his method did not\ninvolve real doubt, but only a consideration of what would happen\nif one were to doubt. Consider this passage from the\nPort-Royal Logic:\n\nIf there were people able to doubt that they were not sleeping or were\nnot mad, or who could even believe that the existence of everything\nexternal is uncertain … at least no one could doubt, as St.\nAugustine says, that one exists, that one is thinking, or that they\nare alive… From this clear, certain, and indubitable knowledge\none can form a rule for accepting as true all thoughts found to be as\nclear as this one appears to be (Logic, p.\n 228).[5]\n\n\nThis is as close as Arnauld comes to using methodic doubt, but it does\nnot imply that one can really doubt the existence of an external\nworld, much less that one ought to do so, even once in one’s\nlifetime.\n\nIt is not clear to what extent Descartes would have agreed with that\ninterpretation of methodic doubt. He did not adopt the first of\nArnauld’s two suggested revisions. Perhaps he thought that the\npoint was covered in the “Synopsis” of the\nMeditations. But he did adopt Arnauld’s second\nrecommendation by adding some words in parentheses in the Sixth\nMeditation, thus:\n\nThe second reason for doubt was that since I did not know the author\nof my being (or at least was pretending not to), I saw nothing to rule\nout the possibility that my natural constitution made me prone to\nerror even in matters which seemed to me most true\n(Descartes, 2:53).\n\n\nOn the other hand, Descartes begins the Principles of\nPhilosophy with the remark,\n\nIt seems that the only way of freeing ourselves from these [prejudices\nof childhood] is to make the effort, once in the course of our life,\nto doubt everything which we find to contain even the smallest\nsuspicion of error (Descartes, 1:193).\n\n\nHere Descartes advocates an effort to develop a real doubt on a wide\nscale, the sort of advocacy that had aroused Arnauld’s\ntheological concern in the “Fourth\n Objections.”[6]\n3.2 Arnauld’s identification of ideas with perceptions in the light of his notion of an extrinsic denomination\n\nAs pointed out in 3.1 above, Arnauld identifies an idea with a\nperception (in the broad sense of the term characteristic of\nseventeenth-century philosophy). Kenneth L. Pearce employs the notion\nof an extrinsic denomination to throw new light on that position. In\nPearce’s words, “Arnauld does not intend a straightforward\nidentification of ideas with perceptions, for he draws a semantic\ndistinction between ‘perception’ and\n‘idea;’.” “Careful examination of this\nsemantic distinction,” he says, “will help us …\nachieve a proper understanding of the relationship between perceptions\nand ideas” (Pearce 2016, p. 380). To that end, he makes use of\nthe notion of an “extrinsic denomination,” a notion which\noccurs in Arnauld’s Ideas, in the statement,\n“Being conceived, in regard to the sun that is in the sky, is\nonly an extrinsic denomination, i.e., only a relation to the\nperception which I have of it” (quoted by Pearce on p. 382).\nPearce adds that:\n\nThe Logic defines an ‘extrinsic denomination’ as\na mode “taken from something that is not in the substance, such\nas ‘loved’, ‘seen’, ‘desired’,\nnames derived from the actions of something else” (Pearce, 2016,\np 382).\n\n\nTalking about perceptions and talking about ideas, Pearce says, are\ntwo different ways of describing a situation in which a person\nperceives an object:\n\nSuch a situation is relational, involving a relation of the perceiver\nto the object and a relation of the object to the perceiver. The first\nrelation is a real mode in the perceiver; the second is not a real\nmode, but rather a mere extrinsic denomination in the object (Pearce,\n2016, p. 382).\n\n\nPearce concludes:\n\nThis explains the sense in which the perception and the idea are\nidentical: just as one and the same worldly state of affairs entitles\nMary to the (intrinsic) denomination ‘lover’ and John to\nthe (extrinsic) denomination ‘beloved’, so one and the\nsame worldly state of affairs entitles my mind to the (intrinsic)\ndenomination ‘perception’ [sic] and the sun to\nthe (extrinsic) denomination ‘idea’ (Peatce, 2016, p.\n382–83)\n\n\nPearce suggests that “The reason Arnauld’s ideas are not\nobjectionable intrermediary entities is that they are not really\ndistinct from the external objects they represent” (p. 376). To\nput the point in another way,\n\nArnauld denies that the idea is a distinct third term in perception\nnot by identifying it with the perceptual act, but rather by\nidentifying it with the external object conceived by me\n(Pearce, 2016, p. 389).\n\n\nIn a subsequent article, Pearce shows how Arnauld uses the notion of\nan extrinsic denomination to resolve three apparent contradictions\nbetween what Arnauld says about representation and his\n\nsparce Cartesian ontology on which there are just two kinds of\nsubstance, thinking and extended … [and] every feature of a\nthinking substance is a way of thinking, and every feature of an\nextended substance is a way of being extended (Pearce forthcoming, p.\n1–2).\n\n\nThe first apparent contradiction arises because Arnauld maintains that\nwe directly perceive extended objects and yet that we do so by means\nof ideas in our mind. The solution is that the perception, e.g., of\nthe sun, is a real mode of thinking which essentially makes the sun\npresent to the mind, and in virtue of which the sun deserves the\nextrinsic denomination ‘idea of the sun’ (p. 22). The\nsecond apparent contradiction arises from the Port-Royal theory of\nlanguage. According to the Logic, language consists of sounds\nand visible characters which are signs of ideas. But signs are\nrepresentations and “representing is not a mode of extension and\ntherefore cannot modify an extended object such as a sound [or] a\nwritten word” (p. 19). The solution is that the idea which a\nword signifies “is connected to [the sign] only by a\nhabit,” the habit, namely “of conceiving of a certain\nobject whenever [the mind] perceives the symbol.” Consequently\n“the object is entitled to the name ‘sign’ on\naccount of the state of some mind or minds. In other words,\n‘sign’ is applied to the object by extrinsic\ndenomination” (p. 19–20). The third apparent contradiction\narises in Arnauld’s rejection of Malebranche’s position\nthat “the soul actually becomes red, blue or yellow [and] when\none smells a carcass the soul becomes formally putrid.” Arnauld\nagrees that colors and smells are modifications of the mind and not of\nextension. But this does not imply, Arnauld says, that “our soul\nshould be called either ‘green’, or ‘yellow’,\nor ‘putrid’” (p. 23). Arnauld adds, “There are\ninfinitely many names which suppose no modification in the\nthing to which they are given” (quoted by Pearce on p. 23 from\nArnauld’s Ideas ). Pearce comments, “The\napplication of a name that ‘supposes no modification in the\nthing to which [it is] given’ is extrinsic\ndenomination.”\n\nPearce has also located Arnauld’s account of ideas in the wider\ncontext of early modern philosophy. He classifies accounts of ideas as\ndescriptivist or explanatory. In the explanatory approach,\n“ideas are to be understood as posits in an explanatory\ntheory” (Pearce forthcoming, p. 2). Malebranche is the paradigm\npractitioner of the explanatory approach. In the descriptivist\napproach, by contrast, “claims about ideas are to be justified\nonly by direct introspection, and not by inference to the best\nexplanation” (Pearce, forthcoming, p. 9). Arnauld is the chief\npractitioner of the descriptivist approach. He not only rejects\nMalebranche’s attempt to explain how the mind perceives external\nobjects, but he also maintains that no such explanation is needed. For\nI know clearly by introspection that my nature is to think, and that\nthinking is representational. As Arnauld puts it, “Just as it is\nclear that I think, it is also clear that I think of something, i.e.,\nthat I perceive and know something” (quoted by Pearce from\nIdeas in Pearce, forthcoming, p. 8). It is similarly clear\nwhat it is that I think of, perceive or know, and in particular it is\nclear that I think of, perceive or know extended things. Pearce argues\nthat Locke follows Arnauld in his descriptivism, although not in his\ndirect realism (Pearce, forthcoming, p. 10). Berkeley too adopted the\ndescriptivist approach, a fact which helps to explain the absence of\narguments for Berkeley’s view that we cannot form abstract\ngeneral\n ideas.[7]\n3.3 Mind-body dualism\n\nIf there is one part of Descartes’ philosophy that met with\nArnauld’s enthusiastic approval, it is Descartes’\nmind-body dualism. Yet even here Arnauld’s version of the\nCartesian philosophy departed in important ways from Descartes’\nown views. Arnauld’s departure did not have to do with the\ndistinction between mind and body; here he largely contents himself\nwith endorsing what Descartes\n says.[8]\n It had to do rather with the union of the mind and body in a human\nbeing. Arnauld rejected a claim at the core of Descartes’\nposition, namely, that the union of a person’s mind and body\nmakes it possible for the mind and the body to exercise real causal\naction on one another. Arnauld explicitly says that a person’s\nbody cannot act causally on his mind, and had at least some difficulty\nwith the notion that a person’s mind can act causally on his\nbody.\n\nIn 1680 Arnauld wrote an extended defense of the “the philosophy\nof Descartes” regarding “the essence of body and the union\nof the soul with the body,” against an attack by Fr. Etienne Le\n Moine.[9]\n Throughout this work, Arnauld quotes Malebranche as representative of\nthe Cartesian position, and what he defends under the heading,\n“the philosophy of Descartes,” is actually a modified\nversion of\n Malebranche.[10]\n According to the Cartesian philosophy, says Arnauld,\n\nAll the union (alliance) of the mind and the body which is\nknown to us consists in a natural and mutual correspondence of\nthoughts in the soul with traces in the brain and of emotions in the\nsoul with movements of the [animal] spirits.… It is not denied\nthat there may be something unknown to us in the union God has brought\nabout between our soul and our body (Examen, OA,\n38:141).\n\n\nwhat we do know, however, suffices to show that the mind is not\nrelated to the body as a pilot to his ship, but rather that the two\nare united in “a greater and more intimate union” by which\nthey form a single whole (Examen, OA, 38:141).\n\nArnauld next takes up a criticism directed by Le Moine against the\nCartesian account of sense perception, and this leads to the\nquestion,\n\nwhether it is the bodily movements [in the eye] that cause the\nperceptions in the soul; or whether they are only the occasion on\nwhich the soul forms [the perceptions] in itself; or whether God gives\n[the perceptions] to [the soul](Examen, OA, 38:146).\n\n\nArnauld says that it is “easy” to eliminate the first\nalternative: “For since the motion of a body can at best have no\nother effect than to move another body (I say at best because\nit may have not even that), who does not see that it can have no\neffect on a spiritual soul?” (Examen, OA,\n38:146). He adds that St. Augustine considered it beyond doubt that a\nbody can have an effect only on our body, and not on our soul. Arnauld\nrules out the second of his three alternatives on the grounds that the\nsoul cannot form sensible perceptions in itself on the occasion of\nparticular motions in the bodily sensory apparatus because the soul is\nnot aware of those motions (Examen, OA, 38: 147).\nThis leaves Arnauld with the third alternative, which he accepts,\nadding that God voluntarily undertakes to cause in our soul\nperceptions of sensible qualities whenever the corresponding motions\noccur in the sensory organs “according to the laws He himself\nhas established in nature” (Examen, OA,\n38:148). He summarizes this conclusion by saying that our body does\nnot act on our soul as a “physical cause (cause\nphysique)” but only as a “moral cause (cause\nmorale)” (Examen, OA, 38:150).\n\nArnauld had a quite different position regarding the causation of\nvoluntary movements in the body. He held that, in general, it is\npossible for immaterial, thinking beings to act causally on material\nthings, and that, in fact, God has on occasion given angels the power\nto do so. He also held that the mind of Adam and of Eve had the power\nto bring about voluntary motions in their bodies before the Fall, and\nthat the minds of the blessed in heaven will enjoy that power. He\nsuggests that the voluntary bodily motions of human beings in this\nlife here below are not caused by the person’s volitions. His\nreason for this negative position is that post-lapsarian human beings\ndo not know how to bring about the movements of the animal spirits\nthat cause the motions of their muscles and limbs. Thus he says,\n\nIf one can say [that God has not given our soul a real power\nto determine the course of the animal spirits toward the muscles of\nthe parts of our body that we want to move], it is not [on the grounds\nof a general occasionalism like Malebranche’s]… It is\nonly because our soul does not know what must be done in order to move\nour arm by means of the animal spirits (emphasis added;\nDissertation sur les Miracles de l’ancienne loi,\nOA, 38:690).\n\n\nSteven Nadler cites this text while arguing that Arnauld was an\n“occasionalist” both about the causation of sensory\nperceptions by bodies, and about the causation of voluntary movements\nby the human mind (Nadler 1995, 138). Nadler recognizes that Arnauld\nhad quite different attitudes toward the two cases, but nevertheless\nsays that Arnauld “alone among Cartesians” recognized\nmind-body interaction as a specific problem in Descartes’\nmetaphysics, and “used an occasionalist solution” (Nadler\n1995, 144).\n\nArnauld’s treatment of the union of mind and body shows that he\nwas not a docile follower of Descartes, and was prepared to develop\n“the philosophy of Descartes” in ways that Descartes would\nprobably not have accepted. It also shows that Arnauld was prepared to\nmodify Descartes’ philosophy in a way that increased its\nsimilarity to Augustine. It is well known that Arnauld pointed out\nsimilarities between Augustine and Descartes from the beginning of his\npublished work, in the “Fourth Objections.” In the present\ncase, however, Arnauld changes the philosophy of Descartes in a way\nthat increases its similarity to Augustine. Arnauld did not mention\nAquinas, though he could have done so, as another authority who held\nthat a material thing cannot produce an immaterial effect. It was only\na few years later, in Ideas, that Arnauld began to claim an\naffinity between the views of Descartes and those of Aquinas. But in\nhis development of the Cartesian position on the union of mind and\nbody, one can already see Arnauld attempting to make of Descartes a\nChristian philosopher standing in continuity with his great patristic\nand scholastic predecessors. (This attempt on Arnauld’s part is\nexplored in the journal Dix-Septieme Sciecle, 2013/2 no.\n259.)\n3.4 The Creation of the eternal truths\n\nThere is a continuing discussion of Arnauld’s attitude toward\nthe view which Descartes expressed in answer to Mersenne’s\nquestion “by what kind of causality God established the eternal\ntruths.” Descartes replied, “by the same kind of causality\nas he created all things, that is to say, as their efficient and total\ncause” (Descartes, p.\n 25).[11]\n The debate has been greatly influenced by Jean-Luc Marion’s\ninterpretation, in La théologie blanche de Descartes,\naccording to which Descartes’ position on the matter is\nfundamental to his metaphysics. Consequently, to the extent that\nArnauld, in his mature writings, adopted Descartes’ metaphysics,\nit has seemed reasonable to say that Arnauld agreed with Descartes\nabout “the creation of the eternal truths.” Indeed Denis\nMoreau says, “Arnauld is therefore one of the rare (and if we\ncan grant him the adjective, the only great) post-Cartesian to accept\nthe thesis of the creation of the eternal truths” (Moreau, 1999,\np. 180).\n3.5 Are God’s actions reasonable?\n\nSteven Nadler accepts Moreau’s conclusion about Arnauld and the\ncreation of the eternal truths. As Nadler puts it,\n\nThere is no need for me to go into this question here in any detail,\nsince Denis Moreau, in his magnificent study of the\nArnauld-Malebranche debate, has, to my mind, persuasively shown that\nArnauld does, in fact – and despite his refusal explicitly to\nendorse (or reject) the doctrine – accept the creation of the\neternal truths (Nadler, 2008, p. 532).\n\n\nBut he faults Moreau for not having gone “far enough along the\npath that Arnauld traces,” and thus having failed “to see\nhow radical Arnauld’s conception of God really is. For\neverything points to Arnauld’s God being an ultimately arbitrary\ndeity who does not act for reasons at all – indeed a deity who,\nin His being, transcends practical rationality altogether” (p.\n533). In Nadler’s view, Arnauld follows Descartes in holding\nthat God is absolutely simple and consequently that in God “will\nand understanding are one and the same thing,” not\ndistinguishable even by a distinction of reason. For Arnauld\n(following Descartes),\n\nthe relationship between will and wisdom in God is so unlike their\nrelationship in human beings – where will and undertanding\nare distinct faculties of the mind, and the former cannot\nfunction unless the latter presents to it ideas for consideration\n– that no analogy can be drawn from the human for the purpose of\nunderstanding the divine (p.\n 532).[12]\n\n\nMoreau gives a very different account of Arnauld’s concept of\nGod. Invoking the doctrine of divine simplicity, Arnauld says that\nGod’s will is His wisdom, for God’s will\nis God Himself and God’s wisdom is God\nHimself. There can, therefore, be no question of God’s wisdom\nlimiting His will. Nevertheless, far from being a deity who does not\nact reasonably, “God’s action is both reasonable and\nreasoned; it is the action of a wisdom”(Moreau, 1999,\np. 281). Arnauld holds that Gods attributes are\n“integrated” and “unified”; Arnauld speaks of\nthe “reasonable will” of God and “affirms that\n‘God wills nothing except wisely, He wills nothing that His\nwisdom does not will. In God the will wills and reasons, and the\nreason reasons and wills.” But if pressed to give God’s\nreasons for doing what He does, Arnauld can only reply that “God\ndoes what He wills, we do not know why and can give no reason except\nHis will to do what he does” (Moreau, 1999, p. 295). In sum,\nGod’s reasons for what He does are\n“incomprehensible,” but His actions are not\n“irrational” (Moreau, 1999, p. 296, note 2).\n\nIn “Arnauld’s God Reconsidered,” Eric Stencil has\nattempted to adjudicate this disagreement (Stencil, 2019).\nStencil’s attempt is divided into two parts. The first is\nfocussed on the doctrine of divine simplicity, and takes up the\nquestion of whether God’s wisdom is distinct in any way from His\nwill. The second takes up the question of whether God acts for\nreasons.\n\nAs Stencil points out Moreau and Nadler agree that Arnauld subscribes\nto what Stencil calls “the identity thesis,” that God,\nGod’s action, and God’s attributes are identical.\nAccording to Nadler, however, Arnauld goes farther, and denies that\nGod’s wisdom and His will are distinct even by a\n“distinction of reason.” Stencil disagrees. Against the\nbackground of the treatment of abstraction in the Port Royal\nLogic, Stencil maintains that Arnauld holds “the\ndistinctness thesis,” that “God, God’s actions, and\nGod’s attributes are conceptually distinct” (Stencil,\n2019, p. 24–5). Reflection on the clear idea of God. and on the\nclear ideas of His attributes, which we form by abstraction, allows us\nto establish various truths about God and His attributes. But that\nreflection reequires that we distinguish conceptually among the\nvarious attributes. Arnauld also subscribes to “the nonpriority\nthesis,” the thesis “that there are no conceptual\npriorities among God, God’s actions, and God’s\nattributes” (Stencil, 2019, p. 21). To deny the nonpriority\nthesis is, in Arnauld’s view, to “anthropomorphize”\nGod, to make him “operate like a finite being.” Stencil\nconcludes, “So, contra Nadler, I suggest that we treat\nArnauld as allowing for conceptual distinctions – but not\nconceptual priorities – among God’s various\nattributes” (Stencil, 2019, p. 26–7).\n\nStencil points out that his account of divine simplicity “is in\nsome ways a defense of Morearu’s interpretation against\nNadler’s objections” (Stencil, 2019, p.\n 27).[13]\n He then turns to the question of whether Arnauld’s God acts for\nreasons. Here he finds evidence on both sides of the issue:\n\nMoreau has highlighted passages where Arnauld is explicit about not\ndenying that God acts for reasons or that God’s actions have\nends. Nevertheless, Nadler has presented systematic and compelling\nevidence for concluding that Arnauld’s God does not act for\nreasons. (p. 28)\n\n\nStencil claims, nevertheless, that\n\nIn fact, Arnauld offes a consistent position about whether God acts\nfor reasons. Arnauld is ‘agnostic’ about whether God acts\nfor reasons absolutely – whether God acts for reasons\nin any sense at all. (p. 29)\n\n\nArnauld claims to know that “Malebranche’s account of how\nGod acts for reasons … treats God as a finite being – and\nthis makes his account unacceptable and false” (p. 29). But that\nleaves open the question of whether God acts for reasons in some other\nway. On Strencil’s interpretation, Arnauld says that we cannot\nknow the answer. If Stencil is right about Arnauld’s\nagnosticism, then the most that Nadler’s evidence can show is\nthat for Arnauld it is “beyond our epistemic means” to say\nthat God does, or that He does not, act for reasons. As for the\npassages cited by Moreau in which Arnauld refuses to deny that God\nacts for reasons, they do not affirm that God does not act for\nreasons, but simply refuse to deny what we cannot know to be\nfalse.\n\nAn interesting example cited by Moreau is Augustine’s rhetorical\nquestion, “Who would dare to say that God created all things\nwithout reason?” (cited by Moreau on p. 295, note 2). Stencil\ntakes the question to be a way of saying “We dare not state or\ncould not prove a denial that God acts for reasons” (Stencil,\n2019, p. 29). Unfortunately Moreau does not explain the context in\nwhich Arnauld quotes Augustine’s question. The context is\nArnauld’s enthusiastic endorsement of Aquinas’ argument in\nSumma Theologiae, I, 19, 2 and 5 (Réflexions, II, 2,\nOA, XXXIX, 430–31). Article 2 has to do with whether\nGod wills things other than Himself. Aquinas says that “the will\nof God is directed to things other than Himself,” and this is\nbecause\n\nit is a perfection of the will of God to communicate to other things\nthe good He possesses … So God wills that He be what He is and\nalso wills that other things be. But He wills Himself as the end and\nother things as related to the end, insofar as it is appropriate to\nthe divine goodness that other things participate in it. (translation\nof Arnauld’s French rendering of Aquinas by author)\n\n\nArticle 5 addresses the question of whether the will of God has a\ncause. Arnauld comments,\n\n[Aquinas] answers in the negative because it is not with God as it is\nwith men. A man wills an end; he wills to be cured of an illness. His\nwilling that end is the cause of his willing the means suitable for\nobtaining it. That is how [Malebranche] makes God act, not noticing\nthat he falls into the mistake which he often says must be avoided, of\nspeaking about God according to [our] ideas of the way that men act.\n\n\nBecause God wills all things by a single act,\n\nwe cannot say that He wills what is for the end (that is to say, the\ncreatures) because He wills the end, but we should say only that He\nwills that what is for the end be related to the end. He wills\nx to exist for the sake of y, but He does not will x\nfor the sake of y (VULT hoc esse propter hoc, sed non\npropter hoc vult\n hoc.)[14]\n\n\nAugustine’s rhetorical question is raised as an objection: If\nGod does not will to create things in order to accomplish an end,\nthen, contrary to the import of Augustine’s question, God\ncreates things without reason. Arnauld summarizes Aquinas’\nreply:\n\nThe will of God is reasonable, not because He wills only if there is\nsome reason which causes Him to will (qui le fasse vouloir),\nbut because He wills that among the things He makes some exist for the\nsake of others (OA, XXXIX, 431).\n\n\nHere Arnauld distinguishes the question of whether God’s\ncreative action is reasonable from the question of whether in creating\nGod acts for a reason. He answers the first question, but not the\nsecond, in the affirmative.\n4. Arnauld and Malebranche\n\nNicolas Malebranche was born in 1638, when Arnauld was twenty-six\nyears old. In 1660, Malebranche joined the Oratory, a center for\npriests in Paris that had many connections with Port-Royal.\nMalebranche and Arnauld were on friendly terms in the early 1670s, but\nlate in the decade they had a falling out over Malebranche’s\nexplanation of the fact that not all men are saved, and related\n matters.[15]\n In 1680, Malebranche published his position, against Arnauld’s\nadvice, in the Treatise of Nature and Grace (hereinafter\nTNG). The ensuing public controversy between the two was a\ncentral event in the intellectual life of Europe in the late\nseventeenth century.\n\nArnauld’s attack on TNG began in a surprising way, with\nthe publication of On True and False Ideas (hereinafter\nIdeas) in 1683. In it, Arnauld presents his own position on\nthe nature of ideas, which was described above, and argues that\nMalebranche’s view that we see all things (or at least all\nbodily things) in God and by means of God’s ideas is not only\nmistaken, but thoroughly confused and wrong-headed. This work\nengendered a preliminary debate that lasted for two years. The\npublication of Réflexions in 1685–86, preceded\nin 1685 by the publication of Arnauld’s Dissertation sur les\nmiracles de l’ancien loi, provoked further exchanges\nbetween the two in 1687, with a last gasp on Arnauld’s part in\n1694, the year of his death, and on Malebranche’s part ten years\nlater, in\n 1704.[16]\n4.1 Malebranche’s position in the Treatise of Nature and Grace\n\nTNG provides a general account of God’s reasons for\ncreating a world with the evils that the world contains. But\nMalebranche is mainly interested in one particular evil, namely, that\nnot all men are saved. That not all men are saved he took to be a\ndatum of revelation, plainly expressed in the Scriptures. But he\ndenied that it follows that God does not want all men to be saved.\nIndeed, he says his motive in writing TNG was to refute those\nwho concluded that God did not have a “sincere will” to\nsave all men:\n\nIf there were not in this century people determined to hold that God\ndoes not have a sincere will to save all men, it would not be\nnecessary to establish principles suitable for destroying that unhappy\nopinion. But the need to combat errors brings to light principles\nsuitable to that end. I protest before God that that was the principal\nmotive that made me\n write.[17]\n\n\nIf God wants to save all men, something must prevent Him from doing\nwhat He wants to do. In the “Troisième\nEclaircissement” to TNG, Malebranche says that\nsince God is omnipotent, He can bring about whatever He wants to bring\nabout. But because His will is “the love He bears for His own\nattributes,” He cannot, by a “practical”\n will,[18]\n will anything or will in any way that is not wise: “The wisdom\nof God renders Him impotent in this sense that it does not permit him\nto will certain things, or to act in certain ways” (OM,\n5:180). What prevents God from carrying out His will to save all men,\nMalebranche concludes, must be that doing so would require ways or\nmanners of willing that are unwise. As he puts it a few pages later,\nGod’s wisdom “holds His volitions in check, in the sense\nthat not all of His volitions are practical volitions”\n(OM, 5:184).\n\nMalebranche argues that God’s wisdom restrains Him from\nsanctifying and saving all men because it directs Him not only to\ncreate a world that is good, but also to create “in a way worthy\nof Him, by ways (par des voyes) that are simple, general,\nconstant, and uniform” (OM, 5:49). More precisely,\nGod’s wisdom directs Him to an act of creating that best\ncombines goodness or perfection of the created world with simplicity\nof ways of creating. An analogy may help explain Malebranche’s\nposition. Suppose that someone sets out to buy a car and wants to do\nthe best possible job of car-buying. Suppose further that the\nsecond-best car is available at a much better price than the best car.\nIn this case, doing the best job of car-buying might require buying\nless than the best car. In a somewhat similar way, Malebranche holds\nthat the best job of creating, the one most worthy of God, involves\ncreating a world less perfect than He might have made it, in\nparticular, a world in which not all human beings are saved.\n\nMalebranche’s notion of the simplicity of God’s ways of\ncreating depends on his occasionalism. According to that theory of\nefficient causality, God is the only true efficient cause. When\ncreatures appear to be efficient causes, they are really only\noccasional causes. That is, the events in which the apparent created\ncauses take part are followed by other events in accordance with laws\nof nature, which are God’s general volitions. But the created\n“causes” do not really cause the events that follow. These\nevents, like every created reality, are really caused by\n God.[19]\n For Malebranche, the simplicity of God’s ways depends on there\nbeing a small number of laws of nature, and on there being few\nexceptions to the laws. Malebranche maintains that in order to do the\njob of creating that best combines goodness of the world created with\nsimplicity of ways of creating, God had to make a world with precisely\nthe natural evils (misshapen animals, human suffering, ugly\nlandscapes, etc.) that that are present in the world as it is.\n\nThe anomalies in the order of grace are explained in a similar way.\nMalebranche divides grace, the divine assistance given to human\nbeings, into two kinds, which he calls “grace of light\n(lumière)” and “grace of feeling\n(sentiment)” (OM, 5:96–97; 131). The\nformer is, quite simply, knowledge. Malebranche also calls it\n“the grace of the Creator,” because it is given, in\ndifferent forms, both to Adam and Eve and to human beings after their\nFall. Grace of feeling is “the grace of Jesus Christ,” and\nwas merited for human beings by the life and death of Jesus.\nMalebranche also describes it as a “pleasure\n(délectation)” which makes a person love God\n(TNG, OM, 5:135). According to Malebranche, the\ngrace of the Creator is “dry, abstract, entirely pure and\nentirely intelligible” and does not lead us to love God. The\ngrace of Christ, in contrast, is “efficace par\nelle-même” in that it “always has its effect, always\ncarries us toward God” (OM, 5:132). Human beings, after\nthe fall of Adam, are unable to grow in holiness, or even to be saved\nfrom damnation, without the grace of Christ. But the love of God\nproduced by grace is a sort of instinctive love, which is not\nmeritorious and is not sufficient for salvation. Whether the person\nwho receives the grace of Christ is saved depends on the\nperson’s free consent to the movement toward God that grace\nproduces, which converts the instinctive love of God into a\n“free and rational” love. This consent is not produced by\ngrace.\n\nNow Malebranche holds that God could give to each person grace that\nwould assure the person’s salvation:\n\nGod is the master of hearts. He can give to the impious a grace such\nthat it will convert him, since God knows what degree of grace to\ngive, and when it must be given, in order that it bring about the\nconversion of the sinner (OM, 5:186).\n\n\nSimilarly, God knows what sort of grace would ensure that any person\nis not only saved, but also attains the maximum holiness of which he\nor she is capable. But many who receive grace do not grow in holiness\nand are not saved. For example, many who enter the Church later fall\naway.\n\nGod often distributes graces, without their having the effect that His\ngoodness makes us believe He would make them have. He makes the piety\nof some people increase right up to the end of their life, but sin\novercomes them at death and throws them into Hell. He makes the rain\nof grace fall upon hardened hearts as well as on earth that is\nprepared: people resist it and make it useless for their salvation.\n… How can that be reconciled with wisdom? (OM, 5:48).\n\n\nMalebranche’s answer is that God’s wisdom dictates that He\nact, in the distribution of both sorts of grace, according general\nvolitions determined by created occasional causes to particular\neffects. In the case of the grace of the Creator, the general\nvolitions are laws of nature, and the occasional causes are “the\ndiverse movements of our will” and “the encounter of\nsensible objects that act on our mind” (TNG, 5:102).\nFor the grace of Jesus Christ, the occasional cause is Jesus Christ,\nin his human nature, and the general volition is that grace be given\nto human beings if and only if Jesus, in his human nature, asks that\nit be given. Jesus’ requests for grace are made in view of the\nneeds of the Church. But Jesus, in his human nature, does not always\nthink of “the future determination of the will” of those\nfor whom he requests grace. The result is that, often enough, people\nreceive grace that does not lead to their holiness and salvation, or\nfail to receive the grace that would have done so (TNG,\nOM, 5:83).\n4.2 Two themes in Arnauld’s criticism of the Treatise of Nature and Grace\n\nArnauld thought that Malebranche’s position was dangerous, and\nthat if accepted it would have ruinous consequences for the Catholic\nfaith. He was “furious,” as Denis Moreau has aptly said,\n“and decided to leave nothing standing in a philosophy that\nclearly frightened him” (Moreau 1999, 240). Here only the\ngeneral lines of Arnauld’s attack are set forth. First, two\npervasive themes in Arnauld’s criticism are described: (1) that\nMalebranche often did not proceed by the proper method of either\nphilosophy or theology; and (2) that Malebranche speaks of God in\nanthropomorphic terms, as if He were subject to the limitations of a\nhuman\n agent.[20]\n Then Arnauld’s criticisms of Malebranche’s position that\nGod acts by “general volitions” will be discussed.\n\n1. Throughout Réflexions, beginning with the\n“Avant-Propos” to the work, Arnauld challenges Malebranche\nto make clear whether his claims are based on reason or on Scripture\nand\n tradition.[21]\n He had mounted this sort of challenge even earlier, in\nIdeas:\n\nHe does not say that he learned those grand maxims on which all of\nthat [Treatise of Nature and Grace] turns by the revelation\nof God: that if God wills to act externally, it is because He\nwills to obtain an honor worthy of Himself; that He acts by the\nsimplest ways; that He does not act by particular volitions; but by\ngeneral volitions which are determined by occasional causes\n(Ideas, 174).\n\n\nNor could all of those maxims be demonstrated, in Malebranche’s\nsense of the term. For Malebranche says that only necessary truths can\nbe demonstrated, and yet he admits that God does sometimes act by\nparticular volitions, namely, when He performs miracles. Hence\nMalebranche himself would have to admit that the third maxim, at\nleast, is not demonstrable. In Arnauld’s view, Malebranche came\nto accept such principles because he thought they made God more\nloveable and hence were favorable to the cause of religion. In this\nway Malebranche introduces, on the basis of religious considerations,\nprinciples that are not found in Scripture and tradition.\n\nArnauld thought that this unholy introduction of religion into what\nought to be treated as philosophical questions began with\nMalebranche’s theory of ideas, according to which “we see\nall things in God.” Thus, in the “Conclusion” of his\nDéfense contre la Réponse au livre des vraies et des\nfausses Idées (OA, 38, 367–668; hereinafter\nDéfense), Arnauld takes up “two or three\nobjections” that might be raised against Ideas. The\nsecond objection is one that had been raised by Nicole: “I could\nhave avoided this philosophical topic [of the nature of ideas] so as\nnot to interrupt what I had begun to write about the Treatise of\nNature and Grace.” In reply, Arnauld says,\n\nWhat was at the outset a question of philosophy … is not such\nfor [Malebranche]. For him it is a question of theology, very sublime\nand very elevated. He considers it a religious duty to devote his\nwhole mind to its defense. He finds it bad that others should disagree\nwith him, and even says that anyone who is not of his opinion must be\n‘either an unenlightened philosopher or a man insensitive to his\nduties.’ Thus he has changed the form of the dispute. He has\ninvolved religion, and has become so devoted to his novel thoughts as\nto hold that anyone who does not approve of them lacks respect for the\nwisdom of God Himself. (Défense, OA, 38:666)\n\n\nIn Arnauld’s direct attack on TNG, he says again and\nagain that Malebranche relies on principles that have neither a proper\ntheological basis in Scripture and tradition, nor a proper\nphilosophical basis in reason. Clearly he thought that this criticism\napplied as well to Malebranche’s theory of ideas. But if Arnauld\ntook seriously the remark at the beginning of the Logic,\n“The reflections we can make on our ideas are perhaps the most\nimportant part of logic, since they are the foundation of everything\nelse,” he may well have thought that Malebranche’s theory\nof ideas was an important source of the confusion of theology with\nphilosophy that plagues TNG. That, in turn, would help\nexplain his decision to begin his attack on TNG with a\ntreatise on the nature of\n ideas.[22]\n\n2. Arnauld agreed with Malebranche that God’s will is\nreasonable, but he disagreed with Malebranche’s way of\nconceiving God’s\n reasonableness.[23]\n In both Book I and Book II of Réflexions, he tries to\nshow that Malebranche conceives of God’s reasonableness as if it\nwere the reasonableness of a human being. In the second chapter of\nBook I, he reports a series of arguments given by Malebranche early in\nTNG for the conclusion that God acts in the order of nature\nonly by general volitions. These arguments, says Arnauld, are\n“only comparisons with men, which … cannot prove anything\nwith regard to God; or popular thoughts not worthy … of a\nphilosopher” (OA, 39:188). For example, Malebranche\nsays that God decides to create that which can be produced and\nconserved by the simplest laws because he is an excellent workman, and\n“an excellent workman … does not do by complicated ways\nwhat he could carry out by simpler ones” (TNG,\nOM, 5:28). Arnauld objects that there is no similarity\nbetween an excellent human workman and God,\n\nsince all the ways of executing His plans are equally easy for Him,\nand ‘His power,’ as the author [Malebranche] recognizes,\n‘makes Him so much the master of all things, and so independent\nof help from elsewhere, that it suffices that He will, in order for\nHis volitions to be carried out’ (OA, 39:189–90).\n\n\nHence God’s volitions are not based on reasoning about the means\nto achieve a desired end.\n\nBook II of Réflexions, which deals with God’s\nway of acting in the order of grace, opens with a related criticism.\nArnauld begins by analyzing a line of thought that Malebranche\npresents in the Troisième Eclaircissement to\nTNG (OA, 39:425–51). The line of thought\nbegins with two claims: that “God can act only for Himself. If\nHe wills to act, it is because He wills to procure an honor worthy of\nHimself” and that “God can receive an honor worthy of\nHimself only from Himself.” Yet I am created, so I must be able\nto render to God an honor worthy of Him. This I can do, says\nMalebranche, only by becoming a part of the Church, of which the\nIncarnate Second Person of the Trinity is the cornerstone. More\ngenerally, “God’s great plan is to build in His own honor\na spiritual temple, of which Jesus Christ is the cornerstone …\nHis plan is that this Temple should be as large and perfect as\npossible.” Malebranche then draws an important conclusion:\n\nGod wills that all men enter into this spiritual building, to enlarge\nit. God wills that all men be saved … God also hopes\nthat men will merit outstanding degrees of glory: His will is our\nsanctification. (OM, 5:183)\n\n\nBut although God wants the salvation and sanctification of all men,\n“He loves His wisdom infinitely more,” and His wisdom\nrequires that He act in the way that is wisest and most worthy of\nHimself, that is, in “general, constant and uniform way,”\nwith the result that “He does not save all men, although He\ntruly wills that they all be saved” (OM, 5:185).\n\nArnauld has much to say against that line of thought, and he begins be\nattacking its very first step, the claim that God “can act\nexternally only in order to procure an honor worthy of Himself”\n(OA,\n 39:428–40).[24]\n He objects that this is not a proper way to speak about an infinitely\nperfect being. Once again, Malebranche is guilty of anthropomorphism.\nFor he says, in effect,\n\nthat [God] could resolve to create me, me and the other creatures,\nonly for some advantage He wanted to obtain for Himself by creating\nus…. That is how [Malebranche] lowers [God], by claiming that\nHe cannot decide to create anything externally, except to procure an\nhonor worthy of Himself. (OA, 39:429)\n\n\nArnauld goes on to contrast Malebranche’s way of describing\nGod’s creation with that of St. Thomas, who say that the reason\nGod creates is that His goodness tends to overflow and communicate\nitself to other\n things.[25]\n\nArnauld also says that to speak about God as consulting His\nwisdom before acting is to speak about God as one would about a human\nbeing who wills an end and is thereby caused to will the means to that\nend (OA, 39:432). It is to compare God to a man who consults\nhis wisdom about everything he wants to do “as if he were afraid\nof not acting well, and his will needed to be ruled by something other\nthan itself in order to do only what is good” (OA,\n39:599–600). “Is it an expression of rigorous\nexactitude to say of God that He consults His wisdom,\nand that is how it comes about that everything He wills is\nwise,” Arnauld asks,\n\nas if the word consult is suitable for an infinitely perfect\nbeing when one professes not to speak in popular language? As if God\nneeded to consult His wisdom so that what He wills should be wise? As\nif His will were not His wisdom? As if everything He wills were not\nessentially wise, by virtue of the fact that He wills it?\n(OA, 39:578)\n\n\nGod’s will is not a force that needs to be tamed. The truth,\naccording to Arnauld, is that it is impossible that God should have an\nactual (sincere) will for something that is not in fact wise.\n\nIn a related criticism, Arnauld chides Malebranche for allowing\n“very little freedom and indifference” in God’s\ncreative action. Arnauld quotes Malebranche:\n\nAssuming that God wills to produce outside of Himself a work worthy of\nHimself, He is not indifferent in the choice; He\nought to produce the most perfect work possible by relation to the\nsimplicity of the ways by which He acts; He owes it to Himself to\nfollow the rules of his wisdom. (Quoted by Arnauld at\nRéflexions, OA, 39:598, from TNG,\nOM, 5: 110).\n\n\nMalebranche tries to save for God at least freedom and indifference\nwith regard to creating or not creating. But Arnauld suggests that\nthis move is ruled out by “the way in which he conceives\nGod’s action,” for supposedly, on Malebranche’s\nview, God would consult His wisdom before deciding whether to create\nor not, and just as His wisdom advises Him to create this world rather\nthan a less perfect one, assuming that the two could be created in an\nequally simple way, His wisdom would also advise Him that it is better\nto create than not to create (OA,\n 39:599–600).[26]\n4.3 Does God act only by general volitions?\n\nArnauld devoted much of Réflexions to\nMalebranche’s position that God acts by general volitions and\nnot by particular volitions. In Book I of Réflexions,\nhis focus is on the order of nature and he tries to show that\nMalebranche’s claim that God acts only by general volitions is\nconfused and even self-contradictory. In Book II, his focus is on the\norder of grace and he attacks Malebranche’s claim that God does\nnot distribute grace by particular volitions.\n\nArnauld begins his criticism in Book I by claiming that Malebranche\nconfuses acting by general volitions and acting according\nto general laws. Arnauld grants that God acts according to\ngeneral laws. But against the claim that God acts by general\nvolitions, he provides an argument that is simple, and, his view,\ndecisive:\n\nWhatever [God] does, He does in particular, and not in general. But\nsince to will and to do, in God, are the same thing, given\nthat He creates each soul by a particular action, He must also will to\ncreate it by a particular will. (OA, 39:175)\n\n\nIn some passages, Malebranche’s language suggests that\nGod’s wisdom dictates that He engage in the act of creating that\nbest combines the goodness of the world created with the simplicity of\nthe laws according to which the world is created, and not\nwith simplicity of the volition whereby God creates\n(TNG, OM, 5:147). This suggests that for Malebranche\nGod does will particular created effects, though He wills that they\ntake place according to certain laws. But Arnauld did not think that\nthis was Malebranche’s view. For suppose that God creates the\nworld according to a simple set of laws. Let these laws, as regards\nbodies, be the laws of motion. A world created according to such laws\nmight be more perfect than a world not created according to general\nlaws, or created according to a different set of laws. But that would\nbe of no help to Malebranche. For he does not say that a world\nregulated by simpler laws is a more perfect world. Rather he maintains\nthat creating such a world is a simpler act of creation in God\nHimself. But it is not at all clear how simplicity of laws according\nto which the world is created would make God’s way of creating\nsimpler, especially if God’s creative activity includes the will\nto create every particular part of the creative world.\nMalebranche’s real position, according to Arnauld, emerges in\nthose passages in which he identifies the “ways” in which\nthe word is created with the actions whereby God creates. An example\nis the passage, “An excellent workman ought to proportion his\naction to his work; he does not accomplish by highly complex ways\n(voyes) what He can execute by simpler ones” (TNG,\nOM, 5:28). To this Arnauld objects that the volitions by which\nGod creates are particular.\n\nArnauld next points out that Malebranche does not say, without\nqualification, that God creates by general volitions. Rather,\nMalebranche says that God’s creative will is\n\nthe cause of a particular effect; but he calls it general, because he\nholds that God has this will only when He is determined to have it by\nan occasional cause, which must be a creature. (OA, 39:176).\n\n\nIn other words, according to Malebranche, God causes particular\neffects in creation, but the contribution of God’s volition, as\nopposed to the contribution of created occasional causes, is general.\nLater on, Arnauld says that, on Malebranche’s view, it is really\nonly the free volitions of creatures that can be said to determine\nGod, in view of His general volitions, to produce a particular effect.\nFor, according to Malebranche, God is the cause of every bodily event,\nincluding those which, together with the general laws, are supposed to\ndetermine any given consequent event. (OA, 39:230). But\nMalebranche is committed, so Arnauld argues, to the position that the\nfree volitions of creatures are not caused by God (OA,\n 39:248–57).[27]\n\nArnauld goes farther and says that Malebranche’s position on\nGod’s creative will is, in fact, self-contradictory. For\nMalebranche\n\nwas not of the opinion of those philosophers who believe that God\noriginally created all things, gave them the qualities necessary for\ntheir conservation and the powers they needed in order to act, and\nthen left them to act without further involving Himself.\n\n\nOn the contrary, Malebranche insists that “God is the sole cause\nof everything in the world, up to the smallest movement of the\nsmallest atom.” But he also holds that God “acts in the\nworld only as a universal cause, whose general volitions are\ndetermined by the … changes … in creatures, as by so\nmany occasional causes.” Arnauld tries to show that these two\npositions are inconsistent with one another (OA,\n39:231–37).\n\nNear the end of Book II of Réflexions, Arnauld takes\nup Malebranche’s arguments for the claim, “God does not\nact, in the order of grace, by particular volitions,” as\nsummarized by Malebranche in the Premier Eclaircissement to\nTNG (OA, 39:621). Malebranche says that the\nproposition in question can be proved by reason “in two ways;\nà priori & à posteriori; that is, by our\nidea of God, and by the effects of grace.” The chief “a\npriori” argument involves the claim that “to choose\noccasional causes, and to establish general laws for carrying out some\nwork, indicates an infinitely more extensive knowledge than to act by\nparticular volitions.” Arnauld retorts, “Is it something\nto be put up with, that human beings … should have the temerity\nto make themselves judges of what is a sign in God of greater\nintelligence and wisdom?” (OA, 39:624).\n\nArnauld quotes Malebranche’s statement, “The à\npriori proofs are too abstract to convince most people of the\ntruth I am proposing. It is more à propos to prove it\nà posteriori,” and goes on to consider the a\nposteriori arguments (OA, 39:625–43). He is less\nsarcastic in dealing with these arguments than with the a priori ones.\nHe says that there are “three or four of them, but they all\namount to the same thing: There are graces that are inefficacious, and\nthis would not occur if God gave His graces by particular\nvolitions.” He mentions three such arguments, based on the\npremise that graces are given to sinners who are not entirely\nconverted; on the premise that grace often falls upon hearts disposed\nin such a way that the grace does not bear fruit; and, finally, on the\npremise that graces given to sinners sometimes end up making them even\nmore guilty.\n\nArnauld assumes that these arguments have to do with “the true\ngrace of Jesus Christ, as defined by St. Augustine: Inspiratio\ndilectionis, ut cognita sancto amore faciamus, an inspiration of\nlove given to us so that we should do the good with holy\naffection.” Such grace is efficacious if it infallibly has its\neffect. But the effect in question may be either proximate\n(prochain) or remote (éloigné). As in\nthe famous example of Augustine, a grace may be efficacious in that it\nproduces the desire to be chaste, and yet not efficacious in that it\nfails to produces chastity itself. Similarly, Malebranche’s\narguments assume that “Every grace has the effect for which God\ngives it.” But once again, this phrase may refer to the effect\nfor which God gives the grace by His absolute will, or to the effect\nthat grace tends to produce by its nature and for which God gives the\ngrace by His antecedent will. Arnauld grants that if God gives\nefficacious graces by particular volitions, then there are none that\nfail to have the proximate effect, which God intends they have by His\nabsolute will. But they may well fail to have remote effects to which\nthey tend by their nature and which God wills only by His antecedent\nwill. For example, if an efficacious grace has the effect that a\nsinner repents, only to lapse back into sin, then the grace had the\nproximate effect God intended it to have by His absolute will, even\nthough it failed to have all the effect to which it tended by its\nnature and which God willed by His antecedent will. In this way, he\ndisposes of Malebranche’s three a posteriori arguments.\n\nArnauld ends Book II with a consideration of what he takes to be\nMalebranche’s master argument. It is a fourth a posteriori\nargument. He quotes from the Troisième\nEclaircissement:\n\nThere is no other way than [by saying that God does not act by\nparticular volitions] to reconcile the proposition in Holy Scripture,\n‘God wants to save all men,’ with this proposition,\n‘Not all men are saved’. (OA, 39:637)\n\n\nArnauld rejects this argument mainly because, like the other three a\nposteriori ones, it assumes that “God wills, by a true volition,\nthe salvation of all men, and the conversion of sinners”\n(OA, 39:641).\n\nArnauld agreed with Malebranche that God could have brought it about\nthat all men are saved and did not do so. But he favored an\nAugustinian view that “all men” in this context means\n“all sorts of men,” that is, men of all races,\noccupations, etc. He did not entirely reject the Thomistic view that\nGod’s will for the salvation of all men is God’s\n“antecedent will” rather than His “consequent\nwill,” that is, God’s will other things being equal rather\nthan God’s will all things considered. Arnauld points out that\nMalebranche’s position might be thought to be a version of the\nThomistic one, but adds that according to St. Thomas God’s\nantecedent will is a wish rather than an absolute volition (une\nvelleité plutôt qu’une volonté absolue)\n(Réflexions, OA, 39:198, cf.\n 39:576).[28]\n Arnauld firmly rejects any notion that God wills the sanctification\nand salvation of each and every person in a strong sense of\n“will” such that His will would be carried out unless\nthere were something to prevent it, or, in Malebranche’s words,\nto hold it in\n check.[29]\n4.4 Arnauld’s criticism of Malebranche’s occasionalism\n\nArnauld opened a different line of attack in his Dissertation sur\nles miracles le l’ancien loi. This new attack is directed\nagainst the occasionalism which is assumed in Malebranche’s\naccount of the wisdom of God’s ways of creating. In a foreword\nto the Dissertation, Arnauld says that he had completed his\ntreatment of the first two books of the Réflexions,\nand was beginning work on the third, when he received the fourth\nedition of the\n Treatise:[30]\n\nI had finished two books examining the new system of nature and grace,\nand there remained only one further book to complete the task, when I\nreceived from Rotterdam a new edition of the Treatise,\npublished that year, 1684, with several additions. The main one was a\nthird Éclaircissement, with the title: The\nfrequent miracles of the Old Law do not at all indicate that God often\nacts by particular volitions. And the only reason which the\nauthor of the system gives is that the miracles were done by the\nministry of the angels, who were their occasional causes.\n\n\nArnauld interrupted his work on the Réflexions to\nwrite the Dissertation, which was published in 1685 together\nwith the first chapter of Book Three of the Reflexions, a\nchapter dealing with Malebranche’s position that Jesus Christ,\nin his human nature, is the occasional cause of the distribution of\ngrace. Arnauld raises theological objections to both positions, but\nalso attacks the underlying occasionalism. The Dissertation\ntouched off a rapid series of replies and ounter-replies in 1685. The\nfirst volume of Reflexions was published later in 1685, and\nthe second and third volumes in 1686.\n\nArnauld begins his attack by citing the opening sentence of the\nDernier Éclaircissement, in which Malebranche says\nthat he expects his readers to agree with the principle that\n“God causes (fait) everything, and hence He\ncommunicates His power to creatures only by establishing them as\noccasional causes…” (OM, 5, 197). Arnauld adds that\nMalebranche\n\ndoes not understand ‘God causes everything’ as ordinary\nphilosophers do, who say that the creature does not act at all unless\nGod acts with it, which they call ‘concurrence’ …\nBut what he means when he says that God causes everything is that He\ncauses everything that one imagines the creature causes, and that the\ncreature causes nothing at all.\n\n\nIt is not difficult, Arnauld says, to show that the first conjunct, so\nunderstood, is false. For “it destroys the nature of intelligent\nbeings, who would not be free if they did not, as real causes, form in\nthemselves the determination of their will toward particular\ngoods”. (As Arnauld points out, the italicized words are\nMalebranche’s.) The second conjunct of the principle is\ndispatched in a similar way:\n\nFor intelligent beings receive from God their power to form the\ndetermination of their will toward particular goods. But it is not\nonly as occasional causes but as real causes that they form in\nthemselves that determination of their will. (OA, 5, 198)\n\n\nHaving established to his satisfaction that the principle “taken\ngenerally” is false, Arnauld goes on to say that there is no\nreason to deny that God has given angels power to move bodies and that\nthey are real, not mere occasional, causes of the miraculous events\nattributed to them. Again, “it is not so easy to\ndemonstrate” that our soul does not have the real power to move\nthe parts of the body to which it is united.\n\nIn the exchange of publications that grew out of the\nDissertation, Arnauld objects in a similar way to\nMalebranche’s use of occasionalism to explain “how grace\nacts in us without wounding [liberty]” (OM, 5, 8). In his\nexplanation, Malebranche distinguishes the effect of grace, which is\nfrom God and is not free, from the recipient’s free response,\nwhich is from the recipient and not from God. Arnauld says that\nMalebranche would have done well to heed Aquinas’s advice that\none should not distinguish “between what is from grace and what\nis from free will, as if the same thing could not be from both”\n(OA, 39, 114).\n\nBoth Malebranche and Arnauld continued to write about divine causality\nand human freedom in their later work. Arnauld’s late work on\nthe topic is describe in Section 6 below. Malebranche’s last\neffort on the topic was his Réflexions sur la Premotion\nPhysique, published in 1715, the year of his death.\n5. Arnauld and Leibniz\n\nOn February 11, 1686, while the controversy between Arnauld and\nMalebranche was at a peak of intensity, Leibniz wrote to Landgrave\nErnst von Hessen-Rheinfels, asking that the Landgrave send Arnauld a\nsummary of “a short discourse” on “questions of\ngrace, the concourse of God and creatures, the nature of miracles, the\ncause of sin and the origin of evil, the immortality of the soul,\nideas, etc.” (The Leibniz-Arnauld Correspondence,\nDie Philosophischen Schriften von Leibniz, herausgegeben von K. I.\nGerhardt, Vol. 2, hereinafter LA, 11). The ensuing\ncorrespondence occurred at a crucial point in the development of\nLeibniz’s philosophy. The Discourse on Metaphysics, the\nfinal version of the short discourse, marks the beginning of\nLeibniz’s mature metaphysics, and it shows the influence of the\ncorrespondence with Arnauld.\n\nLeibniz had corresponded with Arnauld some fifteen years earlier, in\nconnection with Leibniz’s efforts to reunite the Christian\nchurches. These efforts took a new turn in March, 1672, when Leibniz,\nthen just 25 years old, left Mainz for Paris on a secret political\nmission for his patron, Baron Johann Christian von Boineburg, who was\nin turn minister to Johann Philipp von Schönborn, the Elector of\nMainz. Both men were converts from Lutheranism to Catholicism.\nLeibniz’s diplomatic mission was a failure, but he had other\nreasons for wanting to visit Paris. He was eager to enter into the\nbrilliant intellectual life of the French capital, and he stayed\nthere, with a brief sojourn in England, until 1676, making the\nacquaintance of a number of leading intellectuals. During this time,\nhe undertook for the first time the serious study of mathematics. But\nhe also continued to work toward a philosophical position that he\nhoped would help reunify the churches.\n\nBefore coming to Paris, he had discussed the project of reunifying the\nchurches with his patron Boineburg, and had corresponded with Arnauld,\nin 1671, about the Eucharist, proposing an account of the real\npresence that he thought would be acceptable to both Lutherans and\nCatholics. But it was Leibniz’s interest in theodicy and related\nproblems about justification that flourished in Paris. There, in 1673,\nhe composed Confessio Philosophi, a dialogue in Latin between\na theologian and a philosopher that is sometimes referred to as\n“his first theodicy.” Thirty-seven years later in the\nTheodicy, Leibniz says,\n\nWhile I was in France, I communicated to M. Arnauld a dialogue I had\nwritten in Latin on the cause of evil and the justice of God. This was\nnot only before his disputes with R. P. Malebranche, but even before\nthe book on The Search after Truth had appeared. The\nprinciple that I here maintain, that sin was permitted because it was\ninvolved in the best plan for the universe, was already employed\nthere, and M. Arnauld did not seem hostile to it. (Theodicy,\n#211).\n\n\nSoon after Leibniz’s arrival in Paris, both Boineborg and von\nSchönborn died, and Leibniz turned for support to another\nimportant German noble and convert from Lutheranism to Catholicism,\nJohann Friedrich von Braunschweig-Lüneberg (Hannover). On 26\nMarch 1673, Leibniz wrote as follows to Johann Friedrich:\n\nThe famous Arnauld is a man of the most profound and wide-ranging\nthought that a true philosopher can have; his aim is not only to\nilluminate hearts with the clarity of religion, but, further, to\nrevive the flame of reason, eclipsed by human passions; not only to\nconvert heretics, but, further, those who are today in the greatest\nheresy—the atheists and libertines; not only to vanquish his\nopponents, but, further, to improve those of his persuasion. His\nthoughts, then, come to seeking how, so far as it is possible, a\nreform of abuses, frankly wide-spread among dissidents, would overcome\nthe cause of the division. In this design, on several points of\nimportance, he has made the first step and, as a prudent man, he goes\nby degrees. I am distressed that we have lost von Boineburg just when\nI have struck up an acquaintance with Arnauld; for I had hoped to\nbring these two minds, so similar in their honest soundness, on the\nroad to a closer agreement, The Church, as well as the Fatherland, has\nsustained a loss with this man (Quoted in Sleigh 1990, 15–16).\n\n\nThere is no record of any response by Arnauld to the Confessio\nPhilosophi, but when Leibniz returned to the problems of\ntheodicy, in 1686, he once again sought Arnauld’s cooperation by\nsending Arnauld the outline of the Discourse on Metaphysics\nthat was mentioned above. The outline sent to Arnauld was no more than\na list of the propositions that were to appear as the titles of the\nthirty-seven sections of the Discourse; the entire\ncorrespondence was carried out through the intermediary of\nHessen-Rheinfels; and the copies of letters received by the two major\ncorrespondents were sometimes defective. These facts, together with\nthe extreme subtlety of the philosophical contents of the letters,\nhave made interpretation of the correspondence very difficult.\n5.1 Leibniz’s notion of an individual substance\n\nProposition 8 in Leibniz’s outline is: “In order to\ndistinguish the actions of God from those of creatures, it is\nexplained wherein consists the notion of an individual\nsubstance” (LA,8). The notion of a substance is, for\nLeibniz, the notion of a thing that acts. To explain the notion of a\ncreated individual substance, therefore, he has to explain the notion\nof a created agent, which requires that he distinguish correctly\nbetween the actions of creatures and the actions of God. Part of\nLeibniz’s account of the notion of an individual substance is\ngiven in Proposition 13: “The individual notion of each person\nincludes once and for all everything that will ever happen to\nhim,” so that “one sees in [that notion] a priori\nproofs of the truth of each event, that is, why one [event] has\noccurred rather than another” (LA, 8). The debate\nbetween Arnauld and Leibniz begins here. Proposition 13, Arnauld said\nin his first letter to Leibniz, implies that “once God decided\nto create Adam, everything that has happened since and will ever\nhappen to the human race was and is obliged to happen with a more than\nfatal necessity” (LA, 27). For example, given\nproposition 13, if Adam exists, then necessarily Adam is father of\nCain and Abel as sons, grandfather of their children,\ngreat-grandfather of their children, etc., and everything that will\never happen to all of them is already determined.\n\nAfter a complicated three-way exchange of letters, Arnauld withdrew\nhis complaint in a letter dated September 28, 1686. At the outset,\nArnauld assumed that according to Leibniz whatever is contained in the\nindividual notion of a person is contained there as a necessary\nproperty of the person. But in response to Arnauld, Leibniz says that\nhe does not “ask for more of a connection here” than that\nwhich obtains between an individual substance and its “external\ndenominations” (LA, p. 56). Given this understanding of\nthe way that individual notion of a person contains everything that\nwill ever happen to him, Arnauld was prepared to concede that\nLeibniz’s position did not involve fatalism (LA,\n63–64).\n\nArnauld adds that he continues to have difficulty with Leibniz’s\naccount of “the possibility of things” and his conception\nof God as choosing the actual world out of an infinity of possible\nworlds, a point on which Leibniz agreed with Malebranche, and he asks\nLeibniz to clarify his “hypothesis of concomitance or agreement\nbetween substances,” and his statement that if a material thing\nis not merely an appearance, like a rainbow, or an accidental\naggregation of parts, like a pile of stones, it must have a\n“substantial form.” Leibniz had mentioned both of these\npoints in his immediately preceding letter (LA, 64–66,\n58). According to the hypothesis of concomitance no created substance\never acts upon any other created substance. But every later state of\nany given created substance is caused by an earlier state of the same\nsubstance, and the histories of the individuals are coordinated by God\nso that they fit together into the history of the actual world.\nLeibniz also says that one substance, x, may\n“express” another substance, y, more distinctly\nthan y expresses x, and in that case, one may say\nthat x causes changes to occur in y. He uses this\nposition to explain the relation of mind and body. Arnauld asked him\nto explain his view further by applying it to the example of a man who\nfeels pain when his arm is wounded, and the example of a man wants to\ntake off his hat and raises his arm. Arnauld also raises seven\nobjections to Leibniz’s claims about substantial forms\n(LA, 66–67) and defends the Cartesian view that\nextension is the real nature of matter, which he takes to imply that\nbodies have only varying degrees of “improper unity”\n(LA, 88).\n\nLeibniz provided the further clarification Arnauld requested in\nseveral long letters, which drew two replies from Arnauld. Arnauld\ncontinued to find Leibniz’s position unclear. “I have no\nclear notion,” says Arnauld,\n\nof what you mean by the word ‘expression’, when you say\nthat our soul expresses more distinctly (all other things being equal)\nwhat pertains to its body, since it is an expression even of the whole\nuniverse in a certain sense. (LA, 105)\n\n\nHe takes Leibniz’s views about substantial forms to be a strange\nand unsuccessful attempt “to ascribe true unity to bodies [in\nparticular the bodies of animals] which would not otherwise have\nit” (LA, 107).\n\nArnauld’s last letter to Leibniz is dated August 28, 1687.\nLeibniz tried to get Arnauld to continue the discussion, but Arnauld\nwas fully occupied with other projects. On August 31, 1687, Arnauld\nwrote to Hessen-Rheinfels, saying,\n\nIt would be preferable if [Leibniz] gave up, at least for a time, this\nsort of speculation, and applied himself to the greatest business he\ncan have, the choice of the true religion… a decision that is\nof such importance for his salvation. (LA, 110)\n\n5.2 Arnauld’s criticism of Leibniz’s Modal Metaphysics; Arnauld’s alternative\n\nEric Stencil has provided a general discussion of the disagreement\nbetween Leibniz and Arnauld about Modal Metaphysics. “Modal\nmetaphysics,” Stencil says, “is the theory of possibility,\nnecessity, essence and God’s relation to each” (Stencil.\n2016, p. 2). Arnauld attacks Leibniz’s thesis that the\nindividual concept of each person contains once for all everything\nthat will ever happen to him, Leibniz’s claim that there are\n“purely possible” substances, and his associated view that\nGod creates by choosing one from a multitude of possible worlds.\nStencil argues that Arnauld’s criticisms are based on a positive\nview which Stencil describes as “a sophisticated essence-based\nmodal actualism,” containing three theses: (1) Everything that\nexists is actual (ontological actualism). (2) The actual world is\nirreducibly modal; there is no reductive analysis of modality (modal\nactualism). (3) All true de re counterfactuals are grounded\nin the irreducibly modal essences of actually existing things\n(essence-based modal actualism) (Stencil, 2016, p. 2–3). Stencil\nsays that Arnauld’s view “could be developed into a\nplausible view in its own right” and that,\n\nwhen divorced from its theological motivations and with several\nimportant augmentations, could serve as a foundation for a plausible\nview that deserves to be considered in contemporary debates concerning\nmodal metaphysics. (p. 21)\n\n6. Arnauld’s Compatibilism\n\nThroughout his enormously active life as a philosopher and theologian,\nArnauld was above all concerned to defend the doctrine that human\nbeings, after the fall of Adam, can perform meritorious actions, but\nonly if the actions are the result of a supernatural grâce\nefficace par elle-même. Arnauld claimed to find this\ndoctrine in the writings of both Augustine and Aquinas and he defended\nJansen’s version of it against the charge of heresy, even though\nJansen’s version was significantly different from that espoused\nby Arnauld himself. But Arnauld, like Augustine, Aquinas, and Jansen,\nalso held that actions are meritorious only if they are free.\nFor this reason, Arnauld is sometimes said to be a\n“compatibilist.” For example, Robert Sleigh says,\n“It is worth noting that Leibniz and Arnauld both ascribed\ncompatibilism to St. Thomas and that both accepted compatibilism as\nwell” (Sleigh 1990, 29).\n\nThe position Arnauld defended and attributed to Augustine and Aquinas\nis, however, quite different from what is nowadays referred to as\n“compatibilism.” The position is connected with\nArnauld’s treatment of free will during the last decade of his\nlife, at the time when he was wrestling with Malebranche’s\ntheory of nature and grace. At that time, Arnauld developd the\nposition that the human will is free when and only when it is a\n“potestas ou facultas ad opposita.” But\nfirst, it is necessary to provide some background for the notion of\ngrâce efficace par elle-même.\n6.1 The Congregationes de Auxiliis and seventeenth-century controversy about grace\n\nThe point of departure for the disputes about grace and free will in\nseventeenth-century Europe was the inconclusive ending of the\nCongregationes de Auxiliis Divinae\n Gratiae.[31]\n These were ad hoc committees of Cardinals convoked to\nresolve a dispute between the Jesuits and Dominicans about grace,\npredestination, and free will. The dispute was concerned with a work\nby the Jesuit Luis de Molina, whose lengthy title indicates the scope\nand complexity of the dispute: Concordia Liberi Arbitrii\ncum Gratia Donis, Divina Praescientia, Providentia, Praedestinatione\net Reprobatione ad Nonnullos Primae Partis Divi Thomae Articulos\n(The Agreement of Free will with the Gift of Grace, Divine\nForeknowledge, Providence, Predestination and Reprobation, according\nto several articles in the First Part of St. Thomas). The work\nwas published in 1588 and was immediately attacked by the Dominican\nschool of Salamanca, led by Domingo Bañez. The\nCongregationes were convoked by Pope Clement VIII with the\naim of resolving what had become a widespread struggle between the two\norders. His hope was frustrated; the meetings began on January 2, 1598\nand were terminated on August 28, 1607 (the feast day of St.\nAugustine!) by Pope Paul V, who declared that neither side was\nheretical and that both sides had merit.\n\nA central question at the meetings of the Congregationes had\nto do with the relation of supernatural grace to free, meritorious\nacts of will. It was assumed on both sides that a human being cannot\nperform a meritorious act of will without supernatural assistance from\nGod, that God sometimes gives such assistance, and that it is\nsometimes part of God’s providential plan that the recipient\nfreely cooperate and thus perform the act in question. Meritorious\nacts of will include, among others, the decision to pray, to seek\nforgiveness for past sins, and to perform a good action for the love\nof God. It was assumed by both Jesuits and Dominicans that God’s\nprovidential plan is infallibly realized. Hence both sides agreed that\nsupernatural grace is, in at least some cases, infallibly\nefficacious (Vansteenberghe 1928, #2140). The issue was\nwhether the supernatural grace in question is efficacious by\nitself, in other words, intrinsically efficacious, or\nwhether it is efficacious only by virtue of the independent, divinely\nforeknown cooperation of the one who receives the grace\n(Vansteenberghe 1928, #2154–65). Several sorts of supernatural\ngrace were distinguished. For our purposes, the most important\ndistinctions are (a) between habitual grace (especially the\ntheological virtues of faith, hope, and charity) and actual grace; (b)\nbetween external actual grace (e.g., hearing a good sermon) and\ninternal actual grace (grace consisting in internal, mental acts); and\n(c) between internal actual grace of the intellect and internal actual\ngrace of the will. The question was whether the actual grace of the\nwill that infallibly produces a meritorious act of will is efficacious\nby itself, or whether instead its efficaciousness is explained in part\nby God’s knowledge that the recipient would cooperate with the\ngrace.\n6.2 Bañez, Jansen, and Arnauld on the nature of efficacious actual grace of the will\n\nJansen and Arnauld, like Bañez, defended the position that\nactual grace of the will is sometimes intrinsically\n efficacious.[32]\n But they disagreed about the nature of such grace. According to\nBañez, efficacious grace is the supernatural counterpart of\n“physical premotion.” The elusive notion of physical\npremotion is part of a general account of God’s causation of the\nactions of creatures. According to this account, God is a cause of a\ncreature’s action by bringing about in the creature a\n“premotion” that results in the creature’s carrying\nout the action in question. For Bañez, then, the actual grace\nin question is a sort of supernatural beginning of volition that is\nproduced in the human being by God and that infallibly results in a\nmeritorious act of will. Jansen rejected this notion, arguing that it\nis an obscure hypothesis that explains nothing. He held that\nefficacious grace is, instead, a feeling of love, which he called a\n“delectatio victrix (victorious pleasure)” and\nwhich infallibly leads to a meritorious act.\n\nArnauld accepted neither of those views. In a work published in 1656,\nhe considers two positions on the nature of efficacious grace, in so\nfar as it is the principle of good will: “Some say that such\ngrace consists in the mercy of God and in an inherent form [in the\ncreature],” while others say that it consists “only in the\nmercy of God, which brings about (operatur) the interior\nmovement of the mind.” Arnauld says “I am not far”\nfrom the second position, which he attributes to “Bradwardine,\nEstius, Tiphanius, and many other [Thomists]” (Dissertatio\ntheologica quadripartita, OA, 20:237).\n\nWhen Arnauld returned to questions about efficacious grace and free\nwill toward the end of his life, he was more categorical:\n\nThe true opinion of St. Augustine, St. Bernard, and St. Thomas\nconcerning actual grace, is that of Estius, who posits nothing created\nby God in the will in between the will of God, which he calls\nuncreated grace, and the free movement of the human will which the\nuncreated grace produces in the human will.\n\n\nJansen was “surely mistaken,” Arnauld adds, when he\ndefined actual grace as a non-deliberate “victorious\npleasure” (Letter to du Vaucel, 8 May 1693, OA,\n 3:636).[33]\n In a short treatise on human freedom written almost a decade earlier,\nArnauld illustrates his criticism of Jansen (without mentioning him by\nname) with an example: “Suppose that a man who is not very\ngenerous is approached by a beggar who asks him for alms. He\ndeliberates, proposes to himself the commandment of Christ, and gives\nalms for the sake of God” (De la liberté de\nl’homme, OA, 10:620, hereinafter\nLiberté). Jansen assumes that there is a\nnon-deliberate act of victorious pleasure in between the man’s\ndeliberation and his decision to give alms for the sake of God, and\nthat this non-deliberate pleasure is the actual grace that enables him\nto act in a meritorious way. Arnauld rejects this position and instead\nidentifies the efficacious grace with God’s merciful will that\nthe man arrive at the deliberate decision to give alms for the sake of\nGod.\n\nYet Arnauld also assumed that the man’s decision, like any\nmeritorious act of will, was free. Arnauld’s basic position on\nthe compatibility of the intrinsic efficacy of grace with the freedom\nof the volitions produced by the grace, is that we know from Scripture\nand Tradition, supported by philosophical reflection on God’s\nomnipotence (a) that the grace of Christ is intrinsically efficacious;\nand we know “from our own experience” (b) that our\nvolitions of the relevant kind are free. Hence we know that (a) and\n(b) are consistent, even though we have “great difficulty”\nin seeing how they fit together (OA, 10:436).\n6.3 The limits of Arnauld’s compatibilism\n\nArnauld was, then, a compatibilist of sorts. The compatibilism he\nespoused and attributed to Aquinas, however, was limited, and differs\nin a number ways from the sort of position philosophers now label\n“compatibilism.”\n\n1. Arnauld was not a determinist, nor did he attribute determinism to\nSt. Thomas. Arnauld cites Aquinas (Summa Theologicae I, 19,\n3) as an authority in favor of his own view that God’s will with\nregard to creatures is not necessary (OA, 39:598).\n\n2. Arnauld held that freedom of human volitions is\nincompatible with the determination of the choices by laws of\nnature together with temporally antecedent events. Thus he responds to\nMalebranche’s statement that the destruction of Jerusalem by the\nRomans some seventy years after the death of Jesus was “a\nnecessary outcome of the laws of nature,” by saying, “It\nis clear … that a long series of diverse events, that depended\non an infinity of free movements of the wills of men, could have been,\nand indeed were, regulated by the providence of Him who has an\nalmighty power to move the hearts of men, and to direct them as He\npleases … But it cannot be said that it was a necessary\nconsequence of the laws of nature without degrading human beings,\nmaking them act like lower animals, and depriving them of their\nliberty, a position that has been declared anathema by the\nCouncil of Trent” (OA, 39:301). He repeats the\ncriticism a few pages later:\n\nAs I have shown above, to hold that events that depended on an\ninfinity of free volitions of human beings were a necessary\nconsequence of laws of nature is to deprive human beings of their\nfreedom, after the example of Wycliffe. (OA,\n 39:316).[34]\n\n\n3. According to the position Arnauld attributes to Aquinas, the\nsinful choices of human beings are not determined by any\ncause exterior to the sinner. Arnauld agreed with Aquinas that God is\nthe sole exterior cause of the volitions of a human being, that is,\nthe only efficient cause of volitions outside the human being himself\nor herself, but God never causes a person to sin. Arnauld cites\nSumma Theologiae, I–IIae, 9, 6, ad 3, in which Aquinas\nanswers the objection that God cannot be the sole exterior cause of\nsinful choices. Aquinas says,\n\nGod, as the universal mover, moves the will of man to the universal\nobject of the will, which is the good. And without this universal\nmovement man cannot will anything; but man through reason determines\nhimself to will this or that, whether it be a true or only an apparent\ngood. Nevertheless God sometimes moves some men especially to will\nsomething determinate that is good (interdum movet Deus\nspecialiter aliquos ad aliquid determinatè volendum quod est\nbonum), as in those He moves by grace. (Vera S. Thomae de\ngratia sufficiente et efficaci doctrina dilucide explanata,\nOA,\n 20:63).[35]\n\n\nArnauld’s purpose in citing this text is to show that, according\nto Aquinas, when one sins, one is not moved by\n grace.[36]\n But the text, together with the premise that there is no exterior\ncause of human volition other than God, implies that sinful choices\nare not determined by any cause outside the sinner.\n6.4 Arnauld’s late position on the nature of free will\n\nIn several letters toward the end of his life, Arnauld recommends a\n“little Latin text” on human freedom that he wrote at the\ntime he was wrestling with Malebranche’s theory of nature and\ngrace, saying that it is particularly helpful in connection with the\nproblem of reconciling intrinsically efficacious grace with freedom of\n will.[37]\n The core of Arnauld’s new theory is that the human soul has\nfreedom of will with respect to a true or apparent good when it has\nthe power to will that good and the power not to will it. In such\ncases, the soul “determines itself” to will or not will\nthe good in question. The human soul is said to have this power with\nrespect to any particular good it apprehends, as long as the\nparticular good does not encompass all the good toward which the will\ntends. Arnauld cites I–IIae, 13, 6 as part of the Thomistic origin of\nhis theory:\n\nMan does not choose of necessity. And this is because that which is\npossible not to be, is not of necessity…. For man can will and\nnot will, act and not act; again, he can will this or that, and do\nthis or that. The reason of this is seated in the very power of the\nreason. For the will can tend to whatever the reason can apprehend as\ngood. Now the reason can apprehend as good, not only this, viz.\n“to will” or “to act,” but also this, viz.\n“not to will” or “not to act.” Again, in all\nparticular goods, the reason can consider an aspect of some good, and\nthe lack of some good, which has the aspect of evil: and in this\nrespect, it can apprehend any single one of such goods as to be chosen\nor to be avoided. The perfect good alone, which is happiness, cannot\nbe apprehended by the reason as an evil, or as lacking in any way.\nConsequently man wills happiness of necessity, nor can he will not to\nbe happy, or to be unhappy… Therefore man chooses not of\nnecessity, but freely. (cited at OA, 10:630–31)\n\n\nArnauld follows Aquinas in saying that the will is not free with\nregard to two objects, first, happiness, apprehended as the ultimate\nobject of volition, and, second, God, seen face to face by the blessed\nin heaven. In these two cases, one wills (or loves) the object with\n“necessity of nature,” and hence not freely. In all other\ncases, the will is free, and when one wills, one does so\n freely.[38]\n Arnauld provides a compact formula for this theory: “The best\nand shortest notion one can have of free will is to say with St.\nThomas that it is a potestas ou facultas ad opposita”\n(Letter to Bossuet, juillet 1693, OA,\n 3:662).[39]\n6.5 The advantages Arnauld claims for his new theory over Jansen’s theory\n\nArnauld claims a number of advantages for his theory of free will over\nthat of Jansen. In particular, he claims that, when combined with the\naccount of the nature of grace that he found in Estius, it makes it\neasier to reconcile the intrinsic efficacy of grace with freedom.\n\nIn following [Estius’s opinion regarding efficacious grace], it\nis much easier to explain the efficacy of the grace, and to reconcile\nit with freedom, especially when we define free will, following St.\nThomas, as a facultas ad opposita. (Letter to Bossuet,\njuillet 1694, OA, 3:664).\n\n\nExplaining the efficacy of grace is easier on Estius’s theory\nthan on the competing theories, because it is simpler. On the\ncompeting theories, which include Jansen’s, the efficacy of\nactual grace of the will depends on a connection of some sort, within\nthe mind of a creature, between a created grace, like Jansen’s\n“victorious pleasure,” and a meritorious choice.\nEstius’s theory is simpler: The efficacy of actual grace is a\ndirect consequence of the general principle that God’s absolute\nwill is infallibly realized.\n\nBut how does Estius’s theory, combined with the account of free\nwill that Arnauld derived from St. Thomas, help to reconcile the\nefficacy of grace with free will? According to Jansen, freedom of will\nis the same as spontaneity, and so every act of will is essentially\nfree. Jansen qualifies that position by adding that during life here\non earth, human beings have another kind of freedom:\n\nThe freedom of man the pilgrim is not only exempt from constraint, but\neven from immutable voluntary necessity (necessitatis\nimmutabilis voluntariae), that it, this freedom is indifferent\nbetween doing good and doing evil, between acting and not acting.\n(Quoted by Arnauld in Seconde Apologie, OA, 17:242).\n\n\nWhen he says that the will is indifferent as between doing good and\ndoing evil, and between acting or not acting, during this life here\nbelow, Jansen means that during life on Earth, the will remains\nmutable or “flexible” between doing good and doing evil,\nand again, willing or not willing any particular action or end. In\nother words, the will is not confirmed in good or evil during this\nlife in such a way that it could not fall away from willing the good\nor be converted from willing what is evil, and again in such a way\nthat it could not cease willing what it does will or begin willing\nwhat it does not will.\n\nNow on theories like those of Jansen and Bañez, the intrinsic\nefficacy of grace involves the determination of a person’s\nvolition by an antecedent state of his or her mind, and this seems to\nconflict with the proposition that the volition is free. On\nEstius’s view, on the other hand, a person’s meritorious\nvolition is determined not by an antecedent state of his or her mind,\nbut rather by the will of God. Is this an improvement, with respect to\nexplaining the compatibility of efficacious grace with free will?\nArnauld says it is, “especially when we define free will,\nfollowing St. Thomas, as a facultas ad opposita.”\n\nHere Arnauld appeals to the Thomistic principle that when God causes a\ncreature to act, He always causes the creature to act in accordance\nwith its nature. Paraphrasing Aquinas (Summa Theologiae, I,\n82, 1, ad 3), Arnauld says,\n\nWhen God works our volition in us, He brings it about that we will in\nconformity with our nature, that is by determining ourselves to what\nwe are not determined by nature. Thus no matter with what efficacy the\nmind is moved by God, it acts as master of its very own action, and it\nwills because it wills, determining itself to all other things by its\nvolition to be happy, and hence it acts freely\n(Liberté, OA,\n 10:616).[40]\n\n\nArnauld’s line of thought seems to be as follows: Human beings\nare attracted to limited goods only as means to the unlimited good of\nhappiness. Therefore, whenever a human being is attracted to a limited\ngood, he or she can attend to its goodness and will it, or attend to\nsome way in which it falls short of the unlimited good and refrain\nfrom willing it. Which of these options is realized is determined by\nthe human being, or more precisely, the human being’s mind;\nthus, in willing or not willing any limited good, the human mind is\nself-determining and free. All this is part of the nature of the human\nmind. So if God moves the human mind to will a limited good, He moves\nit to will in a self-determining and free way.\n\nIf pressed for more details about how God by His merciful will\n(uncreated grace) moves a human being to will a particular good, while\nyet leaving it up to the human being whether he or she wills that\ngood, Arnauld would surely say that we human beings cannot understand\nGod’s causality well enough to supply such details. Our\ninability to understand God’s causality with regard to the\ncreated world is a common theme in Arnauld. It is expressed forcefully\nin his first contribution to the Leibniz-Arnauld exchange, written in\n1686, not long after Liberté. Arnauld says that\nalthough we are certain that God, “by a single and very simple\nact, which is His essence,” knows all things, including things\nthat might not have been, and wills things that He might not have\nwilled by His will, which is also His essence, nevertheless we cannot\nunderstand how God does these things, because “as far\nas we are concerned (à notre égard) God dwells\nin inaccessible light” (LA, p.\n 31–32).[41]\n\nBefore presenting the above theory of free will in\nLiberté, Arnauld prepares the ground by presenting two\nexamples in which a person’s volition occurs\n“infallibly” and yet freely, in the sense of freedom\n“that is necessary and sufficient for merit or demerit”\n(Liberté, OA, 10:620). The examples are\npreceded by the statement,\n\nHowever infallible be the determination by which the will is\ndetermined with the attention of reason, to objects to which it is not\nnaturally determined, freedom suffers no damage\n(préjudice); because the infallible determination does\nnot prevent the soul from willing because it wills; and hence it is\nmaster of its action (Liberté, OA,\n10:615–16).\n\n\nThe first example is that of a prince who is in love with a woman and\nhas “a vehement passion for the pleasures of the flesh.”\nIf the woman offers herself to the prince, “he will infallibly\nsatisfy his passion.” The second example is that of a cruel and\nrevengeful king, who has been offended by one of his subjects and has\nthe subject in his power: “Infallibly he will destroy\n him.”[42]\n Everyone who is not “entirely barbarian,” says Arnauld,\nwill agree that the prince and the king have acted demeritoriously and\ndeserve punishment. Thus all such people agree that the king and the\nprince acted in a relevantly free way.\n\nOne might take these passages to suggest that the freedom necessary\nand sufficient for merit and demerit is compatible with determination\nof the will by psychological causes. But this misses Arnauld’s\npoint, and is an unlikely interpretation. To begin with, Arnauld\nsurely realized that it was not impossible for the lascivious prince\nor the cruel king act otherwise than in the way described; people do\nsometimes act out of character. Furthermore, Arnauld seems to think of\ninfallibility, like its cousin, certainty, as a matter of degree. This\nis indicated by the phrase, “However infallible be the\ndetermination by which the will is determined with the attention of\nreason …” The certainty that the cruel king and the\nlascivious prince would act in the ways indicated could have been very\nhigh and yet they could have acted otherwise.\n\nArnauld’s point is not that the actions of the prince and the\nking are causally determined by psychological states antecedent to\ntheir volitions. In both cases he says that the action is free because\nthe person could have willed not to perform the action, or again,\nbecause the person’s will was a potestas ad opposita.\nArnauld’s point is that our certainty that the prince and the\nking will act in the ways described does not lessen our certainty that\nthey will act freely. The same, he says, is true of our certainty that\na meritorious act will be carried out as a result of efficacious\ngrace, that is, as a result of God’s merciful will moving a\nperson to that act. Arnauld claims that our certainty about the\nfreedom of the act produced by efficacious grace, like our certainty\nabout the freedom of the actions of the prince and the king, is well\ngrounded because in all of these cases, the person had the power to\nrefrain from the act in question; in all of these cases, the\nperson’s will is a facultas ad\n opposita.[43]\n\nThere is, of course, an important difference between examples like\nthose of the prince and the king, and example of an action to which\none is moved by efficacious grace. In examples of the former sort, the\naction occurs only with very great, but not absolute, certainty,\nwhereas in the case of efficacious grace, the action follows with\nabsolute certainty upon God’s intention that it take place. This\ndifference may seem to damage Arnauld’s case: One can plausibly\nsay that it was within the power of the prince, for example, not to\nwill to satisfy his lust, precisely because it was not absolutely\ncertain that, in the given circumstances, he would do so. But no\nsimilar claim can be made about the person whom God moves, by\nefficacious grace, to elicit a meritorious volition. Yet Arnauld\ninsists that in the latter case also, it is within the power of the\nperson not to elicit the volition. It is at this point that\nArnauld’s views about the mysteriousness of divine causality\ncome into play. Our inability to understand how God moves a person to\na meritorious volition, while leaving it within the person’s\npower not to elicit the volition, thus moving the person to will in a\nself-determining way, is not, in Arnauld’s view, surprising, for\nwe are unable, in general, to understand how God produces effects\noutside of Himself.\n\nArnauld’s work between 1682 and 1694 is a testament to his\nintellectual vitality. It is remarkable that he was hard at work,\nuntil his death at the age of 82, on a set of connected controversies\nand issues, both philosophical and theological, having to do with\ncreation, grace, and free will. Though he did not construct a\nphilosophical system, he stands out in a century of geniuses for the\nvigorous and penetrating way in which he dealt with many of the\nimportant philosophers and philosophical problems of the time.\n",
    "bibliography": {
        "categories": [
            "<a name=\"ArnWor\">Arnauld’s Works</a>",
            "<a name=\"RelEarModWor\">Related Early Modern Works</a>",
            "<a name=\"SecWorCit\">Secondary Works Cited</a>",
            "<a name=\"OthRecSecWor\">Other Recommended Secondary Works</a>"
        ],
        "cat_ref_text": {
            "<a name=\"ArnWor\">Arnauld’s Works</a>": [
                "</h3>\n<h4>Principal Editions</h4>\n<ul>",
                "Arnauld, Antoine, <em>Oeuvres de Messire Antoine Arnauld</em> (43\nvols.) (edited by G. Du Pac De Bellegarde and J. Hautefage, with a\n<em>Vie de Messire Antoine Arnauld by N. De Larrière)</em>\nParis-Lausanne: Sigismond D’Arnay et Cie 1775-83. Cited as\n<strong><em>OA</em></strong>.",
                "<em>Oeuvres Philosophiques d’Arnauld</em> (6 vols.) (edited\nand introduced by Elmar J. Kremer and Denis Moreau) Bristol: Thoemmes\nPress, 2003.\n</ul>\n<h4>Other Editions of Works by Arnauld</h4>\n<ul>",
                "<em>Des vraies et des fausses idées</em>, Librairie\nArthème Fayard, 1986. (A reprinting of the original 1683 text,\nbut without the pagination of the original)",
                "<em>Des vraies et des fausses idées</em>, a critical\nedition by Denis Moreau, Paris, J. Vrin, 2011.",
                "<em>Examen d’un Ecrit qui a pour titre: Traité de\nl’essence du corps, et de l’union de l’ame avec le\ncorps contre la philosophie de M. Descartes</em>, <em>Texte revu par\nEmmanuel Faye</em>, Librairie Arthème Fayard, 1999.",
                "<em>Nouveau éléments de géometrie\nd’Arnauld</em>, critical edition by Dominique Descotes, in\n<em>Géometries du Port-Royal</em>, Paris, Champion, 2009.",
                "<em>La logique ou l’Art de penser</em>, Édition\ncritique par Pierre Clair et François Girbal, Seconde\nédition revue,",
                "<em>La Logique ou l’art de penser</em>, critical edition by\nDominique Descartes, Paris, Champion, 2011.\n</ul>\n<h4>English Translations of Arnauld’s Works</h4>\n<ul>",
                "Arnauld, Antoine, and Lancelot, Claude, <em>General and Rational\nGrammar: The Port-Royal Grammar</em>, translated by Jacques Rieux and\nBernard E. Rollin, The Hague: Mouton, 1975.",
                "Arnauld, Antoine, <em>The Art of Thinking, Port-Royal Logic</em>,\ntranslated by James Dickhoff and Patricia James, New York: Library of\nLiberal Arts, 1964.",
                "Arnauld, Antoine and Nicole, Pierre, <em>Logic or the Art of\nThinking</em>, translated by Jill Vance Buroker, Cambridge: Cambridge\nUniversity Press, 1996.",
                "Arnauld, Antoine, <em>On True and False Ideas</em>, translated by\nElmar J. Kremer, Lewiston/Queenston: The Edwin Mellen Press,\n1990.",
                "Arnauld, Antoine, <em>On True and False Ideas</em>, translated by\nStephen Gaukroger, Manchester: Manchester University Press, 1990.\n</ul>\n<h4>Translation of Arnauld’s Works from Latin into French</h4>\n<ul>",
                "<em>Arnauld, Textes philosophiques</em>, Introduction, traduction\net notes par Denis Moreau, Paris: Presses Universitaires de France,\n2001.\n</ul>\n<h4>Individual Works of Arnauld Cited</h4>\n<ul>",
                "<em>Défense contre la Réponse au Livre des vraies et\ndes fausses Idées</em>, <em>OA</em>, 38: 367–671.",
                "<em>De la fréquente communion</em>, <em>OA</em>, 27:\n71–673.",
                "<em>Des vraies et des fausses idées</em>, <em>OA</em>, 38:\n177–365.",
                "<em>Dissertation sur les Miracles de l’ancienne loi</em>,\n<em>OA</em>, 38: 673–741.",
                "<em>Dissertatio theologica quadripartita</em>, <em>OA</em>, 20:\n159–314.",
                "<em>Examen d’un Ecrit qui a pour titre: Traité de\nl’essence du corps, et de l’union de l’âme\navec le corps contre la philosophie de M. Descartes</em>, <em>OA</em>,\n38: 89–176.",
                "<em>Grammaire génerale et raisonnée</em>,\n<em>OA</em>, 16: 3–82.",
                "<em>Instruction, par demandes &amp; par réponses touchant\nl’accord de la Grace avec la liberté</em>, <em>OA</em>,\n10: 435–41.",
                "<em>Humanae Libertatis Notio</em>, in Kremer and Moreau,\n<em>Oeuvres Philosophiques d’Arnauld</em>, 2003, end of Volume\n6; and Moreau, <em>Arnauld, Textes philosophiques</em>, 2001, pp.\n236–59.",
                "<em>De la liberté de l’homme</em>, <em>OA</em>, 10:\n610–14. (A French translation, by Pasquier Quesnel, of\n<em>Humanae Libertatis Notio</em>.)",
                "<em>La Logique ou l’Art de penser</em>, <em>OA</em>, 16:\n99–416.",
                "<em>Nouvelle Défense de la Traduction du Nouveau Testament\nimprimée a Mons contre M. Mallet</em>, <em>OA</em>, 7:\n67–915.",
                "<em>Nouveaux éléments de\ngéométrie</em>, <em>OA</em>, 42: 1–342.",
                "<em>Neuf lettres de M. Arnauld au R.P. Malebranche sur les\nidées génerales, la grâce et\nl’étendue intelligible</em>, <em>OA</em>, 39:\n1–153.",
                "<em>Première Apologie pour Jansénius</em>,\n<em>OA</em>, 16: 39–323.",
                "<em>Réflexions philosophiques et théologiques sur le\nnouveau système de la nature et de la grâce</em>,\n<em>OA</em>, 39: 155–848.",
                "<em>Règles du bon sens</em>, <em>OA</em>, 40:\n153–260.",
                "<em>Traduction du Discours latin prononcé par M. Arnauld en\nrecevant le Bonnet de Docteur</em>, <em>OA</em>, 43: 11–13.",
                "<em>Seconde Apologie pour Jansénius</em>, <em>OA</em>, 17:\n1–637.",
                "<em>Vera S. Thomae de gratia sufficiente et efficaci doctrina\ndilucide explanatae</em>, <em>OA</em>, 20: 39–77.\n</ul>\n<h3>"
            ],
            "<a name=\"RelEarModWor\">Related Early Modern Works</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>La Bible</em>, traduction de LeMaître De Sacy,\n(préface et textes d’introduction établis par\nPhilippe Sellier) Paris: Robert Laffont, 1990.",
                "<em>The Philosophical Writings of Descartes</em> (translated by\nJohn Cottingham, Robert Stoothoff, and Dugald Murdoch) 2 volumes,\nCambridge: Cambridge University Press, 1984–85. Cited as\n<em>Descartes</em>.",
                "<em>Briefwechsel Leibniz, Arnauld und dem Landgrafen Ernst von\nHessen-Rheinfels</em>, in <em>Die philosophischen schriften von\nGottfried Wilhelm Leibniz, herausgegeben von C. I. Gerhardt</em>,\nBerlin, 1875–1890, reprint, Hildesheim: Georg Olms, 1965, volume\n2. Cited as <strong><em>LA</em></strong>.",
                "Leibniz, Gottfried Wilhelm, <em>Discourse on Metaphysics,\nCorrespondence with Arnauld, Monadology</em>, (translated by George R.\nMontgomery), LaSalle, Illinois: Open Court Publishing Co., 1950",
                "–––, <em>Theodicy, Essays on the Goodness of\nGod, the Freedom of Man, and the Origin of Evil</em> (translated by E.\nM. Huggard and edited with an introduction by Austin Farrer) La Salle,\nIL: Open Court Press, 1985.",
                "Malebranche, Nicolas, <em>Oeuvres complètes de\nMalebranche</em>, (direction: André Robinet) 20 volumes, Paris:\nJ. Vrin, 1958–74. Cited as <strong><em>OM</em></strong>.",
                "–––, <em>Treatise on Nature and Grace</em>\n(translated by Patrick Riley) Oxford: Clarendon University Press,\n1992. (Riley translates an early edition of the\n<em>Traité</em>, which does not contain some texts on which\nArnauld comments. Hence, the translations of the text found in volume\n5 of <em>OM</em> are by the author of this entry.)",
                "Molina, Luis de, <em>On Divine Foreknowledge (Part IV of the\nConcordia)</em>, (translated, with an introduction and notes, by\nAlfred J. Freddoso), Ithaca and London: Cornell University Press,\n1988.",
                "Reid, Thomas, <em>Essays on the Intellectual Powers of Man</em>\n(1785), (edited by Derek R. Brookes) Edinburgh: Edinburgh University\nPress, 2002.\n</ul>\n<h3>"
            ],
            "<a name=\"SecWorCit\">Secondary Works Cited</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Faye, Emmanuel, 2005, “The Cartesianism of Desgabets and\nArnauld and the Problem of Eternal Truths,” in D. Garber and S.\nNadler (eds.), <em>Oxford Studies in Early Modern Philosphy</em>,\nOxford: Clarendon Press.",
                "Hacking, Ian, 1975a, <em>The Emergence of Probability</em>,\nCambridge: Cambridge University Press.",
                "Hacking, Ian, 1975b, <em>Why Does Language Matter to\nPhilosophy?</em>, Cambridge: Cambridge University Press.",
                "Knox, R.A., 1950, <em>Enthusiasm</em>, Oxford: Oxford University\nPress.",
                "Kremer, Elmar J., 1995, “L’Accord de la Grace avec la\nLiberte selon Arnauld,” <em>Chroniques de Port-Royal, Antoine\nArnauld (1612–1694) Philosophe, Ecrivain, Theologien</em>,\nParis: Bibliotheque Mazarine.",
                "Kremer, Elmar J., 2000, “Malebranche on Human\nFreedom,” in S. Nadler (ed.), <em>The Cambridge Companion to\nMalebranche</em>, Cambridge: Cambridge University Press.",
                "––– (ed.), 1996, <em>Interpreting Arnauld</em>,\nToronto: University of Toronto Press.",
                "Moreau, Denis, 1999, <em>Deux Cartésiens</em>, Paris: J.\nVrin.",
                "–––, 2011, “La ‘Philosophie\nd’Antoine Arnauld’: Un Bilan,” in <em>Chroniques de\nPort-royal</em>, 115-128.",
                "Moreau, Denis, 2004, <em>Malebranche</em>, Paris: J. Vrin.",
                "Marion, Jean-Luc, 1981, <em>Sur la théologie blanche de\nDescartes</em>, Paris: PUF.",
                "Marušić, Jennifer Smalligan, 2014, “Propositions\nand Judgments in Locke and Arnauld: A Monstrous and Unholy\nUnion?” <em>Journal of the History of Philosophy</em>, 52(2):\n255–80.",
                "Nadler, Steven, 1989, <em>Arnauld and the Cartesian Philosophy of\nIdeas</em>, Princeton: Princeton University Press.",
                "–––, 1995, “Occasionalism and the Question\nof Arnauld’s Cartesianism,” in Ariew, Roger and Grene,\nMarjorie, editors, <em>Descartes and His Contemporaries</em>, Chicago:\nUniversity of Chicago Press, pp. 129–144.",
                "–––, 2008, “Arnauld’s God,”\n<em>Journal of the History of Philosophy</em>, 46(4):\n517–38.",
                "–––, 2011, “Conceptions of God,” in\n<em>The Oxford Hndbook of Philosophy in Early Modern Europe</em>,\nedited by Desmond M. Clarke and Catherine Wilson, 2011.",
                "Nelson, Alan, 1996, “The Falsity in Sensory Ideas: Descartes\nand Arnauld,” in Kremer (ed.) 1996, pp. 13–32.",
                "Pearce, Kenneth L., 2016, “Arnauld’s Verbal\nDistinction between Ideas and Perceptions,” <em>History and\nPbilosophy of Logic</em>, 37(4): 375–90.",
                "–––, 2019, “Locke, Arnauld, and Abstract\nIdeas,” <em>British. Journal for the History of Philosophy</em>,\n27(1): 75–94.",
                "–––, 2021, “Ideas and Explanation in Early\nModern Philosophy”, <em>Archiv für Geschichte der\nPhilosophie</em>, 103(2): 252–80.",
                "–––, forthcoming, “Thinking with the\nCartesians and Speaking with the Vulgar,” <em>Journal of the\nHistory of Philosophy</em>.",
                "Sleigh, Jr., R.C., 1996, “Arnauld on Efficacious Grace and\nFree Choice,” in Kremer (ed.) 1996, pp. 164–75.",
                "–––, 1990, <em>Leibniz and Arnauld, a Commentary\non Their Correspondence</em>, New Haven: Yale University Press.",
                "Stencil, Eric, 2016, “Essence and Possibility in the\nLeibniz-Arnauld Correspendence,” <em>Pacific Philosophical\nQuarterly</em>, 97(1): 2–26.",
                "–––, 2019, “Arnauld’s God\nReconsidered,” <em>History of Philosophy Quarterly</em>, 36(1):\n19–38.",
                "Stencil, Eric and Walsh, Julie, (2016), “Arnauld, Power, and\nthe Fallibility of Infallible Determination,” <em>History of\nPhilosophy Quarterly</em>, 33(3): 237–56",
                "van der Schaar, Maria, 2008, “Locke and Arnauld on Judgments\nand Propositions,” <em>History and Philosophy of Logic</em>,\n29(4): 327–41.",
                "Vansteenberghe, E., 1929, “Molinism,” in the\n<em>Dictionnaire de Théologie Catholique</em>, sous la\ndirection de A. Vacant, E. Mangenot et É. Aman, Tome\nDixième Paris-VI: Librairie Letouzey et Ané, cols.\n2094–2187.\n</ul>\n<h3>"
            ],
            "<a name=\"OthRecSecWor\">Other Recommended Secondary Works</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Antoine Arnauld (1612–1694), Philosophe,\nÉcrivain, Théologien</em>, Chroniques de Port-Royal,\nNuméro 44, Paris: Bibliothèqie Mazarine, 1995.",
                "<em>Port-Royal et l’Oratoire</em>, Chroniques de Port-Royal,\nNuméro 50, Paris: Bibliothèque Mazarine, 2001.",
                "Cook, Monte, 1991, “Malebranche vs. Arnauld,”\n<em>Journal of the History of Philosophy</em>, 29(2):\n183–99.",
                "Kilcullen, John, 1988, <em>Sincerity and Truth: Essays on Arnauld,\nBayle and Toleration</em>, Oxford: Oxford University Press.",
                "Kremer, Elmar J. (ed.), 1994, <em>The Great Arnauld and Some of\nHis Philosophical Correspondents</em>, Toronto: University of Toronto\nPress.",
                "Kremer, Elmar J. (ed.), 1996, <em>Interpreting Arnauld</em>,\nToronto: University of Toronto Press.",
                "Laporte, Jean, 1922, <em>La Doctrine de la Grace chez\nArnauld</em>, Paris: Presses Universitaires de France.",
                "Martin, John N., 2011, “Existential Import in Cartesian\nSemantics,” <em>History and Philosophy of Logic</em>, 32(3):\n211–039.",
                "–––, 2012, “Existential Commitment and the\nCartesian Semantics of the Port-Royal Logic,” in <em>The Square\nof Opposition: A General Framework for Cognition</em>, edited by\nJean-Yves Beziau and Gillman Payette, Bern: Peter Lang.",
                "–––, 2017, “Extension in the Port-Royal\nLogic,” <em>South American Journal of Logic</em>, 3:\n291–311.",
                "–––, 2020, <em>The Cartesian Semantics of the\nPort-Royal Logic</em>, New York: Routledge.",
                "Michon, Cyrille, 2013, “Le compatibilisme thomiste\nd’Antoine Arnauld,” <em>Dix-septième\nsiècle</em>, 2(259): 265–279.",
                "Ndiaye, A.-R., 1991, <em>La Philosophie d’Antoine\nArnauld</em>, Paris: J. Vrin.",
                "Paola, Nicolas, 2013, “Arnauld et la foi implicite: un\nrefuge cartésien,” <em>Dix-septième\nsiècle</em>, 2(259): 249–63.",
                "Pariente, Jean-Claude, 1995, <em>Arnauld, Philosophie du langage\net de la connaissance</em>, Paris: J. Vrin.",
                "–––, 1985, <em>L’analyse du langage\nà Port-Royal</em>, Paris: Les Editions du Minuit.",
                "Schmaltz, Tad M., 2002, <em>Radical Cartesianism, The French\nReception of Descartes</em>, Cambridge: Cambridge University\nPress",
                "Van Cleve, James, “Arnauld’s Silence on the Creation\nof the Eternal Truths,” <em>Res Philosophica</em>, 96(4):\n445–70.",
                "Yolton, John, 1984, <em>Perceptual Acquaintance from Descartes to\nReid</em>, Minneapolis: University of Minnesota Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<p>The citations abbreviation <em>OA</em> is identified below, in the\nfirst reference of Principle Editions. The citations abbreviations\n<em>LA</em> and <em>OM</em> are identified in the section Related\nEarly Modern Works below.</p>\n<h3><a name=\"ArnWor\">Arnauld’s Works</a></h3>\n<h4>Principal Editions</h4>\n<ul>\n<li>Arnauld, Antoine, <em>Oeuvres de Messire Antoine Arnauld</em> (43\nvols.) (edited by G. Du Pac De Bellegarde and J. Hautefage, with a\n<em>Vie de Messire Antoine Arnauld by N. De Larrière)</em>\nParis-Lausanne: Sigismond D’Arnay et Cie 1775-83. Cited as\n<strong><em>OA</em></strong>.</li>\n<li><em>Oeuvres Philosophiques d’Arnauld</em> (6 vols.) (edited\nand introduced by Elmar J. Kremer and Denis Moreau) Bristol: Thoemmes\nPress, 2003.</li>\n</ul>\n<h4>Other Editions of Works by Arnauld</h4>\n<ul>\n<li><em>Des vraies et des fausses idées</em>, Librairie\nArthème Fayard, 1986. (A reprinting of the original 1683 text,\nbut without the pagination of the original)</li>\n<li><em>Des vraies et des fausses idées</em>, a critical\nedition by Denis Moreau, Paris, J. Vrin, 2011.</li>\n<li><em>Examen d’un Ecrit qui a pour titre: Traité de\nl’essence du corps, et de l’union de l’ame avec le\ncorps contre la philosophie de M. Descartes</em>, <em>Texte revu par\nEmmanuel Faye</em>, Librairie Arthème Fayard, 1999.</li>\n<li><em>Nouveau éléments de géometrie\nd’Arnauld</em>, critical edition by Dominique Descotes, in\n<em>Géometries du Port-Royal</em>, Paris, Champion, 2009.</li>\n<li><em>La logique ou l’Art de penser</em>, Édition\ncritique par Pierre Clair et François Girbal, Seconde\nédition revue,</li>\n<li><em>La Logique ou l’art de penser</em>, critical edition by\nDominique Descartes, Paris, Champion, 2011.</li>\n</ul>\n<h4>English Translations of Arnauld’s Works</h4>\n<ul>\n<li>Arnauld, Antoine, and Lancelot, Claude, <em>General and Rational\nGrammar: The Port-Royal Grammar</em>, translated by Jacques Rieux and\nBernard E. Rollin, The Hague: Mouton, 1975.</li>\n<li>Arnauld, Antoine, <em>The Art of Thinking, Port-Royal Logic</em>,\ntranslated by James Dickhoff and Patricia James, New York: Library of\nLiberal Arts, 1964.</li>\n<li>Arnauld, Antoine and Nicole, Pierre, <em>Logic or the Art of\nThinking</em>, translated by Jill Vance Buroker, Cambridge: Cambridge\nUniversity Press, 1996.</li>\n<li>Arnauld, Antoine, <em>On True and False Ideas</em>, translated by\nElmar J. Kremer, Lewiston/Queenston: The Edwin Mellen Press,\n1990.</li>\n<li>Arnauld, Antoine, <em>On True and False Ideas</em>, translated by\nStephen Gaukroger, Manchester: Manchester University Press, 1990.</li>\n</ul>\n<h4>Translation of Arnauld’s Works from Latin into French</h4>\n<ul>\n<li><em>Arnauld, Textes philosophiques</em>, Introduction, traduction\net notes par Denis Moreau, Paris: Presses Universitaires de France,\n2001.</li>\n</ul>\n<h4>Individual Works of Arnauld Cited</h4>\n<ul>\n<li><em>Défense contre la Réponse au Livre des vraies et\ndes fausses Idées</em>, <em>OA</em>, 38: 367–671.</li>\n<li><em>De la fréquente communion</em>, <em>OA</em>, 27:\n71–673.</li>\n<li><em>Des vraies et des fausses idées</em>, <em>OA</em>, 38:\n177–365.</li>\n<li><em>Dissertation sur les Miracles de l’ancienne loi</em>,\n<em>OA</em>, 38: 673–741.</li>\n<li><em>Dissertatio theologica quadripartita</em>, <em>OA</em>, 20:\n159–314.</li>\n<li><em>Examen d’un Ecrit qui a pour titre: Traité de\nl’essence du corps, et de l’union de l’âme\navec le corps contre la philosophie de M. Descartes</em>, <em>OA</em>,\n38: 89–176.</li>\n<li><em>Grammaire génerale et raisonnée</em>,\n<em>OA</em>, 16: 3–82.</li>\n<li><em>Instruction, par demandes &amp; par réponses touchant\nl’accord de la Grace avec la liberté</em>, <em>OA</em>,\n10: 435–41.</li>\n<li><em>Humanae Libertatis Notio</em>, in Kremer and Moreau,\n<em>Oeuvres Philosophiques d’Arnauld</em>, 2003, end of Volume\n6; and Moreau, <em>Arnauld, Textes philosophiques</em>, 2001, pp.\n236–59.</li>\n<li><em>De la liberté de l’homme</em>, <em>OA</em>, 10:\n610–14. (A French translation, by Pasquier Quesnel, of\n<em>Humanae Libertatis Notio</em>.)</li>\n<li><em>La Logique ou l’Art de penser</em>, <em>OA</em>, 16:\n99–416.</li>\n<li><em>Nouvelle Défense de la Traduction du Nouveau Testament\nimprimée a Mons contre M. Mallet</em>, <em>OA</em>, 7:\n67–915.</li>\n<li><em>Nouveaux éléments de\ngéométrie</em>, <em>OA</em>, 42: 1–342.</li>\n<li><em>Neuf lettres de M. Arnauld au R.P. Malebranche sur les\nidées génerales, la grâce et\nl’étendue intelligible</em>, <em>OA</em>, 39:\n1–153.</li>\n<li><em>Première Apologie pour Jansénius</em>,\n<em>OA</em>, 16: 39–323.</li>\n<li><em>Réflexions philosophiques et théologiques sur le\nnouveau système de la nature et de la grâce</em>,\n<em>OA</em>, 39: 155–848.</li>\n<li><em>Règles du bon sens</em>, <em>OA</em>, 40:\n153–260.</li>\n<li><em>Traduction du Discours latin prononcé par M. Arnauld en\nrecevant le Bonnet de Docteur</em>, <em>OA</em>, 43: 11–13.</li>\n<li><em>Seconde Apologie pour Jansénius</em>, <em>OA</em>, 17:\n1–637.</li>\n<li><em>Vera S. Thomae de gratia sufficiente et efficaci doctrina\ndilucide explanatae</em>, <em>OA</em>, 20: 39–77.</li>\n</ul>\n<h3><a name=\"RelEarModWor\">Related Early Modern Works</a></h3>\n<ul class=\"hanging\">\n<li><em>La Bible</em>, traduction de LeMaître De Sacy,\n(préface et textes d’introduction établis par\nPhilippe Sellier) Paris: Robert Laffont, 1990.</li>\n<li><em>The Philosophical Writings of Descartes</em> (translated by\nJohn Cottingham, Robert Stoothoff, and Dugald Murdoch) 2 volumes,\nCambridge: Cambridge University Press, 1984–85. Cited as\n<em>Descartes</em>.</li>\n<li><em>Briefwechsel Leibniz, Arnauld und dem Landgrafen Ernst von\nHessen-Rheinfels</em>, in <em>Die philosophischen schriften von\nGottfried Wilhelm Leibniz, herausgegeben von C. I. Gerhardt</em>,\nBerlin, 1875–1890, reprint, Hildesheim: Georg Olms, 1965, volume\n2. Cited as <strong><em>LA</em></strong>.</li>\n<li>Leibniz, Gottfried Wilhelm, <em>Discourse on Metaphysics,\nCorrespondence with Arnauld, Monadology</em>, (translated by George R.\nMontgomery), LaSalle, Illinois: Open Court Publishing Co., 1950</li>\n<li>–––, <em>Theodicy, Essays on the Goodness of\nGod, the Freedom of Man, and the Origin of Evil</em> (translated by E.\nM. Huggard and edited with an introduction by Austin Farrer) La Salle,\nIL: Open Court Press, 1985.</li>\n<li>Malebranche, Nicolas, <em>Oeuvres complètes de\nMalebranche</em>, (direction: André Robinet) 20 volumes, Paris:\nJ. Vrin, 1958–74. Cited as <strong><em>OM</em></strong>.</li>\n<li>–––, <em>Treatise on Nature and Grace</em>\n(translated by Patrick Riley) Oxford: Clarendon University Press,\n1992. (Riley translates an early edition of the\n<em>Traité</em>, which does not contain some texts on which\nArnauld comments. Hence, the translations of the text found in volume\n5 of <em>OM</em> are by the author of this entry.)</li>\n<li>Molina, Luis de, <em>On Divine Foreknowledge (Part IV of the\nConcordia)</em>, (translated, with an introduction and notes, by\nAlfred J. Freddoso), Ithaca and London: Cornell University Press,\n1988.</li>\n<li>Reid, Thomas, <em>Essays on the Intellectual Powers of Man</em>\n(1785), (edited by Derek R. Brookes) Edinburgh: Edinburgh University\nPress, 2002.</li>\n</ul>\n<h3><a name=\"SecWorCit\">Secondary Works Cited</a></h3>\n<ul class=\"hanging\">\n<li>Faye, Emmanuel, 2005, “The Cartesianism of Desgabets and\nArnauld and the Problem of Eternal Truths,” in D. Garber and S.\nNadler (eds.), <em>Oxford Studies in Early Modern Philosphy</em>,\nOxford: Clarendon Press.</li>\n<li>Hacking, Ian, 1975a, <em>The Emergence of Probability</em>,\nCambridge: Cambridge University Press.</li>\n<li>Hacking, Ian, 1975b, <em>Why Does Language Matter to\nPhilosophy?</em>, Cambridge: Cambridge University Press.</li>\n<li>Knox, R.A., 1950, <em>Enthusiasm</em>, Oxford: Oxford University\nPress.</li>\n<li>Kremer, Elmar J., 1995, “L’Accord de la Grace avec la\nLiberte selon Arnauld,” <em>Chroniques de Port-Royal, Antoine\nArnauld (1612–1694) Philosophe, Ecrivain, Theologien</em>,\nParis: Bibliotheque Mazarine.</li>\n<li>Kremer, Elmar J., 2000, “Malebranche on Human\nFreedom,” in S. Nadler (ed.), <em>The Cambridge Companion to\nMalebranche</em>, Cambridge: Cambridge University Press.</li>\n<li>––– (ed.), 1996, <em>Interpreting Arnauld</em>,\nToronto: University of Toronto Press.</li>\n<li>Moreau, Denis, 1999, <em>Deux Cartésiens</em>, Paris: J.\nVrin.</li>\n<li>–––, 2011, “La ‘Philosophie\nd’Antoine Arnauld’: Un Bilan,” in <em>Chroniques de\nPort-royal</em>, 115-128.</li>\n<li>Moreau, Denis, 2004, <em>Malebranche</em>, Paris: J. Vrin.</li>\n<li>Marion, Jean-Luc, 1981, <em>Sur la théologie blanche de\nDescartes</em>, Paris: PUF.</li>\n<li>Marušić, Jennifer Smalligan, 2014, “Propositions\nand Judgments in Locke and Arnauld: A Monstrous and Unholy\nUnion?” <em>Journal of the History of Philosophy</em>, 52(2):\n255–80.</li>\n<li>Nadler, Steven, 1989, <em>Arnauld and the Cartesian Philosophy of\nIdeas</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1995, “Occasionalism and the Question\nof Arnauld’s Cartesianism,” in Ariew, Roger and Grene,\nMarjorie, editors, <em>Descartes and His Contemporaries</em>, Chicago:\nUniversity of Chicago Press, pp. 129–144.</li>\n<li>–––, 2008, “Arnauld’s God,”\n<em>Journal of the History of Philosophy</em>, 46(4):\n517–38.</li>\n<li>–––, 2011, “Conceptions of God,” in\n<em>The Oxford Hndbook of Philosophy in Early Modern Europe</em>,\nedited by Desmond M. Clarke and Catherine Wilson, 2011.</li>\n<li>Nelson, Alan, 1996, “The Falsity in Sensory Ideas: Descartes\nand Arnauld,” in Kremer (ed.) 1996, pp. 13–32.</li>\n<li>Pearce, Kenneth L., 2016, “Arnauld’s Verbal\nDistinction between Ideas and Perceptions,” <em>History and\nPbilosophy of Logic</em>, 37(4): 375–90.</li>\n<li>–––, 2019, “Locke, Arnauld, and Abstract\nIdeas,” <em>British. Journal for the History of Philosophy</em>,\n27(1): 75–94.</li>\n<li>–––, 2021, “Ideas and Explanation in Early\nModern Philosophy”, <em>Archiv für Geschichte der\nPhilosophie</em>, 103(2): 252–80.</li>\n<li>–––, forthcoming, “Thinking with the\nCartesians and Speaking with the Vulgar,” <em>Journal of the\nHistory of Philosophy</em>.</li>\n<li>Sleigh, Jr., R.C., 1996, “Arnauld on Efficacious Grace and\nFree Choice,” in Kremer (ed.) 1996, pp. 164–75.</li>\n<li>–––, 1990, <em>Leibniz and Arnauld, a Commentary\non Their Correspondence</em>, New Haven: Yale University Press.</li>\n<li>Stencil, Eric, 2016, “Essence and Possibility in the\nLeibniz-Arnauld Correspendence,” <em>Pacific Philosophical\nQuarterly</em>, 97(1): 2–26.</li>\n<li>–––, 2019, “Arnauld’s God\nReconsidered,” <em>History of Philosophy Quarterly</em>, 36(1):\n19–38.</li>\n<li>Stencil, Eric and Walsh, Julie, (2016), “Arnauld, Power, and\nthe Fallibility of Infallible Determination,” <em>History of\nPhilosophy Quarterly</em>, 33(3): 237–56</li>\n<li>van der Schaar, Maria, 2008, “Locke and Arnauld on Judgments\nand Propositions,” <em>History and Philosophy of Logic</em>,\n29(4): 327–41.</li>\n<li>Vansteenberghe, E., 1929, “Molinism,” in the\n<em>Dictionnaire de Théologie Catholique</em>, sous la\ndirection de A. Vacant, E. Mangenot et É. Aman, Tome\nDixième Paris-VI: Librairie Letouzey et Ané, cols.\n2094–2187.</li>\n</ul>\n<h3><a name=\"OthRecSecWor\">Other Recommended Secondary Works</a></h3>\n<ul class=\"hanging\">\n<li><em>Antoine Arnauld (1612–1694), Philosophe,\nÉcrivain, Théologien</em>, Chroniques de Port-Royal,\nNuméro 44, Paris: Bibliothèqie Mazarine, 1995.</li>\n<li><em>Port-Royal et l’Oratoire</em>, Chroniques de Port-Royal,\nNuméro 50, Paris: Bibliothèque Mazarine, 2001.</li>\n<li>Cook, Monte, 1991, “Malebranche vs. Arnauld,”\n<em>Journal of the History of Philosophy</em>, 29(2):\n183–99.</li>\n<li>Kilcullen, John, 1988, <em>Sincerity and Truth: Essays on Arnauld,\nBayle and Toleration</em>, Oxford: Oxford University Press.</li>\n<li>Kremer, Elmar J. (ed.), 1994, <em>The Great Arnauld and Some of\nHis Philosophical Correspondents</em>, Toronto: University of Toronto\nPress.</li>\n<li>Kremer, Elmar J. (ed.), 1996, <em>Interpreting Arnauld</em>,\nToronto: University of Toronto Press.</li>\n<li>Laporte, Jean, 1922, <em>La Doctrine de la Grace chez\nArnauld</em>, Paris: Presses Universitaires de France.</li>\n<li>Martin, John N., 2011, “Existential Import in Cartesian\nSemantics,” <em>History and Philosophy of Logic</em>, 32(3):\n211–039.</li>\n<li>–––, 2012, “Existential Commitment and the\nCartesian Semantics of the Port-Royal Logic,” in <em>The Square\nof Opposition: A General Framework for Cognition</em>, edited by\nJean-Yves Beziau and Gillman Payette, Bern: Peter Lang.</li>\n<li>–––, 2017, “Extension in the Port-Royal\nLogic,” <em>South American Journal of Logic</em>, 3:\n291–311.</li>\n<li>–––, 2020, <em>The Cartesian Semantics of the\nPort-Royal Logic</em>, New York: Routledge.</li>\n<li>Michon, Cyrille, 2013, “Le compatibilisme thomiste\nd’Antoine Arnauld,” <em>Dix-septième\nsiècle</em>, 2(259): 265–279.</li>\n<li>Ndiaye, A.-R., 1991, <em>La Philosophie d’Antoine\nArnauld</em>, Paris: J. Vrin.</li>\n<li>Paola, Nicolas, 2013, “Arnauld et la foi implicite: un\nrefuge cartésien,” <em>Dix-septième\nsiècle</em>, 2(259): 249–63.</li>\n<li>Pariente, Jean-Claude, 1995, <em>Arnauld, Philosophie du langage\net de la connaissance</em>, Paris: J. Vrin.</li>\n<li>–––, 1985, <em>L’analyse du langage\nà Port-Royal</em>, Paris: Les Editions du Minuit.</li>\n<li>Schmaltz, Tad M., 2002, <em>Radical Cartesianism, The French\nReception of Descartes</em>, Cambridge: Cambridge University\nPress</li>\n<li>Van Cleve, James, “Arnauld’s Silence on the Creation\nof the Eternal Truths,” <em>Res Philosophica</em>, 96(4):\n445–70.</li>\n<li>Yolton, John, 1984, <em>Perceptual Acquaintance from Descartes to\nReid</em>, Minneapolis: University of Minnesota Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aquinas, Thomas",
            "Augustine, Saint",
            "consciousness: seventeenth-century theories of",
            "Descartes, René",
            "Leibniz, Gottfried Wilhelm",
            "Malebranche, Nicolas",
            "Pascal, Blaise",
            "Port Royal Logic",
            "Reid, Thomas"
        ],
        "entry_link": [
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../consciousness-17th/": "consciousness: seventeenth-century theories of"
            },
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../malebranche/": "Malebranche, Nicolas"
            },
            {
                "../pascal/": "Pascal, Blaise"
            },
            {
                "../port-royal-logic/": "Port Royal Logic"
            },
            {
                "../reid/": "Reid, Thomas"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arnauld\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/arnauld/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=arnauld&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/arnauld/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arnauld": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/arnauld/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=arnauld&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/arnauld/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.cartesius.net\" target=\"other\">Bulletin Cartesien</a>.",
            "<a href=\"http://www.amisdeportroyal.org/societe/\" target=\"other\">Société des Amis de Port-Royal</a>.",
            "<a href=\"http://www.newadvent.org/cathen/01742a.htm\" target=\"other\">Antoine Arnauld</a>,\n entry in the <em>Catholic Encyclopedia</em>."
        ],
        "listed_links": [
            {
                "http://www.cartesius.net": "Bulletin Cartesien"
            },
            {
                "http://www.amisdeportroyal.org/societe/": "Société des Amis de Port-Royal"
            },
            {
                "http://www.newadvent.org/cathen/01742a.htm": "Antoine Arnauld"
            }
        ]
    }
}