{
    "url": "black-reparations",
    "title": "Black Reparations",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Bernard Boxill\n\nJ. Angelo Corlett\n<acorlett@sdsu.edu>",
        "author_links": [
            {
                "https://corlett.sdsu.edu/Corlett/Welcome.html": "J. Angelo Corlett"
            },
            {
                "mailto:acorlett%40sdsu%2eedu": "acorlett@sdsu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nBernard Boxill\n<br/>\n<a href=\"https://corlett.sdsu.edu/Corlett/Welcome.html\" target=\"other\">J. Angelo Corlett</a>\n&lt;<a href=\"mailto:acorlett%40sdsu%2eedu\"><em>acorlett<abbr title=\" at \">@</abbr>sdsu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Dec 14, 2010",
        "substantive revision Thu Jan 13, 2022"
    ],
    "preamble": "\n\n\nStates have long demanded reparations from other states at the end\nof wars. More recently non-state actors such as the Aborigines of\nAustralia, the Maori of New Zealand, and many American Indian nations\nof North America are demanding the return of their tribal lands from\nEuropeans as reparations; Eastern Europeans dispossessed by socialist\ngovernments are demanding the return of their property as reparations;\nand U.S. blacks (black people whose genealogy traces back to slavery\n within the \nU.S.[1])\n are demanding reparations from the United States of America for the\nharmful wrongdoings to them caused by U.S. slavery and its\naftermath. The last of these demands is our subject.\n",
    "toc": [
        {
            "#HistUSRepaBlac": "1. History of U.S. Reparations to Blacks"
        },
        {
            "#JohnLockRepa": "2. John Locke on Reparations"
        },
        {
            "#RepaRestComp": "3. Reparations, Restitution, and Compensation"
        },
        {
            "#KindRepa": "4. Kinds of Reparations"
        },
        {
            "#EthiApprRepa": "5. Ethical Approaches to Reparations"
        },
        {
            "#RepaForSlav": "6. Reparations for Slavery"
        },
        {
            "#HarmArgu": "7. The Harm Argument"
        },
        {
            "#InheArgu": "8. The Inheritance Argument"
        },
        {
            "#SupeHistInju": "9. Supersession and Historic Injustices"
        },
        {
            "#RepaPoli": "10. Reparations Policies"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. History of U.S. Reparations to Blacks\n\n\nOddly, Thomas Jefferson was probably the first to imply that the\nU.S. ought to make reparation to its slaves. He did not explicitly\nsay that it did or ought to, and his proposal to send them off\nto “such place as circumstances of the time should render most\nproper” and to “declare them a free and independent\npeople” was mainly motivated by a desire to rid the U.S. of them,\nbut it also suggests that they were a people and that the U.S. was\nunder some obligation to set them up as a people (Jefferson 1785a\n[1954: 138]). Some years after Jefferson’s proposal, American\nslaveholders founded (1816) the American Colonization Society whose\nostensible object, made plausible by the presence of some white Quakers\namong its founders, was to help African Americans to go to Liberia and\nget a fresh start in a country free of racial discrimination. But the\nreal object of the Society, or at least that of the white slaveholders\nwho founded it, was to rid the country of free blacks who they feared\nendangered their peculiar institution. Their stratagem was therefore\ndealt a deadly blow when Martin Delany, who agreed with Jefferson that\nU.S. blacks were a people and needed a territory on which to become a\nstate, declared that Liberia was “not an independent\nnation at all; but a poor miserable mockery—a\nburlesque on a government—a pitiful dependency on the\nAmerican Colonizationists” and its “principal man, called\nPresident, in Liberia” was a “mere parrot” of these\nindividuals (Delany 1852 [2004]: 185, emphasis in original).\n\nDemands for compensation related to slavery frequently arose during\nthe U.S. Civil War, but not do so in the way present day U.S. citizens\nwould expect. The demands were not to compensate the black slaves for\nthe injuries of slavery, but to compensate the white slaveholders for\nthe anticipated loss of their slaves. These demands were voiced in the\nSouth when they faced the prospect of having to free their slaves, but\nthey were also voiced in the North, and from the highest sources.\nPresident Abraham Lincoln, for example, repeatedly urged compensated\nemancipation, which meant paying the slaveholders for the loss of their\nslaves who would then be deported from the U.S.. Indeed, at one time he\nappeared to be ready to propose paying the South $400,000,000, for the\nloss of their slaves. As W.E.B. Du Bois observed dryly: “Lincoln\nwas impressed by the loss of capital invested in slaves, but curiously\nnever seemed seriously to consider the correlative loss of wage and\nopportunity of slave workers, the tangible results of whose\nexploitation had gone into the planters’ pockets for two\ncenturies.” (Du Bois 1992 [1935]: 150). And Lincoln did not even\nsugar coat his deportation proposal with the suggestion that the\nfreedmen were a nation and therefore needed a separate territory on\nwhich to govern themselves.\n\nThaddeus Stevens, congressman from Pennsylvania, argued that it was\nnot enough to free the slaves and give them the right of suffrage; but\nthat in addition they should be given land confiscated from the rebels.\nCharles Summer, senator from Massachusetts eventually came to agree\nwith him, but surprisingly the radical ex-slave Frederick Douglass did\nnot. Peter C. Myers (2008) speculated that Douglass’s\n“moderation” at this point was a reflection of “what\nwas politically possible,” and of his concern that benevolent\nmissions organized by whites might encourage dependence in the freedmen\nand prevent them from developing and exercising the virtues of a free\npeople. Douglass’ proposed instead a federal corporation that\nwould purchase tracts of land and then resell or lease them on\nfavorable terms to the freedmen, urging that this arrangement was\n“more fully consistent with the principle of self-reliance”\nand give “greater societal recognition of the freed\npeople’s virtue in providing for themselves.” Myers\nsuggested that Douglass was following Jefferson in emphasizing the\ncorrupting effects of dependence. But while Jefferson had indeed\nidentified dependence as a crucial corrupter, it “begets\nsubservience and venality, suffocates virtue, and prepares fit tools\nfor the designs of ambition” (Jefferson 1785a [1954: 165]) he\ndeclared, he was equally clear that legislators must protect the\nindependence of the small yeoman farmer “the most precious part\nof the state” from the usurpation of the powerful (Jefferson 1785b\n[2006: 154]). In other words, Stevens had proposed his scheme for the\nfreed people for exactly the reasons Jefferson proposed legislation for\nprotecting the white yeomen. Years later Douglass evidently saw the\nerror of his moderation. Myers cites his comment in 1882 that had the\ncounsels of Thaddeus Stevens, Charles Sumner, and ‘leading\nstalwart Republicans’ prevailed, “the terrible evils from\nwhich we now suffer would have been averted”, and “the\nNegro to-day”, would be “tilling his soil in comparative\nindependence” (Myers 2008: 239, quoting Douglass 1882, Appendix\nA, 440–441). The theme continues to the present day.\n\nPerhaps the most noteworthy demand for U.S. black reparations after\nthe Civil War occurred in 1969 when James Foreman, a member of the\nStudent Nonviolent Coordinating Committee (SNCC), read his “Black\nManifesto” at the National Black Economic Development Conference,\nin Detroit, and later on in Riverside Church in New York City. The\n“Manifesto” demanded $500,000,000, in reparations from\nChristian white churches and Jewish synagogues, or as the\n“Manifesto” put it, “15 dollars per nigger.”\nThis demand for reparations, the Manifesto argued, was justified\nbecause for over three and a half centuries, whites with the assistance\nand collaboration of their churches and synagogues had unjustly,\nthrough slavery and discrimination, wrested enormous economic\nadvantages from blacks. Although this argument relied on widely\naccepted moral intuitions, the Manifesto received little popular\nsupport. It did, however, provoke discussion in newspapers and news\nmagazines, as well as some scholarly discussion. Boris Bittker included\nit as an appendix in his book The Case for Black Reparations\n(1973); Hugo Bedau provided and extended analysis in his\n“Compensatory Justice and the Black Manifesto” (1972);\nMichael Harrington and Arnold Kaufman debated its merits in\n“Black Reparations—Two Views” (1969); and a number of\nphilosophers wrote essays inspired by its argument, most notably,\nBernard R. Boxill (1972).\n\nAlthough interest in the topic remained high among U.S. black\nphilosophers, the wider community of political philosophers preoccupied\nwith Rawlsian ideal theory generally ignored it. But broad and vigorous\ninterest has been rekindled. Perhaps the causes lie outside of\nacademia; in 1988, the U.S. Congress passed the Civil Liberties Act\nwhich authorized payment of reparations to Japanese American citizens\nwho had been imprisoned during World War II; U.S. Congressman John\nConyers had in each session of Congress since 1989 introduced a bill to\ncreate a commission to study reparations for slavery and segregation;\nin 2000 Randall Robinson published his book The Debt: What America\nOwes to Blacks; in 2003 David Horowitz published his Uncivil\nWars; and in 2014 Ta-Nehisi Coates’s widely discussed essay\n“The Case for Reparations”, appeared in The\nAtlantic. In September 2020, \nCalifornia Assembly Bill 3121 established the \n Task Force to Study and Develop Reparation Proposals for African-Americans, \n  in connection with the enslavement of blacks in the U.S.\n2. John Locke on Reparations\n\n\nJohn Locke provided an early and very clear argument for the\nreparations owed a lawful conqueror, and many arguments for black\nreparations follow the outlines of his\nargument.[2] For\nLocke people have natural rights they get directly from Natural Law\nand rights they have acquired in accordance with Natural law. To\nrestrain violations of rights, he proposed punishment; punishment must\nbe administered “with so much Severity as will suffice to make\nit an ill bargain to the Offender, give him cause to repent, and\nterrifie others from doing the like.” (Locke 1689: sec 8) And to\nrepair the damage that crime “commonly” causes “some\nperson or other,” Locke proposed reparations. As he put it,\nreparation must give the “satisfaction due to any private Man,\nfor the damage he has received” (Locke 1689: sec 11). According\nto Locke, reparations were rights stemming from the right of\nself-preservation. But he insisted that the rights can be pressed only\nagainst the “goods or service of the Offender” (Locke\n1689: sec 11). More precisely, while the person damaged can seek help\nfrom anyone, she, the victim, has a right to reparations only against\nthe one who wrongly caused her damage. But Locke does not say that she\nmust be the immediate victim of the “Offender”. His claim\nthat crime commonly damages “some person or other”\nsuggests that she may be anyone damaged as a result of the\noffender’s violation of right. For example, she may be damaged\nbecause someone murdered her father and thus caused her to live in\nstraitened conditions. On Locke’s account, she may be entitled\nto press her right to reparations against the murderer for the damage\nhe caused her to suffer. On the other hand, Locke’s claim that\ncrime “commonly” damages someone suggests that crime or\nviolations of rights do not always cause damage and\nconsequently do not always generate rights to reparations, though it\ndoes not suggest that such violations of right do not deserve to be\npunished. But even when the violation of right does not cause material\nlosses, it may cause damages to its victim’s self-respect and\nmoral standing, and in such cases the satisfaction due to her may\ninclude an admission of wrong doing from the wrongdoer, a plea for her\nforgiveness, and an apology. If such admission, plea, and apology\nrequire that the wrongdoer repent, reparations may seem to require\nthat the wrongdoer be punished, given Locke’s view that\nrepentance is among the objects of punishment (Locke 1689: sec 8). But\nLocke seems clear that the rights to reparations and the right to\npunish are different rights. On his view, we give up the right to\npunish to the state, but retain the rights to reparations.  He writes\nthat the “Magistrate, … can often, where the publick good\ndemands not the execution of the Law, remit the punishment of\nCriminal Offences …, but cannot yet remit the\nsatisfaction due to any private Man, for the damage he has\nreceived” (Locke 1689: sec 11). Arguably, then, the apology the\nwrongdoer must give to his victim in order to give her the\nsatisfaction she has a right to does not require that he repent and\nperhaps therefore does not require that his apology be sincere. It is\nalso worth noting that although unjust enrichment from crime should\nnot be tolerated, it has little if anything to do with reparations.\nReparations focus on getting satisfaction for the injured victim of\ncrime and the criminal need not unjustly enrich himself as a result of\nthe crime to have wrongfully injured her. He owes her reparations even\nif he impoverished himself in the process of injuring her. Finally\ngiven Locke’s separation of the right to punish from the rights\nof reparations, and his claim that the rights to reparations is about\nmaking satisfaction to the victim of wrongdoing, Locke would seem\ncommitted to holding that when an act of wrong doing is excused though\nit causes harm that the victim has a right to reparations although the\nmagistrate may well decide that the public good does not require that\nthe state exercise its right to punish the wrongdoer.\n3. Reparations, Restitution, and Compensation\n\n\nIn its primary sense, restitution is “restoration of something\nlost or stolen to its proper owner” (The New Oxford American\nDictionary 2001). Clearly, then, reparations and restitution both\npresuppose the separation of something from its proper owner. But,\nequally clearly, reparations do not constitute restitution. Reparations\ncan only occur after some losses or damage due to a prior wrongdoing.\nBut though restitution can only occur after some loss or damage, that\nloss or damage need not be due to a prior wrongdoing. If A\nloses his wallet and B finds it and returns it to A,\nrestitution has been made although no wrongdoing was committed.\nFurther, while reparations is a right (or a cluster of rights),\nrestitution is not always a right. If B finds but leaves\nA’s wallet where it is, restitution has not been made,\nbut it is not clear that a right was violated. It is doubtful that a\nperson who loses things has a right that others find it for him. If\nB finds but keeps A’s wallet, then again\nrestitution has not been made, and A has a right that\nB return it. But in that case A has a right that\nB return it because A has a right to reparations and\nrestitution can sometimes be part of reparations. Some authors seem to\nthink that B ought to return the wallet because otherwise\nB will have unjustly enriched himself at A’s\nexpense. But it is not clear why B’s unjust enrichment\nis a necessary condition for B’s obligation to return\nthe wallet to A. Even if the wallet is worthless and\nB is not unjustly enriched by keeping it, B has no\nbusiness holding on to it since it is not his property.\n\nRestitution is neither necessary nor sufficient for reparations even\nwhen the thing to be restored to its proper owner was stolen. If\nA steals a bicycle from B, B has a right to\nreparations and consequently to restitution if A has the\nbicycle; reparations must give satisfaction, and A’s\nsatisfaction may depend on her getting back the very thing that was\nstolen from her. But she may have lost more than the bicycle as a\ndirect result of its theft and her right to reparations requires\nsatisfaction for that further loss. Consequently, restitution is not\nalways sufficient for reparations. On the other hand, the bicycle may\nhave been destroyed or loss after its theft, making restitution but not\nreparations impossible. Consequently, restitution is not necessary for\nreparations.\n\nCompensation is related to reparations and restitution but is not\nthe same thing as either. It is not reparation because it simply makes\nup for damage, harm or loss or lack whether or not it was caused by\nwrongdoing. Robert Nozick’s famous definition of compensation\nmakes this sufficiently clear: “Something fully compensates a\nperson for a loss if and only if it makes him no worse off than he\nwould otherwise have been; it compensates person X for\nperson’s Y’s action A if X is no\nworse off receiving it, if Y had not done A.”\n(Nozick 1974: 57)\n\nNote that Nozick (correctly) does not say that the loss or the\naction A must be wrongful. Thus a person may be compensated\nfor a loss though he does not have a right to reparations. If a person\ndeserves a loss he has no right to reparations for it, but he may be\ncompensated for it, probably unjustifiably. Even if he has a\nright to compensation, he may still have no right to\nreparations. For example, he may have a right to be compensated for a\nloss if he is insured against it, but his right is a right to\ncompensation not a right to reparations if no wrongdoing caused his\nloss.\n\nBut if a person has a right to reparations, he will also often have\na right to compensation. This is because his right to reparations is a\nright to satisfaction for the damages he suffered and such satisfaction\noften requires that he be made no worse off than he would have been had\nhe not suffered the loss. This does not make a right to compensation\nthe same thing as a right to reparations since a right to reparations\ncan only be generated by damages caused by wrongdoing.\n\nSince a right to reparations is always generated by a wrongful harm,\nsuch rights are part of corrective justice or to use Rawls’s\nterm, “partial compliance theory” (Rawls 1971: 8, 9). But\nRawls must allow that there can be rights to compensation in full\ncompliance theory. This follows since people can suffer damages that\nresult from no one’s wrongdoing, and may have insured themselves\nagainst such damages. Consider too Rawls’s “principle of\nredress”. This is a principle of compensation for full compliance\ntheory. It may be objected that it cannot be such a principle, but must\nbe instead a principle of non-ideal justice, since according to Rawls\nhimself it requires that “undeserved inequalities”, such as\nthe “inequalities of birth and natural endowment” be\n“somehow compensated for” (Rawls 1999: 100). But\nRawls’s use of “undeserved” at this point is not\nmeant to imply that he is referring to inequalities that are the result\nof injustice. It only means that those with the inequalities in\nquestion did nothing to deserve them.\n4. Kinds of Reparations\n\n\nKinds of reparations are at least two in number: compensatory, as\ndiscussed above, and non-compensatory. In either case, reparations are\nto be understood as matters of rights to those wrongfully harmed by a\ngroup or a state. However, while compensatory reparations amount to\nrights to monetary compensation paid by a responsible party to those\nthey have harmed, as discussed in section 4 above, non-compensatory\nreparations constitute rights to enactments of social justice in\nnon-monetary forms such as the removal of symbols of injustice from\nofficial governmental spaces, the accurate teaching of history of a\nsociety in non-exclusionary terms, etc. (Corlett 2010: 1-17). In either\ncase, reparations can serve as a condition of an apology with an eye\ntoward social forgiveness and reconciliation (Corlett 2010:\n187–212).\n5. Ethical Approaches to Reparations\n\n\nGenerally, there are two ethical approaches that might be used to\nground or justify reparations: utilitarian versus rights-based.\nUtilitarian approaches to reparations seek to justify and articulate\nreparations in terms of equity for oppressed citizens relative to\nother citizens of a society, no matter to which, say,\n“racial” or ethnic groups they belong. Further, their\ncommitment to a suitably described principle of utility will attempt\nto promote rights to reparations up to a point wherein social\nutility maximization and equality amongst the citizenry are threatened\nbased on the perceived consequences of the application of a particular\nreparative policy. But this level of commitment to the rights to\nreparations is criticized for its inadequate commitment\nto honoring said rights qua rights, thereby\nsubsuming the rights to reparations under the utilitarian commitments\nto social utility considerations and equality (Corlett 2010:\n33–79), something the rights-based approach would reject\nconcerning rights in general (Feinberg 1980; Rawls 1999). For the\nrights-based approach to reparative justice, a right to reparations\nfashioned by social utility maximal considerations is no right at all.\nThe rights to reparations, like other rights, must be honored, not\nmerely promoted in accordance with the ethics of a utilitarian\ncalculation. For if X is a right at all, X as a\nright trumps social utility considerations.\n\nFor the rights-based approach to reparations, such rights include at\nleast the following rights-cluster: The set of rights to corrective\njustice honored in proportion to the wrongful harm experienced by\neither the proximate cause of the harm caused to the group or to the\ngroup responsible for honoring the reparations in question. It is\nimportant to note that a group can be responsible for compensating a\nharm without that group being guilty of causing the harm (Feinberg\n1970). Hence in the case under consideration, the U.S. government is\nsaid to owe reparations to U.S. blacks for the enslavement of said\nblacks on what is currently considered to be U.S. soil.\n6. Reparations for Slavery\n\n\nThis entry focuses on making a case for reparations for contemporary\nU.S. blacks for the enslavement of their U.S.-enslaved ancestors,\npartly because slavery was one of the most horrific experiences that\nsaid blacks have endured in the U.S., and the one for which the\nimmediate victims of the experience most clearly deserve reparations;\nand partly because making the case in question nevertheless presents\npeculiar, difficult, and particularly interesting philosophical\nproblems. As we will see, much of that case will depend on the argument\nthat the injustices U.S. blacks endured after emancipation have caused\nsome of the injuries of the slaves to persist into the present. But\nthere is no reason to suppose that these injustices did not themselves\ncause damages to their victims, quite apart from causing the damages of\nslavery to persist, and that these damages may also deserve\nreparations. In fact, there is good reason to suppose that arguments to\nthat effect may be more important politically than slave-based\narguments for black reparations.\n\nStevens’s argument for slave reparations was simply that the\nslave holders had committed serious harmful transgressions against the\nslaves, who consequently had rights for reparation against their\nmasters that could plausibly be satisfied by some of their\nmasters’ land. Today, few would challenge that argument, at least\npublicly. The argument that many challenge today is that present day\nU.S. blacks have rights to reparations from contemporary U.S. citizens\nor the U.S. government because generations ago the U.S. government\npermitted many U.S. citizens to enslave several blacks. That argument\nseems to get no support from the undeniable fact that enslaved black\nancestors had rights to reparations from their respective masters.\nPeople do not have rights to reparations for the wrongful harms\nothers suffer. Two arguments, the harm argument and the\ninheritance argument, each attempt to circumvent this difficulty.\n\nThe harm argument relies on the idea that the transgressions of\nslavery initiated an unbroken chain of harms linked as cause and effect\nthat began with the slaves and continues among U.S. blacks to the\npresent day. Therefore, since the transgressions of slavery harm\npresent day U.S. blacks they have rights to reparations against those\nwho committed those transgressions. It differs crucially from the\ninheritance argument because it assumes that slavery’s\ntransgressions against the slaves have harmed present day U.S. blacks\nbut the inheritance argument does not. The inheritance argument relies\non the idea that present-day U.S. blacks have inherited the rights to\nreparation that was owed their enslaved ancestors and was never\npaid.\n7. The Harm Argument\n\n\nThree main objections have been urged against the harm argument\nagainst U.S. reparations to blacks. First, that although the\ntransgressions of slavery harmed the slaves, and present-day U.S.\nblacks do suffer from many disadvantages, these disadvantages may not\nbe the result of the transgressions of slavery; they could easily be\nthe result of vast economic and political changes that have occurred\nsince slavery ended. The present harms may not be the “automatic\neffects of slavery” (Sher 1981: 7). Second, that even if present\nday U.S. blacks have been harmed by the slaveholders’\ntransgressions against their ancestors, and have rights to reparations\nagainst these slaveholders, such rights can only be pressed against the\nslaveholders who are now all dead. Third that if present-day U.S.\nblacks demand reparations for the harms that the transgressions of\nslavery caused them, then since reparation implies compensation, they\ndemand to be made no worse off than they would have been had the\ntransgressions of slavery never occurred. But if these transgressions\nhad never occurred present-day U.S. blacks would not exist.\nConsequently, the harm argument is incoherent (Morris 1984, Levin\n1980).\n\nFullinwider reformulated the harm argument so that it avoids the\nfirst two objections. The reformulated argument goes as follows: the\nU.S. government after 1865 failed “to vindicate the rights to\nfull and equal citizenship the Civil War Amendments extended to U.S.\nblacks;” but, had that government “vigorously”\nprotected those rights, “the legacy of slavery would have faded\nconsiderably if not wholly by now through the industry of blacks\nthemselves”. Consequently if present day blacks do suffer from\nvarious aspects of the legacy of slavery, the real cause of those harms\nis not slavery, but the U.S. governments after 1865, for if those\ngovernments had vigorously protected the rights of the freed people and\ntheir descendants, the legacy of slavery would have faded and present\nday U.S. blacks would not be disadvantaged by it (Fullinwider\n2004).\n\nBoris Bittker made a similar suggestion. His main argument is that\nhad the goals of Reconstruction not been foiled by the “political\nsettlement of 1877” and the network of Jim Crow laws not been\nintroduced and finally fully authorized by Plessy v. Ferguson\nin 1896 the “only identifiable residue of slavery today would\nhave been cultural”, and the descendants of U.S. slaves and the\ndescendants of U.S. slaveholders would lead the same lives (Bittker\n2003: 12, 13). In other words, Bittker seems to go a little further\nthan the first one, suggesting that the legacy of U.S. slavery would\nhave disappeared completely if the U.S. government had protected the\nrights of the freed people and their descendants, the second line of\nreasoning too concludes that any responsibility for the legacy of\nslavery that persists today must be attributed to post Civil War\ngovernments.\n\nThese arguments of Fullinwider and Bittker are clear improvements on\nthe original harm argument. But they seem to assume that post-Civil War\ngovernments committed only one transgression against their black\npopulations, namely those governments failed to protect the civil\nrights of the members of those populations. In fact, however, these\ngovernments committed another and quite distinct transgression against\ntheir black populations; they failed to make reparations to those\npopulations. These two transgressions are not the same thing. The duty\nof government to protect its citizens’ civil and political rights\nis one thing; its duty to pay and/or make reparations to them if it has\nwrongly injured them is quite another.\n\nFullinwider seems aware that protecting civil and political rights is\nnot the same as making reparations, that the U.S. government did not\nfulfill all of its obligations to the Japanese it interred during\nWorld War II just because it released them after the war and protected\ntheir civil and political rights after that. But some write as if they\nbelieve that the post-Civil War governments would have fulfilled all\nof their obligations to their black citizens if only they had\nprotected those citizens’ civil and political rights\n(Fullinwider 2004: 148). Others write that compensation in\n1865 to the slaves for their forced or unpaid might have been\n“strong” (Bittker 2003: 12), and that “compensation\nin 1865 for blacks’ forced labor would certainly have been\nappropriate” (Bittker 2003: 28). But having conceded that\nmonetary compensation would have been in order in 1865, Bittker then\ndrops the point without comment.  Interestingly, too, he seems to\nthink that unpaid labor is the only harm the transgressions of slavery\ncaused the slaves or that merits any mention. This is a strange\nposition to hold for a book titled The Case for Black\nReparations, for of course unpaid labor was perhaps the least of\nthe harms that the transgressions of slavery visited on the\nslaves. What about reparation for the theft of their liberty?\n\nBut the claim that “Had the federal government done nothing\nafter 1865 except vigorously protect the civil and voting rights of\nblacks, the legacy of slavery would have faded considerably if not\nwholly by now through the industry of blacks themselves”\n (Fullinwider 2004: 148) suggests that only the governments’\nfailure to protect the civil and political rights of the freed people\nand their descendants caused any problem. An obvious difficulty with\nthis view is that large economic inequalities make it difficult for the\ngovernment to protect the rights of the poor. That problem aside, these\nauthors give no argument to support their view that the freed\npeoples’ descendants would have recovered from the wrongful harms\nof slavery without the help of reparations if only government had\nprotected their civil and political rights. Fullinwider’s\nconfidence seems to rest on the “immigrant model”, by which\nis meant the path to success taken by the European immigrants who came\nto America after the Civil War, and with “little to offer but\ntheir physical labor”, and “by dint of hard work”\neventually “blended into the larger American fabric”. The\nimplication is that the freed people were sufficiently like these\nimmigrants to justify the inference that had government vigorously\nprotected their civil and voting rights then they too by would have\nblended into the larger American fabric (Fullinwider 2004: 148).\n\nBut the freed people and their descendants were not very\nmuch like the white immigrants arriving from Europe. To say the\nobvious, slavery is very bad for people. It prevents them from\ndeveloping the useful dispositions and skills that people tend to\ndevelop in freedom. Although the immigrants had had a rough time in\nEurope—that is why they flocked to America—they were better\nprepared to take advantage of the opportunities available than the\nslaves. Consequently, they would likely have kept well ahead of the\nfreed people and their descendants even if the civil and political\nrights of each group were equally protected. The issue is debatable of\ncourse. Some black writers, Douglass, for example, seem to think that\nhuman beings are resilient, equipped as they are with an almost\nineradicable love of liberty, and consequently the slaves would recover\nreadily from the rigors of slavery if only they were given justice. He\nliked to say that all he asked for the Negro was “simply\njustice”, though the contexts always left it unclear how much he\nincluded in justice, whether it would involve reparation, and whether\nhe was simply denying that he was not asking for\n“benevolence” or “pity” for the Negro (Douglass\n1865: 283). Alexander Crummell, on the other hand, seemed to worry\nabout the enduring effects of slavery especially because of the\ntendency of its victims to remember its horrors, though interestingly\nDouglass thought that these memories could be bracing (Crummell 1891:\n18, 19). The issue of the effects of the memory of enslavement and\ndomination on recovery from the effects of these evils deserves further\nstudy. Whatever the results of that study, however, it does not follow\nstraightaway that the wrongly injured are not owed reparations just\nbecause they are resilient enough to recover from the effects of their\ninjuries without it.\n\nEven if socio-economic advancement depends on informal contacts that\ninvolve the sharing and transfer of genuinely useful information and\nskills among people who enjoy what used to be called “social\nequality”. But social equality cannot be secured by even the most\nrigorous protection of the civil and political rights of the freed\npeople; on the contrary such protection can help social inequality to\npersist since it entitles individuals to choose their friends and\nassociates even if their choice is determined by color prejudice. Since\ncolor prejudice remained strong after the Civil War the white\nimmigrants would more readily associate with well-placed and\nwell-educated locals and learn useful information and skills from them.\nFinally, since social equals tend to marry each other rather than their\ninferiors, and since immigrant whites were more likely than the freed\npeople and their descendants to become the social equals of prosperous\nnative whites, they were also more likely to marry such individuals and\nthus to gain access to their wealth, much of it incidentally inherited\nfrom the spoils of slavery.\n\nBittker seems aware that the official enforcement of civil and\npolitical rights might not nullify the effects of personal prejudice\nand asks whether “personal” prejudice without official\nsegregation would have produced segregation, “first in the home,\nthen in Mrs Murphy’s boardinghouse, and then in business and\npolitics”. This issue is of decisive importance for the implied\ncontention that even without reparations blacks would have made\nthemselves equal to whites if there had been no Jim Crow\nlegislation. He rejects William Graham Sumner’s maxim\n“law-ways cannot alter folkways” which implies that\nsegregation and prejudice could have persisted without the help of Jim\nCrow laws. However, there seems to be no argument to show that\nSumner’s maxim is mistaken. Bittker takes it as a “working\nhypothesis” that “statutes, ordinances, and other official\nactions have been the predominant source of the racial discrimination\nthat has blighted our public and private life,” given that we\nhave no science “capable of producing a model of the United\nStates as it would have been if blacks had come here as voluntary\nimmigrants rather than as slaves, or if emancipation had been followed\nby an integrated society” (Bittker 2003: 26).\n\nThe many and various considerations just canvassed conclude that it\nis too optimistic to suppose that the descendants of the freed people,\nwithout reparations, would have achieved parity with the descendants of\nthe white immigrants if only their civil and political rights had been\nprotected. In any case, the issue they raise is a distraction from the\ncentral question whether U.S. blacks are owed reparations. Achieving\nparity with the descendants of immigrants is not the same thing as\nreceiving the reparations one is owed. The point of reparations is not\nto make people equal to others; reparations is not defined as\nmaking the wrongly harmed equal to others. In fact, equality has little\nto do with reparations. People deserve reparations as a matter of right\nwhen they have been wrongfully harmed by transgression but a person may\nbe harmed as a result of transgression and may therefore have a right\nto reparations and yet be better off than others. Similarly, a person\nmay be worse off than others without having suffered from any harm or\ndisadvantage for which he deserves reparations. If reparations\nnecessarily requires compensation it requires that people be put as far\nas possible in the condition they would have been in had they not been\nwrongly injured. This may make them equal to others, but it may not. It\ncan leave them worse off than others and it can also make them better\noff than others. Some philosophers may protest that we should not allow\nclaims for reparations to get in the way of an ideal egalitarian\nsociety, but of course their position is as bad as the utilitarian\narguments they disparage that rights may and should be violated in\norder to maximize utility (Corlett 2010).\n\nBut it is now time to consider the third main objection to the harm\nargument. This objection, let us recall, is that making reparations to\nthe present U.S. black population for the harms that slavery caused it\nis impossible because if slavery had never occurred the present U.S.\nblack population would not exist. This problem is now known as the\nnon-identity problem. This difficulty might seem to reappear in the\nrevised harm argument just described. For although this argument does\nnot call for compensating the present U.S. black population for the\nharms that slavery caused it, it may seem to call for compensating the\npresent U.S. black population for the harms it suffers because of\npolicies enacted and enforced before it was conceived. Given that these\npolicies would have affected who was conceived in succeeding U.S. black\npopulations, had they not occurred the present U.S. black population\nwould not exist.\n\nThe following discussion shows how this difficulty can be avoided.\nImagine two slaves, Tom and Beulah released from slavery. They were\nreleased from slavery but the government continued to wrong them in at\nleast two ways: first, by preventing them from exercising rights\nguaranteed to every citizen; second, by violating their rights to be\ncompensated for the harms that it had caused them by supporting their\nenslavement. And both these wrongs probably harmed them. Obviously\npreventing them from voting or going to school probably harmed them;\nand the harm that often results when one’s right to be\ncompensated is violated is an additional harm, on top of the harm\ncaused by the first violation of right. If you owe me a hundred dollars\nto compensate me for wrongly breaking my arm, you wrong me again by\nrefusing to give me what you owe me, and you might owe me another\nthousand dollars for the harms that second wrong might cause me, for\nexample going around for a month with the pain and inconvenience of an\nunfixed broken arm. Now the government wronged Tom and Beulah in the\ntwo ways mentioned as soon as it caused them to be released from\nslavery and before Beulah conceived any child; but it also continued to\nwrong them in these ways after the conception of their daughter, Eulah.\nThese wrongs to Tom and Beulah almost certainly harmed them by forcing\nthem to remain longer in the poverty and ignorance that slavery had put\nthem in. But it is more germane to the present argument that the wrongs\nalso almost certainly harmed their daughter Eulah. They harmed her by\nkeeping her parents in poverty and ignorance and by, therefore, also\nkeeping her in ignorance and poverty. They also harmed her by causing\nher to be raised by parents with the various disabilities that the\nexperience of slavery normally causes its victims. And if she acquired\nthese disabilities from her parents by imitation and necessity, and if\nthese disabilities harmed her, the government’s wrongs caused\nthose harms too. If wrongdoers must make reparations for the damages\ntheir wrongdoing causes other people, then the government must make\nreparations to Eulah.\n\nThe argument is not that Eulah has a claim to the compensation her\nparents Tom and Beulah’s were owed and never paid. If that were\nthe argument, we would have an inheritance argument, not a\ncounterfactual argument. Eulah’s claim for compensation is for\nharms she herself suffered. And she can rightly press that claim\nagainst the government. It is not as though her parents could have done\nbetter by her but chose not to. The government’s wrongs prevented\nthem from doing better by her. They had no choice but to raise her in\npoverty and ignorance. The government could have given them a choice if\nit had compensated for their wrongfully caused harms, or allowed to\nrecover from them. But it did not. Second, the amount of the\ncompensation she is owed does not depend on the amount of compensation\nthey were owed. It depends on the harms she suffered. Though she\nsuffered those harms because they were harmed and not compensated,\ncompensating her for her harms may be much more, (or much less), than\ncompensating them.\n\nThird, she may have an inheritance-based claim to their\ncompensation. The fact that she was harmed because they were not\ncompensated and can claim compensation for that harm does not mean that\nthey lose their claim to be compensated for their harms. If they were\nnever compensated she may therefore inherit a right to their\ncompensation. The counterfactual argument is compatible with the\ninheritance-based argument.\n\nFourth, her claim for compensation is not confounded by the argument\nthat she would not exist had the wrongs that caused her harms not\noccurred. Those wrongs are not the wrongs of slavery, which occurred\nbefore she was conceived, and indeed were among the causes of her being\nconceived. And they are not the wrongs that government committed\nagainst her parents after it released them from slavery and before she\nwas conceived. They are the wrongs that were all committed after her\nconception. They are the wrongs of not protecting her parents’\nrights and failing to compensate them for the wrongs already committed\nagainst them. Had those wrongs not been committed, she would have lived\nin less straitened conditions, and would have been less constrained to\nimitate and duplicate her parents’ slavery induced qualities and\nhabits.\n8. The Inheritance Argument\n\n\nThe inheritance argument for black reparations states that the freed\npeople had rights to reparations for their injuries; that they held\nthese rights against the slave holders and also against the state and\nfederal governments for failing in their duties to protect them from\nthe slave holders; that these rights were never honored; and finally,\nthat they passed on the right of inheritance to present day U.S. blacks\nwho are their descendants and heirs. (Corlett 2010)\n\nThis argument avoids the objection that the present black population\nwould not exist if their ancestors had never been enslaved. And each\npremise seems plausible. When people die their rights to their property\nare normally passed on to their heirs (Boxill 1972: 113–122;\nKershnar 1999: 95–101). The reparations owed to the freed people\nwas their property; it was never in their physical possession of\ncourse, but obviously something need not be in your possession to be\nyour property. Neither did the freed people abandon their inheritance.\nLaws and guns very forcefully kept it from them. Consequently, it\nshould pass, by right of inheritance, to their descendants, the present\nblack\n population.[3]\n\nTwo important objections against the inheritance argument are: first\nthat it relies on the counterfactual claim that the freed people and\ntheir descendants would have held on to their reparations had they\nreceived it; and second that it demands that people make reparations\nfor the injuries of a crime that they could not have committed. Let us\nbegin with the second.\n\nLocke’s discussion of a lawful conqueror’s rights to\nreparations suggests how to solve it. “The right of\nConquest”, Locke claims, “extends only to the Lives of\nthose who joyn’d in the War, not to their Estates, but only in\norder to make reparation for the damages received, and the Charges of\nthe War, and that too with reservation of the right of the innocent\nWife and Children” (Locke 1689: sec. 180). Locke’s claim is\nthat the lawful conqueror has rights to reparations from the estates of\nthose who unjustly waged war against him, though some part of these\nestates should be reserved for their wives and children. The clear\nimplication is that the wives and children would have gotten a larger\npart of the estates in question had their husbands and fathers not\nharmfully transgressed against the lawful conqueror; but Locke would be\nguilty of self-contradiction if he had meant that the wives and\nchildren were being forced to pay or make reparations for the harms\ntheir fathers’ and husbands’ the crimes caused. His view\nwas that when people unjustly harm others, a portion of their estates\nmay be used to make reparations to the people they harmed, and as a\nnecessary result their children cannot inherit that portion of their\nestates.\n\nThe following argument parallels Locke’s argument: the slave\nholders harmed the slaves. Consequently the slaves had rights to\nreparations against the estates of the slave holders; these rights\nreduced the extent of the estates that the slave holders’\nchildren would otherwise have inherited from them; the slaves were\nforcibly prevented from exercising those rights; but it is absurd to\nsuppose that people lose rights just because they are forcibly\nprevented from exercising those rights; consequently the slaves\nretained their rights against the estates of the slave holders; present\nday U.S. blacks are their heirs; consequently present day U.S. blacks\nhave rights against the estates of the slave holders. This argument\ndoes not prove much. Even if many descendants of the slave holders can\nbe identified, proving that they inherited their property from their\nslave holding ancestors seems hopeless. But the argument can be\nimproved. The first step is to see that the slaves did not have rights\nto reparations only against the slave holders. This step may seem to\nfollow easily from Locke’s famous theory that residence in a\nstate is tacit consent to it (Locke 1689: sec 119). This theory applied\nto the case of the lawful conqueror might seem to commit Locke to the\nview that the lawful conqueror had rights to reparations against all\nmembers of the state that waged the unjust war against him. But in fact\nLocke explicitly denied that it did. “The people” he said\ngave “to their governors no power to do an unjust thing, such as\nis to make an unjust War, (for they never had such power in\nthemselves:) They ought not to be charged as guilty of the Violence and\nInjustice that is committed in an Unjust war, any further than they\nactually abet it” (Locke 1689: sec 179).\n\nAnd he identified those who “actually abet” and unjust\nwar as those who “assisted, concurred, or consented”, to\nthat war (Locke 1689: sec 179). It may seem that Locke is guilty of\nself-contradiction here at least if we suppose that to consent to\nsomething, even tacitly, is to give the “power”, that is,\nthe right to do it. But Locke evidently did not suppose that to consent\nto another’s action is to give the other the right to do it; and\nno one else supposes that it does, except perhaps confused\nphilosophers. For such a supposition implies that one could not consent\nto another’s unjust action since of course one cannot give\nanother a right to act unjustly, but of course people can and do often\nconsent to another’s unjust action. To consent to another’s\naction is “to make oneself a partner in the other’s action\nand to accept a share in the responsibility for it” (Boxill 1993:\n96–99). This suggestion may seem to leave us with the conclusion\nthat if voluntary residence in a state is tacit consent to it, as\nLocke’s theory says, then all the residents of a state must have\naccepted responsibility for the state’s actions, including its\nunjust wars, and consequently that the just conqueror must have rights\nto reparations against all residents of the state. But, as we have\nseen, Locke denies that the lawful conqueror has such rights. The\nsolution to this puzzle lies in a peculiarity of most signs of tacit\nconsent. The peculiarity is that signs of tacit consent are normally\nconditions people have good reason to be in other than to give their\nconsent. Thus voluntary residence in a state is a sign of tacit consent\nto it because most residents of a state have good reason to reside in\nthe state other than to give consent to it. Since a sign of consent\nwould be coerced, and consequently not a sign of consent if not making\nit is impossible or very costly, it follows that every sign of tacit\nconsent, like residence in a state, must be such as to allow people to\nmake the sign, while withdrawing their consent by making some cheap and\neasily performed sign of dissent. This reasoning suggests how Locke can\nsay both that voluntary residence in a state is tacit consent to its\nactions and that the lawful conqueror has rights to reparations from\nonly those who “assisted, concurred, or consented”, to\ntheir state’s unjust wars against him. All voluntary residents of\na state have tacitly consented to its actions but only those who fail\nto make some sign of dissent to its unjust wars, have consented to its\nwaging these wars, at least if there are signs of dissent that are\nrelatively easy to make and are not too costly.\n\nReturning to the question of reparations for slavery, U.S. citizens\nprior to the Civil War knew that their government permitted and\nsupported slavery and also knew that slavery was a crime. The slave\nholding states certainly tried to conceal the full horrors of their\n“peculiar institution” but the evidence suggests that their\nefforts were not successful. Consequently, since few white U.S.\ncitizens expressed dissent from their government’s complicity in\nthe crime of slavery, although it did not punish such dissent, it seems\nfair to conclude that most white U.S. citizens voluntarily consented to\ntheir government’s complicity in the crime. In Locke’s\nlanguage, they “assisted, concurred, or consented” to the\ngovernment’s injustice against the slaves. Therefore, still\nfollowing Locke, it follows that the slaves had rights to reparations\nagainst almost the entire white population of the United States for the\ndamages that their enslavement caused them. This argument is perhaps\nopen to the objection that there was in the period of slavery more than\na little dissent to the government’s complicity in the crime of\nslavery; certainly the abolitionists strongly expressed their dissent.\nOr alternatively it could be objected that dissenting from the\ngovernment’s complicity in slavery in the Deep South did carry\nconsiderable costs including costs not necessarily imposed by the\ngovernment. Finally, the argument also requires a fuller account of\nwhat residents of a state must do in order to make appropriate signs of\ndissent from the injustice of their government, and consequently to\navoid being rightly accused of consenting to that injustice.\nPresumably, confiding to a few friends that one was opposed to slavery\nwould not be enough. But if these problems can be satisfactorily\nsettled, then since the slaves had titles to reparations against the\nestates of those who assisted, concurred or consented to their\nenslavement, they would have titles to reparations against practically\nthe entire white population, not just against the estates of the\nslave holders. These reparations were never paid. Instead each\nwhite generation specified that only whites of the succeeding\ngeneration were permitted to own, or compete for, or be educated by,\nthe assets it was leaving behind. Since the slaves had titles to\nreparations against these assets, and the present generation of U.S.\nblacks is the slaves’ heir, the present generation of U.S. blacks\nhas inherited titles to a portion of the assets held by the present\nwhite population. This includes the white immigrants who arrived in the\nU.S. after the abolition of slavery to take advantage of opportunities,\nfunded by assets the slaves had titles to, or for the education the\nslaves and descendants were prevented from getting, or to take natural\nassets including land that the slaves also had titles to. The fact that\nthey competed for these opportunities and worked hard misses the point\nsince many of these “so called” opportunities had already\nbeen inherited by and were the property of, the slaves’ heirs\n(Corlett 2010: 161–186).\n\nLocke put a limit on the right to reparations. In the case he\ndiscussed, the lawful conqueror’s right to reparations was\nlimited by reservations made for the rights of the wife and children of\nthose engaged in or consented to the unjust war against him. As Locke\nput it:\n\n\nThe Conqueror has a Title to Reparations for Damages received, and\nthe Children have a Title to their Father’s Estate for their\nSubsistence…What must be done in the case? I answer; The\nFundamental Law of Nature being, that all, as much as may be, should be\npreserved, it follows, that if there be not enough fully to satisfy\nboth, viz, for the Conqueror’s Losses, and the Children’s\nMaintenance, he that hath, and to spare, must remit something of his\nfull Satisfaction, and give way to the pressing and preferable Title of\nthose, who are in danger to perish without it. (Locke 1689:\nsec.183)\n\n\n\nThus Locke appeals to the Fundamental Law of Nature which requires\nthat all or as much as may be should be preserved in order to argue\nthat that the lawful conqueror’s right to reparations must give\nway if it comes into conflict with the rights to subsistence and\nmaintenance of the children of those who owe him reparations. But Locke\ndoes not say that the lawful conqueror’s right to reparations is\ntrumped by the children’s right to inheritance; on his\naccount, it is the right to subsistence that trumps the right to\nreparations when the two rights conflict. When Locke limits the\nconqueror’s right to reparations, he does so in order to\naccommodate the rights to subsistence of innocent children. He is\nconcerned that such children will die if he presses the right to\nreparations too hard, not that they will inherit very little.\n\nDo these reasonable limitations on the right of inheritance have any\nrelevance to whether U.S. blacks have a right to inherit the\nreparations owed their slave ancestors? Here it is important to note\nthese limitations do not abolish or cancel the right to inheritance.\nThey do not imply, that is, that there is no right to inherit at all.\nThey allow that there is such a right, and that it holds in normal\ncircumstances, but that it fails to hold or is outweighed when allowing\nit to hold would make innocent people destitute, or create large\ninequalities that are likely to lead to exploitation and domination. In\nother words, we cannot set aside the inheritance argument just because\nit depends on the right of inheritance. We can set aside the\ninheritance argument aside only if implementing it would make innocent\npeople destitute or create large inequalities that are likely to lead\nto their exploitation and domination. But would implementing the\ninheritance argument have these results? It would not. The slaves were\nhorribly harmed by slavery, but paying or making reparations to them\nwould not have required turning over a continent to them. It would have\ncalled for no horrendous uprooting of populations, or driven anyone\ninto poverty, or created morally outlandish inequalities. The slaves\nwould not suddenly have become the masters and the whites their\nsubordinates. The nation could have made reparations and suffered mild\ndiscomfort at worst. As for the right of inheritance of their heirs, we\nmust remember that it is not limited by the mere length of time between\nbenefactor and heir. The right of inheritance is limited by the\ndangerous and morally repugnant inequalities that would result from\nhonoring it. These could appear after one generation, or fail to appear\nafter ten generations. We are certainly not referring here to a statute\nof limitations. It would be wrong for someone’s immediate heir to\ninsist on his right to inherit his father’s goods if this would\ncause undue hardship to others, or put him in a position to oppress\nthem. But it would be right for someone’s distant heir to insist\non her right to inherit his goods if this could save her from hardship\nor oppression at the hands of her debtors. But is not this latter case\nexactly similar to that of U.S. blacks? Would they not save themselves\nfrom hardship and oppression at the hands of their debtors if they\ninsisted on their right to inherit the reparations that were owed their\nslave ancestors and never paid?\n9. Supersession and Historic Injustices\n\n\nOthers have objected to arguments for reparations for\n“historic” injustices, specifically Europeans’ theft\nof Australia, New Zealand, Canada and the U.S. from their original\noccupiers the Aborigines, Maori, and American Indians (Waldron 1992:\n4–28). The basic objection is that the historic wrongs of the\nancestors of the Europeans now in the territories have been\n“superseded” (Waldron 1992: 24). Possibly the objection can\nbe raised against the inheritance argument for reparations to U.S.\nblacks.\n\nThe following example has been used to illustrate what is meant by\nan historic wrong being superseded. Suppose that there are plenty of\nwater holes on the savanna and two groups P and Q\neach have a waterhole, but\n\n\n\nmotivated purely by greed, members of group Q descend on\nthe water hole possessed by group P and insist on sharing that\nwith them. (What’s more they do not allow reciprocity; they do\nnot allow members of P to share any water hole that was\nlegitimately in the possession of Q.) That is an injustice.\nBut then circumstances change, and all the water holes of the territory\ndry up except the one that originally belonged to P. The\nmembers of group Q are already sharing that water hole on the\nbasis of their earlier incursion. But now that circumstances have\nchanged, they are entitled to share the water hole; so that their doing\nso no longer counts as an injustice. It is in fact part of what justice\nrequires. The initial injustice of Q against P has\nbeen superseded by circumstances. (Waldron 1992: 25)\n\n\n\nWhat is meant by the circumstances having changed so that the\ninitial injustice “has been superseded?” The meaning seems\nto be that, although the members of Q acted unjustly when they\nfirst shared P’s water hole, they do not act unjustly\nnow when they share P’s water hole; and this is because\ncircumstances have changed. In the changed circumstances the members of\nP and Q are now joint owners of the waterhole. It\nmight be asserted that this follows from one of the conditions Locke\nlaid down as necessary for taking something as property, the Lockean\nproviso, as Nozick famously put it (Nozick 1974: 175; Locke 1689: Book\nII, 5, sec 27). According to the proviso, the water hole used to be\nP’s waterhole when circumstances were such that it was\npermissible for P to make it his property. But circumstances\nhave changed so that it is no longer permissible for P to make\nthe waterhole his exclusive property. The present circumstances make\nthe waterhole the joint property of P and Q.\n\nThis argument seems persuasive if we suppose that the only\nalternative to making the waterhole the joint property of P\nand Q is for P to prevent Q from using its\nwater since in that case Q would die very painfully. But there\nare other alternatives. Members of P (Ps) can\ngenerously allow the members of Q (Qs) to use the\nwater; or they can sell the water to the members of Q; or they\ncan rent Q a piece of land next to the waterhole. These\nalternatives may be ruled out by Locke’s apparent opposition to\narrangements that put some people in a position of extraordinary\ndependence on others. For example, he argued that a beggar has a\n“right” to a portion of a rich man’s surplus when she\nmust have it in order to survive. If so the Qs must have\nrights to an adequate supply of the water in P’s\nwaterhole. Otherwise if the Ps with ostensible generosity\nallowed Qs to drink they could also have demanded demeaning\nbehavior from the Qs in exchange; or if they sold water to the\nQs they could raise its price as much as they liked; and so\non. But in any case, there are alternatives to the joint ownership of\nthe waterhole by the Ps and Qs that do not turn the\nQs into P’s dependents. We could, for example,\ndivide the waterhole so that the Qs get an adequate supply of\nwater and are not dependent on the Ps.\n\nIn this scenario, the entire case for supersession would seem to\nrest on the Lockean proviso and its alleged prohibition of claiming\nunowned stuff as property when there is not enough and as good left\nover for others. We say “alleged prohibition” for it is not\nat all clear that Locke’s words amount to such a prohibition.\nHowever, the supersession thesis fails even if we allow the\nprohibition. To see this, let us agree that the Ps and\nQs are now joint owners of the waterhole and that the\nPs cannot demand that the Qs depart leaving them the\nwaterhole’s sole owners. Our agreement does not imply that we\nalso agree that the Ps cannot demand reparations from the\nQs for the damages that the Qs earlier wrongly caused\nthem. That would be absurd because it implies that the Ps and\nthe Qs had always been joint owners of the waterhole, but by\nassumption the Ps and Qs were not always joint owners\nof the waterhole. In particular, by assumption, the Ps were\nonce the sole owners of the waterhole when the Qs attacked\nthem and stole their water. This foregoing sketch is meant to parallel\nthe case of the Europeans and indigenous peoples in New Zealand,\nAustralia, and the Americas. For convenience, let us consider the\nEuropeans and the Maoris in New Zealand. We concede that these two\npeople are now the joint owners of the land mass of New Zealand. The\nMaoris cannot demand that land mass back as reparation because they are\nno longer its sole owners. They used to be its sole owners, but\ncircumstances have changed and now they are only its joint owners. No\none can demand that anyone leave. But that concession does not make the\ninjustice of the European conquest two hundred years ago disappear into\nthin air. New Zealand may not now belong exclusively to the Maori, but\nit once did, and when it did, the Europeans did then injure them\nunjustly. If those injuries persist in the Maoris’ descendants\nbecause the European conquerors and their descendants did not pay or\nmake reparations to the original Maoris, their descendants have rights\nto reparations against the Europeans’ descendants for their\ninjuries, even if they do not have rights that the Europeans’\ndescendants leave New Zealand to them. To put the point in a different\nway, the fact that restitution is no longer possible and morally\nmandatory does not imply that reparations is not still possible and\nmorally mandatory. Restitution, the return of a stolen item to its\nrightful owner, is often a part of making reparations to the victim of\nthe theft, but as we stressed earlier it is neither necessary nor\nsufficient for such reparations. It is not sufficient because if I\nsteal your bicycle and then return it to you, though I have made\nrestitution I have not made reparations since the damages you suffer as\na result of my theft may be more that the loss of the bicycle; and\nrestitution the return of your bicycle may not cancel, undo or erase\nthe damages you suffered as a result of my theft. And restitution is\nnot necessary for reparations because while the loss or destruction of\na stolen item may make its restitution impossible, it does not make\nreparation for the loss of the item impossible or obligatory. If the\nbicycle I stole from you is lost restitution is impossible. But it does\nnot follow that reparations is impossible. I can still make reparations\nto you by providing you with the money to buy another\n one.[4]\n\nThe distinction between restitution and reparations resolves another\ncase that may weaken sympathies for reparations for historic\ninjustices. The case involves the theft of a car that ends up years\nlater the treasured possession of the thief’s daughter who has no\nidea that it was stolen (Waldron 1992, 14–15). In the meantime, the\ncar’s original owner has eventually outgrown his attachment to it\nand gotten many other cars. The inference that we are invited to draw\nis that it would be wrong for him to compel the thief’s daughter\nto return the car to him, given that she has invested so much of her\nlife in it and he has lost interest in it. Perhaps; but just because it\nwould be wrong of him to demand restitution, it does not follow that it\nwould be wrong of him to demand reparations; that his rights to\nreparations are somehow “superseded”. This is an entirely\ndifferent question. The owner may act wrongly in insisting on\nrestitution; maybe he should allow the thief daughter to keep the car.\nBut it does not follow that he cannot demand reparations from the thief\nfor the losses he suffered as a result of the theft of his car.\n\nThese results should make it obvious that the supersession argument\ncannot nullify claims for reparations for historic injustices. To\nconsider the example of New Zealand, perhaps restitution of the land\nmass of New Zealand to the Maori is out of the question. Perhaps\njustice cannot demand that Europeans leave New Zealand to the Maori.\nBut it does not follow that justice does not demand that the Europeans\nmake reparations to the Maori for violating their rights and injuring\nthem when New Zealand belonged to them. Theft injures the victim by\ndepriving him of the thing that was stolen from him; but it also\ninjures him by depriving him of the benefits that he was going to earn\nand enjoy because of his possession of that thing. For the reasons we\nhave surveyed, he may lose his rights to restitution; the thing for\nexample may be lost or destroyed. But it does not follow that he\ntherefore also loses his rights to reparations. Arguments for those\nrights have to deal with the various objections to historic reparations\nreviewed in this entry and elsewhere, but they are not undone by the\nsupersession argument.\n10. Reparations Policies\n\nNot much has been published on possible policies of reparations to\nU.S. blacks. But at least a few words concerning such matters are in\norder in case said reparations are morally justified\nand\n required.[5]\nA rights-based\napproach to reparations to U.S. blacks by the U.S. government might\nmost plausibly construe such reparations both compensatorily and\nnon-compensatorily. In so doing, reparations are a cluster of rights to\nsuch means of corrective justice imposing duties on the U.S. government\nto provide said reparations to U.S. blacks. The provision of such\nrights is not to be diminished due to the amount of that which is owed,\nthough it would be counter-productive to settle on an amount or demand\nso much that the U.S. could not possibly pay it. The main point is to\nestimate a combined figure that captures the fact that the peculiar\ninstitution was widely and deeply supported by several U.S. industries\nand workforces, from U.S. financial institutions to ship builders, from\nU.S. lawmakers and courts to slave owners, and well beyond (DeWolf\n2008). Thus it is not unreasonable to argue that there was and remains\na collective liability of the U.S. to provide such reparations (Corlett\n2010: 161–186; McGary 1999).\n\nCompensatory reparations can be calculated with approximation by\nfiguring on a moderate number of sub-Saharan Africans who were brought\nagainst their wills to the territory of the U.S. to serve as slaves.\nThen a moderate estimation can be made of average life expectancy of\nsaid slaves, and how many hours a day and per week, etc. said slaves\nworked without monetary compensation. Perhaps even more important are\nthe human rights abuses of slavery itself, an amount that might be\nestimated in terms of punitive damages. There are also social,\npolitical and psychological effects of slavery, among others, damages\nto some extent lingering amongst several U.S. black communities\nthroughout the U.S..\n\nHowever, in order to respect the sovereignty of U.S. blacks as a\npeople and their autonomy as individuals, no presumption should be made\nthat would make the provision of reparations to them dependent on the\nreconciliation between said blacks and the U.S.. In order to effect\nthis, a Committee on Black Reparations might be established only by\nvote of U.S. blacks, having a 3–4 year service for each member. There\nwould be no shortage of highly qualified U.S. blacks to serve\nexcellently on said committee: from educators, business persons,\nattorneys, medical experts, etc.. Said committee would alone decide\nwhat to do with the monetary reparations paid by the U.S. Treasury. An\nannual audit of the transactions between the two parties could be\nconducted by a party of the committee’s choice.\n\nSince the amount of compensatory reparations would likely reach into\nthe trillions of dollars, the U.S. Congress would be asked to pass into\nlaw a U.S. Black Reparations Tax which might amount to a 3% tax on\nevery income made in the U.S., in perpetuity (In perpetuity because of\nthe relatively low percentage of the tax). The taxes received by the\ncommittee would presumably be used for the education of U.S. blacks,\nmedical costs, job training, retirement benefits, cash disbursements\nfor rent, mortgage payments, etc.. \n\nBut also owed to U.S. blacks are non-compensatory reparations. Among\nother things, the names and images of the confederacy have no place in\nofficial public spaces as if they represented the U.S., state or local\ngovernment. This is because, among other things, the U.S. Civil War was\n(at least in the minds of many) supposed to symbolize the bloody and\npainful sacrifice of many soldiers and families for the sake of\ninstituting a slaveless society. Because of this, U.S. history books\nmust continue to be revised in order to provide more balanced and\naccurate stories of the truth, inclusive of all peoples. This includes\nthe revelation of the ugliest of truths often shrouded in myths in the\nname of U.S. patriotism. But genuine patriotism has nothing to do with\nmisleading or false information dressed in the guise of history. It\nmust often recount the evils of the 1921Tulsa, Oklahoma massacre of\nU.S. blacks by whites, the 1923 Rosewood, Florida massacre of many U.S.\nblacks by many U.S. whites, the murder of Emmet Till and the lynchings\nof thousands of other blacks, and the pervasive terrorism of U.S.\nblacks by the KKK. Continued recognition of such evils must replace\nself-serving glorified images and imaginings which persist to this very\nday in the minds of many U.S. whites that in one way or another promote\nwhite privilege. Such changes should be lawfully instituted, not\nbecause to fail to do so would stand as offensive (Corlett 2018), but\nrather because truth, justice and fairness demand it.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Bedau, Hugo Adam, 1972, “Compensatory Justice and the Black\nManifesto”, <em>Monist</em>, 56(1): 20–42.",
                "Bittker, Boris, 2003 [1973], <em>The Case For Black\nReparations</em>, second edition, Boston: Beacon Press, page numbers\nfrom this edition.",
                "Boxill, Bernard R., 1972, “The Morality of Reparation”,\n<em>Social Theory and Practice</em>, 2(1): 113–123.",
                "–––, 1993, “On Some Criticisms of Consent\nTheory”, <em>Journal of Social Philosophy</em>, 24:\n81–102.",
                "–––, 2003a, “The Morality of Reparation\nII”, in <em>A Companion to African American Philosophy</em>,\nTommy L. Lott and John P. Pittman (eds), Malden: Blackwell Publishing\nCompany, 134–147.",
                "–––, 2003b, “A Lockean Argument for Black\nReparations”, <em>The <em>Journal of Ethics</em></em>, 7(1):\n63–91.",
                "Brooks, Roy L., 1999: “The Age of Apology”, in Roy L.\nBrooks (ed.), <em>When Sorry isn’t Enough: The Controversy over\nApologies and Reparations for Human Injustice</em>, New York: New York\nUniversity Press, 3–11.",
                "Browne, Robert S., 1993, “The Economic Basis for Reparations\nto Black America”, <em>Review of Black Political Economy</em>,\n21(3): 99–110.",
                "Coates, Ta-Nehisi, 2014, “The Case for Reparations”,\n<em>The Atlantic</em>, June,\n <a href=\"http://www.theatlantic.com/magazine/archive/2014/06/the-case-for-reparations/361631/\" target=\"other\">Coates 2014 available online</a>.",
                "Cohen, Andrew I., 2009, “Compensation for Historic\nInjustices: Completing the Boxill and Sher Argument”,\n<em>Philosophy and Public Affairs</em>, 37: 81–102.",
                "Corlett, J. Angelo, 2003, <em>Race, Racism, and Reparations</em>,\nIthaca: Cornell University Press.",
                "–––, 2010, <em>Heirs of Oppression</em>, Totowa: Rowman &amp;\nLittlefield Publishers.",
                "–––, 2018, “Offensiphobia,” <em>The Journal of\nEthics</em>, 22: 113–146.",
                "Crummell, Alexander, 1891, “The Need for New Ideas and New\nAims,” in A. Crummell, <em>Africa and America: Addresses and\nDiscourses</em>, Springfield, MA: Willey &amp; Company, pp. 11,\n36.",
                "Davis, Adrienne D., 2000, “The Case for United States\nReparations to African Americans”, <em>Human Rights Brief</em>,\n7(3): 3–5, 11.",
                "Darity, William A., Jr., 2001, “End of Race?”\n<em>Transforming Anthropology</em>, 10(1): 39–43.",
                "Delany, Martin Robinson, 1852, <em>The Condition, Elevation,\nEmigration, and Destiny of the Colored People of the United\nStates</em>, New York: Humanity Books, 2004.",
                "–––, 1861, <em>Official Report of the Niger\nValley Exploring Party</em>, New York: Thomas Hamilton.",
                "DeWolf, Thomas Norman, 2008, <em>Inheriting the Trade</em>, Boston:\nBeacon.",
                "Douglass, Frederick, 1865, “What the Black Man Wants”,\nreprinted in <em>Negro Social and Political Thought\n1850–1920</em>, Howard Brotz (ed.), New York: Basic Books,\n1966.",
                "–––, 1882, <em>The Life and Times of Frederick\nDouglass</em>: <em>From 1817 to 1882</em>, London: Christian Age\nOffice.",
                "Du Bois, W.E.B, 1992 [1935], <em>Black Reconstruction</em>, New\nYork: Harcourt, Brace. Reprinted as, 1992, <em>Black Reconstruction in\nAmerica: 1860– 1880</em>, New York: The Free Press edition, page\nnumbers from the latter.",
                "Feinberg, Joel, 1970, <em>Doing and Deserving</em>, Princeton:\nPrinceton University Press.",
                "–––, 1980, <em>Rights, Justice, and the Bounds\nof Liberty</em>, Princeton: Princeton University Press.",
                "–––, 1992, <em>Freedom and Fulfillment</em>,\nPrinceton: Princeton University Press.",
                "Foreman, James, 1969, “Black Manifesto”, presented at\nthe The Black National Economic Conference, Detroit, Michigan, July 10,\n1969.\n [<a href=\"http://www.episcopalarchives.org/Afro-Anglican_history/exhibit/pdf/blackmanifesto.pdf\" target=\"other\">Foreman 1969 available online</a>]",
                "Fullinwider, Robert K., 2004, “The Case for\nReparations,” in <em>Reparations for Slavery</em>, Ronald P.\nSalzberger and Mary C. Tuck (eds.), Lanham, MD: Roman and Littllefield,\npp. 141–161.",
                "Goldberg, David Theo, 2006, “Deva-Stating Disasters: Race in\nthe Shadow(s) of New Orleans”, <em>Du Bois Review</em>, 3(1):\n83–95.",
                "Harrington, Michael and Arnold S. Kaufman, 1969, “Black\nReparations—Two Views”, <em>Dissent</em>,\n16(July–August): 310–320.",
                "Horowitz, David, 2003, <em>Uncivil Wars: The Controversy over\nReparations for Slavery</em>, San Francisco: Encounter Books.",
                "Jefferson, Thomas, 1785a [1954], <em>Notes on the State of\nVirginia</em>, Chapel Hill: University of North Carolina\nPress.\n [<a href=\"http://avalon.law.yale.edu/18th_century/jeffvir.asp\" target=\"other\">Jefferson 1785a also available online</a>]",
                "–––, 1785b [2006], “Letter to James Madison,\nOctober 28, 1785”, reprinted in Jefferson 2006: 154. [Also\navailable at\n <a href=\"http://founders.archives.gov/documents/Jefferson/01-08-02-0534\" target=\"other\">Jefferson 1785b available online</a>]",
                "–––, 2006, <em>The Essential Jefferson</em>, Jean\nM. Yarbrough (ed.), Indianapolis: Hackett.",
                "Kershnar, Stephen, 1999, “Are the Descendants of Slaves Owed\nCompensation for Slavery?” <em>Journal of Applied Philosophy</em>,\n16(1): 95–101.",
                "–––, 2001, “The Case Against\nReparations”, <em>Philosophy in the Contemporary World</em>,\n8(1): 41–46.",
                "–––, 2002, “The Inheritance-Based Claim to\nReparations”, <em>Legal Theory</em>, 8(2): 243–267.",
                "–––, 2004 <em>Justice for the Past</em>, Albany:\nSUNY Press.",
                "Levin, Michael, 1980, “Reverse Discrimination, Shackled\nRunners, and Personal Identity,” <em>Philosophical Studies</em>,\n37: 137–149.",
                "Locke, John, 1689, <em>Two Treatises of Government</em>, in Peter\nLaslett (ed.), <em>Locke’s Two Treatises of Government</em>,\nCambridge: Cambridge University Press, 1960.",
                "Lyons, David, 1977, “The New Indian Land Claims and the\nOriginal Rights to Land”, <em>Social Theory and Practice</em>,\n4(3): 249–272.",
                "–––, 2004, “Corrective Justice, Equal\nOpportunity, and the Legacy of Slavery and Jim Crow”, <em>Boston\nUniversity Law Review</em>, 84: 1374–1404.",
                "–––, 2013, <em>Confronting Injustice: Moral\nHistory and Political Theory</em>, Oxford: Oxford University\nPress.",
                "McGary, Howard, 1977, “Justice and Reparations”,\n<em>Philosophical Forum</em>, 9(2): 256–263.",
                "–––, 1999, <em>Race and Social Justice</em>,\nLondon: Blackwell.",
                "McGary, Howard Jr. and Bill E. Lawson, 1992, <em>Between Slavery\nand Freedom</em>, Bloomington: Indiana University Press.",
                "Morris, Christopher W., 1984, “Existential Limits to the\nRectification of Past Wrongs”, <em>American Philosophical\nQuarterly</em>, 21(2): 175–182.",
                "Myers, Peter C., 2008, <em>Frederick Douglass: Race and the Rebirth\nof American Liberalism</em>, Lawrence: University Press of Kansas.",
                "Nozick, Robert, 1974, <em>Anarchy State and Utopia</em>, New York:\nBasic Books.",
                "Perez, Nahshon, 2011, “On Compensation and Return: Can the\n‘Continuing Injustice Argument’ for Compensating for\nHistorical Injustices Justify Compensation for such Injustices, or the\nReturn of Property?” <em>Journal of Applied Philosophy</em>,\n28(2): 151–168.",
                "–––, 2012, <em>Freedom From Past Injustice: A\nCritical Evaluation of Claims for Inter-Generational Reparations</em>,\nEdinburgh: University of Edinburgh Press.",
                "–––, 2014, “Must We Provide Material\nRedress For Past Wrongs?” <em>Contemporary Debates in Applied\nEthics.</em>, Second Edition, Andrew I. Cohen and Christopher Heath\nWellman (eds), Oxford: Wiley Blackwell, 203–216.",
                "Rawls, John, 1999, <em>A Theory of Justice</em>, Revised Edition,\nCambridge: Harvard University Press.",
                "Roberts, Rodney C., 2001, “Why Have the Injustices\nPerpetrated Against Blacks in America not been Rectified”,\n<em>Journal of Social Philosophy</em>, 32(3): 357–373.",
                "–––, 2003, “The Morality of a Moral Statute\nof Limitations on Injustice”, <em>Journal of Ethics</em>, 7:\n115–138.",
                "Robinson, Randall, 2000, <em>The Debt: What America Owes to\nBlacks</em>, New York: Penguin.",
                "Schedler, George, 2002, “Principles for Measuring the Damages\nof American Slavery”, <em>Public Affairs Quarterly</em>, 16(4):\n377–404.",
                "Sher, George, 1981, “Ancient Wrongs and Modern Rights”\n<em>Philosophy and Public Affairs</em>, 10(1): 3–17.",
                "–––, 1997, <em>Approximate Justice: Studies in\nNon-Ideal Theory</em>, Lantham: Rowman and Littlefield.",
                "–––, 2005, “Transgenerational\nCompensation”, <em>Philosophy and Public Affairs</em>, 33(2):\n181–200.",
                "Simmons, A. John, 1995, “Historical Rights and Fair\nShares”, <em>Law and Philosophy</em>, 14(2): 149–184.",
                "Thompson, Janna, 2002, <em>Taking Responsibility for the Past:\nReparation and Historical Injustice</em>, Cambridge: Polity Press.",
                "–––, 2009, <em>Intergenerational Justice: Rights\nand Responsibilities in an Intergenerational Polity</em>, New York:\nRoutledge.",
                "Valls, Andrew, 2007, “Reconsidering the Case for Black\nReparations”, in <em>Reparations: Interdisciplinary\nInquiries</em>, Jon Miller and Rahul Kumar (eds), Oxford: Oxford\nUniversity Press, 114–129.",
                "Valls, Andrew and Jonathan Kaplan, 2007, “Housing\nDiscrimination as a Basis for Black Reparations”, <em>Public\nAffairs Quarterly</em>, 21(3): 255–273.",
                "Viren, Sarah, 2021, “The Genealogy of a Lie,” <em>The\nNew York Times Magazine</em>, 26–33, 45–46, 49.",
                "Waldron, Jeremy, 1992, “Superseding Historic\nInjustice”, <em>Ethics</em>, 103(1): 4–28.",
                "–––, 2002, “Redressing Historic\nInjustice”, <em>The University of Toronto Law Review</em>, 52(1):\n135–160."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Bedau, Hugo Adam, 1972, “Compensatory Justice and the Black\nManifesto”, <em>Monist</em>, 56(1): 20–42.</li>\n<li>Bittker, Boris, 2003 [1973], <em>The Case For Black\nReparations</em>, second edition, Boston: Beacon Press, page numbers\nfrom this edition.</li>\n<li>Boxill, Bernard R., 1972, “The Morality of Reparation”,\n<em>Social Theory and Practice</em>, 2(1): 113–123.</li>\n<li>–––, 1993, “On Some Criticisms of Consent\nTheory”, <em>Journal of Social Philosophy</em>, 24:\n81–102.</li>\n<li>–––, 2003a, “The Morality of Reparation\nII”, in <em>A Companion to African American Philosophy</em>,\nTommy L. Lott and John P. Pittman (eds), Malden: Blackwell Publishing\nCompany, 134–147.</li>\n<li>–––, 2003b, “A Lockean Argument for Black\nReparations”, <em>The <em>Journal of Ethics</em></em>, 7(1):\n63–91.</li>\n<li>Brooks, Roy L., 1999: “The Age of Apology”, in Roy L.\nBrooks (ed.), <em>When Sorry isn’t Enough: The Controversy over\nApologies and Reparations for Human Injustice</em>, New York: New York\nUniversity Press, 3–11.</li>\n<li>Browne, Robert S., 1993, “The Economic Basis for Reparations\nto Black America”, <em>Review of Black Political Economy</em>,\n21(3): 99–110.</li>\n<li>Coates, Ta-Nehisi, 2014, “The Case for Reparations”,\n<em>The Atlantic</em>, June,\n <a href=\"http://www.theatlantic.com/magazine/archive/2014/06/the-case-for-reparations/361631/\" target=\"other\">Coates 2014 available online</a>.</li>\n<li>Cohen, Andrew I., 2009, “Compensation for Historic\nInjustices: Completing the Boxill and Sher Argument”,\n<em>Philosophy and Public Affairs</em>, 37: 81–102.</li>\n<li>Corlett, J. Angelo, 2003, <em>Race, Racism, and Reparations</em>,\nIthaca: Cornell University Press.</li>\n<li>–––, 2010, <em>Heirs of Oppression</em>, Totowa: Rowman &amp;\nLittlefield Publishers.</li>\n<li>–––, 2018, “Offensiphobia,” <em>The Journal of\nEthics</em>, 22: 113–146.</li>\n<li>Crummell, Alexander, 1891, “The Need for New Ideas and New\nAims,” in A. Crummell, <em>Africa and America: Addresses and\nDiscourses</em>, Springfield, MA: Willey &amp; Company, pp. 11,\n36.</li>\n<li>Davis, Adrienne D., 2000, “The Case for United States\nReparations to African Americans”, <em>Human Rights Brief</em>,\n7(3): 3–5, 11.</li>\n<li>Darity, William A., Jr., 2001, “End of Race?”\n<em>Transforming Anthropology</em>, 10(1): 39–43.</li>\n<li>Delany, Martin Robinson, 1852, <em>The Condition, Elevation,\nEmigration, and Destiny of the Colored People of the United\nStates</em>, New York: Humanity Books, 2004.</li>\n<li>–––, 1861, <em>Official Report of the Niger\nValley Exploring Party</em>, New York: Thomas Hamilton.</li>\n<li>DeWolf, Thomas Norman, 2008, <em>Inheriting the Trade</em>, Boston:\nBeacon.</li>\n<li>Douglass, Frederick, 1865, “What the Black Man Wants”,\nreprinted in <em>Negro Social and Political Thought\n1850–1920</em>, Howard Brotz (ed.), New York: Basic Books,\n1966.</li>\n<li>–––, 1882, <em>The Life and Times of Frederick\nDouglass</em>: <em>From 1817 to 1882</em>, London: Christian Age\nOffice.</li>\n<li>Du Bois, W.E.B, 1992 [1935], <em>Black Reconstruction</em>, New\nYork: Harcourt, Brace. Reprinted as, 1992, <em>Black Reconstruction in\nAmerica: 1860– 1880</em>, New York: The Free Press edition, page\nnumbers from the latter.</li>\n<li>Feinberg, Joel, 1970, <em>Doing and Deserving</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 1980, <em>Rights, Justice, and the Bounds\nof Liberty</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1992, <em>Freedom and Fulfillment</em>,\nPrinceton: Princeton University Press.</li>\n<li>Foreman, James, 1969, “Black Manifesto”, presented at\nthe The Black National Economic Conference, Detroit, Michigan, July 10,\n1969.\n [<a href=\"http://www.episcopalarchives.org/Afro-Anglican_history/exhibit/pdf/blackmanifesto.pdf\" target=\"other\">Foreman 1969 available online</a>]</li>\n<li>Fullinwider, Robert K., 2004, “The Case for\nReparations,” in <em>Reparations for Slavery</em>, Ronald P.\nSalzberger and Mary C. Tuck (eds.), Lanham, MD: Roman and Littllefield,\npp. 141–161.</li>\n<li>Goldberg, David Theo, 2006, “Deva-Stating Disasters: Race in\nthe Shadow(s) of New Orleans”, <em>Du Bois Review</em>, 3(1):\n83–95.</li>\n<li>Harrington, Michael and Arnold S. Kaufman, 1969, “Black\nReparations—Two Views”, <em>Dissent</em>,\n16(July–August): 310–320.</li>\n<li>Horowitz, David, 2003, <em>Uncivil Wars: The Controversy over\nReparations for Slavery</em>, San Francisco: Encounter Books.</li>\n<li>Jefferson, Thomas, 1785a [1954], <em>Notes on the State of\nVirginia</em>, Chapel Hill: University of North Carolina\nPress.\n [<a href=\"http://avalon.law.yale.edu/18th_century/jeffvir.asp\" target=\"other\">Jefferson 1785a also available online</a>]</li>\n<li>–––, 1785b [2006], “Letter to James Madison,\nOctober 28, 1785”, reprinted in Jefferson 2006: 154. [Also\navailable at\n <a href=\"http://founders.archives.gov/documents/Jefferson/01-08-02-0534\" target=\"other\">Jefferson 1785b available online</a>]</li>\n<li>–––, 2006, <em>The Essential Jefferson</em>, Jean\nM. Yarbrough (ed.), Indianapolis: Hackett.</li>\n<li>Kershnar, Stephen, 1999, “Are the Descendants of Slaves Owed\nCompensation for Slavery?” <em>Journal of Applied Philosophy</em>,\n16(1): 95–101.</li>\n<li>–––, 2001, “The Case Against\nReparations”, <em>Philosophy in the Contemporary World</em>,\n8(1): 41–46.</li>\n<li>–––, 2002, “The Inheritance-Based Claim to\nReparations”, <em>Legal Theory</em>, 8(2): 243–267.</li>\n<li>–––, 2004 <em>Justice for the Past</em>, Albany:\nSUNY Press.</li>\n<li>Levin, Michael, 1980, “Reverse Discrimination, Shackled\nRunners, and Personal Identity,” <em>Philosophical Studies</em>,\n37: 137–149.</li>\n<li>Locke, John, 1689, <em>Two Treatises of Government</em>, in Peter\nLaslett (ed.), <em>Locke’s Two Treatises of Government</em>,\nCambridge: Cambridge University Press, 1960.</li>\n<li>Lyons, David, 1977, “The New Indian Land Claims and the\nOriginal Rights to Land”, <em>Social Theory and Practice</em>,\n4(3): 249–272.</li>\n<li>–––, 2004, “Corrective Justice, Equal\nOpportunity, and the Legacy of Slavery and Jim Crow”, <em>Boston\nUniversity Law Review</em>, 84: 1374–1404.</li>\n<li>–––, 2013, <em>Confronting Injustice: Moral\nHistory and Political Theory</em>, Oxford: Oxford University\nPress.</li>\n<li>McGary, Howard, 1977, “Justice and Reparations”,\n<em>Philosophical Forum</em>, 9(2): 256–263.</li>\n<li>–––, 1999, <em>Race and Social Justice</em>,\nLondon: Blackwell.</li>\n<li>McGary, Howard Jr. and Bill E. Lawson, 1992, <em>Between Slavery\nand Freedom</em>, Bloomington: Indiana University Press.</li>\n<li>Morris, Christopher W., 1984, “Existential Limits to the\nRectification of Past Wrongs”, <em>American Philosophical\nQuarterly</em>, 21(2): 175–182.</li>\n<li>Myers, Peter C., 2008, <em>Frederick Douglass: Race and the Rebirth\nof American Liberalism</em>, Lawrence: University Press of Kansas.</li>\n<li>Nozick, Robert, 1974, <em>Anarchy State and Utopia</em>, New York:\nBasic Books.</li>\n<li>Perez, Nahshon, 2011, “On Compensation and Return: Can the\n‘Continuing Injustice Argument’ for Compensating for\nHistorical Injustices Justify Compensation for such Injustices, or the\nReturn of Property?” <em>Journal of Applied Philosophy</em>,\n28(2): 151–168.</li>\n<li>–––, 2012, <em>Freedom From Past Injustice: A\nCritical Evaluation of Claims for Inter-Generational Reparations</em>,\nEdinburgh: University of Edinburgh Press.</li>\n<li>–––, 2014, “Must We Provide Material\nRedress For Past Wrongs?” <em>Contemporary Debates in Applied\nEthics.</em>, Second Edition, Andrew I. Cohen and Christopher Heath\nWellman (eds), Oxford: Wiley Blackwell, 203–216.</li>\n<li>Rawls, John, 1999, <em>A Theory of Justice</em>, Revised Edition,\nCambridge: Harvard University Press.</li>\n<li>Roberts, Rodney C., 2001, “Why Have the Injustices\nPerpetrated Against Blacks in America not been Rectified”,\n<em>Journal of Social Philosophy</em>, 32(3): 357–373.</li>\n<li>–––, 2003, “The Morality of a Moral Statute\nof Limitations on Injustice”, <em>Journal of Ethics</em>, 7:\n115–138.</li>\n<li>Robinson, Randall, 2000, <em>The Debt: What America Owes to\nBlacks</em>, New York: Penguin.</li>\n<li>Schedler, George, 2002, “Principles for Measuring the Damages\nof American Slavery”, <em>Public Affairs Quarterly</em>, 16(4):\n377–404.</li>\n<li>Sher, George, 1981, “Ancient Wrongs and Modern Rights”\n<em>Philosophy and Public Affairs</em>, 10(1): 3–17.</li>\n<li>–––, 1997, <em>Approximate Justice: Studies in\nNon-Ideal Theory</em>, Lantham: Rowman and Littlefield.</li>\n<li>–––, 2005, “Transgenerational\nCompensation”, <em>Philosophy and Public Affairs</em>, 33(2):\n181–200.</li>\n<li>Simmons, A. John, 1995, “Historical Rights and Fair\nShares”, <em>Law and Philosophy</em>, 14(2): 149–184.</li>\n<li>Thompson, Janna, 2002, <em>Taking Responsibility for the Past:\nReparation and Historical Injustice</em>, Cambridge: Polity Press.</li>\n<li>–––, 2009, <em>Intergenerational Justice: Rights\nand Responsibilities in an Intergenerational Polity</em>, New York:\nRoutledge.</li>\n<li>Valls, Andrew, 2007, “Reconsidering the Case for Black\nReparations”, in <em>Reparations: Interdisciplinary\nInquiries</em>, Jon Miller and Rahul Kumar (eds), Oxford: Oxford\nUniversity Press, 114–129.</li>\n<li>Valls, Andrew and Jonathan Kaplan, 2007, “Housing\nDiscrimination as a Basis for Black Reparations”, <em>Public\nAffairs Quarterly</em>, 21(3): 255–273.</li>\n<li>Viren, Sarah, 2021, “The Genealogy of a Lie,” <em>The\nNew York Times Magazine</em>, 26–33, 45–46, 49.</li>\n<li>Waldron, Jeremy, 1992, “Superseding Historic\nInjustice”, <em>Ethics</em>, 103(1): 4–28.</li>\n<li>–––, 2002, “Redressing Historic\nInjustice”, <em>The University of Toronto Law Review</em>, 52(1):\n135–160.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "justice: intergenerational",
            "Locke, John: political philosophy",
            "Négritude",
            "race: and Black identity",
            "responsibility: collective"
        ],
        "entry_link": [
            {
                "../justice-intergenerational/": "justice: intergenerational"
            },
            {
                "../locke-political/": "Locke, John: political philosophy"
            },
            {
                "../negritude/": "Négritude"
            },
            {
                "../collective-responsibility/": "responsibility: collective"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=black-reparations\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/black-reparations/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=black-reparations&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/black-reparations/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=black-reparations": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/black-reparations/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=black-reparations&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/black-reparations/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}