{
    "url": "bolzano",
    "title": "Bernard Bolzano",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "Edgar Morscher",
        "author_links": [
            {
                "http://www.uni-salzburg.at/phs/morscher": "Edgar Morscher"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\n<a href=\"http://www.uni-salzburg.at/phs/morscher\" target=\"other\">Edgar Morscher</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Nov 8, 2007",
        "substantive revision Tue Dec 11, 2018"
    ],
    "preamble": "\n\nBernard Bolzano (1781–1848) was a Catholic priest, a professor\nof the doctrine of Catholic religion at the Philosophical Faculty of\nthe University of Prague, an outstanding mathematician and one of the\ngreatest logicians or even (as some would have it) the\ngreatest logician who lived in the long stretch of time between\nLeibniz and Frege. As far as logic is concerned, Bolzano anticipated\nalmost exactly 100 years before Tarski and Carnap their semantic\ndefinitions of logical truth and logical consequence; and in\nmathematics he is not only known for his famous Paradoxes of the\nInfinite, but also for certain results that have become and still\nare standard in textbooks of mathematics such as the\nBolzano-Weierstrass theorem. Bolzano also made important contributions\nto other fields of knowledge in and outside of philosophy. Due to the\nversatility of his talents and the various fields to which he made\nsubstantial contributions he became one of the last great polymaths in\nthe history of ideas.\n\nThe presentation of Bolzano’s personality that is given here\nwould still be incomplete unless it were added that Bolzano was also a\ngreat philanthropist. This becomes evident not only by Bolzano’s\nwritings in ethics and political philosophy, but it also manifests\nitself in practice by his activities for the benefit of the poor,\nsubjugated, discriminated and disadvantaged people. Together with his\nfriends and pupils he supported activities in favor of such things as\npoorhouses, homes for the blind, loan banks for the working-class, and\nlibraries and elementary schools in the countryside. \n\nThe first section of the article deals with Bolzano’s biography,\nand the second section presents a survey of Bolzano’s main\nwritings; the following sections (3 to 12) are devoted to the\ndifferent branches of philosophy to which Bolzano made contributions.\nIn the final section (13) Bolzano’s influence on the development\nof the sciences and on the intellectual life in Bohemia is\nconsidered.\n",
    "toc": [
        {
            "#BolLifSciCar": "1. Bolzano’s Life and Scientific Career"
        },
        {
            "#BolMaiWri": "2. Bolzano’s Main Writings"
        },
        {
            "#Log": "3. Logic"
        },
        {
            "#BolConceptLog": "3.1 Bolzano’s Concept of Logic"
        },
        {
            "#BolConceptionLog": "3.2 Bolzano’s Conception of Logic"
        },
        {
            "#BasBolLogHisWho": "3.3 The Basis of Bolzano’s Logic and of his Whole Philosophy"
        },
        {
            "#BolAnaProIeHisSenThe": "3.4 Bolzano’s Analysis of Propositions (i.e., of his “Sentences in Themselves”)"
        },
        {
            "#BolTheIdeIeHisIdeThe": "3.5 Bolzano’s Theory of Ideas (i.e., of his “Ideas in Themselves”)"
        },
        {
            "#BolMetIdeVar": "3.6 Bolzano’s Method of Idea-Variation"
        },
        {
            "#BolDefLogTru": "3.7 Bolzano’s Definition of Logical Truth"
        },
        {
            "#BolDefMatConLogCon": "3.8 Bolzano’s Definition of Material Consequence and of Logical Consequence"
        },
        {
            "#FurAppMetIdeVar": "3.9 Further Applications of the Method of Idea-Variation"
        },
        {
            "#EpiSci": "4. Epistemology and Philosophy of Science"
        },
        {
            "#AppProIdeHumMin": "4.1 “Appearances” of Propositions and Ideas in Human Minds"
        },
        {
            "#SubIntSubCon": "4.2 Subjective Intuitions and Subjective Concepts"
        },
        {
            "#JudPriPos": "4.3 Judgments A Priori and A Posteriori"
        },
        {
            "#ImmMedJud": "4.4 Immediate and Mediated Judgments"
        },
        {
            "#EntRel": "4.5 The Entailment Relation"
        },
        {
            "#Eth": "5. Ethics"
        },
        {
            "#CriKanCatImp": "5.1 Critique of Kant’s Categorical Imperative"
        },
        {
            "#BolSupMorLaw": "5.2 Bolzano’s Supreme Moral Law"
        },
        {
            "#BolEthMixNorThe": "5.3 Bolzano’s Ethics as a “Mixed” Normative Theory"
        },
        {
            "#BolDeoLog": "5.4 Bolzano’s Deontic Logic"
        },
        {
            "#Aes": "6. Aesthetics"
        },
        {
            "#PolSoc": "7. Political and Social Philosophy"
        },
        {
            "#RelThe": "8. Philosophy of Religion and Theology"
        },
        {
            "#Met": "9. Metaphysics"
        },
        {
            "#NatPhy": "10. Philosophy of Nature and of Physics"
        },
        {
            "#Mat": "11. Philosophy of Mathematics"
        },
        {
            "#EarMatWor": "11.1 Early mathematical works"
        },
        {
            "#PreWriSetThe": "11.2 Preparatory Writings in Set Theory"
        },
        {
            "#NewFouMat": "11.3 New Foundations of Mathematics"
        },
        {
            "#MetHis": "12. Metaphilosophy and History of Philosophy"
        },
        {
            "#SoCalBolCirBolInfIntHis": "13. The So-called Bolzano Circle and Bolzano’s Influence on Intellectual History"
        },
        {
            "#SoCalBolCir": "13.1 The So-called Bolzano Circle"
        },
        {
            "#BolInfIntHis": "13.2 Bolzano’s Influence on Intellectual History"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#BolWri": "Bolzano’s Writings"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Bolzano’s Life and Scientific Career\n\nBernard Bolzano was born on 5 October 1781 in Prague. His father came\nfrom Lombardy (hence the Italian surname), though he lived already\nfrom childhood in Bohemia; by profession he was a merchant.\nBolzano’s mother came from the German speaking family Maurer in\nPrague. Bernard was the fourth of twelve children altogether, most of\nwhom died young.\n\nWhen he was ten years old, Bolzano entered the Gymnasium\n(i.e., a kind of classical secondary school) of the Piarists in\nPrague, which he attended from 1791 to 1796. He subsequently began his\n“philosophical studies” at the University of Prague; they\nlasted three years, roughly corresponding to the higher level of high\nschools. Included in the “philosophical studies”, besides\nphilosophy itself, were subjects such as history, languages, and\nbiology, but above all also mathematics and physics. In the autumn of\n1800 Bolzano began his study of theology at the University of Prague.\nAt that time such a course of studies lasted four years; he finished\nit in the summer of 1804. \n\nBolzano got ordained as Roman Catholic priest on 7 April 1805. A few\ndays later, on 17 April 1805, he received his doctorate of philosophy\nat the University of Prague. Just two days later, on 19 April 1805, he\ntook up the newly established chair for religious doctrine in the\nPhilosophical Faculty at the University of Prague, which had been\ngranted to him provisionally by the Austrian Emperor, Kaiser Franz\n(Francis I), on 13 February 1805. The definitive occupancy of this\nchair was followed by his appointment as professor ordinarius\non 23 September 1806. \n\nAccording to a decree of 3 February 1804, the chairs for religious\ndoctrine were established for the sake of “improving religious\ninstruction”. Connected with these professorships was the\nimportant assignment to deliver the Sunday homilies, also called\n‘exhortations’ or ‘Erbauungsreden’\n(‘edifying addresses’), to the students (Bolzano\ngave them voluntarily also on holidays); the effectiveness of these\nchairs (whose occupants were therefore also called\n‘catechists’ — cf. Bolzano 1836, 31) was thereby\nessentially enhanced.\n\nBolzano’s liberal intellectuality and his progressive\ntheological and political ideas, combined with his practical\nactivities and his enormous influence as a priest and as a university\nprofessor on people in general and the opinion leaders in Bohemia in\nparticular, were a highly explosive mixture in the political and\nreligious atmosphere in which Bolzano lived. Bohemia and its capital\nPrague were at his time part of the Austrian empire. Due to Prince\nKlemens Metternich, a very illiberal and repressive political system\nwas established in the Austrian empire by means of police force and\ncensorship. All kinds of liberal and national movements were\nsuppressed in this political system. No wonder that Bolzano’s\nprogressive political ideas and activities were found to be\nunacceptable to the political authorities. This situation in\ncombination with personal intrigues resulted in January of 1820 in\nBolzano’s removal from his professorship by Emperor Franz (who\nsigned personally all decrees of appointment and dismissals of\nprofessors of all the universities in the empire). From that time on\nBolzano was forbidden to teach, preach, or publish, and he had to\nsustain himself on a meager pension that was “graciously\ngranted” to him by the emperor. It came as a blessing in\ndisguise that Bolzano now — “exempted” from teaching\nduties —  had all the time he needed to elaborate and write\nhis new foundation of logic. It was published in 1837 in four volumes\nas Theory of Science. After that, Bolzano took great pains to\nelaborate a new foundation of mathematics. The realization of this\nproject was considerably developed but not yet completed when Bolzano\ndied in 1848.\n\nSmall pieces of his voluminous philosophical and mathematical literary\nremains have been published from time to time. The complete edition of\nhis works that was planned several times had to wait until 1969 when\nthe two most meritorious Bolzano scholars, Eduard Winter and Jan Berg,\ntogether with the publisher Günther Holzboog started the\nBernard-Bolzano-Gesamtausgabe, which — due to the\neffort of the three persons — became one of the most\ndistinguished complete editions of the works of a philosopher in our\ntime. 99 volumes of the edition have already appeared, and the next\nvolumes are forthcoming.\n2. Bolzano’s Main Writings\n\nBolzano’s uncommonly versatile work culminated in three\nextensive main writings in three different areas of knowledge: (1) in\ntheology his four volume Textbook of the Science of\nReligion (Bolzano 1834), (2) in philosophy the four\nvolume Theory of Science (Bolzano 1837), which provides a new\nfoundation for logic and is at the same time an extensive manual of\nlogic, and (3) in mathematics the Theory of\nQuantities, conceived of as a monumental work, but not\ncompleted.\n\nBolzano’s teaching was concerned exclusively with fundamental\ntopics of theology; in addition he worked mainly in logic.\nNevertheless, his scientific development began in\nmathematics. Already in 1804 Bolzano’s first scientific\npublication, namely Considerations on Some Objects of Elementary\nGeometry appeared; further mathematical publications followed\nbetween 1810 and 1817. Bolzano returned ultimately to mathematics in\norder to create a new foundation on which mathematics as a whole could\nbe built; he succeeded in doing this, however, only in bits and\npieces. \n3. Logic\n\nDue to the affinity of many ideas of Bolzano’s logic with ideas\nof modern logic, attempts to reconstruct Bolzano’s logic by\nmeans of techniques of modern logic started very early, e.g., with\nDubislav 1931 and Scholz 1937. The first overall reconstruction of\nBolzano’s logic from the perspective of modern logic was given\nby Berg 1962, and Berg went into it further in his illuminating\nintroductions to WL in BGA I, 11–14. A new overall survey of\nBolzano’s logic was presented in Sebestik 1992, and the most\nrecent one is Casari 2016.\n3.1 Bolzano’s Concept of Logic\n\nThe term ‘logic’ was understood in Bolzano’s time,\nas also by Bolzano himself, not in the narrow sense of formal logic,\nas it is commonly used nowadays, but rather in the broad sense which\nincludes — besides formal logic — also both epistemology\nand the philosophy of science. Thus Bolzano used instead of\n‘logic’ also the term ‘theory of science’. By\n‘logic’ or ‘theory of science’ Bolzano means\nthat discipline or science which formulates rules, “according to\nwhich we must proceed in the business of dividing the entire realm of\ntruth into single sciences and in the exposition thereof in special\ntextbooks if we want to proceed in a truly expedient fashion”\n(WL I, 7; cf. also WL I, 19 and 56).\n\nThis definition of logic makes a strange impression at first glance\nand was also often misunderstood. By putting it forward, Bolzano\nascribes to logic a task that is generally not included in philosophy\nat all, but rather in the technique of scientific procedure. Bolzano,\nhowever, considered this task to be important enough to subject it to\na scientific treatment. Since he did not see how it could otherwise be\nbrought within the purview of a science, he assigned this task to\nlogic which seemed to him to be the best candidate for this. What\nBolzano mentions in his definition is, in his own view, by no means\nthe only task of logic. In order to avoid superfluous criteria,\nBolzano stated only the most concrete purpose in his definition, for\nthe other tasks are entailed by it. Bolzano’s logic is a\ncomposite of the theory of foundations, the theory of\nelements, the theory of knowledge, the art of\ndiscovery (heuristics), and the theory of science\nproper. Thus, logic is, for Bolzano, an encompassing\nphilosophical discipline, and the “theory of science\nproper” is only a sort of appendix of his logic.\n3.2 Bolzano’s Conception of Logic\n\nBolzano’s logic was based upon a fundamental view that was the\nvery opposite of the common view of his time. Whereas it was quite\ncommon at his time to mix logical with psychological investigations,\nBolzano made every effort to separate them. For him logical concepts\nare concepts of their own, and their definition therefore must be kept\nfree from any psychological admixture (WL I, 61–66).\nBolzano’s approach to logic was — long before Frege and\nHusserl — unmistakably antipsychologistic, even if he did not\nyet use this term. In order to overcome psychologism and to achieve a\nstrict separation of logic from psychology, Bolzano “opened\nup” for logic a realm or “world” of its own,\ndifferent from the world of material objects as well as from the world\nof mental phenomena, a World 3 to speak with Karl Popper.\nBolzano’s motive for postulating such a logical realm of its own\nobviously was the erroneous belief that logical properties (such as\nlogical truth) and logical relations (such as logical consequence)\nneed purely logical objects as their bearers in order to remain purely\nlogical and free from any psychological admixture themselves. What is\nmore, Bolzano had an unshakeable intuition that there are and must\nbe such purely logical objects, namely “objective\nsentences” or “sentences in themselves”\n(Sätze an sich), and their parts, i.e., “objective\nideas” or “ideas in themselves” (Vorstellungen\nan sich). In today’s terminology, Bolzano’s\n“sentences in themselves” are called\n‘propositions’; this term (without any epithet) will be\nused for them in what follows. (The term ‘sentence’\nwithout epithet, however, will be used in its linguistic sense for\ncertain strings of words or symbols.) Moreover, following\nBolzano’s practice, we will use the term ‘idea’\n(‘Vorstellung’) without epithet for ‘idea\nin itself’ (‘Vorstellung an sich’).\nPropositions and ideas are the objects which can be\n“grasped” by mental phenomena (subjective propositions, in\nparticular judgments, and subjective ideas) and expressed in language,\nbut — despite their close connection to their mental and\nlinguistic correlates — they must be rigorously distinguished\nfrom them.\n\nDue to his conception of logic, Bolzano was “in need” of\npropositions and ideas and therefore postulated that there are such\ngenuinely logical objects. He himself, however, was convinced that he\nneed not postulate them but can undoubtedly prove that there\nmust be propositions and ideas.\n3.3 The Basis of Bolzano’s Logic and of his Whole Philosophy\n\nSomething could be true even if nobody knew that it were so. We\ntherefore need a concept of truth that does not require of every truth\nthat someone knows it. For this concept Bolzano introduced the term\n‘Wahrheit an sich’ (‘truth in\nitself’). If something is a truth and no human being knows\nthat it is, then — for Bolzano — it must be a “truth\nin itself”. A “truth in itself” (Wahrheit an\nsich) is nothing but a true proposition, i.e., a proposition that\nhas the property of being true. Bolzano takes the proof that there is\nat least one “truth in itself” to be fundamental not only\nfor logic and for philosophy in general, but for any science. Bolzano\noffers therefore several arguments such as the following ones for the\nclaim that there must be “truths in themselves”: (i) There\nare obviously truths that are unknown and therefore (so Bolzano)\n“truths in themselves”. E.g. one of the two propositions\n“There are winged snakes” or “There are no winged\nsnakes” must be true, but we do not know which one (WL I, 108);\nand one of the propositions stating of a specific tree at a specific\nmoment that it bears a certain number of blossoms must be true, even\nif nobody knows which one (WL I, 112). (ii) The Pythagorean theorem or\nthe Copernican theory that the earth rotates around the sun have not\nbecome true by their discoveries but have always been true, i.e.\n(according to Bolzano), they are “truths in themselves”\n(Zimmermann 1847, 71 f., 136). (iii) If no thinking being existed, it\nwere true that there exists no thinking being, but this (according to\nBolzano) could only be a “truth in itself” (Bolzano 1839,\n150). There is one proof for the existence of a “truth in\nitself” or a true proposition, however, which Bolzano takes to\nbe decisive. It is an improved version of the traditional refutation\nof scepticism by self-application (RW I, 35, WL I, 145). Before we\npresent and discuss this proof, a terminological remark seems to be in\norder: The word ‘truth’ (as well as the German word\n‘Wahrheit’) is ambiguous insofar as it denotes the\nproperty of being true on the one hand and a bearer of this property\n(a true proposition, a true sentence, a true judgment etc.) on the\nother hand (WL I, 108 f.). Only the latter can be meant, however, as\nsoon as the word ‘truth’ is preceded by the indefinite\narticle (‘a truth’) or if it is put into the plural form\n(‘truths’). It is in such clear cases only that we will\nallow the word ‘truth(s)’ without epithet to be used in\nthe sense of Bolzano’s ‘truth in itself’ or\n‘truths in themselves’, but otherwise we will use\n‘true proposition(s)’ instead to avoid confusion. In\ngeneral we will therefore reserve the word ‘truth’ for the\nproperty of being true. That being said, we can now turn to\nBolzano’s alleged proof for the existence of true\npropositions:\n\nThere is no true proposition (assumption of reductio),\ni.e.: No proposition is true.\nThe sense of (1), i.e., of ‘There is no true\nproposition’, is a proposition.\nThe proposition which is the sense of (1) is not true (from (1)\nand (2)).\nIt is not the case that there is no true proposition (from (3) and\n(1) — in contradiction to (1)).\nThere is a (i.e., at least one) true proposition (from\n(1)–(4) by reductio).\n\n\nThe improvement of Bolzano’s version of this traditional proof\nconsists in Bolzano’s explicitly mentioning premise (2) as\nindispensable for the deduction (WL I, 145, 151; cf. also WL IV, 282\nf.), thus making clear that the proof would not go through if this\npremise were not accepted. The inference of (4) from (3) and (1) is\nvindicated by Bolzano’s explication of propositional negation\n(see section 3.4). Bolzano is not content with having proven\n(allegedly) that there is at least one true proposition; he wants even\nto prove by mathematical induction that there are more and even\ninfinitely many true propositions (see section 11.2).\n\nThe above derivation is an illustrative example of Bolzano’s\nimportation of proof methods from mathematics — such as the\nmethods of indirect proof and of mathematical induction — into\nphilosophy. (For certain reservations concerning these methods cf. WL\nIV, 269–285.) Nevertheless, this alleged proof for the existence\nof a true proposition does not reach its goal for a simple reason: The\nproof is in no way peculiar for truths in the sense of true\npropositions as Bolzano needs to have it. If successful at\nall, it would work in the same way also for proving the existence of\ntrue judgments or true sentences (understood as linguistic entities).\nA proof for the existence of at least one truth in itself,\ni.e., a true proposition, requires premise (2). In premise\n(2), however, the existence of a proposition is already presupposed\nsince it is shorthand for what can be explicitly stated as: There is a\n(i.e., at least one) proposition which is the sense of (1). Thus, if\nwe take the derivation as a proof for the existence of at least one\ntrue proposition, we will succumb to an obvious petitio\nprincipii. By — correctly — requiring the addition of\npremise (2) to be necessary for the formal correctness of the proof,\nBolzano unwittingly displayed its failure due to an informal fallacy.\nBolzano himself, however, was convinced that he had correctly and\nsuccessfully proven that there are “truths in\nthemselves”. From this it follows that there must be\npropositions, since “truths in themselves” are a certain\nkind of propositions (WL I, 111 f.). And since in every proposition\nideas are contained as its parts, a further consequence is that there\nare also ideas. For every proposition there is also another\nproposition that is its propositional negation. The propositional\nnegation of a true proposition is a false proposition. Therefore,\namong propositions there must also be false ones. They are often\noverlooked because a special name such as ‘falsehood in\nitself’ was never introduced “officially” for them\nand is at least not customary.\n\nAs far as the ontological status of propositions and ideas is\nconcerned, Bolzano stresses again and again their objectivity, i.e.,\ntheir independence from thinking in general and from the minds and\nmental phenomena of thinking beings by which they are\n“grasped” in particular. Bolzano does not only accentuate\nthe objectivity of propositions and ideas, but he also lays particular\nemphasis on their being not real (wirklich), whereby\n‘real’ means, in Bolzano’s terminology, the same as\nefficacious (wirksam, which derives etymologically from the\nverb ‘wirken’ from which also ‘wirklich’ is\nderived). The realm of reality includes everything in space and time\nand herewith all material objects and events of the physical world\n(i.e., Popper’s World 1) as well as all mental (or\n“psychical”) phenomena of our inner world (i.e., World 2).\n(In addition, Bolzano includes in his realm of reality also God who is\noutside of space and time.) Propositions and ideas belong to a\n“third realm” (World 3) outside of Bolzano’s realm\nof reality which encompasses World 1 and World 2. Unfortunately,\nBolzano uses the nouns ‘Existenz’\n(‘existence’) and ‘Sein’\n(‘being’) synonymously with\n‘Wirklichkeit’ (‘reality’);\nhe therefore states again and again that there are (es\ngibt) propositions and ideas but they do not exist and\nthey do not have being. This peculiar — if not odd\n— terminology has caused numerous misunderstandings, not only\nabout Bolzano’s views but also for Bolzano himself,\ne.g., in his discussion about Kant’s dictum that being\nis not a real predicate. (Despite Bolzano’s terminological\nconvention, we will here use the English word ‘existence’\nin general in the broad sense of Bolzano’s ‘es\ngibt’.)\n\nIt is not only for this terminological reason that Bolzano’s\ncharacterization of the ontological status of propositions and ideas\nremains in the last analysis nebulous and has therefore repeatedly\nevoked criticism. One must of course add, for the sake of doing\njustice to Bolzano, that no other advocate of such a World 3 —\nincluding Husserl, Popper and even Frege — has done better than\nhe had done and has succeeded in saying anything clearer about this\nthan what can already be found in Bolzano’s work. Despite all\nthese deficiencies, Bolzano’s unproven assumption or postulation\nof propositions and ideas turned out to be extremely fruitful for his\nown research.\n3.4 Bolzano’s Analysis of Propositions (i.e., of his “Sentences in Themselves”)\n\nAlthough Bolzano contributed many highly interesting and valuable\ninsights to the analysis of propositions, they all are shaped in the\nsubject-predicate scheme. We must explain some of these insights\nbefore we discuss Bolzano’s main contributions to logic in the\nsections 3.6–3.9.\n\nIn what follows brackets will be used for the denotation of\npropositions and ideas. Thus ‘[Socrates has wisdom]’ will\ndenote the proposition expressed by the words ‘Socrates has\nwisdom’, and ‘[Socrates]’ and ‘[wisdom]’\nwill denote the ideas expressed by the words ‘Socrates’\nand ‘wisdom’, respectively. (Such a notation is not\nwithout problems, but this is not the place to discuss them.) Bolzano\nstarts his analysis of propositions by proclaiming the traditional\nsubject-predicate view as a dogma: Despite the variety of their\nlinguistic expressions, all propositions are of the form \\([A\\) has\n\\(b]\\) and therefore have exactly three parts, namely a subject idea\n\\([A]\\), a predicate idea \\([b]\\), and the copula [has], i.e. the idea\nexpressed by the word ‘has’ or another form of ‘to\nhave’ (WL II, 9–17). Bolzano prefers this copula to the\ncopula expressed by a form of ‘to be’ for the following\nreason: In everyday language we try to avoid abstracts such as\n‘wisdom’ and prefer saying ‘Socrates is wise’;\nbut in doing so we attribute a property — namely wisdom —\nto Socrates. The logical structure of the proposition is therefore\nbest displayed — says Bolzano — by the words\n‘Socrates has wisdom’. Due to the stylistic preference of\nadjectives over abstract nouns, everyday language very often does not\neven provide us with an abstract noun corresponding to an adjective;\nin such cases we therefore use the adjective at hand, although we\ncould always easily introduce a corresponding artificial noun into our\nlanguage.\n\nSince every proposition has the same copula, two propositions can be\ndifferent only if they have either different subject ideas or\ndifferent predicate ideas or both. This results in Bolzano’s\nidentity criterion for propositions: Two propositions \\([A_1\\) has\n\\(b_1]\\) and \\([A_2\\) has \\(b_2]\\) are identical iff (i.e., if and\nonly if) \\([A_1] = [A_2]\\) and \\([b_1] = [b_2]\\). In order for \\([A\\)\nhas \\(b]\\) to be a proposition, it will suffice that the\npredicate idea \\([b]\\) be an arbitrary idea, in a way at least\n“pretending” to be an idea of an attribute (WL II,\n16–18). In order for \\([A\\) has \\(b]\\) to be true,\nhowever, it is necessary that the predicate idea \\([b]\\) is an idea of\nan attribute (Beschaffenheit). An attribute can be\nan “inner attribute”, i.e., a property\n(Eigenschaft) of an object, or an “outer\nattribute”, i.e., a relation (Verhältnis)\namong objects. Examples of properties are wisdom or omnipotence,\nexamples of relations are friendship to so-and-so, fatherhood to\nso-and-so, being twice as long as such-and-such (WL I,\n378–389).\n\nThe main trouble resulting from the traditional subject-predicate view\nin general and from Bolzano’s uniform \\([A\\) has \\(b]\\)\nstructure of every proposition is that under its subject idea \\([A]\\)\ntwo different cases are concealed insofar as it can be singular (as in\nthe case of [God] or [the sun] or [Bernard Bolzano]) or general (as in\nthe case of [man] or [animal] or [planet]). Due to this duality,\nBolzano has to add that \\([A\\) has \\(b]\\) or \\([A\\) have \\(b]\\) is to\nbe understood (when \\([A]\\) is general) in the sense of\n[Every \\(A\\) has \\(b]\\) or [All \\(A\\) have \\(b]\\),\ne.g. [Animals have sensitivity] = [Every animal has\nsensitivity] = [All animals have sensitivity] (WL II, 24\nf.).\n\nIn order to confirm his thesis that every proposition has the form\n[(Every) \\(A\\) has \\(b]\\), Bolzano shows of all kinds of verbal forms\nof significant sentences how to transfer them into his standard form\n(cf. WL II, 38 ff. and 211 ff.). Here are some of the rather important\nexamples of Bolzano’s analysis.\n\nPredicate negation (i.e., “inner” negation):\nThe lack of an attribute \\(b\\) (such as the lack of omnipotence) is\nitself a property (WL II, 47) that we can denote by the negation\n‘non-\\(b\\)’ (‘non-omnipotence’). Negative\npropositions of the form \\([A\\) has non-\\(b]\\), e.g. [Bernard Bolzano\nhas non-omnipotence (i.e., lack of omnipotence)], therefore share the\ngeneral form \\([A\\) has \\(b]\\) with all other propositions (WL II,\n44–52).\nPropositional negation (i.e., “external”\nnegation): From propositions of the form \\([A\\) has non-\\(b]\\) we have\nto distinguish propositions in which another proposition is denied. We\ncan express such propositions by ‘It is not the case that \\(A\\)\nhas \\(b\\)’. According to Bolzano, such a proposition is about\nanother proposition and states that this proposition is false, i.e.,\nnot true. Its subject idea is therefore an idea of a proposition and\nits predicate idea is the idea of falsity or lack of truth, i.e.,\nnon-truth. Their form is therefore best displayed as [\\([A\\) has\n\\(b]\\) has non-truth] (WL II 62–64).\nSubjunctive and disjunctive propositions: The subjunction\nof two propositions \\(s_1\\) and \\(s_2\\) is explained by Bolzano as a\nproposition of the form \\([s_2\\) is a consequence of \\(s_1]\\) (WL II,\n198 f., 224–226; Bolzano proposes here also alternative\ninterpretations of ‘if … so’ sentences). An\ninclusive or exclusive disjunction of two propositions \\(s_1\\) and\n\\(s_2\\) is interpreted by Bolzano as a proposition which attributes to\nthe idea [a true proposition belonging to the collection consisting of\n\\(s_1\\) and \\(s_2]\\) the property of being non-empty or singular,\nrespectively (WL II, 204 f., 228 f.).\nParticular propositions and there-is propositions: In\nview of Bolzano’s identification of \\([A\\) has \\(b]\\) with\n[Every \\(A\\) has \\(b]\\) or [All \\(A\\) have \\(b]\\)\nwhenever \\([A]\\) is general, it is of special interest how he deals\nwith particular propositions expressed by ‘Some A have\n\\(b\\)’. Bolzano transforms such sentences into there-is\nsentences of the form ‘There is at least one \\(A\\) that has\n\\(b\\)’. But what about such there-is sentences? In a sentence of\nthe form ‘There is at least one \\(A\\)’ we attribute,\naccording to Bolzano, not a property to \\(A\\) itself but to the idea\n\\([A]\\), i.e., to the idea of \\(A\\), namely the property of being\nnon-empty. The form of the corresponding propositions is therefore\nbest given as [\\([A]\\) has non-emptiness] (WL II, 52–54,\n214–218). This analysis is completely in accordance with\nKant’s — and of course even more so with Frege’s and\nRussell’s later on —, although Bolzano never stopped\ncriticizing Kant for his dictum that existence is not a real\npredicate. Bolzano took this dictum to be about existence in\nhis own narrow sense of ‘existence’ or\n‘being’, i.e., in the sense of ‘reality’, and\nnot — as he should have — in the broad sense of his\n‘es gibt’. His disagreement with Kant on this\npoint is therefore merely verbal in nature. For Bolzano’s\napproach, a true negative existential sentence such as ‘There is\nno round square’ does not pose a problem any more; the\nproposition expressed by this sentence is [[a round square] has\nemptiness] (WL II, 54 f.).\n\n\nIn his analysis of propositions Bolzano distinguished clearly\ndifferent levels in his realm of propositions and ideas. He even\nintroduced a special name for ideas of ideas, such as the idea of the\nidea \\([A]\\), i.e., [\\([A]\\)]; he called them ‘symbolic\nideas’ (WL I, 426 ff.). In his efforts to show that all\npropositions can be shaped into \\([A\\) has \\(b]\\), Bolzano makes\nextensive usage of such symbolic ideas (and also of ideas of\npropositions) as subject ideas of propositions, as it is exemplified\nunder ii, iii and iv above. Bolzano took pains to systematize his\nattempts of shaping all propositions into \\([A\\) has \\(b]\\). His\nattempts, however, remained only on the level of examples, since he\nmissed a key for their systematization such as Frege’s\nfunction-argument scheme.\n\nFor Bolzano every proposition is either true or false, and this\nforever — or better: timelessly. If we get under certain\ncircumstances the impression that one and the same proposition can\nsometimes be true and sometimes be false, this is merely due to the\nfact that we do not talk about a proposition but about an ambiguous\nlinguistic chain of words that expresses two or even more\npropositions, some of which can be true and others false (WL II, 7).\nIf it is the proposition itself, however, of which we get the\nimpression that it can be true as well as false, this is due to the\nfact that we take a part of it to be variable (WL II, 77); in this\ncase again we do not consider a single proposition, but a whole set of\npropositions, i.e., a propositional form. In the expression ‘It\nis snowing’, e.g., time and place are not determined, and it\ntherefore does not express a proposition, but rather a propositional\nform, indicated by ‘It is snowing at time \\(t\\) at place\n\\(l\\)’. In order to express a proposition, the variables have to\nbe bound or replaced by constants; Bolzano usually replaces them\n— for convenience — by indexicals, e.g., ‘It is\nsnowing today and here’ (WL I, 113). Even if Bolzano makes\nextensive usage of indexicals in the expression of ideas and\npropositions, there is no place for indexicals within his World 3:\nThere are neither indexical ideas nor indexical propositions; what\nsometimes seems to be an indexical idea or proposition is in fact\nmerely an indexical expression of an idea or proposition.\n(See, however, an opposite view defended in Textor 1996.)\n\nBolzano combines his doctrine that the form \\([A\\) has \\(b]\\) is\ncommon to all propositions with a correspondence theory of truth,\nwhereby he, like Aristotle, avoids speaking of correspondence or\nadequation. A proposition \\([A\\) has \\(b]\\) is true, according to\nBolzano, iff \\(A\\) has (in fact) \\(b\\) (WL I, 112). There is an\nimportant qualification, however, that Bolzano has thereby in mind,\nnamely that there is at least one \\(A\\); a proposition \\([A\\) has\n\\(b]\\) can only be true, according to Bolzano, if it is about\nsomething and if its subject idea \\([A]\\) is therefore non-empty (WL\nII, 16, 328–330, 399 ff.). Formulated more carefully,\nBolzano’s truth condition must therefore be stated as follows\n(WL I, 112, 121–224, WL II, 26 f., 328–330):\n\n\\([A\\) has \\(b]\\) is true (or: has truth) iff \\([A]\\) is\nnon-empty, and for every \\(x\\) that is an object of \\([A]\\) there is a\n\\(y\\) that is an object of \\([b]\\) such that \\(x\\) has \\(y\\).\n\n\nDue to this definition of truth and due to Bolzano’s doctrine\nthat every proposition has the form \\([A\\) has \\(b]\\), every\nproposition has existential import for Bolzano.\n(‘Existential’ must here be taken in the sense of\nBolzano’s ‘there is’. It must be kept in mind here\nthat Bolzano’s interpretation transfers many propositions to a\nmeta-level and that in such a case the existential import concerns\n\\([A]\\) rather than \\(A\\) itself; the existence of \\([A]\\), however,\nis guaranteed even if \\([A]\\) is empty and \\(A\\) itself does not\nexist.) This peculiar kind of an existential presupposition of\nBolzano’s logic makes his theory of syllogisms (which he himself\nsaw as a mere section of his whole logic) an intermediate system\nbetween Aristotle and Venn: Whereas Aristotle’s theory of\ncategorical syllogisms does not allow empty terms at all,\nBolzano’s logic does so, but they cannot be the subject ideas of\ntrue propositions in Bolzano’s logic. As a consequence, the\nso-called conclusio ad subalternatam is logically valid also\nfor Bolzano, i.e., [Some \\(A\\) have \\(b]\\) follows logically from [All\n\\(A\\) have \\(b]\\) (WL II, 114, 399 ff.), but [All \\(A\\) are \\(A]\\) or\n— in Bolzano’s notation — [All \\(A\\) have \\(a]\\) is\nnot logically true for him; furthermore [All \\(A\\) have non-\\(b]\\) is\nnot convertible, i.e., [All \\(B\\) have non-\\(a]\\) does not logically\nfollow from [All \\(A\\) have non-\\(b]\\) (WL II, 401 f., 526). Therefore\nexactly two of the 24 valid Aristotelian syllogisms (namely the\nmodi CAMENES — or CALENTES in Bolzano’s\nterminology — and CAMENOP of form IV) are invalid in\nBolzano’s logic as he himself proved by means of\ncounter-examples (WL II, 415, 558), whereas all other Aristotelian\nmodi (including the weakened ones) are logically valid also\nin Bolzano’s logic.\n3.5 Bolzano’s Theory of Ideas (i.e., of his “Ideas in Themselves”)\n\nThe three immediate parts of a proposition are its subject idea, its\npredicate idea and the copula [has]. In further analyzing the subject\nand predicate idea of a proposition, we will find out, that in special\ncases (as, e.g., in the case of the idea [the judgment that God is\nomnipotent]), a complete proposition will turn out to be a part of an\nidea  (WL I, 221). In general, however, the parts of an idea are\nthemselves ideas. After careful consideration Bolzano decided against\nthe view to define a proposition as something constructed out of ideas\n(i.e., as a connection of two arbitrary ideas by means of the copula\n[has]) (WL II, 18); he rather suggested that we define ideas as those\nparts of a proposition which are not themselves propositions (WL I,\n216, WL II, 18). In this sense he granted priority to propositions\nover their non-propositional parts (i.e., ideas), thereby anticipating\nFrege and Wittgenstein. There is a clear demarcation between\npropositions and ideas: Whereas each proposition is either true or\nfalse (WL II, 7), an idea cannot be true or false (WL I, 239 ff.).\nThere are two “dimensions” to be distinguished in each\nidea: its “internal dimension”, i.e., its divisibility or\nindivisibility into parts, and its “external\ndimension”, i.e., its having or not having objects.\n\nAs far as the inner structure of ideas is concerned (WL I,\n243 ff.), Bolzano distinguishes simple from complex ideas: A\nsimple idea has no proper parts, whereas a complex\nidea has. The “sum” (Summe) of proper parts of a\ncomplex idea is called its ‘content’\n(‘Inhalt’). Due to Bolzano’s peculiar usage\nof the term ‘sum’ that is restricted — like his\nusage of ‘collection’ in general — to sets with at\nleast two members, he could not apply his concept of content to all\nideas, but only to complex ideas. In order to simplify matters, we\nwill use here the modern concept of a set, allowing for a set to be a\nsingleton (i.e., containing only one single member) or even to be\nempty (i.e., containing no member at all). In what follows we will\ntherefore take the content of an arbitrary idea to be the\nset of all of its parts (including improper ones, i.e.,\nincluding itself). The content of a simple idea \\(i\\) is then the\nsingleton \\(\\{i\\}\\) containing \\(i\\) itself as its only member. Two\ncomplex ideas \\(i_1\\) and \\(i_2\\) can have the same content, i.e., the\nsame parts, without themselves being identical, because the common\nparts of \\(i_1\\) and \\(i_2\\) can be arranged in different ways in\n\\(i_1\\) and \\(i_2\\). Bolzano’s favorite example is: [an erudite\nson of an unerudite father] has the same content, but is not identical\nwith [an unerudite son of an erudite father]; the same holds for\n\\([3^5]\\) and \\([5^3]\\) (WL I, 244). In analyzing an idea, we will in\nall cases eventually come upon simple ideas (WL I, 263–265).\nWithout explicitly expressing it, Bolzano obviously held the view that\nevery idea is recursively constructed out of simple ideas. Two ideas\nare therefore identical iff they are constructed out of the same\nsimple ideas in the same way. In order to be able to apply this\ngeneral idea precisely in concrete cases, we would have to be able to\nidentify the simple ideas and the formation rules involved.\nUnfortunately, Bolzano informs us about both only by hinting at\nexamples here and there. As examples of simple ideas he mentions\n[something] (WL I, 447), [has] (WL I, 380, WL II, 18), [non] (WL II,\n415), [Wirklichkeit], i.e., [reality] (WL II, 60), and\n[Sollen], i.e., [ought] (WL II, 69, WL IV, 489).\n\nWith respect to its “external” dimension, an idea\ncan have several (may be even infinitely many) objects, exactly one\nobject, or no object at all. An idea that has no object at all is an\nempty idea; Bolzano calls it\n‘gegenstandlos’ (‘objectless’).\nBolzano puts forward the thesis with particular emphasis that there\nare empty ideas; his standard examples are ideas such as [nothing],\n[golden mountain] (WL I, 304 f., WL II, 329) or [winged horse] (WL\nIII, 24). A special kind of empty ideas, viz. contradictory\nideas (or, as Bolzano usually prefers to call them, imaginary\nideas) cannot even have an object (WL I, 315 ff., WL III, 405\nf.), examples being [a round polygon], [a round square], [a triangle\nthat is quadrangular], [a regular pentagon], [a wooden iron tool], [an\nequilateral rectangular triangle] (WL I, 305, 315, 317, 321, 324, WL\nII, 329). Non-empty ideas are called\n‘gegenständlich’ (‘objectual’)\nby Bolzano. They can be singular as, e.g., [the philosopher\nSocrates], [the city of Athens], [the fixed star Sirius] (WL I, 306),\n[an even integer between 4 and 8] (WL III, 407), [God] (WL III, 408),\nor general; if general, they can have a finite number of\nobjects, such as [a heir of Genghis-Khan’s Empire] (WL I, 299)\nor [an integer between 1 and 10] (WL I, 308), or an infinite number of\nobjects, such as [a line] or [an angle] (WL I, 298). For non-empty\nideas (and only for them) Bolzano defines their extension\n(Umfang) (WL I, 297 f.); by using again the modern concept of\na set (as we already did with Bolzano’s definition of the\ncontent of an idea), we can extend his definition to all ideas\nincluding empty ones; the extension of an arbitrary idea \\(i\\) (or\nExt\\((i)\\), as an abbreviation) is then nothing but the set\nof all objects of \\(i\\).\n\nBy crossing the “internal” with the “external\ndimension” of ideas we can get new and interesting\n“creations”. Combining, e.g., the smallest content with\nthe smallest extension of a non-empty idea results in a new type of\nidea, viz. in an “intuition in itself” or, as we may say\nfor the sake of brevity, an intuition (Anschauung).\nAn intuition is an idea which is simple, i.e., has no proper\npart, and at the same time singular, i.e., has only one single object\n(WL I, 325–330). If an idea is neither itself an intuition nor\ncontains any intuition as a proper part, it is called\n‘Begriff’ (‘concept’) by\nBolzano; examples of concepts are the simple idea [something] and the\ncomplex idea [God] whereby, for Bolzano, [God] = [the real being that\nhas no cause of its being real]. A mixed idea is a complex\nidea which contains at least one intuition as a proper part (WL I, 330\nf.). The distinction between intuitions and concepts plays an\nimportant role in Bolzano’s epistemology (cf. section 4.2 where\nwe will also present examples of intuitions).\n\nTalking about the “external dimension” of ideas, we made\n— following Bolzano — intensive usage of a certain\nrelation \\(\\mathbf{R}\\) between ideas and their objects that is basic\nin Bolzano’s theory of ideas. For ‘\\(i \\mathbf{R}\nx\\)’ we used phrases such as ‘\\(i\\) is an idea of\n\\(x\\)’ or ‘\\(x\\) is an object of \\(i\\)’; other\nexpressions for it are ‘\\(i\\) represents \\(x\\)’,\n‘\\(x\\) is subsumed under \\(i\\)’ or ‘\\(x\\) falls\nunder \\(i\\)’ (WL I, 298). The domain of \\(\\mathbf{R}\\) is the\nset of non-empty ideas, its range being the set of all objects;\nmoreover, \\(\\mathbf{R}\\) has the following properties: it is neither\nreflexive nor irreflexive (the latter due to counterexamples such as:\n[idea] \\(\\mathbf{R}\\) [idea]; cf. WL I, 461), it is neither symmetric\nnor asymmetric, it is neither transitive nor intransitive, and it is\nneither one-many nor many-one. Since, according to our definition,\n\\(Ext(i) = \\{x \\mid i \\mathbf{R} x\\}\\), we can express ‘\\(i\n\\mathbf{R} x\\)’ also in terms of ‘extension’ as\n‘\\(x \\in\\) \\(Ext(i)\\)’.\n\nBolzano defines a variety of relations between ideas concerning their\nextensions, such as the following ones: An idea \\(i_1\\) is\ncompatible with an idea\\( i_2\\) iff \\(i_1\\) and \\(i_2\\) share\na common object, i.e. \\(Ext(i_1) \\cap\\) \\(Ext(i_2) \\ne \\varnothing\\);\nand \\(i_1\\) is included in \\(i_2\\) (or: \\(i_2\\) includes\n\\(i_1)\\) iff \\(i_1\\) is compatible with \\(i_2\\) and every object of\n\\(i_1\\) is also an object of \\(i_2\\), i.e., \\(Ext(i_1) \\cap\\)\n\\(Ext(i_2) \\ne \\varnothing\\), and \\(Ext(i_1) \\subseteq\\) \\(Ext(i_2)\\).\nIn Bolzano’s theory of ideas, precise correlates are available\nof basic concepts of set theory such as the empty set as well as the\nmembership relation and the relation of inclusion between sets.\nUnfortunately, the clear distinction between membership and inclusion\nin his theory of ideas vanished in his theory of propositions due to\nthe common form \\([A\\) has \\(b]\\) of all propositions whereby \\([A]\\) can\nbe not only a singular, but also a general (or an empty) idea.\n\nAlready in his theory of ideas Bolzano used a method which he was very\nproud to have invented: the method of idea-variation. He made the most\nfruitful usage of this method, however, by applying it to whole\npropositions.\n3.6 Bolzano’s Method of Idea-Variation\n\nIn his analysis of propositions, Bolzano did not break through the\ntraditional paradigms. In another respect, however, namely concerning\nthe definition of basic semantic concepts, he opened wide the gates to\nmodern logic. The main instrument to do so was the method of\nidea-variation that he invented. He himself took it to be his main\ncontribution to logic that was for himself — who certainly did\nnot suffer from arrogance — of “epoch making\nimportance” (Bolzano 1838, 350).\n\nThe basic insight underlying Bolzano’s method of idea-variation\nis quite simple (WL II, 77 ff.). Let us take as our first example\n\\(S_1\\) the proposition [Kant is a German philosopher]. (In order to\nsimplify matters linguistically, we do not adhere to Bolzano’s\nformulation ‘\\(A\\) has \\(b\\)’ but will allow also\nformulations of the kind ‘\\(A\\) is (a) \\(B\\)’. Moreover,\nwe will take in what follows words like ‘German’,\n‘French’, ‘European’, ‘American’\netc. in the sense of ‘born in Germany’, ‘born in\nFrance’, ‘born in Europe’, ‘born in\nAmerica’ etc.) The extra-logical ideas that are parts of \\(S_1\\)\nare the ideas [Kant], [German], and [philosopher]; we consider now one\nor more of them to be variable in the sense that we think that they\nare replaced in \\(S_1\\) by other ideas fitting to the former ones\n(i.e., belonging to the same “category”). In this way the\nidea [Kant] can be “varied” in \\(S_1\\) and replaced, e.g.,\nby [Hegel]; in other words, we can substitute [Hegel] for [Kant] in\n\\(S_1\\). The variation in question is a kind of replacement or\nsubstitution. It results in a “new” (or better: in\nanother) proposition, viz. in the true proposition [Hegel is a German\nphilosopher]; we will say that [Hegel is a German philosopher] is the\n[Hegel]/[Kant]-variant of \\(S_1\\). A false [Kant]-variant of \\(S_1\\)\nis its [Sartre]/[Kant]-variant [Sartre is a German philosopher].\nSimilarly, [Kant is an European philosopher] is a true and [Kant is an\nAmerican philosopher] is a false [German]-variant of \\(S_1\\). The\noperation of replacement (or substitution) can also be performed on\ntwo or more parts of a proposition simultaneously: Replacing [Kant]\nand [philosopher] in \\(S_1\\) simultaneously by, e.g., [Gauss] and\n[mathematician], results in the true ([Gauss], [mathematician]/[Kant],\n[philosopher])-variant [Gauss is a German mathematician]. A false\n([Kant], [philosopher])-variant of \\(S_1\\) is, e.g., [Sartre is a\nGerman musician]. We can also replace all extra-logical parts of\n\\(S_1\\) simultaneously: A true ([Kant], [German],\n[philosopher])-variant of \\(S_1\\) is [Mozart is an Austrian composer],\nwhereas [Sartre is a Greek mathematician] is a false one. Following\nBolzano, we will here use this generalized operation of simultaneous\nreplacement (or variation). Given an arbitrary proposition \\(s\\) and\ntwo sequences \\(i_1, i_2 ,\\ldots ,i_n\\) and \\(j_1, j_2 ,\\ldots ,j_n\\)\nof ideas, a proposition \\(s'\\) is uniquely determined by this\noperation; due to this operation, for each \\(k\\) \\((1 \\le k \\le n)\\),\nthe idea \\(i_k\\) is replaced in \\(s\\) uniformly (i.e., wherever it\n“occurs” in \\(s)\\) by one and the same corresponding idea\n\\(j_k\\). The resulting proposition \\(s'\\) is the \\((j_1, j_2 ,\\ldots\n,j_n /i_1, i_2 ,\\ldots ,i_n)\\)-variant of \\(s\\), or — briefly\nput — the \\(j/i\\)-variant of \\(s\\). (Thereby we take \\(i =\n\\langle i_1, i_2 ,\\ldots ,i_n\\rangle\\) and \\(j = \\langle j_1, j_2\n,\\ldots ,j_n\\rangle\\). Moreover, we are using here\n‘\\(s\\)’, ‘\\(s'\\)’, ‘\\(s_1\\)’,\n‘\\(s_2\\)’,… as variables for propositions,\n‘\\(i_1\\)’, ‘\\(i_2\\)’,…,\n‘\\(j_1\\)’, ‘\\(j_2\\)’,… as variables for\nideas, and ‘\\(i\\)’ and ‘\\(j\\)’ as variables\nfor sequences of ideas of the same length.) The close relationship\nbetween a variant of a proposition and a substitution instance of a\nsentence is quite obvious. In order for the \\(j/i\\)-variant of an\narbitrary proposition \\(s\\) to be uniquely determined and to fulfill\ncertain criteria of adequacy, however, several restrictions are\nrequired: (i) Each of the \\(i_k\\)s \\((1 \\le k \\le n)\\) must be simple\nor at least “relatively” simple (in the sense that in each\nparticular context under consideration they are not further analyzed\ninto parts but “taken” to be simple); (ii) each of the\n\\(i_k\\)s is an extra-logical idea; (iii) the \\(i_k\\)s are pair-wise\ndistinct; moreover (iv), in order to keep the result of the\nreplacement operation “well-formed”, i.e., a genuine\nproposition, we must require that each \\(j_k\\) “fits” the\ncorresponding \\(i_k\\), i.e., is of the same semantic category; and\nfinally (v), we must also require that at least one of the ideas\n\\(i_k\\) must be contained in \\(s\\) as one of its parts so that the\noperation of replacement is never performed vacuously.\n\nInstead of saying that a \\(j/i\\)-variant of a proposition \\(s\\) is\ntrue or false (or that it is a true or false variant of \\(s)\\),\nBolzano prefers to say: j macht s hinsichtlich i wahr bzw.\nfalsch (cf. e.g., WL II, 79, 113 ff.), i.e.: \\(j\\) verifies or\nfalsifies \\(s\\) with respect to \\(i\\) (or, more literally: \\(j\\) makes\n\\(s\\) true or false with respect to \\(i)\\).\n\nAs far as our first example \\(S_1\\) is concerned, there are true as\nwell as false variants of it with respect to every single\nextra-logical part of it and also with respect to every sequence of\nsuch parts. But now let us consider the following expamle \\(S_2\\):\n[Every German philosopher is European]. It has true as well as false\n[German]-variants, [European]-variants, ([German],\n[philosopher])-variants, ([German], [European])-variants,\n([philosopher], [European])-variants and also ([German],\n[philosopher], [European])-variants. But obviously, all\n[philosopher]-variants of \\(S_2\\) must be true — provided, says\nBolzano, that their subject idea is non-empty. This proviso is a\ntypical feature of Bolzano’s approach and mentioned by him again\nand again, since — according to his truth condition — a\nproposition with an empty subject idea is trivially false. Whenever we\nperform the operation of variation on the subject idea of a\nproposition (and sometimes also when we perform it only on certain\nparts of it), however, we will have variants with empty subject ideas;\nthus, only in exceptional cases all variants of a proposition\nwill turn out to be true. If all \\(i\\)-variants of a proposition \\(s\\)\nwith a non-empty subject idea are true, Bolzano will say that \\(s\\) is\nuniversally valid with respect to \\(i\\). Hereby we have to take into\naccount, that for Bolzano also in his meta-language words such as\n‘all’, ‘every’ or ‘each’ have\nexistential import and that therefore his definition must explicitly\nstated as follows (WL II, 82):\n\nA proposition \\(s\\) is universally valid (allgemeingültig)\nwith respect to a sequence \\(i\\) of ideas iff there is at least\none true \\(i-\\)variant of \\(s\\), and every \\(i\\)-variant of \\(s\\) with\na non-empty subject idea is true.\n\n\nAnalogously we can define what it is for a proposition to be\nuniversally contravalid:\n\nA proposition \\(s\\) is universally contravalid\n(allgemeinungültig) with respect to a sequence i of ideas\niff every \\(i\\)-variant of \\(s\\) is false.\n\n\n[Every German philosopher is American] is an example of a proposition\nthat is universally contravalid with respect to [philosopher].\n\nIf a proposition is universally valid or universally contravalid with\nrespect to \\(i\\), Bolzano says that it is analytic with respect\nto \\(i\\), otherwise, that it is synthetic with respect to\ni. If a proposition is analytic (or synthetic) with respect to at\nleast one sequence \\(i\\), Bolzano calls it ‘analytic’ (or\n‘synthetic’, respectively), without further qualification\n(WL II, 83–89, 331–338). Herewith Bolzano starts a new\ntradition of usage of the term ‘analytic’ as opposed to\nthat from Kant up to Carnap and Quine: Whereas in this latter\ntradition the term ‘analytic’ includes exclusively true\npropositions, in Bolzano’s terminology also all universally\ncontravalid propositions are subsumed under this term; and even a\nuniversally valid proposition could be false if it has an empty\nsubject idea but all of its variants with non-empty subject ideas are\ntrue. (On this point, however, Bolzano is not always consistent.)\n\nLogical properties of a proposition are — according to a\nclassical view — of a formal character, i.e., they are primarily\nproperties of the form of a proposition rather than of the\nproposition itself. The formal character of logical properties\nsuggests the following alternative way of presenting Bolzano’s\nview. Bolzano himself identifies explicitly the form of a\nproposition with a set of propositions (WL I, 48, WL II, 82):\n\n\nThe form of a proposition s with respect to a sequence i of\nideas or (as an abbreviation) the i-form of s is the set\nof all \\(i\\)-variants of \\(s\\), provided that at least one of the\n\\(i_k\\)s is contained in \\(s\\). (For cases in which this proviso is\nnot met, neither an \\(i\\)-variant of \\(s\\) nor the \\(i\\)-form of \\(s\\)\nis defined.)\n\n\nA propositional i-form can therefore be defined as the\n\\(i\\)-form of at least one proposition \\(s\\); and a propositional\nform is a propositional \\(i\\)-form with respect to at least one\nsequence \\(i\\). Due to the proviso mentioned, a propositional form as\ndefined before can never be empty or a singleton. We can now define\nuniversal validity and universal contravalidity first for a\npropositional form and subsequently for a proposition in the following\nway:\n\n\nA propositional form \\(F\\) is universally valid iff\nat least one member of \\(F\\) is true, and every member of \\(F\\) with a\nnon-empty subject idea is true; \\(F\\) is universally\ncontravalid iff every member of \\(F\\) is false.\n\nA proposition \\(s\\) is universally valid (or\nuniversally contravalid, respectively) with respect to a\nsequence i of ideas iff there is a propositional form \\(F\\) such\nthat \\(F\\) is a propositional \\(i\\)-form which is universally valid\n(or contravalid, respectively), and \\(s\\) is a member of \\(F\\).\n\n\\(s\\) is analytic with respect to i iff \\(s\\) is universally\nvalid or universally contravalid with respect to \\(i\\); \\(s\\) is\nsynthetic with respect to i iff \\(s\\) is not analytic with\nrespect to \\(i\\).\n\n\\(s\\) is analytic (or synthetic, respectively) iff\n\\(s\\) is analytic (or synthetic, respectively) with respect to at\nleast one sequence \\(i\\).\n\n3.7 Bolzano’s Definition of Logical Truth\n\nThe result of applying the operation of variation to a proposition\ndepends essentially on our choice of ideas to be varied in the\nproposition in question. And it can depend on matters of fact whether\nor not a proposition is universally valid (or contravalid) with\nrespect to a sequence \\(i\\) of ideas. Thus, e.g., it is due to the\nfact that every German is European and no German is American that the\nproposition [Every German philosopher is European] is universally\nvalid and the proposition [Every German philosopher is American] is\nuniversally contravalid with respect to [philosopher]. From a logical\npoint of view, the most interesting results will turn up if all\nextra-logical parts of a proposition, which are simple (or\n— as explained before — “relatively” simple),\nare taken to be variable (WL II, 84). To simplify matters, we will\nassume for what follows that for any proposition \\(s\\) there is always\nfixed a certain alphabetic order of all extra-logical simple ideas\ncontained in it; thereby, for every proposition \\(s\\), a sequence\n\\(i^{\\boldsymbol{s}}\\) of all extra-logical simple ideas contained in\n\\(s\\) is uniquely determined. It would appear that we now could define\nthe concepts of logico-universal validity and logico-universal\ncontravalidity in the following way: A proposition \\(s\\) is\nlogico-universally valid, or — put briefly — logically\ntrue, iff \\(s\\) is universally valid with respect to\n\\(i^{\\boldsymbol{s}}\\); \\(s\\) is logico-universally contravalid, or\n— put briefly — logically false, iff \\(s\\) is\nuniversally contravalid with respect to \\(i^{\\boldsymbol{s}}\\); \\(s\\)\nis logically analytic iff \\(s\\) logically true or logically\nfalse; and \\(s\\) is logically synthetic iff\\( s\\) is not\nlogically analytic.\n\nIn proceeding this way, however, we would have to face serious\nproblems concerning purely logical propositions, i.e., propositions\nall of whose parts are purely logical ideas. Due to our requirement\n(v) above concerning Bolzano’s replacement operation, neither an\n\\(i\\)-variant in general nor an \\(i^s\\)-variant in particular is\ndefined for a purely logical proposition, since it does not contain\nany extra-logical idea. In consequence the preceding definitions of\nlogical truth, logical falsity and logical analyticity are not\napplicable to purely logical propositions, since they do not contain\nany extra-logical idea. Consider, however, the following three purely\nlogical propositions: [There is something, or it is not the case that\nthere is something], [There is something, and it is not the case that\nthere is something], and [There is something]. The first of these\nthree propositions is obviously logically true, the second one\nlogically false, and the third one is neither logically true nor\nlogically false. Giving up requirement (v), as some would like to have\nit, results in a purely logical proposition being its only own\n\\(i^{\\boldsymbol{s}}\\)-variant. That, however, would turn every purely\nlogical proposition either into a logical truth or into a logical\nfalsity according to our definition, in contrast to the fact that the\nproposition [There is something], i.e. [[something] has\nnon-emptiness], is not logically analytic; it is a truth of logic, but\nnevertheless not logically true (WL II, 375).\n\nA posssible way out of this dilemma is to choose the alternative\nprocedure sketched above (at the end of section 3.6) by taking these\nlogical properties primarily to be properties of propositional\nforms. Thereby the logical form of a proposition s\nis identified with the set of all of its\n\\(i^{\\boldsymbol{s}}\\)-variants; \\(F\\) is a logical propositional\nform therefore iff it is the logical form of at least one\nproposition. (Please note that according to this approach, the logical\nform of a purely logical proposition is not even defined;\nnevertheless, a purely logical proposition can be a member of\na logical propositional form.) We will define first the relevant\nproperties for propositional forms:\n\nA propositional form F is logically valid iff \\(F\\) is a\nlogical propositional form that is universally valid, i.e., at least\none of its members is true, and all of its members with non-empty\nsubject ideas are true.\n\n\n\\(F\\)is logically contravalid iff \\(F\\) is a logical\npropositional form, and all of its members are false.\n\n\nWe then define the corresponding properties for single\npropositions:\n\nA proposition \\(s\\) is logically true iff there is a\npropositional form \\(F\\) such that \\(F\\) is logically valid and \\(s\\)\nis a member of \\(F\\).\n\n\n\\(s\\) is logically false iff there is a propositional form\n\\(F\\) such that \\(F\\) is logically contravalid and \\(s\\) is a member\nof \\(F\\).\n\n\\(s\\) is logically analytic iff \\(s\\) is logically true or\nlogically false.\n\n\\(s\\) is logically synthetic iff \\(s\\) is not logically\nanalytic.\n\n\nIt is easy to find an example of each of these kinds of propositions:\nthe proposition [Every German philosopher is German] is logically\ntrue, the proposition [Kant is German and Kant is non-German] is\nlogically false, and the proposition [Kant is a German philosopher] is\nlogically synthetic. (Cf. Morscher 2007, 75–99.)\n3.8 Bolzano’s Definition of Material Consequence and of Logical Consequence\n\nBolzano’s logical World 3 includes in addition to ideas and\npropositions also what we will call ‘arguments’. Bolzano\nis dealing with arguments at lengths in his Theory of Science\n(cf., e.g., WL II, 113 ff., 391 ff.), but he does not introduce a name\nfor them. Following the general line of his terminology, he could have\ncalled them ‘Schlüsse an sich’\n(‘derivations in themselves’ or ‘inferences in\nthemselves’), but he did not; he rather used this term for a\ncertain kind of propositions, namely for propositions stating that a\nproposition follows (or — in his words — is\nableitbar, i.e., derivable) from a set of propositions (WL I,\n213, WL II, 200; for another usage of the term\n‘Schluß’ by Bolzano cf. section 4.4). A Bolzanian\nargument consists of two sets of propositions: the set of its premises\nand the set of its conclusions. In order to simplify matters, we will\nassume here that an argument has always a single proposition (rather\nthan a whole set of propositions) as its conclusion, and we will\nidentify an argument with an ordered pair \\(\\langle \\sigma ,\ns\\rangle\\) consisting of a set \\(\\sigma\\) of propositions (i.e., the\nset of premises) and a single proposition \\(s\\) (i.e., its\nconclusion).\n\nBolzano first explains what it means that a single proposition \\(s\\)\nis derivable (ableitbar) from a set \\(\\sigma\\) of\npropositions with respect to a certain sequence \\(i\\) of ideas (WL II,\n113 ff., 198 ff.). Since Bolzano’s term\n‘Ableitbarkeit’ (‘derivability’) is\nused nowadays in a purely syntactical sense, we use here instead the\nmore common phrases ‘\\(s\\) follows from \\(\\sigma\\) with respect\nto \\(i\\)’ or ‘\\(s\\) is a consequence of \\(\\sigma\\) with\nrespect to \\(i\\)’.\n\nWe have explained Bolzano’s method of idea-variation in section\n3.6 with respect to single propositions. In order to apply it also to\narguments, we have now to extend our original definitions to whole\nsets of propositions. In applying the operation of variation\nto a set \\(\\sigma\\) of propositions, each member of \\(\\sigma\\) is\nreplaced by its corresponding variant: The j/i-variant of a\nset \\(\\sigma\\) of propositions is the set of all the \\(j/i\\)-variants\nof the members of \\(\\sigma\\). Moreover we will say of a set \\(\\sigma\\)\nof propositions that it is true iff each of its members is true; and\nwe will say that a sequence \\(j\\) of ideas verifies a set \\(\\sigma\\)\nof propositions with respect to \\(i\\) iff \\(j\\) verifies each member\nof \\(\\sigma\\) with respect to \\(i\\), i.e., iff the \\(j/i\\)-variant of\neach member of \\(\\sigma\\) is true. A proposition \\(s\\)\nfollows from a set \\(\\sigma\\) of propositions (or, in other\nwords, \\(s\\) is a consequence of \\(\\sigma)\\) with respect to\na sequence \\(i\\) of ideas iff every sequence \\(j\\) of ideas that\nverifies \\(\\sigma\\) with respect to \\(i\\) verifies \\(s\\) as well with\nrespect to \\(i\\).\n\nIn transferring this formulation into a formal definition, we have to\nbear in mind again that ‘each’ and ‘every’ has\nexistential import also in Bolzano’s meta-language. The formal\ndefinition has therefore to be stated as follows:\n\ns follows from \\(\\sigma\\) with respect to \\(i\\) (or:\n\\(s\\) is a consequence of \\(\\sigma\\) with respect to\n\\(i)\\) iff there is a sequence \\(j\\) of ideas such that \\(j\\) verifies\n\\(\\sigma\\) with respect to \\(i\\), and every sequence \\(j\\) of ideas\nwhich verifies \\(\\sigma\\) with respect to \\(i\\), verifies \\(s\\)\nlikewise with respect to \\(i\\).\n\n\nIn this sense, e.g., the proposition [Kant is European] follows from\nthe set {[Kant is a philosopher], [Every philosopher is\nGerman]} with respect to the idea [philosopher]. The conclusion\nfollows, so to speak, “materially” from the premises, or\nis a “material” consequence of the premises, due to the\nfact that every German is European. This is not enough, of course, for\nan argument to be logically correct. In order to be logically\ncorrect, the conclusion \\(s\\) of an argument \\(\\langle \\sigma ,\ns\\rangle\\) must logically follow from \\(\\sigma\\), i.e., \\(s\\)\nmust be a logical consequence of \\(\\sigma\\) (WL II,\n391–395; the similarity with the distinction between material\nand formal consequence in Tarski 1956, 419, is obvious). A simple\ndefinition of logical consequence seems to suggest itself: \\(s\\)\nfollows logically from \\(\\sigma\\) (or: \\(s\\) is a logical\nconsequence of \\(\\sigma)\\) iff \\(s\\) follows from \\(\\sigma\\) with\nrespect to the sequence \\(i^{\\sigma \\cup \\{s\\}}\\) of all extra-logical\nsimple ideas contained in \\(\\sigma\\) or \\(s\\).\n\nThis simple answer, however, faces the same problems as the\ncorresponding answer with respect to logical truth (cf. section 3.7).\nAs we have done with logical truth and for the same reason, here too,\nwe must give priority to the logical form of an argument and\nthen proceed by this means to define the concept of logical\nconsequence for particular arguments.\n3.9 Further Applications of the Method of Idea-Variation\n\nBeyond the usage of the method of idea-variation for his truly\npioneering definitions of logical truth and logical consequence and\nrelated concepts (such as the concepts of satisfiability and\ncompatibility), Bolzano made use of this method also for a series of\nother purposes, above all in his development of the theory of\nprobability (WL II, 77–82, 171–191, 509–514, WL III,\n136–138, 263–288, 559–568, RW II, 39–49,\n57–61, 66–71). Bolzano’s theory of probability is\nbased on his distinction of different degrees of validity of a\nproposition \\(s\\) with respect to a sequence \\(i\\) of ideas. This\ndegree of validity of s with respect to i is representable as\na fractional number \\(\\bfrac{m}{n}\\) where \\(n\\) is the number of all\npossible variants of \\(s\\) with respect to \\(i\\) and \\(m\\) is the\nnumber of true variants of \\(s\\) with respect to \\(i\\). If all\nvariants of \\(s\\) with respect to \\(i\\) with non-empty subject ideas\nare true, \\(m = n\\) and \\(\\bfrac{m}{n} = 1\\), i.e., \\(s\\) is\nuniversally valid with respect to \\(i\\); if all variants are false,\n\\(m = 0\\) and \\(\\bfrac{m}{n} = 0\\), i.e., \\(s\\) is universally\ncontravalid with respect to \\(i\\) (WL II, 81 f.). The logical\ndegree of validity of s is thus the degree of validity of \\(s\\)\nwith respect to \\(i^s\\), i.e., with respect to a certain sequence of\nall simple extra-logical ideas contained in \\(s\\). \n\nIn order to be able to apply these notions in a useful way, we have to\nexplain how to count the variants of a proposition, since for each\nvariant of a proposition (as for each proposition in general) there\nare infinitely many others that are logically equivalent to it (e.g.,\ndue to replacing a part \\([b]\\) of the proposition by [non-non-\\(b]\\),\n[non-non-non-non-\\(b]\\) etc.). If we would count all of them, the\nresulting fractional number would not be very informative. Bolzano was\ncompletely aware of this problem (WL II, 79 f.), and he was very\ncreative in developing methods for solving it as well as many other\npuzzling problems.\n\nBolzano is not content with this concept of probability\nsimpliciter but rather continues to develop an even more\nimportant relative concept of probability. What is at stake\nhere is the probability of a proposition \\(s\\) relative to a set\n\\(\\sigma\\) of propositions with respect to a sequence \\(i\\) of ideas,\nand in particular with respect to \\(i^{\\sigma \\cup \\{s\\}}\\), i.e., the\nsequence of all simple extra-logical ideas contained in \\(s\\) or\n\\(\\sigma\\). Its degree can again be represented by a fractional number\n\\(0 \\le^m /_n \\le 1\\), where \\(n\\) is the number of cases where\n\\(\\sigma\\) comes out true and \\(m\\) is the number of cases where\n\\(\\sigma \\cup \\{s\\}\\) comes out true (WL II, 171–191; for a\ncareful reconstruction of Bolzano’s theory of probability see\nBerg 1962, 148–150).\n\nIn his Tractatus (5.15) Ludwig Wittgenstein came so close to\nBolzano’s definition of probability that Georg Henrik von Wright\nfelt it to be appropriate “to speak of one definition\nof probability here and call it the Bolzano-Wittgenstein\ndefinition” (Wright 1982, 144 f.).\n\nBolzano’s work on probability was not only of purely theoretical\ninterest to him but also had interesting practical consequences with\nrespect to problems in the philosophy of science (cf. section 4) and\nin particular also with respect to religious questions (cf. section\n8).\n4. Epistemology and Philosophy of Science\n\nBolzano strove for objectivity in “pure logic” in the\nsense that the concepts and laws of logic are mind-independent. In\n“applied logic”, in particular in epistemology, however,\nwe have to take into account also the real, i.e., empirical,\nconditions of the human mind and thinking according to Bolzano (WL I,\n66 f.). Nevertheless, he defined  the basic concepts of\nepistemology primarily on the level of ideas and propositions. This\ngave rise to the misunderstanding that his investigations are\nworthless for epistemology proper or even that there is no\nepistemology proper at all in Bolzano’s work. The fact that this\nis by no means the case, will — hopefully — emerge from\nthe following survey of Bolzano’s epistemology.\n4.1 “Appearances” of Propositions and Ideas in Human Minds\n\nIn epistemology, we are primarily and directly not concerned with\npropositions and ideas, but rather with their appearances\n(Erscheinungen) in the minds of thinking beings\n(“im Gemüt von geistigen bzw. denkenden\nWesen”). One and the same proposition or idea can, as\nBolzano says, appear in the minds of different thinking beings or also\nat different times in the mind of one and the same thinking being,\nwithout thereby being multiplied (WL I, 217, WL III, 13, 112). Bolzano\nsays, in such a case, that the thinking being and its mind\n“grasp” the proposition or idea in question (the\ncorresponding German word being ‘erfassen’ or\n‘auffassen’). What happens in such a case is that\nin the mind of the thinking being under consideration a mental\nphenomenon occurs, or a mental process takes place in it, that is\ncalled by Bolzano a ‘Gedanke’\n(‘thought’); it can be a subjective idea\nor a subjective proposition, depending on whether an idea or\na proposition “appears” in it.\n\nIn contrast to ideas and propositions (i.e., “objective”\nideas and “objective” propositions), subjective ideas and\nsubjective propositions belong to the real world, in particular to\nWorld 2 of mental phenomena and mental processes. For Bolzano, a\nsubjective idea as well as a subjective proposition is a real property\n(or “adherence”) of the thinking being in whose mind it\nappears, or rather of this being’s mind or “soul”\nitself (WL III, 6, 10 f., 109). A subjective idea is a mental\nphenomenon — i.e., an attribute of a mind — that\n“grasps” an idea (in the “objective” sense of\nthe word); and a mental phenomenon that “grasps” a\nproposition is called ‘Urteil’\n(‘judgment’) by Bolzano (WL III, 108). In\naddition to judgments, there is a second kind of subjective\npropositions, viz. propositions that are “merely thought”\n(bloß gedacht); a “merely thought\nproposition” is in fact a subjective idea of a proposition, i.e.\na mental phenomenon which grasps an idea whose object is a proposition\n(WL I, 155). Merely having a subjective idea of a proposition does not\nrequire that we assert the truth of the proposition in question,\nwhereas a judgment is an act (Handlung) of asserting the\ntruth of the proposition grasped by the judgment (WL III, 108,\n199).\n\nWhen we say of a subjective idea or a judgment that it\n“grasps” an idea or proposition, respectively, the word\n‘grasp’ is used in a more restrictive sense than before,\nwhere it was a thinking being or its mind of which it was said that it\n“grasps” an idea or proposition. This stricter relation of\n“grasping”, holding between subjective ideas and ideas,\nand between judgments and propositions is fundamental for\nBolzano’s epistemology. Instead of saying in this sense\n‘\\(p\\) grasps \\(o\\)’, Bolzano will synonymously also use\nthe phrase ‘\\(o\\) is the “material” (Stoff)\nof \\(p\\)’. Both formulations, however, are — as Bolzano\nemphasizes — to be understood merely metaphorically (Bolzano\n1935, 84 f.). The corresponding relation is introduced as a primitive\nconcept in Bolzano’s epistemology. Let us use the symbol\n‘\\(\\mathbf{G}\\)’ for this relation, whereby ‘\\(p\n\\mathbf{G} o\\)’ is to be read as ‘\\(p\\) grasps\n\\(o\\)’ or, alternatively, ‘\\(o\\) is the\n“material” of \\(p\\)’.\n\nIn terms of ‘\\(\\mathbf{G}\\)’, i.e., the strict relation of\n“grasping”, the weaker relation of “grasping”\nbetween a thinking being and an idea or proposition can be defined as\nfollows: a thinking being \\(x\\) “grasps” (in the weaker\nsense of this word) an idea or proposition \\(o\\) iff there is a\nsubjective idea or a judgment \\(p\\) in \\(x\\)’s mind such that\n\\(p \\mathbf{G} o\\). The relation \\(\\mathbf{G}\\) is the link between\nthe mental phenomena of World 2 on the one hand and the World 3 of\nideas and propositions on the other hand. Via relation \\(\\mathbf{G}\\),\nitems of World 3 can have a certain, non-causal influence on the\nmental phenomena of World 2, and these on their part stand in causal\nrelations to other mental phenomena and also to the physical phenomena\nof World 1.\n\nDue to the domain and the range of \\(\\mathbf{G}\\) being disjunctive\nsets, the relation \\(\\mathbf{G}\\) has the following formal features:\nit is irreflexive, asymmetric, and (trivially) transitive; moreover,\n\\(\\mathbf{G}\\) is many-one, but not one-many. Due to\n\\(\\mathbf{G}\\)’s being many-one, by each subjective idea and\neach judgment an idea or a proposition, respectively, is uniquely\ndetermined as its material (WL III, 8 f., 108). Most of the important\nproperties, relations and distinctions, which were defined by Bolzano\nprimarily for ideas and propositions, can therefore easily be\ntransferred from the sphere of ideas and propositions to the sphere of\nsubjective ideas and judgments. We therefore will say of a subjective\nidea that it is simple or complex, empty, singular or general, an\nintuition, a concept or “mixed” according as the idea\ngrasped by it has the corresponding property; and the same goes for\njudgments. \n4.2 Subjective Intuitions and Subjective Concepts\n\nAn intuition is for Bolzano an idea that is simple and singular (cf.\nsection 3.5). The question arises immediately whether such an\nintuition exists after all and — if so — what it can\ncontribute to epistemology. Both questions are answered by Bolzano at\nonce: In order to show that there are intuitions, he hints at\nsubjective ideas (ideas in our minds) that grasp\n“objective” intuitions as defined before; and since these\nsubjective intuitions exist in our actual world, the corresponding\n“objective” intuitions must exist (in the sense of\n‘es gibt’) in the logical realm of World 3. What\nare the examples of subjective intuitions, however, that Bolzano can\nput forward in support of his claim? It is subjective ideas such as\nthe subjective idea of the change in our mind that is the immediate\nreaction on an outer object (such as a rose) that stimulates our\nsenses. In everyday language we usually express such an idea only by\nthe word ‘that’ (‘dieses’ or —\nin Bolzano’s old-fashioned orthography —\n‘dieß’). Bolzano’s rather long-winded\nexplication (in WL I, 326 f.) reveals subjective ideas of a particular\nsensation or sense-datum as his favorite examples of subjective\nintuitions (cf. also WL III, 21 f.). The object and the cause of a\nsubjective intuition of this kind is itself a mental phenomenon such\nas a subjective idea or a judgment (WL III, 85). If a subjective\nintuition is directly caused by an “outer” object, Bolzano\ncalls it an ‘outer intuition’. Also in the case of an\nouter intuition, its proper object is not the\n“outer” cause of it but an “inner” mental\nevent; human beings are capable only of having subjective intuitions\nwhose proper object is a change in their mind (WL III, 89). In other\npassages Bolzano seems to be less cautious and claims also of an idea\nsuch as [Vesuvius] (WL II, 38) or [Socrates] (WL I, 346, in explicit\ncontradiction to WL III, 89) to be a pure intuition whose appearance\nin the mind of a thinking being is a subjective intuition. This would\nobviously result in taking each rigid designator (in today’s\nterminology) to express an intuition.\n\nIn the same way in which a subjective intuition is defined as a\nsubjective idea that “grasps” (in the sense of\n\\(\\mathbf{G})\\) an “objective” intuition, we can also\ndefine subjective concepts and “mixed” subjective ideas\n(WL III, 21–23).\n4.3 Judgments A Priori and A Posteriori\n\nUsing the distinction between intuitions and other ideas, Bolzano is\nnow able to draw an important epistemological distinction among\npropositions and in particular also among true propositions: A\nproposition is a conceptual proposition iff it does not\ncontain any intuition but consists exclusively of concepts, such as\nthe propositions [God is omnipotent], [Gratefulness is a duty], or\n[\\(\\sqrt{2}\\) is irrational]; all the other propositions are called\n‘empirical propositions’ (or also\n‘perceptual propositions’) by Bolzano, e.g. [That is a\nflower], or [Socrates was an Athenian] (WL II, 33 f.). There is no\nproblem in transferring this distinction from the sphere of\npropositions to the sphere of judgments, since (as already mentioned)\nby every judgment a certain proposition is uniquely determined (via\nrelation \\(\\mathbf{G})\\) as its “material” (WL III,\n115).\n\nAt first glance, this objective distinction among propositions seems\nto be far away from the Kantian distinction between judgments a\npriori and a posteriori. Nevertheless, the two\ndistinctions are closely interrelated, and they almost coincide (WL\nII, 36); hence, Bolzano warns against confusing them (WL IV, 451 f.).\nThe close relationship of the two distinctions becomes obvious as soon\nas we ask ourselves how to discover of a conceptual or an empirical\nproposition whether or not it is true: In the case of conceptual\npropositions, it is mere reflection, i.e., an inner\n“inspection” of our subjective concepts, without any\nexperience, that is required to find out whether or not it is true,\nwhereas in the case of an empirical proposition experience is\nindispensable for judging its truth or falsity (WL II, 36). This\nKantian distinction of the different ways of recognizing the truth or\nfalsity of such judgments, however, as important as it is, must be\nbased on the more fundamental objective distinction between conceptual\nand empirical propositions on Bolzano’s view.\n\nEmpirical propositions contain at least one intuition. Most important\nare those empirical propositions whose subject idea is an intuition.\nThese are propositions about perceptions or sensations, i.e., in\nBolzano’s words, about certain changes in our minds, caused by\nother inner events or by external sensory stimuli. The subject idea of\na “private” empirical proposition of this kind is usually\nexpressed by a word such as ‘that’, denoting, e.g., a\ncertain color sensation. No wonder that the indexicals\n‘that’ and ‘I’ play such a prominent role in\nBolzano’s epistemology (in WL III) although they do not have a\nplace in his logical World 3 (cf. section 3.4). The reason for this\nseems to be that our empirical knowledge is based on immediate\nperceptual judgments, i.e., judgments that “grasp” (in the\nsense of \\(\\mathbf{G})\\) a certain kind of an empirical proposition.\nThe subjective subject idea of such an immediate perceptual judgment\nis a subjective intuition for whose expression an indexical such as\n‘that’ or ‘I’ seems to be indispensable.\n\nBolzano quite clearly faced the problem of how to get from these\nimmediate perceptual judgments, whose objects are completely\n“private” phenomena which we usually denote by means of\nindexicals, to an objective description of our world. His epistemology\ntherefore reminds us in many respects of the discussions concerning\nprotocol sentences among the representatives of phenomenalism and\nphysicalism in the Vienna Circle, and even more of Bertrand\nRussell’s program in his Inquiry into Meaning and Truth\n(1940). The highly interesting similarities between Bolzano’s\nand Russell’s program still await further investigation.\n4.4 Immediate and Mediated Judgments\n\nJudgments are psychical phenomena and they belong therefore not to\nWorld 3 but to our real world. Each judgment is an act or event that\ntakes place at a certain time in a certain mind and is herewith part\nof a causal network. As a part of our real world, each judgment comes\ninto being in time (and will pass away later on). From an\nepistemological point of view it is of particular relevance whether a\njudgment is caused or mediated by other judgments or whether this is\nnot the case, i.e., whether the judgment is “immediate”\n(WL III, 123 ff.). If a judgment \\(m\\) is caused or mediated by a set\n\\(\\mu\\) of judgments, Bolzano calls the mind’s transition from\n\\(\\mu\\) to \\(m\\) ‘Schluss’\n(‘inference’), as distinct from the usage of this\nterm explained in section 3.8. An inference in this sense is\na mental process (belonging to World 2) of inferring a judgment \\(m\\)\nfrom a set \\(\\mu\\) of others; we can represent it by \\(\\langle \\mu ,\nm\\rangle\\). Such an inference — as opposed to an\n“inference in itself” or an argument — is a causal\nprocess, to be clear. Since by each of the judgments involved in an\ninference — by the members of \\(\\mu\\) as well as by \\(m\\)\n— a proposition is uniquely determined (due to \\(\\mathbf{G})\\)\nas its “material”, by every inference \\(\\langle \\mu ,\nm\\rangle\\) an argument \\(\\langle \\sigma , s\\rangle\\) is uniquely\ndetermined, for which Bolzano has defined what it means, e.g., that\n\\(s\\) is a logical consequence of \\(\\sigma\\), or that \\(s\\) has a\ncertain logical probability \\(\\gt \\bfrac{1}{2}\\) relative to\n\\(\\sigma\\). (These concepts can then be applied indirectly to the\ninference \\(\\langle \\mu , m\\rangle\\) and used for its evaluation, as\nwe will see in the following section 4.5.)\n\nFrom the obvious existence of mediated judgments, however, it follows\nthat there must also be immediate judgments (WL III, 125,\n138–139). Immediate judgments cannot be false and must therefore\nbe certain (WL III, 212, 229, 263). Certainty has thereby not to be\ntaken in its objective sense in which a proposition \\(s\\) is certain\nrelative to a set \\(\\sigma\\) of propositions iff the logical\nprobability of \\(s\\) relative to \\(\\sigma\\) is 1, i.e., iff \\(s\\) is a\nlogical consequence of \\(\\sigma\\) (WL II, 173). In the present\ncontext, certainty must rather be taken in a subjective sense in which\nit is primarily a property of a judgment; if two judgments grasp one\nand the same proposition, one of them can be certain (in this\nsubjective sense of the term) whereas the other one is not (WL III,\n263 f.). As the two most important kinds of immediate judgments among\nthe empirical ones Bolzano mentions judgments of the form “I\n— have — an appearance \\(X\\)” and “That (what\nI just now perceive of) — has — property \\(b\\)” (WL\nI, 181, WL III, 131, 139, 229). Judgments of these two kinds are\ncalled ‘(immediate) perceptual judgments’, whereas the\nterm ‘empirical judgment’ is normally used only for\nmediated judgments containing a subjective intuition (WL III, 131 f.).\nThe propositions “grasped” by these immediate perceptual\njudgments are empirical propositions whose subject ideas are\nintuitions that are usually expressed by means of the indexicals\n‘I’ and ‘that’. Bolzano’s philosophy of\nscience can thus be found to be empiricist, founded on a phenomenalist\nbasis.\n\nWith respect to all judgments \\(m\\) mediated by a set \\(\\mu\\) of\njudgments, it is of high relevance whether the argument \\(\\langle\n\\sigma , s\\rangle\\) corresponding to \\(\\langle \\mu , m\\rangle\\)\nfulfills certain criteria. In the sections 3.8 and 3.9 we have already\ndealt with two logical relations which can obtain between the\nconclusion \\(s\\) and the set \\(\\sigma\\) of premises of an argument\n\\(\\langle \\sigma , s\\rangle\\) and which can easily be transferred to\n\\(\\langle \\mu , m\\rangle\\): it is on the one hand the peculiar feature\nof \\(s\\) being a logical consequence of \\(\\sigma\\), and on the other\nhand the peculiar feature of \\(s\\) having a certain degree of logical\nprobability \\(\\gt \\bfrac{1}{2}\\) relative to \\(\\sigma\\). With\nrespect to empirical judgments, considerations of probability are in\nthe foreground. Logical consequence “transfers” certainty,\nalso in its subjective sense, from the premises to the conclusion of\nan inference. That is to say, if each member of a set \\(\\mu\\) of\njudgments is certain for a person \\(A\\) (as is the case for each\nimmediate judgment), and if a judgment \\(m\\) is mediated or caused by\n\\(\\mu\\) insofar as it is inferred by \\(A\\) from \\(\\mu\\) as a logical\nconsequence of it, then \\(m\\) is also certain for \\(A\\) (WL III, 264\nf.). In order for this to be the case, it is of course not enough for\nthe argument \\(\\langle \\sigma , s\\rangle\\) corresponding to \\(\\langle\n\\mu , m\\rangle\\) to be logically correct, but it is required that\n\\(A\\) infers \\(m\\) from \\(\\mu\\) in virtue (kraft) of\nthe logical correctness of this argument.\n\nError and uncertainty have two possible sources according to Bolzano:\neither the premises that one presupposes are uncertain (or even\nfalse), or one has used a mere probability inference (WL III, 265 f.),\ni.e., an inference whose conclusion asserts the truth of a proposition\n\\(s\\) itself instead of merely asserting the truth of the proposition\n[\\(s\\) is probable] (WL I, 182 ff., WL II, 510, WL III, 212 f.).\nConsiderations of this kind amount to quite a refined epistemological\nsystem of subjective probability, in which Bolzano distinguishes\ndegrees of credibility and of assurance by using his probability\ntheory (WL III, 274–288). Unfortunately, these investigations\nare little known, since they are only developed in the third volume of\nhis Theory of Science which receives far less attention than\nit deserves.\n4.5 The Entailment Relation\n\na) Explication of the Entailment Relation: In addition to\nlogical consequence and probability, there is a third category,\nhowever, that is brought into play by Bolzano within this context: it\nis the relation which obtains between a set \\(\\sigma\\) of propositions\nand a proposition \\(s\\) iff \\(\\sigma\\) is the “objective\nground” of \\(s\\) or — in other words — iff \\(s\\)\n“follows objectively” from \\(\\sigma\\); in today’s\nterminology we say instead that \\(\\sigma\\) entails \\(s\\) or that \\(s\\)\nis entailed by \\(\\sigma\\). This relation of entailment\n(Abfolge) is — to be clear — primarily not an\nepistemological relation but — like (logical) consequence and\n(logical) probability — a relation between a set of propositions\nand a single proposition (WL II, 339 ff., WL III, 495 f.).\n\nBolzano’s favorite way of explaining this concept is by means of\ntwo inferences whose corresponding arguments are \\(\\langle \\sigma_1,\ns_1\\rangle\\) and \\(\\langle \\sigma_2, s_2\\rangle\\) such that the\nfollowing holds: \\(s_1\\) describes the rising of a thermometer at a\ncertain moment of time at a certain place, and \\(s_2\\) describes the\nrising of the temperature at the same place and time. \\(\\sigma_1\\)\ncontains the law that from the rising of temperature the extension of\na liquid (in the thermometer) will follow, plus the required\nantecedent conditions, whereas \\(\\sigma_2\\) contains the\n(statistically confirmed) proposition that, if a functioning\nthermometer at a certain time and place rises, then also the\ntemperature there will rise, plus the corresponding antecedent\nconditions. (Sometimes Bolzano also uses an analogous example with\natmospheric pressure and a barometer.) Let us assume that we have\nconstructed the two arguments in such a way both that \\(s_1\\) is a\nlogical consequence of \\(\\sigma_1\\) and that \\(s_2\\) is a logical\nconsequence of \\(\\sigma_2\\). Nevertheless, Bolzano argues, there is an\nessential difference between the two examples insofar as \\(\\sigma_1\\)\nis the \\(_{}\\)objective ground for \\(s_1\\), and \\(s_1\\) is\ntherefore entailed by \\(\\sigma_1, _{}\\)whereas this is not\ntrue for \\(\\langle \\sigma_2, s_2\\rangle\\) (WL II, 192 f., 340, WL IV,\n580 f., Bolzano 1975, 81 f.).\n\nb) Inferring in virtue of Entailment: In inferring \\(s_1\\)\nfrom \\(\\sigma_1\\) we show why \\(s_1\\) is true, whereas in\ninferring \\(s_2\\) from \\(\\sigma_2\\) we merely show that\n\\(s_2\\) is true, as it was already formulated by Aristotle\n(Analytica posteriora I, chap. 13) to whom Bolzano refers\nback in this context again and again (cf., e.g., WL II, 341, WL IV,\n15, 262). Hereby, however, we quietly switch from inferences in\nthemselves, represented by \\(\\langle \\sigma_1, s_1\\rangle\\) and\n\\(\\langle \\sigma_2, s_2\\rangle\\), to the corresponding mental\nprocesses of inferring, represented by \\(\\langle \\mu_1, m_1\\rangle\\)\nand \\(\\langle \\mu_2, m_2\\rangle\\), respectively, where the judgement\n\\(m_1\\) (grasping \\(s_1)\\) or \\(m_2\\) (grasping \\(s_2)\\),\nrespectively, is inferred from the set of judgements \\(\\mu_1\\) (whose\nmembers grasp the members of \\(\\sigma_1)\\) or \\(\\mu_2\\) (whose members\ngrasp those of \\(\\sigma_2)\\), respectively. Since in our example\n\\(m_1\\) as well as \\(m_2\\) is a true judgement or an act of knowledge\n(an Erkenntnis, as Bolzano calls it), \\(\\mu_1\\) as well as\n\\(\\mu_2\\) are reasons or grounds of knowledge\n(Erkenntnisgründe) for \\(m_1\\) or \\(m_2\\), respectively.\nWhereas \\(\\mu_2\\) is a mere ground of knowledge\n(bloßer Erkenntnisgrund) for \\(m_2\\), however,\n\\(\\mu_1\\) is an objective ground (objektiver Grund)\nfor \\(m_1\\). Strictly speaking, however, \\(\\mu_1\\) and \\(\\mu_2\\) are\nnot grounds at all, but rather causes of \\(m_1\\) and\n\\(m_2\\), respectively, as Bolzano specifies in WL III, 231 (see also\nWL II, 304, 340 f., 365, WL III, 267). Bolzano calls the inference\n\\(\\langle \\mu_1, m_1\\rangle\\) an objective proof (objektiver\nBeweis) or an objective justification (objektive\nBegründung), while he calls the inference \\(\\langle \\mu_2,\nm_2\\rangle\\) a mere subjective proof (subjektiver Beweis) or\na mere “certification” (bloße\nGewißmachung) (RW I, 6 f., WL II, 341, WL IV,\n261–263, Bolzano 1975, 83–85). Ideas quite similar to\nthese can be found in discussions on the concept of scientific\nexplanation within modern philosophy of science (cf., e.g., Wolfgang\nStegmüller, Probleme und Resultate der Wissenschaftstheorie\nund Analytischen Philosophie, Vol. 1, Heidelberg-New York:\nSpringer, 193, Adolf Grünbaum, Philosophical Problems of\nSpace and Time, New York: Alfred A. Knopf, 309 f., or M. Scriven\n“Explanation and Predication in Evolutionary Theory”,\nScience 130 (1959), 477–482, cf. 480). Although only\nobjective proofs are strictly scientific proofs for Bolzano (RW I, 7,\nWL IV, 261–263), his definition of a scientific textbook does\nnot require that its proofs must be strictly scientific (WL I, 4, WL\nIV, 10 f., 15, 32). The duty to present objective proofs can be\nrecognized, however, according to Bolzano from his concept of a\nscience (WL IV, 10; cf. also WL IV, 32–34). \n\nThe argument \\(\\langle \\sigma_2, s_2\\rangle\\), mentioned before,\nprovides us with an instance of a proposition \\(s\\) being a logical\nconsequence of a set \\(\\sigma\\) of propositions without being entailed\nby \\(\\sigma\\). Can a proposition \\(s\\) also conversely be entailed by\n\\(\\sigma\\) without being a logical consequence of \\(\\sigma\\)? Bolzano\nguesses that this is possible but he is not definite about it (WL III,\n346–348). The two relations are clearly distinct from one\nanother anyway, since the entailment relation is — unlike the\nrelation of logical consequence — asymmetrical and\nirreflexive.\n\nc) Entailment in various Areas of Knowledge: Whenever Bolzano\ntouches on the topic of entailment, he introduces it by examples such\nas those mentioned above, viz. \\(\\langle \\sigma_1, s_1\\rangle\\). In\nthese examples, what is described by \\(\\sigma_1\\) is the cause of the\nphenomenon described by \\(s_1\\). The entailment relation is not\nrestricted, however, to these cases where it mirrors causality of our\nreal world on the level of propositions in World 3; for Bolzano there\nare also obvious examples of the entailment relation in mathematics\n(e.g., RW I, 160 f., WL II, 191 f., 350, 361, 368, WL IV, 34, 262 f.,\n448, Bolzano 1841, 106 f., Bolzano 1842, 433, Bolzano 1975, 82),\nethics (e.g., WL II, 339, 348, 359, 361), metaphysics (e.g., WL II\n354, WL IV, 33) and theology (e.g., RW I, 6 f., 13, WL II, 354, 361,\n368). Although the majority of examples Bolzano gives for the\nentailment relation in WL are taken from natural sciences, he himself\nworked for much of his life, with great originality and success,\ninspired by the search for strict entailment proofs of major results\nin mathematics.\n\nd) Entailment and Proof Theory: The idea of using the concept\nof entailment and of developing it further emerged for Bolzano\noriginally, in fact, in connection with his mathematical studies. He\ncriticised in his first publication (Bolzano 1804) some classical\nproofs for the theory of triangles and parallels for using\ninappropriate concepts such as motion and the plane. With hindsight we\ncould say he thought such proofs could not express the entailment\nrelations needed to give the objective grounds for the propositions to\nbe proved and that they are therefore not — as they sould be\n— objective justifications but merely subjective proofs or\ncertifications. The motivation of searching for such objective proofs\nin many areas of mathematics led to many original and fruitful\nconcepts not appreciated, or re-discovered, until many decades later.\nNo wonder then that Bolzano developed special rules for the relation\nof entailment in cases where it obtains between (sets of)\nconceptual propositions (Begriffssätze) as in\nmathematics and metaphysics: if a proposition \\(s\\) is a member of the\nset \\(\\sigma\\) which is the objective ground of a conceptual\nproposition \\(s', s\\) must not contain more conceptual parts than\n\\(s'\\) (WL II, 384); when Bolzano says “not more”,\nhowever, he means rather “no other simple concepts than those\ncontained also in \\(s\\)”. \n\nThe relation of entailment between (sets of) conceptual truths has the\ncharacteristic feature that, according to it, from the smallest number\nof premisses the largest number of conclusions will follow none of\nwhich has simple components which are not also contained in its\npremisses (WL II, 386). Ideas such as these sound akin to Gerhard\nGentzen’s characterization of normal proofs: “They do not\nmake a detour. They do not introduce concepts which are not contained\nin its final result and must therefore be used necessarily in order to\nget it” (Gerhard Gentzen, “Untersuchungen über das\nlogische Schliessen”, Mathematische Zeitschrift 39,\n1934/35: 176–200, 405–431, see p.177). It has been pointed\nout, therefore, by several commentators, that there are interesting\nparallels between Bolzano’s semantic notion of entailment and\nGentzen’s syntactic concept of “normal proofs” (cf.\nBuhl 1958, 85 f., Berg 1962, 151–164, and, more recently,\nRumberg 2012), and that Bolzano in a certain sense anticipated\nGentzen’s Hauptsatz (Berg 1987, 41). (In Schröter\n1955, 60–61, 85–86, and Schröter 1958, 32–34,\nGentzen’s consequence relation is compared with Bolzano’s\nrelation of Ableitbarkeit, but, unfortunately,\nBolzano’s relation of entailment (Abfolge) is not taken\ninto consideration in this context by Schröter.)\n\nIn spite of a certain lack of clarity in Bolzano’s explication,\nit is obvious that his concept of entailment is of great relevance not\nonly for the philosophy of the empirical sciences but also with\nrespect to proof theory. It is hard, however, to see how to reconcile\nthe characteristic features of the entailment relation in its\napplication to causality (in the empirical sciences) with those in its\napplication to proof theory.\n\ne) Entailment and Grounding: Also the recent philosophical\n“movement” on grounding has an obvious affinity to\nBolzano’s theory of entailment, as witnessed by numerous\npublications such as Schnieder & Correia 2012, Rumberg 2012, or\nRoski 2017. \n5. Ethics\n\nIn addition to his trail blazing works in logic, Bolzano made valuable\ncontributions to other subdisciplines of philosophy, in\nparticular to ethics. Ethical considerations entered, to be\nsure, into various works of Bolzano, especially of course into the\nones concerning the science of religion, but also (which is perhaps to\nbe expected less) into his logical works. These ethical considerations\nof Bolzano were, however, never published together. \n5.1 Critique of Kant’s Categorical Imperative\n\nBolzano’s main objection against the Categorical Imperative was\nthat we cannot derive from it alone — as Kant supposed —\nwhether a given act ought to be done or not. Kant’s instruction\nto ask ourselves of a maxim whether we can will without contradicting\nourselves that it should become a universal law is of no use,\naccording to Bolzano, since for him there is no practical proposition\nor ought proposition whose contradictory opposite is\nself-contradictory. This, however, is not a decisive argument against\nKant’s Categorical Imperative for several reasons. Nevertheless,\nBolzano refused to accept the Categorical Imperative strictly and\nreplaced it with the utilitarian principle of “the advancement\nof the general welfare”, as he proudly reports in his\nautobiography (Bolzano 1836, 23).\n5.2 Bolzano’s Supreme Moral Law\n\nThe supreme moral law that Bolzano put in place of Kant’s\nCategorical Imperative was by no means original. Bolzano, however,\nmodified and justified it in an original way and consistently applied\nit to many different areas. By the supreme moral law Bolzano means\n“a practical truth [i.e., a true ought proposition] from which\nevery other practical truth […] can be derived\nobjectively, i.e., as the consequence from its\n‘ground’” (RW I, 228; cf. also RW I, 44, 244, 256,\nRW IV, 27, 217, 221, and WL II, 348, WL IV, 178). Thus, on the basis\nof the asymmetry of Bolzano’s entailment relation\n(Abfolge), the supreme moral law must be an ought proposition\nthat does not objectively follow from (i.e., it is not entailed by)\nany other ought proposition. It must therefore be a basic truth, i.e.,\na truth that does not have an objective “ground”,\nbut can only \\(be\\) an objective “ground” of other\n(practical) truths (WL II, 375, RW I, 229, RW IV, 207).\n\nBolzano’s supreme moral law consists in the utilitarian\nrequirement of advancing the general welfare (RW IV, 206, 227, 236;\nBolzano 1836, 23, 43; WL IV, 26 f., 178). Briefly, this supreme moral\nlaw is formulated thus: “Strive to bring about the greatest\namount of happiness” (RW I, 250), or: “Always act as the\nbest for all or the welfare of the whole demands” (RW IV, 216,\nalso 218, 221, and 229). On the basis of careful considerations,\nBolzano arrives at the following definitive version of his\nsupreme moral law: \n\nAlways choose from all actions that are possible for you the one\nwhich, all consequences considered, most advances the welfare of the\nwhole, in whatever parts (RW I, 236; cf. WL IV, 119).\n\n\nBolzano specifies the content of the thus obtained formulation of the\nsupreme moral law in several respects (RW I, 235). His explanations\nexhibit a remarkable awareness of problems. Thus, he points out that\nall sentient beings are equal and must be equally involved in the\nincrease of happiness or decrease of suffering (RW I, 235). The\naddendum that this goes for beings “for whom there are no\nvarying degrees of virtue” indicates that Bolzano would allow\nfor certain distinctions in the case of beings which are capable of\nbeing virtuous (and for which there are consequently also differences\nof degree in regard to kinds of happiness which other beings cannot\nappreciate). The capacity of being virtuous is therefore — no\nless than sentience — a morally relevant quality for him. In\nthis Bolzano agrees with considerations in contemporary ethics,\naccording to which the quality of personhood is, in addition to\nsentience, morally relevant.\n\nBolzano stresses that, in assessing an action according to the\nprinciple of advancing the general welfare, one must “not only\nlook at its proximate consequences, but also at further ones”\n(RW I, 237). Since we can never know all the consequences of an\naction, the principle of advancing the general welfare demands that we\nalways decide in favor of the action which seems most conducive to the\nwelfare of the whole according to those consequences thereof which\nwe can foresee arising from it (RW I, 241). With a similar\nargument Bolzano replies to the objection that according to his\nprinciple the moral value of our actions would depend on mere\nchance, as the following example seems to show: “If someone\nwith the intention of killing his neighbor drew a dagger against him,\nbut accidentally only opened a boil and this were now healed thereby,\nhe would have performed a good work”. This view, however, rests\non a misunderstanding, according to Bolzano, since for him “the\nmoral goodness of an action (i.e., its claim to being\nrewardable) is always a matter of whether the action has been\nundertaken with a view to agreeing with the law” (RW I,\n240).\n5.3 Bolzano’s Ethics as a “Mixed” Normative Theory\n\nBolzano developed his ethics in explicit opposition to Kant’s\nmoral philosophy. Nevertheless, Bolzano’s ethics contains also\nessential elements of Kantian ethics, and there is even a basic\ncoincidence between Bolzano’s and Kant’s ethics. The only\nthing that can be regarded as good without qualification, according to\nKant, is a good will (Grundlegung zur Metaphysik der Sitten,\n1785, 1). Yet (as we will see in section 5.4), it is a basic postulate\nof Bolzano’s deontic logic that an ought always primarily refers\nto a willing: You ought to will to act such that the welfare\nof the whole, due to the consequences foreseeable by you and intended\nby your action, undergoes the greatest possible advancement among all\npossible alternative actions. Bolzano himself infers from this: The\nsupreme moral law demands “properly only a willing, not the\naccomplishment” (RW IV, 207).\n\nWhat is primarily judged as obligatory or forbidden is not the act,\nbut a willing or decision, as Bolzano emphasizes. An action that is\nwilled must thus be assessed according to those consequences which the\nagent thereby intends or wills to achieve: For an\naction to be morally good it is not enough, as we have already seen\n(at the end of section 5.2), that it is in accordance with the moral\nlaw, but it must be undertaken also with the intention for it\nto be so (RW IV, 266), i.e., due to the moral law (RW IV,\n269). In this manner Bolzano abandons the scope of the purely\nconsequentialist position which claims that the moral assessment of an\naction or of the willing-an-action as being obligatory, permissible or\nforbidden depends solely on its consequences. Bolzano’s\nutilitarianism is consequently not a purely consequentialist normative\ntheory, but rather a mixed theory. In presenting such a mixed\nethical theory, Bolzano came already close to a modern conception of\nethics (such as, e.g., that outlined in William K. Frankena’s\nEthics, 2nd edition, 1973, 43 ff.) which is very common\nwithin today’s applied ethics.\n5.4 Bolzano’s Deontic Logic\n\nBolzano developed a particular logic for ought propositions which\n— without today’s formalism — comes already close to\nmodern deontic logic in certain respects. The primitive form of an\nought proposition is \\([A\\) — has — an ought of \\(X]\\) or,\nmore accurately, \\([A\\) — has — an ought to will to do\n\\(X]\\) (WL II, 70; slightly different in RW I, 228). The concept\n[ought] is simple (WL II, 69, WL IV, 489), but its usage underlies\ncertain principles stated explicitly by Bolzano:\n\n\n(P1)\n It is not the case that \\((A\\) ought to will to do \\(X\\) and\n\\(A\\) ought not to will to do \\(X)\\). \n\n(P2)\nIf \\(A\\) ought to will to do \\(X\\), then \\(A\\) is permitted to\nwill to do \\(X\\). \n\n(P3)\nIf \\(A\\) ought to will to do \\(X\\) and \\(A\\) ought to will to do\n\\(Y\\), then \\(A\\) ought to will to do \\(X\\) and \\(Y\\). \n\n(P4)\nIf \\(A\\) ought to will to do \\(X\\), then \\(A\\) can will to do\n\\(X\\). \n\n(P5)\nIf \\(A\\) ought to will to do \\(X\\) and willing to do \\(X\\)\nentails willing to do \\(Y\\), then \\(A\\) ought to will to do\n\\(Y\\). \n\n\n(P1) is a deontic principle of non-contradiction (RW IV, 264 f.); (P2)\nis the principle that “ought implies permitted” (RW I,\n236); (P3) is a kind of combination principle for ought (RW I, 229\nf.); (P4) is the “ought implies can” principle (RW I, 230,\n257, RW IV, 214, and WL II, 348); and (P5) is a deontic entailment\nprinciple (RW I, 229, WL II, 339, 348).\n\nWhen it comes to the question of how to interpret ought sentences,\nBolzano — like most of his contemporaries — was obviously\nnot aware of the fundamental problem involved in this question.\nBolzano took ought sentences in his standard formulation without\nfurther ado as expressions of propositions, and he took it therefore\nfor granted that they are true or false in the usual sense of these\nwords, as explained by his definitions of truth and of falsity. He\nthus clearly held a cognitivist metaethical position, probably even a\nnaturalistic one, using his utilitarian principle as a meaning\npostulate for ought sentences. In support of this understanding of\nBolzano’s position, it can be put forward that Bolzano\ninterpreted also other kinds of linguistic sentences in a simple\nnaturalistic way. Even questions, e.g., are interpreted by Bolzano not\nas sentences expressing a wish for information but as\ndescribing such a wish and therefore being true or false in\nthe usual sense of these words (WL I, 88, WL II, 71–76,\n194–196).\n\nThe most important field in which Bolzano applied his ethical views\nwas political and social philosophy. Before we switch to this topic\n(in section 7) we will deal with Bolzano’s aesthetics. \n6. Aesthetics\n\nBolzano published two treatises in aesthetics: “On the Concept\nof the Beautiful” (Bolzano 1843b) appeared while he was alive,\nwhile the other one, entitled “On the Division of the Fine\nArts” (Bolzano 1849b), was presented by him in the Royal\nBohemian Society of Sciences in 1847 but was published only\nposthumously.\n\nIn the first of these two aesthetic essays Bolzano proposes the\nfollowing definition of the concept of the beautiful:\n\nThe beautiful must be an object whose contemplation can give to all\nhuman beings properly developed in their cognitive faculties a\npleasure, and the reason for this is that, upon apprehending some of\nthe object’s properties, neither is it too easy for them nor\ndoes it cause for them the effort of distinct thinking, to form a\nconcept of this object which allows them to guess the other properties\nthat are apprehended only by further contemplation and thereby gives\nthem at least an obscure intuition of the proficiency of their\ncognitive faculties (Bolzano 1843b, 27 and 30).\n\n\nIt is hard to see how, according to this definition, there could be\nbeautiful objects if there did not exist certain human dispositions;\nand, obviously, there can be human dispositions only if there are\nhuman beings. Bolzano’s definition seems therefore to make\nbeauty ontologically dependent on the existence of human beings as\npossible beholders of beautiful objects. This makes Bolzano’s\naesthetics in a certain sense subjectivist. By taking Bolzano’s\ndefinition to be a conditional definition in today’s sense, we\ncould avoid this consequence; but in this case beauty would not be\ndefined for a world without human beings, and in such a world there\nwere no beautiful objects. Bolzano himself, however, did not draw such\nconclusions from his definition, but quite on the contrary: He claimed\nexplicitly that there would be beautiful objects in the world even if\nno human being existed (Bolzano 1843b,  67). Be that as it may,\nBolzano does by no means advocate an extreme form of subjectivism in\naesthetics. For him, the beauty of an object depends also, and even\nprimarily, on certain inner properties, in particular on certain\nregularities of the object itself which give rise to its possible\neffects on the beholders. This puts Bolzano’s basic aesthetic\nview in a middle position between extreme subjectivism and extreme\nobjectivism. In any case, Bolzano’s essay on the concept of the\nbeautiful includes a quite subtle psychological analysis of phenomena\nthat are relevant for aesthetics and play an important role in\ntoday’s aesthetic research.\n\nIn his second aesthetic treatise (Bolzano 1849b), Bolzano explains his\nunderstanding of fine arts and of works of fine art, and he presents a\nclassification of fine arts based on an ontological analysis of the\nworks of fine art.\n7. Political and Social Philosophy\n\nIn a series of writings Bolzano was concerned also with political,\nsocial, national, economic questions and generally with philosophy of\nstate. The central one of these writings was no doubt his\n“booklet” On the Best State (Bolzano 1932).\nTherein he summarized his political philosophy systematically and\ndeveloped his conception of an ideal state. For Bolzano, the main\nquestion to be answered in this connection is: How can we eliminate or\nat least reduce human suffering and evil in the world most\neffectively? It was the question which, according to Bolzano’s\nown statement, occupied him with the greatest frequency, intensity and\nenthusiasm above all others (Bolzano 1932, III). Some suffering of\nhuman beings and some evil in the world are unavoidable, due to our\nfinite nature, and therefore cannot be excluded even in an ideal state\nwith optimal arrangements. Much suffering and evil, however, could be\nprevented by means of expedient political arrangements (Bolzano 1932,\n3 f.). It is the fault of poor arrangements in all civil constitutions\nthus far, according to Bolzano, that the human condition is so\ndeplorable. In On the Best State, Bolzano therefore devotes\nhimself to the question as to how a state would have to be most\nexpediently arranged or how a perfect state would have to look\n(Bolzano 1932, V, 1). The leading principle that Bolzano applies in\nanswering this question is his supreme moral law: The political\narrangements are to be made in such a manner that the general welfare\nor virtue and happiness are all advanced as far as possible (Bolzano\n1932, III, 7 f.). From it he tried to derive all the rules and\nregulations needed in a well-organized state.\n\nIn 28 chapters Bolzano describes how the best state looks and\ntherefore also how the currently existing states should be\narranged. In these chapters Bolzano treats the following topics: 1.\nthe citizens of the state, its size and its divisions; 2. legislation;\n3. government; 4. compulsory institutions; 5. liberty; 6. equality; 7.\nfreedom of thought and of religion; 8. education and instruction; 9.\ncare for health and for life; 10. property; 11. money; 12. occupations\nand life styles; 13. productive activities; 14. trade; 15. scholars;\n16. books and censorship; 17. fine arts; 18. nourishment; 19.\nclothing; 20. housing; 21. gender specific institutions; 22.\nsatisfaction of the pursuit for honor; 23. travels; 24. enjoyments;\n25. disputes among citizens; 26. taxes and state expenditures; 27.\nrewards and punishments; 28. death.\n\nA mere comparison of the chapters in terms of their size is revealing:\nThe longest chapter by far is the tenth, concerning property, followed\nby the chapter on taxes and state expenditures and the chapter on\nrewards and punishments. From this it is clear that the unequal\ndivision of possessions was Bolzano’s greatest concern; it was\nfor him the main root of evil, which was to be removed by means of a\njust redistribution. Bringing about a certain equality regarding the\nrights and duties of citizens is an important concern for Bolzano. How\nlittle Bolzano cares for the principle of liberty, however, becomes\nmanifest already by the fact that the chapter on liberty is the second\nshortest chapter in his booklet (the shortest being the one on\ntravelling). The constitution of Bolzano’s best state turns out\nto be a very ambivalent mixture of regulations which make an\nimpression of being very progressive with respect to the desired\nequality for the citizens, but extremely objectionable with respect to\nthe liberties conceded to them. \n\nBolzano did not shy away from taking up also practical problems in\npublications and writing about them, for instance, about the\nimprovement of poorhouses and about the elimination of misery and\npoverty in the population of Prague. Bolzano treated these and many\nother questions of practical relevance also in his “edifying\naddresses” (Erbauungsreden), of which the first\ncollection was published already in 1813 (in a second edition 1839),\nand five volumes were published posthumously. The first volume of the\ncomplete critical edition of all of Bolzano’s\nErbauungsreden appeared in 2007 (Bolzano 2007a).\n8. Philosophy of Religion and Theology\n\nIn questions concerning the science of religion and theology, Bolzano\nexhibited views with which he was in part far ahead of his time and\nwhich sound very current at present. It is no wonder that he\nencountered rejection and resistance on certain points in which his\ndeparture from the church doctrine at that time was too great.\n\nBolzano’s main work in theology is his four volume Textbook\nof the Science of Religion, which was published in 1834 by his\npupils — without any mention of the author — from their\nvery deficient lecture notes (much to Bolzano’s displeasure).\nWhat is meant by ‘science of religion’ (also\n‘philosophy of religion’ or ‘philosophical doctrine\nof religion’), according to Bolzano, is the “science of\nthe most perfect religion” (RW I, 3). Here Bolzano presupposes a\nconcept of religion that is, to be sure, interesting, but not\nunproblematic from the Catholic standpoint. Bolzano starts with\nreligion in the subjective sense, i.e., the religion of a person; this\nis, according to Bolzano, the set of religious opinions of this\nperson. The content or “material” (Stoff) of a\nreligion in the subjective sense is a religion in the objective sense.\nThus, a religion in the objective sense is a set of propositions which\ncan be grasped (in the sense of \\(\\mathbf{G}\\) as explained in section\n4.1) by a religion in the subjective sense. Bolzano’s concept of\nreligion is consequently based on his definition of religious\npropositions or religious opinions: A proposition (and analogously\nalso a subjective proposition or a judgment, an opinion etc.) is on\nBolzano’s view religious iff it is both (generally)\nimportant and moral. A proposition is (generally) important\niff it generally exerts influence on our virtue and happiness (RW I,\n51 f.); and a proposition is moral iff “there is in the\nnature of man a reason for the temptation, without being justified in\nthis, to acknowledge it either as true or as false” (RW I, 58).\nThus, as a summary of Bolzano’s definition of the concept of\nreligion in the subjective sense, the following may be stated: The\nreligion of a person is “the collection of all those opinions of\nthis person which manifest either an advantageous or a disadvantageous\ninfluence on his virtue or his happiness and are at the same time such\nthat there was a special temptation, without any sufficient reason, to\ndecide either in favor of or against them” (RW I, 60 f.).\n\nClosely connected with this concept of religion is Bolzano’s\nview that many doctrines of the Christian religion, e.g. the doctrine\nof the descent of all human beings from a single parental couple or\nthe doctrine of original sin, are only metaphorical in character.\nOriginal sin is for him not real sin, but rather it bears\nthis name only insofar as it has its origin in Adam’s sin and\ninsofar as it displeases God (RW IV, 47 f.). As regards the question\nof descent, what is of importance in this doctrine is not its truth\nbut only that all human beings are essentially equal in such\na way as if they had descended from one and the same parental couple,\nwhereas it does not matter whether they are also really descendent\nfrom only a single couple (RW IV, 17). The image of the common descent\nof all human beings is, independently of its truth content, very\nimportant “in order to maintain the sentiments of brotherly love\namong us” (RW IV, 18).\n\nHere Bolzano’s non-cognitivist (i.e., emotive and directive)\ninterpretation of religious language is especially clear. This\nconception goes back to the key experience in his religious\ndevelopment, whereby he was able to overcome his religious doubts, and\nwhich essentially influenced his decision to become a priest: From\nMarian Mika, his professor in pastoral theology, he came to the\nconviction that a religious doctrine is justified, independently of\nits truth content, only insofar as the belief in it is morally\nadvantageous.\n\nA question in regard to which Bolzano adopted an especially\ninteresting position was the problem of miracles. According to the\ntraditional view, they are supernatural events or even immediate\neffects of God. Sometimes this is understood in the sense that\nmiracles are events which are not explainable by means of the laws of\nnature or even incompatible with these laws. This view, however, has\nto face serious problems as Bolzano has painfully made clear (cf. RW\nI, 422–439, especially 424–436). Bolzano rejects these\ndefinitions mainly for the following reason: “If by the laws of\nnature one here meant laws a priori, no divergence from them\nwould be possible; if, by contrast, one meant empirical laws of\nnature, a departure from these is nothing but what has been called an\nunusual occurrence” (RW I, 436). Being an\n“unusual occurrence” is on Bolzano’s own view a\nnecessary (though not a sufficient) characteristic of a miracle (RW I,\n437). An unusual event, however, is simply an event that is improbable\n(RW II, 68), hence an event whose intrinsic probability is \\(\\lt\n\\bfrac{1}{2}\\) (Bolzano 1838, 383). It can happen, however, that in\nevery possible explanation for a fact certain unusual events would\nhave to be presupposed, and that in such a case the assumption of a\nmiracle, of which we receive a report, is the least improbable and\nconsequently the most probable explanation (RW II, 69). Such\ncircumstances do not, however, detract from the divinity of miracles\nand revelation but rather can have certain advantages, for these\nmiracles thus become credible (RW I, 441 f.).\n\nA careful treatment of this problem therefore requires bringing into\nplay considerations of probability theory. This makes understandable\nwhat could otherwise be seen as very strange for a theological\ntextbook: Bolzano’s Textbook of the Science of Religion\ncontains a section on mathematical probability theory (RW II, 39 ff.).\nHowever, also the choice of certain examples and the focus on certain\nmethodological questions in The Theory of Science can better\nbe understood if one sees that they are theologically motivated. Quite\ninteresting in this respect are Bolzano’s investigations into\nthe discovery and credibility of testimonies and into the degree of\ncredibility of a proposition with respect to testimonies that are in\nfavor of it as well as of testimonies against it (WL III,\n555–568); he used these investigations as a basis for his theory\nof the divine revelation. The special treatment of proofs,\n“which are only to show that the probability of a proposition\nexceeds a given magnitude” (WL IV, 294–296), is closely\nconnected with the topic of miracles: In order to prove that an event\n\\(E\\) is an unusual event and thus qualifies to be a miracle, one must\ndemonstrate that the intrinsic probability of the assumption that\n\\(E\\) has not occurred is \\(\\gt \\bfrac{1}{2}\\) and therefore exceeds a\ncertain magnitude. The specification of a particular degree of\nprobability, however, is not required for this. Bolzano’s\ndigression into probability theory in his Textbook of the Science\nof Religion and his careful use of probability theory in the\ndiscussion of miracles are obviously directed towards arguments\nbrought forward by David Hume, although Bolzano does not mention his\nname in this context.\n\nTwo questions discussed during Bolzano’s time and once again\ntopical at present are those concerning the indissolubility of\nmarriage and concerning celibacy. Bolzano advocated the\nindissolubility of marriage without restrictions or\nexceptions (RW IV, 356 ff.). This, however, is not an article of faith\nbut merely a disciplinary prescription of the Catholic Church that is\nsubject to change, as he points out in other writings (Bolzano 1813,\n221, Bolzano 1845, 98, 374). This view even allows in certain cases,\ne.g., in the case of demonstrated adultery, the annulment of a\nmarriage (Bolzano 1845, 98, 374, Bolzano 1932, 101). Bolzano’s\nposition regarding celibacy bore the stamp of his own\nexperience which he quite openly depicts in his autobiography (Bolzano\n1836, 25). While Bolzano earlier (in RW IV, 371, 388 f.) expressed\nhimself cautiously concerning celibacy (that he has not yet adopted a\ndefinitive opinion about it), he later explicitly favors the\nelimination of celibacy (in Bolzano 1845, 93 f., 258, 367) and\ndeclares celibacy to be “harmful and inappropriate” (cf.\nFesl’s note in Bolzano 1836, 94 f.).\n9. Metaphysics\n\nBolzano’s most important metaphysical doctrines are found in his\nAthanasia (Bolzano 1827), in the Paradoxes of the\nInfinite (Bolzano 1851), and in his writings that he left\nunpublished; Bolzano’s pupil Příhonský,\nmoreover, gave an exposition of Bolzano’s Atomism\n(Příhonský1857). Athanasia was first\npublished anonymously (in 1827), its second edition appeared in 1838\nwith a statement of authorship. Its full title “Athanasia or\nReasons for the Immortality of the Soul” makes clear that the\nbook pursues a theoretical goal. Bolzano combines with this\ntheoretical goal of the book a practical purpose as well; it is also a\n“book of consolation” or (as the subtitle of the second\nedition says) “a book for every educated person who wants peace\nof mind regarding this matter”.\n\nFrom traditional metaphysics Bolzano adopts the doctrine that\neverything real is either a substance or an adherence (cf. Schnieder\n2002). Substances are either themselves simple or composed of simple\nsubstances; simple substances (i.e., monads, according to Leibniz) are\ncalled ‘atoms’ by Bolzano. The soul is a simple substance.\nBolzano attempts to prove that no simple substance can begin or cease\nto be (in time). This attempt at a proof on Bolzano’s part,\nhowever, is deficient, as he himself observed. From this brief sketch\nit is already evident that Bolzano’s metaphysical views bore a\ndefinite stamp from the tradition, especially from Leibniz. In\ncontrast with Leibniz’s doctrine of the\n“windowlessness” of the monads and of the pre-established\nharmony that this requires, however, Bolzano assumes an interaction\namong the finite atoms or monads. (Cf. Bolzano 1827, 48–50, 67,\n92 f., 114 f., 2nd edition: 421, 441; Bolzano 1851, reprint 1975: 112\nf., 118, E: Russ 2004, 666 f., 670; Příhonský 1857,\n7.)\n\nEvery attribute of a real object is itself something real. An\nadherence is an attribute of something real, i.e., of a substance or\nof another adherence. The adherences of a human being or of a mind\nmust therefore themselves belong to World 2 or World 1. They are\ntherefore particulars and not universals. This view is supported by\nBolzano’s claim that each “private” mental\nphenomenon, such as a feeling, a desire, a volition or a thought\n(i.e., a subjective idea or a subjective proposition), is an attribute\nof the individual mind that “has” it, where\n‘has’ expresses the copula (WL II, 69). It is a particular\nattribute of an individual (or, in today’s terminology, a trope)\nthat cannot be shared by any other individual: if both, \\([A_1\\) has\n\\(b]\\) and \\([A_2\\) has \\(b]\\), are true and \\(b\\) is a subjective\nidea or any other mental phenomenon, then \\(A_1\\) must be identical\nwith \\(A_2\\). Bolzano’s theory of propositions, however, conveys\nthe impression that attributes are universals. For in the standard\nexamples he gives for a true proposition \\([A\\) has \\(b]\\), the\nattribute \\(b\\) is a universal, such as erudition, that can be shared\nby different objects (WL I, 130). Obviously, we must admit that some\nof Bolzano’s attributes are universals and others are\nparticulars. In this case, however, the word ‘has’, which\nexpresses the copula of each proposition according to Bolzano, is used\nambiguously by him.\n\nBolzano connected his metaphysical views with the physical doctrines\nof his time (see section 10). Nevertheless his metaphysical doctrines\nstrike us — at least at first glance — as rather backward.\nThis reproach seems to be justified with respect to the\nAthanasia. In his other writings (in particular in his\nTheory of Science), however, Bolzano developed quite modern\nmetaphysical ideas that come close to views of today’s analytic\nontology (cf. Berg 1992) and mereology (cf. Krickel 1995). For\nexample, according to the analysis of propositions that Bolzano\ndeveloped in his theory of science, a time qualification is required\nin the subject idea of every proposition whose subject (i.e., the\nobject of its subject idea) is a real thing (WL I, 113, 202, 364 f.,\nWL II, 15). This condition is required in order to avoid\n“Hegelian” contradictions in cases where the object the\nproposition is about (i.e., its subject) undergoes a change. Sometimes\nBolzano restricts this requirement to propositions in which a\nnon-permanent property is attributed to a changeable substance (WL II,\n239), since this is sufficient for avoiding the aforementioned\ncontradictions. Due to this proposal, the proposition [Cajus at time\n\\(t_1\\) has erudition] and the proposition [Cajus at time \\(t_2\\) has\nlack of erudition] can both be true as long as \\(t_1\\) and \\(t_2\\) are\ndifferent; for if \\(t_1\\) is different from \\(t_2\\), then the ideas\n[Cajus at time \\(t_1\\)] and [Cajus at time \\(t_2\\)] have different\nobjects (WL I, 202, 365). These remarks indicate that Bolzano\nconceived of changeable substances such as Cajus as four-dimensional\nobjects, extended in space and time. An idea such as [Cajus at time\n\\(t_1\\)] can pick out a time slice of the four-dimensional Cajus; such\na time slice or momentary object as Cajus at time \\(t_1\\) is also an\nobject for Bolzano, but ontologically it is secondary. Considerations\nsuch as these result in Bolzano’s proposal to use this property\nfor the definition of time: Time is for Bolzano the condition or\nqualification that is required in order to make a proposition about a\n(changeable) real object true or false (WL I, 365).\n10. Philosophy of Nature and of Physics\n\nIt is but a small step from some of Bolzano’s rather traditional\nmetaphysical views into the realm of the philosophy of nature and of\nphysics. Bolzano introduces a force of attraction among substances\n(Bolzano 1827, 48) and later also a force of repulsion (Bolzano 1851,\nreprint 1975: 121, 123 f., E: Russ 2004, 671 f., 673). For the force\nof attraction Bolzano attempts to prove the Newtonian law that it is\ninversely proportional to the square of the distance (Bolzano 1827,\n50, Bolzano 1851, reprint 1975: 121 f., E: Russ 2004, 671 f.), and\nfurther that the force of attraction of two substances is related\nproportionally to the set (i.e., presumably, to the product of the\nnumbers) of atoms contained in these substances.\n\nStarting from these metaphysical questions concerning the foundations\nof physics, Bolzano then occupied himself in several works also with\nconcrete questions in natural science (e.g. in Bolzano 1842,\n1843c, and 1851), and in particular with physical and\nastronomical questions. Although he was not able to aim at\nnew and enduring results in these areas, his writings nonetheless show\nthat he was also seriously occupied with such questions and could be\n“conversant” in the status of these disciplines during his\nday. To be mentioned here are especially his work on the composition\nof forces (Bolzano 1842) and two essays in the Annals of Physics\nand Chemistry, in which he was concerned with the writings and\ntheories of Christian Doppler (Bolzano 1843a and 1847). A summary of\nBolzano’s contributions to the philosophy of nature and to\nphysics can be found in Berg 2003.\n11. Philosophy of Mathematics\n11.1 Early mathematical works\n\nBolzano began his mathematical investigations with a work in geometry\n(Bolzano 1804) and continued with publications in the area of\nanalysis. He essentially formulated the modern criterion of\nconvergence in his Purely Analytic Proof (Bolzano 1817, 11\nf.) already four years prior to Cauchy’s Course\nd’analyse (1821). This work already contains the so-called\nBolzano-Weierstrass theorem, which again occurs in Bolzano’s\nposthumously edited Theory of Functions (Bolzano 1930, 28 f.,\nBGA IIA, 10/1: 47 f.). Here (Bolzano 1930, 66–70, 98 f., BGA\nIIA, 10/1: 79–82, 103) we find also for the first time an\nexample of a continuous and still non-differentiable function; for a\nlong time, Weierstrass had been regarded as the first one who\ndiscovered such functions, until historical justice was done by Karel\nRychlík’s investigations.\n11.2 Preparatory Writings in Set Theory\n\nIn his Paradoxes of the Infinite (Bolzano 1851) and in the\nTheory of Quantity Bolzano took the first steps towards the\ndevelopment of set theory and anticipated many of its important ideas.\nIn this connection mention is especially often made of Bolzano’s\ngrasp of the “paradoxical” fact that an infinite set can\nand must be equipollent with one of its proper subsets, i.e., is\n“reflexive”. This special feature of infinite sets was\nlater used for their definition by Dedekind. For Bolzano, equipollence\nand “having exactly the same kind of construction”\n(die ganz gleiche Entstehungsart haben) are taken together as\na sufficient condition for infinite sets being equinumerous or having\nthe same cardinal number. This view, however, contradicts the\nunrestricted application of the classical Euclidean principle that the\nwhole is greater than each of its parts. Bolzano was aware of this\nconflict and therefore restricted the principle to finite sets. From\nhere the step is not far to Dedekind’s view that equipollence is\na sufficient condition for equinumerosity.\n\nBolzano’s proof for the existence of an infinite set is well\nknown among mathematicians, and there are references to it even in\nCantor 1883/84, Dedekind 1888, and Russell 1903. Bolzano proves by\nmathematical induction that there are infinitely many “truths in\nthemselves”, i.e., true propositions. For the induction basis,\ni.e., that there is at least one true proposition, he uses an indirect\nproof (as shown already in section 3.3). Bolzano’s induction\nhypothesis is the assumption that there are at least \\(n\\) true\npropositions which we can enumerate as \\(S_1, S_2 ,\\ldots ,S_n\\).\nBolzano proves that there must be at least \\(n+1\\) true propositions\nby reductio again: If there were not at least \\(n+1\\) true\npropositions, i.e., if there were at most \\(n\\) true propositions,\nthen — according to the induction hypothesis — \\(S_1, S_2\n,\\ldots ,S_n\\) would be the only true propositions; but then there\nwould be another true proposition \\(S_{n+1}\\), viz. [\\(S_1,\nS_2,\\ldots\\) and \\(S_n\\) are the only true propositions], and \\(S_1,\nS_2 ,\\ldots ,S_n\\) would therefore not be the only true propositions\n(WL I, 146 f.). Bolzano proposes also a second way for proving this by\nconstructing a series of true propositions in which we add to any true\nproposition \\(S_n\\) another true proposition [\\(S_n\\) is true] that is\n(due to Bolzano’s criterion for the identity of propositions)\ndifferent from \\(S_n\\). Given any true proposition \\(S\\) whose\nexistence is proved by the induction basis, this will result in an\ninfinite series of true propositions of the following kind: \\(S\\),\n[\\(S\\) is true], [[\\(S\\) is true] is true] etc. (WL I, 147, Bolzano\n1851, § 13). In constructing this series, Bolzano uses a relation\n\\(T\\) that can be defined as follows:\n\n\\(Txy \\text{ iff } y = [x \\text{ is true}].\\)\n\n\n‘\\(Txy\\)’ is here an abbreviation for: \\(y\\) is the\nproposition that the proposition \\(x\\) is true. The relation \\(T\\) has\nthe following properties:\n\n\\(\\forall x\\exists yTxy\\) (i.e., \\(T\\) is serial)\n\\(\\forall x\\forall y(Txy \\rightarrow \\forall\nz(Txz \\rightarrow y = z))\\) (i.e., \\(T\\) is a many-one\nrelation)\n\\(\\forall x\\forall y(Tyx \\rightarrow \\forall\nz(Tzx \\rightarrow y = z))\\) (i.e., \\(T\\) is a one-many\nrelation)\n\\(\\exists x\\forall y\\neg Tyx\\)\n\n\nThe statement that a relation with the properties (1)–(4) exists\nis Alonzo Church’s infinity axiom \\(\\infty 3\\) (in\nIntroduction to Mathematical Logic, Vol. I, 1956, 343). \n11.3 New Foundations of Mathematics\n\nAll these interesting achievements of Bolzano regarding details\nnonetheless seem insignificant in view of his epochal attempt, which\nhe unfortunately could not complete, to put all of mathematics on new\nfoundations. The fact alone that Bolzano sensed the necessity of such\na new grounding of mathematics shows his mathematical instinct,\nalthough this program could only much later be realized.\n12. Metaphilosophy and History of Philosophy\n\nIn the well known work What is Philosophy? Bolzano elucidated\nhis concept of philosophy and of philosophizing and put forward his\nview of the task of philosophy (Bolzano 1849a). Philosophizing is not\nrestricted to a certain area of knowledge, according to Bolzano. As\nsoon as you ask for reasons, you are philosophizing, and this can be\ndone in any discipline, also outside of the genuine fields of\nphilosophy. Bolzano does not conclude from this, however, as later\nLudwig Wittgenstein, Moritz Schlick and Rudolf Carnap did, that there\nis no proper realm of philosophical problems and philosophical subject\nmatters. Quite to the contrary, he adhered to the traditional division\nof philosophy into subdisciplines according to the different subject\nmatters that are concerned.\n\nMoreover, Bolzano was also learned in the history of\nphilosophy; he had great historical knowledge which he injected\ninto his various works. Thus in the second edition of\nAthanasia, for instance, there is added an extensive appendix\nwith a “critical survey of the literature concerning immortality\nsince 1827”, and Bolzano’s essay on the concept of beauty\ncontains a detailed list of definitions of the concept of the\nbeautiful, which were proposed by a variety of philosophers (1843b,\n45–92); likewise the Theory of Science contains in the\nnotes a wealth of historical material, which makes it a great source\nfor the historian of logic.\n13. The So-called Bolzano Circle and Bolzano’s Influence on Intellectual History\n13.1 The So-called Bolzano Circle\n\nAlready at an early time Bolzano came to be surrounded by a circle of\nfriends and pupils who spread his thoughts about and stayed connected\nwith their teacher, in spite of all reprisals. Michael Josef Fesl\n(1788–1864) and Franz Příhonský\n(1788–1859) were Bolzano’s closest collaborators in many\ncases and responsible for the edition of his writings (which Bolzano\ncould not himself publish due to the ban of publication hanging over\nhis head). They wrote in addition various works (introductions to\neditions of works, reviews and discussions of books, and replies to\nunfavorable reviews), for which Bolzano himself often provided the\noutline. Only Robert Zimmermann (1824–1898), whom Bolzano had\nprivately taught philosophy and mathematics, had a career as a\nprofessional philosopher. In 1859 he was called, under Minister Thun,\nto the philosophical chair of the University of Vienna, which he took\nup in 1861. (Franz Brentano became his colleague there.) Zimmermann\nwas, however, mainly concerned with aesthetics and turned more and\nmore away from Bolzano’s philosophy to Herbart’s. \n13.2 Bolzano’s Influence on Intellectual History\n\nBolzano was a forerunner of important theories and ideas in various\nareas of knowledge. Many of Bolzano’s ideas had to be discovered\nanew since Bolzano’s preparatory work remained unknown in many\ncases and has come to light only from historical research.\nSuperficially speaking, it seems as if Bolzano had hardly any direct\ninfluence at all in the proper sense on the development of the\nsciences, although he accomplished significant research. This may of\ncourse in large part be due to the special circumstances under which\nBolzano had to work and publish. His writings thus often appeared\nanonymously and were for this reason often generally unknown —\nat least not known under his name. Although Bolzano did not directly\ninfluence modern developments — in the area of logic, for\ninstance —, he obviously did achieve a very tangible\n“indirect” and subliminal effect. For Bolzano’s\nviews were familiar to very many who passed them on, partly with the\nmention of his name and partly without any such mention. Thus,\nBolzano’s philosophy has not remained completely ineffectual: We\nknow that Twardowski was well familiar with Bolzano (Twardowski 1894),\nand we know that Łukasiewicz was well acquainted with\nBolzano’s method of idea-variation, as a section in his book on\nLogical Foundations of Probability Theory (Łukasiewicz\n1913, § 24) shows. It is to be suspected that the whole famous\nPolish school of logic was thereby indirectly influenced by Bolzano\nwithout knowing exactly the places where this influence was exerted,\nand without Bolzano being mentioned in a way which would have been\nappropriate. Franz Brentano had studied with particular interest, as\nhe himself confessed, the Paradoxes of the Infinite; he was\nnot, however, as well familiar with Bolzano’s philosophy as one\noften suspected. Nevertheless, it seems improbable that this\nfamiliarity with Bolzano, as little as is was, could have remained\nwithout any effect on his pupils such as Marty, Meinong, and Stumpf,\nalthough some of whom were “outcasts” from the orthodox\nBrentanian circle. Bolzano’s influence on Husserl, however, is\nwell-known, and Husserl himself made no secret of it.\n\nBolzano had also effect upon some great figures of Bohemian cultural\nlife such as Palacký, Havliček, and\nČelakovský; this effect was based mainly on his moral,\nsocial and political views — hence, all things considered, on\nthose views for which he could not claim any particular originality.\nThe offshoots of Bolzano’s ethical and political ideas reached\nand influenced, however, even the Charta 77 movement in the former\nCzechoslovakia some of whose representatives appealed explicitly to\nBolzano.\n",
    "bibliography": {
        "categories": [
            "<a name=\"BolWri\">Bolzano’s Writings</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"BolWri\">Bolzano’s Writings</a>": [
                "</h3>\n<table class=\"vert-top cellpad-small-dense\">\n<tr>",
                "(1804)",
                "<em>Betrachtungen über einige Gegenstände der\nElementargeometrie</em>, Prague:  Karl Barth; E:\n“Considerations on Some Objects of Elementary Geometry”,\nin Russ 2004, 25–81. </tr>\n<tr>",
                "(1810)",
                "<em>Beyträge zu einer begründeteren Darstellung der\nMathematik. Erste Lieferung</em>, Prague: Caspar Widtmann; reprint:\nDarmstadt: Wissenschaftliche Buchgesellschaft, 1974; E:\n“Contributions to a Better-Grounded Presentation of\nMathematics”, in Russ 2004, 83–137. </tr>\n<tr>",
                "(1813)",
                "<em>Erbauungsreden für Akademiker</em>, Prague: Caspar\nWidtmann; BGA I, 2; 2nd improved and enlarged edition: Sulzbach: J. E.\nv. Seidel, 1839. </tr>\n<tr>",
                "(1817)",
                "<em>Rein analytischer Beweis des Lehrsatzes, dass zwischen je\nzwey Werthen, die ein entgegengesetztes Resultat gewähren,\nwenigstens eine reelle Wurzel der Gleichung liege</em>, Prague:\nGottlieb Haase; reprints: 1894 and 1905; E: “Purely Analytic\nProof of the Theorem that between any two Values, which give Results\nof Opposite Sign, there lies at least one real Root of the\nEquation”, in Russ 2004, 251–277. </tr>\n<tr>",
                "(1827)",
                "[anonymous] <em>Athanasia oder Gründe für die\nUnsterblichkeit der Seele</em>, Sulzbach: J. E. v. Seidel; 2nd\nimproved and enlarged edition (no longer anonymous): Sulzbach: J. E.\nv. Seidel, 1838; reprint: Frankfurt/M.: Minerva, 1970. </tr>\n<tr>",
                "(1834)",
                "[anonymous]  <em>Lehrbuch der Religionswissenschaft, ein\nAbdruck der Vorlesungshefte eines ehe</em><em>maligen Religionslehrers\nan einer katholischen Universität, von einigen seiner\nSchüler gesammelt und herausgegeben</em>, 3 parts in 4 volumes,\nSulzbach: J. E. v. Seidel; BGA I, 6–8; E of selected parts in\nBolzano 2007b, 171–229. </tr>\n<tr>",
                "(1836)",
                "<em>Lebensbeschreibung des Dr. B. Bolzano</em>, Sulzbach: J. E.\nv. Seidel; 2nd edition: Vienna: Wilhelm Braumüller, 1875.\n</tr>\n<tr>",
                "(1837)",
                "<em>Wissenschaftslehre. Versuch einer ausführlichen und\ngrösstentheils neuen Darstellung der Logik mit steter\nRücksicht auf deren bisherige Bearbeiter</em>, 4 volumes,\nSulzbach: J. E. v. Seidel; 2nd improved edition: Leipsic: Felix\nMeiner, 1929, 1929, 1930, and 1931; reprints: Aalen: Scientia, 1970\nand 1981; BGA I, 11–14; E (complete translation): <em>Theory of\nScience. Translated by Rolf George and Paul Rusnock</em>, 4 vols.,\nOxford: Oxford University Press, 2014. </tr>\n<tr>",
                "(1838)",
                "[anonymous] Review of Bolzano 1837, <em>Freimüthige\nBlätter über Theologie und Kirchenthum</em>, New series 11:\n331–401; BGA IIA, 12/1: 101–147. </tr>\n<tr>",
                "(1839)",
                "[anonymous]  <em>Dr. Bolzano und seine Gegner</em>. <em>Ein\nBeitrag zur neuesten Literaturgeschichte</em>, Sulzbach: J. E. v.\nSeidel; reprint: Amsterdam: Rodopi, 1970; BGA I, 16/1:\n13–153. </tr>\n<tr>",
                "(1841)",
                "[anonymous] <em>Bolzano’s Wissenschaftslehre und\nReligionswissenschaft in einer beurtheilenden Uebersicht</em>,\nSulzbach: J. E. v. Seidel. </tr>\n<tr>",
                "(1842)",
                "<em>Versuch einer objectiven Begründung der Lehre von der\nZusammensetzung der Kräfte</em>, Prague: Kronberger and\nŘivnáč; BGA I, 18: 9–60. </tr>\n<tr>",
                "(1843a)",
                "“Ein Paar Bemerkungen über die neue Theorie in Herrn\nProfessor Chr. Doppler’s Schrift: ‘Ueber das farbige Licht\nder Doppelsterne und einiger anderer Gestirne des\nHimmels’”, <em>Annalen der Physik und Chemie</em>, 60:\n83–88; BGA I, 18: 77–85. </tr>\n<tr>",
                "(1843b)",
                "<em>Abhandlungen zur Ästhetik. Über den Begriff des\nSchönen. Eine phi</em>\\(loso\\)<em>phische Abhandlung</em>,\nPrague: Borrosch et André; BGA I, 18: 87–238. </tr>\n<tr>",
                "(1843c)",
                "<em>Versuch einer objectiven Begründung der Lehre von den\ndrei Dimensionen des Raumes</em>, Prague: Kronberger &amp;\nŘiwnač; BGA I, 18: 219–238. </tr>\n<tr>",
                "(1845)",
                "[anonymous] <em>Ueber die Perfectibilität des\nKatholicismus. Streitschriften zweier katholischer Theologen; zugleich\nein Beitrag zur Aufhellung einiger wichtigen Begriffe aus\nBolzano’s Religionswissenschaft</em>, Leipsic: Leopold Voss\n[Bolzano’s contributions: pp. 50–117 and 247–399];\nBGA I, 19/1–2. </tr>\n<tr>",
                "(1847)",
                "“Christ. Doppler’s neueste Leistungen auf dem\nGebiete der physikalischen Apparatenlehre, Akustik, Optik und\noptischen Astronomie”, <em>Annalen der Physik und Chemie</em>,\n72: 530–555. </tr>\n<tr>",
                "(1849a)",
                "<em>Was ist Philosophie?</em>, Vienna: Wilhelm Braumüller;\nreprints: 1960, 1961, 1964, 1965, 1969; BGA IIA, 12/3:\n13–33. </tr>\n<tr>",
                "(1849b)",
                "<em>Über die Eintheilung der schönen Künste. Eine\nästhetische Abhandlung</em>, Prague: J. G. Calve; Gottlieb\nHaase. </tr>\n<tr>",
                "(1851)",
                "<em>Paradoxien des Unendlichen</em>, ed. by Franz\nPřihonský, Leipsic: C. H. Reclam sen.; reprints: 1889,\n1920, 1955, 1964 and 1975; E: <em>Paradoxes of the Infinite</em>, ed.\nby Donald A. Steele, London: Routledge and Kegan Paul, and New Haven:\nYale University Press, 1950; and in Russ 2004, 591–678. \n</tr>\n<tr>",
                "(1930)",
                "<em>Functionenlehre</em>, ed. by Karel Rychlík, Prague:\nRoyal Bohemian Society of Sciences; BGA IIA, 10/1: 23–165; E:\n“Theory of Functions with Improvements and Additions to the\nTheory of Functions”, in Russ 2004, 429–589. </tr>\n<tr>",
                "(1932)",
                "<em>Von dem besten Staate</em>, ed. by Arnold Kowalewski,\nPrague: Royal Bohemian Society of Sciences; BGA IIA, 14: 19–144;\nE: “The little book on the best state or Thoughts of a friend of\nmankind on the most suitable institutions for civil society”, in\nBolzano 2007b, 235–356. </tr>\n<tr>",
                "(1935)",
                "<em>Der Briefwechsel B. Bolzano’s mit F. Exner</em>, ed.\nby Eduard Winter, Prague: Royal Bohemian Society of Sciences; BGA III,\n4/1; E: “Selections from the Bolzano–Exner\nCorrespondence”, in Bolzano 2004, 83–174. </tr>\n<tr>",
                "(1944)",
                "<em>Der Bolzanoprozess. Dokumente zur Geschichte der Prager\nKarlsuniversität im Vormärz</em>, ed. by Eduard Winter,\nBrno-Munich-Vienna: Rudolf M. Rohrer. </tr>\n<tr>",
                "(1965)",
                "<em>Wissenschaft und Religion im Vormärz. Der Briefwechsel\nBernard Bolzanos mit Michael Josef Fesl 1822–1848</em>, ed. by\nEduard Winter and Wilhelm Zeil, Berlin: Akademie-Verlag; BGA III, 2/1\n(three more volumes will follow). </tr>\n<tr>",
                "(1975)",
                "<em>Einleitung zur Grössenlehre. Erste Begriffe der\nallgemeinen Grössenlehre</em>, ed. by Jan Berg, Stuttgart-Bad\nCannstatt: Frommann-Holzboog [BGA IIA, 7]; E of pp. 23–78:\n“On the Mathematical Method”, in Bolzano 2004,\n40–82. </tr>\n<tr>",
                "(1977)",
                "<em>Miscellanea Mathematica 1803–1844</em>, Issues\n1–24, ed. by Bob von Rootselaar and Anna van der Lugt,\nStuttgart-Bad Cannstatt: Frommann-Holzboog, 1977 ff., not yet\ncompleted [BGA IIB, 2–13, IIB 12/2, 13/1 and 13/2 not yet\npublished]. </tr>\n<tr>",
                "(1979)",
                "<em>Philosophische Tagebücher</em>, ed. by Jan Berg,\nStuttgart-Bad Cannstatt: Frommann-Holzboog, 1979 ff., not yet\ncompleted [BGA IIB, 14–18]. </tr>\n<tr>",
                "(2004a)",
                "<em>The Mathematical Works of Bernard Bolzano</em>, translated\nand ed. by Steve Russ, Oxford: Oxford University Press. </tr>\n<tr>",
                "(2004b)",
                "<em>On the Mathematical Method and Correspondence with\nExner</em>, ed. by Paul Rusnock and Rolf George, Amsterdam-New\nYork/NY: Rodopi. </tr>\n<tr>",
                "(2005)",
                "<em>Briefe an František Příhonský\n1824–1848</em>, ed. by Jan Berg, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog [BGA III, 3/1–3]. </tr>\n<tr>",
                "(2007a)",
                "<em>Erbauungsreden der Studienjahre 1804/05 bis 1819/20</em>,\ned. by Edgar Morscher and Kurt F. Strasser, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog, 2007–2017 [BGA IIA, 15–25]. </tr>\n<tr>",
                "(2007b)",
                "<em>Selected Writings on Ethics and Politics</em>, translated by\nPaul Rusnock and Rolf George, Amsterdam-New York/NY: Rodopi.\n</tr>\n<tr>",
                "(2016)",
                "<em>Beiträge zu Bolzanos Biographie von Josef Hoffmann und\nAnton Wisshaupt sowie vier weiteren Zeitzeugen</em>, ed. by Edgar\nMorscher and Anneliese Müller, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog [BGA IV, 1/3]. </tr>\n<tr>",
                "(2017)",
                "<em>Briefwechsel mit Franz Exner 1833–1844</em>, ed. by\nEdgar Morscher, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA III,\n4/1]. </tr>\n</table>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Benthem, Johan van, 1984, <em>Lessons from Bolzano</em>, Stanford:\nCenter for the Study of Language and Information [Series:\n<em>Report</em>, no. CSLI–84–6].",
                "Berg, Jan, 1962, <em>Bolzano’s Logic</em>,\nStockholm-Göteborg-Uppsala: Almqvist &amp; Wiksell.",
                "–––, 1987, Einleitung des Herausgebers. BGA I,\n12/1, 9–62.",
                "–––, 1992, <em>Ontology without Ultrafilters and\nPossible Worlds. An Examination of Bolzano’s Ontology</em>,\nSankt Augustin: Academia [BBF 1].",
                "–––, 2003, “Bolzanos Naturphilosophie und\nihre Beziehung zur Physik”, in Morscher 2003,\n137–149.",
                "Berg, Jan &amp; Ganthaler, Heinrich &amp; Morscher, Edgar, 1987,\n“Bolzanos Biographie in tabellarischer Übersicht”,\nin  Morscher 1987, 353–372.",
                "Berg, Jan &amp; Morscher, Edgar, (eds.), 2002, <em>Bernard\nBolzanos Bibliothek</em>, 2 volumes, Sankt Augustin: Academia [BBF 14\nand 15].",
                "Bergmann, Shmuel Hugo, 1909, <em>Das philosophische Werk Bernard\nBolzanos mit Benutzung ungedruckter Quellen kritisch untersucht</em>,\nHalle/S.: Max Niemeyer; reprint: Hildesheim-New York: Georg Olms,\n1970.",
                "Bolzano-Symposium, 1974, <em>Bolzano-Symposium “Bolzano als\nLogiker”</em>, Vienna: Österreichische Akademie der\nWissenschaften.",
                "Buhl, Günter, 1958, <em>Ableitbarkeit und Abfolge in der\nWissenschaftstheorie Bolzanos</em>, Cologne: Kölner\nUniversitätsverlag [PhD Thesis, Mainz 1958].",
                "Cantor, Georg, 1883/84, “Ueber unendliche, lineare\nPunktmannichfaltigkeiten”, no. 5 and 6, <em>Mathematische\nAnnalen</em>, 21: 545–591, see especially  pp. 560 f., 576;\nand  <em>Mathematische Annalen</em>, 23: 453–488, see\nespecially p. 455.",
                "Casari, Ettore, 2016, <em>Bolzano’s Logical System</em>,\nOxford: Oxford University Press.",
                "Centrone, Stefania, 2015, <em>Studien zu Bolzano</em>, Sankt\nAugustin: Academia [BBF 26].",
                "Coffa, J. Alberto, 1991, <em>The  Semantic Tradition from\nKant to Carnap. To the Vienna Station</em>, ed. by Linda Wessels,\nCambridge: Cambridge University Press; reprint 1993.",
                "Dedekind, Richard, 1888, <em>Was sind und was sollen die\nZahlen?</em>, Braunschweig: Friedrich Vieweg; 2nd edition:\nBraunschweig: Friedrich Vieweg, 1893, pp. XVI and 17.",
                "Dubislav, Walter, 1931,  “Bolzano als Vorläufer\nder mathematischen Logik”, <em>Philosophisches Jahrbuch</em>,\n44: 448–456.",
                "Etchemendy, John, 1990, <em>The Concept of Logical\nConsequence</em>, Cambridge/MA: Harvard University Press.",
                "Føllesdal, Dagfinn, 1997, “Bolzano’s\nLegacy”, in Künne &amp; Siebel &amp; Textor 1997,\n1–11.",
                "George, Rolf, 1992, “Concepts of Consequence”, in\nWissenschaftslehre 1992, 3–26.",
                "Hieke, Alexander &amp; Neumaier, Otto, (eds.), 2003,\n<em>Philosophie im Geiste Bolzanos, anlässlich des\n222.Geburtstages von Ber</em><em>nard Bolzano Edgar Morscher\ngewidmet</em>, Sankt Augustin: Academia.",
                "Kraus, Lukas Benedikt, 2014, <em>Der Begriff des Kontinuums bei\nBernard Bolzano</em>, Sankt Augustin: Academia [BBF 25].",
                "Krickel, Frank, 1995, <em>Teil und Inbegriff, Bernard Bolzanos\nMereologie</em>, Sankt Augustin: Academia [BBF 5].",
                "Künne, Wolfgang, 2008, <em>Versuche über Bolzano –\nEssays on Bolzano</em>, Sankt Augustin: Academia [BBF 21].",
                "Künne, Wolfgang &amp; Siebel, Mark &amp; Textor, Mark,\n(eds.), 1997, <em>Bolzano and Analytic Philosophy</em>, Amsterdam:\nRodopi.",
                "Lapointe, Sandra, 2011, <em>Bolzano’s Theoretical\nPhilosophy: An Introduction</em>, Basingstoke-New York: Palgrave\nMacmillan.",
                "Löffler, Winfried, 1999, (ed.), 2002a, <em>Bernard Bolzanos\nReligionsphilosophie und Theologie</em>, Sankt Augustin: Academia [BBF\n12].",
                "Łukasiewicz, Jan, 1913, <em>Die logischen Grundlagen der\nWahrscheinlichkeitsrechnung</em>, Krakau: Akademie der\nWissenschaften–Viktor Osławski’scher Fonds, pp.\n58–69: “§ 24. Bolzano’s Begriff der\nGültigkeit”, and p. 74.",
                "Morscher, Edgar, 1968, <em>Das logische An-sich bei Bernard\nBolzano</em>, Ph.D. Thesis, Innsbruck; printed version with revisions:\nSalzburg-Munich: Anton Pustet, 1973.",
                "–––, (ed.), 1987, <em>Bolzano-Studien</em>,\nMeisenheim/Glan: Anton Hain [Series: <em>Philosophia Naturalis</em>,\nVol. 24, Issue 4].",
                "–––, (ed.), 1999, <em>Bernard Bolzanos geistiges\nErbe für das 21. Jahrhundert</em>, Sankt Augustin: Academia [BBF\n11].",
                "–––, (ed.), 2003, <em>Bernard Bolzanos\nLeistungen in Logik, Mathematik und Physik</em>, Sankt Augustin:\nAcademia [BBF 16].",
                "–––, 2007, <em>Studien zur Logik Bernard\nBolzanos</em>, Sankt Augustin: Academia [BBF 20].",
                "–––, 2008, <em>Bernard Bolzano’s Life and\nWork</em>, Sankt Augustin: Academia [BBF 22].",
                "–––, 2016, <em>Bernard Bolzanos Lehre von Grund\nund Folge. Eine axiomatische Rekonstruktion</em>, Sankt Augustin:\nAcademia [BBF 27].",
                "Příhonský, Franz, 1850, <em>Neuer Anti-Kant\noder Prüfung der Kritik der reinen Vernunft nach den in\nBolzano’s Wissenschaftslehre niedergelegten Begriffen</em>,\nBautzen: A. Weller; new edition: 2003 [BBF 9: 1–184].",
                "–––, 1857, <em>Atomenlehre des sel.\nBolzano</em>, Budissin: E. M. Monse; new edition: 2003 [BBF 9:\n233–251].",
                "Roski, Stefan, 2017, <em>Bolzano’s Conception of\nGrounding</em>, Frankfurt/M.: Klostermann.",
                "Rumberg, Antje, 2013, “Bolzano’s Concept of Grounding\n(Abfolge) Against the Background of Normal Proofs”, <em>Review\nof Symbolic Logic</em>, 6: 424–459.",
                "Rusnock, Paul, 2000,  <em>Bolzano’s Philosophy and the\nEmergence of Modern Mathematics</em>, Amsterdam-Atlanta/GA:\nRodopi.",
                "Russ, Steve, 2004, <em>The Mathematical Works of Bernard\nBolzano</em>, Oxford: Oxford University Press.",
                "Russell, Bertrand, 1903, <em>The Principles of Mathematics</em>,\nCambridge: Cambridge University Press; 2nd edition: New York: W. W.\nNorton, and London: George Allen &amp; Unwin and McLeod, 1937.",
                "Schnieder, Benjamin, 2002, <em>Substanz und Adhärenz.\nBolzanos Ontologie des Wirklichen</em>, Sankt Augustin: Academia [BBF\n13].",
                "Schnieder, Benjamin &amp; Correia, Fabrice, (eds.), 2012,\n<em>Metaphysical Grounding</em>, Oxford: Oxford University Press.",
                "Scholz, Heinrich, 1937,  “Die Wissenschaftslehre\nBolzanos. Eine Jahrhundert-Betrachtung”, <em>Abhandlungen der\nFries’schen Schule</em>, New series 6: 399–472.",
                "Schröter, Karl, 1955,  “Theorie des logischen\nSchliessens I”, <em>Zeitschrift für mathematische Logik und\nGrundlagen der Mathematik</em>, 1: 37–86.",
                "–––, 1958,  “Theorie des logischen\nSchliessens II”, <em>Zeitschrift für mathematische Logik\nund Grundlagen der Mathematik</em>, 4: 10–65.",
                "Sebestik, Jan, 1992, <em>Logique et mathématique chez\nBernard Bolzano</em>, Paris: J. Vrin.",
                "Siebel, Mark, 1996, <em>Der Begriff der Ableitbarkeit bei\nBolzano</em>, Sankt Augustin: Academia [BBF 7].",
                "Simons, Peter M., 1992, <em>Philosophy and Logic in Central Europe\nfrom Bolzano to Tarski. Selected Essays</em>, Dordrecht-Boston-London:\nKluwer.",
                "Tarski, Alfred, 1936, “Über den Begriff der logischen\nFolgerung”, <em>Actualités scientifiques et\nindustrielles</em>, 394: 1–11; E: “On the Concept of\nLogical Consequence”, in Tarski 1956, 409–420, see\nespecially p. 417.",
                "–––, 1956, <em>Logic, Semantics,\nMetamathematics. Papers from 1923 to 1938</em>, Oxford: Clarendon\nPress; 2nd edition, ed. by John Corcoran: Indianapolis/IN: Hackett,\n1983.",
                "Tatzel, Armin, 2002, “Bolzano’s Theory of Ground and\nConsequence”, <em>Notre Dame Journal of Formal Logic</em>, 43:\n1–25.",
                "Textor, Mark, 1996, <em>Bolzanos Propositionalismus</em>,\nBerlin-New York: Walter de Gruyter; PhD Thesis, Hamburg 1993.",
                "Twardowski, Kasimir, 1894, <em>Zur Lehre vom Inhalt und Gegenstand\nder Vorstellungen. Eine psychologische Untersuchung</em>, Vienna:\nAlfred Hölder; reprint: Munich-Vienna: Philosophia,\n1982.",
                "Winter, Eduard, 1933, <em>Bernard Bolzano und sein Kreis</em>,\nLeipsic: Jakob Hegner.",
                "–––, 1949, <em>Leben und geistige Entwicklung\ndes Sozialethikers und Mathematikers Bernard Bolzano\n1781–1848</em>, Halle/S.: Max Niemeyer.",
                "–––, 1969, <em>Bernard Bolzano. Ein\nLebensbild</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA E,\n1].",
                "Wissenschaftslehre, 1992, <em>Bolzano’s Wissenschaftslehre\n1837–1987</em>, Firenze: Leo S. Olschki.",
                "Wright, Georg Henrik von, 1982, <em>Wittgenstein</em>, Basil\nBlackwell: Oxford.",
                "Zeithammer, Gregor, 1997, <em>Biographie Bolzanos</em>, ed. by\nGerhard Zwerschke, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA IV,\n2].",
                "Zimmermann, Robert, 1852, <em>Philosophische Propaedeutik für\nObergymnasien</em>. <em>Erste</em> <em>Abtheilung</em>: <em>Empirische\nPsychologie für Obergymnasien</em>, Vienna: Wilhelm\nBraumüller.",
                "–––, 1853, <em>Philosophische Propaedeutik\nfür Obergymnasien. Zweite Abtheilung</em>: <em>Formale Logik\nfür Obergymnasien</em>, Vienna: Wilhelm\nBraumüller.",
                "–––, 1860, <em>Philosophische Propaedeutik</em>,\n2nd revised edition, Vienna: Wilhelm Braumüller; 3rd edition:\nVienna: Wilhelm Braumüller, 1867.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<p>\nThe complete edition of Bolzano’s works\n(<em>Bernard-Bolzano-Gesamtausgabe</em>) was founded by Jan Berg and\nEduard Winter together with the publisher Günther Holzboog, and\nit started in 1969. Since then 99 volumes have already appeared, and\nabout 37 more are forthcoming. The editors were, apart from Jan Berg\nand Eduard Winter, Friedrich Kambartel, Jaromir Loužíl,\nEdgar Morscher and Bob van Rootselaar. The acting editor is Edgar\nMorscher. </p>\n<p>\nIn this bibliography the following abbreviations will be used:</p>\n<table class=\"vert-top indent cellpad-small-dense\">\n<tr>\n<td>[BGA]</td>\n<td><em>Bernard-Bolzano-Gesamtausgabe</em>, with a Roman numeral for\nthe series and Arabic numerals for the volumes; if a volume consists\nof two or more parts, the reference to them will appear after a dash\nin Arabic numerals. The BGA is published by Friedrich Frommann\nVerlag–Günther Holzboog in Stuttgart-Bad Cannstatt.</td>\n</tr>\n<tr>\n<td>[RW]</td>\n<td>Bolzano 1834, with Roman numerals for the volumes and Arabic\nnumerals for the pages of the original edition.</td> </tr>\n<tr>\n<td>[WL]</td>\n<td>Bolzano 1837, with Roman numerals for the volumes and Arabic\nnumerals for the pages of the original edition.</td> </tr>\n<tr>\n<td>[BBF]</td>\n<td><em>Beiträge zur Bolzano-Forschung</em>, 28 volumes so far.\nThe BBF are published by Academia Verlag in Sankt Augustin and edited\nby Edgar Morscher and Otto Neumaier; from vol.23 on: edited by\nWinfried Löffler and Otto Neumaier.</td> </tr>\n<tr>\n<td>[E]</td>\n<td>English translation (or edition).</td> </tr>\n</table>\n<p>\nThis bibliography is divided into two parts: Bolzano’s writings\nand Secondary literature.</p>\n<h3><a name=\"BolWri\">Bolzano’s Writings</a></h3>\n<table class=\"vert-top cellpad-small-dense\">\n<tr>\n<td>(1804)</td>\n<td><em>Betrachtungen über einige Gegenstände der\nElementargeometrie</em>, Prague:  Karl Barth; E:\n“Considerations on Some Objects of Elementary Geometry”,\nin Russ 2004, 25–81.</td> </tr>\n<tr>\n<td>(1810)</td>\n<td><em>Beyträge zu einer begründeteren Darstellung der\nMathematik. Erste Lieferung</em>, Prague: Caspar Widtmann; reprint:\nDarmstadt: Wissenschaftliche Buchgesellschaft, 1974; E:\n“Contributions to a Better-Grounded Presentation of\nMathematics”, in Russ 2004, 83–137.</td> </tr>\n<tr>\n<td>(1813)</td>\n<td><em>Erbauungsreden für Akademiker</em>, Prague: Caspar\nWidtmann; BGA I, 2; 2nd improved and enlarged edition: Sulzbach: J. E.\nv. Seidel, 1839.</td> </tr>\n<tr>\n<td>(1817)</td>\n<td><em>Rein analytischer Beweis des Lehrsatzes, dass zwischen je\nzwey Werthen, die ein entgegengesetztes Resultat gewähren,\nwenigstens eine reelle Wurzel der Gleichung liege</em>, Prague:\nGottlieb Haase; reprints: 1894 and 1905; E: “Purely Analytic\nProof of the Theorem that between any two Values, which give Results\nof Opposite Sign, there lies at least one real Root of the\nEquation”, in Russ 2004, 251–277.</td> </tr>\n<tr>\n<td>(1827)</td>\n<td>[anonymous] <em>Athanasia oder Gründe für die\nUnsterblichkeit der Seele</em>, Sulzbach: J. E. v. Seidel; 2nd\nimproved and enlarged edition (no longer anonymous): Sulzbach: J. E.\nv. Seidel, 1838; reprint: Frankfurt/M.: Minerva, 1970.</td> </tr>\n<tr>\n<td>(1834)</td>\n<td>[anonymous]  <em>Lehrbuch der Religionswissenschaft, ein\nAbdruck der Vorlesungshefte eines ehe</em><em>maligen Religionslehrers\nan einer katholischen Universität, von einigen seiner\nSchüler gesammelt und herausgegeben</em>, 3 parts in 4 volumes,\nSulzbach: J. E. v. Seidel; BGA I, 6–8; E of selected parts in\nBolzano 2007b, 171–229.</td> </tr>\n<tr>\n<td>(1836)</td>\n<td><em>Lebensbeschreibung des Dr. B. Bolzano</em>, Sulzbach: J. E.\nv. Seidel; 2nd edition: Vienna: Wilhelm Braumüller, 1875.</td>\n</tr>\n<tr>\n<td>(1837)</td>\n<td><em>Wissenschaftslehre. Versuch einer ausführlichen und\ngrösstentheils neuen Darstellung der Logik mit steter\nRücksicht auf deren bisherige Bearbeiter</em>, 4 volumes,\nSulzbach: J. E. v. Seidel; 2nd improved edition: Leipsic: Felix\nMeiner, 1929, 1929, 1930, and 1931; reprints: Aalen: Scientia, 1970\nand 1981; BGA I, 11–14; E (complete translation): <em>Theory of\nScience. Translated by Rolf George and Paul Rusnock</em>, 4 vols.,\nOxford: Oxford University Press, 2014.</td> </tr>\n<tr>\n<td>(1838)</td>\n<td>[anonymous] Review of Bolzano 1837, <em>Freimüthige\nBlätter über Theologie und Kirchenthum</em>, New series 11:\n331–401; BGA IIA, 12/1: 101–147.</td> </tr>\n<tr>\n<td>(1839)</td>\n<td>[anonymous]  <em>Dr. Bolzano und seine Gegner</em>. <em>Ein\nBeitrag zur neuesten Literaturgeschichte</em>, Sulzbach: J. E. v.\nSeidel; reprint: Amsterdam: Rodopi, 1970; BGA I, 16/1:\n13–153.</td> </tr>\n<tr>\n<td>(1841)</td>\n<td>[anonymous] <em>Bolzano’s Wissenschaftslehre und\nReligionswissenschaft in einer beurtheilenden Uebersicht</em>,\nSulzbach: J. E. v. Seidel.</td> </tr>\n<tr>\n<td>(1842)</td>\n<td><em>Versuch einer objectiven Begründung der Lehre von der\nZusammensetzung der Kräfte</em>, Prague: Kronberger and\nŘivnáč; BGA I, 18: 9–60.</td> </tr>\n<tr>\n<td>(1843a)</td>\n<td>“Ein Paar Bemerkungen über die neue Theorie in Herrn\nProfessor Chr. Doppler’s Schrift: ‘Ueber das farbige Licht\nder Doppelsterne und einiger anderer Gestirne des\nHimmels’”, <em>Annalen der Physik und Chemie</em>, 60:\n83–88; BGA I, 18: 77–85.</td> </tr>\n<tr>\n<td>(1843b)</td>\n<td><em>Abhandlungen zur Ästhetik. Über den Begriff des\nSchönen. Eine phi</em>\\(loso\\)<em>phische Abhandlung</em>,\nPrague: Borrosch et André; BGA I, 18: 87–238.</td> </tr>\n<tr>\n<td>(1843c)</td>\n<td><em>Versuch einer objectiven Begründung der Lehre von den\ndrei Dimensionen des Raumes</em>, Prague: Kronberger &amp;\nŘiwnač; BGA I, 18: 219–238.</td> </tr>\n<tr>\n<td>(1845)</td>\n<td>[anonymous] <em>Ueber die Perfectibilität des\nKatholicismus. Streitschriften zweier katholischer Theologen; zugleich\nein Beitrag zur Aufhellung einiger wichtigen Begriffe aus\nBolzano’s Religionswissenschaft</em>, Leipsic: Leopold Voss\n[Bolzano’s contributions: pp. 50–117 and 247–399];\nBGA I, 19/1–2.</td> </tr>\n<tr>\n<td>(1847)</td>\n<td>“Christ. Doppler’s neueste Leistungen auf dem\nGebiete der physikalischen Apparatenlehre, Akustik, Optik und\noptischen Astronomie”, <em>Annalen der Physik und Chemie</em>,\n72: 530–555.</td> </tr>\n<tr>\n<td>(1849a)</td>\n<td><em>Was ist Philosophie?</em>, Vienna: Wilhelm Braumüller;\nreprints: 1960, 1961, 1964, 1965, 1969; BGA IIA, 12/3:\n13–33.</td> </tr>\n<tr>\n<td>(1849b)</td>\n<td><em>Über die Eintheilung der schönen Künste. Eine\nästhetische Abhandlung</em>, Prague: J. G. Calve; Gottlieb\nHaase.</td> </tr>\n<tr>\n<td>(1851)</td>\n<td><em>Paradoxien des Unendlichen</em>, ed. by Franz\nPřihonský, Leipsic: C. H. Reclam sen.; reprints: 1889,\n1920, 1955, 1964 and 1975; E: <em>Paradoxes of the Infinite</em>, ed.\nby Donald A. Steele, London: Routledge and Kegan Paul, and New Haven:\nYale University Press, 1950; and in Russ 2004, 591–678. </td>\n</tr>\n<tr>\n<td>(1930)</td>\n<td><em>Functionenlehre</em>, ed. by Karel Rychlík, Prague:\nRoyal Bohemian Society of Sciences; BGA IIA, 10/1: 23–165; E:\n“Theory of Functions with Improvements and Additions to the\nTheory of Functions”, in Russ 2004, 429–589.</td> </tr>\n<tr>\n<td>(1932)</td>\n<td><em>Von dem besten Staate</em>, ed. by Arnold Kowalewski,\nPrague: Royal Bohemian Society of Sciences; BGA IIA, 14: 19–144;\nE: “The little book on the best state or Thoughts of a friend of\nmankind on the most suitable institutions for civil society”, in\nBolzano 2007b, 235–356.</td> </tr>\n<tr>\n<td>(1935)</td>\n<td><em>Der Briefwechsel B. Bolzano’s mit F. Exner</em>, ed.\nby Eduard Winter, Prague: Royal Bohemian Society of Sciences; BGA III,\n4/1; E: “Selections from the Bolzano–Exner\nCorrespondence”, in Bolzano 2004, 83–174.</td> </tr>\n<tr>\n<td>(1944)</td>\n<td><em>Der Bolzanoprozess. Dokumente zur Geschichte der Prager\nKarlsuniversität im Vormärz</em>, ed. by Eduard Winter,\nBrno-Munich-Vienna: Rudolf M. Rohrer.</td> </tr>\n<tr>\n<td>(1965)</td>\n<td><em>Wissenschaft und Religion im Vormärz. Der Briefwechsel\nBernard Bolzanos mit Michael Josef Fesl 1822–1848</em>, ed. by\nEduard Winter and Wilhelm Zeil, Berlin: Akademie-Verlag; BGA III, 2/1\n(three more volumes will follow).</td> </tr>\n<tr>\n<td>(1975)</td>\n<td><em>Einleitung zur Grössenlehre. Erste Begriffe der\nallgemeinen Grössenlehre</em>, ed. by Jan Berg, Stuttgart-Bad\nCannstatt: Frommann-Holzboog [BGA IIA, 7]; E of pp. 23–78:\n“On the Mathematical Method”, in Bolzano 2004,\n40–82.</td> </tr>\n<tr>\n<td>(1977)</td>\n<td><em>Miscellanea Mathematica 1803–1844</em>, Issues\n1–24, ed. by Bob von Rootselaar and Anna van der Lugt,\nStuttgart-Bad Cannstatt: Frommann-Holzboog, 1977 ff., not yet\ncompleted [BGA IIB, 2–13, IIB 12/2, 13/1 and 13/2 not yet\npublished]. </td> </tr>\n<tr>\n<td>(1979)</td>\n<td><em>Philosophische Tagebücher</em>, ed. by Jan Berg,\nStuttgart-Bad Cannstatt: Frommann-Holzboog, 1979 ff., not yet\ncompleted [BGA IIB, 14–18].</td> </tr>\n<tr>\n<td>(2004a)</td>\n<td><em>The Mathematical Works of Bernard Bolzano</em>, translated\nand ed. by Steve Russ, Oxford: Oxford University Press.</td> </tr>\n<tr>\n<td>(2004b)</td>\n<td><em>On the Mathematical Method and Correspondence with\nExner</em>, ed. by Paul Rusnock and Rolf George, Amsterdam-New\nYork/NY: Rodopi.</td> </tr>\n<tr>\n<td>(2005)</td>\n<td><em>Briefe an František Příhonský\n1824–1848</em>, ed. by Jan Berg, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog [BGA III, 3/1–3].</td> </tr>\n<tr>\n<td>(2007a)</td>\n<td><em>Erbauungsreden der Studienjahre 1804/05 bis 1819/20</em>,\ned. by Edgar Morscher and Kurt F. Strasser, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog, 2007–2017 [BGA IIA, 15–25].</td> </tr>\n<tr>\n<td>(2007b)</td>\n<td><em>Selected Writings on Ethics and Politics</em>, translated by\nPaul Rusnock and Rolf George, Amsterdam-New York/NY: Rodopi.</td>\n</tr>\n<tr>\n<td>(2016)</td>\n<td><em>Beiträge zu Bolzanos Biographie von Josef Hoffmann und\nAnton Wisshaupt sowie vier weiteren Zeitzeugen</em>, ed. by Edgar\nMorscher and Anneliese Müller, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog [BGA IV, 1/3].</td> </tr>\n<tr>\n<td>(2017)</td>\n<td><em>Briefwechsel mit Franz Exner 1833–1844</em>, ed. by\nEdgar Morscher, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA III,\n4/1].</td> </tr>\n</table>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Benthem, Johan van, 1984, <em>Lessons from Bolzano</em>, Stanford:\nCenter for the Study of Language and Information [Series:\n<em>Report</em>, no. CSLI–84–6].</li>\n<li>Berg, Jan, 1962, <em>Bolzano’s Logic</em>,\nStockholm-Göteborg-Uppsala: Almqvist &amp; Wiksell.</li>\n<li>–––, 1987, Einleitung des Herausgebers. BGA I,\n12/1, 9–62.</li>\n<li>–––, 1992, <em>Ontology without Ultrafilters and\nPossible Worlds. An Examination of Bolzano’s Ontology</em>,\nSankt Augustin: Academia [BBF 1].</li>\n<li>–––, 2003, “Bolzanos Naturphilosophie und\nihre Beziehung zur Physik”, in Morscher 2003,\n137–149.</li>\n<li>Berg, Jan &amp; Ganthaler, Heinrich &amp; Morscher, Edgar, 1987,\n“Bolzanos Biographie in tabellarischer Übersicht”,\nin  Morscher 1987, 353–372.</li>\n<li>Berg, Jan &amp; Morscher, Edgar, (eds.), 2002, <em>Bernard\nBolzanos Bibliothek</em>, 2 volumes, Sankt Augustin: Academia [BBF 14\nand 15].</li>\n<li>Bergmann, Shmuel Hugo, 1909, <em>Das philosophische Werk Bernard\nBolzanos mit Benutzung ungedruckter Quellen kritisch untersucht</em>,\nHalle/S.: Max Niemeyer; reprint: Hildesheim-New York: Georg Olms,\n1970.</li>\n<li>Bolzano-Symposium, 1974, <em>Bolzano-Symposium “Bolzano als\nLogiker”</em>, Vienna: Österreichische Akademie der\nWissenschaften.</li>\n<li>Buhl, Günter, 1958, <em>Ableitbarkeit und Abfolge in der\nWissenschaftstheorie Bolzanos</em>, Cologne: Kölner\nUniversitätsverlag [PhD Thesis, Mainz 1958].</li>\n<li>Cantor, Georg, 1883/84, “Ueber unendliche, lineare\nPunktmannichfaltigkeiten”, no. 5 and 6, <em>Mathematische\nAnnalen</em>, 21: 545–591, see especially  pp. 560 f., 576;\nand  <em>Mathematische Annalen</em>, 23: 453–488, see\nespecially p. 455.</li>\n<li>Casari, Ettore, 2016, <em>Bolzano’s Logical System</em>,\nOxford: Oxford University Press.</li>\n<li>Centrone, Stefania, 2015, <em>Studien zu Bolzano</em>, Sankt\nAugustin: Academia [BBF 26].</li>\n<li>Coffa, J. Alberto, 1991, <em>The  Semantic Tradition from\nKant to Carnap. To the Vienna Station</em>, ed. by Linda Wessels,\nCambridge: Cambridge University Press; reprint 1993.</li>\n<li>Dedekind, Richard, 1888, <em>Was sind und was sollen die\nZahlen?</em>, Braunschweig: Friedrich Vieweg; 2nd edition:\nBraunschweig: Friedrich Vieweg, 1893, pp. XVI and 17.</li>\n<li>Dubislav, Walter, 1931,  “Bolzano als Vorläufer\nder mathematischen Logik”, <em>Philosophisches Jahrbuch</em>,\n44: 448–456.</li>\n<li>Etchemendy, John, 1990, <em>The Concept of Logical\nConsequence</em>, Cambridge/MA: Harvard University Press.</li>\n<li>Føllesdal, Dagfinn, 1997, “Bolzano’s\nLegacy”, in Künne &amp; Siebel &amp; Textor 1997,\n1–11.</li>\n<li>George, Rolf, 1992, “Concepts of Consequence”, in\nWissenschaftslehre 1992, 3–26.</li>\n<li>Hieke, Alexander &amp; Neumaier, Otto, (eds.), 2003,\n<em>Philosophie im Geiste Bolzanos, anlässlich des\n222.Geburtstages von Ber</em><em>nard Bolzano Edgar Morscher\ngewidmet</em>, Sankt Augustin: Academia.</li>\n<li>Kraus, Lukas Benedikt, 2014, <em>Der Begriff des Kontinuums bei\nBernard Bolzano</em>, Sankt Augustin: Academia [BBF 25].</li>\n<li>Krickel, Frank, 1995, <em>Teil und Inbegriff, Bernard Bolzanos\nMereologie</em>, Sankt Augustin: Academia [BBF 5].</li>\n<li>Künne, Wolfgang, 2008, <em>Versuche über Bolzano –\nEssays on Bolzano</em>, Sankt Augustin: Academia [BBF 21].</li>\n<li>Künne, Wolfgang &amp; Siebel, Mark &amp; Textor, Mark,\n(eds.), 1997, <em>Bolzano and Analytic Philosophy</em>, Amsterdam:\nRodopi.</li>\n<li>Lapointe, Sandra, 2011, <em>Bolzano’s Theoretical\nPhilosophy: An Introduction</em>, Basingstoke-New York: Palgrave\nMacmillan. </li>\n<li>Löffler, Winfried, 1999, (ed.), 2002a, <em>Bernard Bolzanos\nReligionsphilosophie und Theologie</em>, Sankt Augustin: Academia [BBF\n12].</li>\n<li>Łukasiewicz, Jan, 1913, <em>Die logischen Grundlagen der\nWahrscheinlichkeitsrechnung</em>, Krakau: Akademie der\nWissenschaften–Viktor Osławski’scher Fonds, pp.\n58–69: “§ 24. Bolzano’s Begriff der\nGültigkeit”, and p. 74.</li>\n<li>Morscher, Edgar, 1968, <em>Das logische An-sich bei Bernard\nBolzano</em>, Ph.D. Thesis, Innsbruck; printed version with revisions:\nSalzburg-Munich: Anton Pustet, 1973.</li>\n<li>–––, (ed.), 1987, <em>Bolzano-Studien</em>,\nMeisenheim/Glan: Anton Hain [Series: <em>Philosophia Naturalis</em>,\nVol. 24, Issue 4].</li>\n<li>–––, (ed.), 1999, <em>Bernard Bolzanos geistiges\nErbe für das 21. Jahrhundert</em>, Sankt Augustin: Academia [BBF\n11].</li>\n<li>–––, (ed.), 2003, <em>Bernard Bolzanos\nLeistungen in Logik, Mathematik und Physik</em>, Sankt Augustin:\nAcademia [BBF 16].</li>\n<li>–––, 2007, <em>Studien zur Logik Bernard\nBolzanos</em>, Sankt Augustin: Academia [BBF 20].</li>\n<li>–––, 2008, <em>Bernard Bolzano’s Life and\nWork</em>, Sankt Augustin: Academia [BBF 22].</li>\n<li>–––, 2016, <em>Bernard Bolzanos Lehre von Grund\nund Folge. Eine axiomatische Rekonstruktion</em>, Sankt Augustin:\nAcademia [BBF 27].</li>\n<li>Příhonský, Franz, 1850, <em>Neuer Anti-Kant\noder Prüfung der Kritik der reinen Vernunft nach den in\nBolzano’s Wissenschaftslehre niedergelegten Begriffen</em>,\nBautzen: A. Weller; new edition: 2003 [BBF 9: 1–184]. </li>\n<li>–––, 1857, <em>Atomenlehre des sel.\nBolzano</em>, Budissin: E. M. Monse; new edition: 2003 [BBF 9:\n233–251].</li>\n<li>Roski, Stefan, 2017, <em>Bolzano’s Conception of\nGrounding</em>, Frankfurt/M.: Klostermann.</li>\n<li>Rumberg, Antje, 2013, “Bolzano’s Concept of Grounding\n(Abfolge) Against the Background of Normal Proofs”, <em>Review\nof Symbolic Logic</em>, 6: 424–459.</li>\n<li>Rusnock, Paul, 2000,  <em>Bolzano’s Philosophy and the\nEmergence of Modern Mathematics</em>, Amsterdam-Atlanta/GA:\nRodopi.</li>\n<li>Russ, Steve, 2004, <em>The Mathematical Works of Bernard\nBolzano</em>, Oxford: Oxford University Press.</li>\n<li>Russell, Bertrand, 1903, <em>The Principles of Mathematics</em>,\nCambridge: Cambridge University Press; 2nd edition: New York: W. W.\nNorton, and London: George Allen &amp; Unwin and McLeod, 1937.</li>\n<li>Schnieder, Benjamin, 2002, <em>Substanz und Adhärenz.\nBolzanos Ontologie des Wirklichen</em>, Sankt Augustin: Academia [BBF\n13].</li>\n<li>Schnieder, Benjamin &amp; Correia, Fabrice, (eds.), 2012,\n<em>Metaphysical Grounding</em>, Oxford: Oxford University Press.</li>\n<li>Scholz, Heinrich, 1937,  “Die Wissenschaftslehre\nBolzanos. Eine Jahrhundert-Betrachtung”, <em>Abhandlungen der\nFries’schen Schule</em>, New series 6: 399–472.</li>\n<li>Schröter, Karl, 1955,  “Theorie des logischen\nSchliessens I”, <em>Zeitschrift für mathematische Logik und\nGrundlagen der Mathematik</em>, 1: 37–86.</li>\n<li>–––, 1958,  “Theorie des logischen\nSchliessens II”, <em>Zeitschrift für mathematische Logik\nund Grundlagen der Mathematik</em>, 4: 10–65.</li>\n<li>Sebestik, Jan, 1992, <em>Logique et mathématique chez\nBernard Bolzano</em>, Paris: J. Vrin.</li>\n<li>Siebel, Mark, 1996, <em>Der Begriff der Ableitbarkeit bei\nBolzano</em>, Sankt Augustin: Academia [BBF 7].</li>\n<li>Simons, Peter M., 1992, <em>Philosophy and Logic in Central Europe\nfrom Bolzano to Tarski. Selected Essays</em>, Dordrecht-Boston-London:\nKluwer.</li>\n<li>Tarski, Alfred, 1936, “Über den Begriff der logischen\nFolgerung”, <em>Actualités scientifiques et\nindustrielles</em>, 394: 1–11; E: “On the Concept of\nLogical Consequence”, in Tarski 1956, 409–420, see\nespecially p. 417.</li>\n<li>–––, 1956, <em>Logic, Semantics,\nMetamathematics. Papers from 1923 to 1938</em>, Oxford: Clarendon\nPress; 2nd edition, ed. by John Corcoran: Indianapolis/IN: Hackett,\n1983.</li>\n<li>Tatzel, Armin, 2002, “Bolzano’s Theory of Ground and\nConsequence”, <em>Notre Dame Journal of Formal Logic</em>, 43:\n1–25.</li>\n<li>Textor, Mark, 1996, <em>Bolzanos Propositionalismus</em>,\nBerlin-New York: Walter de Gruyter; PhD Thesis, Hamburg 1993.\n </li>\n<li>Twardowski, Kasimir, 1894, <em>Zur Lehre vom Inhalt und Gegenstand\nder Vorstellungen. Eine psychologische Untersuchung</em>, Vienna:\nAlfred Hölder; reprint: Munich-Vienna: Philosophia,\n1982. </li>\n<li>Winter, Eduard, 1933, <em>Bernard Bolzano und sein Kreis</em>,\nLeipsic: Jakob Hegner.</li>\n<li>–––, 1949, <em>Leben und geistige Entwicklung\ndes Sozialethikers und Mathematikers Bernard Bolzano\n1781–1848</em>, Halle/S.: Max Niemeyer.</li>\n<li>–––, 1969, <em>Bernard Bolzano. Ein\nLebensbild</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA E,\n1].</li>\n<li>Wissenschaftslehre, 1992, <em>Bolzano’s Wissenschaftslehre\n1837–1987</em>, Firenze: Leo S. Olschki.</li>\n<li>Wright, Georg Henrik von, 1982, <em>Wittgenstein</em>, Basil\nBlackwell: Oxford.</li>\n<li>Zeithammer, Gregor, 1997, <em>Biographie Bolzanos</em>, ed. by\nGerhard Zwerschke, Stuttgart-Bad Cannstatt: Frommann-Holzboog [BGA IV,\n2].</li>\n<li>Zimmermann, Robert, 1852, <em>Philosophische Propaedeutik für\nObergymnasien</em>. <em>Erste</em> <em>Abtheilung</em>: <em>Empirische\nPsychologie für Obergymnasien</em>, Vienna: Wilhelm\nBraumüller.</li>\n<li>–––, 1853, <em>Philosophische Propaedeutik\nfür Obergymnasien. Zweite Abtheilung</em>: <em>Formale Logik\nfür Obergymnasien</em>, Vienna: Wilhelm\nBraumüller.  </li>\n<li>–––, 1860, <em>Philosophische Propaedeutik</em>,\n2nd revised edition, Vienna: Wilhelm Braumüller; 3rd edition:\nVienna: Wilhelm Braumüller, 1867.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "analysis",
            "Bolzano, Bernard: logic",
            "Frege, Gottlob",
            "Husserl, Edmund",
            "logical consequence",
            "logical truth",
            "model theory",
            "phenomenology",
            "propositions",
            "set theory",
            "set theory: early development"
        ],
        "entry_link": [
            {
                "../analysis/": "analysis"
            },
            {
                "../bolzano-logic/": "Bolzano, Bernard: logic"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../logical-consequence/": "logical consequence"
            },
            {
                "../logical-truth/": "logical truth"
            },
            {
                "../model-theory/": "model theory"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../propositions/": "propositions"
            },
            {
                "../set-theory/": "set theory"
            },
            {
                "../settheory-early/": "set theory: early development"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bolzano\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/bolzano/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=bolzano&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/bolzano/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bolzano": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/bolzano/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=bolzano&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/bolzano/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.frommann-holzboog.de/editionen/20\" target=\"other\">Bernard-Bolzano-Gesamtausgabe</a>,\n frommann-holzboog.",
            "<a href=\"http://www.academia-verlag.de/titel/serie/serie_Beitraege_zur_Bolzano-Forschung.htm\" target=\"other\">Beiträge zur Bolzano-Forschung</a>,\n Academia Verlag.",
            "<a href=\"https://www.plus.ac.at/philosophie-gw-fakultaet/forschung/bernard-bolzano/\" target=\"other\">Bernard Bolzano Pages</a>,\n Department of Philosophy, Faculty of Arts and Social Sciences,\nUniversity of Salzburg.",
            "<a href=\"https://mathshistory.st-andrews.ac.uk/Biographies/Bolzano/\" target=\"other\">Bernard Bolzano Page</a>,\n Mac Tutor History of Mathematics archive, University of St.\nAndrews."
        ],
        "listed_links": [
            {
                "http://www.frommann-holzboog.de/editionen/20": "Bernard-Bolzano-Gesamtausgabe"
            },
            {
                "http://www.academia-verlag.de/titel/serie/serie_Beitraege_zur_Bolzano-Forschung.htm": "Beiträge zur Bolzano-Forschung"
            },
            {
                "https://www.plus.ac.at/philosophie-gw-fakultaet/forschung/bernard-bolzano/": "Bernard Bolzano Pages"
            },
            {
                "https://mathshistory.st-andrews.ac.uk/Biographies/Bolzano/": "Bernard Bolzano Page"
            }
        ]
    }
}