{
    "url": "bradley",
    "title": "Francis Herbert Bradley",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Stewart Candlish\n\nPierfrancesco Basile\n<pierfrancesco.basile@philo.unibe.ch>",
        "author_links": [
            {
                "http://members.iinet.net.au/~stewartcandlish/": "Stewart Candlish"
            },
            {
                "mailto:pierfrancesco%2ebasile%40philo%2eunibe%2ech": "pierfrancesco.basile@philo.unibe.ch"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://members.iinet.net.au/~stewartcandlish/\" target=\"other\">Stewart Candlish</a>\n<br/>\nPierfrancesco Basile\n&lt;<a href=\"mailto:pierfrancesco%2ebasile%40philo%2eunibe%2ech\"><em>pierfrancesco<abbr title=\" dot \">.</abbr>basile<abbr title=\" at \">@</abbr>philo<abbr title=\" dot \">.</abbr>unibe<abbr title=\" dot \">.</abbr>ch</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 9, 1996",
        "substantive revision Tue Feb 23, 2021"
    ],
    "preamble": "\n\nF. H. Bradley (1846–1924) was the most famous, original and\nphilosophically influential of the British Idealists. These\nphilosophers came to prominence in the closing decades of the\nnineteenth century, but their effect on British philosophy and society\nat large — and, through the positions of power attained by some\nof their pupils in the institutions of the British Empire, on much of\nthe world — persisted well into the first half of the twentieth.\nThey stood out amongst their peers in consciously rejecting some main\naspects of the tradition of their earlier compatriots, such as Hume\nand Mill, and responding, albeit in an original and critical fashion,\nrather to the work of Kant and Hegel.\n\nBut it would involve a significant degree of distortion to depict the\nBritish Idealists as simply choosing Hegel over Hume, as the\ndenomination ‘Neo-Hegelians’ all too easily suggests. On\nthe contrary, they were open to a variety of influences, including the\nphilosophy of an anti-idealist thinker such as J.F. Herbart and of the\nsubsequently forgotten but then prominent Hermann Lotze, an\nindependent mind whose speculations are difficult to classify in terms\nof the idealist/realist opposition. Upon the whole, the Idealists\nrevitalized British philosophy by making it permeable to a rich\nvariety of continental ideas. In this way, they helped prepare the\nground on which analytic philosophy would eventually flourish, as most\nIdealists were very well acquainted with the works of Frege’s\ncontemporaries (e.g. Sigwart) and discussed their ideas in their\nlogical treatises. Bradley was a leading figure in this movement of\noriginal reappropriation of alien ideas, which he explicitly promoted\nas the sole antidote to dogmatism and intellectual sclerosis in the\n‘Preface’ to Appearance and Reality. ‘The\npresent generation’, he said, ‘is learning that to gain\neducation a man must study in more than one school’ (p.\nviii).\n\nIt is for his metaphysics that Bradley has become best known. He\nargued that our everyday conceptions of the world (as well as those\nmore refined ones common among his philosophical predecessors) contain\nhidden contradictions which appear, fatally, when we try to think out\ntheir consequences. In particular, Bradley rejected on these grounds\nthe view that reality can be understood as consisting of many objects\nexisting independently of each other (pluralism) and of our experience\nof them (realism). Consistently, his own view combined substance\nmonism — the claim that reality is one, that there are no real\nseparate things — with metaphysical idealism — the claim\nthat reality consists solely of idea or experience. This vision of the\nworld had a profound effect on the verse of T.S. Eliot, who studied\nphilosophy at Harvard and wrote a Ph.D. thesis on Bradley.\n\nOn later generations of philosophers, however, Bradley’s\ncontributions to moral philosophy and the philosophy of logic were far\nmore influential than his metaphysics. His critical examination of\nhedonism — the view that the goal of morality is the\nmaximization of general pleasure — was seminal and stands as a\npermanent contribution to the subject which can still be read with\nprofit today. Some of the doctrines of his logic have become standard\nand unnoticed assumptions through their acceptance by Bertrand\nRussell, an acceptance which survived Russell’s subsequent\nrepudiation of idealist logic and metaphysics.\n\nOther notable figures among the British Idealists were Bernard\nBosanquet, Edward Caird, T.H. Green, Harold Joachim and J.M.E.\nMcTaggart.\n",
    "toc": [
        {
            "#Life": "1. Life"
        },
        {
            "#Rep": "2. Reputation"
        },
        {
            "#PhilHist": "3. Philosophy of History"
        },
        {
            "#Ethics": "4. Ethics"
        },
        {
            "#Logic": "5. Logic"
        },
        {
            "#Met": "6. Metaphysics"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\nBradley was born on 30th January, 1846 in Clapham (then in the county\nof Surrey, since absorbed into a much expanded London). He was the\nfourth child and eldest surviving son of Charles Bradley, a prominent\nEvangelical preacher, and his second wife, Emma Linton. The family was\ntalented and well connected: George Granville Bradley, a son from the\nfirst marriage, was successively Head Master of Marlborough College,\nMaster of University College, Oxford, and Dean of Westminster Abbey;\nA.C. Bradley, a younger son from the second marriage, taught\nphilosophy at Oxford until 1881, and, after moving to literary\nstudies, held chairs at Liverpool and Glasgow, refused one at\nCambridge, and became the most distinguished Shakespearean critic of\nhis day. Charles Bradley’s ‘Clapham Sect’ (as this\nactively evangelical humanitarian group was known at the time) had\nstrong imperial connections, including among its members a\nGovernor-General of Bengal, a Governor of Sierra Leone, several\nmembers of Parliament and a permanent head of the Colonial Office.\n\nIn 1856 F.H. Bradley’s schooling began at Cheltenham College; in\n1861 he was transferred to Marlborough College, then under his\nhalf-brother’s Headship. While at Cheltenham he began learning\nGerman; he read at least some of Kant’s Critique of Pure\nReason while still at school, though it is not clear that this\nwas in the original language. In the winter of 1862–3 he\ncontracted typhoid fever (at one stage expected to kill him), followed\nshortly by pneumonia. Surviving both, he was protected from further\nexposure to the rigours of English public school life by leaving\nMarlborough in 1863.\n\nIn 1865 Bradley entered University College, Oxford, as a Scholar,\ngetting a first in classical moderations (Mods) in 1867 but only an\nunexpected second in literae humaniores (Greats) in 1869. The\nprominent Plato scholar A.E. Taylor, a later admirer of Bradley and\nsympathetic to his idealism, attributed his reverse in Greats to\n‘the complete incapacity of examiners whose philosophical\nscriptures were the writings of John Stuart Mill to comprehend what\nphilosophy meant to the brilliant younger men who were shortly to\nrevolutionize philosophical studies in Great Britain.’ Whether\nor not this is true, there is certainly an undisguised contempt for\nMill and his followers exhibited in Bradley’s Principles of\nLogic. After more than one failure to obtain a college\nfellowship, he was in December 1870 elected to one at Merton College\nOxford, tenable for life, with no teaching duties, and terminable only\non marriage. He never married, and remained in his fellowship until\nhis death.\n\nIn June 1871 Bradley suffered a severe inflammation of the kidneys\nwhich appears to have had permanent effects. It has been suggested,\npossibly with malice, that the Bradleys in general were disposed to\nhypochondria; be that as it may, he was prone thereafter to be\nincapacitated by cold, physical exhaustion or anxiety, and in\nconsequence lived a retired life. He took an active part in the\nrunning of his college, but avoided public occasions, to the extent,\nfor example, of declining an invitation to become a founding member of\nthe British Academy. Collingwood records of Bradley in his\nAutobiography, ‘[A]lthough I lived within a few hundred\nyards of him for sixteen years, I never to my knowledge set eyes on\nhim.’ This relative seclusion added an element of mystery to his\nphilosophical reputation, a mystery enhanced by the dedication of some\nof his books to a person identified only by the initials\n‘E.R.’\n\nBut although Bradley devoted himself to philosophy, so that the\nhistory of his public life is largely that of his books and articles,\nit is clear that his was not a narrowly bookish existence. To protect\nhis health, he frequently escaped the damp chill of Oxford winters for\nthe kinder weather of southern English and Mediterranean seaside\nresorts. (In the course of one of these travels Bradley met an\nAmerican engineer named Radcliff, and fell in love with one of his\ndaughters, the mysterious E.R. of the dedications.) His metaphysics, a\nstriking combination of the rational and the mystical, makes more than\ngrudging room for the life of the senses and emotions, and his\nwritings, especially his posthumously published Aphorisms,\ncould not be the work of a man whose experience had been confined to\nthe study. He liked guns and disliked cats, indulging his preferences\neconomically by using the former to shoot the latter in the college\ngrounds at night.\n\nBradley’s political views are said to have been conservative,\nthough not of a narrowly doctrinaire kind. Although his writings\nreveal a religious temperament, he seems (judging by a letter of 1922)\nto have found the evangelical religiosity of his father’s\nhousehold oppressive, and, perhaps in consequence, the attitude to\nChristianity displayed later in his writings exhibits a certain\nambivalence; on the whole, he appears to have been a freethinker. (To\nimagine growing up amongst the members of the Clapham Sect, we might\nuse John Sutherland’s suggestion that the characters of Edmund\nand Fanny in Jane Austen’s Mansfield Park give us some\nidea of what they would have been like.)\n\nBradley’s public recognition included the conferring of the\nhonorary degree LL.D. by the University of Glasgow (1883), election to\nmembership of the Royal Danish Academy (1921), of the Accademia\ndei Lincei and the Reale Istituto Lombardo of Milan\n(1922), and election to an Honorary Fellowship of the British Academy\n(1923). In 1924, King George V bestowed on him, the first philosopher\nto be singled out for this very rare honour, the Order of Merit. Three\nmonths later, after a few days’ illness, he died from blood\npoisoning on 18th September, 1924. He is buried in Holywell Cemetery,\nOxford.\n2. Reputation\n\nAs the above (by no means complete) account of his public recognition\nreveals, in his own day Bradley’s intellectual reputation stood\nremarkably high: he was widely held to be the greatest English\nphilosopher of his generation, and although the idealists were never a\ndominant majority, amongst some philosophers the attitude towards him\nseems to have been one almost of veneration. The significance of his\nwork and its impact upon British philosophy were recognized by friends\nand foes. The second volume of J.H. Muirhead’s prestigious\nContemporary British Philosophy: Personal Statements —\na book which appeared shortly after Bradley’s death and\ncollected papers by all major philosophers of the time, including\nthinkers as hostile to the idealistic outlook as G.E. Moore —\nopens with the following dedication: ‘To F.H. Bradley, Order of\nMerit: To whom British Philosophy owed the impulse that gave it new\nlife in our time’.\n\nThis reputation began to collapse fairly quickly after his death. The\nreasons for this are complex, and include matters seemingly extraneous\nto philosophy itself, such as the reaction against British imperialism\n(whose moral and spiritual mission had been justified by some idealist\nphilosophers and undertaken by their pupils) following the Great War.\nOne more locally significant factor was the tendentious but still\ndamaging accounts of his views which appeared in the writings of Moore\nand Russell following their defection from the idealist camp.\nRussell’s widely read and justly celebrated ‘On\nDenoting’ provides a wonderful example of philosophical\npropaganda. Considering the question whether either ‘The King of\nFrance is bald’ or ‘The King of France is not bald’\nis true or false in the absence of a present King of France, Russell\nwittily observes that ‘Hegelians’ will conclude that he\nwears a wig. Russell had a special literary talent for producing\nremarks of this sort, which could not fail to leave their mark, as\nthere is no worse enemy than a charming irony. At the same time,\nRussell does not name any specific authors, nor does he address any\nspecific idealist theory. The whole of British Idealism is thus simply\ndismissed because of its alleged association with Hegel, here ably\nintroduced as the acme of absurdity.\n\nAnother factor was logical positivism, whose representatives\nrepudiated metaphysics in general as meaningless: in the first chapter\nof A.J. Ayer’s anti-metaphysical tract Language, Truth and\nLogic, Bradley is presented solely as a metaphysician and, on the\nbasis of a single out-of-context sentence, selected for ridicule (p.\n36). The chosen sentence (“the Absolute enters into, but is\nitself incapable of, evolution and progress”, which Ayer in fact\nslightly paraphrased from p. 442 of Appearance and Reality)\nwas Bradley’s expression of the familiar doctrine that ultimate\nreality, though changeless in itself, constitutes the ontological\nfoundation of our finite world of change and becoming. Ayer offered\nthis claim as an example of what he called\n‘pseudo-propositions’, that is, English sentences\nseemingly expressing a meaning but actually devoid of informative\ncontent; and his malicious remark that the quoted proposition was\ntaken ‘at random’ from Appearance and Reality was\nclearly designed to implant in the mind of the reader the idea that\nBradley’s book largely consisted of such pseudo-propositions.\nConsequent upon such influences was a change, inimical to idealism, in\nthe whole style of doing philosophy, a change characterized by the\ndevelopment of formal logic and the new respect paid to the\ndeliverances of common sense and of ordinary language. Bradley’s\nhighly wrought prose and his confidence in the metaphysician’s\nright to adjudicate on the ultimate truth began to seem alien to a\nlater generation of philosophers reared on a mixture of plain talk and\nformalization and encouraged to defer to mathematics and empirical\nscience. But stylistic choices are not philosophically neutral; no one\nengaged in producing a system of revisionary metaphysics is likely to\naccept limitations imposed by ordinary language.\n\nSuch influences ensured that a misleading and dismissive stereotype of\nBradley became current among analytic philosophers and established in\ntheir textbooks, so that serious discussion of his work largely\ndisappeared. One result has been that, despite his seminal influence\non Russell and their extended controversy over fundamental matters,\nbooks and articles on Russell can contain few or even no references to\nBradley. Another is that the incidental textbook references to some of\nBradley’s most characteristic, original and significant views,\ne.g. on relations and on truth, are often based on hostile\ncaricatures. With a few exceptions (for instance, McTaggart’s\nargument for the unreality of time), discussion of the work of the\nidealists has been sparse since the nineteen thirties. Discussion of\nBradley began to revive, as did his reputation, in the nineteen\nseventies, continuing through the following decades up to the present\nday. This reorientation does not usually go with an attempt at\nvindicating Bradley’s overall philosophical outlook. It stands\nrather in close connection with a revival of interest in the origins\nof analytic philosophy partly prompted by Rorty’s critique in\nPhilosophy and the Mirror of Nature. Rorty’s attack\nencouraged analytic philosophy to self-examination and led some\nthinkers within that tradition to re-examine the foundational myths at\nthe basis of their own ways of practising and conceiving of\nphilosophy.\n\nThese efforts produced significant results; several monographs and\ncollections became available that correct the inherited\nmisconceptions, discussing Bradley’s philosophy in a more\nbalanced manner. There has also been a revival of interest in his\ncritical examination of the concept of relation within the field of\nanalytic ontology, yet with apparently little interest and\nappreciation of those broader speculative issues that so much mattered\nto him. At the time of writing it is clear that he is still widely\nunderrated; it is, however, far from clear that his reputation will\never again stand as high as it did in his own lifetime.\n3. Philosophy of History\n\nBradley’s first substantial contribution to philosophy was the\npublication in 1874 of his pamphlet ‘The Presuppositions of\nCritical History’. Although it was not widely noticed at the\ntime, it did have an impact on the thinking of R.G. Collingwood, whose\nepistemology of history, like Bradley’s, evinces a certain\nscepticism concerning historical facts and the authority of testimony,\nand it has had a considerable subsequent influence. Bradley’s\nviews were inspired by his reading of German biblical critics, and\nsuch views have been prominent since in religious studies, where a\nreluctance to take at face value testimony of the occurrence of\nmiracles which violate the laws of nature is appropriate. But\nBradley’s attempt to extend this reluctance to historical\nreports in general underestimates the contrast between the uniformity\nof nature and the variety of human history.\n\nAlthough its overall argument cannot be regarded as satisfactory, the\npamphlet is nevertheless worth reading both for its historical\nsignificance and for its value as a fairly brief introduction to\nBradley’s thought. Some characteristic later themes, such as the\nfallibility of individual judgments and the rejection of\ncorrespondence accounts of truth, here make an early appearance; and\nBradley’s philosophical style — often obscure, typically\ndisdainful of illustrative example, and by late twentieth-century\nstandards uncomfortably literary — can be seen in high\nrelief.\n4. Ethics\n\nBradley’s views on ethics were expressed at length in his first\nwidely acknowledged publication, Ethical Studies (1876). One\nreason it was noticed is that the book is highly polemical. (Sidgwick\ncalled it ‘vehemently propagandist’ in his Mind\nreview.) He did not change these views significantly in later years:\nin 1893 he described it as ‘a book which, in the main, still\nexpresses my opinions’ (Appearance and Reality, p.\n356n) and at the time of his death was working on a second edition\nwhich, characteristically, was to retain the original text intact but\nincorporate additional matter.\n\nBradley says in his Preface that his object is ‘mainly\ncritical’ and that the ethical theory of his time rests on\n‘preconceptions metaphysical and psychological’, which are\n‘confused or even false’. In this the most Hegelian of his\nbooks, his approach is, in a series of connected essays, to work\ndialectically through these erroneous theories towards a proper\nunderstanding of ethics. Accordingly he tells us that the essays\n‘must be read in the order in which they stand’, and a\ncorollary of this is that the common practice of extracting one or two\nof them (usually the brilliantly written ‘Pleasure for\nPleasure’s Sake’ and ‘My Station and Its\nDuties’) from the whole, on the basis of their individual\nmerits, can result in a misleading impression of their significance\nwithin Bradley’s moral thinking: neither represents some\nfinished position.\n\nThe development of this proper understanding begins by examining the\n‘vulgar’ notion of moral responsibility and the apparent\nthreats to it posed by the philosophical doctrines of determinism and\nindeterminism, threats which he argues evaporate once we examine the\nreality of human action. (A prominent theme in the book is that\neveryday moral thought is not to be overturned by moral philosophy.)\nIt proceeds by turning to the question ‘Why should I be\nmoral?’, which he answers by suggesting that the moral end for\neach of us is self-realization. What this is, is then gradually\nunfolded through examination of representative philosophical theories\neach of which is rejected as unsatisfactory because of its one-sided\nconcentration upon particular features of the moral life.\nNevertheless, he thinks, each theory captures something important\nwhich must not be forgotten in the proper understanding he aims at.\nFor example, in the third essay, ‘Pleasure for Pleasure’s\nSake’, a still-classic critique of hedonistic utilitarianism,\nBradley argues that its individualism is insupportable, as is its\nhedonistic conception of happiness as a pleasurable state identifiable\nindependently of the means by which it is attained (so that it could\nin principle be achieved more conveniently than through moral\nbehaviour). But purged of these errors, the essential utilitarian\ninsight of the importance of happiness as the point of morality can be\nretained. Likewise, in the next essay’s examination of a Kantian\n(if not quite Kant’s) ethics of duty, he argues that from this\nconception of morality we should abandon, as the result of a false\nabstraction, its idea that duty should be done just for duty’s\nsake. We can, however, retain the insight that morality requires the\nperformance of individual duties, provided we are clear that\ntheir obligatoriness arises from the nature of each duty rather than\nfrom some formal principle.\n\nThese theories are inadequate because they have a deficient conception\nof the self, a deficiency he begins to remedy in the fifth essay, the\nfamous ‘My Station and Its Duties’, where he outlines a\nsocial conception of the self and of morality with such vigour that it\nis understandable that the mistaken idea that it expresses his own\nposition has gained some currency. This Hegelian account of the moral\nlife, in which the self is fully realized by fulfilling its role in\nthe social organism which grounds its duties, is clearly one which\ngreatly attracted Bradley, and he seems never to have noticed the\nimplicit tension between the metaphysical account of the self as\nnecessarily social and the moral injunction to realize the self in\nsociety. But he finally acknowledges its inadequacy, pointing out, for\ninstance, that any actual society may exhibit moral imperfections\nrequiring reform from the standpoint of an ideal which cannot be\nexemplified in the roles available within that society. This leads him\nnaturally into the next essay’s consideration of ideal morality,\nwhere he discusses the scope of morality’s demands on the\nindividual, and, by a further natural extension, into the seventh\nessay’s discussion of the distinction between the good and the\nbad self, a discussion which involves an attempted demonstration that\nthe bad self is a kind of unrealizable parasite on the good. This is\nnecessary to his enterprise: without it, he could not hope to make\nplausible his suggestion that the aim of morality is self-realization.\nBut in one way the enterprise still founders: the final essay argues\nthat morality is ultimately self-contradictory, depending for its\nexistence on the evil it seeks to overcome. Realization of the ideal\nself is thus unattainable through morality, but the book closes by\nsuggesting that it is still possible in religion.\n\nSome of Bradley’s metaphysical ideas are displayed in his\ndefence of his moral philosophy. An example is his claim that the self\nis a concrete universal and that the ethical doctrines he criticizes\nare damaged by their reliance upon abstract notions of the self. The\nself is universal in that it retains its identity over time\nand through many different actions, thus collecting together the\nseries of abstract particulars which make up its history in a way\nanalogous to that in which the abstract universal red\ncollects together its scattered individual instances (now often called\n‘tropes’); it is concrete in that, unlike\nred it is a real non-abstract individual. For such claims to\nbe fully convincing, a developed system in which the underlying\nmetaphysical ideas are fully worked out is needed, as he himself\nadmitted. But in this later working out, most of it in Appearance\nand Reality, the expression ‘concrete universal’\nalmost disappears from Bradley’s vocabulary, mainly because he\neventually concludes that there can be only one such thing;\nnevertheless, the idea involved remains, reappearing in the form of\nthe recurring theme that abstraction is falsification, and in this\nform is central to his logic and his metaphysics.\n5. Logic\n\nBradley’s most sustained treatment of logic comes in The\nPrinciples of Logic, published contemporaneously with\nFrege’s Grundlagen. The benefit of hindsight provides a\nstriking contrast between these works, the former apparently looking\nback to the nineteenth century, the latter anticipating the twentieth.\nWhile both books eschew formal methods, in Frege’s case this\nresults merely from an attempt to give a readable account of some\napplications of mathematical logic. But the absence of formulae\n(theorems, axioms, rules of inference) from Bradley’s book is\nintrinsic to it, expressing an opposition (shared by Mill) to the\nformalization of reasoning in principle, as detaching\ninference from the practical acquisition of scientific knowledge.\nThis, together with the fact that familiar terms (e.g.\n‘contradiction’) are used in unfamiliar ways, gives the\nbook an archaic feel. Nevertheless, and despite the fact that\nPrinciples would no longer ordinarily be consulted by a\nmodern logician unless for historical purposes, it focuses on issues\ncentral to logic, and the impression of its being backward-looking is\nto some extent misleading: for example, it uses the older vocabulary\nof ‘ideas’ and ‘judgments’ to express views\nwhich, often through their (selective) impact upon Russell, gave rise\nto doctrines subsequently expressed in terms of sentences and\npropositions; and it effectively exposed the notions of meaning and\nreference to a sceptical scrutiny which has continued long since.\n\nAlthough the treatment is less rigidly dialectical than that of\nEthical Studies, Bradley develops his views through criticism\nof others, and alters them as he goes along. One result is that the\nbook is far from easy to consult, and a reader determined to\nfind out what Bradley thinks must be prepared to follow its argument\nthrough many twists and turns, including occasional incursions into\nthe fields of epistemology, phenomenology, and metaphysics.\n\nTraditionally, logic books came divided into three parts, dealing\nrespectively with Conception (usually via ideas, the\ntraditional components of judgments), Judgment and Inference. Bradley\nboth inherits and transforms this tradition, keeping the three-part\nformat but devoting the first to Judgment and both second and third\nparts to Inference, thus dropping the separate treatment of\nConception. This is significant in that it reflects his rejection of\nthe standard view that judgments are formed by somehow conjoining\nideas: for example, the Port-Royal Logic’s Aristotelian\nclaim that they are ‘necessarily composed of three elements\n— the subject-idea, the attribute, and the joining of these two\nideas’. Bradley attacks such doctrines on more than one\nfront.\n\nHe argues, for instance, that those who, like Hume, think judgments to\nconsist of separable ideas, fail to identify the sense of\n‘idea’ in which ideas are important to logic: ideas in\nthis sense are not separate and datable psychological events (such as\nmy now visualizing a rainbow) but abstract universals. Once ideas are\nproperly understood, he suggests, they can no longer even plausibly be\nthought of as individual and mutually independent entities which can\nbe put together to create a judgment (as Locke maintains in Chapter\nXIV of Book IV of An Essay Concerning Human Understanding):\nthe order of dependence is the opposite, ideas being abstractions from\ncomplete judgments. This theory could be aptly referred to as the\n‘monistic’ theory of judgment, as the parallel with\nBradley’s metaphysical views is immediately evident: the\nrejection of independent substances held together by relational ties\ngoes hand in hand with the rejection of independent ideas held\ntogether by the copula. Equally evident is the challenge this poses\nfor earlier conceptions of analysis as the decomposition of a complex\ninto its simple constituents, for on this view there are no\nconstituents to begin with. Here, albeit in his archaic vocabulary,\nBradley identifies in advance the difficulties which Russell was later\nto face in trying to reconcile the unity of the proposition with what\nhe thought to be the mutual independence of its constituents,\ndifficulties which appeared in another guise for Frege in his attempt\nto maintain a strict division between concepts and objects.\n\nFurther, given that ideas are universals, accounts like that of\nPort-Royal make it impossible to see how judgment can be about\nreality, since its ideas represent kinds of things, while those real\nthings themselves are particular; so long as judgment is confined to\nideas, there can be no unique identification of any item about which\nwe judge. Bradley applies the point to language, arguing that even\ngrammatically proper names and demonstratives are disguised general\nterms. Even spatial and temporal specifications (X as the object/event\noccupying location Z at time Y) fail as unambiguous principles of\nindividuation; they would indeed be able to successfully individuate\nparticular objects/events within a given spatiotemporal series, yet\nthey would not be able to differentiate one spatiotemporal series from\nanother. The final outcome is that reference cannot be fixed solely in\nterms of language and abstract descriptions; it rather presupposes an\nimmediate encounter in reality through our experience.\n\nThese insights appear to anticipate that application of\nRussell’s Theory of Descriptions in which it is used to\neliminate grammatical names in favour of quantified general sentences.\nWhether or not this is actually the origin of that theory, there is no\ndoubt in another case: Russell, who claimed in correspondence to have\nread Principles closely, acknowledged openly that he was\nconvinced by Bradley’s argument that the logical form of\nuniversal sentences is hypothetical (so that, e.g., ‘All cows\neat grass’ is to be understood as saying ‘If anything is a\ncow then it eats grass’). In this way, Bradley had a\nsignificant, if indirect, impact on predicate calculus. His role as a\nprecursor of modern logic should not be overemphasized, however, since\nhe acknowledges that the interpretation of universal sentences as\nhypothetical was suggested to him by his reading of Herbart.\n\nBradley’s own account of judgment is that it is ‘the act\nwhich refers an ideal content ... to a reality beyond the act’,\nso that the logical form of every judgment is ‘Reality is such\nthat, if anything is S then it is P’. This formulation makes\nintelligible what is superficially paradoxical in Bradley, when he\nsays: ‘All judgments are categorical, for they all do affirm\nabout the reality, and assert their content of that. Again, all are\nhypothetical, for not one of them can ascribe to reality its content\nunconditionally’ (Principles, Bk I, Ch. II, sec. 79,\nmodified according to Bradley’s notes to the Second Edition). It\nis not hard to see in this an informal anticipation of the\nrepresentation of sentences in terms of a combination of universal\nquantifier and object- and predicate-variables. Consider also\nBradley’s treatment of sentences about fictional entities, such\nas ‘There are no ghosts’. On Bradley’s analysis,\nthis turns out to be a condensed form for ‘Reality is no place\nwhere ghosts exist’. One sees here the close similarity with\nRussell’s Theory of Descriptions, where a negative existential\nlike ‘Pegasus does not exist’ is not a statement about a\nnon-existent Pegasus, but simply asserts that the universe of\ndiscourse (now playing the logical function of Bradley’s\n‘Reality’) does not contain any individuals that possess\nall features ascribed to Pegasus in books of mythology. (Here as\nelsewhere the book looks forward as well as back.)\n\nDespite these significant steps in the direction of later logical\ntheories, it is an exaggeration to claim, as some have done, that\nBradley’s strictures on the account of judgment as a combination\nof ideas mean that he is straightforwardly opposed to psychologism in\nlogic, for it is clear that he thinks logic’s subject matter to\nbe mental acts, not sentences or statements. This is already evident\nin his definition of judgement as ‘the act which refers an ideal\ncontent... to a reality beyond the act’ (Principles, Bk\nI, Ch. I, sec. 10).\n\nBradley continues to criticize traditional logic when he turns from\njudgment to inference. Just as he rejected the Aristotelian account of\njudgments as combinations of subject and predicate, he rejects\nAristotelian syllogistic (for the same reason as he later rejects\nMill’s canons of induction): it misses the fact that reasoning\ncan take place only through the generality involved in universals.\nUniversals are thus essential to inference, and for this reason\nHume’s account of inference in terms of the association of ideas\ncollapses: Humean ideas are particulars, fleeting episodes which\ncannot be revived by association. This does not mean that association\nof ideas is impossible, but genuine association (which Bradley calls\n‘redintegration’) can involve only universals.\n\nSurprisingly for those who subscribe to the common view, first\nbroadcast by Russell in 1900 in A Critical Exposition of the\nPhilosophy of Leibniz and much repeated thereafter, that Bradley\nthought all judgments to be of subject/predicate form and accordingly\nfailed to recognize relational judgments as a distinct kind,\nBradley’s treatment of inference includes the complaint that the\nmathematical logics of his time cannot represent valid relational\ninferences. His own initial account of inference is that it is\n‘ideal experiment’: ‘ideal’ in that these are\nthought-experiments which remain in the realm of idea, but\nnevertheless experiments in that their results are not guaranteed in\nadvance by a complete set of logical laws which infallibly determine\ntheir own application (a view reminiscent of Wittgenstein). But later,\nafter a long and tangled consideration of the question of how it is\npossible for a deductive inference to be reflected in reality, he\ncomes up with a revised account: ‘Every inference is the ideal\nself-development of an object taken as real’\n(Principles, Terminal Essay I, p. 598). Bradley seems here to\nbe following the Humean idea that there are no logical relations\nbetween distinct existences: the reason that valid inference can be\nreflected in reality is that it can never take one beyond the original\nsubject matter.\n\nMuch of The Principles of Logic is polemical, and it affords\noccasional examples of Bradley at his funniest and most acerbic, such\nas this note to a short chapter criticizing Herbert Spencer’s\nview of the nature of inference (Bk II, Pt II, Ch. II, sec. 14, n.\n3),\n\nWith regard to Mr. Spencer’s view I would suggest, as a\npossibility, that it never was taken from the facts, but was a\ndevelopment of or from something about Comparison which he found in\nHamilton. Reading so few books, Mr. Spencer was naturally more at the\nmercy of those he did read.\n\n\nand this passing swipe at Hamilton himself (Bk II, Pt II, Ch. I, sec.\n9), \n\nThis may be called the law of Redintegration. For we may take this\nname from Sir W. Hamilton (Reid, p. 897), having found\nnothing else that we could well take.\n\n\nIt is clear that much of Bradley’s criticism of his predecessors\nand contemporaries expresses his hostility to the sort of\npsychological atomism evident in extreme form in Hume but equally to\nbe found presupposed in accounts of judgment like those mentioned\nabove. What Bradley particularly objected to about such views is that\nthe particulars (ideas) which they treated as realities in their own\nright, and out of which judgments are said to be composed, are\nanything but: far from being themselves genuine individuals, they are\nabstractions from the continuous whole of psychological life and\nincapable of independent existence. This is an early version of a\nholism which has since had many adherents. But he then goes on to\npoint out that judgments too involve abstractions, since the subject\nmatter of any judgment is necessarily detached from its background\n(as, for example, ‘Julius Caesar crossed the Rubicon’\ndetaches the river from its location and the general from his army)\nand this process inevitably misrepresents the way things really are.\nThus the objections which Bradley deployed against misleading accounts\nof logic now begin to pose a threat against logic itself by eroding\nthe integrity of the judgments which go into its inferences, and he\nends Principles in a sceptical vein by suggesting that no\njudgment is ever really true nor any inference fully valid.\n\nIn addition to his discussion of the nature of ideas, judgment and\nreference, the emphasis he gives to the notion of truth is another\nmain way in which he helped shaping the agenda of later analytic\nphilosophy. At this point Bradley’s attempt to write a book on\nlogic without getting entangled in metaphysics begins to succumb to\nhis doubts about the notion of truth. He holds that logic presupposes\na correspondence theory of truth (he calls it the ‘copy’\ntheory), but it is apparent that he thinks this theory metaphysically\ninadequate: indeed, he marshals against it counter-examples drawing\non, e.g., disjunctions, counter-examples which had to await the theory\nof truth-functions before they could be accommodated. In Essays on\nTruth and Reality he takes these ideas further, arguing for\n‘the identity of truth knowledge and reality’ (p. 113) and\nvehemently rejecting all alternatives, including not solely the\ncopy-theory, but also any understanding of the concept of truth in\nterms of pragmatic success. It could hardly be clearer that Bradley\nholds an identity theory of truth, and although he is commonly\nbelieved to have been a supporter of a coherence theory of truth (and\nis standardly identified as such in the textbooks), this common belief\nis at the very least greatly misleading. However, the combination of\nthe identity theory and his metaphysical doctrine that reality is a\nunified whole enables coherence to be deduced from his views as a\nconsequence, and he himself thought the test of truth to be\n‘system’, a notion under which he included what is\ncommonly meant by coherence; this explains why he has so often been\nthought to be a coherence theorist. It might be thought that his\nfamous attack on the Hegelian idea that the rational is the real\n(Principles Bk III, Pt II, Ch. IV, sec. 16) is inconsistent\nwith his holding an identity theory of truth: but the two are\nreconciled through his doctrine of degrees of truth, a doctrine which\nhas to be understood within the context of his metaphysics.\n6. Metaphysics\n\nAfter the completion of The Principles of Logic, Bradley\nturned to the task of giving a full account of his metaphysics. The\nresult was Appearance and Reality (1893). But Bradley was\nphilosophically active for a further thirty years thereafter,\ncontinuing to elucidate, defend and refine his views, and engaging\nwith critics and rivals (notably, and revealingly for both sides, with\nRussell). Concentration upon Appearance and Reality alone,\ntherefore, risks placing undue weight upon what turn out to be\ntemporary features of thought or expression, and this has in fact\ncontributed to the distorted impressions of his thinking so often to\nbe found in the textbooks of analytic philosophy.\n\nAppearance and Reality is divided into two books. The first,\n‘Appearance’, is brief, and its aim destructive, arguing\nthat ‘the ideas by which we try to understand the\nuniverse’ all bring us ultimately to contradictions when we try\nto think out their implications. Some of these ideas belong especially\nto philosophy, such as the view that only the primary qualities are\nreal and the Kantian notion of a thing-in-itself; others, for instance\nthe notions of cause, motion, self, space, thing and time, are\ndeployed in everyday life. The second book, ‘Reality’, is\nlong; its aim is to provide a positive account of the Absolute —\nthe ultimate, unconditioned reality as it is in itself, not distorted\nby projection through the conceptual mechanisms of thought. A large\nproportion of his discussion is devoted to consideration of natural\nobjections to this positive account.\n\nMuch of Book I involves presentation of familiar suggestions which\nmake only part of Bradley’s case: he alleges, for example, that\nmotion involves paradoxes, and that primary qualities alone cannot\ngive us reality, for they are inconceivable without secondary\nqualities, and that the notion of the thing-in-itself is\nself-contradictory, for if we really know nothing about it, then not\neven that it exists. But Chapters II and III — respectively\nentitled ‘Substantive and Adjective’ and ‘Relation\nand Quality’, are uniquely Bradleian, alarming in the breadth of\ntheir implications, and have caused intermittent controversy ever\nsince. In generalized form, Bradley’s contention is that\nrelations (such as greater than) are unintelligible either\nwith or without terms, and, likewise, terms unintelligible either with\nor without relations. Bradley himself says of the arguments he wields\nin support of this contention (p. 29),\n\nThe reader who has followed and has grasped the principle of this\nchapter, will have little need to spend his time on those which\nsucceed it. He will have seen that our experience, where relational,\nis not true; and he will have condemned, almost without a hearing, the\ngreat mass of phenomena.\n\n\nIt is clear that his views on relations are both highly controversial\nand central to his thought. In view of this, it would appear a serious\ntactical error on Bradley’s part to present his arguments so\nsketchily and unconvincingly that even sympathetic commentators have\nnot found it easy to defend him, while C.D. Broad was able to say\nlater, ‘Charity bids us avert our eyes from the pitiable\nspectacle of a great philosopher using an argument which would\ndisgrace a child or a savage’ (Examination, p. 85).\n\nIn spite of Bradley’s laconic style, however, the exegetical\nerrors of his critics are hard to justify. The impression that\nBradley’s crucial metaphysical arguments are negligible arises\nin part from reading them as designed to prove the doctrine of the\ninternality of all relations — that is, either (1) their\nreducibility to qualities, or (2) their holding necessarily, depending\non the sense of ‘internal’, Russell having interpreted the\ndoctrine in the former way, Moore in the latter. Whichever sense we\ntake, this is a misreading — and an impossible one, if we take\n‘internal’ in Russell’s sense, because of\nBradley’s rejection of the subject/predicate account of judgment\nas ‘erroneous’. If, however, we use Moore’s sense of\n‘internal’, the reading is understandable, albeit still\ninexcusable: in Chapter III Bradley confusingly applies this word to\nrelations in a metaphysically innocent way which has no connection\nwith the doctrine of internality as this is understood by Moore, while\nin other parts of Appearance and Reality he openly flirts\nwith the doctrine of internality, repudiating it clearly only in later\nworks less often read, such as the important essay\n‘Relations’ left incomplete at his death and published in\nhis Collected Essays of 1935. Further, Bradley does uniformly\nreject the reality of external relations, and it is easy, though not\nlogically inevitable, to interpret this as a commitment to the\ndoctrine of internality.\n\nBradley’s treatment of relations originates in Chapter II with a\ndiscussion of the problem of what makes the unity of an individual\nthing. How can we make sense of the fact that a single thing,\nsuch as, say, a lump of sugar, is capable of holding a\nplurality of different properties into a unity, such as its\nsweetness, whiteness and hardness? We cannot postulate the existence\nof an underlying substance distinct from its qualities, for this would\ncommit us to the existence of a naked, bare particular, the absurd\nconception of a something devoid of all qualities. Moreover, the\noriginal difficulty as to the unity of the thing is left unsolved by\nthis move, since it becomes possible to ask what it is that binds the\nqualities to their substance. The alternative is to conceive the thing\nas a collection of qualities, yet what is the nature of the\nontological tie that binds them into the unity of the thing? We are\nleft with an aggregate of independent, substance-like\nqualities, rather than with an individual thing. At this\npoint, the problem of relations emerges in its full ontological\nsignificance, for it now looks as if only a relation could provide the\nrequired nexus.\n\nBradley’s considered view in Chapter III is that neither\nexternal nor internal relations possess unifying power and must\ntherefore be rejected as unreal. This is the proper conclusion of a\nset of condensed arguments which he deploys as a team, systematically\nexcluding the possible positions available to those who would\ndisagree. One crucial consideration is based upon the insight that a\nrelation is the ‘ground’ of its terms as well as\n‘founded’ upon them. ‘So far as I can see’, he\nsays, ‘relations must depend upon terms, just as much as terms\nupon relations’ (Appearance, p. 26). The relation is\nsaid to ‘depend’ upon its terms, because it requires at\nleast two terms in order to exist; and terms ‘depend’ upon\nrelations, because they are partly constituted by the relationships in\nwhich they stand to one another (albeit Bradley provides no\nillustration, this can be made plausible by considering two different\nshades of colour: blue would not be blue, if it were not darker than\nyellow). Once this is recognized, Bradley goes on to argue, one sees\nthat a related term A is really made up of two parts, one\nfunctioning as the foundation of the relation, A1, and the\nother determined by it, A2. Thus, each related term turns out\nto be a relational complex, in this specific case, A turning\nout to be the complex R(A1,A2). This\nlaunches a regress, for by the same logic A1 and A2\nwill have to be made up of two distinct parts, and so on without\nend.\n\nThe member of Bradley’s team of arguments which has attracted\nthe greatest polemical attention, however, is the one which alleges\nthat if a relation were a further kind of real thing along with its\nterms (as, e.g., Russell later assumed in his multiple relation theory\nof judgment), then a further relation would be required to relate it\nto its terms, and so on ad infinitum. It is clear from this\nargument (which is an obvious descendant of The Principles of\nLogic’s attack on the traditional analysis of judgment), as\nwell as from his own explanation, that for him ‘real’ is a\ntechnical term: to be real is to be an individual substance (in the\nsense commonly found in Descartes, Leibniz and Spinoza). On this\nunderstanding, to deny the reality of relations is to deny that they\nare independent existents. It is this argument which explains\nreactions like Broad’s: in common with others, he took Bradley\nto be assuming that relations are a kind of object, when what Bradley\nwas doing was arguing by a kind of reductio against that very\nassumption.\n\nThese remarks make it clear that Bradley is using the term\n‘appearance’ in an ontological sense, as referring to what\nlacks full individuality, rather than in an epistemological sense, as\nreferring to what is present to a subject. And indeed, he does not\nwish to deny the obvious fact that we experience a rich diversity of\nthings; relations and plurality in some sense exist, and\ntherefore belong to reality. The denial of the reality of relations\ndoes not imply their absolute non-existence; rather, his conclusion is\nthat relations and terms should be conceived as aspects within an\nall-embracing whole. Instead of ascribing to Bradley the doctrine of\ninternality, it would therefore be better to see him as advocating a\n‘holistic’ theory of relations. As against Russell,\nBradley was wholly explicit on this fundamental point:\n\nThis is the doctrine for which I have now for so many years contended.\nRelations exists only in and through a whole which can not\n[sic] in the end be resolved into relations and terms.\n‘And’, ‘together’ and ‘between’,\nare all in the end senseless apart from such a whole. The opposite\nview is maintained (as I understand) by Mr. Russell... But for myself,\nI am unable to find that Mr. Russell has ever really faced the\nquestion. (Principles, 2nd edn, Ch. II, additional note 50).\n\n\nInterestingly, one philosopher who faced Bradley’s question\nsquarely was Russell’s pupil, Wittgenstein. In his\nTractatus he tried to avoid Bradley’s regresses by\ngetting rid of relations. His simple objects do enter into the\nformation of unified facts, yet no extraneous connecting principle is\nrequired:‘In the atomic fact objects hang one in another, like\nthe links of a chain.’ (2.03). The metaphor of a chain, however,\nprovides no real answer to the problem raised by Bradley, especially\nso in light of the fact that it is all but clear that\nWittgenstein’s logico-ontological atoms can be said to possess a\nform; surely, they differ from Democritean atoms in that they lack\nmaterial properties (cf. 2.0331 and 2.0232). Moreover, Bradley could\nstill argue that the very idea of two distinct but unrelated objects\nmakes little sense.\n\nThe implications of Bradley’s treatment of relations are not\nsolely metaphysical; they are also epistemological. Some have thought\nthat the denial of the reality of relations amounts to the assertion\nthat all relational judgments are false, so that it is, for example,\nnot true that 7 is greater than 3 or that hydrogen is lighter than\noxygen. Such an interpretation is made credible by Bradley’s\naccount of truth, for on that account no ordinary judgment is ever\nperfectly true; in consequence, to one who reads him under the\ninfluence of the later but anachronistic assumption that truth is\ntwo-valued, his claim appears to be that relational judgments are all\nfalse. On Bradley’s account of truth, however, while for\nordinary purposes it is true that 7 is greater than 3 and false that\noxygen is lighter than hydrogen, once we try to meet the more exacting\ndemands of metaphysics we are forced to recognize that truth admits\ndegrees and that, while the former is undoubtedly more true than the\nlatter, it is not fully true. The imperfection of even the more true\nof these judgments, though, is nothing to do with the its being\nrelational rather than predicative. For, as was observed above in the\nsection on Logic, Bradley thought all judgments to be defective in\nthat representation can proceed only on the basis of separating in\nthought what is not separate in reality: when, for example, we say\n‘These apples are hard and sour’, we not only implicitly\nabstract the apples from their container but detach the hardness and\nsourness from each other and abstract them from the apples themselves.\nA perfect truth, one completely faithful to reality, would thus have\nto be one which did not abstract from reality at all; and this means\nthat it would have to be identical with the whole of reality and\naccordingly no longer even a judgment. The final truth about reality\nis, on Bradley’s view, quite literally and in principle\ninexpressible. Eventually, it is this mystical conclusion which\nexplains his forceful rejection of Hegel’s panlogism;\ncontrary to Hegel’s view in the Science of Logic,\nReality is not a system of interrelated logical categories, but\ntranscends thought altogether.\n\nIt is, however, possible to give an outline. The impression of\nreality’s consisting of a multiplicity of related objects is a\nresult of the separations imposed by thought; in fact ‘the\nAbsolute is not many; there are no independent reals.’ (All\nquotations from here on are from Appearance and Reality, Ch.\nXIV.) Reality is one — but one what? Experience, he says, in a\nwide sense of the term: ‘Feeling, thought and volition (any\ngroups under which we class psychological phenomena) are all the\nmaterial of existence, and there is no other material, actual or even\npossible.’ The immediate argument he gives for this unintuitive\ndoctrine is brief to the point of offhandedness, merely challenging\nthe reader to think otherwise without self-contradiction; his greater\nconcern is to make it quite clear that this experience does not belong\nto any individual mind, and his doctrine not a form of solipsism. But\nhe is not quite as offhand as he appears, for he soon makes clear that\nhe thinks the whole book to be a best-explanation argument for this\nobjective (or absolute) idealism: ‘This conclusion will, I\ntrust, at the end of my work bring more conviction to the reader; for\nwe shall find that it is the one view which will harmonize all\nfacts.’\n\nSo ‘the Absolute is one system, and ... its contents are nothing\nbut sentient experience. It will hence be a single and all-inclusive\nexperience, which embraces every partial diversity in concord. For it\ncannot be less than appearance, and hence no feeling or thought, of\nany kind, can fall outside its limits.’ But how can we\nunderstand this diversity to be possible, when it cannot be accounted\nfor through terms and relations? Bradley’s answer is that we\ncannot understand this in detail, but can get some grasp on what he\nmeans by considering a pre-conceptual state of immediate experience in\nwhich there are differences but no separations, a state from which our\nfamiliar, cognitive, adult human consciousness arises by imposing\nconceptual distinctions upon the differences. Reality is like this\nprimitive state, but not exactly like, for it transcends thought\nrather than falls short of it, and everything, even conceptual thought\nitself, is included in one comprehensive and harmonious whole.\nAppearances thus contribute to Reality in a fashion analogous to the\nways in which segments of a painting contribute to the whole work of\nart: detached from their background, they would lose their\nsignificance and might in isolation even be ugly; in context, they can\nthemselves be beautiful and make an essential contribution to the\nbeauty and integrity of the whole.\n\nSuch limited comparisons are all the help we can get in understanding\nthe Absolute and its relation to its appearances: Bradley rejects as\nimpossible the demand for detailed explanations of how phenomena like\nerror and evil belong to the Absolute, instead trying to shift the\nburden of proof to critics who express confidence in their\nincompatibility. His general answer is that anything that exists, even\nthe worst of evils, is somehow real: the Absolute must comprehend both\nevil and good. But, just as truth admits of degrees, a judgment being\nless true the further it is from comprehending the whole of reality,\nso (consistent with ‘the identity of truth knowledge and\nreality’) reality itself admits of degrees, a phenomenon being\nthe less real the more it is just a fragmentary aspect of the whole.\nThe Absolute is in such a way further from evil than from good, but is\nitself neither, transcending them both as it transcends even religion\n— it is in a sense a Supreme Being, but not a personal God. The\nproper object of a complete system of metaphysics should be that of\nadjudicating the relative degree of reality of any fragmentary\nexistent, yet as some critics objected, it is difficult to see how\nthis could be carried out even in principle, given Bradley’s\ncontention that the Absolute is, strictly speaking, unknowable.\n\nBradley also devotes some time to a consideration of issues that arise\nin the philosophy of nature; albeit it is evident that he feels the\nattraction of panpsychism, this is a view he never explicitly\nendorses. As T.S. Eliot recognized, a Leibnizian strand pervades\nBradley’s philosophy, one which finds expression in his doctrine\nof finite centres of experience. On this view, the Absolute\narticulates itself in a plurality of lesser sentient wholes, unified\npsychical individuals of the nature of the human soul. Bradley thus\ncomes close to holding something very like a theory of monads, yet\nthis is incorporated within the general framework of his monistic\nmetaphysics. Interestingly, the doctrine of the Absolute can be seen\nas a solution to the problem of monadic interaction; like\nLeibniz’s monads, Bradley’s finite centres are incapable\nof a direct sharing of content (e.g., they are said to be ‘not\ndirectly pervious to each other’; Appearance, p. 464)\nand of causal interaction; however, they are coordinated to one\nanother in that they are all partial manifestations of the same\noverarching Reality. A similar attempt at reconciling Absolute\nIdealism and monadism had been made by Lotze, and in both cases it\nremains an open question whether this is not pre-established harmony\nin disguise. What is clear but usually overlooked is that Bradley\nhimself saw Leibnizian monadism as the greatest challenge to his own\nbrand of idealism: ‘Monadism’, he says, ‘on the\nwhole will increase and will add to the difficulties which already\nexist’ (Appearance, p. 102). He was surely right in\nthis, as later British metaphysicians — such as James Ward,\nJ.M.E. McTaggart, Herbert Wildon Carr, and Alfred North Whitehead\n— preferred Leibniz over Kant and Hegel as their main source of\ninspiration.\n\nIn Bradley’s often rhapsodic descriptions of the Absolute, a\nconception of the world based both on his sceptical scrutiny of the\ninadequacies of philosophers’ accounts of judgment — and,\nit is clear, on a kind of personal experience of a higher unity which\nin another context might have made him one of the world’s\nrevered religious mystics —, we can see why, at the start of\nthis article, his metaphysics was described as ‘a striking\ncombination of the rational and the mystical’. The very\nidiosyncrasy of this combination has meant that few subsequent\nphilosophers have been convinced by it. Nevertheless, in its bold and\ndirect confrontation of what he called ‘the great problem of the\nrelation between Thought and Reality’, it stands in Western\nphilosophy as a permanent and unsettling challenge to the capacity of\ndiscursive thought to display the world without distortion; unsettling\nbecause it arises, not from the imposition of an external standard\nwhich could be rejected as arbitrary or inappropriate, but from the\ndemand that our mechanisms of representation meet the standards they\nthemselves implicitly set.\n",
    "bibliography": {
        "categories": [
            "Works by Bradley",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Works by Bradley": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Ethical Studies</em>, London: Oxford University Press, 1876;\nsecond edition, with notes: London: Oxford University Press,\n1927.",
                "<em>The Principles of Logic</em>, London: Oxford University Press,\n1883; second edition, revised, with commentary and terminal essays,\nLondon: Oxford University Press, 1922; corrected impression,\n1928.",
                "<em>Appearance and Reality</em>, London: Swan Sonnenschein, 1893;\nsecond edition, with an appendix, London: Swan Sonnenschein, 1897;\nninth impression, corrected, Oxford: Clarendon Press, 1930. Pages\nreferences above are to the ninth impression.",
                "<em>Essays on Truth and Reality</em>, Oxford: Clarendon Press,\n1914.",
                "<em>Aphorisms</em>, Oxford: privately printed at the Clarendon\nPress, 1930.",
                "<em>Collected Essays</em>, Oxford: Clarendon Press, 1935.",
                "<em>Writings on Logic and Metaphysics</em>, edited and with\nintroductions by James W. Allard and Guy Stock, Oxford: Clarendon\nPress, 1994.",
                "<em>The Collected Works of F.H. Bradley</em>, 12 volumes, edited\nand introduced by W.J. Mander and Carol A. Keene, Bristol: Thoemmes,\n1999.\n</ul>\n<p>\nThe more recent of the editions produced in Bradley’s lifetime\nare the ones now usually cited and the most useful: while the earlier\ntext is left intact, Bradley’s later thoughts are added in the\nform of notes, appendices and essays, enabling the reader to trace the\nchanges in his ideas. (Such additional material is particularly\nextensive in the <em>Logic</em>, where Bradley frequently defers to\nBosanquet’s criticisms of the first edition.) <em>Collected\nEssays</em> contains the two pamphlets ‘The Presuppositions of\nCritical History’ (1874) and ‘Mr Sidgwick’s\nHedonism’ (1877) as well as the valuable unfinished essay on\nrelations (1923–4) and a good bibliography. Between them, this\nbook and the important <em>Essays on Truth and Reality</em> contain\nall his articles of any substance; these are the versions normally\ncited. <em>Aphorisms</em>, after many years out of print, appeared in\n1993 (bound together with ‘Presuppositions of Critical\nHistory’ and an introduction by Guy Stock) in a facsimile\nedition (Bristol: Thoemmes Press). Bradley’s unpublished papers,\nnotebooks and letters received are in the library of Merton College,\nOxford. Correspondence between Bradley and Russell is in the Russell\nArchives at McMaster University; interesting extracts appear on pp.\n349–353 of Volume 6 of <em>The Collected Papers of Bertrand\nRussell</em> (London: Routledge 1992). The John Rylands Library of the\nUniversity of Manchester has letters from Bradley to Samuel Alexander.\nMuch previously unpublished material was made available in the 1999\n<em>Collected Works</em>. [In 2003 Thoemmes Press, the publisher of\nthe <em>Collected Works</em>, was acquired by the Continuum\nInternational Publishing Group Ltd. The name of the imprint changed\nfrom “Thoemmes” to “Thoemmes Continuum”.] </p>\n<h3>"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Allard, J.W., 2005, <em>The Logical Foundations of Bradley’s\nMetaphysics: Judgment, Inference, and Truth</em>, Cambridge: Cambridge\nUniversity Press.",
                "Ayer, A.J., 1946, <em>Language, Truth and Logic</em>, London:\nVictor Gollanz.",
                "Babushkina, D., 2016, ‘F.H. Bradley’s Conception of\nthe Moral Self: A New Reading’, in W.J. Mander and S. Panagakou\n(eds.), <em>British Idealism and the Concept of the Self</em>,\nBasingstoke: Palgrave MacMillan.",
                "Baldwin, T., 1984, ‘Moore’s rejection of\nidealism’, in R. Rorty, J.B. Schneewind and Q. Skinner (eds.),\n<em>Philosophy in History</em>, Cambridge: Cambridge University\nPress.",
                "Basile, P., 1999, <em>Experience and Relations: An Examination of\nF.H. Bradley’s Conception of Reality</em>, Berne: Paul\nHaupt.",
                "–––, 2014, ‘Bradley’s\nMetaphysics’, in W. J. Mander (ed.), <i>The Oxford Handbook of\nBritish Philosophy in the Nineteenth Century</i>, Oxford: Oxford\nUniversity Press, pp. 189–208.",
                "Bradley, J., 1985, ‘The Critique of Pure Feeling: Bradley,\nWhitehead and the Anglo-Saxon Metaphysical Tradition’,\n<em>Process Studies</em>, 14(4): 253–64.",
                "–––, (ed.), 1996, <em>Philosophy after F.H.\nBradley</em>, Bristol: Thoemmes.",
                "Broad, C.D., 1933, <em>Examination of McTaggart’s\nPhilosophy</em> (Vol. I), Cambridge: Cambridge University Press.",
                "Campbell, C.A., 1931, <em>Scepticism and Construction:\nBradley’s Sceptical Principle as the Basis of Constructive\nPhilosophy</em>, London: George Allen and Unwin Ltd.",
                "Candlish, S., 1978, ‘Bradley on My Station and Its\nDuties’, <em>Australasian Journal of Philosophy</em>, 56(2):\n155–70.",
                "–––, 1989, ‘The Truth about F.H.\nBradley’, <em>Mind</em>, 98(391): 331–48.",
                "––– 2007, <em>The Russell/Bradley Dispute and\nits Significance for Twentieth-Century Philosophy</em>, Basingstoke:\nPalgrave Macmillan; paperback edition 2009.",
                "Coady, C.A.J., 1992, <em>Testimony</em>, Oxford: Clarendon\nPress.",
                "Eliot, T.S., 1916, <em>Knowledge and Experience in the Philosophy\nof F.H. Bradley</em>, London: Faber, 1964.",
                "Ferreira, P., 1999, <em>Bradley and the Structure of\nKnowledge</em>, Albany, NY: State University of New York Press.",
                "Gaskin, R., 1995, ‘Bradley’s Regress, the Copula and\nthe Unity of the Proposition’, <em>The Philosophical\nQuarterly</em>, 45(179): 161–80.",
                "Horstmann, R.P., 1984, <em>Ontologie und Relationen</em>,\nKoenigstein: Athenaeum.",
                "Hylton, P., 1990, <em>Russell, Idealism, and the Emergence of\nAnalytic Philosophy</em>, Oxford: Clarendon Press.",
                "Ingardia, R. (ed.), 1991, <em>Bradley: A Research\nBibliography</em>, Bowling Green, Ohio: Philosophy Documentation\nCenter. [Warning: This volume contains many errors, mostly trivial;\ne.g., many of the articles attributed to Cresswell are by\nCrossley.]",
                "MacEwen, P. (ed.), 1996, <em>Ethics, Metaphysics and Religion in\nthe Thought of F.H. Bradley</em>, Lewiston, NY: The Edwin Mellen\nPress.",
                "MacNiven, D., 1987, <em>Bradley’s Moral Psychology</em>,\nLewiston, NY: The Edwin Mellen Press.",
                "Mander, W., 1994, <em>An Introduction to Bradley’s\nMetaphysics</em>, Oxford: Clarendon Press.",
                "–––, 1995, ‘Bradley’s Philosophy of\nReligion’, <em>Religious Studies</em>, 31(3):\n285–301.",
                "––– (ed.), 1996, <em>Perspectives on the Logic\nand Metaphysics of F.H. Bradley</em>, Bristol: Thoemmes.",
                "–––, 2011, <em>British Idealism. A History</em>,\nOxford: Oxford University Press.",
                "––– (ed.), 2014, <em>The Oxford Handbook of\nBritish Philosophy in the Nineteenth Century</em>, Oxford: Oxford\nUniversity Press.",
                "Manser, A., 1983, <em>Bradley’s Logic</em>, Oxford:\nBlackwell.",
                "Manser, A. and Stock, G. (eds.), 1984, <em>The Philosophy of F.H.\nBradley</em>, Oxford: Clarendon Press; reprinted in paperback\n1986.",
                "McHenry, L.B., 1992, <em>Whitehead and Bradley. A Comparative\nAnalysis</em>, Albany:, NY: State University of New York Press.",
                "Muirhead, J.H., 1925, <em>Contemporary British Philosophy:\nPersonal Statements</em>, second series, London: George Allen and\nUnwin Ltd.",
                "Nicholson, P., 1990, <em>The Political Philosophy of the British\nIdealists: Selected Studies</em>, Cambridge: Cambridge University\nPress, ‘Study I’.",
                "Passmore, J., 1969, ‘Russell and Bradley’, in R. Brown\nand C.D. Rollins (eds.), <em>Contemporary Philosophy in\nAustralia</em>, London: George Allen and Unwin, pp. 21–30.",
                "Phemister, P., 2016, ‘Leibnizian Pluralism and Bradleian\nMonism: A Question of Relations’, <em>Studia Leibnitiana</em>,\n45: 61–82.",
                "Russell, B., 1905, ‘On Denoting’, <em>Mind</em>,\n14(56): 479–93.",
                "Sprigge, Timothy, 1983, <em>The Vindication of Absolute\nIdealism</em>, Edinburgh: Edinburgh University Press.",
                "–––, 1993, <em>James and Bradley: American Truth\nand British Reality</em>, Chicago &amp; La Salle, Illinois: Open\nCourt.",
                "–––, 2010, ‘The Problem of Evil for\nAbsolute Idealism’, in J. Connelly and S. Panagakou (eds.),\n<em>Anglo-American Idealism: Thinkers and Ideas</em>,\nOxford-Bern-Berlin: Peter Lang, pp. 165–180.",
                "Stock, G. (ed.), 1998, <em>Appearance versus Reality</em>, Oxford:\nClarendon Press.",
                "Taylor, A.E., 1924–5, ‘Francis Herbert Bradley,\n1846–1924’, <em>Proceedings of the British Academy</em>,\n11(2): 458–468.",
                "Vallicella, V., 2002, ‘Relations, Monism and the Vindication\nof Bradley’s Regress’, <em>Dialectica</em>, 56(1):\n3–35.",
                "Ward, J., 1925, ‘Bradley’s Doctrine of\nExperience’, <em>Mind</em>, 34(133): 13–38. [This issue is\na memorial volume; it also includes articles on Bradley by A.E.\nTaylor, G.F. Stout, G. Dawes Hicks and J.H. Muirhead.]",
                "Wollheim, R., 1956, ‘F.H. Bradley’, in Ayer, A.J. et\nal., <em>The Revolution in Philosophy</em>, London: Macmillan, pp.\n12–25.",
                "–––, 1969, <em>F.H. Bradley</em>, Harmondsworth:\nPenguin, second edition.\n</ul>\n<p>\nFrom 1995 to 2004 (inclusive) there appeared a journal, <em>Bradley\nStudies</em>, which described itself as “aim[ing] to publish\ncritical and scholarly articles on philosophical issues arising from\nBradley’s writings and from those of related authors [and] to\ninclude each year an ongoing list of what has been published on\nBradley and related themes.” In 2005, the journal was\namalgamated with another to form <em>Collingwood and British Idealism\nStudies: incorporating Bradley Studies</em>. Enquiries about back\nissues of the journal in its previous incarnation should be directed\nto its then Editor\n <a href=\"mailto:william.mander@manchester.oxford.ac.uk\">William Mander</a>.</p>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Works by Bradley</h3>\n<ul class=\"hanging\">\n<li><em>Ethical Studies</em>, London: Oxford University Press, 1876;\nsecond edition, with notes: London: Oxford University Press,\n1927.</li>\n<li><em>The Principles of Logic</em>, London: Oxford University Press,\n1883; second edition, revised, with commentary and terminal essays,\nLondon: Oxford University Press, 1922; corrected impression,\n1928.</li>\n<li><em>Appearance and Reality</em>, London: Swan Sonnenschein, 1893;\nsecond edition, with an appendix, London: Swan Sonnenschein, 1897;\nninth impression, corrected, Oxford: Clarendon Press, 1930. Pages\nreferences above are to the ninth impression.</li>\n<li><em>Essays on Truth and Reality</em>, Oxford: Clarendon Press,\n1914.</li>\n<li><em>Aphorisms</em>, Oxford: privately printed at the Clarendon\nPress, 1930.</li>\n<li><em>Collected Essays</em>, Oxford: Clarendon Press, 1935.</li>\n<li><em>Writings on Logic and Metaphysics</em>, edited and with\nintroductions by James W. Allard and Guy Stock, Oxford: Clarendon\nPress, 1994.</li>\n<li><em>The Collected Works of F.H. Bradley</em>, 12 volumes, edited\nand introduced by W.J. Mander and Carol A. Keene, Bristol: Thoemmes,\n1999.</li>\n</ul>\n<p>\nThe more recent of the editions produced in Bradley’s lifetime\nare the ones now usually cited and the most useful: while the earlier\ntext is left intact, Bradley’s later thoughts are added in the\nform of notes, appendices and essays, enabling the reader to trace the\nchanges in his ideas. (Such additional material is particularly\nextensive in the <em>Logic</em>, where Bradley frequently defers to\nBosanquet’s criticisms of the first edition.) <em>Collected\nEssays</em> contains the two pamphlets ‘The Presuppositions of\nCritical History’ (1874) and ‘Mr Sidgwick’s\nHedonism’ (1877) as well as the valuable unfinished essay on\nrelations (1923–4) and a good bibliography. Between them, this\nbook and the important <em>Essays on Truth and Reality</em> contain\nall his articles of any substance; these are the versions normally\ncited. <em>Aphorisms</em>, after many years out of print, appeared in\n1993 (bound together with ‘Presuppositions of Critical\nHistory’ and an introduction by Guy Stock) in a facsimile\nedition (Bristol: Thoemmes Press). Bradley’s unpublished papers,\nnotebooks and letters received are in the library of Merton College,\nOxford. Correspondence between Bradley and Russell is in the Russell\nArchives at McMaster University; interesting extracts appear on pp.\n349–353 of Volume 6 of <em>The Collected Papers of Bertrand\nRussell</em> (London: Routledge 1992). The John Rylands Library of the\nUniversity of Manchester has letters from Bradley to Samuel Alexander.\nMuch previously unpublished material was made available in the 1999\n<em>Collected Works</em>. [In 2003 Thoemmes Press, the publisher of\nthe <em>Collected Works</em>, was acquired by the Continuum\nInternational Publishing Group Ltd. The name of the imprint changed\nfrom “Thoemmes” to “Thoemmes Continuum”.] </p>\n<h3>Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Allard, J.W., 2005, <em>The Logical Foundations of Bradley’s\nMetaphysics: Judgment, Inference, and Truth</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Ayer, A.J., 1946, <em>Language, Truth and Logic</em>, London:\nVictor Gollanz.</li>\n<li>Babushkina, D., 2016, ‘F.H. Bradley’s Conception of\nthe Moral Self: A New Reading’, in W.J. Mander and S. Panagakou\n(eds.), <em>British Idealism and the Concept of the Self</em>,\nBasingstoke: Palgrave MacMillan.</li>\n<li>Baldwin, T., 1984, ‘Moore’s rejection of\nidealism’, in R. Rorty, J.B. Schneewind and Q. Skinner (eds.),\n<em>Philosophy in History</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Basile, P., 1999, <em>Experience and Relations: An Examination of\nF.H. Bradley’s Conception of Reality</em>, Berne: Paul\nHaupt.</li>\n<li>–––, 2014, ‘Bradley’s\nMetaphysics’, in W. J. Mander (ed.), <i>The Oxford Handbook of\nBritish Philosophy in the Nineteenth Century</i>, Oxford: Oxford\nUniversity Press, pp. 189–208.</li>\n<li>Bradley, J., 1985, ‘The Critique of Pure Feeling: Bradley,\nWhitehead and the Anglo-Saxon Metaphysical Tradition’,\n<em>Process Studies</em>, 14(4): 253–64.</li>\n<li>–––, (ed.), 1996, <em>Philosophy after F.H.\nBradley</em>, Bristol: Thoemmes.</li>\n<li>Broad, C.D., 1933, <em>Examination of McTaggart’s\nPhilosophy</em> (Vol. I), Cambridge: Cambridge University Press.</li>\n<li>Campbell, C.A., 1931, <em>Scepticism and Construction:\nBradley’s Sceptical Principle as the Basis of Constructive\nPhilosophy</em>, London: George Allen and Unwin Ltd.</li>\n<li>Candlish, S., 1978, ‘Bradley on My Station and Its\nDuties’, <em>Australasian Journal of Philosophy</em>, 56(2):\n155–70.</li>\n<li>–––, 1989, ‘The Truth about F.H.\nBradley’, <em>Mind</em>, 98(391): 331–48.</li>\n<li>––– 2007, <em>The Russell/Bradley Dispute and\nits Significance for Twentieth-Century Philosophy</em>, Basingstoke:\nPalgrave Macmillan; paperback edition 2009.</li>\n<li>Coady, C.A.J., 1992, <em>Testimony</em>, Oxford: Clarendon\nPress.</li>\n<li>Eliot, T.S., 1916, <em>Knowledge and Experience in the Philosophy\nof F.H. Bradley</em>, London: Faber, 1964.</li>\n<li>Ferreira, P., 1999, <em>Bradley and the Structure of\nKnowledge</em>, Albany, NY: State University of New York Press.</li>\n<li>Gaskin, R., 1995, ‘Bradley’s Regress, the Copula and\nthe Unity of the Proposition’, <em>The Philosophical\nQuarterly</em>, 45(179): 161–80.</li>\n<li>Horstmann, R.P., 1984, <em>Ontologie und Relationen</em>,\nKoenigstein: Athenaeum.</li>\n<li>Hylton, P., 1990, <em>Russell, Idealism, and the Emergence of\nAnalytic Philosophy</em>, Oxford: Clarendon Press.</li>\n<li>Ingardia, R. (ed.), 1991, <em>Bradley: A Research\nBibliography</em>, Bowling Green, Ohio: Philosophy Documentation\nCenter. [Warning: This volume contains many errors, mostly trivial;\ne.g., many of the articles attributed to Cresswell are by\nCrossley.]</li>\n<li>MacEwen, P. (ed.), 1996, <em>Ethics, Metaphysics and Religion in\nthe Thought of F.H. Bradley</em>, Lewiston, NY: The Edwin Mellen\nPress.</li>\n<li>MacNiven, D., 1987, <em>Bradley’s Moral Psychology</em>,\nLewiston, NY: The Edwin Mellen Press.</li>\n<li>Mander, W., 1994, <em>An Introduction to Bradley’s\nMetaphysics</em>, Oxford: Clarendon Press.</li>\n<li>–––, 1995, ‘Bradley’s Philosophy of\nReligion’, <em>Religious Studies</em>, 31(3):\n285–301.</li>\n<li>––– (ed.), 1996, <em>Perspectives on the Logic\nand Metaphysics of F.H. Bradley</em>, Bristol: Thoemmes.</li>\n<li>–––, 2011, <em>British Idealism. A History</em>,\nOxford: Oxford University Press.</li>\n<li>––– (ed.), 2014, <em>The Oxford Handbook of\nBritish Philosophy in the Nineteenth Century</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Manser, A., 1983, <em>Bradley’s Logic</em>, Oxford:\nBlackwell.</li>\n<li>Manser, A. and Stock, G. (eds.), 1984, <em>The Philosophy of F.H.\nBradley</em>, Oxford: Clarendon Press; reprinted in paperback\n1986.</li>\n<li>McHenry, L.B., 1992, <em>Whitehead and Bradley. A Comparative\nAnalysis</em>, Albany:, NY: State University of New York Press.</li>\n<li>Muirhead, J.H., 1925, <em>Contemporary British Philosophy:\nPersonal Statements</em>, second series, London: George Allen and\nUnwin Ltd.</li>\n<li>Nicholson, P., 1990, <em>The Political Philosophy of the British\nIdealists: Selected Studies</em>, Cambridge: Cambridge University\nPress, ‘Study I’.</li>\n<li>Passmore, J., 1969, ‘Russell and Bradley’, in R. Brown\nand C.D. Rollins (eds.), <em>Contemporary Philosophy in\nAustralia</em>, London: George Allen and Unwin, pp. 21–30.</li>\n<li>Phemister, P., 2016, ‘Leibnizian Pluralism and Bradleian\nMonism: A Question of Relations’, <em>Studia Leibnitiana</em>,\n45: 61–82.</li>\n<li>Russell, B., 1905, ‘On Denoting’, <em>Mind</em>,\n14(56): 479–93.</li>\n<li>Sprigge, Timothy, 1983, <em>The Vindication of Absolute\nIdealism</em>, Edinburgh: Edinburgh University Press.</li>\n<li>–––, 1993, <em>James and Bradley: American Truth\nand British Reality</em>, Chicago &amp; La Salle, Illinois: Open\nCourt.</li>\n<li>–––, 2010, ‘The Problem of Evil for\nAbsolute Idealism’, in J. Connelly and S. Panagakou (eds.),\n<em>Anglo-American Idealism: Thinkers and Ideas</em>,\nOxford-Bern-Berlin: Peter Lang, pp. 165–180.</li>\n<li>Stock, G. (ed.), 1998, <em>Appearance versus Reality</em>, Oxford:\nClarendon Press.</li>\n<li>Taylor, A.E., 1924–5, ‘Francis Herbert Bradley,\n1846–1924’, <em>Proceedings of the British Academy</em>,\n11(2): 458–468.</li>\n<li>Vallicella, V., 2002, ‘Relations, Monism and the Vindication\nof Bradley’s Regress’, <em>Dialectica</em>, 56(1):\n3–35.</li>\n<li>Ward, J., 1925, ‘Bradley’s Doctrine of\nExperience’, <em>Mind</em>, 34(133): 13–38. [This issue is\na memorial volume; it also includes articles on Bradley by A.E.\nTaylor, G.F. Stout, G. Dawes Hicks and J.H. Muirhead.]</li>\n<li>Wollheim, R., 1956, ‘F.H. Bradley’, in Ayer, A.J. et\nal., <em>The Revolution in Philosophy</em>, London: Macmillan, pp.\n12–25.</li>\n<li>–––, 1969, <em>F.H. Bradley</em>, Harmondsworth:\nPenguin, second edition.</li>\n</ul>\n<p>\nFrom 1995 to 2004 (inclusive) there appeared a journal, <em>Bradley\nStudies</em>, which described itself as “aim[ing] to publish\ncritical and scholarly articles on philosophical issues arising from\nBradley’s writings and from those of related authors [and] to\ninclude each year an ongoing list of what has been published on\nBradley and related themes.” In 2005, the journal was\namalgamated with another to form <em>Collingwood and British Idealism\nStudies: incorporating Bradley Studies</em>. Enquiries about back\nissues of the journal in its previous incarnation should be directed\nto its then Editor\n <a href=\"mailto:william.mander@manchester.oxford.ac.uk\">William Mander</a>.</p>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Related Entries\n\nBosanquet, Bernard",
            "Frege, Gottlob",
            "Green, Thomas Hill",
            "Hegel, Georg Wilhelm Friedrich",
            "Lotze, Hermann",
            "McTaggart, John M. E.",
            "monism",
            "Moore, George Edward",
            "Russell, Bertrand",
            "truth: identity theory of"
        ],
        "entry_link": [
            {
                "../bosanquet/": "Bosanquet, Bernard"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../green/": "Green, Thomas Hill"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../hermann-lotze/": "Lotze, Hermann"
            },
            {
                "../mctaggart/": "McTaggart, John M. E."
            },
            {
                "../monism/": "monism"
            },
            {
                "../moore/": "Moore, George Edward"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../truth-identity/": "truth: identity theory of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bradley\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/bradley/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=bradley&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/bradley/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bradley": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/bradley/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=bradley&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/bradley/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}