{
    "url": "callicles-thrasymachus",
    "title": "Callicles and Thrasymachus",
    "authorship": {
        "year": "Copyright © 2017",
        "author_text": "Rachel Barney\n<rachel.barney@utoronto.ca>",
        "author_links": [
            {
                "http://individual.utoronto.ca/rbarney/Home.html": "Rachel Barney"
            },
            {
                "mailto:rachel%2ebarney%40utoronto%2eca": "rachel.barney@utoronto.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2017</a> by\n\n<br/>\n<a href=\"http://individual.utoronto.ca/rbarney/Home.html\" target=\"other\">Rachel Barney</a>\n&lt;<a href=\"mailto:rachel%2ebarney%40utoronto%2eca\"><em>rachel<abbr title=\" dot \">.</abbr>barney<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Aug 11, 2004",
        "substantive revision Thu Aug 31, 2017"
    ],
    "preamble": "\n\nCallicles and Thrasymachus are the two great exemplars in philosophy\nof contemptuous challenge to conventional morality. Both are\ncharacters in Platonic dialogues, in the Gorgias and Book I\nof the Republic respectively; both denounce the virtue of\njustice, dikaiosunê, as an artificial brake on\nself-interest, a fraud to be seen through by intelligent people.\nTogether, Thrasymachus and Callicles have fallen into the folk\nmythology of moral philosophy as ‘the immoralist’ (or\n‘amoralist’). These are perhaps not quite the right words,\nbut it is useful to have a label for their common \nchallenge—more generally, for the figure who demands a good reason to abide by\nmoral constraints, and denies, implicitly or explicitly, that this\ndemand can be\n met.[1]\n Because of this shared agenda, and because Socrates’ refutation\nof Callicles can be read as an unsatisfying rehearsal for the\nRepublic, it is tempting to assume that the two share a\nsingle philosophical position. But in fact Callicles and Thrasymachus\nare by no means interchangeable; and the differences between them are\nimportant both for the interpretation of Plato and philosophically,\nfor our understanding of the varieties of immoralism and the\nmotivations behind it. This article discusses both the common\nchallenge presented by these two figures and the features which\nseparate them, treating them strictly as players in Plato’s\nphilosophical dramas. (Thrasymachus was a real person, a famous\ndiplomat and orator of whose real views we know only a little; of\nCallicles we know nothing, and he may even be Plato’s\n invention.)[2]\n It will also compare them to a third Platonic version of the\nimmoralist challenge, the one presented by Glaucon and Adeimantus in\nRepublic Book II, and to the writings of sophist \nAntiphon—the best-known real-life counterpart of all three Platonic\nviews, and perhaps their historical original. Certain aspects of\nPlato’s own arguments against immoralism will also be discussed,\ninsofar as they help to clarify what Callicles and Thrasymachus\nthemselves have to say.\n",
    "toc": [
        {
            "#Just": "1. Justice"
        },
        {
            "#Thra": "2. Thrasymachus"
        },
        {
            "#SocrVsThra": "3. Socrates vs. Thrasymachus[4]"
        },
        {
            "#Call": "4. Callicles"
        },
        {
            "#SocrVsCall": "5. Socrates vs. Callicles"
        },
        {
            "#ConcThraCallGlauAnti": "6. Conclusion: Thrasymachus, Callicles, Glaucon, Antiphon"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ImmoChal": "The immoralist challenge"
        },
        {
            "#GreeMoraTradSophTheiSociContInclAnti": "The Greek moral tradition, the Sophists and their social context (including Antiphon)"
        },
        {
            "#ThraRepuInclGlau": "Thrasymachus and the Republic (including Glaucon)"
        },
        {
            "#CallGorg": "Callicles and the Gorgias"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Justice\n\nWhat exactly is it that both Thrasymachus and Callicles reject? Greek\nhandily distinguishes between ‘justice’ as a virtue\n[dikaiosunê] and the abstractions ‘justice’\n[dikê, sometimes personified as a goddess] and\n‘the just’ [or ‘what is just’, to\ndikaion, the neuter form of the adjective ‘just’,\nmasc. dikaios]. The history of these concepts is complex, and\nit would be wrong to assume that Greek moral concepts were ever neatly\ndefined or uncontested. Still, Hesiod’s Works and Days\n(c. 700 B.C.E.), a very early and canonical text for traditional Greek\nmoral thought, provides a useful baseline for later debates. Hesiod\ndoes not define justice, but the injustices he denounces include\nbribery, oath-breaking, perjury, theft, fraud, and the rendering of\ncrooked verdicts by judges. There are two kinds of underlying unity to\nthis list, each of which relates justice to another central concept in\nancient Greek ethics. First, all such actions are prohibited by\nnomos. This crucial term may be translated either\n‘law’ or ‘convention’, depending on the\ncontext; nomoi include not only written statutes but\nunwritten laws and traditional, socially enforced norms of behavior.\nHesiod’s just man is above all a law-abiding one, and the\nassociation of justice and nomos runs deep in Greek thought.\nHowever, nomos is also an ambiguous and open-ended concept:\nin the fifth century B.C.E. sophistic thinkers come to use it with the\nvery different sense of mere convention—or, as we might now\nsay, social construction—and this development is an important\npart of the background to immoralism. The second common denominator of\nHesiodic injustice is that unjust actions are ones typically prompted\nby pleonexia, best translated ‘greed’ (see Balot\n2001). The unjust man is motivated by the desire to have more\n[pleon echein]: more than he has, more than his neighbor has,\nmore than he is entitled to, and, ultimately, all there is to get.\nThese polarities of the lawful/unlawful and the restrained/greedy are\nlater used by Aristotle to structure his discussion of justice in\nNicomachean Ethics V, which is in many ways a rational\nreconstruction of traditional Greek thought about justice. \n\nHesiod also sets out the origins, authority, and rewards of justice.\nHere he is explicit: \n\nThe son of Kronos [i.e., Zeus] has set down this law [nomos]\nfor human beings:\n\nFish and animals and winged birds\n\nEat each other, since there is no justice [dikê] among\nthem.\n\nBut to humans he has given justice [dikê], which turns\nout the best\n\nBy far. And if one knows and is willing to proclaim what is just\n[ta dikaia],\n\nZeus far-sounding gives him wealth. (Works and Days 276–81)\n\n\nJustice derives from nomos in the sense of a divinely\nordained Law; and Hesiod emphasises that Zeus’ laws are\nenforced. Punishment may not be visited directly on the unjust\nindividual, however: rather, a whole city suffers for the injustice of\nits leaders, and retribution may fall on a man’s descendants.\nMoreover, Hesiod seems at one point to waver, and allows that if the\nwicked go unpunished, we would not have good reason to be just\n(270–3). Doubts about the reliability of divine rewards and\npunishments are later an important part of the motivation for the\nimmoralist challenge; in Republic Book II, Adeimantus\ncomplains that the poets are inconsistent on this point, and anyway\nthe rewards and punishments they promise do not show what is good and\nbad about justice and injustice in themselves (362d–367e).\n\nHesiod represents only one side of early Greek moral thought. The\nother foundational poet of the Greek tradition, Homer, has less to say\nexplicitly about justice; more important for later debates is his\nbroader conception of aretê, which can equally well be\ntranslated ‘virtue’ or ‘excellence’. Justice\nis understood to be a part of aretê; or, as we would\nsay, it is a virtue. More particularly it is the virtue\ngoverning social interactions and good citizenship or leadership. In\nthe world of the Iliad and Odyssey,\naretê is understood as that set of skills and aptitudes\nwhich enables someone—paradigmatically, a noble \nwarrior—to function successfully in his social role. The key virtues\nof the Homeric warrior are courage and practical intelligence, which\nenable him to be an effective ‘speaker of words and doer of\n deeds’.[3]\n\n\nNow this ‘functional’ conception of virtue, as we may call\nit, can easily come into conflict with Hesiodic ideas about justice.\nIn Plato’s Meno, Meno proposes an updated version of\nthe functional conception: a man’s virtue consists in the\npolitical skills which enable him to harm his enemies and help his\nfriends, without incurring harm to himself (71e). Such a view would\nhave been at least intelligible to Homer’s warriors; but it\nseems to involve giving up on Hesiodic principles of justice. When\nacting as a judge, does the virtuous man give verdicts in accordance\nwith the law, or does he give whatever verdicts (‘crooked’\nones by Hesiod’s standards) will harm his enemies or help his\nfriends? \n\nSo Plato’s characters inherit a complex and not wholly coherent\nmoral tradition. Fifth-century moral debates were powerfully shaped by\nthe problematic relation of these ‘functional’ and\n‘Hesiodic’ ideas about the virtues (see Adkins 1960); and\nthe Gorgias and Book I of the Republic locate\nCallicles and Thrasymachus in just this context. In the\nGorgias, Socrates’ first interlocutor is the\nrhetorician Gorgias, who is led into self-contradiction by his\nunclarity on the question of whether his profession includes the\nteaching and practice of justice. His student Polus repudiates\nGorgias’ pretensions to justice, and claims that while it may be\nmore admirable than injustice, injustice is more beneficial to its\npractitioner. Socrates shows that Polus’ position too is\nultimately incoherent, and thus the stage is set for Callicles to\nreject justice (as conventionally understood) altogether, arguing that\nit is neither admirable nor beneficial. The Republic depicts\na strikingly similar dialectical progression, again from age to youth\nand from respectability to ruthlessness. It begins with a discussion\nbetween Socrates and the elderly, decent-seeming businessman Cephalus,\nwho offers (or at any rate assents to Socrates’ suggestion of) a\nmarkedly ‘Hesiodic’ account of justice as telling the\ntruth and returning what one owes (331c). But Cephalus’ son\nPolemarchus, on ‘inheriting’ the argument, glosses\nreturning what one owes in Meno-esque terms: justice is rendering help\nto one’s friends and harm to one’s enemies (332a–b). We\nseem to move instantly from Hesiod to a degenerate version of the\n‘functional’ conception, expressive of Athenian politics\nin an era of brutal, almost gangster-like factional strife. Neither\nCephalus nor Polemarchus seems to notice the conflict, but it runs\ndeep: justice cannot be at the same time (1) the Hesiodic virtue of\nthe good neighbour and solid citizen, involving obedience to law and\nthe restraint of pleonexia, and (2) a part of\naretê functionally understood, in a society in which\npleonexia and factional ruthlesssness are seen as the keys to\nsuccess. In sum, both the Gorgias and Book I of the\nRepublic reveal a society in some moral disorder, vulnerable\nto moral conflict and instability, with generational change used to\ndramatize a crumbling of Hesiodic norms. In both cases the upshot, to\nwhich Socrates must respond, is a fully formed challenge to justice\ntraditionally conceived. \n2. Thrasymachus\n\nThough the Gorgias was almost certainly written first of the\ntwo dialogues, Thrasymachus’ position can be seen as a kind of\nstepping-stone to Callicles’, so that it makes sense to begin\nwith him. Thrasymachus’ stance on justice is foreshadowed by his\nbehavior: he enters the discussion “like a wild beast about to\nspring” (336b5–6; tr. Grube-Reeve 1992 here and\nthroughout, sometimes with minor revisions), and this tone of\nimpatient aggression is sustained throughout his discussion with\nSocrates. As a professional sophist, however, Thrasymachus withholds\nhis definition of justice until Socrates’ other interlocutors\nhave promised to pay him for it. So from the very start, Thrasymachus\nis depicted as dominated by the characteristic drives of the two lower\nparts of the soul to be identified in Book IV: the appetitive part\n[epithumêtikon], which lusts after pleasure and the\nmoney to pay for it with, and the spirited part [thumos],\nwhich loves competition and victory. Though he proves quite a wily\ndebater, Thrasymachus’ reasoning abilities are used only as a\nmeans to these other, non-rational ends; and this subjugation of\nrationality to non-rational ends is, as we discover in Book IV,\nexactly what Plato holds injustice to consist in. Thrasymachus largely\ndisappears from the debate after Book I, but he evidently stays around\nfor the whole of the discussion; somewhat mysteriously, in Book VI\nSocrates refers to Thrasymachus and himself as “just now having\nbecome friends” (498d, cf. 450a–b).) \n\nThrasymachus eventually proposes a resounding slogan: “Justice\nis nothing other than the advantage of the stronger”\n(338c2–3). He explains that each kind of regime makes laws in\nthe interest of the ruling party: the mass of poor people in a\ndemocracy, the rich in an oligarchy, the tyrant in a tyranny.\n“And they declare what they have made—what is to their\nown advantage—to be just for their subjects…. This,\nthen, is what I say justice is, the same in all cities, the advantage\nof the established regime” (338e–339a). Thanks to this gloss of\nthe ‘stronger’ in terms of the ruling power,\nThrasymachus’ position has often been interpreted as a form of\n‘conventionalism’: justice in a given community is\nwhatever the laws of that community dictate, i.e., so he cynically\nexplains, whatever serves the ruling party’s interests. This\nconventionalist reading of Thrasymachus is probably not quite right,\nbut it makes a convenient starting-point for seeing what he does have\nin mind. The conventionalist position can be seen as a more formal\nversion of the Hesiodic association of just behavior with\nlaw-abidingness, and does not necessarily involve the cynical spin\nthat Thrasymachus gives it: in Xenophon’s Memorabilia,\nSocrates himself argues that the lawful [nomimon] and the\njust [dikaion] are the same (IV 4). Closer to Thrasymachus in\nspirit is the conventionalism to be found in the surviving fragments\nof On Truth by the sophist Antiphon (cf. section 6).\nAccording to Antiphon, “Justice [dikaiosunê]...\nis not violating the rules [nomima] of the city in which one\nis a citizen” (tr. Gagarin and Woodruff 1995). Antiphon goes on\nto contrast these rules of justice, which frustrate our nature and are\nonly erratically enforced, with the authoritative and irresistible\ndecrees of nature [phusis]. This contrast between\nnomos and phusis is a central tool of sophistic\nthought, used by a wide range of thinkers, Callicles included (see\nbelow, Section 4), in many different ways (see Kerferd 1981, Guthrie\n1971). Thrasymachus himself, however, never uses this theoretical\nframework (or, unless we count his concept of the ‘real\nruler’, any other)—a sign, perhaps, that he is meant to\nrepresent the immoralist position in its roughest and least\ntheoretical form, purporting to spring directly from empirical\nobservation of how law and justice work. \n\nTo these two opening claims, ‘Justice is the advantage of the\nstronger’ and ‘Justice is the advantage of the\nruler’, Thrasymachus adds a third, in the course of praising\ninjustice later on: ‘Justice is the advantage of another\nperson’ (343c). This certainly sounds like a non-conventionalist\nclaim about the underlying nature of justice, and it greatly\ncomplicates the interpretation of his position. Thrasymachus advances\nall three theses willingly, indeed with great conviction, and the\nthird seems intended as a clarification of the first two. Yet on the\nface of it they are far from equivalent, and it is not at all obvious\nwhich (if any) is most basic or best represents his real position. For\ninstance, what if I am the stronger (or the ruler): is it the\naction to my own advantage which is just, or the one which serves the\nother person? Worse, if either ‘the advantage of the\nstronger’ or ‘the advantage of the ruler’ is taken\nstrictly as a general definition, then the selfish behavior of a\nstrong, rapacious tyrant would have to count as just. But it obviously\ndoes not serve the interests of the other people affected by it; and\nindeed Thrasymachus, in conformity to normal usage, describes the\ntyrant as perfectly unjust (344a–c)—and praises him\nfor being so.\n\nIn recent decades interpretive discussion of Thrasymachus has revolved\naround proposed solutions to this puzzle, none of which has met with\ngeneral agreement. Argument continues as to whether his three theses\ncan be rendered consistent with each other, whether to do so requires\nlimiting the scope of one or all of them in some way (e.g., by\nexcluding rulers and applying only to the ruled), whether any of them\nshould be given priority as Thrasymachus’ intended\ndefinition of justice, and if so which one. Interpreters\ndetermined to render Thrasymachus the possessor of a coherent theory\nof justice have worked through the philosophical possibilities here\nwith great ingenuity and resourcefulness. However, all such readings\nrequire taking some of the things he says as less than fully or\nliterally meant, and it is anyway not obvious that Plato\nintends to present him as the proponent of a consistent and\nrigorous definition. The obvious alternative is to read his theses as\nrough slogans rather than attempts at definition, and as picking out\nthe typical effects of just behavior rather than attempting\nto analyse it or state its essence. So read, Thrasymachus is offering\na critique of justice, understood in rather traditional terms, not a\nnew theory or analysis of what justice is (cf. Anderson 2016 on\n‘genealogy’). As his later, clarificatory rant in praise\nof injustice makes clear (343b–4c), he assumes the\ntraditional Hesiodic understanding of justice, as obedience to\nnomos and restraint of pleonexia: his slogans are\nintended not to replace or revise that traditional conception but\nrather to offer a debunking or critique of justice so understood.\n(Hence his proclamation that justice is ‘nothing other’\nthan the advantage of the stronger: the locution is one of cynical\ndebunking, marking his own view as a ‘seeing-through’ and\ndemystification.) This critique is organized around two central\npoints. One is about the effects of just behavior, namely\nthat it benefits other people at the expense of just agents themselves\n(this is justice as the advantage of the other). The other is about\nthe function of moral language: talk of ‘justice’ is an\ninstrument of social control, a tool used by the powerful to\nmanipulate the weak (this is justice as the advantage of the stronger,\ni.e. the rulers). If we take these two points together, it turns out\nthat just persons are nothing but patsies or fools: they have\ninternalized the moralistic propaganda of the ruling party so that\nthey serve their interests rather than their own. \n\nOn this reading, Thrasymachus’ three theses are coherent, and\nunrestricted in their scope; but they are not definitions. They are\nexercises in social critique rather than philosophical analysis; and\nyet Thrasymachus’ debunking is not, and could not be, grounded\npurely on philosophically neutral ‘sociological’\nobservation. Thrasymachus is—on almost any reading –\nrelying on a further pair of assumptions, which we can also find on\ndisplay in the speeches of Callicles and of Glaucon in Book II, as\nwell as other contemporary texts. One is that wealth and power, and\nthe pleasures they provide, are  the goods in relation to\nwhich our ‘advantage’ must be assessed.\n(‘Good’ [agathon] and ‘advantage’\n[sumpheron] are equivalent terms in this context, and\n‘happiness’ [eudaimonia] is what they produce.)\nThe other is that these goods are zero-sum: for one member of\na community to have more of them is for another to have less. That is\nwhy just behavior on my part, which involves forgoing opportunities\nfor my own advantage out of respect for the law, inevitably serves the\nadvantage of other people—in particular, those who are willing\nto ‘take advantage’ of me (as we still say), and above all\nthe self-interested rulers who made the laws. These twin assumptions\nabout the nature of the good also shape Thrasymachus’ conception\nof rationality. The rational or intelligent man for him is one who,\nseeing through the mystifications of moral language, acts\nclear-sightedly to serve himself rather than others. When Socrates\nasks whether, then, he holds that justice is a vice, Thrasymachus\ninstead defines it as a kind of intellectual failure: “No, just\nvery high-minded simplicity,” he says, while injustice is\n“good judgment” and is to be “included with virtue\nand wisdom” (348c–e). \n\nThrasymachus’ conception of rationality as the clear-eyed\npursuit of pleonexia is most fully expressed in his idea of\nthe ‘real ruler’. This Thrasymachean ideal emerges only\nunder interrogation by Socrates; but it is evidently central to his\nthinking, and provides the framework for the arguments with Socrates\nwhich follow. Socrates begins by subjecting Thrasymachus to a classic\nelenchus—that is, a refutation which elicits a\ncontradiction from the interlocutor’s own assertions or\nadmissions (339b–340b). Thrasymachus has claimed both that (1) to do\nwhat the rulers prescribe is just, and (2) to do what is to the\nrulers’ advantage is just; and he readily admits that (3) rulers\nsometimes prescribe what is not to their advantage. It follows that\n(4) in some cases, it is both just and unjust to do as the rulers\nprescribe. On the assumption that nothing can be both just and unjust,\none of claims (1)–(3) must be given up. It comes as a bit of a\nsurprise that Thrasymachus chooses to repudiate (3), which seems to be\na matter of obvious fact, rather than (1) or (2). Plato emphasises the\npoint by having Cleitophon and Polemarchus provide color commentary on\nthe argument, with the former charitably suggesting that Thrasymachus\nmeant that the just is whatever the stronger decrees,\nthinking it is to his advantage—in effect, an\namendment to (2) which would make it equivalent to (1). But this\nsolution is vehemently rejected by Thrasymachus (340a–c). Instead, he\naffirms that, ‘strictly speaking’, no ruler ever errs. For\na ruler is properly speaking the practitioner of a craft\n[technê], just like a doctor; and, Thrasymachus\nexplains, when in premises (1) and (2) he speaks of the ruler it is in\nthis strict sense. And this expert ruler qua ruler does not err: by\ndefinition he acts as his craft of ruling demands. \n\nThrasymachus, it turns out, is passionately committed to this ideal of\nthe rational ruler ‘in the strict sense’, construed as the\nintelligently exploitative tyrant, and Socrates’ arguments\nagainst him soon zero in on it. Moreover, the ideal of the wholly\nrational ruler is the keystone of Plato’s own political\nphilosophy, soon to be elaborated as the\n‘philosopher-king’ of Republic V-VII (and again\nlater in his dialogue Statesman). So it is very striking that\nit is first introduced in the Republic not as a Socratic\nconcept but as a Thrasymachean one. Plato thus seems to mark it as an\nidea appropriated from the sophistic enemy; it is at any rate a\nprecious piece of common ground which can provide a starting-point for\narguments between Socrates and Thrasymachus, who otherwise agree on so\nlittle. \n\nBefore turning to those arguments, it is worth asking what\nThrasymachus’ ideal of the ruler in the strict sense adds to his\naccount of justice. It seems to confirm that he is no conventionalist:\nconventionalism involves treating all socially recognised laws as\nequal, whereas on Thrasymachus’ account not every ruler or act\nof legislation counts as the real thing. A trickier point is that\nThrasymachus’ glorification of tyranny renders retroactively\nambiguous his slogan, ‘Justice is the advantage of the\nstronger’. As initially presented, the point of this seemed to\nbe the claim noted earlier about the standard effects of just\nbehavior: just persons are the victims of everyone who is willing to\ntake advantage of them, and the ruling class in particular. But\nThrasymachus’ praise of the expert tyrant (343b–c) suggests\nanother interpretation. Perhaps his slogan also stands for a\nrevisionist normative claim: that it really is right and\nproper, part of the correct order of things, for the strong to take\nadvantage of the weak. This is precisely the claim that, as we will\nsee, is expressed in the Gorgias by Callicles’ theory\nof ‘natural justice’. If Thrasymachus too means to make\nthis claim then he, like Callicles, turns out to have a substantive\nnormative ethical theory—a view about how the world\nought to be. However, as we have seen, Thrasymachus only\nflirts with the revision of ordinary moral language which this view\nwould entail; when Socrates suggests that according to him justice is\na vice and injustice a virtue, he at first attempts to eschew such\nmoral categories altogether, reverting again to the pose of the\ncynical sociological observer (348c–d). This hesitation seems to mark\nThrasymachus as caught in a delicate, unstable dialectical\nway-station, in between a debunking of Hesiodic tradition (and for\nthat matter conventionalism) and a full-blown Calliclean reversal of\nmoral values. Thrasymachus occupies a position at which the\ntraditional language of ‘justice’ has been debunked as\nmerely a tool of the powerful, but no convincing redeployment\nreplacement has been found.\n3. Socrates vs. Thrasymachus\n\nAfter the opening elenchus which elicits Thrasymachus’\nideal of the real ruler, Socrates offers a series of five arguments\nagainst various elements of his position, of which the first three\nrevolve around the shared hypothesis that ruling is a craft\n[technê]. Socrates’ first argument (341b–342e) is\nthat real crafts, such as medicine, are disinterested, serving some\ngood distinct from the good of the practitioner: the end served by the\ndoctor qua doctor is the health of the patient. So Thrasymachus’\nselfish tyrant cannot be practising a craft; the real ruler properly\nunderstood is the one who expertly serves his weaker subjects. This\nargument is bitterly resisted by Thrasymachus (343a–345e). With what\nlooks like genuine disgust, he upbraids Socrates for infantile\nnaïveté: he might as well claim, absurdly, that shepherds\nand cowherds fatten their flocks for the good of the sheep and cows\nthemselves. To reaffirm and clarify his position, Socrates offers a\nfurther argument about wage-earning (345e–347d). It is precisely\nbecause real crafts (such as medicine and, Socrates insists,\nshepherding too) do not in themselves benefit their practitioners that\nextrinsic ‘wages’ are given in return; and the best\n‘wage’ for a ruler is not to be governed by someone worse\nthan himself. So again, the Thrasymachean ruler is not genuinely\npractising a craft. \n\nThird, Socrates argues that Thrasymachean rule is formally or\nstructurally unlike the real crafts (349a–350c). A craftsperson does\nnot seek to ‘outdo’ [pleonektein] fellow craft\npractitioners but to do the same as they, i.e., to perform whatever\naction the craft requires. The just person, who does not seek to\n‘outdo’ other just people, fits this pattern, while the\nThrasymachean ruler again does not. And since craft is a paradigm of\ngoodness and cleverness in its specialized area, “a just person\nhas turned out to be good and clever, and an unjust one ignorant and\nbad” (350c). Socrates takes this as equivalent to showing that\n“justice is virtue and wisdom and that injustice is vice and\nignorance” (350d). The slippery slope in these last moves is\nquestionable, and use of pleonektein in this argument is\nconfusing (and perhaps confused). Nonetheless it raises an important\npoint, which confronts head-on one of Thrasymachus’ deepest\nassumptions: the goods realized by genuine crafts are not\nzero-sum. The doctor’s restoration of the patient’s health\ndoes not make anyone else less healthy; if one musician plays in tune,\nso may another. \n\nAll these arguments rely on the hypothesis that the ‘real\nruler’ is practising a craft [technê], and appeal\nto various features of the recognised crafts to establish that real\nruling has a Socratic rather than a Thrasymachean profile. This is not\nonly a direct attack on Thrasymachus’ account of the real ruler,\nit raises the very basic question of how justice is related to\npractical reason. The real ruler is, for Socrates and Thrasymachus\nboth, an ideal of successful rational agency; and the recognized\ncrafts provide a model for spelling out what that ideal must involve.\nBy asking what ruling as a technê would be \nlike—self-interested or other-directed, dedicated to zero-sum goals or \nnot—they are really addressing a more general and still-vital set\nof questions: what does practical reason as such consist in? Is it\nreducible to the intelligent pursuit of self-interest, or does it\ninvolve some responsiveness to non-self-interested reasons? The\ndispute can also be framed in terms of the nature of the good, which\nthe rational person is assumed to pursue: does it consist in zero-sum\ngoods like wealth and power (and the pleasures they can provide), or\nin ones which can be attained in a cooperative rather than a\npleonectic way?\n\nOnce he has established that justice, like the other crafts and\nvirtues, is an other-directed form of practical reason aimed at\nnon-zero-sum goods, Socrates turns to consider its nature and powers\nmore directly. Injustice, he argues, is by nature a cause of disunity,\nstrife, and, therefore, disempowerment and ineffectiveness\n(351a–352b). Even a gang of thieves can only function successfully\nwhen they are just amongst themselves. Likewise within the human soul:\njustice is what harmonizes the soul and makes a person effective. At\nthis point Thrasymachus more or less gives up on the discussion, but\nSocrates adds a fifth argument as the coup de grace\n(352d–354c): justice, as the virtue of the soul (here deploying the\nconclusion of the third argument), is what enables the soul to perform\nits functions well, so that the just person lives well and happily.\nThis final argument is a close ancestor of the famous ‘function\nargument’ used by Aristotle in Nicomachean Ethics I.7:\nit shows that Plato (and for that matter Aristotle) by no means\nrejects the Homeric ‘functional’ conception of virtue as\nsuch. Rather, the whole argument of the Republic amounts to a\nproof that it can be reconciled with the demands of Hesiodic justice,\nif only we understand rightly what successful human functioning\nconsists in. \n\nThe focus of the argument has now come to rest where, in Plato’s\nview, it really belongs: on the psychology of justice, and its effects\non the human soul. In fact, these last two arguments amount to a\nspecification of what justice in the soul must be. Justice is a virtue\nof the soul—in a way, it is the virtue par excellence, since\nby unifying the soul (as it does the city, or any human group) it\nenables the other virtues to be exercised in successful action. But of\ncourse this does not yet tell us what justice itself is, or\nhow it produces these characteristic effects. And no doubt\nthis is one reason (perhaps among many) that no one ever finds\nSocrates’ arguments against Thrasymachus very satisfying or\nconvincing: not Glaucon and Adeimantus, who demand from Socrates an\nargument which will reveal what justice really is and does (366e,\n367b, e), not modern readers and interpreters, and certainly not\nThrasymachus himself. Even Socrates complains that, distracted by\nThrasymachus’ praise of injustice, he erred in trying to argue\nthat justice is advantageous without having first established what it\nis (354a–c). Instead of defining justice, the Book I arguments have\ntaken as their target Thrasymachus’ assumptions about practical\nrationality and advantage or the good, deployed in his conception of\nthe ‘real ruler’. Socrates’ larger argument in Books\nII-IX will also engage with these, providing substantive alternative\naccounts of the good, rationality, and political wisdom. However, this\nlarger-scale vindication of justice is presented as a response not\ndirectly to Thrasymachus, but to the restatement of his argument which\nGlaucon and Adeimantus offer (in the hope of being refuted) in Book\nII. And since their version of the immoralist position departs in\nsignificant ways from its inspiration, it is somewhat misleading to\ntreat the Republic as a whole as a response to Thrasymachus.\nRather, this division of labor confirms that for Plato, Thrasymachean\ndebunking is dialectically preliminary. It is useful for its clearing\naway of conventional assumptions and hypocritical pieties: indeed\nSocrates’ later arguments largely leave intact\nThrasymachus’ initial debunking theses about the effects of just\nbehaviour and the manipulative function of moral language (unless you\ncount a strikingly perfunctory appendix to the argument in Book X,\n612a–3e). His role is simply to present the challenge these critical\ninsights lead to; for immoralism as part of a positive vision, we need\nto turn to Callicles in the Gorgias. \n4. Callicles\n\nNothing is known of any historical Callicles, and, if there were one,\nit is odd that such a forceful personality would have left no trace in\nthe historical record. All we can say on the basis of the\nGorgias itself is that he is an Athenian aristocrat with\npolitical ambitions and personal connections to Gorgias. E.R. Dodds\nnotes that, given Plato’s usual practices, “the\nprobabilities are strongly against” Callicles’ being\nsimply a literary invention (1959, 12); but as Dodds also remarks, it\nis tempting to see in Callicles a fragment of Plato himself—a\nfrightening vision, perhaps, of what he might have become without\nSocrates (1959, 14). At any rate the Gorgias repeatedly marks\nhim as a kind of antithesis or double to Socrates as the paradigmatic\nphilosopher. Socrates opens their debate with a somewhat jokey survey\nof how much the two have in common (481c–d); they later exchange\nspeeches arguing for their diametrically opposed ways of life, with\nrepeated allusions to the contrasted brothers Zethus and Amphion in\nEuripides’ play Antiope (485e, 486d, 489e, 506b). These\ndramatic touches express the philosophical reality: more than any\nother character in Plato, Callicles is Socrates’ philosophical\nantithesis and polar opposite.\n\nCallicles’ version of the immoralist challenge turns out to\ninvolve four main components, which I will discuss in order: (1) a\ncritique of conventional justice, (2) a positive account of\n‘justice according to nature’, (3) a theory of the\nvirtues, and (4) a hedonistic conception of the good.\n\n(1) Conventional Justice: Callicles’ critique of conventional\njustice emerges from his diagnosis of the orator Polus’ failure\nin the preceding argument. Polus had accused Gorgias of succumbing to\nshame in assenting to Socrates’ suggestion that he would teach\njustice to any student ignorant of it; Callicles accuses Polus of\nsuccumbing to shame himself, and being tricked by Socrates, whose\narguments equivocate between natural and conventional values.\nAccording to convention [nomos], doing injustice is more\nshameful than suffering it, as Polus allowed; but “by nature all\nthat is worse is also more shameful, like suffering what’s\nunjust” (483a, tr. here and throughout Zeyl, sometimes revised).\nCallicles locates the origins of the convention in a conspiracy of the\nweak: “the people who institute our laws are the weak and the\nmany… they assign praise and blame with themselves and their\nown advantage in mind” (483b). This diagnosis of ordinary moral\nlanguage as a mask for self-interest is reminiscent of Thrasymachus;\nbut there is also a contrast, for Thrasymachus presented the laws as\nadapted to serve the strong, i.e., the rulers. Callicles is perhaps\nmore narrowly focussed on democratic societies, which he depicts as\ninvolving the tyranny of the weak many over exceptional individuals.\nThe many “mold the best and the most powerful among us …\nand with charms and incantations we subdue them into slavery, telling\nthem that one is supposed to get no more than his fair share”\n(483e–484a). This rhetorically powerful critique of justice\ninaugurates a durable philosophical tradition: Nietzsche, Foucault,\nand their successors in various projects of genealogy and\n‘unmasking’ are all Callicles’ heirs. \n\n(2) Natural Justice: Callicles’ denunciation of conventional\njustice is bound up with a ringing endorsement of its opposite, the\njust ‘according to nature’; in fact his opening speech is\nperhaps our most important text for the sophistic contrast between\nnature [phusis] and convention [nomos].\nNomos is, as noted above (in section 1), first and foremost\nLaw in all its grandeur, attributed by Hesiod to the will of Zeus. But\nin sophistic contexts, nomos is often used to designate some\nnorm or institution—language, religion, moral values, law\nitself—as merely a matter of social construction. That is why\nnomos varies from polis to polis and nation\nto nation, and can be changed by our decisions. What is by nature, by\ncontrast, is a kind of ethical and political ‘given’,\noutrunning our wishes or beliefs; and the contrast involves at least\nan implicit privileging of nature as inherently authoritative (see\nKerferd 1981a, Chapter 10). This project of disentangling the\ncontributions of nature and convention in human life can be seen as an\nextension to the human realm of Presocratic natural science, with its\nattempts to identify the eternal explanatory first principles\n[archai] behind the ever-changing, diverse phenomena of the\ncosmos.\n\nThe implications of the nomos-phusis contrast always depend\non how the ‘natural’ is understood. Callicles looks both\nto international politics and to the animal world to identify what is\nnatural rather than conventional: “both among the other animals\nand in whole cities and races of men, it [nature] shows that this is\nwhat justice has been decided to be: that the superior rule the\ninferior and have a greater share than they” (483d). He adds two\nexamples at the level of ‘cities and races’: the invasions\nof Greece by the Persian Emperor Xerxes, and of Scythia by his father\nDarius (483d–e). He also imagines an individual within society who\nwould exercise superiority to the full: if a man of outsize ability\nmanages to throw off our moralistic shackles, “he would rise up\nand be revealed as our master, and here the justice of nature would\nshine forth” (484a–b). So what the justice of nature amounts to\nis simple: it is for the superior man to appropriate the power and\npossessions of the inferior (484c). Thus Callicles’ genealogy of\nmorals, like Glaucon’s in Republic II, presents\npleonexia as an eternal and universal first principle of\nhuman nature; and he goes further than either Thrasymachus or Glaucon\nin taking this nature as the basis for a positive norm.\n\nFor all its ranting sound, Callicles has a straightforward and\nlogically valid argument here: (1) observation of nature can disclose\nthe content of ‘natural justice’; (2) nature is to be\nobserved in the realms where moral conventions have no hold, viz among\nstates and among animals; (3) such observation discloses the\ndomination and exploitation of the weak by the strong; (4) therefore,\nit is natural justice for the strong to rule over and have more than\nthe weak. From a modern point of view, premise (1) is likely to appear\nthe most dubious, for it violates the plausible principle, most\nfamously advanced by David Hume, that no normative claims may be\ninferred from purely descriptive premises (‘no ought from an\nis’). But then, legitimate or not, this kind of appeal to nature\nruns through almost all of ancient ethics: it is central to the moral\ntheory of Plato himself, as well as Aristotle, the Epicureans, and the\nStoics. So Socrates’ objection is instead to (2) and (3):\nCallicles gets nature wrong. In truth, Socrates insists later on,\n“partnership and friendship, orderliness, self-control, and\njustice hold together heaven and earth, and gods and men, and that is\nwhy they call this universe a world order, my friend, and not an\nundisciplined world-disorder” (507e–508a). Callicles advocates\npleonexia only because he ‘neglects geometry’\n(508a): instead of predatory animals, we should observe and emulate\nthe orderly structure of the cosmos as a whole.\n\n(3) Callicles’ theory of the virtues: As with Thrasymachus,\nSocrates’ response is to press Callicles regarding the deeper\ncommitments on which his views depend. He first prods Callicles to\narticulate the conception of the ‘superior’ which his\naccount of natural justice involves. Callicles has said that nature\nreveals that it is just for the ‘superior’,\n‘better’ or ‘stronger’ to have more: but who\nare they (488b–c)? In practice, as Socrates points out, ‘the\nmany’, whom Callicles has condemned as weak, are in fact\nstronger: they are able, as Callicles himself has complained, to\nsuppress the gifted few. So, like Thrasymachus when faced with the\nfact that rulers sometimes make mistakes in the pursuit of\nself-interest, Callicles now has to distinguish the\n‘strength’ he admires from actual political power. (This\nleaves it unclear whether and why we should still see the invasions of\nDarius and Xerxes as examples of the ‘strong’ exercising\nthe ‘justice of nature’; since both their expeditions were\nnotorious failures, the examples are rather perplexing anyway.)\n\nCallicles goes on to articulate (with some help from Socrates) a\nconception of ‘superiority’ in terms of a pair of very\ntraditional sounding virtues: intelligence [phronêsis],\nparticularly about the affairs of the city, and courage\n[andreia], which makes men “competent to accomplish\nwhatever they have in mind, without slackening off because of softness\nof spirit” (491a–b). These are the familiar\n‘functional’ virtues of the Homeric warrior, and the claim\nthat such a man should be rewarded with a ‘greater share’\nis no sophistic novelty but a restatement of the Homeric warrior\nethic: the best fighter in the battle of the day deserves the best cut\nof the meat at night. At the same time, Callicles is interestingly\nreluctant to describe his ‘superior’ man as possessing the\nvirtue of justice [dikaiosunê], which we might have\nexpected him to redefine as conformity to the justice of nature.\nInstead, he seems to dispense with any conception of justice as a\nvirtue; and he explicitly rejects the fourth traditional virtue which\nPlato will take as canonical in the Republic,\nsôphrosunê, temperance or moderation.\n\nThis traditional side of Calliclean ‘natural justice’ is\nworth emphasising, since Callicles is often read as a representative\nof the sophistic movement and their subversive ‘modern’\nideas. (Nietzsche, for instance, discusses the sophists—with\nimmense admiration—in a way that is hard to make sense of\nunless we take Callicles as a principal source (1968, 232–4; and\nsee Dodds 1958, 386–91, on Callicles’ influence on\nNietzsche’s own thought).) Despite Callicles’ opposition\nof nomos and phusis, and his association with\nGorgias, this reading is somewhat misleading. Callicles is clearly not\na professional sophist himself—indeed Socrates mentions that\nhe despises them (520b). And his friend Gorgias is properly speaking a\nrhetorician, i.e. a teacher of public speaking—presumably a\nmore practical, less intellectually pretentious (and so, to Callicles,\nmore manly) line of work. Most of all, the work to which Callicles\nputs the trendy nomos-phusis distinction is essentially\ntraditional: his position is a somewhat feral variant on the ancient\nelitist tradition in Greek moral thought, found for instance in\nTheognis as well as Homer’s warrior ethic. \n\n(4) Hedonism: Once the ‘strong’ have been identified as a\nruthlessly intelligent and daring natural elite, a second point of\nclarification arises: of what, exactly, do they deserve more? Socrates\nalready pressed the point at the outset by, in his usual fashion,\nposing it in the lowliest terms: should the stronger have a greater\nshare of food and drink, or clothes, or land? These suggestions are\nscornfully rejected at first (490c–d); but Callicles does in the end\nallow that eating and drinking, and even scratching or the life of a\ncatamite (a boy or youth who makes himself constantly available to a\nman for the man’s sexual pleasure), count as instances of the\nappetitive fulfilment he recommends (494b–e). \n\nSo it is not made clear to us what pleasures Callicles himself had in\nmind—perhaps he himself is hazy on that point. All he says is\nthat the superior man must “allow his own appetites to get as\nlarge as possible and not restrain them. And when they are as large as\npossible, he ought to be competent to devote himself to them by virtue\nof his courage and intelligence, and to fill him with whatever he may\nhave an appetite for at the time” (491e–492a). This seems to\nleave the content of those appetites entirely a matter of subjective\npreference. And Callicles eventually allows himself, without much\nresistance, to be committed by Socrates to a simple and extreme form\nof hedonism: all pleasures are good and pleasure is the good\n(495a–e). Their arguments over this thesis stand at the start of a\nfascinating and complex Greek debate over the nature and value of\npleasure, which is here understood as the ‘filling’ or\n‘replenishment’ of some painful lack (e.g., the pleasure\nof drinking is a replenishment in relation to the pain of thirst).\nHowever, it is difficult to be sure how much this discussion tells us\nabout Callicles, since it is Socrates who elaborates the conception of\npleasure as replenishment on which it depends. Even the strength of\nCallicles’ commitment to the hedonistic equation of pleasure and\nthe good is uncertain. At 499b, having been refuted by Socrates, he\ncasually allows that some pleasures are better than others; and as\nnoted above, hedonism was introduced in the first place not as a\nthesis he was keen to propound, but as the answer to a question he\ncould not avoid—viz, the stronger should ‘have\nmore’ of what? Callicles’ philosophical\nenthusiasm is not, it seems, for pleasure itself but for the\nintensity, self-assertion and extravagance that accompany its pursuit\non a grand scale: he endorses hedonism so as to repudiate the\nrestraints of temperance, rather than the other way around. One way to\nunderstand this rather oddly structured position is, again, as\ninspired by the Homeric tradition. Callicles’ somewhat murky\nideal, the superior man, is imagined as having the arrogant grandeur\nof the larger-than-life Homeric heroes; but what this new breed of\nhero is supposed to fight for and be rewarded by remains cloudy to his\nimagination.\n5. Socrates vs. Callicles\n\nThe most fundamental difficulty with Callicles’ position is\nbrought out by Socrates’ final refutation at 497d–499b. This is\na simple and elegant argument which brings into collision\nCallicles’ hedonism and his account of the virtues, roughly as\nfollows: (1) pleasure is the good; (2) good people are good by the\npresence of good things; (3) good people are the virtuous, i.e., the\nintelligent and courageous; (4) the foolish and cowardly sometimes\nexperience as much pleasure as the intelligent and courageous, or even\nmore; (5) therefore, bad people are sometimes as good as good ones, or\neven better. Here, premises (1) and (3) represent Callicles’\nhedonism and his account of the virtues respectively; (2) and (4) seem\nundeniable; but (1), (2), and (4) together entail (5), which conflicts\nwith (3) and is anyway a contradiction in terms.\n\nThe problem is obvious: one cannot consistently claim both that\npleasure is the good, and that courage and intelligence\n(which are manifestly not instances of pleasure, or derivative of it,\nor even reliably correlated with it) are goods. Callicles\ncould perhaps respond that the virtues are instrumentally good: an\nintelligent and courageous person is ‘good’ in the\nindirect sense that he is, overall and in the long run, more apt than\nothers to obtain the good of pleasure. But this is not a very\nplausible claim—least of all in the warfare-ridden world of\nthe Greek polis, where the coward might be at a significant\nadvantage for survival. And this ‘instrumentalist’ option\nwould in any case be false to Callicles’ spirit. His praise of\nthe virtues of the superior man expresses a hazy but genuine spirit of\nadmiration (like Thrasymachus with his ‘real ruler’),\nrather than a calculation of instrumental utility. So Callicles is\ngenuinely torn. He is urging Socrates and us to pursue two ends which\nare not only different but sometimes incompatible: pleasure and the\nvirtues as he understands them. Rather oddly, this is perhaps the\nfirst clear formulation of what will later be a central contrast in\nmore standard philosophical ethical systems: the two ends represented\nby ‘inclination’ and ‘duty’ (Kant), or the\n‘dualism of practical reason’ (Sidgwick). And the case of\nCallicles can help us to see an important point often obscured in\nlater versions, which is that some conflict along these lines can\narise even if one’s conception of virtue has nothing to do with\naltruism. Even for an immoralist, there is room for a clash between\nthe ends set by self-interested desire and those derived from other,\ndisinterested origins (admiration of one’s heroes, for \ninstance)—between the advantages it is rational for us to pursue and the\nsort of person we ought to try to be. \n\nLike his praise of the justice of nature, Callicles’\nnon-instrumental attachment to the virtues of his superior man raises\nthe question whether ‘immoralist’ is really the right term\nfor him. He resembles his fan Nietzsche in being a shape-shifter: at\nsome points he seems to attack the legitimacy of moral norms as such,\nbut at others he offers what looks like his own morality, one indeed\nwhich is much less new and radical than he seems to want us to think.\nIf we do want to retain the term ‘immoralist’ for him, we\nneed to allow that the basic immoralist challenge (that is, why be\njust? or why be moral?) may be raised from two rather different\nperspectives. Rather than being someone who disputes the rational\nauthority of ethical norms as such, as Thrasymachus seems to do, the\nimmoralist may be someone who has his own set of ethical norms and\nideals, ones which exclude ordinary morality. \n\nCallicles himself does not seem to realize how deep the problems with\nhis position go. He responds to Socrates’ refutations by making\na rather shrug-like suggestion that (contrary to his earlier explicit\ninsistence) some pleasures are of course better than others (499b). In\nthe end, Callicles’ position is perhaps best seen as a series of\nshifting suggestions or impulses—against conventional\njustice, against temperance, for the Homeric\nself-assertion of the strong, for pleasures and psychological\nintensity—rather than a coherent set of philosophical theses.\nThe disunified quality of Callicles’ thought may actually be the\nkey to its perpetual power: almost all readers find something to tempt\nthem here, and are easily left with the lurking sense that the\n‘real’ Calliclean position, whatever we might prefer it to\nbe, remains unrefuted. (And indeed of the four ingredients of\nCallicles’ position discussed above, Socrates’ arguments\ntarget only (3) and (4): whether (1) and (2) could be reconceived on\nsome lines not reliant on them is an open question.) This unease is\nstrengthened by a fifth component of Callicles’ position: his\nattack on the value of philosophy itself. It is a prominent theme of\nCallicles’ opening rants that philosophy, while a valuable part\nof liberal education, is unworthy and a waste of time for a serious\nadult (485e–486d). The life of philosophy is unmanly and immature, the\nantithesis of an honorable public life; Socrates ought to ‘stop\nthis refuting’ and ‘leave these subtleties to\nothers’. Callicles’ anti-intellectualism does not prevent\nhim from showing some skill in dialectic, and more commitment to its\nnorms than most of Socrates’ interlocutors (e.g., at 495a). But\nCallicles also claims that he argues only to please Gorgias (506c);\nand in the end, he opts out of the discussion altogether, retreating\ninto surly silence. What makes this rejection of philosophical\ndialectic disturbing is Callicles’ suggestion that\nSocrates’ philosophical positions are just self-serving\nexpressions of his commitment to his own way of life—a version\nof the plausible ancient Greek truism that each man naturally praises\nhis own way of life as best. According to Callicles, this means that\nSocrates would have to change his practices to gain insight:\n“This is the truth of the matter, as you will know if you\nabandon philosophy and move on to more important things” (484c).\nCallicles is here the first voice within philosophy to raise the\nprospect that there are truths which philosophy itself may hide from\nus. That is a possibility which Socrates clearly rejects; but it is\nhard to see how he could refute it.\n6. Conclusion: Thrasymachus, Callicles, Glaucon, Antiphon\n\nOne way to compare the two varieties of immoralism represented by\nThrasymachus and Callicles is to ask why Plato chose to represent the\nformer position in the Republic and the latter in the\nGorgias. The obvious answer is that the differences between\nthe two put them in very different relations to Socrates and his\ndefense of justice, suitably calibrated to the ambitions of the works\nin question. Socrates and Callicles are antitheses: they address the\nsame questions and give directly conflicting answers. Each offers a\npositive account of the real nature of justice, grounded in a broader\nconception of human nature and the nature of things. Indeed, viewed at\na high level of abstraction, and if we allow Socrates the fuller\npositive theory provided in the Republic, their positions are\nremarkably similar. For in the Republic we see that Plato in\nfact agrees with Callicles that the many should be ruled by the\nsuperior few—i.e., the intelligent and courageous—and\nthat it is only natural and just for the latter to have greater\nhappiness and pleasure than the many. Where they differ is in the\ncontent they give to this shared schema. From the point of view of\nSocrates or Plato, Callicles is wrong about nature (including human\nnature); wrong about what intelligence and virtue actually consist in;\nwrong about what the point and purpose of political rule is; and wrong\nabout the nature of the good at which the superior man aims. His\nversion of the immoralist challenge is thus, for all its tremendous\nrhetorical power, less philosophically threatening than it might be;\nfor it depends on a rather rich positive theory (of the good, human\nnature, human virtue, and politics) which Plato thinks he can show to\nbe false. Thrasymachus, by contrast, presents himself as more of a\nsocial critic: while persuasively debunking justice as conventionally\nunderstood, he fails to offer any account of real virtue in its stead.\nThe closest he comes to presenting a substitute norm is in his praise\nof the expertly rational real ruler—an ideal which is pursued\nand developed more fully both by Callicles in the Gorgias and\nby Socrates in the Republic itself. \n\nSo where the Gorgias presents a mirroring and confrontation\nbetween two complete ethical stances, the immoralist and the Socratic,\nthe Republic depicts a complex dialectical progression from\nthe one to the other. It also gestures towards the Calliclean\nalternative with Glaucon’s speech in Book II. Glaucon presents\nhis attack on justice as a restatement of Thrasymachus’ position\n(358c); but it represents a considerable advance in theoretical\nsophistication, and the differences bring it closer to Callicles. Like\nCallicles, Glaucon concerns himself explicitly with the nature and\norigin of justice, classifying it as a merely instrumental good (or a\nnecessary evil) and locating its origins in a social contract. By\nnature we are all pleonectic; but since we stand to lose more than we\ncould gain from unbridled pleonexia we have entered into a\ncompact neither to do nor to allow injustice. As the famous\n‘ring of Gyges’ thought-experiment is supposed to show,\nhowever, nobody has any real commitment to acting justly when they\nthink they can get away with injustice; for if someone can commit\ninjustice undetected there is no reason for him not to. Thus Glaucon\nagrees with Callicles in identifying justice as a matter of\nconvention, and in holding that it conflicts with our nature. At the\nsame time, he remains with Thrasymachus in not articulating any\nalternative moral norm; and he departs from both in not relying on the\ndubious division of mankind into two essentially different kinds, the\nallegedly ‘strong’ and the ‘weak’. He thus\nseems to represent the immoralist challenge in a fully developed yet\nstreamlined form, shorn of unnecessary complications and theoretical\nassumptions and reducible to a simple, pressing question: given the\nmerely conventional character of justice and the constraints it places\non our pleonectic nature, why should any one of us be just, whenever\ninjustice would be to our advantage? \n\nThis is also the challenge posed by the sophist Antiphon, in the\nsurviving fragments of his discussion of justice in On Truth\n(see Pendrick 2002 for the texts of Antiphon, and Gagarin and Woodruff\n1995 or Dillon and Gergel 2003 for translation). Antiphon argues that\njustice is only ever a matter of following the laws of one’s own\ncommunity; and that there is no good reason for anyone to obey those\nlaws when they can break them without fear of detection and\npunishment. For nature too has its laws, which conflict with those of\nsociety, and violation of these is punished infallibly.\nAntiphon’s text and meaning are unclear at some crucial points,\nbut the idea seems to be that the laws of society require us to act\nagainst our own interests, by constraining our animal natures and\nlimiting our natural desires and pleasures; and that it is foolish to\nobey these laws when we can get away with following nature instead.\nWithout wanting to deny the existence of other contemporary figures\nworking similar terrain, we can easily read Callicles, Thrasymachus,\nand Glaucon as Plato’s disentangling and disambiguation of\nAntiphon’s ideas into three possible positions, distinguished to\nclarify the various philosophical forms that a broadly immoralist\nstance might take. Thrasymachus represents the essentially negative,\ncynical, and debunking side of the immoralist stance, grounded in\nempirical observations of the ways of the world. At the same time his\nidealization of the ‘real ruler’ suggests that this is an\nunstable and incomplete position, liable to progress to a Calliclean\n‘heroic’ form of immoralism. Callicles represents\nimmoralism as a new morality, dependent on the contrasts between\nnature and convention and between the strong and the weak. Glaucon\nshows that the immoralist challenge has no need of the latter (nor,\nfor that matter, of Thrasymachus’ ideal of the real ruler).\nImmoralism is for everybody: we are all complicit in the social\ncompact which establishes law as a brake on self-interest, and we all\nhave reason to cheat on it when we can. This, Plato’s\npresentation suggests, is ultimately the most challenging form of the\nimmoralist stance; and it is probably the closest to its historical\noriginal in Antiphon himself. Whether the whole argument of the\nRepublic suffices to defeat it remains a matter of live\nphilosophical debate.\n",
    "bibliography": {
        "categories": [
            "The immoralist challenge",
            "The Greek moral tradition, the Sophists and their social context (including Antiphon)",
            "Thrasymachus and the <em>Republic</em> (including Glaucon)",
            "Callicles and the <em>Gorgias</em>"
        ],
        "cat_ref_text": {
            "The immoralist challenge": [
                "</h3>\n<ul class=\"hanging\">",
                "Foot, P., 2003, <em>Natural Goodness</em>, Oxford: Clarendon\nPress.",
                "Gauthier, D., 1986, <em>Morals by Agreement</em>, Oxford:\nClarendon Press.",
                "Prichard, H., 1912, “Does Moral Philosophy Rest on a\nMistake?” <em>Mind</em> (n.s.), 21 (81): 21–37.",
                "Tell, H., 2011, <em>Plato’s Counterfeit Sophists</em>,\nWashington D.C.: Center for Hellenic Studies.",
                "Williams, B., 1972, <em>Morality</em>, Cambridge: Cambridge\nUniversity Press (cited in 1993 edition).",
                "–––, 1985, <em>Ethics and the Limits of\nPhilosophy</em>, Cambridge, Mass: Harvard University Press.",
                "–––, 1997, “Plato Against the\nImmoralist”, in <em>Platon: Politeia</em>, O. Höffe (ed.),\nBerlin: Akademie Verlag; reprinted in his <em>The Sense of the Past:\nEssays on the History of Philosophy</em>, Princeton: Princeton\nUniversity Press, 2006.\n</ul>\n<h3 id=\"GreeMoraTradSophTheiSociContInclAnti\">"
            ],
            "The Greek moral tradition, the Sophists and their social context (including Antiphon)": [
                "</h3>\n<ul class=\"hanging\">",
                "Adkins, A.W.H., 1960, <em>Merit and Responsibility: A Study in\nGreek Values</em>, Oxford: Clarendon Press.",
                "Balot, R. K., 2001, <em>Greed and Injustice in Classical\nAthens</em>, Princeton: Princeton University Press.",
                "Barney, R., 2009, “The Sophistic Movement”, in Gill\nand Pellegrin 2009, 77–97.",
                "Bett, R., 2002, “Is There a Sophistic Ethics?”\n<em>Ancient Philosophy</em>, 22: 235–262.",
                "de Romilly, J., 1992, <em>The Great Sophists in Periclean\nAthens</em>, J. Lloyd (trans.), Oxford: Clarendon Press.",
                "Dillon, J. and T. Gergel (ed. and trans.), 2003, <em>The Greek\nSophists</em>, London: Penguin Books.",
                "Dover, K., 1974, <em>Greek Popular Morality in the Time of Plato\nand Aristotle</em>, Oxford: Basil Blackwell.",
                "Finkelberg, M., 1998, “<em>Timê</em> and\n<em>Aretê</em> in Homer”, <em>Classical Quarterly</em>,\n48: 15–28.",
                "Furley, D.J., 1981, “Antiphon’s Case Against\nJustice”, in Kerferd 1981b.",
                "Gagarin, M., 2001, “The Truth of Antiphon’s\n<em>Truth</em>”, in <em>Essays in Ancient Greek Philosophy</em>\nVI, A. Preus (ed.), Albany: State Univ. of N.Y. Press.",
                "Gagarin, M., 2002, <em>Antiphon the Athenian: Oratory, Law, and\nJustice in the Age of the Sophists</em>, Austin: University of Texas\nPress.",
                "Gagarin, M. and P. Woodruff (ed. and trans.), 1995, <em>Early\nGreek Political Thought from Homer to the Sophists</em>, Cambridge:\nCambridge University Press.",
                "Gill, M.L. and P. Pellegrin (ed.), 2009, <em>A Companion to\nAncient Philosophy</em>, Malden, MA: Blackwell Publishing.",
                "Guthrie, W.K.C., 1971, <em>The Sophists</em> (= <em>A History of\nGreek Philosophy</em>, Volume 3, Part 1, 1969), Cambridge: Cambridge\nUniversity Press.",
                "Kahn, C., 1981, “The Origins of Social Contract Theory in\nthe Fifth Century B.C.”, in Kerferd 1981b, 92–108.",
                "Kerferd, G.B., 1981a, <em>The Sophistic Movement</em>, Cambridge:\nCambridge University Press.",
                "––– (ed.), 1981b, <em>The Sophists and their\nLegacy</em>, Wiesbaden: Steiner.",
                "Morrison, J.S., 1963, “The Truth of Antiphon”,\n<em>Phronesis</em>, 8: 35–49.",
                "Pendrick, G. (ed. and trans.), 2002, <em>Antiphon the Sophist: The\nFragments</em>, Cambridge, Cambridge University Press.",
                "Riesbeck, D., 2011, “Nature, Normativity, and Nomos in\nAntiphon, Fr. 44”, <em>Phoenix</em>, 65 (3/4):\n268–287.\n</ul>\n<h3 id=\"ThraRepuInclGlau\">"
            ],
            "Thrasymachus and the <em>Republic</em> (including Glaucon)": [
                "</h3>\n<ul class=\"hanging\">",
                "Anderson, M., 2016, “Socrates’ Thrasymachus’\nSophistic Account of Justice in <em>Republic</em> i”,\n<em>Ancient Philosophy</em>, 36: 151–172.",
                "Barney, R., 2006, “Socrates’ Refutation of\nThrasymachus”, in Santas 2006, 44–62.",
                "Boter, G., 1986, “ Thrasymachus and Pleonexia”,\n<em>Mnemosyne</em> (Series 4), 39: 261–281.",
                "Chappell, T.D.J., 1993, “The Virtues of Thrasymachus”,\n<em>Phronesis</em>, 38: 1–17.",
                "–––, 2000, “Thrasymachus and\nDefinition”, <em>Oxford Studies in Ancient Philosophy</em>, 18:\n101–107.",
                "Cooper, J.M. (ed.), 1997, <em>Plato: Complete Works</em>,\nIndianapolis: Hackett Publishing.",
                "Everson, S., 1998, “The Incoherence of Thrasymachus”,\n<em>Oxford Studies in Ancient Philosophy</em>, 16: 99–131.",
                "Gifford, M., “Dramatic Dialectic in <em>Republic</em> Book\nI”, <em>Oxford Studies in Ancient Philosophy</em>, 20:\n35–106.",
                "Grube, G. and C.D.C. Reeve, tr., Plato, <em>Republic</em>, in\nCooper 1997.",
                "Henderson, T., 1974, “In Defense of Thrasymachus”,\n<em>American Philosophical Quarterly</em>, 3: 218–228.",
                "Hourani, G., 1962, “ Thrasymachus’ Definition of\nJustice in Plato’s <em>Republic</em>”, <em>Phronesis</em>,\n7 (1): 110–120.",
                "Kerferd, G., 1947, “The Doctrine of Thrasymachus in\nPlato’s <em>Republic</em>”, <em>Durham University\nJournal</em> (New Series), 9: 19–27.",
                "Nicholson, P., 1974, “Socrates’ Unravelling\nThrasymachus’ Arguments in <em>The Republic</em> ”,\n<em>Phronesis</em>, 19(3): 210–232.",
                "O’Neill, B., 1988, “The Struggle for the Soul of\nThrasymachus”, <em>Ancient Philosophy</em>, 8:\n167–85.",
                "Penner, T., 2009, “Thrasymachus and the ὡς\nἀληθῶς Ruler”,\n<em>Skepsis</em> 20: 199–215.",
                "Reeve, C.D.C., 1985, “Socrates Meets Thrasymachus”,\n<em>Archiv für Geschichte der Philosophie</em>, 67 (3):\n246–265.",
                "–––, 2008, “Glaucon’s Challenge and\nThrasymacheanism”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 34: 69–104.",
                "Santas, G. (ed.), 2006, <em>The Blackwell Guide to\nPlato’s</em> Republic, Malden, MA: Blackwell Publishing.",
                "Shields, C., 2006, “Plato’s Challenge : The Case\nAgainst Justice in <em>Republic</em> II”, in Santas 2006.",
                "Scott, D., 2000, “Aristotle and Thrasymachus”,\n<em>Oxford Studies in Ancient Philosophy</em>, 19: 225–252.",
                "Sparshott, F., 1966, “Socrates and Thrasymachus”,\n<em>Monist</em>, 50 (3): 421–459.",
                "–––, 1988, “An Argument for\nThrasymachus”, <em>Apeiron</em>, 21 (1): 55–67.",
                "Weiss, R., 2007, “Wise Guys and Smart Alecks in\n<em>Republic</em> 1 and 2”, in <em>The Cambridge Companion to\nPlato’s</em> Republic, G.R.F. Ferrari (ed.), Cambridge:\nCambridge University Press.",
                "White, S. A., 1995, “Thrasymachus the Diplomat”,\n<em>Classical Philology</em>, 90: 307–27.\n</ul>\n<h3 id=\"CallGorg\">"
            ],
            "Callicles and the <em>Gorgias</em>": [
                "</h3>\n<ul class=\"hanging\">",
                "Berman, S., 1991,“Socrates and Callicles on Pleasure”,\n<em>Phronesis</em>, 36 (2): 117–140.",
                "Cooper, J.M., 1999, “Socrates and Plato in Plato’s\n<em>Gorgias</em>”, in his <em>Reason and Emotion</em>,\nPrinceton: Princeton University Press, 29–75.",
                "Dodds, E. R.,1959, <em>Plato: Gorgias</em>, Oxford: Oxford\nUniversity Press (text, intro., commentary).",
                "Doyle, J., 2006, “The Fundamental Conflict in Plato’s\n<em>Gorgias</em>”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 30: 87–100.",
                "Hobbs, A., 2000, <em>Plato and the Hero: Courage, Manliness and\nthe Impersonal Good</em>, Cambridge: Cambridge University Press.",
                "Irwin, T., 1979, <em>Plato: Gorgias</em>, Oxford: Clarendon Press\n(trans. and commentary).",
                "Kahn, C., 1983, “Drama and Dialectic in Plato’s\n<em>Gorgias</em>”, <em>Oxford Studies in Ancient Philosophy</em>\n1: 75–121.",
                "Kamtekar, R., 2005, “The Profession of Friendship:\nCallicles, Democratic Politics, and Rhetorical Education in\nPlato’s <em>Gorgias</em>”, <em>Ancient Philosophy</em>,\n25: 319–39.",
                "Klosko, G., 1984, “The Refutation of Callicles in\nPlato’s <em>Gorgias</em>”, <em>Greece and Rome</em>, 31\n(2): 126–139.",
                "Nietzsche, F., 1968, <em>The Will to Power</em>, trans. W.\nKaufman, New York: Random House (original work published 1901).",
                "Rudebusch, G., 1992, “Callicles’ Hedonism”,\n<em>Ancient Philosophy</em>, 12 (1): 53–71.",
                "Woolf, R., 2000, “Callicles and Socrates: Psychic\n(Dis)harmony in the <em>Gorgias</em>”, <em>Oxford Studies in\nAncient Philosophy</em>, 18: 1–40.",
                "Zeyl, D. J., tr. Plato, <em>Gorgias</em>, in Cooper 1997.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\nFor general accounts of the <em>Republic</em>, see the Bibliography to\nthe entry,\n <a href=\"../plato-ethics-politics/\">Plato’s Ethics and Politics in the <em>Republic</em></a>.\n The following are works cited in or having particular relevance to\nthe present entry:</p>\n<h3 id=\"ImmoChal\">The immoralist challenge</h3>\n<ul class=\"hanging\">\n<li>Foot, P., 2003, <em>Natural Goodness</em>, Oxford: Clarendon\nPress.</li>\n<li>Gauthier, D., 1986, <em>Morals by Agreement</em>, Oxford:\nClarendon Press.</li>\n<li>Prichard, H., 1912, “Does Moral Philosophy Rest on a\nMistake?” <em>Mind</em> (n.s.), 21 (81): 21–37.</li>\n<li>Tell, H., 2011, <em>Plato’s Counterfeit Sophists</em>,\nWashington D.C.: Center for Hellenic Studies.</li>\n<li>Williams, B., 1972, <em>Morality</em>, Cambridge: Cambridge\nUniversity Press (cited in 1993 edition).</li>\n<li>–––, 1985, <em>Ethics and the Limits of\nPhilosophy</em>, Cambridge, Mass: Harvard University Press.</li>\n<li>–––, 1997, “Plato Against the\nImmoralist”, in <em>Platon: Politeia</em>, O. Höffe (ed.),\nBerlin: Akademie Verlag; reprinted in his <em>The Sense of the Past:\nEssays on the History of Philosophy</em>, Princeton: Princeton\nUniversity Press, 2006.</li>\n</ul>\n<h3 id=\"GreeMoraTradSophTheiSociContInclAnti\">The Greek moral tradition, the Sophists and their social context (including Antiphon)</h3>\n<ul class=\"hanging\">\n<li>Adkins, A.W.H., 1960, <em>Merit and Responsibility: A Study in\nGreek Values</em>, Oxford: Clarendon Press.</li>\n<li>Balot, R. K., 2001, <em>Greed and Injustice in Classical\nAthens</em>, Princeton: Princeton University Press.</li>\n<li>Barney, R., 2009, “The Sophistic Movement”, in Gill\nand Pellegrin 2009, 77–97.</li>\n<li>Bett, R., 2002, “Is There a Sophistic Ethics?”\n<em>Ancient Philosophy</em>, 22: 235–262.</li>\n<li>de Romilly, J., 1992, <em>The Great Sophists in Periclean\nAthens</em>, J. Lloyd (trans.), Oxford: Clarendon Press.</li>\n<li>Dillon, J. and T. Gergel (ed. and trans.), 2003, <em>The Greek\nSophists</em>, London: Penguin Books.</li>\n<li>Dover, K., 1974, <em>Greek Popular Morality in the Time of Plato\nand Aristotle</em>, Oxford: Basil Blackwell.</li>\n<li>Finkelberg, M., 1998, “<em>Timê</em> and\n<em>Aretê</em> in Homer”, <em>Classical Quarterly</em>,\n48: 15–28.</li>\n<li>Furley, D.J., 1981, “Antiphon’s Case Against\nJustice”, in Kerferd 1981b.</li>\n<li>Gagarin, M., 2001, “The Truth of Antiphon’s\n<em>Truth</em>”, in <em>Essays in Ancient Greek Philosophy</em>\nVI, A. Preus (ed.), Albany: State Univ. of N.Y. Press.</li>\n<li>Gagarin, M., 2002, <em>Antiphon the Athenian: Oratory, Law, and\nJustice in the Age of the Sophists</em>, Austin: University of Texas\nPress.</li>\n<li>Gagarin, M. and P. Woodruff (ed. and trans.), 1995, <em>Early\nGreek Political Thought from Homer to the Sophists</em>, Cambridge:\nCambridge University Press.</li>\n<li>Gill, M.L. and P. Pellegrin (ed.), 2009, <em>A Companion to\nAncient Philosophy</em>, Malden, MA: Blackwell Publishing.</li>\n<li>Guthrie, W.K.C., 1971, <em>The Sophists</em> (= <em>A History of\nGreek Philosophy</em>, Volume 3, Part 1, 1969), Cambridge: Cambridge\nUniversity Press.</li>\n<li>Kahn, C., 1981, “The Origins of Social Contract Theory in\nthe Fifth Century B.C.”, in Kerferd 1981b, 92–108.</li>\n<li>Kerferd, G.B., 1981a, <em>The Sophistic Movement</em>, Cambridge:\nCambridge University Press.</li>\n<li>––– (ed.), 1981b, <em>The Sophists and their\nLegacy</em>, Wiesbaden: Steiner.</li>\n<li>Morrison, J.S., 1963, “The Truth of Antiphon”,\n<em>Phronesis</em>, 8: 35–49.</li>\n<li>Pendrick, G. (ed. and trans.), 2002, <em>Antiphon the Sophist: The\nFragments</em>, Cambridge, Cambridge University Press.</li>\n<li>Riesbeck, D., 2011, “Nature, Normativity, and Nomos in\nAntiphon, Fr. 44”, <em>Phoenix</em>, 65 (3/4):\n268–287.</li>\n</ul>\n<h3 id=\"ThraRepuInclGlau\">Thrasymachus and the <em>Republic</em> (including Glaucon)</h3>\n<ul class=\"hanging\">\n<li>Anderson, M., 2016, “Socrates’ Thrasymachus’\nSophistic Account of Justice in <em>Republic</em> i”,\n<em>Ancient Philosophy</em>, 36: 151–172.</li>\n<li>Barney, R., 2006, “Socrates’ Refutation of\nThrasymachus”, in Santas 2006, 44–62.</li>\n<li>Boter, G., 1986, “ Thrasymachus and Pleonexia”,\n<em>Mnemosyne</em> (Series 4), 39: 261–281.</li>\n<li>Chappell, T.D.J., 1993, “The Virtues of Thrasymachus”,\n<em>Phronesis</em>, 38: 1–17.</li>\n<li>–––, 2000, “Thrasymachus and\nDefinition”, <em>Oxford Studies in Ancient Philosophy</em>, 18:\n101–107.</li>\n<li>Cooper, J.M. (ed.), 1997, <em>Plato: Complete Works</em>,\nIndianapolis: Hackett Publishing.</li>\n<li>Everson, S., 1998, “The Incoherence of Thrasymachus”,\n<em>Oxford Studies in Ancient Philosophy</em>, 16: 99–131.</li>\n<li>Gifford, M., “Dramatic Dialectic in <em>Republic</em> Book\nI”, <em>Oxford Studies in Ancient Philosophy</em>, 20:\n35–106.</li>\n<li>Grube, G. and C.D.C. Reeve, tr., Plato, <em>Republic</em>, in\nCooper 1997.</li>\n<li>Henderson, T., 1974, “In Defense of Thrasymachus”,\n<em>American Philosophical Quarterly</em>, 3: 218–228.</li>\n<li>Hourani, G., 1962, “ Thrasymachus’ Definition of\nJustice in Plato’s <em>Republic</em>”, <em>Phronesis</em>,\n7 (1): 110–120.</li>\n<li>Kerferd, G., 1947, “The Doctrine of Thrasymachus in\nPlato’s <em>Republic</em>”, <em>Durham University\nJournal</em> (New Series), 9: 19–27.</li>\n<li>Nicholson, P., 1974, “Socrates’ Unravelling\nThrasymachus’ Arguments in <em>The Republic</em> ”,\n<em>Phronesis</em>, 19(3): 210–232.</li>\n<li>O’Neill, B., 1988, “The Struggle for the Soul of\nThrasymachus”, <em>Ancient Philosophy</em>, 8:\n167–85.</li>\n<li>Penner, T., 2009, “Thrasymachus and the ὡς\nἀληθῶς Ruler”,\n<em>Skepsis</em> 20: 199–215.</li>\n<li>Reeve, C.D.C., 1985, “Socrates Meets Thrasymachus”,\n<em>Archiv für Geschichte der Philosophie</em>, 67 (3):\n246–265.</li>\n<li>–––, 2008, “Glaucon’s Challenge and\nThrasymacheanism”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 34: 69–104.</li>\n<li>Santas, G. (ed.), 2006, <em>The Blackwell Guide to\nPlato’s</em> Republic, Malden, MA: Blackwell Publishing.</li>\n<li>Shields, C., 2006, “Plato’s Challenge : The Case\nAgainst Justice in <em>Republic</em> II”, in Santas 2006.</li>\n<li>Scott, D., 2000, “Aristotle and Thrasymachus”,\n<em>Oxford Studies in Ancient Philosophy</em>, 19: 225–252.</li>\n<li>Sparshott, F., 1966, “Socrates and Thrasymachus”,\n<em>Monist</em>, 50 (3): 421–459.</li>\n<li>–––, 1988, “An Argument for\nThrasymachus”, <em>Apeiron</em>, 21 (1): 55–67.</li>\n<li>Weiss, R., 2007, “Wise Guys and Smart Alecks in\n<em>Republic</em> 1 and 2”, in <em>The Cambridge Companion to\nPlato’s</em> Republic, G.R.F. Ferrari (ed.), Cambridge:\nCambridge University Press.</li>\n<li>White, S. A., 1995, “Thrasymachus the Diplomat”,\n<em>Classical Philology</em>, 90: 307–27.</li>\n</ul>\n<h3 id=\"CallGorg\">Callicles and the <em>Gorgias</em></h3>\n<ul class=\"hanging\">\n<li>Berman, S., 1991,“Socrates and Callicles on Pleasure”,\n<em>Phronesis</em>, 36 (2): 117–140.</li>\n<li>Cooper, J.M., 1999, “Socrates and Plato in Plato’s\n<em>Gorgias</em>”, in his <em>Reason and Emotion</em>,\nPrinceton: Princeton University Press, 29–75.</li>\n<li>Dodds, E. R.,1959, <em>Plato: Gorgias</em>, Oxford: Oxford\nUniversity Press (text, intro., commentary).</li>\n<li>Doyle, J., 2006, “The Fundamental Conflict in Plato’s\n<em>Gorgias</em>”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 30: 87–100.</li>\n<li>Hobbs, A., 2000, <em>Plato and the Hero: Courage, Manliness and\nthe Impersonal Good</em>, Cambridge: Cambridge University Press.</li>\n<li>Irwin, T., 1979, <em>Plato: Gorgias</em>, Oxford: Clarendon Press\n(trans. and commentary).</li>\n<li>Kahn, C., 1983, “Drama and Dialectic in Plato’s\n<em>Gorgias</em>”, <em>Oxford Studies in Ancient Philosophy</em>\n1: 75–121.</li>\n<li>Kamtekar, R., 2005, “The Profession of Friendship:\nCallicles, Democratic Politics, and Rhetorical Education in\nPlato’s <em>Gorgias</em>”, <em>Ancient Philosophy</em>,\n25: 319–39.</li>\n<li>Klosko, G., 1984, “The Refutation of Callicles in\nPlato’s <em>Gorgias</em>”, <em>Greece and Rome</em>, 31\n(2): 126–139.</li>\n<li>Nietzsche, F., 1968, <em>The Will to Power</em>, trans. W.\nKaufman, New York: Random House (original work published 1901).</li>\n<li>Rudebusch, G., 1992, “Callicles’ Hedonism”,\n<em>Ancient Philosophy</em>, 12 (1): 53–71.</li>\n<li>Woolf, R., 2000, “Callicles and Socrates: Psychic\n(Dis)harmony in the <em>Gorgias</em>”, <em>Oxford Studies in\nAncient Philosophy</em>, 18: 1–40.</li>\n<li>Zeyl, D. J., tr. Plato, <em>Gorgias</em>, in Cooper 1997.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "cognitivism vs. non-cognitivism, moral",
            "ethics: ancient",
            "Plato: ethics",
            "Plato: ethics and politics in The Republic",
            "Socrates"
        ],
        "entry_link": [
            {
                "../moral-cognitivism/": "cognitivism vs. non-cognitivism, moral"
            },
            {
                "../ethics-ancient/": "ethics: ancient"
            },
            {
                "../plato-ethics/": "Plato: ethics"
            },
            {
                "../plato-ethics-politics/": "Plato: ethics and politics in The Republic"
            },
            {
                "../socrates/": "Socrates"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=callicles-thrasymachus\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/callicles-thrasymachus/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=callicles-thrasymachus&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/callicles-thrasymachus/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=callicles-thrasymachus": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/callicles-thrasymachus/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=callicles-thrasymachus&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/callicles-thrasymachus/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}