{
    "url": "chinese-legalism",
    "title": "Legalism in Chinese Philosophy",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Yuri Pines\n<pinesy@mscc.huji.ac.il>",
        "author_links": [
            {
                "mailto:pinesy%40mscc%2ehuji%2eac%2eil": "pinesy@mscc.huji.ac.il"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nYuri Pines\n&lt;<a href=\"mailto:pinesy%40mscc%2ehuji%2eac%2eil\"><em>pinesy<abbr title=\" at \">@</abbr>mscc<abbr title=\" dot \">.</abbr>huji<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>il</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 10, 2014",
        "substantive revision Fri Apr 7, 2023"
    ],
    "preamble": "\n\nLegalism (which henceforth will be called the fa tradition)\nis a popular—albeit quite inaccurate—designation of an\nintellectual current that gained considerable popularity in the latter\nhalf of the Warring States period (Zhanguo, 453–221 BCE).\nFa thinkers were political realists who sought to attain\n“a rich state and a powerful army” and to ensure domestic\nstability in an age marked by intense inter- and intra-state\ncompetition. They believed that human beings—commoners and\nelites alike—will forever remain selfish and covetous of riches\nand fame, and one should not expect them to behave morally. Rather, a\nviable sociopolitical system should allow individuals to pursue their\nselfish interests exclusively in the ways that benefit the state, viz.\nagriculture and warfare. Parallel to this, a proper administrative\nsystem should allow officials to benefit from ranks and emoluments,\nbut also prevent them from subverting the ruler’s power. Both\nsystems are unconcerned with individual morality of the rulers and the\nruled; rather they should be based on impersonal norms and standards:\nlaws, administrative regulations, clearly defined rules of promotion\nand demotion, and the like.\n\nFa thinkers contributed greatly to the formation of\nChina’s empire both on the theoretical level and as political\npractitioners; and many of their ideas continued to be employed\nthroughout China’s history. Yet their derisive views of their\nrivals’ moralizing discourse, haughty stance toward fellow\nintellectuals, and pronouncedly anti-ministerial rhetoric—all\ngained them immense dislike among the imperial literati. From\nChina’s second imperial dynasty, the Han (206/202 BCE–220\nCE) on, the prestige of the fa tradition declined; only a few\ntexts associated with this current survived intact; and even in the\nmodern period, notwithstanding sporadic outbursts of interest in\nfa thought, this current had not received adequate scholarly\nattention. Only in the second decade of the twenty-first century is\nthe trend changing, as past sensitivities are receding and more\nscholars in China and outside it are ready to address the intellectual\nrichness of fa thought.\n",
    "toc": [
        {
            "#DefiFaTrad": "1. Defining the fa Tradition"
        },
        {
            "#MajoFaText": "1.1 Major fa Texts"
        },
        {
            "#HistCont": "1.2 Historical Context"
        },
        {
            "#PhilFoun": "2. Philosophical Foundations"
        },
        {
            "#EvolViewHist": "2.1 Evolutionary view of History"
        },
        {
            "#HumaNatu": "2.2 Human Nature"
        },
        {
            "#RuleImpaStanPrinImpa": "2.3 The rule by impartial standards and the principle of impartiality"
        },
        {
            "#TillSoldRuliPeop": "3. Tillers and Soldiers: Ruling the People"
        },
        {
            "#Puni": "3.1 Punishments"
        },
        {
            "#RewaRankMeri": "3.2 Rewards: The Ranks of Merit"
        },
        {
            "#OrdeBure": "4. Ordering the Bureaucracy"
        },
        {
            "#RecrPromFaModeMeri": "4.1 Recruitment and Promotion: The fa Model of Meritocracy"
        },
        {
            "#MoniOffiTechRule": "4.2 Monitoring Officials: Techniques of Rule"
        },
        {
            "#Rule": "5. The Ruler"
        },
        {
            "#RuleSupe": "5.1 The Ruler’s Superiority"
        },
        {
            "#EntrSove": "5.2 Entrapped Sovereign?"
        },
        {
            "#AssaCultLear": "6. Assault on Culture and Learning"
        },
        {
            "#EpilFaTradChinHistModeRese": "7. Epilogue: The fa Tradition in Chinese History and in Modern Research"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimLite": "Primary Literature"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Defining the fa Tradition\n\nThe fa tradition is best known in European languages as the\n“School of Law” or “Legalist school.” As Paul\nR. Goldin (2011) had demonstrated, this designation suffers from two\nproblems. First, the term fa does not necessarily mean\n“law.” Whereas this translation is surely correct in many\ncontexts (Lau and Lüdke, forthcoming), fa can as often\nrefer to “standards,” “models,”\n“norms,” “methods,” and the like; sometimes it\nrefers to the entirety of political institutions. The\n“Legalist” label is problematic because it inadvertently\nfocuses the studies of the fa tradition on a single issue of\nits relation to the Western concept of the “rule of law.”\nWhereas this angle of discussion has certain merits, as was\ndemonstrated in China starting with Liang Qichao\n梁啓超 (1873–1929) (see Liang [1906] 2003), it\nbecomes counterproductive when the richness and complexity of the\nfa thought is subordinated to a single point, which was not\nnecessarily of primary importance for fa thinkers.\n\nThe second problem of the designation “School of Law” (or\n“School of fa”; in Chinese fajia\n法家) is the term “school” or\n“scholastic lineage” (jia 家). This term is\nmisleading because it implies a self-aware and organized intellectual\ncurrent of fa adherents on a par with the followers of\n Confucius\n 孔子 (551–479 BCE) or\n Mozi\n 墨子 (ca. 460–390 BCE). In contrast to their case,\nhowever, the fajia label was designated primarily as a\nbibliographic category under which intellectually related texts were\ncatalogized in the imperial libraries. As such this designation is\nheuristically useful, but its usefulness fades once it is used as a\nmajor analytical tool. Heated debates about whether or not a certain\nthinker belongs to fajia, as occurred in the 1970s in China\n(Chen Chuang 2019) and outside it (Creel 1974: 137–162), are of\nlittle scholarly value, because no early thinker identified himself as\na member of the “School of fa” in the first\nplace.\n\nThe weaknesses of the “Legalist” or “School of\nLaw” label were well known to Western scholars who tried to find\na better translation for fajia, e.g. “Realists”\n(Waley 1939). Recently, this designation was defended and elaborated\nby Kai Vogelsang (2016), who noted the appropriateness to\nfajia of Hans Morgenthau’s definition of\n political realism\n as an approach that “sets politics as an autonomous sphere of\naction and understanding apart from other spheres, such as economics,\nethics, aesthetics, or religion” (Morgenthau 1978: 5). This\ndesignation has its merits, but it may be problematic because,\npace Morgenthau and Vogelsang’s intention, it may\ninadvertently create an impression that the opponents of\nfajia were mere idealists, which was not the case. A more\nneutral designation, adopted in Pines (forthcoming A) is the fa\ntradition, which will be employed in this article aside from the cases\nin which the texts specifically speak of fajia.\n\nThe grouping of several thinkers as belonging to the common\nintellectual tradition (the would be fajia) can be traced to\nHan Fei 韓非 (d. 233 BCE), who is often considered the\nmost significant representative of this intellectual current. In\nchapter 43, “Defining the standards” of Han Feizi\n韓非子, the thinker presents himself as a\nsynthesizer and improver of the ideas of two of his predecessors,\nShang Yang 商鞅 (d. 338 BCE) and Shen Buhai\n申不害 (d. 337 BCE). Pairing Shen Buhai and Shang\nYang, and adding Han Fei himself to them became common from the early\nHan dynasty (see, e.g. Huainanzi 6: 230; 11:423; 20: 833).\nThe historian Sima Qian 司馬遷 (ca. 145–90\nBCE) identified these three thinkers as adherents of the teaching of\n“performance and title” (xingming\n刑名) (Shiji 62: 2146; 68: 2227), the term which\nremained a secondary designation of the fa tradition thereafter (Creel\n1974: 140; and see 4.2 below). The fourth thinker commonly associated\nwith fajia—Shen Dao 慎到 (fourth century\nBCE)—also figures prominently in Han Feizi, where a whole\nchapter (40, “Objection to positional power”) is dedicated\nto the defense and improvement of Shen’s ideas (Pines 2020a).\nThese four thinkers (or, more precisely, the texts associated with\nthem) form the core of the fa tradition.\n\nThe term fajia was coined by Sima Qian’s father, Sima\nTan 司馬談 (d. 110 BCE) in his essay “On the\nEssentials of the Six Schools of Thought.” Sima Tan noted that\nfajia were “strict and have little kindness,” and\nthat they “neither distinguish between kin and stranger, nor\ndifferentiate between noble and base: everything is determined by the\nstandard (or law, fa).” Sima Tan criticized the\nfajia approach as “a one-time policy that could not be\nconstantly applied,” but also hailed these thinkers for\n“honoring rulers and derogating subjects, and clearly\ndistinguishing offices so that no one can overstep [his\nresponsibilities]” (Shiji 130: 3289–3291; for\ntranslations cf. Smith 2003: 141; Goldin 2011: 89). A century later\nthe bibliographical category of fajia was created. The Han\nlibrarian Liu Xiang 劉向 (79–8 BCE) applied this\ndesignation to ten texts in the Han imperial library (Hanshu 30:\n1735). Thenceforth this term remained a major category of book\ncatalogues well into the end of China’s imperial era.\n1.1 Major fa Texts\n\nOf the ten fajia texts in the Han imperial catalogue, six\nceased circulating more than a millennium ago; two arrived at our days\nrelatively intact, and of two others only a few fragments survived the\nvicissitudes of time. The earliest (in terms of its composition)\nsurviving text is the Book of Lord Shang\n(Shangjunshu 商君書), attributed to Shang\nYang (aka Gongsun Yang 公孫鞅 or Lord Shang/Lord of\nShang 商君), a major reformer who orchestrated the rise of\nthe state of Qin 秦 to the position of a leading power in the\nChinese world. In the process of transmission, the book lost at least\nfive chapters; a few others had been badly damaged, becoming barely\nlegible. Since the late 18th century, efforts have been made to\nprepare a critical edition of the text and amend its corrupted parts;\nyet more than two centuries passed before the comprehensive critical\nedition was published (Zhang Jue 2012). The text is highly\nheterogeneous in terms of the dates of its composition: some chapters\nwere likely penned by Shang Yang himself; others may come from the\nhand of his immediate disciples and followers, and a few other were\nwritten decades and even more than a century after his death (Pines\n2016a). This said, the text presents a relatively coherent ideological\nvision, and it is likely that it reflects intellectual evolution of\nwhat Zheng Liangshu (1989) dubbed Shang Yang’s\n“school” (xuepai 學派). The text\nmerited two translations into English: Duyvendak ([1928] 1963) and\nPines (2017).\n\nThe second surviving text, Han Feizi, is attributed to Han\nFei, a scion of the ruling family from the state of Hán\n韓 (not to be confused with the Hàn 漢 dynasty), a\ntragic figure who was allegedly killed in the custody of the King of\nQin, whom Han Fei wanted to serve. Of all the fa texts in the\nHan imperial catalogue, Han Feizi fared the best over the\nvicissitudes of time: all of its 55 chapters attested in the Han\ncatalog are still intact. The issue of whether or not the entire book\nhad been penned by Han Fei is debatable: considerable differences\namong the chapters in terms of style and mode of argumentation lead\nnot a few scholars to suspect that they come from different authors\n(e.g., Queen 2013). On the other hand, the differences may be\nexplained as reflecting the process of Han Fei’s intellectual\nmaturation, or the need to adapt argumentation to different audiences;\noverall, most of the chapters present a fairly coherent outlook (cf.\nGoldin 2020: 222–28 and Pines, forthcoming B). Han\nFeizi is considered as philosophically and literally more\nengaging than the Book of Lord Shang, and it has been more\nwidely studied in China, Japan (Sato 2013b), and in the West. It\nmerited one full English translation (Liao 1939–1959), with a\nnew one (Harbsmeier, which is borrowed, with modifications, below)\nforthcoming. In addition, many chapters have been translated by Burton\nWatson (2003).\n\nTwo other fa texts mentioned in the Han imperial catalog did\nnot survive intact, but lengthy quotations from them in the imperial\nencyclopedia have allowed partial reconstruction of their content.\nShēnzi 申子 is attributed to Shen Buhai, who\nacted as a chancellor of the state of Hán 韓 in the\nmiddle fourth century BCE, and who is credited with major\nadministrative improvement there. Of the original six chapters fewer\nthan three dozen fragments remain intact; for a comprehensive study\ncum translation see Creel 1974. Another text, Shènzi\n慎子 is attributed to Shen Dao 慎到, of whom\nvery little is known (it is even possible that the figure of Shen Dao\nis a conflation of several personalities; see Xu Fuhong 2013:\n2–8). Of original 42 chapters, seven survived (albeit in an\nincomplete form) in a seventh-century CE encyclopedia; altogether over\n120 surviving fragments of the text are considered authentic (Thompson\n1979; cf. Xu Fuhong 2013). The text merited a full English translation\ncum study (Harris 2016). In what follows, to avoid confusion between\nShēnzi and Shènzi, they will be referred\nto as works of Shen Buhai and Shen Dao respectively.\n\nThe above four texts are the major repository of the fa\nthought. Whereas they differ in terms of philosophical sophistication,\nmodes of argumentation, lexicon, and emphases, overall they present a\nsufficiently coherent outlook to merit their grouping together as\nbelonging to a single intellectual tradition. Another major text that\never since the Sui 隋 dynasty (581–618) had been\nreclassified as belonging to fajia is Guanzi\n管子. Guanzi is nominally attributed to a major\nreformer, Guan Zhong 管仲 (d. 645 BCE) from the state of\nQi 齊, but in reality it is a heterogeneous collection of essays\nproduced between the fourth and second centuries BCE (Rickett 1985:\n8–24). Some (but not all) of the Guanzi chapters\nclearly belong to the fa tradition (Sato, forthcoming). The\nwhole of Guanzi was translated into English by Rickett\n(1985–1998).\n\nIn addition to the above, traces of fa thought are found in a\nfew chapters of other multi-authored compilation, such as\nLüshi chunqiu 呂氏春秋 (composed\nca. 240 BCE) and Huainanzi 淮南子 (composed\nca. 139 BCE; see Ames 1994). The impact of the fa tradition\nis visible in memorials of early imperial statesmen, most notably of\nthe man who is considered the architect of the Qin Empire\n(221–207 BCE), Li Si 李斯 (d. 208 BCE) (see Bodde\n1938). Another statesman who is often identified as belonging to the\nfa tradition is an early Han minister, Chao Cuo\n鼂錯 (d. 154 BCE; Schwermann, forthcoming). Yet a few\ngenerations into the Han dynasty, the fa tradition started\nlosing its prestige and vitality. Although several Han and later texts\nwere intermittently classified as fajia, this identification\nremains too arbitrary to merit the inclusion of these texts in the\ncurrent discussion.\n1.2 Historical Context\n\nThe fa tradition is just one of the many intellectual currents that\nflourished in China during the three centuries prior to the imperial\nunification of 221 BCE. This period, often identified as the age of\nthe “Hundred Schools” was particularly rich in terms of\npolitical thought. This outburst of interest in political issues took\nplace against the backdrop of a severe systemic crisis. The end of the\nSprings-and-Autumns period (Chunqiu 春秋, 770–453\nBCE) was marked by the progressive disintegration of political\nstructures in the Zhou 周 (the then Chinese) world. Gradually,\nthe realm became entangled in a web of debilitating struggles among\nrival polities, between powerful nobles and the lords within each\npolity, as well as among aristocratic lineages and among rival\nbranches within major lineages. By the fourth century BCE, a degree of\nre-centralization in individual polities was achieved, but interstate\nwarfare further intensified, giving, in retrospect, the new era an\nominous name: the age of the Warring States (Zhanguo 戰國,\n453–221 BCE). As wars became bloodier and more devastating, and\nwith no adequate diplomatic means to settle the conflicts in sight,\nmost thinkers and statesmen came to an understanding that unity of\n“All-under-Heaven” (tianxia 天下) was\nthe only means to attain peace and stability (Pines 2000). How to\nbring this unity about and how to “stabilize\nAll-under-Heaven” became the central topic addressed by\ncompeting thinkers. In the final account, the fa\ntradition’s ability to provide the most compelling answers to\nthis question became the singular source of its ideological\nappeal.\n\nCrises and bloodshed aside, the Warring States period was also an age\nrife with opportunities for intellectually active individuals. It was\nan exceptionally dynamic period, marked by novel departures and\nprofound changes in all walks of life. Politically, the loose\naristocratic entities of the Springs-and-Autumns period were replaced\nby centralized and bureaucratized territorial states (Lewis 1999).\nEconomically, the introduction of iron utensils (Wagner 1993)\nrevolutionized agriculture, allowing higher yields, prompting the\ndevelopment of wastelands, and bringing about demographic growth, as\nwell as accelerating urbanization and commercialization of the\neconomy. Militarily, new technologies, such as the crossbow, as well\nas new forms of military organization, brought about the replacement\nof aristocratic chariot-led armies by mass infantry armies staffed by\npeasant conscripts, resulting in a radical increase in warfare’s\nscale and complexity (Lewis 1999). And socially, the hereditary\naristocracy that dominated the Zhou world during most of the Bronze\nAge (ca. 1500–400 BCE) was eclipsed by a much broader stratum of\nshi 士 (sometimes translated as “men of\nservice”), who owed their position primarily to their abilities\nrather than the pedigree (Pines 2009: 115–135). These profound\nchanges required new approaches to a variety of administrative,\neconomic, military, social, and ethical issues: old truths had to be\nreconsidered or reinterpreted. For intellectuals eager to tackle a\nvariety of new questions—and particularly for fa\nthinkers—this was a golden age.\n\nEach of the competing “schools of thought” sought ways to\nimprove the functioning of the state, to attain sociopolitical\nstability, and to bring about peace under Heaven; yet among a variety\nof answers those provided by the fa thinkers appear to be most\npractical. This is not incidental: after all, some of the major\nfa thinkers, most notably Shang Yang, were the leading\nreformers of their age. These thinkers were at the forefront of\nadministrative and sociopolitical innovation; they were most ready to\ndispense with bygone norms and paradigms; and they were more pragmatic\nand result-oriented than most of their ideological rivals. Their\nrecipes proved to be highly effective in the age of fierce interstate\ncompetition, but once the imperial unification was attained and the\nneed in full mobilization of human and economic resources receded, the\nappeal of the fa ideas weakened as well (section 7 below). By\nthen, the lingering resentment against the fa thinkers’\ncynicism and their perceived anti-intellectualism resulted in the\nincreasing denigration of the fa tradition in general (Song,\nforthcoming B). In retrospect, Sima Tan’s observation appears to\nbe correct: the fa recipes were highly effective in the short\nrun but less attractive in the long term.\n2. Philosophical Foundations\n\nThe fa tradition is at times compared with modern social\nsciences (Schwartz 1985), and this comparison grasps well some of its\ncharacteristics. Angus C. Graham (1989: 269) notes that\n“Legalists” were the first political philosophers in China\n“to start not from how society ought to be but how it is.”\nIndeed, this was the most practical-oriented of all preimperial\nintellectual currents. Its proclaimed goal was to attain “a rich\nstate and a strong army” (fu guo qiang bing\n 富國強兵),[1]\n which would be the precondition for future unification of the entire\nsubcelestial realm. The thinkers’ focus was on how to attain\nthis goal, and less on philosophical speculations. The fa\ntexts neither subordinate the political action to moralizing\ndiscourse, nor claim conformity to divine will—topoi that recur\nin the writings of the followers of Confucius and Mozi. Cosmological\nstipulations of political order, which became hugely popular after the\n Laozi\n 老子 (fourth century BCE) are of slightly higher\nimportance for the fa thinkers: they are referred to in some\nof Shen Buhai and Shen Dao’s fragments and, more notably, in\nseveral chapters of the Han Feizi. Yet these speculations are\nnot essential for these thinkers’ arguments: hence, pace\nattempts to consider cosmological digressions of Han Feizi as\nfoundations of its political philosophy (Wang and Chang 1986), it\nwould be more accurate to see them as argumentative devices that were\n“not fully assimilated” into Han Fei’s thought\n(Graham 1991: 285; cf. Goldin 2020: 223–26). Generally, the\nfa texts display considerable philosophical sophistication\nonly when they have to justify departures from conventional approaches\nof other intellectual currents. In this regard their views of\nhistorical evolution and of human nature are highly engaging. These\nare the foundations for the overarching principle of the fa\nthought: the insistence on the rule by impartial standards as\nadvantageous over reliance on human factor in politics.\n2.1 Evolutionary view of History\n\nThe Warring States period was an age of comprehensive sociopolitical\nchange, and thinkers of different intellectual affiliations had to\ncome to terms with this change. The majority tried to accommodate it\nwithin the framework of the “changing with the times”\nparadigm (Kern 2000: 170–174). Namely, certain innovations and\nmodifications of existent policies are inevitable, but these do not\nrequire a radical overhaul of the current sociopolitical system, and\ndo not undermine the usefulness of the past as a guideline for the\npresent. The fa thinkers, by contrast, readily dispensed with\ntraditional modes of rule; they questioned the very relevance of the\npast to the present. They dismissed “the assumption that despite\nthe difference between past and present there remains a fundamental\ncorrespondence between them,” promoting instead the idea of\n“sequential history” which justified radical departures\nfrom earlier sociopolitical patterns (Vogelsang, forthcoming). Their\nattack on supporters of emulating the past was twofold. First, there\nwas simply no uniform model of orderly rule in the past to be\nconformed to. Second, and more importantly, society evolves, and this\nevolution turns behavioral modes, institutions, and even values of the\npast obsolete.\n\nThe first of these arguments is presented in chapter 1,\n“Revising the laws,” of the Book of Lord Shang.\nShang Yang argues: \n\n\nFormer generations did not adopt the same teaching: So which antiquity\nshould one imitate? Thearchs and Monarchs did not repeat one another:\nSo which rituals should one conform to? ... There is no single way to\norder the generation; to benefit the state, one need not imitate\nantiquity. (Book of Lord Shang 1.4)\n\n\nHan Fei adds another reason for dismissing the past models: we simply\ncannot verify exactly what they were. Those who claim the authority of\nantiquity—such as adherents of Confucius and Mozi—cannot\nagree which lessons of the past are to be applied in the present: \n\n\nHe who claims certain knowledge without examining the issue is a fool;\nhe who relies on things which are impossible to ascertain is an\nimpostor. Thus, those who openly adduce the former monarchs as\nevidence and claim they can determine indubitably [the way of the\nparagon legendary rulers] Yao and Shun, are either fools or impostors.\n(Han Feizi 50.1, “Illustrious teachings”)\n\n\nYet having postulated the impossibility of learning from the past\nmodels, Shang Yang and Han Fei propose an alternative lesson that can\nbe learnt: that changing circumstances may require not a piecemeal but\na comprehensive readjustment of the sociopolitical system. To\ndemonstrate the magnitude of change in the past, both thinkers turn to\nremotest antiquity, and trace how the state was formed. For instance,\nShang Yang presents the story of social evolution from primeval\npromiscuous life to an incipient stratified society and then to a\nfully mature state with laws, regulations, officials, and the power of\ncoercion (Book of Lord Shang 7.1, “Opening the\nblocked”). At the earlier stages of human history, the people\ncould be constrained by moral suasion; yet this was only because that\nwas the age of relative abundance. Han Fei further explains: in the\nremote past “the people were few whereas goods were plenty;\nhence people did not compete.” Yet this age of primeval morality\nhas gone forever because of the devastating impact of demographic\ngrowth: “Nowadays, five children are not considered too many,\nand each child also has five children; the grandfather is still alive,\nand he already has twenty-five grandchildren. Therefore, the people\nare plenty whereas commodities and goods are few; people work\nlaboriously, but provisions are scanty; hence the people\ncompete” (Han Feizi 49.2, “Five vermin”).\nUnder these new circumstances, moral norms are no longer sufficient to\ncontrol social contention; it can be quelled only through\ncoercion.\n\nThe evolutionary view of history and especially the understanding that\nmaterial conditions can alter moral values, distinguish the\nfa thinkers critically from proponents of alternative models\nof state formation (Pines 2013a). The fa texts imply that\neverything is changeable: as socioeconomic conditions change, human\nbehavior changes as well; and this in turn requires adaptation of\npolitical institutions. Shang Yang summarizes:\n\n\nWhen the affairs of the world change, one should implement a different\nWay. … Therefore, it is said: “When the people are\nignorant, one can become monarch through knowledge; when the\ngeneration is knowledgeable, one can become monarch through\nforce.” (Book of Lord Shang 7.1–7.2,\n“Opening the blocked”)\n\n\nThe last phrase represents the rationale behind Shang Yang’s\nmodel of state formation. If radical restructuring of society was\nlegitimate in the past, so it is in the present. In the current\nsituation, when the people are “knowledgeable,” a powerful\nstate, which is able to coerce its subjects, is the only viable\nsolution. The Book of Lord Shang (but not Han Feizi)\nallowed for the possibility that in the future the need for excessive\nreliance on coercion would end, and a milder, morality-driven\npolitical structure would evolve; but these utopian digressions are of\nminor importance in the text (Pines 2013a). Unlike supporters of\nhistorical progress in the Occident, the fa thinkers never\ndeveloped a philosophy of history, nor the idea of its telos\n(Vogelsang, forthcoming). What mattered for them was the bottom line:\nradical reforms were inevitable in the past; and they are inevitable\nin the present.\n2.2 Human Nature\n\nThe second pillar of the fa political philosophy is the view of human\nnature (or, as Harris [forthcoming] prefers to call it, human\nmotivations). The fa texts eschew the discussion of whether\nor not human badness or goodness are inborn, or whether or not all\nhumans possess fundamentally similar qualities. What matters is,\nfirst, that the overwhelming majority of humans are selfish and\ncovetous; second, that this situation cannot be changed through\neducation or self-cultivation; and, third, that this selfishness can\nbecome an asset to the ruler rather than a threat. That “the\npeople follow after benefit as water flows downward” (Book\nof Lord Shang 23.3, “Rulers and ministers”) is a\ngiven: the task is to let the people satisfy their desire for glory\nand riches only in the ways that accord with the state’s needs.\nThe Book of Lord Shang explains:\n\n\nWherever the name (repute) and benefit meet, the people will go in\nthis direction.… Farming is what the people consider bitter;\nwar is what the people consider dangerous. Yet they brave what they\nconsider bitter and perform what they consider dangerous because of\nthe calculation [of a name and benefit]. … When benefits come\nfrom land, the people exhaust their strength; when the name comes from\nwar, the people are ready to die. (Book of Lord Shang\n6.4–6.5, “Calculating the land”)\n\n\nThat people covet wealth was a commonplace in the texts of competing\nthinkers; but the Book of Lord Shang adds a second universal\nmotivating force—the quest for “a name”\n(ming 名), a term that refers both to fame and\nreputation and to enhanced social status (Pines 2020b; cf. Lewis\n2021). This quest should be properly understood and manipulated so as\nto direct the people to the pursuits deemed necessarily by the state,\nviz. agriculture and warfare (see section 3 below).\n\nThe fa thinkers’ view of the people as covetous and\nselfish was not exceptional to this intellectual current: it was\nshared, among others, by the major Confucian thinker,\n Xunzi\n 荀子 (d. after 238 BCE). Yet unlike Xunzi and other\nConfucian thinkers, the fa texts dismiss the possibility that\nelite members—the cultivated “noble men”\n(junzi 君子)—would be able to overcome\ntheir selfishness. Hence, the fa thinkers dismiss the common\nrecommendation to staff the government with morally upright\n“noble men” as naïve if not outright manipulative.\nShen Dao explains:\n\n\nAmong the people, everybody acts for himself. If you [try to] alter\nthem and cause them to act for you, then there will be none whom you\ncan attain and employ. … In circumstances where people are not\nable to act in their own interests, those above will not employ them.\nEmploy the people for their own [interests], do not employ them for\nyour sake: then there will be none whom you cannot make use of.\n(Harris 2016: 112)\n\n\nShen Dao dismisses the possibility that officials will be driven by\nmoral commitment; actually, such exceptional selfless individuals\nshould not be employed at all. This sentiment recurs in Han\nFeizi, a text that expresses with utmost clarity its belief that\nevery member of the elite—like any member of\nsociety—pursues his own interests (Goldin 2020: 201–28).\nLike Shen Dao, Han Fei acknowledges the existence of selfless\nindividuals, such as lofty recluses who despise glory and riches, but\ndismisses them as politically useless. As for morally upright\nofficials, these are too rare individuals to be relied upon.\n“Today, there are no more than ten honest and trustworthy men of\nservice (shi 士), but there are hundreds of offices\nwithin the boundaries. If you insist on exclusively appointing honest\nand trustworthy men of service, then there will be not enough people\nfor the official positions” (Han Feizi 49.11,\n“Five vermin”).\n\nHaving dismissed the common expectation that top echelons of political\nsystem would be filled in with morally cultivated persons, the\nfa thinkers propose an alternative. A proper system should be\nbased on impersonal standards and norms, which would function well\nunder any type of political leaders.\n2.3 The rule by impartial standards and the principle of impartiality\n\nEarly in the twentieth century, Liang Qichao identified the difference\nbetween the fa thinkers and their Confucian rivals as the\ndichotomy between the rule of fa (fazhi\n法治) over the “rule of men” (renzhi\n人治). This correct observation generated considerable\nconfusion, because the compound fazhi is used in modern\nChinese for the Western “rule of law.” Putting aside the\ndebates about the similarities and dissimilarities between the rule of\nfa and the “rule of law,” it is advisable to\nanalyze the former on its own terms rather than through the prism of\nOccidental thought. \n\nGraziani (forthcoming) notes that the concept of fa was\ninitially associated with precision tools—such as T-squares,\ncompasses, weights, and measures—which were considered more\nreliable than individual skills of artisans or merchants. Similarly,\nin the political sphere, fa—referring to an entirety of\nimpersonal norms, laws, regulations, and institutional\nsolutions—was deemed more reliable than the habitual appeal to\nthe incumbents’ personal abilities and moral qualities. Han Fei\nexplains:\n\n\nFor correcting the oversights of superiors, for prosecuting the\nwickedness of subordinates, for bringing order to chaos and sorting\nout tangles, for removing the superfluous and evening out the wrong,\nand for uniting the tracks of the people, nothing is as good as\nfa. (Han Feizi 6.5, “Having\nstandards”)\n\n\nTo become effective regulator of sociopolitical life,\nfa—especially in its meaning as\n“law”— must be fair and transparent. Fairness means\nthat laws are applicable equally to every subject, and even the ruler\nhimself should strictly observe them. Whereas the ruler has the\nright—actually the duty—to alter the laws when the\ncircumstances demand this—he is actively dissuaded against\nwhimsical intervention in current laws and norms. Thus, he should\nabide by the fixed rules of promotion and demotion and never allow\npersonal favorites to be promoted at the expense of truly meritorious\nservants (see more in 5.2). As for transparency, it means that laws\nshould be understood by everybody. Han Fei clarifies:\n\n\nAs for fa, it is compiled and written down on charts and\ndocuments, deposited in the repositories of the offices and\npromulgated to the hundred clans. … Therefore, when the\nclear-sighted ruler speaks of fa, everyone within his\nfrontiers, including the lowly and base, will hear and understand it.\n(Han Feizi 38.8.2, “Objections 3”)\n\n\nThe principle of transparency and the importance of legal knowledge of\nthe populace (including “the lowly and base”) stands also\nat the center of chapter 26 (“Fixing divisions”) of the\nBook of Lord Shang. As such fa is not a tool of\nintimidation and suppression as is often imagined (despite the\nnotorious advocacy of harsh punishments in the fa texts).\nRather it refers to common rules of the game that should be\ninternalized by every political actor.\n\nThe rule by impersonal standards is not just the most effective way of\novercoming personal inadequacies of the incumbents. It is also the\nmoral way, insofar as morality is represented by the principle of\nimpartiality rather than by Confucian insistence on “benevolence\nand righteousness” (renyi 仁義) (Jiang\n2021: 267 ff.). Impartiality (gong 公) is the opposite\nof selfishness (si 私). It also stands for the common\ninterests of the people. Whereas the term gong normally\nrefers to the ruler (“duke,” or “regional\nlord”), which implies that “common” interests of the\nsubjects are identical to those of the sovereign (Liu Zehua 2003:\n332–373; Goldin 2020: 204–205), in practice the two were\ndifferentiated (see section 5.2). An impartial fa was not\njust the means to improve the ruler’s governance but also the\nbest means to overcome the ruler’s potential ineptitude.\n3. Tillers and Soldiers: Ruling the People\n\nThe Book of Lord Shang is the text that addresses most\nsystematically the issue of major concern to the Warring States-period\nrulers: how can the state survive in the age of perennial war? The\nanswer—anticipating modern ideas of “total\nwar”—was total utilization of the state’s material\nand human resources for the military success. Practically, this meant\ndirecting the entire population to two essential occupations:\nagriculture and warfare, which, in the Book of Lord Shang,\nare jointly dubbed “the One” (yi 壹). Then,\n“when an army is dispatched, provisions are ample, and resources\nare abundant; when the army is at rest, the people are working, and\nthe accumulated [surplus] suffices for a long time” (Book of\nLord Shang 6.2, “Calculating the land”).\n\nTo cause every subject engage in utterly unattractive tasks of tilling\nand fighting, Shang Yang recommends the ruler to manipulate his\nsubjects’ natural dispositions. The text explains:\n\n\nHuman beings have likes and dislikes; hence, the people can be ruled.\nThe ruler must investigate likes and dislikes. Likes and dislikes are\nthe root of rewards and penalties. The disposition of the people is to\nlike ranks and emoluments and to dislike punishments and penalties.\nThe ruler sets up the two in order to guide the people’s will\nand to establish whatever he desires. (Book of Lord Shang\n9.3, “Implementing laws”)\n\n\nTo properly motivate the people, the ruler should employ a combination\nof positive (rewards, ranks, emoluments) and negative (punishments,\npenalties) incentives. The institutions of the state (fa in\nits broadest meaning) should be designed so as to channel social\nforces toward desirable social and political ends. This approach,\nwhich curiously resembles modern ideas of social engineering (Pines\n2016b), is the hallmark of Shang Yang’s intellectual\naudacity.\n3.1 Punishments\n\nShang Yang gained notoriety as a people-basher. The text attributed to\nhim indeed appalls the readers with provocative pronouncements, such\nas “When the people are weak, the state is strong. Hence the\nstate that possesses the Way devotes itself to weakening the\npeople” (Book of Lord Shang 20.1, “Weakening the\npeople”). Elsewhere, the author insists that to succeed in his\nundertakings, the ruler should “control the people as the\nmetalworker controls metal and the potter clay... Those who excel at\norderly rule block the people with law; then a [good] name and lands\ncan be attained.” (Book of Lord Shang 18.2,\n“Charting the policies”). Similar pronouncements permeate\nthe text.\n\nNo other thinker matches Shang Yang’s brazennes in exposing the\nperennial contradiction between society (“the people”) and\nthe state. In the age when the people are “knowledgeable and\ncrafty,” coercion is the only mean to rein them in. This\nexplains the pivotal role of the punitive system in Shang Yang’s\nmodel. Harsh punishments should be imposed even on minor or even\n“about to be committed” transgressions. The system of\nmutual responsibility among neighbors and kin, tight residential\ncontrol, and mandatory denouncement of crimes would ensure that every\ncriminal is apprehended. Yet once the populace is overawed, the\npunishments become redundant:\n\n\nTo prevent wrongdoing and stop transgressions, nothing is better than\nmaking punishments heavy. When punishments are heavy and [criminals]\nare inevitably captured, then the people dare not try [to break the\nlaw]. Hence, there are no penalized people in the state. When there\nare no penalized people in the state, it is said, then:\n“Clarifying punishments [means] no executions.” (Book\nof Lord Shang 17.3, “Rewards and punishments”)\n\n\nHarshness is essential for the system’s success, but so is the\nlaws’ transparency and fairness (above, section 2.3). The\nultimate goal is to “eradicate punishments with\npunishments” (Book of Lord Shang 18.1, “Charting\nthe policies”). To a certain degree, this goal was achieved.\nActually, even such critics of Shang Yang as Sima Qian acknowledged\nhis success in turning the Qin people into law-abiding subjects\n(Shiji 68: 2231).\n3.2 Rewards: The Ranks of Merit\n\nCoercion aside, positive incentives are equally important for Shang\nYang’s program. As the text readily recognizes, the people are\nnot just the ruler’s potential enemy but are also his major\nasset. Without their hard labor in the fields and bravery on the\nbattlefield, the state is doomed. To motivate them, coercion will not\nsuffice. Rather, to make the “bitter and dangerous”\noccupations of tilling and fighting attractive, one should turn them\ninto the exclusive way to material riches and glory. This\nunderstanding stands at the background of Shang Yang’s most\ncelebrated reform: the replacement of Qin’s traditional\nhereditary aristocratic order with the new system of the ranks of\nmerit.\n\nThe system of 20 (initially fewer) ranks of merit introduced by Shang\nYang was one of the most daring acts of social engineering in human\nhistory. This system became the cornerstone of social life in Qin. The\nlowest ranks were distributed for military achievements, particularly\ndecapitating enemy soldiers, or could be purchased in exchange for\nextra grain yields; some of the successful rank-holders could be\nincorporated into the military or civilian administration and\nthereafter be further promoted up the social ladder. Each rank granted\nits holder economic, social, and legal privileges (e.g. redeeming\nmutilating punishments by paying a fine). Since the ranks were not\nfully inheritable, the system generated considerable social mobility\n(Pines 2016b: 17–24; q.v. for further references). The ranks of\nmerit—i.e., rewards—became the major motivating force for\nQin’s subjects, especially on the battlefield. The text\nclarifies:\n\n\nWhen rewards are unified, the army has no rivals. . . . What is called\n“unifying rewards” means that benefits, emoluments,\nofficial position, and rank uniformly derive from military\n[attainments] and that there are no other ways to dispense them.\nTherefore, the knowledgeable and the ignorant, the noble and the base,\nthe courageous and cowardly, the worthy and unworthy—all fully\nutilize their innermost wisdom and fully exhaust the power of their\nlimbs, going forth to die in the service of their superiors. (Book\nof Lord Shang 17.1–2, “Rewards and\npunishments”)\n\n\nIn the above passage the ranks of merit and adjacent “benefits,\nemoluments, and official positions” are to be distributed\nexclusively in exchange for military attainments. Elsewhere the text\nsuggests that high grain yields should be another avenue to ranks,\nalthough the latter point remained less developed than rewarding\nmeritorious soldiers (Pines 2021). Differences notwithstanding, one\npoint remains consistent. The efficiency of the system of ranks of\nmerit requires its exclusivity, which in turn can be ensured only\nthrough the government’s control over social, economic, and\npolitical status of the subjects. The text concludes:\n\n\nThose who do not work but eat, who do not fight but attain glory, who\nhave no rank but are respected, who have no emolument but are rich,\nwho have no office but lead—these are called\n“villains” (Book of Lord Shang 18.6,\n“Charting the policies”).\n\n\nShang Yang is adamant: any group which tries to bypass engagement in\nagriculture and warfare—be these merchants who amass riches\nwithout tilling or talkative intellectuals who seek promotion without\ncontributing to the state economically or militarily—should be\nsuppressed or at least squeezed out of profits. Nothing—neither\nlearning, nor commerce, nor even artisanship—should distract the\npeople from farming and fighting.\n\nNot all aspects of Shang Yang’s program were equally successful.\nThe simplistic emphasis on agriculture only and the recommendation to\nsuppress commerce was eventually abandoned by Qin policy makers (Pines\n2021). Some of the military ideas in the text—e.g., the\ndepiction of the commanders who are more preoccupied with calculating\nthe merits of individual soldiers than directing the battle—also\nappear naïve (Pines 2016c: 123–125). These flaws\nnotwithstanding, overall, Shang Yang’s reforms and the ideas\nexpressed in the Book of Lord Shang should be credited for\nturning the state of Qin into arguably the most formidable military\nmachine in China’s long history.\n4. Ordering the Bureaucracy\n\nTo rule and control the people effectively, the government should rely\non an extensive bureaucracy; but this bureaucracy in turn should be\nproperly staffed and tightly monitored. It is with this regard that\nthe fa thinkers made a lasting contribution to China’s\nadministrative thought and administrative practices. Their strongly\npronounced suspicion of scheming ministers and selfish officials was\nconducive to the promulgation of impersonal means of recruitment,\npromotion, demotion, and performance control. These means became\nindispensable for China’s bureaucratic apparatus for millennia\nto come (Creel 1974).\n4.1 Recruitment and Promotion: The fa Model of Meritocracy\n\nOne of the primary issues that the rulers of the Warring States faced\nwas that of recruitment into government service. During the\naristocratic Springs-and-Autumns period, the overwhelming majority of\nofficials were scions of hereditary ministerial lineages; only\nexceptionally could outsiders join the government. This situation\nchanged by the end of the fifth century BCE, as aristocratic lineages\nwere largely eliminated in internecine struggles and members of lower\nnobility—the so-called “men of service,”\nshi 士—could advance up the ladder of\nofficialdom. It was then that the new meritocratic discourse of\n“elevating the worthy” (shang xian\n尚賢) proliferated and upward social mobility became\nlegitimate (Pines 2013c). Yet who were the “worthy” and\nhow to determine one’s worth was a matter of considerable\nuncertainty and confusion.\n\nOne model was proposed by Confucians. It was a bottom-up model.\nOne’s worth as a “noble man” was primarily\ndetermined by one’s morality; and those who could judge this\nmorality were one’s peers. In practice, it meant that the ruler\nshould heed the elite opinion and appoint persons who gained renown\nfor their moral qualities. For the fa thinkers, this was a\ndangerous delusion. In their eyes, the vagueness of the\n“worth” definition was deliberately built into the\nConfucian model to open career opportunities for the good-for-nothing\ntalkers. The Book of Lord Shang clarifies:\n\n\nWhat the world calls a “worthy” is one who is defined as\nupright; but those who define him as good and upright are his\npartisans. When you hear his words, you consider him able; when you\nask his partisans, they approve it. Hence, one is ennobled before one\nhas any merits; one is punished before one has committed a crime.\n(Book of Lord Shang 25.1, “Attention to law”)\n\n\nThe author perceptively identifies the problem of PR campaigns in\nwhich the appointee’s ability and worth are determined by his\nreputation, which, in turn, is manufactured by his partisans (or a\n“clique,” dang 黨). The result is\nproliferation of fake worthies. This proliferation becomes possible\nbecause the ruler can easily be manipulated and misled by those who\nhide their selfishness behind lofty pronouncements. Shen Dao further\nwarns the ruler that if he decides on promotions and demotions on the\nbasis of his personal impression, this will cause inflated\nexpectations or excessive resentment among his servants:\n\n\nWhen the ruler abandons the standard (fa) and relies on\nhimself to govern, then punishments and rewards, recruitment and\ndemotion all arise out of the ruler’s heart. If this is the\ncase, then even if rewards are appropriate, the expectations are\ninsatiable; even if the punishments are appropriate, lenience is\nsought ceaselessly. If the ruler abandons the standard and relies on\nhis heart to decide upon the degree [of awards and punishments], then\nidentical merits will be rewarded differently, and identical crimes\nwill be punished differently. It is from this that resentment arises.\n(Harris 2016: 120)\n\n\nTo avoid mistakes, to screen off false worthies, and to avoid\nresentment, the ruler should never rely on his own judgments. Instead,\npromotion and demotion should be based on impersonal standards only.\nHan Fei clarifies:\n\n\nThus, as for the officials of an enlightened ruler: chief ministers\nand chancellors must rise from among local officials; valiant generals\nmust rise from among the ranks. One who has merit should be awarded:\nthen ranks and emoluments are bountiful and they are ever more\nencouraging. One who is promoted and ascends to higher positions, his\nofficial responsibilities increase, and he performs his tasks ever\nmore orderly. When ranks and emoluments are great, while official\nresponsibilities are well ordered —this is the Way of the [True]\nMonarch. (Han Feizi 50.5, “Illustrious\nTeachings”)\n\n\nHan Fei proposes a meritocratic system that would not depend on the\nvague notion of “worthiness” but will function according\nto objective criteria of merit. Administrative and military officials\nwill be promoted from the lower ranks of the bureaucracy and the army;\nthey will be judged according to their performance, and, if\nsuccessful, given ever more important offices. While the system is far\nfrom perfect (it does not explain how the people will join the\nadministrative apparatus in the first place), it is much more\nsophisticated than anything proposed in other Warring States-period\ntexts. It bears clear resemblance to the rules of promotion in such\nmodern meritocratic systems as the army or academia. And it is the\nsystem most readily associated with the current state of affairs in\nthe People’s Republic of\n China.[2]\n4.2 Monitoring Officials: Techniques of Rule\n\nThe chapter “Defining the standards” of Han Feizi\nfamously criticized Shang Yang for being too focused on fa\n(meaning in this context the control of society), while paying\ninsufficient interest to the problems of governing the political\napparatus. Han Fei, by contrast (as well as Shen Buhai, many of whose\nideas Han Fei adopted), paid primary attention to the latter. Han\nFei’s observation, “the sage orders the officials, not the\npeople” (Han Feizi 35.4.1) is insightful. No problem\ncould be dealt with adequately unless the ruler possessed an efficient\nand responsive bureaucracy.\n\nDealing with the bureaucrats posed two problems. First, Han Fei\npresumes that officials will normally do whatever possible to cater to\ntheir selfish needs, bringing about dereliction of duty, corruption,\nand the resultant weakening of governability. Second, and more\npeculiar to Han Feizi, the text repeatedly warns that the\nreal problem with the officials is not just that of corruption and\ninefficiency. Rather, powerful officials are bent on subverting the\nsovereign’s power and even outright usurping the throne. A\nprudent ruler should adequately deal with both—indirect and\ndirect—threats. To do so, he must pay utmost attention to the\n“techniques of rule” (shu 術).\n\nThe term shu has two aspects. First, it refers to a variety\nof bureaucratic devices aimed at monitoring the officials’\nperformance. For instance, “Technique is bestowing office on the\nbasis of concrete responsibilities, demanding performance on the basis\nof titles, wielding the levers of life and death, and examining the\nabilities of the ministers” (Han Feizi 43.1.2,\n“Defining the standards”). These are reasonable mechanisms\nthat can be adequately utilized in modern management. Ditto for the\ntext’s insistence that the ruler preserves absolute control over\nrewards and punishments. Yet there is a second, and more problematic\naspect of shu: it refers to a variety of means aimed at\nsafeguarding the ruler’s power against his scheming underlings.\nThis underlying concern is well palpable in Han Fei’s discussion\nof the principle of “performance and titles”\n(xingming 形名)—one of the crucial elements\nin his administrative thought (for the term xingming cf.\nMakeham 1990–91; Indracollo forthcoming). Han Feizi\nexplains:\n\n\nA sovereign who wants to suppress treachery must examine and match\nperformance (or the form, xing 形) and title (or the\nname, ming 名). Performance and title refer to the\ndifference between the proposal and the task. The minister lays out\nhis proposal; the ruler assigns him the task according to his\nproposal, and solely on the basis of the task determines [the\nminister’s] merit. When the merit matches the task, and the task\nmatches the proposal, [the minister] is rewarded; when the merit does\nnot match the task and the task does not match the proposal, he is\npenalized. … Thus, when the clear-sighted sovereign nourishes\nhis ministers, the minister should not claim merit by overstepping\n[the duties of] his office, nor should he present the proposal that\ndoes not match [his task]. One who oversteps his office’s\n[duties] dies; one who[se proposal] does not match [the task] is\npunished; then the ministers are unable to form cabals and cliques\n(Han Feizi 7.2, “Two levers”).\n\n\nGoldin (2020: 214) compares the notion of “performance and\ntitles” to the modern call for bids. A minister makes the\nproposal on the basis of his official duties; his actual performance\nis then matched against his proposal and the result (reward or\npunishment) is determined accordingly. Whether or not one accepts the\nlogic of this management style, it is safe to say that in principle it\nis not controversial. However, it is framed above within the context\nof the ruler’s struggle against ministerial treachery and\nagainst cabals and cliques. This brings us to the more problematic\naspect of Han Fei’s “techniques”: their clandestine\nand tricky nature. Han Fei explains:\n\n\nAs for techniques of rule, they are hidden in the breast. It is that\nthrough which you match up all the various ends and from your secret\nplace steer the ministers. Therefore, laws (fa) are best when\nthey are clear, whereas techniques should not be seen. (Han\nFeizi 38.8.2, “Objections 3”)\n\n\nThe reason behind this secrecy is that the techniques of rule serve\nnot just to help the ruler perfect the bureaucratic mechanism, but,\nmore urgently, to safeguard him against closest aides. Han\nFeizi is adamant in its repeated warnings to the ruler: beware of\neverybody; especially of your ministers. For instance, chapter 8,\n“Extolling authority” postulates:\n\n\nThe Yellow Emperor said: “A hundred battles a day are fought\nbetween the superior and his underlings.” The underlings conceal\ntheir selfish [interests], trying to test their superior; the superior\nemploys gauges and measures to restrict the underlings. Hence when\ngauges and measures are established, they are the sovereign’s\ntreasure; when the cliques and cabals are formed, they are the\nministers’ treasure. If a minister does not murder his ruler,\nthis is because the cliques and cabals are not formed yet. (Han\nFeizi 8.8)\n\n\nAmazingly, Han Fei—himself an aspiring minister—concludes\nthat the ministers are by definition the ruler’s mortal enemies.\nIf they did not carry out the assassination, it is only because they\ndid not prepare adequately, or, as the text explains elsewhere,\nbecause the ruler was prudent enough to outwit them through the proper\napplication of the techniques of rule. Han Fei’s view echoes\nShen Buhai’s assessment that the ruler’s true enemies are\nnot the outsiders, “invaders and bandits,” but rather an\ninsider: a minister, who “by limiting what the ruler sees and\nrestricting what the ruler hears, seizes his government and\nmonopolizes his commands, possesses his people and takes his\nstate” (Creel 1974: 344, translation modified).\n\nThis pronounced anti-ministerial mindset of the fa thinkers\nstands at the backdrop of some of Han Fei’s most questionable\nrecommendations to the ruler, such as “issue confusing\nedicts” or “say the opposite of what you mean”\n(Han Feizi 30.0.0, “Inner Congeries of Explanations,\nPart I: The Seven Techniques”). The friction between the\nfairness and transparency of fa and the trickery and secrecy\nof shu is most visible here. Song Hongbing (forthcoming A)\nsuggests that it reflects Han Fei’s realization of the dirty\nnature of political struggles in which fair and transparent norms of\nfa are not applicable. Indeed, if we accept Han Fei’s\ngloomy expectation that almost every political actor is driven purely\nby selfish interests, then the politics becomes a perennial war of\nsurvival. This said, sometimes the thinker qualifies his own cynicism\nand indicates that through proper utilization of the means of his\ndisposal the ruler can maintain his rule without going to extremes.\nThus, having compared the ministers to the ruler-devouring tigers, Han\nFei explains: “when the application of laws and the punishments\nis reliable, the tigers will be transformed into humans, reverting to\ntheir true state” (Han Feizi 8.7; “Extolling\nauthority”).\n\nIn the final account, ministers are human beings, and they can serve\nthe ruler well. All that is needed is to remember that the\nruler-minister relations are based not on devotion and loyalty but on\npure calculation of benefit. Insofar as the ruler relies on techniques\nof rule and utilizes the advantages of his positional power (section\n5.1 below), in particular his control over rewards and punishments,\nthe ministers will serve him faithfully. They will do it not because\nthey are morally committed to the sovereign or the polity, but due to\na simple calculation of personal benefits. This is yet another\nmanifestation of the advantage of the rule by impartial standards.\n5. The Ruler\n\nThe fa thinkers in general and Han Fei in particular are\noften condemned as defenders of “monarchic despotism” and\n“absolute authoritarianism” (Hsiao 1979: 386, 417).\nWhereas this verdict is not unanimous—Angus C. Graham, for\ninstance, opined that Han Fei’s system makes sense only\n“if seen from the viewpoint of the bureaucrat rather than the\nman at the top” (Graham 1989: 290–292)—it is fairly\nwidespread. In light of the fa thinkers’ profound\nanti-ministerial stance, it is indeed easy to conclude that they were\nfully committed to the ruler alone. And yet, their endorsement of the\nruler is not devoid of deep underlying tension. The fa\nthinkers are devoted to the ruler as an institution, the sole\nguarantor of social and political order, but not necessarily to an\nindividual sovereign, whose weaknesses they realize well. In Han\nFeizi in particular, this tension between an abstract and a\nconcrete ruler attains truly tragic proportions.\n5.1 The Ruler’s Superiority\n\nThe principle of monarchism, namely the conviction that peace and\nstability are attainable only under a singular omnipotent sovereign,\ncan be considered the unifying thread of the Warring States-period\npolitical thought (Liu Zehua 2013–14; Pines 2009: 25–107).\nThinkers of various ideological affiliations proposed ethical, ritual,\nand cosmological stipulations to monarchic rule. To these debates, the\nfa thinkers added primarily sociopolitical and administrative\ndimensions. In their eyes, the exclusive power of the monarch was the\nonly way to ensure proper functioning of society and the state. Shen\nDao clarifies:\n\n\nIn antiquity, the Son of Heaven was established and esteemed not in\norder to benefit the single person. It is said: When All under Heaven\nlacks the single esteemed [person], then there is no way to carry out\nthe principles [of orderly rule, li 理]. ... Hence the\nSon of Heaven is established for the sake of All under Heaven, it is\nnot that All under Heaven is established for the sake of the Son of\nHeaven. ... Even if the law is bad, it is better than absence of laws;\ntherewith the hearts of the people are unified. (Harris 2016: 110)\n\n\nShen Dao views the ruler as crucial for the proper functioning of the\npolitical system; he is the real foundation of political order, not a\nbeneficiary but rather a servant of humankind. He attains these\nblessed results by the sheer fact of his existence and not due to\npersonal morality or intelligence. According to Shen Dao, bad laws are\nbetter than a lawless situation, and we may infer that a bad ruler is\nbetter than anarchy.\n\nThe importance of the ruler in fa thought derives primarily\nfrom the mere singularity of his position. By being the ultimate locus\nof authority, the ruler imposes unity of action upon his officials.\nShen Dao explains: “Doubts bring commotion; doubleness [of the\nsources of authority] brings contention, intermingling brings mutual\ninjury; harm is from sharing, not from singularity” (Harris\n2016: 118). This is the rationale for concentrating all imaginable\npower in the sovereign’s hands.\n\nAside from providing necessary unity to the political apparatus, the\nruler contributed to the fa project in additional ways. As\nthe story narrated in the first chapter, “Revising the\nlaws,” of the Book of Lord Shang clarifies, it was only\nthrough the ruler’s endorsement that radical reforms could be\nlaunched against the entrenched opposition of conservative courtiers.\nBesides, the ruler, ex officio, represented the common interests of\nhis subjects (gong 公, recall that the same term\ndesignates a territorial lord). He embodied impartiality; without him,\nconflicting selfish interests will tear the polity apart.\n\nThis backdrop explains the fa thinkers’ unwavering\ncommitment to safeguarding the ruler’s authority. Their most\nsignificant theoretical innovation with this regard is the concept of\npositional power (shi 勢), which is frequently\nassociated with Shen Dao, but which matures in Han Feizi\n(Pines 2020a). The ruler’s authority does not derive from his\npersonal qualities. What matters is the power of his position, which\nallows him to command obedience of his subjects. It is essential\ntherefore that the ruler firmly preserves the right of the final\ndecision in his hands and never relegates it to the underlings. Shen\nBuhai explains: “He who is a singular decision-maker can become\nthe sovereign of All under Heaven” (Creel 1974: 380, translation\nmodified). Han Fei warns repeatedly that relegation of one of two\nmajor levers of rule—rewards and punishments—to the\nministers will open the way to ministerial usurpation. And the chapter\n“Relying on law” of Guanzi further\nelaborates:\n\n\nHence there are six things that the clear-sighted monarch maintains:\nto give life, to kill, to enrich, to impoverish, to ennoble, to\ndepreciate. These are the six levers that the ruler maintains.\n(Guanzi 45; cf. Rickett 1998: 148)\n\n\nThis devotedness to the ruler’s power, coupled with the strongly\npronounced anti-ministerial stance, distinguishes the fa\nthinkers from their rivals. Sometimes, this devotedness appears truly\nextreme, as in the above chapter of Guanzi which urges the\nruler to punish by death any unauthorized action of a minister, even\nif its results were successful, while pardoning failures in cases\nwhere the minister strictly obeyed the ruler’s command\n(Guanzi 45; Rickett 1998: 150). Such recommendations create\nan impression of the fa tradition as supportive of\nauthoritarian, even despotic rule. But one should understand the\nunderlying logic. Think of an army, where preservation of the chain of\ncommand and of the singular authority of every commander over his unit\nis far more important than ensuring the best possible commander at the\ntop. A subordinate officer may very well surpass his commander\nintellectually, but for the sake of military discipline, which is\nvital for preserving the army as such, it is important that he obey\ncommands. In a Warring State, where the difference between civilian\nand military realms was blurred, the need for unified decision-making\nwas unanimously accepted (for applying the military simile to the\npolitical realm, see, e.g., Lüshi chunqiu 17.8\n[“Zhi yi” 執一]). The fa thinkers\nwere not exceptional with this regard, but simply more straightforward\nin advocating the absoluteness of the ruler’s power.\n5.2 Entrapped Sovereign?\n\nThe fa thinkers’ image as staunch endorses of autocracy\nbecomes qualified once we note their unflattering view of real-life\nrulers. The Book of Lord Shang and Han Feizi\nrepeatedly refer to “contemporary sovereigns”\n(shizhu 世主) as epitome of shortsightedness and\nmediocrity. This is not accidental. The fa\nthinkers—much like their intellectual rivals—realized that\nthe system of hereditary succession could not normally produce\nbrilliant leaders. Accordingly, their expectations of the rulers were\nlow. Take for instance many dozens of historical anecdotes scattered\nthroughout Han Feizi, which repeatedly tell not just about\nimprudent rulers who were duped by unscrupulous underlings, but also\nabout those who dismissed good advice of their aides and brought about\ndisaster on themselves and their states. These anecdotes problematize,\nif not outright subvert the text’s habitual sidelining with the\nruler against his ministers. Han Fei is “obliged to integrate\nthe unavoidable fact of absolute submission to an individual who is\nmore often than not totally unqualified for the exercise of supreme\ncommand” (Graziani 2015: 162).\n\nHow to resolve this quagmire? The fa thinkers hesitate.\nSometimes they speak of an ideal of a “sage”\n(sheng 聖) or “clear-sighted”\n(ming 明, often translated as\n“enlightened”) sovereign. In a few of Han Feizi\nchapters, the thinker apparently recommends to subject the ruler to\n“rigorous intellectual self-cultivation” (Lewis,\nforthcoming). Overall, however, the idea of personal self-cultivation\nas a solution to political problems remains alien to fa\ntexts. An alternative, better attuned to fa ideology, is to\nrely on perfectly designed political institutions that would\naccommodate mediocrities on the throne. This point is explicit in\nchapter 40, “Objections to position power,” of Han\nFeizi. Han Fei explains that the system he designs should cater\nto the need of average or mediocre (zhong 中) rulers,\nneither moral paragons, nor monstrous tyrants. This system will attain\ngood results precisely because it does not expect of the ruler any\nextraordinary qualities (Pines 2020a). Guanzi further\nclarifies:\n\n\nThe sage ruler relies on laws, not on personal wisdom; on methods and\nnot on persuasions; on impartiality and not on selfishness; on the\ngreat Way and not on trivial matters. Then, he may be at ease and\nAll-under-Heaven will be governed well. (Guanzi 45,\n“Relying on law”; cf. Ricket 1998: 144)\n\n\nThe text ostensibly speaks of a sage ruler, but the sagacity of this\nruler is manifested in following impartial norms and discarding his\nown abilities, as well as the persuaders’ talks. Time and again,\nthe ruler is warned that he should never allow his personal whims,\nfavoritism, likes and dislikes to influence decision making. Instead\nhe should inviolably follow laws, methods (shu 數),\ntechniques of rule, and other impartial norms. His personality should\nhave no impact at all on the state’s functioning. This is the\nbottom line of “being at ease”: the ruler simply should\navoid intervention in quotidian government affairs.\n\nThe latter point elucidates a major but less frequently noted aspect\nof the fa views of rulership. The same texts that insist that\nthe ruler should preserve firmly the right to issue final decisions,\nto supervise his officials’ performance, to reward and\npunish—are equally adamant that he should never interfere in\neveryday political matters. This depersonalization of the sovereign\npeaks in Han Feizi. Time and again the text insists that the\nruler should eschew any expression of personal emotions, cast away\npersonal desires, avoid manifestations of favoritism, and not trust\nhis personal abilities. The thinker summarizes:\n\n\nThe way of a clear-sighted ruler: Let the wise completely exhaust\ntheir contemplations and rely on them to decide on matters—then\nthe ruler is not depleted of wisdom. Let the worthy utilize their\ntalents and rely on them and assign task accordingly—then the\nruler is not depleted of abilities. When there is success, the ruler\npossesses a worthy [name]; when there is failure, the minister bears\nthe responsibility. Thus the ruler is not depleted of a [good] name.\nHence, being unworthy, he is the master of the worthies; being unwise,\nhe is the corrector of the wise. The minister works, while the ruler\npossesses the achievements: this is called the foundations of the\nworthy sovereign. (Han Feizi 5.1, “The way of the\nsovereign”)\n\n\nThis passage is somewhat ironic. Whereas the ruler is referred to as\n“clear-sighted,” he is also presumed to be potentially\nunworthy and unwise. By dispensing with any manifestation of personal\ninclinations and abilities, the ruler benefits twice. First (as\ndiscussed in an earlier part of the cited passage), he avoids the\ntraps of scheming ministers; and second, he is able to manipulate them\nand achieve undeserved glory and fame. The latter promise—an\nunabashed appeal to the ruler’s selfishness—should lure\nhim into adopting Han Fei’s recommendations. Hinting at the\npossibility that the sovereign, albeit unworthy and unwise, will\nbecome the teacher and corrector of his worthy subjects, Han Fei again\ndiscloses his ultimately low expectations of the monarch’s\nmorality and wisdom. This qualifies the text’s constant\ninvocations of a “clear-sighted sovereign.”\n\nThe bottom line is puzzling. The ruler is supposed to be clever enough\nto make fateful decisions and monitor his scheming officials; but\nsimultaneously he is constantly dissuaded from trusting his own\nabilities and intervening in political processes. Graham provocatively\nconcludes that the ruler in Han Fei’s system “has no\nfunctions which could not be performed by an elementary computer.\n… Might one even say than in Han Fei’s system it is\nministers who do the ruling?” (Graham 1989: 291). Indeed, there\nare a few chapters in which Han Fei seems to put his hopes on worthy\nministers (Pines 2013b), but these chapters are contradicted by\nothers, which define the ministers as the ruler’s worst foes.\nThe ruler remains alone in his woes.\n\nThis paradox of an entrapped sovereign, who enjoys God-like\nomnipotence, but who is required to refrain from any activism in order\nto preserve this omnipotence may reflect Han Fei’s understanding\nof the perennial weakness of the system in which a\nsingle—potentially inept—individual plays the superhuman\nrole. That this sober understanding came from a thinker dubbed\n“the most sophisticated theoretician of autocracy” (Wang\nand Chang 1986:12) deserves utmost attention.\n6. Assault on Culture and Learning\n\nIn the twentieth century, not a few scholars dubbed the fa\nthinkers “totalitarians” (e.g., Creel 1953: 135–158;\nRubin 1976: 55–88; Fu Zhengyuan 1996; for the criticism of this\ndesignation, see Schiele, forthcoming). Some of the aspects of the\nfa program—a powerful state that overwhelms society,\nrigid control over the populace and the administrative apparatus,\nharsh laws, and the like—seem to lend support to this equation.\nYet when we move to the realm of thought control—a sine qua non\nfor a true totalitarian polity—the results are somewhat\nequivocal. Although Shang Yang and Han Fei have much to say on matters\nof culture and learning, their message is predominantly negative: they\neagerly expose the fallacies of their opponents’ views, but do\nnot necessarily provide an ideological alternative of their own.\n\nShang Yang is particularly notorious for his comprehensive assault on\ntraditional culture and on moral values. The Book of Lord\nShang abounds with controversial and highly provocative\nstatements like this one:\n\n\nPoems, Documents, rites, music, goodness,\nself-cultivation, benevolence, uprightness, argumentativeness,\ncleverness: when the state has these ten, superiors cannot induce [the\npeople] to [engage in] defense and fighting. If the state is ruled\naccording to these ten, then if the enemy arrives it will surely be\ndismembered, and if the enemy does not arrive, the state will surely\nbe impoverished. (Book of Lord Shang 3.5, “Agriculture\nand warfare”)\n\n\nThis and similar pronouncements, as well as the text’s derisive\nlanguage (it often dubs moral values as “parasites” or\n“lice” [shi 蝨]), explain why Shang Yang\ngained notoriety in the eyes of imperial literati, as well as many\nmodern scholars, as an enemy of morality. Yet this conclusion should\nbe qualified. The “alienating rhetoric,” an example of\nwhich is cited above, is concentrated only in a few chapters of the\nBook of Lord Shang; most other display more accommodative\nviews toward traditional moral values; some even promise that\n“the sage ruler” would be able to “implement\nbenevolence and righteousness in All under Heaven” (Book of\nLord Shang 13.6, “Making orders strict”; see also\nPines 2012). It seems that the text assaults not morality as such but\nrather moralizing discourse. It is this discourse—or more\nprecisely its bearers, the peripatetic “men of service”\nwho seek employment at the rulers’ courts—which arouse\nShang Yang’s indignation.\n\nShang Yang deplores traveling intellectuals because they damage the\nfoundations of his sociopolitical model. By gaining official positions\nand emoluments outside the carefully designed system of ranks of\nmerit, they dilute the system’s exclusivity. Shang Yang is less\nconcerned with the content of their doctrines; what matters to him is\nthat promotion of talkative intellectuals will cause the people engage\nin hollow talk and needless learning and “become remiss in\nagriculture and warfare” (Book of Lord Shang 3.5,\n“Agriculture and warfare”). Intellectuals, furthermore,\nare difficult to control, and their empty talks distract the ruler\nfrom commitment to war. Thus, learning is harmful both economically\nand politically.\n\nWhen the Book of Lord Shang speaks of “teaching”\nor “indoctrination” (jiao 教), it refers\nnot to imposition of a new set of values, but rather to the\ninternalization of the government’s regulations. Once the people\nunderstand how the system works, they will comply with the\ngovernment’s requirements without the need in coercion but\nrather because of pure self-interest. The text clarifies:\n\n\nWhat is called “unification of teaching” is that …\nfathers and elder brothers, minor brothers, acquaintances, relatives\nby marriage, and colleagues all say: “What we should be devoted\nto is just war and that is all.” … The people’s\ndesire for riches and nobility stops only when their coffin is sealed.\nAnd [entering] the gates of riches and nobility must be through\nmilitary [service]. Therefore, when they hear about war, the people\ncongratulate each other; whenever they move or rest, drink or eat,\nthey sing and chant only about war. (Book of Lord Shang 17.4,\n“Rewards and punishments”)\n\n\nTeaching the people to “sing and chant only about war”\ncould easily refer to military indoctrination, such as we encounter in\nother countries that employed mass armies. Yet the Book of Lord\nShang never resorts to adoration of martial spirit,\ndehumanization of the enemy, identifying martiality with masculinity,\nand similar devices employed in militaristic education elsewhere.\nRather, for Shang Yang and other contributors to “his”\nbook, “teaching” means simply the people’s\ninternalization of the fact that the only way to satisfy their desires\nfor riches and glory is to excel in war. “Teaching” is not\nabout brainwashing; it is just about self-interested compliance with\nthe government’s policies.\n\nHan Fei’s views of traditional culture and of learning echo\nShang Yang’s, but he is even more vehement in his dislike of\ntraveling scholars who rise up the sociopolitical ladder by selling\ntheir ideas to the rulers and to high ministers. Han Fei particularly\ndetests the moralizers—followers of Confucius and Mozi—who\nmislead the rulers with their arguments. He mercilessly exposes the\nmanipulativeness of their discourse, their self-serving definitions of\n“worth” and “intelligence,” their resort to\nhistorical examples which could be covertly subversive of political\npower. Yet the solution is not to devise an alternative discourse but\nrather to subjugate intellectual activity to the state’s\ninterests:\n\n\nNow, when the ruler listens to [a certain] teaching, if he approves of\nits doctrine, he should promulgate it among the officials and employ\nits adherents; if he disapproves of its doctrine, he should dismiss\nits adherents and cut it off. (Han Feizi 50.4,\n“Illustrious teachings”)\n\n\nHan Fei does not deny in principle that some of the rival doctrines\nmay benefit the state; he just denies their proponents the right to\ndevelop and elaborate their views independently of the state. He\nleaves his rivals no illusions: the intellectuals can pursue their\nideas only within the state-ordained system of power, otherwise their\ndoctrines will be “cut off.” The text concludes:\n\n\nThus, in the state of a clear-sighted spvereign there are no texts\nwritten on bamboo strips, but the law is the teaching; there are no\n“discourses” of the former kings, but officials are the\nteachers; there is no private wielding of swords, but beheading\n[enemies] is valor. (Han Feizi 49.13, “Five\nvermin”)\n\n\nHan Fei’s suggestion to eliminate the “texts written on\nbamboo strips” and turn officials into teachers was implemented\nby his fellow student and nemesis, Li Si, soon after the imperial\nunification of 221 BCE. In 213 BCE, after heated court debates, Li Si\nlaunched a comprehensive assault on “private learning,”\nwhich he identified as intellectually divisive and politically\nsubversive. He then suggested eliminating copies of the canonical\nbooks of Poems and Documents, as well as\nDiscourses of the Hundred Schools (for which see Petersen\n1995) from private collections, leaving copies only in the possession\nof the court erudites (boshi 博士). Li Si\nconcluded his proposal by echoing Han Fei’s views: “And\nthose who want to study laws and ordinances, let them take an official\nas a teacher!” (Shiji 87: 2546; Watson 1993: 185).\n\nLi Si’s assault on private learning is often misinterpreted as\nthe victory of “Legalist” over “Confucian”\nideology, but this is wrong. Confucianism as such was not targeted;\nactually, it prospered among the court erudites (Kern 2000:\n188–191). What mattered to Li Si—as to Han Fei—was\nnot doctrinal unity as such, but the imposition of the state control\nover intellectual life, like over other spheres of social activity.\nIntellectuals were not persecuted because of the content of their\nideas; but they were required either to enter government service or\nquit their pursuits. Yet Li Si’s biblioclasm backfired. It\ncaused not only considerable resentment in the short term, but, more\nominously, brought about immense dislike of Qin—and of the\nfa tradition in general—among the overwhelming majority\nof the literati throughout the imperial period and beyond.\n7. Epilogue: The fa Tradition in Chinese History and in Modern Research\n\nThe fa tradition experienced odd destiny in imperial China.\nOn the one hand, many of its tenets—e.g., the usage of objective\nand quantifiable standards in assessing the officials’\nperformance—were duly utilized by the empire’s leaders\n(cf. Korolkov forthcoming and Creel 1974: 233–293). On the other\nhand, some of the fa thinkers’ basic recommendations\nproved untenable for the unified empire. For instance, the\ndiscontinuation of universal military service in the Han dynasty\n(Lewis 2000) caused gradual atrophy of the system of ranks of merit\nadvocated by Shang Yang, turning the crux of his social engineering\nprogram irrelevant to the imperial-era statesmen (Pines 2016b:\n29–31). Even more consequentially, the emergence of powerful\nlocal elites early in the Han dynasty eroded another pillar of\nfa thought, viz. the insistence on the state as the sole\nprovider of material and social benefits. As the political and\nintellectual power of these elites increased, more and more ideas of\nthe fa thinkers were sidelined. Such prominent tenets of\nfa thought as evolutionary view of history, the dismissive\nattitude toward self-cultivation, the derision of moralizing\ndiscourse, the denigration of independent intellectuals and the like,\nhad largely disappeared from the imperial-era political texts.\n\nWhen the Imperial Counsellor Sang Hongyang 桑弘羊\n(152–80 BCE) defended Shang Yang, Shen Buhai, and Han Fei during\nthe Salt and Iron Debates of 81 BCE, this was the last major occasion\nin imperial China’s history that a leading statesman had openly\nidentified himself with these thinkers and proudly positioned himself\nas their heir (Yantielun, chapters 7 and 56; see also\nPolnarov 2018). Thenceforth, manifold supporters of “a rich\nstate and a strong army” policy would usually distance\nthemselves from Shang Yang or Han Fei, even if admiring their deeds.\nThe image of the fa thinkers was too tarnished to merit open\nidentification. These thinkers, were viewed, following Sima Tan, as\n“strict and having little kindness” (Shiji 130:\n3289), as advocates of cruel laws and merciless punishments, as\nproponents of the policies that were diametrically opposite to the\ncherished “educational transformation” (jiaohua\n教化). One of the imperial China’s most brilliant\nintellectuals, Su Shi 蘇軾 (appellative Dongpo\n東坡, 1036–1101) remarked, derisively: “from\nthe Han onward, scholars have been ashamed to speak about Shang Yang\nand Sang Hongyang” (Dongpo quanji 105:14).This verdict\ngrasps well the dominant attitude toward the fa tradition in\nimperial China. It was only on the eve of the collapse of the Qing\ndynasty and of the imperial order itself, when, amid massive\nreevaluation of the past, scholars starting paying attention to this\nlong-sidelined tradition (Song, forthcoming B).\n\nSince the beginning of the twentieth century, we witness a robust\ninterest in the fa texts, which attracted scholars because\ntheir ideas resonated with aspects of modern Western thought, be it\nthe evolutionary view of history or the idea of fazhi, viewed\nby many as compatible withthe Western “rule of law.” Yet\nthe twentieth-century rediscovery remained somewhat abortive due to\nthe lingering political dislike of the authoritarian aspects of the\nfa tradition, as well as due to mere scholarly inertia. Even\nthe odd outburst of adoration of fa ideology during the\nMaoist campaign “Reappraise the fa thinkers, criticize\nConfucians” 評法批儒 (1973–1975 )\ndid not result in major breakthroughs (Li Yu-ning 1977; Chen 2019).\nOnce the campaign ended, the interest in the fa tradition in\nmainland China receded anew, whereas elsewhere the bizarre endorsement\nof fa thinkers by Maoist radicals had actually discouraged\nin-depth engagement with their texts (Pines, forthcoming C).\n\nThis legacy of lackluster interest in fa thought is most\nreadily recognizable in studies of “Chinese philosophy” in\nthe West. Even a brief survey of major Western introductory-level\nstudies of Chinese philosophy through the twentieth century and into\nthe first decade of the twenty-first suffices to demonstrate the\nongoing sidelining of the fa tradition. In these studies, the\nfa texts usually merit just between five to ten percent of\ntotal space dedicated to China’s preimperial thinkers. Besides,\nuntil the second decade of the twenty-first century, the fa\nthinkers merited little if any attention in major Anglophone scholarly\njournals that deal with Chinese philosophy, such as Dao,\nThe Journal of Chinese Philosophy, and Philosophy East\nand West.\n\nSince the second decade of the twenty-first century one can note a\nclear change. This decade witnessed a translation cum study of the\nShenzi Fragments (Harris 2016); two translations cum study of\nthe Book of Lord Shang (Vogelsang 2017; Pines 2017);\npublication of the Dao Companion to the Philosophy of Han Fei\n(Goldin 2013); and publication of more relevant articles than during\nthe previous half a century. This trend seems to accelerate further\n(see, e.g. Jiang 2021; Pines, forthcoming A). The increasing interest\nin the fa tradition is paralleled in China, where the topic\nhad been largely de-politicized (as for 2022), and where a scholarly\nsociety for studies of fajia was formed in 2015. Overall,\nthese new developments are conducive for in-depth engagement with the\nfa tradition.\n",
    "bibliography": {
        "categories": [
            "Primary Literature",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>The Book of Lord Shang</em>. See Pines 2017.",
                "Chen Qiyou 陳奇猷, 2000, <em>Han Feizi xin\njiaozhu</em> 韓非子新校注.\nShanghai: Shanghai guji chubanshe.",
                "<em>Dongpo quanji</em> 東坡全集. By Su Shi\n蘇軾. E-<em>Siku quanshu</em> edition.",
                "Duyvendak, Jan J.-L., trans. [1928] 1963. <em>The Book of Lord\nShang: A Classic of the Chinese School of Law</em>. Reprint. Chicago:\nUniversity of Chicago Press.",
                "<em>Guanzi jiaozhu</em> 管子校注, Li\nXiangfeng 黎翔鳯 (ed.), Beijing: Zhonghua shuju,\n2004.",
                "<em>Han Feizi</em>. See Harbsmeier, forthcoming.",
                "<em>Han shu</em> 漢書, by Ban Gu 班固 et\nal., Beijing: Zhonghua shuju, 1997.",
                "Harbsmeier, Christoph (trans.), forthcoming, <em>Han Feizi</em>,\ned. J. Ø. Petersen and Y. Pines, Leiden: Brill.",
                "Harris, Eirik Lang, 2016. <em>The Shenzi Fragments: A\nPhilosophical Analysis and Translation</em>. New York: Columbia\nUniversity Press.",
                "<em>The Huainanzi: A Guide to the Theory and Practice of\nGovernment in Early China</em>, John S. Major, Sarah A. Queen, Andrew\nS. Meyer and Harold D. Roth (trans. and eds.), New York: Columbia\nUniversity Press, 2010.",
                "Liao, W.K., trans., 1939–1959, <em>The Complete Works of Han\nFei tzu: A Classic of Legalism</em>. London: Probsthain.",
                "<em>Lüshi chunqiu jiaoshi</em>\n呂氏春秋校釋, Chen Qiyou\n陳奇猷 (ed.), Shanghai: Xuelin, 1995.",
                "Pines, Yuri, trans. and ed., 2017, <em>The Book of Lord\nShang:</em> <em>Apologetics of State Power in Early China</em>. New\nYork: Columbia University Press.",
                "Rickett, W. Allyn, (ed. and trans.), 1985. <em>Guanzi. Political,\nEconomic, and Philosophical Essays from Early China.</em> Vol. 1.\nPrinceton: Princeton University Press.",
                "Rickett, W. Allyn, (ed. and trans.), 1998. <em>Guanzi: Political,\nEconomic, and Philosophical Essays from Early China</em>. Vol. 2.\nPrinceton: Princeton University Press.",
                "<em>Shiji</em> 史記, by Sima Qian\n司馬遷 et al., Beijing: Zhonghua shuju, 1997.",
                "Vogelsang, Kai, trans., 2017, <em>Shangjun shu: Schriften des\nFürsten von Shang</em>. Stuttgart: Alfred Kröner.",
                "Watson, Burton, trans., 1993, <em>Records of the Grand\nHistorian</em>. Vol. 3: <em>Qin Dynasty</em>. Hong Kong: Chinese\nUniversity of Hong Kong Press.",
                "Watson, Burton, trans., 2003, <em>Han Feizi: Basic Writings</em>,\nNew York: Columbia University Press.",
                "Xu Fuhong 許富宏 (ed.), 2013, <em>Shenzi jijiao\njizhu</em> 慎子集校集注, Beijing:\nZhonghua shuju.",
                "<em>Yantielun jiaozhu</em>\n鹽鐵論校注. 1996. Compiled by Huan Kuan\n桓寬 (first century BCE). Annotated by Wang Liqi\n王利器. Beijing: Zhonghua shuju.",
                "Zhang Jue 張覺, ed., 2012. <em>Shang jun shu\njiaoshu</em> 商君書校疏. Beijing: Zhishi\nchanquan chubanshe.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Ames, Roger, 1994, <em>The Art of Rulership: A Study of Ancient\nChinese Political Thought</em>. Albany: State University of New York\nPress.",
                "Bell, Daniel, 2015, <em>The China Model: Political Meritocracy and\nthe Limits of Democracy</em>. Princeton: Princeton University\nPress.",
                "Bodde, Derk, 1938, <em>China’s First Unifier: A Study of the\nCh’in Dynasty as Seen in the Life of Li Ssu</em>\n李斯<em>280–208 B.C.</em>, Leiden: Brill.",
                "Chen Chuang 陳闖, 2019, “‘Ping fa pi\nRu’ yundong shiqi de gudian xueshu yanjiu”\n“評法批儒”運動時期的古典學術研究.\nPhD. Dissertation, Shandong University.",
                "Creel, Herrlee G., 1953, <em>Chinese Thought from Confucius to Mao\nTse-tung</em>, Chicago: University of Chicago Press.",
                "–––, 1974, <em>Shen Pu-hai: A Chinese Political\nPhilosopher of the Fourth Century B.C.</em>, Chicago and London:\nUniversity of Chicago Press.",
                "Csikszentmihalyi Mark and Nylan, Michael, 2003,\n“Constructing Lineages and Inventing Traditions through\nExemplary Figures in Early China.” <em>T’oung Pao</em>,\n89.1–3: 59–99.",
                "Fu Zhengyuan, 1996, <em>China’s Legalists: The Earliest\nTotalitarians and their Art of Ruling</em>, Armonk and London: M.E.\nSharpe.",
                "Goldin, Paul R., 2005, “Persistent Misconceptions about\nChinese ‘Legalism,’” <em>Journal of Chinese\nPhilosophy</em> 38 (1): 64–80.",
                "–––, ed., 2013: <em>Dao Companion to the\nPhilosophy of Han Fei</em>. Dordrecht: Springer.",
                "–––, 2020, <em>The Art of Chinese Philosophy:\nEight Classical Texts and How to Read Them</em>. Princeton NJ:\nPrinceton University Press.",
                "Graham, A. C., 1989. <em>Disputers of the Tao: Philosophical\nArgument in Ancient China</em>. La Salle, IL: Open Court.",
                "Graziani, Romain, 2015, “Monarch and Minister: Reflections\non an impossible partnership in the building of absolute monarchy in\nthe Han Feizi 韩非子,” in <em>Ideology of\nPower and Power of Ideology in Early China</em>, Y. Pines, P. R.\nGoldin and M. Kern (eds.). Leiden: Brill.",
                "–––, forthcoming. “The Ruler’s New\nTools: <em>Fa</em> 法 and the Political Paradigm of Measure in\nEarly China,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Harris, Eirik L., forthcoming, “Human Motivation in the\n<em>fa</em> Tradition: Visions from the <em>Shenzi</em> Fragments,\n<em>Shangjunshu</em>, and <em>Han Feizi</em>,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.",
                "Hsiao, Kung-chuan, 1979, <em>A History of Chinese Political\nThought</em>. Vol. I: <em>From the Beginnings to the Sixth Century\nA.D.</em> F.W. Mote (trans.). Princeton Library of Asian Translations.\nPrinceton: Princeton University Press.",
                "Indraccolo, Lisa, forthcoming. “Philosophy of language in\nthe <em>fa</em> tradition,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Jiang, Tao, 2021, <em>Origins of Moral-Political Philosophy in\nEarly China: Contestation of Humanness, Justice, and Personal\nFreedom</em>. Oxford: Oxford University Press.",
                "Kern, Martin, 2000, <em>The Stele Inscriptions of Ch’in\nShih-huang: Text and Ritual in Early Chinese Imperial\nRepresentation</em>. New Haven: American Oriental Society.",
                "Korolkov, Maxim, “Rule by impersonal standards in the early\nempire: ideas and realities,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Lau, Ulrich and Michael Lüdke, forthcoming,\n“<em>Fa</em> and the early legal system,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.",
                "Lewis, Mark E., 1999, “Warring States: Political\nHistory,” in <em>The Cambridge History of Ancient China: From\nthe Origins of Civilization to 221 B.C.</em>, Michael Loewe and Edward\nL. Shaughnessy (eds.), Cambridge: Cambridge University Press,\n587–650.",
                "–––, 2000, “The Han Abolition of Universal\nMilitary Service,” in <em>Warfare in Chinese History</em>, H.\nVan de Ven (ed.), Leiden: Brill, 33–76.",
                "–––, 2021, <em>Honor and Shame in Early\nChina</em>. Cambridge: Cambridge University Press.",
                "–––, forthcoming. “The ruler in\n<em>fa-</em>based government,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Li Yu-ning, (ed.), 1977, <em>Shang Yang’s Reforms and State\nControl in China</em>. White Plains, NY: Sharpe.",
                "Liang Qichao 梁啟超. 1906 [2003]. “Zhongguo\nfalixue fada shi lun”\n中國法理學發達史論.\nRpt. in Liang Qichao, <em>Yinbingshi wenji dianjiao</em>\n飲冰室文集點校, Wu Song\n吳松, Lu Yunkun 盧雲崐, Wang Wenguang\n王文光, and Duan Bingchang 段炳昌\n(eds.), Kunming: Yunnan jiaoyu chubanshe, Vol. 1, 340–375.",
                "Liu Zehua 劉澤華, 2003, <em>Xi er zhai\nwengao</em> 洗耳齋文稿, Beijing:\nZhonghua shuju.",
                "–––, 2013–14, “Monarchism: The\nHistorical Orientation of China’s Intellectual Culture,”\nY. Pines (trans.), <em>Contemporary Chinese Thought</em> 45.2–3\n(2013–2014): 21–31.",
                "McLeod, Alexus, forthcoming, “The <em>fa</em> Tradition and\nMorality,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Morgenthau, Hans Joachim, 1978, <em>Politics among Nations: The\nStruggle for Power and Peace</em>, New York: Knopf.",
                "Petersen, Jens Østergård, 1995, “Which Books\nDid the First Emperor of Ch’in Burn? On the Meaning of <em>Pai\nChia</em> in Early Chinese Sources,” <em>Monumenta Serica</em>\n43: 1–52.",
                "Pines, Yuri, 2000, “‘The One That Pervades the\nAll’ in Ancient Chinese Political thought: The Origins of\n‘The Great Unity’ Paradigm,” <em>T’oung\nPao</em> 86 (4–5): 280–324.",
                "–––, 2009, <em>Envisioning Eternal Empire:\nChinese Political Thought of the Warring States Era.</em> Honolulu:\nUniversity of Hawai‘i Press.",
                "–––, 2012, “Alienating rhetoric in the\n<em>Book of Lord Shang</em> and its moderation,”\n<em>Extrême-Occident</em>, 34: 79–110.",
                "–––, 2013a, “From Historical Evolution to\nthe End of History: Past, Present and Future from Shang Yang to the\nFirst Emperor,” in <em>Dao Companion to the Philosophy of Han\nFei</em>, Paul R. Goldin (ed.), Dordrecht: Springer, 25–46.",
                "–––, 2013b, “Submerged by Absolute Power:\nThe Ruler’s Predicament in the <em>Han Feizi</em>,” in\n<em>Dao Companion to the Philosophy of Han Fei</em>, Paul R. Goldin\n(ed.), Dordrecht: Springer, 67–86.",
                "–––, 2013c, “Between Merit and Pedigree:\nEvolution of the Concept of ‘Elevating the Worthy’ in\npre-imperial China,” in: <em>The Idea of Political Meritocracy:\nConfucian Politics in Contemporary Context</em>, Daniel Bell and Li\nChenyang (eds.), Cambridge: Cambridge University Press,\n161–202.",
                "–––, 2016a, “Dating a Pre-imperial Text:\nThe Case Study of the <em>Book of Lord Shang</em>.” <em>Early\nChina</em> 39:145–184.",
                "–––, 2016b, “Social Engineering in Early\nChina: The Ideology of the <em>Shangjunshu</em> (Book of Lord Shang)\nRevisited.” <em>Oriens Extremus</em> 55: 1–37.",
                "–––, 2016c, “A ‘Total War’?\nRethinking Military Ideology in the <em>Book of Lord\nShang</em>,” <em>Journal of Chinese Military History</em> 5.2:\n97–134.",
                "–––, 2020a, “Worth vs. Power: Han\nFei’s ‘Objection to Positional Power’\nRevisited.” <em>Asiatische Studien/Études Asiatiques</em>\n74.3: 687–710.",
                "–––, 2020b, “‘To die for the\nSanctity of the Name’: Name (<em>ming</em> 名) as\nprime-mover of political action in early China.” In:\n<em>Keywords in Chinese Culture</em>, W-y. Li and Y. Pines (eds.),\nHong Kong: The Chinese University Press, 169–218.",
                "–––, 2021, “Agriculturalism and Beyond:\nEconomic Thought of the <em>Book of Lord Shang</em>,” in\n<em>Between Command and Market: Economic Thought and Practice in Early\nChina</em>, Elisa Sabattini and Christian Schwermann (eds.), Leiden:\nBrill, 76–111.",
                "–––, ed., forthcoming A, <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Dordrecht: Springer.",
                "–––, forthcoming B, “<em>Han Feizi</em>:\nThe World Driven by Self-Interest,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "–––, forthcoming C, “The <em>fa</em>\nTradition and Its Modern Fate: The Case of the <em>Book of Lord\nShang</em>,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Polnarov, Anatoly, 2018, “Looking Beyond Dichotomies: Hidden\nDiversity of Voices in the <em>Yantielun</em>\n鹽鐵論.” <em>T’oung Pao</em> 104:\n465–495.",
                "Queen, Sarah. 2013. “<em>Han Feizi</em> and the Old Master:\nA Comparative Analysis and Translation of <em>Han Feizi</em> Chapter\n20, ‘Jie Lao’ and Chapter 21, ‘Yu Lao,’”\nin <em>Dao Companion to the Philosophy of Han Fei</em>, Paul R. Goldin\n(ed.), Dordrecht: Springer, 197–256.",
                "Rubin, Vitaly, 1976, <em>Individual and State in Ancient\nChina</em>, New York : Columbia University Press.",
                "Sato, Masayuki, 2013a, “Did Xunzi’s Theory of Human\nNature Provide the Foundation for the Political Thought of Han\nFei?” in <em>Dao Companion to the Philosophy of Han Fei</em>,\nPaul R. Goldin (ed.), Dordrecht: Springer, 147–165.",
                "–––, 2013b, “Studies of <em>Han Feizi</em>\nin China, Taiwan, and Japan” in <em>Dao Companion to the\nPhilosophy of Han Fei</em>, Paul R. Goldin (ed.), Dordrecht: Springer,\n257–281.",
                "–––, forthcoming, “The Concept of\n<em>fa</em> in <em>Guanzi</em> and its Evolution,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.",
                "Schiele, Alexandre, forthcoming, “The <em>Book of Lord\nShang</em> and Totalitarianism’s Intellectual Precursors\nCompared,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Schwartz, Benjamin I., 1985, <em>The World of Thought in Ancient\nChina</em>, Cambridge, MA : Harvard University Press.",
                "Schwermann, Christian, forthcoming. “The Ideology of Chao\nCuo,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Smith, Kidder, 2003, “Sima Tan and the Invention of Daoism,\n‘Legalism,’ et cetera.” <em>Journal of Asian\nStudies</em> 62 (1): 129–156.",
                "Song Hongbing, forthcoming A, “Two Perspectives on the\n<em>Fa</em> Tradition: Politics versus the Rule of Impartial\nStandards,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Song Hongbing, forthcoming B, “The Historical Reputation of\nthe <em>fa</em> Tradition in Imperial China,”in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.",
                "Thompson, P. M., 1979, <em>The Shen-tzu Fragments</em>, Oxford:\nOxford University Press.",
                "Van Norden, Bryan W. 2011. <em>Introduction to Classical Chinese\nPhilosophy</em> (Indianapolis and Cambridge: Hackett.",
                "Vogelsang, Kai. 2016. “Getting the Terms Right: Political\nRealism, Politics, and the State in Ancient China.” <em>Oriens\nExtremus</em> 55: 39–72.",
                "–––, forthcoming, “The Historiography of\nPolitical Realism,” in <em>Dao Companion to China’s</em>\nfa <em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.",
                "Waley, Arthur, 1939, <em>Three Ways of Thought in Ancient\nChina</em>. London: George Allen &amp; Unwin.",
                "Wagner, Donald B., 1993, <em>Iron and Steel in Ancient China</em>.\nLeiden: Brill.",
                "Wang, Hsiao-po and Leo S. Chang, 1986, <em>The Philosophical\nFoundations of Han Fei’s Political Theory</em>, Honolulu:\nUniversity of Hawai’i Press, 1986.",
                "Xi Jinping. 2018. <em>The Governance of China</em>. Volume 1.\nBeijing: Foreign Languages Press, 2<sup>nd</sup> ed.",
                "Zheng Liangshu 鄭良樹, 1989, <em>Shang Yang ji\nqi xuepai</em> 商鞅及其學派,\nShanghai: Guji chubanshe.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLite\">Primary Literature</h3>\n<ul class=\"hanging\">\n<li><em>The Book of Lord Shang</em>. See Pines 2017.</li>\n<li>Chen Qiyou 陳奇猷, 2000, <em>Han Feizi xin\njiaozhu</em> 韓非子新校注.\nShanghai: Shanghai guji chubanshe.</li>\n<li><em>Dongpo quanji</em> 東坡全集. By Su Shi\n蘇軾. E-<em>Siku quanshu</em> edition.</li>\n<li>Duyvendak, Jan J.-L., trans. [1928] 1963. <em>The Book of Lord\nShang: A Classic of the Chinese School of Law</em>. Reprint. Chicago:\nUniversity of Chicago Press.</li>\n<li><em>Guanzi jiaozhu</em> 管子校注, Li\nXiangfeng 黎翔鳯 (ed.), Beijing: Zhonghua shuju,\n2004.</li>\n<li><em>Han Feizi</em>. See Harbsmeier, forthcoming.</li>\n<li><em>Han shu</em> 漢書, by Ban Gu 班固 et\nal., Beijing: Zhonghua shuju, 1997.</li>\n<li>Harbsmeier, Christoph (trans.), forthcoming, <em>Han Feizi</em>,\ned. J. Ø. Petersen and Y. Pines, Leiden: Brill.</li>\n<li>Harris, Eirik Lang, 2016. <em>The Shenzi Fragments: A\nPhilosophical Analysis and Translation</em>. New York: Columbia\nUniversity Press.</li>\n<li><em>The Huainanzi: A Guide to the Theory and Practice of\nGovernment in Early China</em>, John S. Major, Sarah A. Queen, Andrew\nS. Meyer and Harold D. Roth (trans. and eds.), New York: Columbia\nUniversity Press, 2010.</li>\n<li>Liao, W.K., trans., 1939–1959, <em>The Complete Works of Han\nFei tzu: A Classic of Legalism</em>. London: Probsthain.</li>\n<li><em>Lüshi chunqiu jiaoshi</em>\n呂氏春秋校釋, Chen Qiyou\n陳奇猷 (ed.), Shanghai: Xuelin, 1995.</li>\n<li>Pines, Yuri, trans. and ed., 2017, <em>The Book of Lord\nShang:</em> <em>Apologetics of State Power in Early China</em>. New\nYork: Columbia University Press.</li>\n<li>Rickett, W. Allyn, (ed. and trans.), 1985. <em>Guanzi. Political,\nEconomic, and Philosophical Essays from Early China.</em> Vol. 1.\nPrinceton: Princeton University Press.</li>\n<li>Rickett, W. Allyn, (ed. and trans.), 1998. <em>Guanzi: Political,\nEconomic, and Philosophical Essays from Early China</em>. Vol. 2.\nPrinceton: Princeton University Press.</li>\n<li><em>Shiji</em> 史記, by Sima Qian\n司馬遷 et al., Beijing: Zhonghua shuju, 1997.</li>\n<li>Vogelsang, Kai, trans., 2017, <em>Shangjun shu: Schriften des\nFürsten von Shang</em>. Stuttgart: Alfred Kröner.</li>\n<li>Watson, Burton, trans., 1993, <em>Records of the Grand\nHistorian</em>. Vol. 3: <em>Qin Dynasty</em>. Hong Kong: Chinese\nUniversity of Hong Kong Press.</li>\n<li>Watson, Burton, trans., 2003, <em>Han Feizi: Basic Writings</em>,\nNew York: Columbia University Press.</li>\n<li>Xu Fuhong 許富宏 (ed.), 2013, <em>Shenzi jijiao\njizhu</em> 慎子集校集注, Beijing:\nZhonghua shuju.</li>\n<li><em>Yantielun jiaozhu</em>\n鹽鐵論校注. 1996. Compiled by Huan Kuan\n桓寬 (first century BCE). Annotated by Wang Liqi\n王利器. Beijing: Zhonghua shuju.</li>\n<li>Zhang Jue 張覺, ed., 2012. <em>Shang jun shu\njiaoshu</em> 商君書校疏. Beijing: Zhishi\nchanquan chubanshe.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Ames, Roger, 1994, <em>The Art of Rulership: A Study of Ancient\nChinese Political Thought</em>. Albany: State University of New York\nPress.</li>\n<li>Bell, Daniel, 2015, <em>The China Model: Political Meritocracy and\nthe Limits of Democracy</em>. Princeton: Princeton University\nPress.</li>\n<li>Bodde, Derk, 1938, <em>China’s First Unifier: A Study of the\nCh’in Dynasty as Seen in the Life of Li Ssu</em>\n李斯<em>280–208 B.C.</em>, Leiden: Brill.</li>\n<li>Chen Chuang 陳闖, 2019, “‘Ping fa pi\nRu’ yundong shiqi de gudian xueshu yanjiu”\n“評法批儒”運動時期的古典學術研究.\nPhD. Dissertation, Shandong University.</li>\n<li>Creel, Herrlee G., 1953, <em>Chinese Thought from Confucius to Mao\nTse-tung</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1974, <em>Shen Pu-hai: A Chinese Political\nPhilosopher of the Fourth Century B.C.</em>, Chicago and London:\nUniversity of Chicago Press.</li>\n<li>Csikszentmihalyi Mark and Nylan, Michael, 2003,\n“Constructing Lineages and Inventing Traditions through\nExemplary Figures in Early China.” <em>T’oung Pao</em>,\n89.1–3: 59–99.</li>\n<li>Fu Zhengyuan, 1996, <em>China’s Legalists: The Earliest\nTotalitarians and their Art of Ruling</em>, Armonk and London: M.E.\nSharpe.</li>\n<li>Goldin, Paul R., 2005, “Persistent Misconceptions about\nChinese ‘Legalism,’” <em>Journal of Chinese\nPhilosophy</em> 38 (1): 64–80.</li>\n<li>–––, ed., 2013: <em>Dao Companion to the\nPhilosophy of Han Fei</em>. Dordrecht: Springer.</li>\n<li>–––, 2020, <em>The Art of Chinese Philosophy:\nEight Classical Texts and How to Read Them</em>. Princeton NJ:\nPrinceton University Press.</li>\n<li>Graham, A. C., 1989. <em>Disputers of the Tao: Philosophical\nArgument in Ancient China</em>. La Salle, IL: Open Court.</li>\n<li>Graziani, Romain, 2015, “Monarch and Minister: Reflections\non an impossible partnership in the building of absolute monarchy in\nthe Han Feizi 韩非子,” in <em>Ideology of\nPower and Power of Ideology in Early China</em>, Y. Pines, P. R.\nGoldin and M. Kern (eds.). Leiden: Brill.</li>\n<li>–––, forthcoming. “The Ruler’s New\nTools: <em>Fa</em> 法 and the Political Paradigm of Measure in\nEarly China,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Harris, Eirik L., forthcoming, “Human Motivation in the\n<em>fa</em> Tradition: Visions from the <em>Shenzi</em> Fragments,\n<em>Shangjunshu</em>, and <em>Han Feizi</em>,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.</li>\n<li>Hsiao, Kung-chuan, 1979, <em>A History of Chinese Political\nThought</em>. Vol. I: <em>From the Beginnings to the Sixth Century\nA.D.</em> F.W. Mote (trans.). Princeton Library of Asian Translations.\nPrinceton: Princeton University Press.</li>\n<li>Indraccolo, Lisa, forthcoming. “Philosophy of language in\nthe <em>fa</em> tradition,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Jiang, Tao, 2021, <em>Origins of Moral-Political Philosophy in\nEarly China: Contestation of Humanness, Justice, and Personal\nFreedom</em>. Oxford: Oxford University Press.</li>\n<li>Kern, Martin, 2000, <em>The Stele Inscriptions of Ch’in\nShih-huang: Text and Ritual in Early Chinese Imperial\nRepresentation</em>. New Haven: American Oriental Society.</li>\n<li>Korolkov, Maxim, “Rule by impersonal standards in the early\nempire: ideas and realities,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Lau, Ulrich and Michael Lüdke, forthcoming,\n“<em>Fa</em> and the early legal system,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.</li>\n<li>Lewis, Mark E., 1999, “Warring States: Political\nHistory,” in <em>The Cambridge History of Ancient China: From\nthe Origins of Civilization to 221 B.C.</em>, Michael Loewe and Edward\nL. Shaughnessy (eds.), Cambridge: Cambridge University Press,\n587–650.</li>\n<li>–––, 2000, “The Han Abolition of Universal\nMilitary Service,” in <em>Warfare in Chinese History</em>, H.\nVan de Ven (ed.), Leiden: Brill, 33–76.</li>\n<li>–––, 2021, <em>Honor and Shame in Early\nChina</em>. Cambridge: Cambridge University Press.</li>\n<li>–––, forthcoming. “The ruler in\n<em>fa-</em>based government,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Li Yu-ning, (ed.), 1977, <em>Shang Yang’s Reforms and State\nControl in China</em>. White Plains, NY: Sharpe.</li>\n<li>Liang Qichao 梁啟超. 1906 [2003]. “Zhongguo\nfalixue fada shi lun”\n中國法理學發達史論.\nRpt. in Liang Qichao, <em>Yinbingshi wenji dianjiao</em>\n飲冰室文集點校, Wu Song\n吳松, Lu Yunkun 盧雲崐, Wang Wenguang\n王文光, and Duan Bingchang 段炳昌\n(eds.), Kunming: Yunnan jiaoyu chubanshe, Vol. 1, 340–375.</li>\n<li>Liu Zehua 劉澤華, 2003, <em>Xi er zhai\nwengao</em> 洗耳齋文稿, Beijing:\nZhonghua shuju.</li>\n<li>–––, 2013–14, “Monarchism: The\nHistorical Orientation of China’s Intellectual Culture,”\nY. Pines (trans.), <em>Contemporary Chinese Thought</em> 45.2–3\n(2013–2014): 21–31.</li>\n<li>McLeod, Alexus, forthcoming, “The <em>fa</em> Tradition and\nMorality,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Morgenthau, Hans Joachim, 1978, <em>Politics among Nations: The\nStruggle for Power and Peace</em>, New York: Knopf.</li>\n<li>Petersen, Jens Østergård, 1995, “Which Books\nDid the First Emperor of Ch’in Burn? On the Meaning of <em>Pai\nChia</em> in Early Chinese Sources,” <em>Monumenta Serica</em>\n43: 1–52.</li>\n<li>Pines, Yuri, 2000, “‘The One That Pervades the\nAll’ in Ancient Chinese Political thought: The Origins of\n‘The Great Unity’ Paradigm,” <em>T’oung\nPao</em> 86 (4–5): 280–324.</li>\n<li>–––, 2009, <em>Envisioning Eternal Empire:\nChinese Political Thought of the Warring States Era.</em> Honolulu:\nUniversity of Hawai‘i Press.</li>\n<li>–––, 2012, “Alienating rhetoric in the\n<em>Book of Lord Shang</em> and its moderation,”\n<em>Extrême-Occident</em>, 34: 79–110.</li>\n<li>–––, 2013a, “From Historical Evolution to\nthe End of History: Past, Present and Future from Shang Yang to the\nFirst Emperor,” in <em>Dao Companion to the Philosophy of Han\nFei</em>, Paul R. Goldin (ed.), Dordrecht: Springer, 25–46.</li>\n<li>–––, 2013b, “Submerged by Absolute Power:\nThe Ruler’s Predicament in the <em>Han Feizi</em>,” in\n<em>Dao Companion to the Philosophy of Han Fei</em>, Paul R. Goldin\n(ed.), Dordrecht: Springer, 67–86.</li>\n<li>–––, 2013c, “Between Merit and Pedigree:\nEvolution of the Concept of ‘Elevating the Worthy’ in\npre-imperial China,” in: <em>The Idea of Political Meritocracy:\nConfucian Politics in Contemporary Context</em>, Daniel Bell and Li\nChenyang (eds.), Cambridge: Cambridge University Press,\n161–202.</li>\n<li>–––, 2016a, “Dating a Pre-imperial Text:\nThe Case Study of the <em>Book of Lord Shang</em>.” <em>Early\nChina</em> 39:145–184.</li>\n<li>–––, 2016b, “Social Engineering in Early\nChina: The Ideology of the <em>Shangjunshu</em> (Book of Lord Shang)\nRevisited.” <em>Oriens Extremus</em> 55: 1–37.</li>\n<li>–––, 2016c, “A ‘Total War’?\nRethinking Military Ideology in the <em>Book of Lord\nShang</em>,” <em>Journal of Chinese Military History</em> 5.2:\n97–134.</li>\n<li>–––, 2020a, “Worth vs. Power: Han\nFei’s ‘Objection to Positional Power’\nRevisited.” <em>Asiatische Studien/Études Asiatiques</em>\n74.3: 687–710.</li>\n<li>–––, 2020b, “‘To die for the\nSanctity of the Name’: Name (<em>ming</em> 名) as\nprime-mover of political action in early China.” In:\n<em>Keywords in Chinese Culture</em>, W-y. Li and Y. Pines (eds.),\nHong Kong: The Chinese University Press, 169–218.</li>\n<li>–––, 2021, “Agriculturalism and Beyond:\nEconomic Thought of the <em>Book of Lord Shang</em>,” in\n<em>Between Command and Market: Economic Thought and Practice in Early\nChina</em>, Elisa Sabattini and Christian Schwermann (eds.), Leiden:\nBrill, 76–111.</li>\n<li>–––, ed., forthcoming A, <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Dordrecht: Springer.</li>\n<li>–––, forthcoming B, “<em>Han Feizi</em>:\nThe World Driven by Self-Interest,” in <em>Dao Companion to\nChina’s</em> fa <em>Tradition: The Philosophy of Governance by\nImpartial Standards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>–––, forthcoming C, “The <em>fa</em>\nTradition and Its Modern Fate: The Case of the <em>Book of Lord\nShang</em>,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Polnarov, Anatoly, 2018, “Looking Beyond Dichotomies: Hidden\nDiversity of Voices in the <em>Yantielun</em>\n鹽鐵論.” <em>T’oung Pao</em> 104:\n465–495.</li>\n<li>Queen, Sarah. 2013. “<em>Han Feizi</em> and the Old Master:\nA Comparative Analysis and Translation of <em>Han Feizi</em> Chapter\n20, ‘Jie Lao’ and Chapter 21, ‘Yu Lao,’”\nin <em>Dao Companion to the Philosophy of Han Fei</em>, Paul R. Goldin\n(ed.), Dordrecht: Springer, 197–256.</li>\n<li>Rubin, Vitaly, 1976, <em>Individual and State in Ancient\nChina</em>, New York : Columbia University Press.</li>\n<li>Sato, Masayuki, 2013a, “Did Xunzi’s Theory of Human\nNature Provide the Foundation for the Political Thought of Han\nFei?” in <em>Dao Companion to the Philosophy of Han Fei</em>,\nPaul R. Goldin (ed.), Dordrecht: Springer, 147–165.</li>\n<li>–––, 2013b, “Studies of <em>Han Feizi</em>\nin China, Taiwan, and Japan” in <em>Dao Companion to the\nPhilosophy of Han Fei</em>, Paul R. Goldin (ed.), Dordrecht: Springer,\n257–281.</li>\n<li>–––, forthcoming, “The Concept of\n<em>fa</em> in <em>Guanzi</em> and its Evolution,” in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.</li>\n<li>Schiele, Alexandre, forthcoming, “The <em>Book of Lord\nShang</em> and Totalitarianism’s Intellectual Precursors\nCompared,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Schwartz, Benjamin I., 1985, <em>The World of Thought in Ancient\nChina</em>, Cambridge, MA : Harvard University Press.</li>\n<li>Schwermann, Christian, forthcoming. “The Ideology of Chao\nCuo,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Smith, Kidder, 2003, “Sima Tan and the Invention of Daoism,\n‘Legalism,’ et cetera.” <em>Journal of Asian\nStudies</em> 62 (1): 129–156.</li>\n<li>Song Hongbing, forthcoming A, “Two Perspectives on the\n<em>Fa</em> Tradition: Politics versus the Rule of Impartial\nStandards,” in <em>Dao Companion to China’s</em> fa\n<em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Song Hongbing, forthcoming B, “The Historical Reputation of\nthe <em>fa</em> Tradition in Imperial China,”in <em>Dao\nCompanion to China’s</em> fa <em>Tradition: The Philosophy of\nGovernance by Impartial Standards</em>, Y. Pines (ed.), Dordrecht:\nSpringer.</li>\n<li>Thompson, P. M., 1979, <em>The Shen-tzu Fragments</em>, Oxford:\nOxford University Press.</li>\n<li>Van Norden, Bryan W. 2011. <em>Introduction to Classical Chinese\nPhilosophy</em> (Indianapolis and Cambridge: Hackett.</li>\n<li>Vogelsang, Kai. 2016. “Getting the Terms Right: Political\nRealism, Politics, and the State in Ancient China.” <em>Oriens\nExtremus</em> 55: 39–72.</li>\n<li>–––, forthcoming, “The Historiography of\nPolitical Realism,” in <em>Dao Companion to China’s</em>\nfa <em>Tradition: The Philosophy of Governance by Impartial\nStandards</em>, Y. Pines (ed.), Dordrecht: Springer.</li>\n<li>Waley, Arthur, 1939, <em>Three Ways of Thought in Ancient\nChina</em>. London: George Allen &amp; Unwin.</li>\n<li>Wagner, Donald B., 1993, <em>Iron and Steel in Ancient China</em>.\nLeiden: Brill.</li>\n<li>Wang, Hsiao-po and Leo S. Chang, 1986, <em>The Philosophical\nFoundations of Han Fei’s Political Theory</em>, Honolulu:\nUniversity of Hawai’i Press, 1986.</li>\n<li>Xi Jinping. 2018. <em>The Governance of China</em>. Volume 1.\nBeijing: Foreign Languages Press, 2<sup>nd</sup> ed.</li>\n<li>Zheng Liangshu 鄭良樹, 1989, <em>Shang Yang ji\nqi xuepai</em> 商鞅及其學派,\nShanghai: Guji chubanshe.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Political Realism in International Relations",
            "authority",
            "Chinese Philosophy: ethics",
            "Chinese Philosophy: Mohism",
            "Hanfeizi",
            "Xunzi"
        ],
        "entry_link": [
            {
                "https://plato.stanford.edu/entries/realism-intl-relations/": "Political Realism in International Relations"
            },
            {
                "../authority/": "authority"
            },
            {
                "../ethics-chinese/": "Chinese Philosophy: ethics"
            },
            {
                "../mohism/": "Chinese Philosophy: Mohism"
            },
            {
                "../xunzi/": "Xunzi"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=chinese-legalism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/chinese-legalism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=chinese-legalism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/chinese-legalism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=chinese-legalism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/chinese-legalism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=chinese-legalism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/chinese-legalism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://ctext.org/legalism/\" target=\"other\">Legalism at Chinese Text Project</a>"
        ],
        "listed_links": [
            {
                "http://ctext.org/legalism/": "Legalism at Chinese Text Project"
            }
        ]
    }
}