{
    "url": "crathorn",
    "title": "William Crathorn",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Aurélien Robert\n<robert_aurelien@hotmail.com>",
        "author_links": [
            {
                "http://www.cesr.univ-tours.fr/recherche/equipes/pages_personnelles/pages_personnelles.asp?numperso=137": "Aurélien Robert"
            },
            {
                "mailto:robert_aurelien%40hotmail%2ecom": "robert_aurelien@hotmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.cesr.univ-tours.fr/recherche/equipes/pages_personnelles/pages_personnelles.asp?numperso=137\" target=\"other\">Aurélien Robert</a>\n&lt;<a href=\"mailto:robert_aurelien%40hotmail%2ecom\"><em>robert_aurelien<abbr title=\" at \">@</abbr>hotmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 12, 2005",
        "substantive revision Thu Feb 24, 2022"
    ],
    "preamble": "\n\nWilliam Crathorn (fl. 1330s), like Adam Wodeham (d. 1358) and Robert\nHolkot (c. 1290–1349), belonged to the first generation of\nOxford philosophers after William of Ockham (c. 1285–1347), who\nsought to criticize and develop Ockham’s philosophy. Crathorn is\nremembered for his theories of language and cognition, and for some\nanti-skeptical arguments strikingly similar to those found in\nDescartes’ Meditations. The radical ontology of his\nworks is also noteworthy, though it has not yet been closely\nstudied.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Work"
        },
        {
            "#RelaOtheScho": "2. Relation to Other Scholars"
        },
        {
            "#Epis": "3. Epistemology"
        },
        {
            "#PhilLang": "4. Philosophy of Language"
        },
        {
            "#OntoCate": "5. Ontology and Categories"
        },
        {
            "#Atom": "6. Atomism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimLite": "Primary Literature"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Work\n\nVery little is known about Crathorn’s life. He might have been\nborn in the village of Crathorne in north Yorkshire. He became a\nDominican friar before going to Oxford, where he lectured on the first\nbook of Peter the Lombard’s Sentences in the years\n1330–32, a work we can date because of a passage in which\nCrathorn mentions an eclipse that we know occurred on July 16, 1330.\nHis Dominican contemporary, Robert Holkot, also tells us that that he\nlectured at the same time (1331–33) as a Dominican named\nCrathorn (Courtenay 1978; Schepers 1970 and 1972)\n\nWilliam Crathorn also lectured on the Bible, and Holkot is presumably\nresponding to Crathorn’s arguments in his Sex articuli.\nA manuscript in Vienna contains what could be Crathorn’s\nforty-two quodlibetal questions (Richter 1972), but most of these\nquestions are similar to the ones contained in his Questions on\nthe Sentences (Quaestiones super librum\nsententiarum).\n2. Relation to Other Scholars\n\nCrathorn’s Sentences commentary is of great\nphilosophical and historical interest for the study of the first\ngeneration of Oxford thinkers after Ockham because he develops his own\nprovocative positions by discussing the major issues of his day and\ncriticizing the views of his contemporaries (Courtenay 1978, Gelber\n2004). His favorite target was Ockham, but he also argued against the\nviews of Thomas Aquinas (Krauss 1933), John Duns Scotus, Richard\nFitzralph, and Robert Holkot (Schepers 1970, 1972).\n\nAlthough Crathorn criticized Ockham, he remained a nominalist (he\nadmits only individuals in his ontology and subscribes to the same\nkind of theory of predication as Ockham). Above all, he worked out\nsome of the consequences of Ockham’s views in epistemology, the\nphilosophy of language, and ontology, to show what problems they\ncreated. We do not know whether he knew Ockham personally, or only\nindirectly, through his younger disciple, Adam Wodeham. Indeed,\nWodeham frequently refers to a Dominican socius, who could\nhave been Crathorn himself or a certain John Grafton, another Oxford\nDominican of this time.\n3. Epistemology\n\nThe problem of knowledge is at the very heart of Crathorn’s\nthought. Going back to Roger Bacon, he held that the only way the\nhuman mind is able to know the external world is through\nspecies that resemble it (I Sent. q. 1, concl. 4).\nBacon’s theory of the multiplication of species\n(multiplicatio specierum) was developed to explain causality\nusing the model of optics. A thing c has an effect on another\nthing e through the multiplication of species s from\nc towards e, just as light is multiplied through the\nair when it illuminates an object. According to Bacon, the species\ns is a representative of c but with a lesser mode of\nbeing. Thus, the species is multiplied through the medium of air again\nand again until it arrives at e. The causal power of\nc is in this way conserved through the medium until it acts\non e. The species is therefore both the cause (i.e., the same\nthing as the cause but with a diminished mode of being) and a likeness\nof that cause. Applying Bacon’s theory to epistemology, Crathorn\nasserts that we have no direct access to things in the external world\nand that we immediately perceive only their mental likenesses or\nrepresentations, i.e., their species. These mental entities, whether\nwe call them ‘species“ or ‘concepts” (the\nterms are equivalent for Crathorn), have the same nature as the things\nthey resemble (ibid. concl. 8). Contrary to Bacon, the\nDominican considers that the species has the same mode of being\n— i.e., material being — outside and inside the mind. As a\nconsequence, all the species we have in the mind belong to the\ncategory of quality, for no real substance or quantity can exist\nmaterially in the human soul. Since concepts can only belong to the\ncategory of quality according to Crathorn, they must be mental\nqualities having the same nature as non-mental qualities and they must\nexist subjectively in the mind, which is to say that they exist in\nsome part of the brain (Pasnau 1997). Crathorn writes, “the word\n‘cognition’ (cognitio) stands for the idea\n(verbum) of the thing known, and that idea is the quality\nexisting subjectively (subiective existens) in the mind or in\nsome part of the brain” (I Sent. q. 1, concl. 1).\nTherefore, cognition is nothing but the species itself or the part of\nthe soul where it is received and stored. From an ontological point of\nview, nothing distinguishes sensible cognition, imagination and\nintellection except the distinct part of the soul where the species is\nreceived. There is no difference between sensible and intelligible\nspecies.\n\nCrathorn goes on to describe the different parts of the brain and\ntheir functions. As the canonical medieval topology of the brain\nsuggests, there are three main lobes (cellulae) connected by\nnerves through which the information conveyed by the species can be\ntransferred from one lobe to another. The first lobe corresponds to\nsensitive imagination (cellula fantastica), the second to\nconceptualization and discourse (cellula syllogistica) and\nthe third to memory (cellula memoriale) (I Sent. q.\n2, concl. 4).\n\nCrathorn thus had to emend Ockham’s theory of evident knowledge,\nbecause intuitive cognition is no more the guarantee of any certitude\nregarding the existence of extramental things. In addition, the\ncognition of the terms of a proposition — even a per se\nnota proposition — is not sufficient, according to\nCrathorn, to ensure the causal mechanism that leads to evidence and\ncertitude. Indeed, as we shall see below, Crathorn refuses to treat\nthe species or cognitions as linguistic elements of thought. All\nlanguages are conventional by nature. Therefore, it is possible to\ncognize some terms the signification of which remains unknown to the\ncognizing subject. As a result, although empirical knowledge of the\nthings signified by the terms is usually needed, it is necessary to\nargue beyond simple and intuitive cognitions, via syllogisms and\ndemonstrations, to consolidate one’s certitude that not only\nrepresentations exist. Crathorn thus suggests that we substitute for\nthe Ockhamist definition of evident cognition his own definition:\nevident cognition is a manifest, clear, and not obscure cognition (q.\n1, p. 69–70: notitia evidens est notitia manifesta, clara et\nnon obscura), be it simple or complex, intuitive or\nabstractive.\n\nIncredibly, Crathorn affirms that whenever one is thinking of a white\nthing, the mind of that person actually becomes white. His notion of\nsimilarity is strict and uncompromising. Mental concepts cannot\nresemble substances but only qualities of substances (I\nSent., q. 1, concl. 7) because the species of substance would\nhave to be a substance itself and our minds would turn into a new\nsubstance if we thought of it. It also cannot be a pure quantity\nbecause in thinking of infinite magnitudes, our minds would become\ninfinite, and the same is true for the other categories besides\nquality. According to Crathorn, our ability to conceptualize is\ntherefore limited to natural concepts of qualities, which in being\nconceived become qualities of the soul.\n\nCrathorn had to face up to the skeptical consequences of this odd\nepistemology. How can we know what is real if our only access to\nreality is via representations of its qualitative features? His answer\nto this question is quite radical: we cannot be naturally and directly\ncertain that reality exists as we conceive it since it is not possible\nto distinguish qualities inside and outside the mind: as qualities,\nthey would have precisely the same nature (ibid. concl.\n10–13). The only solution to skeptical doubt here is the\nprinciple, which he claims is known per se, that God does not\nproduce an effect supernaturally in order to lie or to lead people\ninto error (ibid. q. 1, concl. 14), a principle more famously\nused in connection with Descartes’ thought experiment of a\nDieu trompeur several centuries later.\n\nCrathorn endeavored elsewhere to gather at least a few certitudes,\nsince one could doubt whether the a priori principle that God would\nnever deceive us is itself certain. To rebut the skeptic, he turns\nback to Augustine’s version of the cogito-argument to\nprove that we can at least be certain of our own mental activity, for\nif one were to doubt a proposition such as ‘I am’, it\nwould follow that he exists, since he who does not exist does not\ndoubt. Hence, no one can be in doubt concerning the proposition,\n‘I am’ (I Sent., q. 1, concl. 14; translated in\nTachau 1988, p. 273).\n4. Philosophy of Language\n\nOne of the most important debates at Oxford around 1320–30\nconcerned the proper object of scientific knowledge. When we know\nsomething scientifically, is our knowledge about external things (the\nearth interposed between the sun and the moon), propositions\n(‘The moon is eclipsed’), or some other more complex state\nof affairs? Crathorn is believed to have participated in the\ndevelopment of the idea that the proper object of science is neither\nthe external thing nor the proposition (as Ockham and Holkot had\nargued), but the ‘total significate’ of that proposition\n(Tachau 1987). Typically, the total significate would include not only\nexternal things but also the premises and other assumptions that\ngenerate our assent to the proposition as the conclusion of a piece of\ndemonstrative reasoning.\n\nAnother debate concerned the nature of mental language, specifically\nwhether it is conventional or natural (Gelber 1984; Panaccio 1996)\nOckham had argued that thinking occurs in a universal language made of\nconcepts acquired naturally, i.e. through natural relations of\ncausality and similitude. All conventional languages used for human\ncommunication are subordinated to this mental language, which is\nshared by everyone. But Crathorn could not accept such a position\nbecause of his cognitive theory according to which there are only\nqualities in the mind. So there can be natural signs of extra-mental\nqualities. What about substance-terms (the equivalent of proper and\ncommon names), verbs, and syncategorems, i.e., logical particles and\nconnectives such as ‘or’, ‘but’,\n‘all’, and ‘if’? Accordingly, Crathorn argues\nthat except for natural signs of qualities, no natural likeness in the\nmind can explain the signification of these terms. Mental language is\ntherefore as conventional as spoken and written languages and is in\nfact derived from conventional languages (I Sent., q. 2; Cf.\nPanaccio 1996, Perler 1997, Robert 2009b and 2010b). Just as thought\ndepends on the species or likenesses of external things,\nmental words are likenesses of conventional words and have exactly the\nsame semantic properties. Depending upon which language(s) you learn\nto speak, your mental language will be a likeness of Latin, English,\nFrench, etc. This does not mean that we do not have natural\nrepresentations of the external world, but these mental\nqualia do not form a language. Crathorn was the only thinker\nof his time to affirm that conventional words are prior to their\nmental counterparts. Meaning is first given by a community of\nspeakers; mental language is simply the internalization of these\nspoken and written languages. When we think about the world with\npropositions and syllogisms, we always think in a conventional\nlanguage or, more precisely, in its mental reflection.\n5. Ontology and Categories\n\nIn keeping with his views on knowledge and language, Crathorn\nadvocated radical changes to traditional Aristotelian ontology. These\nare discussed in a sub-treatise on the categories in his\nCommentary on the Sentences (I Sent. qq.\n13–18).\n\nOckham famously reduced the ten Aristotelian categories to two,\nsubstance and quality, treating the other eight as modes of signifying\nsubstances and qualities. For Crathorn, however, the entire\nAristotelian system has to be revised. The human mind naturally knows\nnothing but qualities, and we cannot be certain that even they exist\nwithout appealing to the principle that God could not deceive us.\nThinking and reasoning are of no help because, as we saw above, they\nare purely conventional.\n\nInstead, Crathorn treats the Aristotelian categories as philosophical\nconventions. Following the chapters of Aristotle’s\nCategories step by step, he comes to the conclusion that none\nof the ten categories are valid because the reasons Aristotle uses to\ndistinguish them are inadequate. For example, the category of\nsubstance is distinguished from the other categories by the fact that\nit has no contrary and can successively acquire contrary qualities\n(Aristotle, Categories 5). But Crathorn claims that when we\nheat a piece of wood or a man, not only the substance but also its\nqualities become hot, such that its qualities change from one state to\ntheir contrary exactly like a substance. Therefore, this crucial\ndistinction between substance and accidents does not apply. Crathorn\nwrites, “not only the substance of the wood can receive the\ncontraries, but also the accidents of the wood ... but if the wood is\nhot, not only is the heat attached to the wood hot, but also all the\npositive coextensive natures of the wood” (I Sent., q.\n13, concl. 13). He also affirms that “one and the same thing\nnumerically can truly be said to be substance and accident in relation\nto different things” (ibid., concl. 5). Indeed, water\nand fire can be considered as natural substances, but one is the\ncontrary of the other. As a general conclusion, Crathorn asserts that\nthe very same thing can be called a substance, a quality, a quantity,\na relation and so forth (q. 17, p. 462 and q. 18, p. 476).\n\nCrathorn develops his position mostly by attacking the views of other\nphilosophers who accepted such distinctions, but unfortunately he is\nnot always clear about his positive reasons for abandoning\nAristotelian ontology. But, on one hand it is consistent with his\nepistemology, for our only direct and natural certitude is that\nqualities exist. On the other hand, it is also consistent with his\nfrequent tendency to materialism. Indeed, we can discern hints of\natomism in his Commentary on the Sentences.\n6. Atomism\n\nCrathorn is less well known than other fourteenth-century atomists\nsuch as the Oxford thinkers Henry of Harclay (d. 1317) and Walter\nChatton (c. 1285–1344), or the Parisians Gerard of Odo\n(1290–1349), Nicolas Bonet (d. 1343), and Nicolas of Autrecourt\n(1299–1369) (Murdoch 1974, 1982; Grellard and Robert 2009), yet\nwe find several questions on the divisibility of the continuum in his\nSentences commentary (particularly I Sent., q. 3,\nbut also qq. 4 and 14–16). He affirms that a continuum is\ndivisible into a finite number of atoms that are not mathematical\npoints but its real, physical parts (I Sent., q. 3; for\ndiscussion, see Wood 1988, Robert 2009a). Atoms are thus real singular\nentities with discrete magnitude or quantity and a proper nature. For\nexample, he says that there are atoms of gold and atoms of lead, and\nthat these are different kinds of things (I Sent., q. 14).\nCrathorn’s atomism is far from that of Democritus.\n\nThe most difficult problem for atomists arises from book VI of\nAristotle’s Physics, where it becomes necessary to\ndefine the contiguity of atoms. Since an atom by definition has no\nparts, how can we say that they touch each other? If they are actually\nin contact, they should be in one and the same place (if not, then\nthere is no continuity since continuity requires contiguity). Crathorn\nreplies by saying that this is a problem only for those who think of\natoms as mathematical points. But since he holds that atoms have a\nproper magnitude and that they are defined by the fact that they\noccupy a single location (situs or locus), a\nquantity that is simply the place occupied by the quantified thing (I\nSent., qq. 3 and 14–15), the contiguity and continuity\nof atoms can be explained in terms of the contiguity of places. Atoms\ncan form a continuous magnitude if all of them are contiguous, i.e.,\nif they all occupy contiguous atomic places.\n\nThe implications of Crathorn’s atomism are truly astonishing.\nFirst, every movement boils down to local motion of atoms in the void.\nThus, Crathorn affirms that a continuous motion has only one possible\nspeed, which is the greatest speed it could ever reach (Murdoch 1984).\nIn other words, movement is continuous when an atom changes from one\natomic place to another contiguous atomic place. The proportion of\ntime and place (i.e., the speed) is always equal to one. So how can he\nexplain the fact that things appear to move at different speeds? The\nanswer is quite simple: to every varying speed there corresponds a\ndiscontinuous motion, with times of rest between some of the atomic\nplaces occupied by the moving atoms (I Sent., q. 16, concl.\n6). For example, the normal speed of an atom a corresponds to\nits local motion from a place p1 to another contiguous place\np2 in a given atomic time. Variation of speed occurs if\na moves from p1 to p2 but with a time of\nrest equivalent to two atoms of time. We may infer that speed can also\nvary if a goes from p1 to another place p3\nthat is not directly contiguous with p1.\n\nAlthough Crathorn does not describe himself this way, he seems to be\none of the most radical atomists of the fourteenth century (Robert\n2010a), sharing with his Parisian contemporary Nicholas of Autrecourt\nmuch of the same anti-Aristotelian bent in his metaphysics and natural\nphilosophy. Combined with his epistemology and philosophy of language,\nhis philosophy is certainly one of the most original forms of\nreductionism in later medieval philosophy.\n",
    "bibliography": {
        "categories": [
            "Primary Literature",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Quaestiones super librum sententiarum</em>, ed. F. Hoffmann in\n<em>Quästionen Zum ersten Sentenzenbuch</em>, Beiträge zur\nGeschichte der Philosophie und Theologie des Mittelalters, Band 29,\nAschendorff: Münster, 1988.\n</ul>\n<h4>Translation</h4>\n<ul class=\"hanging\">",
                "I <em>Sent</em>., q. 1, tr. R. Pasnau in Pasnau (ed.), <em>The\nCambridge Translations of Medieval Philosophical Texts</em>, Vol. III:\nMind and Knowledge, Cambridge: Cambridge University Press, 2003.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Alisade, H. F. X., 2014, “Wilhelm Crathorn OP”, in\n<em>Biographisch-bibliographisches Kirchenlexicon</em>, Bd. 35,\nNordhausen: Bautz, 1537–1543.",
                "Courtenay, W. J., 1978, <em>Adam Wodeham: An Introduction to His\nLife and Writings</em> (Studies in Medieval and Reformation Thought\n21), Leiden: E. J. Brill.",
                "Gelber, H. G., 1984, “I Cannot Tell a Lie: Hugh\nLawton’s Critique of Ockham on Mental Language,”\n<em>Franciscan Studies</em>, 44: 141–79.",
                "–––, 2004, <em>It Could Have Been Otherwise:\nContingency and Necessity in Dominican Theology, 1300–1350</em>,\nLeiden: E. J. Brill.",
                "Grellard, C. and A. Robert, 2009, <em>Atomism in Late Medieval\nPhilosophy and Theology</em>, Leiden-Boston: E.J. Brill.",
                "Hoffmann, F., 1971, “Der Satz als Zeichen der Theologischen\nAussage bei Holcot, Crathorn und Gregor von Rimini,” in <em>Der\nBergriff der Repraesentatio im Mittelalter</em>, <em>Miscellanea\nMedievalia</em>, 8: 296–313.",
                "–––, 1995, “Der Wandel in der\nScholastischen Argumentation vom 13 Zum 14 Jahrhundert aufgezeigt an\nzwei Beispielen: Robert Holcot und William (Johannes?)\nCrathorn,” in A. Speer (ed.), <em>Die Bibliotheca\nAmploniana</em>, <em>Miscellanea Medievalia</em>, 23:\n301–322.",
                "Kirjavainen, H., 2000, “Transcendental Elements in the\nSemantics of Crathorn,” in G. Holmström-Hintikka (ed.),\n<em>Medieval Philosophy and Modern Times</em>,\nDordrecht-Boston-London: Kluwer, pp. 45–58.",
                "Krauss, J., 1933, “Die Stellung des Oxforder\nDominikanerlehrers Crathorn zu Thomas von Aquin,”\n<em>Zeitschrift für Katholische Theologie</em>, 57:\n66–68.",
                "Murdoch, J. E., 1974, “Naissance et développement de\nl’atomisme au bas Moyen Âge latin,” in <em>La\nscience de la nature: théories et pratiques</em> (Cahiers\nd’Études Médiévales 2), Montréal:\nBellarmin, pp. 11–32.",
                "–––, 1982, “Infinity and\nContinuity,” in N. Kretzmann, A. Kenny and J. Pinborg (eds.),\n<em>The Cambridge History of Later Medieval Philosophy</em>,\nCambridge-New York: Cambridge University Press, pp.\n564–591.",
                "–––, 1984, “Atomism and Motion in the\nFourteenth Century,” in E. Mendelsohn (ed.), <em>Transformation\nand Tradition in the Sciences: Essays in Honor of I. B. Cohen</em>,\nCambridge-New York: Cambridge University Press, pp. 45–66.",
                "Panaccio, C., 1996, “Le langage mental en discussion:\n1320–1335,” <em>Les Études Philosophiques</em>, 3:\n323–39.",
                "Pasnau, R., 1997, <em>Theories of Cognition in the Later Middle\nAges</em>, Cambridge-New York: Cambridge University Press.",
                "Perler, D., 1997, “Crathorn on Mental Language,” in\nCostantino Marmo (ed.), <em>Vestigia, Imagines, Verba. Semiotics and\nlogic in medieval theological texts (XIIth–XIVth century). Acts of the\nXIth European Symposium on Medieval Logic and Semantics. San Marino,\n24–28 May 1994</em>, Turnhout: Brepols, pp. 337–54.",
                "Richter, V., 1972, “Handschriftliches zu Crathorn,”\n<em>Zeitschrift für Katholische Theologie</em>, 94:\n445–49.",
                "Robert, A., 2009a, “William Crathorn’s\nMereotopological Atomism”, in C. Grellard and A. Robert (eds.),\n<em>Atomism in Late Medieval Philosophy and Theology</em>,\nLeiden-Boston: E.J. Brill, pp. 127–162.",
                "–––, 2009b, “Les deux langages de la\npensée: à propos de quelques réflexions\nmédiévales”, in J. Biard (ed.), <em>Le langage\nmental du Moyen Âge à l’âge classique</em>,\nLouvain-la-Neuve: Peeters, pp. 145–168.",
                "–––, 2010a, “Atomisme et\ngéométrie à Oxford au XIVe siècle”,\nin S. Rommevaux (ed.), <em>Mathématiques et connaissance du\nréel avant Galilée</em>, Omniscience: Paris, pp.\n15–85.",
                "–––, 2010b, “William Crathorn on\nPredication and Mental Language”, <em>Analytica</em>, 14(2):\n227–258.",
                "–––, 2016, “Crathorn versus Ockham on\nCognition, Language, and Ontology,” in Christian Rode (ed.),\n<em>A Companion to Responses to Ockham</em>, Leiden-New York: E.J.\nBrill, pp. 47–78.",
                "Schepers, H., 1970, “Holkot contra dicta Crathorn: I.\nQuellenkritik und Biographische Auswertung der Bakkalareatsschriften\nzweier Oxforder Dominikaner des XIV Jahrunderts,”\n<em>Philosophisches Jahrbuch</em>, 77: 320–54.",
                "–––, 1972, “Holkot contra dicta Crathorn:\nII. Das significatum per propositionem. Aufbau und Kritik einer\nNominalistischen Theorie über den Gegenstand des Wissens,”\n<em>Philosophisches Jahrbuch</em>, 79: 106–136.",
                "Sprengard, K. A., 1968, “Crathorn. Ein Oxforder modernus des\nXIV. Jahrhunderts,” <em>Systematische-Historische Untersuchungen\nzur Philosophie des XIV Jahrhunderts</em> (Band 2), Bonn: Mainzer\nPhilosophische Forschungen.",
                "Tachau, K. H., 1987, “Wodeham, Crathorn, and Holcot: The\nDevelopment of the <em>complexe significabile</em>,” in L. M. de\nRijk and H. Braakhuis (eds.), <em>Logos and Pragma</em>, Nijmegen:\nIngenium Publishers, pp. 161–87.",
                "–––, 1988, <em>Vision and Certitude in the Age\nof Ockham</em>, Studien und Texte zur Geistesgeschichte des\nMittelalters, Leiden-New York-København-Köln: E. J.\nBrill.",
                "Wood, R., 1988, <em>Adam Wodeham, Tractatus de indivisibilibus.\nIntroduction, translation, and notes</em> (Synthese Historical\nLibrary), Dordrecht: Kluwer, 1988.",
                "–––, 1989, “Crathorn versus Ockham,”\n<em>Franciscan Studies</em>, 49: 347–353.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLite\">Primary Literature</h3>\n<ul class=\"hanging\">\n<li><em>Quaestiones super librum sententiarum</em>, ed. F. Hoffmann in\n<em>Quästionen Zum ersten Sentenzenbuch</em>, Beiträge zur\nGeschichte der Philosophie und Theologie des Mittelalters, Band 29,\nAschendorff: Münster, 1988.</li>\n</ul>\n<h4>Translation</h4>\n<ul class=\"hanging\">\n<li>I <em>Sent</em>., q. 1, tr. R. Pasnau in Pasnau (ed.), <em>The\nCambridge Translations of Medieval Philosophical Texts</em>, Vol. III:\nMind and Knowledge, Cambridge: Cambridge University Press, 2003.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Alisade, H. F. X., 2014, “Wilhelm Crathorn OP”, in\n<em>Biographisch-bibliographisches Kirchenlexicon</em>, Bd. 35,\nNordhausen: Bautz, 1537–1543.</li>\n<li>Courtenay, W. J., 1978, <em>Adam Wodeham: An Introduction to His\nLife and Writings</em> (Studies in Medieval and Reformation Thought\n21), Leiden: E. J. Brill.</li>\n<li>Gelber, H. G., 1984, “I Cannot Tell a Lie: Hugh\nLawton’s Critique of Ockham on Mental Language,”\n<em>Franciscan Studies</em>, 44: 141–79.</li>\n<li>–––, 2004, <em>It Could Have Been Otherwise:\nContingency and Necessity in Dominican Theology, 1300–1350</em>,\nLeiden: E. J. Brill.</li>\n<li>Grellard, C. and A. Robert, 2009, <em>Atomism in Late Medieval\nPhilosophy and Theology</em>, Leiden-Boston: E.J. Brill.</li>\n<li>Hoffmann, F., 1971, “Der Satz als Zeichen der Theologischen\nAussage bei Holcot, Crathorn und Gregor von Rimini,” in <em>Der\nBergriff der Repraesentatio im Mittelalter</em>, <em>Miscellanea\nMedievalia</em>, 8: 296–313.</li>\n<li>–––, 1995, “Der Wandel in der\nScholastischen Argumentation vom 13 Zum 14 Jahrhundert aufgezeigt an\nzwei Beispielen: Robert Holcot und William (Johannes?)\nCrathorn,” in A. Speer (ed.), <em>Die Bibliotheca\nAmploniana</em>, <em>Miscellanea Medievalia</em>, 23:\n301–322.</li>\n<li>Kirjavainen, H., 2000, “Transcendental Elements in the\nSemantics of Crathorn,” in G. Holmström-Hintikka (ed.),\n<em>Medieval Philosophy and Modern Times</em>,\nDordrecht-Boston-London: Kluwer, pp. 45–58.</li>\n<li>Krauss, J., 1933, “Die Stellung des Oxforder\nDominikanerlehrers Crathorn zu Thomas von Aquin,”\n<em>Zeitschrift für Katholische Theologie</em>, 57:\n66–68.</li>\n<li>Murdoch, J. E., 1974, “Naissance et développement de\nl’atomisme au bas Moyen Âge latin,” in <em>La\nscience de la nature: théories et pratiques</em> (Cahiers\nd’Études Médiévales 2), Montréal:\nBellarmin, pp. 11–32.</li>\n<li>–––, 1982, “Infinity and\nContinuity,” in N. Kretzmann, A. Kenny and J. Pinborg (eds.),\n<em>The Cambridge History of Later Medieval Philosophy</em>,\nCambridge-New York: Cambridge University Press, pp.\n564–591.</li>\n<li>–––, 1984, “Atomism and Motion in the\nFourteenth Century,” in E. Mendelsohn (ed.), <em>Transformation\nand Tradition in the Sciences: Essays in Honor of I. B. Cohen</em>,\nCambridge-New York: Cambridge University Press, pp. 45–66.</li>\n<li>Panaccio, C., 1996, “Le langage mental en discussion:\n1320–1335,” <em>Les Études Philosophiques</em>, 3:\n323–39.</li>\n<li>Pasnau, R., 1997, <em>Theories of Cognition in the Later Middle\nAges</em>, Cambridge-New York: Cambridge University Press.</li>\n<li>Perler, D., 1997, “Crathorn on Mental Language,” in\nCostantino Marmo (ed.), <em>Vestigia, Imagines, Verba. Semiotics and\nlogic in medieval theological texts (XIIth–XIVth century). Acts of the\nXIth European Symposium on Medieval Logic and Semantics. San Marino,\n24–28 May 1994</em>, Turnhout: Brepols, pp. 337–54.</li>\n<li>Richter, V., 1972, “Handschriftliches zu Crathorn,”\n<em>Zeitschrift für Katholische Theologie</em>, 94:\n445–49.</li>\n<li>Robert, A., 2009a, “William Crathorn’s\nMereotopological Atomism”, in C. Grellard and A. Robert (eds.),\n<em>Atomism in Late Medieval Philosophy and Theology</em>,\nLeiden-Boston: E.J. Brill, pp. 127–162.</li>\n<li>–––, 2009b, “Les deux langages de la\npensée: à propos de quelques réflexions\nmédiévales”, in J. Biard (ed.), <em>Le langage\nmental du Moyen Âge à l’âge classique</em>,\nLouvain-la-Neuve: Peeters, pp. 145–168.</li>\n<li>–––, 2010a, “Atomisme et\ngéométrie à Oxford au XIVe siècle”,\nin S. Rommevaux (ed.), <em>Mathématiques et connaissance du\nréel avant Galilée</em>, Omniscience: Paris, pp.\n15–85.</li>\n<li>–––, 2010b, “William Crathorn on\nPredication and Mental Language”, <em>Analytica</em>, 14(2):\n227–258.</li>\n<li>–––, 2016, “Crathorn versus Ockham on\nCognition, Language, and Ontology,” in Christian Rode (ed.),\n<em>A Companion to Responses to Ockham</em>, Leiden-New York: E.J.\nBrill, pp. 47–78.</li>\n<li>Schepers, H., 1970, “Holkot contra dicta Crathorn: I.\nQuellenkritik und Biographische Auswertung der Bakkalareatsschriften\nzweier Oxforder Dominikaner des XIV Jahrunderts,”\n<em>Philosophisches Jahrbuch</em>, 77: 320–54.</li>\n<li>–––, 1972, “Holkot contra dicta Crathorn:\nII. Das significatum per propositionem. Aufbau und Kritik einer\nNominalistischen Theorie über den Gegenstand des Wissens,”\n<em>Philosophisches Jahrbuch</em>, 79: 106–136.</li>\n<li>Sprengard, K. A., 1968, “Crathorn. Ein Oxforder modernus des\nXIV. Jahrhunderts,” <em>Systematische-Historische Untersuchungen\nzur Philosophie des XIV Jahrhunderts</em> (Band 2), Bonn: Mainzer\nPhilosophische Forschungen.</li>\n<li>Tachau, K. H., 1987, “Wodeham, Crathorn, and Holcot: The\nDevelopment of the <em>complexe significabile</em>,” in L. M. de\nRijk and H. Braakhuis (eds.), <em>Logos and Pragma</em>, Nijmegen:\nIngenium Publishers, pp. 161–87.</li>\n<li>–––, 1988, <em>Vision and Certitude in the Age\nof Ockham</em>, Studien und Texte zur Geistesgeschichte des\nMittelalters, Leiden-New York-København-Köln: E. J.\nBrill.</li>\n<li>Wood, R., 1988, <em>Adam Wodeham, Tractatus de indivisibilibus.\nIntroduction, translation, and notes</em> (Synthese Historical\nLibrary), Dordrecht: Kluwer, 1988.</li>\n<li>–––, 1989, “Crathorn versus Ockham,”\n<em>Franciscan Studies</em>, 49: 347–353.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle",
            "atomism: ancient",
            "Bacon, Roger",
            "Buridan, John [Jean]",
            "Chatton, Walter",
            "Holkot [Holcot], Robert",
            "Ockham [Occam], William"
        ],
        "entry_link": [
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../atomism-ancient/": "atomism: ancient"
            },
            {
                "../roger-bacon/": "Bacon, Roger"
            },
            {
                "../buridan/": "Buridan, John [Jean]"
            },
            {
                "../walter-chatton/": "Chatton, Walter"
            },
            {
                "../holkot/": "Holkot [Holcot], Robert"
            },
            {
                "../ockham/": "Ockham [Occam], William"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=crathorn\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/crathorn/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=crathorn&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/crathorn/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=crathorn": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/crathorn/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=crathorn&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/crathorn/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}