{
    "url": "deductivism-mathematics",
    "title": "Deductivism in the Philosophy of Mathematics",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Alexander Paseau\n<alexander.paseau@philosophy.ox.ac.uk>\nFabian Pregel\n<fabian.pregel@gmail.com>",
        "author_links": [
            {
                "http://www.acpaseau.com/": "Alexander Paseau"
            },
            {
                "mailto:alexander%2epaseau%40philosophy%2eox%2eac%2euk": "alexander.paseau@philosophy.ox.ac.uk"
            },
            {
                "mailto:fabian%2epregel%40gmail%2ecom": "fabian.pregel@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://www.acpaseau.com/\" target=\"other\">Alexander Paseau</a>\n&lt;<a href=\"mailto:alexander%2epaseau%40philosophy%2eox%2eac%2euk\"><em>alexander<abbr title=\" dot \">.</abbr>paseau<abbr title=\" at \">@</abbr>philosophy<abbr title=\" dot \">.</abbr>ox<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;<br/>\nFabian Pregel\n&lt;<a href=\"mailto:fabian%2epregel%40gmail%2ecom\"><em>fabian<abbr title=\" dot \">.</abbr>pregel<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 25, 2023"
    ],
    "preamble": "\n\nDeductivism says that a mathematical sentence \\(s\\) should be\nunderstood as expressing the claim that \\(s\\) deductively follows from\nappropriate axioms. For instance, deductivists might construe\n“\\(2 + 2 = 4\\)” as “the sentence ‘\\(2 + 2 =\n4\\)’ deductively follows from the axioms of arithmetic”.\nDeductivism promises a number of benefits. It captures the fairly\ncommon idea that mathematics is about “what can be deduced from\nthe axioms”; it avoids an ontology of abstract mathematical\nobjects; and it maintains that our access to mathematical truths\nrequires nothing beyond our ability to make logical deductions.\nSections 1 and 2 define and motivate deductivism in more detail.\nSection 3 covers four authors (Russell, Hilbert, Pasch, Curry) who\nhave endorsed deductivism at some point. Section 4 aims to clarify\nwhat semantic claim deductivists make. Sections 5–9 review\nobjections to deductivism and possible replies.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#Moti": "2. Motivation"
        },
        {
            "#HistAcco": "3. Historical Accounts"
        },
        {
            "#Russ": "3.1 Russell"
        },
        {
            "#Hilb": "3.2 Hilbert"
        },
        {
            "#Pasc": "3.3 Pasch"
        },
        {
            "#Curr": "3.4 Curry"
        },
        {
            "#IntuBrou": "3.5 Intuitionism and Brouwer"
        },
        {
            "#MeanMatt": "4. Meaning Matters"
        },
        {
            "#ProvReifNotReif": "5. Provability: to reify or not to reify? "
        },
        {
            "#UnaxMath": "6. Unaxiomatic Mathematics"
        },
        {
            "#Regr": "7. A Regress?"
        },
        {
            "#Appl": "8. Applications"
        },
        {
            "#TrutComp": "9. Truth-Completeness"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nDeductivism is a philosophy of mathematics that was popular in the\nlate nineteenth and early twentieth century. It understands a\nmathematical sentence \\(s\\) as expressing the claim that \\(s\\)\ndeductively follows from appropriate axioms. For instance,\ndeductivists might construe “\\(2 + 2 = 4\\)” as\n\n\nthe sentence “\\(2 + 2 = 4\\)” deductively follows from the\naxioms of arithmetic,\n\n\nor “2 is prime” as\n\n\nthe sentence “2 is prime” deductively follows from the\naxioms of arithmetic,\n\n\nor, for a non-arithmetical example, “every group \\(G\\) has\nexactly one identity element” as\n\n\nthe sentence “every group \\(G\\) has exactly one identity\nelement” deductively follows from the axioms of group\ntheory.\n\n\nDeductivists thus reject the surface syntax of mathematics. They do\nnot take “2 is prime” to attribute a property (primeness)\nto an entity (the number 2); for them, it states that the sentence\n“2 is prime” follows from some axioms.\n\nThis entry will assess deductivism’s strengths and weaknesses,\ndiscuss its turn-of-the-twentieth-century heyday, and compare it to\ncontemporary versions of structuralism.\n2. Motivation\n\nDeductivism is interesting and important for a host of reasons. The\nfirst is that it gives proof, indisputably of paramount importance in\nmathematics, pride of place. Mathematicians take a result to be\nestablished only if it has been proved. It is natural to explore what\nhappens if we take this one step further and take mathematical truth\nto be, not just established, but constituted, by the\nexistence of a (possibly not yet known) proof.\n\nSecond, many mathematicians profess to believe in deductivism or\nsomething like it (Maddy 2022: 9). Ask mathematicians what their\nsubject is about and at least some will reply that it is about\n“what can be deduced from the axioms”. Naturally, a slogan\nlike this is not a worked-out philosophy, and is more often\nencountered in conversation than in print. Still, if the slogan and\nthe sentiment behind it point to any specific philosophy, surely it is\nto deductivism. Moreover, most parts of mathematics are explicitly\nunderstood as exploring consequences of stipulated\n axioms,[1]\n which deductivism spells out in its own way and generalises to all\nmathematics. Not only that, but as\n §3\n will briefly document, many influential philosophers of mathematics\nfrom the late nineteenth to the early twentieth century were, or could\nbe interpreted as, deductivists.\n\nThird, and this might go some way towards explaining the second point,\ndeductivism is seen as philosophically “clean” (Rheinwald\n1984: 49) or a way to “avoid philosophical quicksand”\n(Maddy 2022: 9). On the epistemological side, the deductivist’s\nmain task is to account for the epistemology of deductive\nlogic—there is no further specific problem of mathematical\nepistemology. On the metaphysical side, the deductivist construal\nappears not to presuppose any abstract mathematical objects, often\nseen as problematic. A further point in deductivism’s favour is\nthat it respects the presumed objectivity of mathematics, because what\nfollows from the axioms is an objective matter, independent of us.\nMoreover, deductivism seems to offer a promising account of\napplications: whenever you find a physical system that satisfies the\naxioms of a particular branch of mathematics, the branch’s\ntheorems must apply to the system. (We shall return to these alleged\nattractions below.)\n\nThe fourth and final reason is that deductivism and structuralism are\nrelated. Indeed, deductivism is seen by some (e.g., Bostock 2009: 183)\nas a syntactic version of eliminative structuralism. And\nstructuralism, in its various guises, and its various problems\nnotwithstanding, is one of the most attractive metaphysics of\nmathematics on the market\n today.[2]\n\nDeductivism and eliminative structuralism share some general features.\nRoughly speaking, both understand a mathematical claim \\(p\\) as\n“the axioms imply that \\(p\\)” (where “the\naxioms” may be understood as those of the germane branch of\nmathematics or otherwise—for different versions of deductivism,\nsee\n §4).\n Deductivism understands the relevant implication deductively,\neliminative structuralism semantically. For deductivists, the relevant\nnotion of implication or consequence is the syntactic one which in\nlogic is denoted by “\\(\\vdash\\)”; to say that \\(\\Gamma\n\\vdash \\delta\\) is to say that the sentence \\(\\delta\\) is derivable\nfrom \\(\\Gamma\\) in some specified deductive system. For eliminative\nstructuralists, the relevant notion of implication or consequence is\ninstead the semantic one which in logic is denoted by\n“\\(\\vDash\\)”. Eliminative structuralists, for example,\nconstrue “\\(2 + 2 = 4\\)” as a claim about what holds in\nany structure in which the axioms of arithmetic are\n satisfied.[3]\n\nWhen we dig down into the details, however, some clear differences\nemerge. Deductivists take mathematical claims to be about sentences,\nwhereas eliminative structuralists take them to be generalisations\nover structures. Unlike deductivists, eliminative structuralists\ntherefore owe us an account of the metaphysics of structures.\nEliminative structuralists also usually couple their account with the\nexistential assertion that a structure of the right kind exists (or\ncould exist), whereas deductivists often omit the corresponding claim\nthat the axioms are consistent. One well-known version of eliminative\nstructuralism, first articulated by Putnam (1967b) and developed by\nHellman (1989), is modal, whereas deductivism is usually not modal.\n(Although see\n §5\n for how to spell out deductivism in terms of a primitive modal\noperator.) Finally, eliminative structuralism is but one of the many\nforms of structuralism around today. Some, such as Hellman’s\nversion, have much in common with the eliminative variety closest to\ndeductivism; others, such as Shapiro’s ante rem structuralism\n(Shapiro 1997), less so.\n\nStill, despite these differences, there are some clear historical and\nphilosophical continuities between the two, so that getting clear\nabout deductivism’s flaws can help us better appreciate the\nvirtues of a broadly structuralist approach. What is certainly true is\nthat prior to Gödel’s 1929 Completeness Theorem for\nfirst-order logic (published as a paper the following year), the\ndifferences between deductivism and eliminative structuralism were not\nclearly understood. This point will be illustrated in the historical\n §3.\n Also relevant to the story is Gödel’s 1931 First\nIncompleteness Theorem, which will form the basis of a key objection\nto deductivism in\n §9.[4]\n\nA final point of connection is that, when the background logic is\naxiomatizable, eliminative structuralism and deductivism offer an\nextensionally equivalent account of mathematical\n truth.[5]\n The simple reason is that, for an axiomatizable logic, such as\nfirst-order logic, semantic implication is extensionally equivalent to\ndeductive inference. So suppose you are tempted by eliminative\nstructuralism in the philosophy of mathematics and use first-order\nlogic as your default\n logic.[6]\n You will then take \\(p\\) to be a mathematical truth exactly when a\n(first-order) deductivist does. Avoiding a “lapse into a\nsemantic equivalent of deductivism” was precisely one of the\nreasons Hellman chose a second-order framework for his modal version\nof eliminative structuralism (Hellman 1989: 18–19). As\nexplained, however, eliminative structuralism and deductivism are not\nequivalent in any stronger sense than this extensional one, even when\ntheir shared background logic is axiomatisable.\n\nA terminological note: deductivism is sometimes called\n“if-thenism”. However, “if-thenism” sounds\nmore like the genus whose syntactic and semantic species are\ndeductivism and eliminative structuralism respectively. Rheinwald\n(1984: 49) uses the name “implicationism” for the genus,\nreserving “syntactic implicationism” for deductivism and\n“semantic implicationism” for structuralism. This\nterminology manages to cover both genus and species and also has the\ngreat merit of transparency. The present entry sticks to\n“deductivism” and “structuralism” for the two\nspecies, because these names are the more usual ones today (and are\nshorter).\n3. Historical Accounts\n\nThis section covers four historical accounts of deductivism, advocated\nby Russell\n (§3.1),\n Hilbert\n (§3.2),\n Pasch\n (§3.3),\n and Curry\n (§3.4)\n respectively. The first three are pre-Gödelian; the fourth is a\npost-Gödelian attempt to defend deductivism.\n\nAttributing deductivism to older authors is harder than it may\ninitially appear, and the existing literature offers no attempts to do\nso in a comparative way. The difficulty is owed to several conflating\nfactors. The main one is that, before Gödel, there was no clear\ndistinction between semantic and syntactic consequence. And\nterminological confusion does not help: Curry, for example, refers to\nhis deductivism as “formalism”, a label usually reserved\nfor a different position. This article thus focuses on classifying\nauthors’ substantive claims. A comparison with Brouwer\n (§3.5),\n who emphasised proof in mathematics but was no deductivist, will also\nbe relevant.\n3.1 Russell\n\nRussell’s The Principles of Mathematics was published\nin 1903. The book’s very first sentence contains Russell’s\ncredo about what mathematics is:\n\n\nPure mathematics is the class of all propositions of the form\n“\\(p\\) implies \\(q\\)”, where \\(p\\) and \\(q\\) are\npropositions containing one or more variables, the same in the two\npropositions, and neither \\(p\\) nor \\(q\\) contains any constants\nexcept logical constants (Russell 1903 [2009: 3]).\n\n\nIt may seem odd that the propositions \\(p\\) and \\(q\\) are supposed to\ncontain at least one variable. Yet, according to Russell, even\n“\\(1+1=2\\)” contains variables once made fully\nexplicit—namely “If \\(x\\) is one and \\(y\\) is one, and\n\\(x\\) differs from \\(y\\), then \\(x\\) and \\(y\\) are two” (Russell\n1903 [2009: 6]).\n\nIs Russell’s credo a form of deductivism or structuralism, or\nsome admixture of the two? At the turn of the twentieth century, no\none clearly distinguished semantics and syntax, and Russell was no\nexception. This led Putnam to claim that what Russell really had in\nmind was, in our terminology, eliminative structuralism. (Putnam\nchristened the structuralism he attributed to Russell\n“if-thenism”; as explained in\n §2,\n this entry avoids the term.) He urged:\n\n\nWhat he meant was not, of course, that all well formed formulas in\nmathematics have a horseshoe as the main connective! but that\nmathematicians are in the business of showing that if there\nis any structure which satisfies such-and-such axioms (e.g., the\naxioms of group theory), then that structure satisfies\nsuch-and-such further statements (some theorems of group theory or\nother) (Putnam 1967a [1975: 20]).\n\n\nHowever, Putnam’s structuralist interpretation of Russell is\ncontroversial, not least because a structuralist reading appears to\nexplicitly contradict the deductivist wording of several passages\n(Kraal 2014: 1498). For example, with pure mathematics defined in the\nabove way, Russell went on to assert that\n\n\n[b]y the help of ten principles of deduction and ten other premisses\nof a general logical nature (e.g., “implication is a\nrelation”), all mathematics can be strictly and formally\ndeduced; and all the entities that occur in mathematics can be defined\nin terms of those that occur in the above twenty premisses (Russell\n1903 [2009: 3]).\n\n\nThe emphasis here is clearly on deduction.\n\nTo prove the above deducibility claim is the stated objective of\nThe Principles of Mathematics (Russell 1903 [2009: xiii]).\nAnd like everyone else at the time, Russell tended to assume that\nlogical implication is a deductive relation. Thus, even if it was not\nhis intention to differentiate semantics and syntax sharply, as he\nhistorically was not in a position to do, his credo combined with the\nequation of logical with deductive implication committed him to\ndeductivism. Hence The Principles’ key doctrine is more\nplausibly construed as a version of deductivism than eliminative\n structuralism.[7]\n3.2 Hilbert\n\nOther contemporaries of Russell’s also displayed deductivist\nleanings. Resnik classified Hilbert’s work of around 1900 as a\n“deductivist period” (1980: 105). However, Hilbert at the\ntime endorsed what can now be separated out as deductivism on the one\nhand and some form of proto-structuralism on the other. He made no\ndistinction between the two, as we would today, because he assumed\ncomplete axiomatisations and proof systems were available.\n\nConsider Hilbert’s 1900 “About the Concept of\nNumber”. In the introduction, Hilbert declares that he intends\nto apply the axiomatic method, known from geometry, to the concept of\nnumber (1900a: 181). He contrasts the axiomatic method with the ad\nhoc approach usually found in the literature of the time. The\npurpose of his axiomatic approach is to achieve the “final\npresentation and logical certainty of the content of our\nunderstanding” (ibid). He begins by setting out eighteen axioms\nfor the real numbers. To give a flavour, the first axiom is\n\n\nFrom the number \\(a\\) and the number \\(b\\) results through\n“addition” a specific number \\(c\\), formally: \\(a + b =\nc\\) or \\(c = a + b\\). (1900a: 18)\n\n\nHilbert then asserts that propositions about the real numbers are only\nvalid (gültig) if they can be proven from the set of\naxioms in a finite number of steps (1900a: 184).\n\nThe reason for this insistence is explained in his famous lecture to\nthe International Congress of Mathematicians in Paris in the same year\n(published as “Mathematical Problems”). Here Hilbert\nexpresses the “absolute conviction” that any mathematical\nproblem, no matter how difficult, must be solvable “through a\nfinite number of purely logical steps” (1900b: 261). He\nmaintains that this conviction is shared by all mathematicians and is\na major source of motivation; but he also notes that we have no proof\nthat the finite-derivability claim is true (1900b: 262). Despite the\nabsence of such a proof, he takes this conviction to be the natural\nmodus operandi of the working mathematician. In\n“Mathematical Problems”, Hilbert also maintains that, to\nthe extent that new concepts are introduced in mathematics—say,\ndue to their usefulness in scientific explanations—those\nconcepts need to be axiomatized to make them useful for deduction:\n\n\n[Their introduction] gives birth to the task for mathematics to\nresearch the principles associated with the new concept and then to\nfix them in a simple and complete axiom system in such a way that the\nnew concepts and their usability for deduction is in no way\ninferior to the old arithmetical concepts. (1900b: 259, our\ntranslation and emphasis)\n\n\nAt the same time as emphasising the importance of a deductive\nframework, Hilbert endorsed proto-structuralist ideas. He mentions\n“thinking of a system of objects”, saying we “call\nthose objects numbers” and “denote them with a,\nb, c” (1900a: 181). In his correspondence with\nFrege one year earlier, for example, Hilbert noted that\n\n\nE.g., instead of points, think of a system of love, law, chimney-sweep\n… which satisfies all axioms; then Pythagoras’ theorem\nalso applies to these things. Any theory can always be applied to\ninfinitely many systems of basic elements. (Letter from 29 Dec 1899,\nFrege 1976 [1980: 42])\n\n\nHilbert moved fluidly between both deductivism and proto-structuralism\nby relying on the completeness assumption. For example, in his letter\nto Frege dated 29 December 1899, he stated that if the axioms in an\naxiom system do not contradict one another,\n\n\nthen they are true, and the things defined by the axioms exist. This\nfor me is the criterion of truth and existence. (Letter from 29 Dec\n1899, Frege 1976 [1980: 42])\n\n\nNote that Hilbert does not maintain that the axioms are true if they\nhave a model—consistency and model-existence are equivalent only\nif the axiom system is complete.\n\nHilbert at the time, then, was firmly committed to two views. Both\nunderstand mathematical claims as true in virtue of implication from\naxioms. One is that mathematical validity amounts to mathematical\nprovability with a finite number of steps from a finite number of\naxioms. The second is that mathematics is not about specific objects\nbut that mathematical truth (in a particular domain) is defined by the\naxioms.\n\nWe can also observe differences between Russell’s and\nHilbert’s varieties of deductivism. By asserting that\n\n\nall the entities that occur in mathematics can be defined in terms of\nthose that occur in the above twenty premisses,\n\n\nRussell closely links deductivism to the claim that any non-logical\nvocabulary in axioms and theorems is ultimately eliminable (1903\n[2009: xliii]). Thus Russell combines deductivism with a core tenet of\nlogicism, namely that non-logical terms be definable by logical\nones.\n\nFor the turn-of-the-century Hilbert by contrast, numerals and other\nnon-logical terms (as we could call them) in our deductions remain\nprimitive. But although not eliminable, they are generic. Hilbert asks\nus to imagine “a system of things, which we will call\nnumbers” (Hilbert 1900a: 181). The axioms then provide a\n“precise and complete description of numbers”\n“mutual relations” (Hilbert 1900a: 181). For as he\nmemorably put it, “one must be able to say at all\ntimes—instead of points, straight lines, and\nplanes—tables, chairs and beer mugs” (Kennedy 1972: 133).\nHere Hilbert’s stance effectively derives from Pasch. Pasch had\ncalled his method “a formalism” and maintained that\nmathematical proofs must remain valid if the basic concepts are\nreplaced throughout “by any concepts or by meaningless\nsigns” (Schlimm 2010: 103).\n3.3 Pasch\n\nThis brings us to Moritz Pasch himself, another contemporary of\nRussell and Hilbert’s who defended a flavour of deductivism.\nPasch is best known for his axiomatisation of geometry in his 1882\nVorlesungen über neuere Geometrie. A key passage found\nin the 1882 first edition and, with minimal changes, also in the 1926\nsecond edition, reads as follows:\n\n\nIndeed, if geometry is to be truly deductive [deduktiv],\ndeduction [Deduktion] must be independent everywhere from the\nmeaning of the geometric terms, just as it must be independent of\ndiagrams; only the relations between the geometric terms specified in\nthe utilised theorems and definitions may be considered. During\nthe deduction [Deduktion] it is permitted and useful, but in\nno way necessary, to think of the meanings of the geometric\nterms; in fact, if it is necessary to do so, this makes plain the\ngaps in the deduction, and under certain circumstances even\nthe inadequacy of the theorems invoked in the proof (1882/1926, our\ntranslation and\n emphasis).[8]\n\n\nThis passage does two things: it maintains that the meaning of\ngeometrical terms has no role to play in geometry at its most\nrigorous; and it emphasises proof. So it can be seen as advocating\ndeductivism or, possibly, formalism. “Formalism” here\nmeans what is sometimes called “game formalism”, i.e., the\nthesis that mathematics is a mere play with symbols according to\ndefined rules. However, other passages in Pasch’s corpus favour\na deductivist interpretation:\n\n\nMathematics is a system with two parts that must be clearly\ndistinguished. The first, the properly mathematical part, is\ndevoted entirely to deduction. The second makes deduction\npossible by introducing and elucidating a series of insights\nthat are to serve as material for deduction, preparing new material\nwhenever the deductive part requires it. This second part, dwarfed by\nthe properly mathematical one, can be called the pre-mathematical\npart, while I might refer to the other as the rigid part,\nsince it forms a structure characterized by the absolute rigor of\nits inference rules. Though it is tempting to ignore how rigorous\nthese rules are, that does not make them any less rigorous. The\nrigid part is, as I said, mathematics proper. It proceeds by\nmathematical proof and mathematical definition. (Pasch 1918\n[2010: 51], our emphasis)\n\n\nPasch thus distinguished between mathematics and what we may call\n“pre-mathematics”. Mathematics is entirely deductive,\nwhereas pre-mathematics serves to motivate the “material for\ndeduction”. Mathematics “dwarfs” pre-mathematics and\nis characterised by “absolute rigor of its inference\nrules”, which is why Pasch calls it “rigid”\n(starr). In light of the above passages, and others, Pasch\nmay reasonably be classified as a deductivist.\n\nPasch takes a notably different view from Hilbert as to what, among\nall the possible sets of axioms a deductivist could adopt,\ncharacterises a “good” set of axioms. Hilbert’s\nresponse to this question foreshadows his future formalism. In\n“About the Concept of Number”, he maintains that, once the\nset of axioms has been proven to be consistent, any further doubt\nabout the existence of the concept number “loses all\njustification” (Hilbert 1900a: 184). Classically, consistency is\na necessary condition for a good axiom set, so all forms of\nclassical-logic-based deductivism will adopt it. But whether or not\nconsistency is also sufficient is a matter over which various\ndeductivisms may differ. From a modern perspective, we can think about\nthe sufficiency claim as follows: absent a completeness proof, the\nconsistency of a set of axioms does not in general entail that they\nhave a model. To spell out the familiar argument, let PA2 be the set\nof second-order Peano Axioms, and Con(PA2) a consistency statement for\nPA2. Then \\(\\textrm{PA2} \\cup \\{\\neg \\textrm{Con}(\\textrm{PA2})\\}\\) is\nconsistent provided PA2 is, since \\(\\textrm{PA2} \\not\\vdash\n\\textrm{Con}(\\textrm{PA2})\\) by Gödel’s second\nincompleteness theorem. However, \\(\\textrm{PA2} \\cup\n\\{\\neg\\textrm{Con}(\\textrm{PA}2)\\}\\) lacks a model, and so, under a\ntraditional language-world picture, the language of the axiom system\ndoes not pick out anything in the world. But for a deductivist who\nasserts that only consistency matters, the alleged absence of\nsuccessful reference is of no significance.\n\nWhat distinguishes Pasch’s deductivism from Hilbert’s is\nthat Pasch simultaneously maintained an empiricism about the axioms\n(Schlimm 2010: 95–96). He held that the axioms are to have\nindependent empirical grounding (“the pre-mathematical\npart” above). For example, Pasch grants the possibility of other\nconsistent axiom sets for geometry, but maintains that without\nempirical grounding such a system constitutes merely\n“hypothetical geometry” (1917 [2010: 46]). In particular,\nPasch maintains, the hypothetical sentences derived in such a geometry\nmay lack applicability (1917 [2010: 46]; Schlimm 2010: 101).\n3.4 Curry\n\nA more recent version of deductivism was defended by Haskell Curry in\nhis 1951 Outlines of a Formalist Philosophy of Mathematics.\nAs he sees it, “mathematics is the science of formal\nsystems” (1951: 56). For Curry, formal systems are to be\nunderstood deductively—they are comprised of a formal language,\naxioms and inference rules called “rules of procedure”\n(1951: 11–13). Writing after the discovery of incompleteness,\nCurry has this to say about its implications:\n\n\nThe incompleteness theorems […] show that it is hopeless to\nfind a single formal system which will include all of mathematics as\nordinarily understood. Moreover the arbitrary nature of the\ndefinitions which can constitute the primitive frame of a formal\nsystem shows that, in principle at least, all formal systems stand on\na par. The essence of mathematics lies, therefore, not in any\nparticular kind of formal system, but in formal structure as such.\n(Curry 1951: 56)\n\n\nCurry calls his conception formalist. But by formalism, Curry\njust means the science of what can be deduced in formal systems.\nFormalism and deductivism (as understood in this entry) are similar in\ntheir focus on syntax over semantics. However, deductivism holds that\nmathematical claims have truth-conditions, unlike games; and it\nregards only logical inferences as permissible, whereas a formalist\ncan in principle condone any symbol-derivation practice. In line with\nthe deductivist rather than the formalist interpretation, Curry uses\nthe notion of truth extensively in his writings and rejects the view\nthat formal systems are to be conceived of as a game:\n\n\nThere must be an objective criterion of truth, and the first\ntask of the mathematical logician is to find it. The first thesis of\nthis book is that such a definition can be found. (1951: 3)\n\nBefore we proceed to the discussion of the formalist definition of\nmathematics, it will be necessary to consider the definition of its\nfundamental notion, that of a formal system. […] The conception\nhere expounded differs superficially from the usual one in that\nsuch a system is conceived not as a game but as a body of\npropositions. […] The first point is that the words\n“proposition”, “true”,\n“predicate”, etc., used in the following, are intended in\nthe sense of ordinary discourse. […] [A proposition] indicates\ncertain conditions for verification; when the proposition is\nasserted—taken as true —, that means that these conditions\nare fulfilled, so that processes of verification are what determine,\nessentially, the meaning of the proposition. (1951: 8)\n\nFor the purposes of mathematics it is sufficient to have criteria for\nrecognising a formal system as such, and for deciding which\npropositions are true. (1951: 31)\n\n\nOne of the main advantages of this perspective, according to Curry, is\nthe absence of metaphysical speculation—a key motivation for\ndeductivism (see\n §2):\n\n\nThe formalist conception of mathematics is thus free from\nmetaphysical bias, and is therefore compatible with practically\nany sort of philosophy. It is the only conception so far proposed\nwhich has that character. (1951: 58; our emphasis)\n\n3.5 Intuitionism and Brouwer\n\nIntuitionism is sometimes spoken of in the same breath as deductivism.\nCurry, for example, maintains that\n\n\nIndeed, if we subtract from intuitionism its metaphysics, the\ndifferences between it and formalism as to the definition of\nmathematical truth are superficial. The emphasis on constructive\nmethods—Hilbert’s “finite\nEinstellung”—on recursive definitions and mathematical\ninduction, are made by formalist and intuitionist alike. (1951:\n58)\n\n\nBrouwer’s intuitionism is related to deductivism but differs\nfrom it in an interesting way. What, briefly, are the similarities and\ndifferences?\n\nIn his Cambridge lectures, Brouwer rejects “mathematical\ncreation by means of logical axioms” (1981: 7). Indeed, for him,\n“all axioms became illusory” (1981: 92). Brouwer’s\ntarget here is what he calls the “Old Formalist School”,\nwhich for him includes Dedekind, Peano, Russell and Hilbert, and from\nwhich he goes to lengths to distance himself. For Brouwer, “the\ncriterion of truth or falsehood of a mathematical assertion” is\nnot a deduction but “mathematical activity itself”\n(Brouwer 1981: 92). The relevant activity is the process of providing\na construction. Thus, for the intuitionist, truth and falsehood are\nreplaced with, or cashed out as, the existence or absence of an\nintuitionistically acceptable construction (Brouwer 1981: 92).\n\nConstructions are a series of mental acts; they are thus distinct from\nproofs which are sequences of appropriately linked sentences. For\nBrouwer, the first act of intuitionism is to completely\nseparate “mathematics from mathematical language and hence from\nthe phenomena of language described by theoretical logic” (1981:\n4). For Brouwer, no linguistic inscription or utterance can convey the\ntrue nature of a construction in intuition. The severance of\nmathematics from language and logic, a cornerstone of Brouwer’s\nintuitionism, sharply distinguishes it from deductivism.\n\nThat said, intuitionism does have some parallels with deductivism. A\nnotable one is the replacement of the usual referential account of\ntruth in mathematics with a verification-based approach: deductivism\ndoes this in terms of proofs, intuitionism in terms of constructions.\nThe development of intuitionistic logic brings out an important fact\nabout deductivism: deductivism is not tied to any particular formal\nsystem. It could be based on classical logic, or Heyting’s\nintuitionist formal system, or some third\n alternative.[9]\n4. Meaning Matters\n\nWe outlined some of the historical support for deductivism in\n §3.\n In\n §§5–9,\n we consider some of the challenges it faces. In the present section,\nwe aim to achieve greater clarity on what semantic claim the\ndeductivist makes.\n\nThe first point is that we have characterised deductivism as\n“understanding” or “construing” or\n“rendering” a mathematical sentence \\(p\\) as “\\(Ax\n\\vdash p\\)” This characterisation is deliberately neutral\nbetween two more precise readings. One is that deductivists take their\nconstrual to capture the meanings of mathematical statements as\nordinarily\n spoken.[10]\n The other is that they aim to do no such thing but wish instead to\nprovide a reconstruction of mathematics answering to philosophical\ncriteria. One such criterion might be proximity to\nmathematical discourse as ordinarily understood—but typically\nthis will not be an overriding factor. Other criteria will include\ngiving an attractive metaphysics, epistemology and account of the\napplications of mathematics. This entry will stay neutral on this\npoint, though it should be noted that the first approach faces a\nconsiderable burden of proof: there are no obvious grounds to think\nthat we actually speak in deductivist fashion.\n\nThe second point is that the deductivist has to offer more than the\nsimple claim that a mathematical sentence \\(p\\) should be construed as\n“\\(Ax \\vdash p\\)”. For one thing, her (meaning-capturing\nor reconstructive) semantics for mathematics cannot be confined to the\nsentence level but must also apply to words. The deductivist must, for\ninstance, give a semantic account of the numeral “2” and\nthe predicate “is prime” compatible with her construal of\n“2 is prime” as “\\(Ax \\vdash 2\\) is\nprime”.\n\nFor another, she must give an account of speech acts involving\nmathematical statements. It is natural to suppose that she construes\nan assertion of “569 is prime”, say, as an assertion of\n“\\(Ax \\vdash 569\\) is prime”. Likewise, presumably, for\nmany propositional attitudes: for the deductivist, what we might\nordinarily describe as wondering whether 569 is prime should be\nunderstood as wondering whether the axioms deductively imply that 569\nis prime; what we might ordinarily describe as doubting that 569 is\nprime should be understood as doubting that the axioms deductively\nimply that 569 is prime; and so on. A tentative suggestion might then\nbe that the deductivist should take “\\(Ax \\vdash\\)” to\nhave narrow scope over force operators (asserting, wondering,\ndoubting, etc.).\n\nNeither of these tasks—providing a word-level semantics for\nmathematical language and an account of speech acts involving\nmathematical sentences—seems entirely straightforward. As for\nthe first, deductivists’ account of mathematical language must\nallow for its use in empirical contexts to make straightforwardly\nliteral claims. For example, “there were 569 people in the\naudience” should presumably not be understood as a covert\nimplication from axioms but rather as a literal claim about a physical\nsituation. For the deductivist, then, this is quite a different use of\n“569” from a purely mathematical one.\n §8\n discusses the problem of applications for the deductivist (though at\nthe sentence- rather than word-level).\n\nAs for the second, it’s not clear that the deductivist will\nalways wish to apply the “\\(Ax \\vdash\\)\n”-takes-narrow-scope strategy in the same mechanical way. Take\nfor example proof by assumption, in which we first assume \\(p_1\\) and\ndeduce \\(p_n\\) via \\(p_2 , \\ldots , p_{n-1}\\). Our initial supposition\n\\(p_1\\) might be that \\(m\\) is an odd perfect number and the final\nline \\(p_n\\) might be some interesting fact about any such \\(m\\).\nIt’s not at all obvious that “assume” here takes\nwide scope and “\\(Ax \\vdash\\) ” takes narrow scope. For if\nit did, “Assume \\(p_1\\)” would be construed as\n“Assume \\(Ax \\vdash p_1\\)”, which intuitively is a\ndifferent claim. A more technical way of seeing this is that because\n\\(m\\) does not occur free in \\(Ax\\), it seems that we can generalise\nto obtain “\\(Ax \\vdash \\forall m p_1\\)”. If so,\n“Assume that \\(Ax\\) proves that \\(m\\) is an odd perfect\nnumber” implies “Assume that \\(Ax\\) proves that for every\n\\(m, m\\) is an odd perfect number”. But that latter assumption\nis an outright false claim. A more promising approach is to take the\nfirst step in a supposition as allowing us to add \\(p_1\\) to the axiom\nset, and to then construe the second line as “\\(Ax + p_1 \\vdash\np_2\\)” (or its equivalent via the Deduction Theorem “\\(Ax\n\\vdash p_1 \\rightarrow p_2\\)”), the third line as “\\(Ax +\np_1 \\vdash p_3\\)” (or “\\(Ax \\vdash p_1 \\rightarrow\np_3\\)”), and so on. All in all, there is work for the\ndeductivist to do on this front to spell out these ideas into a\ncoherent theory.\n\nA third point is based on Parsons’s (2008: 55 n. 35) distinction\nbetween what might be called reflexive and\nunreflexive deductivism. Deductivism as this entry defined it\nis reflexive, because it interprets \\(p\\) as “\\(Ax \\vdash\np\\)”. Unreflexive deductivism, by contrast, interprets \\(p\\) as\n“if \\(\\wedge Ax\\) then \\(p\\)” (\\(\\wedge\\) is an operator\nthat conjoins all the elements of the axiom set) and asserts that this\nconditional is a deductive logical truth. Rheinwald (1984: 50) opts\nfor the former, reflexive form, as we have. Commenting on Rheinwald,\nParsons advocates adopting the latter, unreflexive, form instead. For,\nas he sees it, the reflexive form introduces an inessential element of\nreflection—explicit mention of the axioms—into the content\nof mathematical statements, which he thinks they lack. Parsons has a\npoint, especially if deductivism is intended as meaning-capturing.\nEven so, this entry takes deductivism to be reflexive to avoid the\nproblem faced by unreflexive deductivism when the set of axioms is\ninfinite, as it is for example in the case of the first-order Peano\nAxioms. For in that case, the sentence “if \\(\\wedge Ax\\) then\n\\(p\\)” is infinitely long, so not an ordinary-language one. In\ncontrast, “\\(Ax \\vdash p\\)” is an ordinary sentence of\n(mathematical) English, where “\\(Ax\\)” is a name denoting\nthe relevant axiom set. That said, it may be that unreflexive\ndeductivism is better equipped to handle some of the problems\ndeductivism faces.\n\nA fourth and final point. So far, this entry remained neutral on what\nthe axioms “\\(Ax\\)” in the statement of deductivism are. A\n“local” deductivist, as illustrated in\n §1,\n deductively conditionalises the theorems of a branch of mathematics\non the branch’s axioms, e.g., theorems of arithmetic on the\naxioms of Peano Arithmetic. Another sort of deductivism might\nconditionalise on the axioms of a particular alleged foundation for\nmathematics, say ZFC set theory. Thus a ZFC-deductivist understands a\nmathematical claim \\(p\\) as “\\(p\\) follows deductively from the\nZFC axioms”. The choice of ZFC is not essential: if the\ndeductivist’s preferred foundation is not ZFC, but some other\nset theory, or a topos theory, or something else altogether, they\ncould base their deductivism on that instead. A third, similar but\nlooser form of deductivism than this might be called\n“whatever-it-takes deductivism”. On this view, the axioms\nprovability from which constitutes mathematical truth are not a\nspecific collection, such as the ZFC axioms, but are more vaguely\ndescribed: they are whatever axioms it takes to prove the theorems of\nmathematics. This last version has the advantage over the second of\nnot tying provability, perhaps artificially, to a single foundational\nsystem. However, it achieves this at the cost of considerable\n imprecision.[11]\n In short, different forms of deductivism result from different\nunderstandings of “\\(Ax\\)” in deductivism’s\ncanonical statement.\n5. Provability: to reify or not to reify?\n\nThe rest of this entry examines five challenges to deductivism, one\nper section in\n §§5–9.\n The first turns on the notion of provability. Since deductivism\nclaims that mathematics is about what is provable in certain axiom\nsystems, providing an account of provability is central to it. The\nissue is whether to cash out provability in terms of the existence of\nproofs or not. In short, to reify or not to reify?\n\nTake the reifying approach first. It reads “\\(p\\) is provable\nfrom \\(Ax\\)” as “there is a proof of \\(p\\) from axioms\n\\(Ax\\)” (in a particular deductive system understood). This is\nthe most natural and most standard understanding of provability. On\nthis approach, to say that a system \\(T\\) is consistent is just to say\nthat there is no formula \\(\\phi\\) in the language of \\(T\\) such that\nthere is a proof of \\(\\phi\\) from \\(T\\) and a proof of \\(\\neg \\phi\\)\nfrom \\(T\\). However, some formulas and proofs are far too long to have\nconcrete physical instantiations; a simple example would be the proof\nof a numerical equation involving extremely large numbers. Even a\nformula with concrete instantiations should not be identified with a\nparticular one of these, or with the class of its instantiations. In\nother words, proofs as understood here are types rather than tokens:\nabstract strings conforming to the rules set by a deductive system,\nwhich exist irrespectively of any physical instantiations in speech,\nor on whiteboards, paper or screens. Indeed, if the deductivist wishes\nto retain the ability to refer to theories, as she will surely want\nto, she will have to accept linguistic types anyway. (Compare\nField-like nominalists, who must also refer to scientific and\nmathematical theories, even as they try to avoid reference to\nmathematical objects.)\n\nThe moral is that the deductivist will have to admit linguistic types.\nHer motivation for being a deductivist therefore cannot be to avoid\nall abstract objects (i.e., nominalism), since linguistic\ntypes are abstract. She must consequently motivate why admitting some\nabstract objects such as types is acceptable, whereas admitting\nmathematical objects is not. She might point to considerations of\neconomy: linguistic types are but a small part of the abstract realm.\nOr she might argue on the epistemological front that linguistic types\nare more easily knowable, since they have concrete instances, unlike\nmathematical objects, which do not. However, the literature is not\nshort of arguments that those who reject abstract mathematical objects\nshould also reject abstract linguistic types; see for example\nWetzel’s 2009 book Types and Tokens.\n\nOf course, one could be a deductivist for other reasons than an\naversion to abstract objects. As we saw in\n §4,\n one sort of deductivist might hold that a semantic analysis reveals\nthe meaning of mathematical statements to be of the form\n“\\(p\\) deductively follows from the axioms”. It is\nperfectly consistent to combine this view with an acceptance of\nabstract objects and the standard account of deductive consequence in\nterms of the existence of proofs. Yet, although perfectly coherent,\nthe view appears to lack independent motivation.\n\nThe alternative to reifying, evidently, is not to reify, and the most\nobvious way of doing so is to go down a modal route. Instead of\ncashing out provability by means of proof-existence, deductivists\ncould take provability to be a modal primitive. Logical possibility\nand necessity are these days typically understood model-theoretically:\na statement is logically possible or consistent just when it is true\nin some model; and necessary just when it is true in all models. The\ndeductivist must abjure this account of consistency (which she equates\nwith logical possibility), on pain of re-introducing mathematics in\nthe metatheory. Against the prevailing model-theoretic account, she\nmust take “it is logically possible that” as a primitive\nnotion, and forgo its analysis in terms of models (Putnam 1967b). In\nso doing, she is in the same boat as all anti-platonists who cannot\nhelp themselves to model theory or set theory in the metatheory. This\nparticular boat is a crowded one: it holds not just eliminative\nstructuralists, but also formalists of various stripes and nominalists\nas well. Nominalists, for example, do not believe in abstract objects.\nHence they face the same predicament—they cannot appeal to the\nexistence of models in the metatheory. Hartry Field (1991) develops a\nnominalist logic that takes the notion of logical consistency as\nprimitive, which we may symbolise as \\(\\diamond\\), with the associated\nnotion of logical necessity being \\(\\square\\). In particular,\n\\(\\diamond T\\) is the claim that the theory \\(T\\) is logically\nconsistent, and claims of logical implication are conditionals\nprefaced by\n \\(\\square\\).[12]\n The non-reifying deductivist can avail themself of these resources\nand thereby construe \\(G \\vdash p\\) as \\(\\square(\\wedge G \\rightarrow\np)\\).\n\nSuch “modalist” accounts of logical consequence à\nla Field have had a fairly low take-up among logicians. Many see\nlittle reason to prefer them to the model-theoretic account of\nconsequence. Modalist accounts suffer from problems of expressive\nadequacy, because they cannot quantify over possibilities; and they\nare theoretically less virtuous than the usual model-theoretic one,\npositing as they do primitive links between the existence of set\nmodels and primitive consistency facts. Chapter 4 of Melia (2003) is a\nlucid overview of the problems faced by modalism about\nmetaphysical modality, which have counterparts in the logical\ncase. If the deductivist takes the non-reifying route, they will have\nto come up with a satisfactory response to these sorts of\nchallenges.\n6. Unaxiomatic Mathematics\n\nA second objection to deductivism is that deductivism cannot account\nfor unaxiomatic\n mathematics.[13]\n This includes pre-axiomatic mathematics such as, say, “Old\nBabylonian” mathematics of the early second millennium BC, in\nwhich first principles are never stated explicitly (Robson 2008:\n 90).[14]\n But it also includes non-deductive mathematics; for example, we might\nwish to credit the eighteenth-century Swiss mathematician Euler with\nknowledge of results obtained through analogical reasoning, extensive\nverification of cases, and the like.\n\nIt seems right to attribute mathematical knowledge to Babylonian\nmathematicians who, among other things, were able to solve specific\nquadratic equations. Still, the challenge may not be that worrying.\nThat first principles were not explicit does not mean that they were\nnot implicit. Presumably, any mathematical principle that Babylonian\nmathematicians were willing to accept without argument should count as\na first principle or axiom. Independently of this point, deductivists\nshould also point out that unaxiomatic methods can yield knowledge if\nthey track what a proof would yield. Babylonian mathematicians used\nmethods that reliably produced solutions to specific quadratic\nequations, even if they could not formulate, still less solve, the\ngeneral quadratic equation. Euler’s methods reliably tracked the\nexistence of proofs for his results; if they had not, he would not\nhave been right as often as he was. This deals with the vast majority\nof such cases. Moreover—thinking about the residual\ncases—there is some reason to think that non-deductive reasoning\ncan yield knowledge of mathematical truth even in the absence of proof\n(Paseau 2015).\n7. A Regress?\n\nWe turn now to the third challenge. To introduce it, consider whether\ndeductivism should apply to a sentence such as\n\n\nthe sentence “\\(2 + 2 = 4\\)” deductively follows from\n\\(Ax\\)\n\n\n(As usual, we write \\(Ax\\) to preserve neutrality on what the axioms\nare exactly; see\n §4\n for the options here.) Since proof theory appears to be a branch of\nmathematics like any other, you might suppose that a consistent\ndeductivist should construe this sentence like any other mathematical\none. In which case, the sentence “\\(2 + 2 = 4\\)” should be\nconstrued not as\n\n\nthe sentence “\\(2 + 2 = 4\\)” deductively follows from\n\\(Ax\\),\n\n\nbut instead as\n\n\nthe sentence “the sentence ‘\\(2 + 2 = 4\\)’\ndeductively follows from \\(Ax\\)” deductively follows from\n\\(Ax'\\).\n\n\n(Where \\(Ax'\\) may or may not be identical to \\(Ax\\)—this will\nnot affect the main point.) Now if a deductivist is to go down to this\nroute, she will also have to construe this last sentence like any\nother mathematical one. So it should be glossed in the same way. The\nsame applies to the resulting gloss, and so on without end. Clearly,\nwe are off on an infinite regress.\n\nIt seems to follow that for the deductivist there is no finite\nformulation of the sentence “\\(2 + 2 = 4\\)”. Any such\nformulation would have to be infinite, and, if it ends at all, must\nend in a sentence \\(s\\) that is a “fixed-point” of this\niteration. In other words, \\(s\\) must be identical (not just logically\nequivalent) to “the sentence \\(s\\) deductively follows from\n\\(Ax\\)” (for some \\(Ax)\\) since \\(s\\) is construed by the\ndeductivist as\n\n\nthe sentence \\(s\\) deductively follows from \\(Ax\\)\n\n\nWhether such a sentence exists is highly dubious. Even if it does, an\ninfinitely long sentence, with infinitely many embeddings, is an\nabsurdly complicated way to interpret “\\(2+ 2 = 4\\)”,\nwhich after all is one of the simplest sentences of mathematics,\nindeed of the English language.\n\nThe objection just raised is premised on the idea that provability\nclaims are mathematical. To support this premise, the\nobjection’s proponent might point out that results in proof\ntheory are typically infused with mathematics. Our conviction that\nsome statement is provable in a deductive system is not usually a\nresult of having carried out the proof ourselves, starting from the\naxioms and applying the rules of inference to derive the theorem.\nRather, it often follows from more abstract mathematical\nreasoning.\n\nHow should the deductivist reply to this challenge? She can agree that\nwe use mathematics, sometimes even quite sophisticated mathematics, to\ndetermine what deductively follows from some axioms. That is an\nepistemological point. But it does not affect her thesis\nabout what mathematics is. For the deductivist, the truth of\na mathematical claim \\(p\\) consists in its being a theorem of an\nappropriate deductive system \\(D\\). How we determine what\n\\(D\\)’s theorems are may require mathematics—this is to\napply mathematics to proof systems—and perhaps other machinery,\nbut that, to repeat, is an epistemological point. The fact that \\(p\\)\nis a theorem of \\(D\\) is a fact about a deductive system, namely that\nthere is a sequence of formulas starting from axioms and proceeding by\nrules of the system concluding in \\(p\\). As the deductivist sees\nit—as she has to see it, to avoid the\nregress—this fact is not mathematical, even if we must\nuse mathematics to determine whether it holds or not. (Compare the\nclaim that a large meteor will land on Earth before 2050: a physical\nfact, but one we verify or falsify using sophisticated\nmathematics.)\n\nIn short, to avoid the regress, deductivists should not apply their\ninterpretation strategy to claims of deductive consequence. For any\nsentence \\(s\\) and well-specified deductive system \\(D\\), whether\n\\(D\\) proves \\(s\\) or not should be taken to be a determinate fact.\nSuch facts are the cornerstone of her philosophy and should not be\n“deductivised”. Rather than have the deductivist recipe\napplied to them, they must be taken at face\n value.[15]\n8. Applications\n\nThe fourth challenge concerns applications.\n §2\n mentioned that deductivism appears to provide a straightforward\naccount of the applicability of mathematics: provided a physical\nsystem satisfies the axioms of a particular branch of mathematics, the\nbranch’s theorems must apply to the physical system. But what\nexactly does it mean for a system to satisfy an axiom? The simplest\naccount of applications is the mapping or isomorphism account. Given a\nphysical set-up \\(P\\), stipulate an isomorphism from \\(P\\) to some\nmathematical structure \\(M\\), deduce some facts about \\(M\\), and then,\napplying the isomorphism in the reverse direction, read off the\ncorresponding facts about \\(P\\). Resnik (1980, 125), following Russell\nand Putnam, worries that this account is knee-deep in\nmathematics—for what is an isomorphism if not a mathematical\nobject? More generally, a satisfactory account of mathematical\napplications will have to employ mathematics to explain how\nmathematics relates to the physical\n world.[16]\n\nThis is a major concern that applies to a host of other philosophies.\nAll anti-platonists must set out how to understand the mathematics\nitself used to explain the applicability of mathematics. Eliminative\nstructuralists must give an account of the mathematics relating\nstructures to the physical world. Nominalists must likewise explain\nhow scientific theories laden with commitment to abstract objects can\ncorrectly depict the physical facts despite there being no abstract\nobjects. Each specific anti-platonism seems to face some version of\nthis general problem. Allowing the use of mathematics in the\nmetatheory enables a philosophy to relate mathematics and the natural\nworld; disallowing it appears to hamstring a philosophy—or so\nthis challenge maintains.\n\nSo can the deductivist explain mathematics’ applicability?\nPerhaps her best hope of doing so is by means of a combined\nmathematical-scientific “total” theory, which we may call\nTT. TT incorporates all the axioms of mathematics,\nas well as established scientific principles and data. Through its\ncombination of mathematics and science, TT is able to posit\nall sorts of relations between mathematical “structures”\nand physical situations and thereby explain mathematical applications\n(at least as well as anyone can). The truth-conditions of physical\nclaims derivable from TT should be understood in the usual\nreferential manner, as relating to the physical world; whereas the\ntruth-conditions of mathematical claims should, for the deductivist,\nbe understood as above, namely as claims of the form “\\(p\\) is\ndeducible from TT”. Importantly, for the deductivist,\n“structures” and “isomorphisms” are to be\nunderstood deductively within the theory TT. Effectively, the\ndeductivist internalises model theory into the deductive\nframework.\n\nThis response looks like it dispatches the challenge from\napplications. Mathematics and science can be discussed and compared\nwithin the single overarching theory, TT. However, the\nresponse has an Achilles heel: mixed statements. The deductivist\nconstrues talk of numbers in deductivist fashion and talk of chairs\n(say) in straightforwardly literal fashion. So what is she to make of\na claim such as “My favourite things are the number 7 and this\nchair”? The claim cannot be read literally, as it involves\nreference to a number; nor should it be read in deductivist fashion,\nsince it involves reference to a concrete entity, a particular chair.\nThat a chair is one of my favourite things is a claim with empirical\ncontent, to be taken literally. The sentence “my favourite\nthings are the number 7 and this chair” is of course a toy\nexample. The point applies much more widely, since mathematics is\nseamlessly interwoven with ordinary and (especially) scientific\nlanguage.\n\nThe deductivist therefore owes us a recipe for cleaving the\nmathematical from the non-mathematical in all mixed statements. This\nis a problem faced by other anti-platonist approaches, for example by\nfictionalists about mathematics such as Mary\n Leng.[17]\n They take applied mathematics to be an “extended fiction”\nthat combines the (alleged) fiction of mathematics with science, which\nthey construe literally (as it is about the physical world). But which\nis which, where do we draw the line, and how do we deal with\nstatements mixing fiction and the literal, apparently inextricably?\nFinding good answers to the corresponding questions is a significant\nchallenge for deductivists just as much as it is for\nfictionalists.\n9. Truth-Completeness\n\nWe move on to the fifth and final challenge to deductivism. One\nversion of it, owed to Michael Resnik, runs as\n follows.[18]\n Consider the deductivist’s set theory \\(T\\) and its Gödel\nsentence \\(G_T\\). By construction, \\(G_T\\) is not derivable from\n\\(T\\). So the deductivist cannot explain the truth of \\(G_T\\).\nResnik’s response: the deductivist can simply challenge the\nantideductivist to explain how she “sees” the truth of\n\\(G_T\\). Whatever mathematical argument the antideductivist offers,\nthe deductivist can simply extract from it an axiom set \\(T^{+}\\) and\npoint out that \\(G_T\\) follows from \\(T^{+}\\). Objection parried.\n\nGödel’s First Incompleteness Theorem does create a\nsignificant problem for deductivism; but it is not the one just\nformulated and responded to. The above version focuses on how, given a\nparticular theory \\((T)\\), we are supposed to appreciate the truth of\nits Gödel sentence \\((G_T)\\). A stronger form of the objection\ncasts it in more global terms and brackets the issue of the Gödel\nsentence’s truth. What deductivism appears to get wrong is that\nit disrespects the entrenched understanding of most parts of\nmathematics as truth-complete: for any precisely formulated\nsentence \\(p\\) from a truth-complete area of mathematics, exactly one\nof \\(p\\) and not-p is true. Analysis and arithmetic are\nexamples of areas standardly understood to be truth-complete. It is\nstandardly thought, for example, that a statement such as\nGoldbach’s Conjecture is true or false, even if it turns out to\nbe unprovable from any reasonable axioms, not just present\n ones.[19]\n But on the deductivist view, undecidable sentences in any\nformalisation of arithmetic and analysis are false and their negations\nare also false, since neither deductively follows from the axioms.\nThat there are undecidable sentences follows from Gödel’s\nFirst Incompleteness Theorem together with standard constraints on\ndeductive\n systems.[20]\n Hence deductivism misdescribes our understanding of truth-complete\nbranches of mathematics such as arithmetic, analysis and geometry.\n\nThis objection seems to affect two of the three variants of\ndeductivism we identified at the end of\n §4:\n local deductivism and ZFC-deductivism. A form of deductivism the\nGödelian objection does not affect is constructivist deductivism,\nbecause constructivists do not assume the law of excluded middle in\nmathematics, so do not assume truth-completeness. Though, as we\nglimpsed in the discussion of Brouwer\n (§3.5),\n constructivists do not tend to be deductivists.\n\nSticking to classical-logic-using deductivism, its proponent could\nrespond to the objection by idealising the axiom system or the proof\nsystem or both. The first approach is to construe “\\(2 + 2 =\n4\\)” as:\n\n\nthe sentence “\\(2 + 2 = 4\\)” deductively follows from the\nideal axioms of arithmetic\n\n\nThe resulting position is essentially whatever-it-takes deductivism,\nmentioned in\n §4.\n It adds a little more detail to the position articulated in\n §4\n in that the ideal axioms of arithmetic by stipulation give rise to a\ncomplete system, in order to overcome the present objection. (Of\ncourse, an informal version of whatever-it-takes deductivism would\nevade the objection altogether, because it is not based on a formal\nsystem. But critics will retort that it does so only because its\naccount of mathematical truth is inherently vague.) The second sort of\napproach might, for example, take the proof system to include\ninfinitary rules of reasoning, such as the omega-rule, which, as is\nwell-known, restores completeness if added to first-order Peano\n Arithmetic.[21]\n\nIdealising deductivism in either of these ways, however, is not to\nrescue but to abandon it. Any combined axiom-and-proof system that is\nconsistent, deductively complete and strong enough to capture all the\ntruths of mathematics lacks an effective proof procedure, by\nGödel’s First Incompleteness Theorem. To see this, consider\nsay the deductive “system” whose “theorems”\nconsist of all the true sentences of\n arithmetic.[22]\n Assuming the Church–Turing thesis, this list of\n“theorems” cannot be generated by any mechanical proof\nprocedure (i.e., algorithm). Idealised deductivism is thus eliminative\nstructuralism in thin disguise, since it advocates taking as the\ncombined axiom-and-proof system whatever it takes to capture the\nstructural content of the axioms, be it by beefing up the axioms or\nthe “proof” system or both. If the idea is that\nmathematicians take a sentence to be true if and only if it is a\nlogical consequence of the semantic content of\nstructure-characterising axioms, one should come clean and accept\ndeductivism’s semantic counterpart: eliminative structuralism.\nThe clear moral is that what lands deductivism in trouble is its focus\non syntax. Instead of taking a syntactic turn as it did in the late\nnineteenth and early twentieth centuries, the “mathematical\nstatements are conditional on axioms” idea must instead take a\nsemantic form.\n\nDeductivists might try another defence. We quoted Curry in\n §3.4\n as holding that “all formal systems stand on a par”. And\nthis is surely a thought many deductivists will find attractive: in\nprinciple, any formal system is acceptable, the differences between\none formal system and another being owed to the fact that one of them\nis better suited to applications, or to the fact that one of the\nsystems happens to be the one \\(we\\) use, and so on. So, for the\ndeductivist, if the axioms of arithmetic \\(Ax\\) we explicitly or\nimplicitly accept are incomplete, then any arithmetical sentence \\(p\\)\nnot decided by them is neither true nor false, precisely because its\ntruth-value is relativised to deducibility from \\(Ax\\). Of course, we\ncan strengthen \\(Ax\\) in one way to derive \\(p\\) and in another way to\nderive not-\\(p\\), and in those respective strengthenings \\(p\\) will be\nrespectively true and false. This, it appears, is Curry’s\nsuggestion about how deductivists should react to Gödel’s\nresult.\n\nThe resulting pluralist position rejects truth-completeness for a\nprincipled reason. But it rejects it nonetheless, and that must count\nas a significant cost. For the truth-completeness of arithmetic is a\nfundamental commitment of mathematics, and permeates most of our\nthinking about the natural numbers. (A similar point applies to many\nother areas.) Some would say that respecting it is a non-negotiable\nconstraint on a philosophy of mathematics. Of course, the\ntruth-completeness objection challenges deductivism only in certain\nareas of mathematics—specifically those typically held to be\ntruth-complete but for which no deductively complete, consistent\naxiomatisation exists. A complete theory-axiomatisation may be\nprovided even in first-order logic not just for finite structures but\nfor some infinite ones as\n well.[23]\n Thus one could still try to defend a deductivism about all other\nareas. But there is great value in having a uniform philosophy of\nmathematics. More importantly, given deductivism’s motivations,\nas outlined in\n §2,\n it is hard to see what the point of this sort of eclectic deductivism\nmight be.\n\nTruth-completeness presents the deductivist with a formidable\nchallenge. To meet it, she cannot privilege any system of arithmetic\nover any other by maintaining that “PA is consistent” is\ntrue in one system and false in another. The post-Gödelian\nrealisation that eliminative structuralism fares better\nhere—because it allows for the possibility of truth-completeness\nif we move to an incompletable semantic consequence relation—led\nto structuralism’s gain in popularity at the expense of\ndeductivism in the second half of the twentieth century.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Benacerraf, Paul, 1973, “Mathematical Truth”, <em>The\nJournal of Philosophy</em>, 70(19): 661–679.\ndoi:10.2307/2025075",
                "Bostock, David, 2009, <em>Philosophy of Mathematics: An\nIntroduction</em>, Chichester, UK/Malden, MA: Wiley-Blackwell.",
                "Brouwer, Luitzen Egbertus Jan, 1981, <em>Brouwer’s Cambridge\nLectures on Intuitionism</em>, Dirk van Dalen (ed.), Cambridge/New\nYork: Cambridge University Press.",
                "Burgess, John Patton, 1983, “Why I Am Not a\nNominalist.”, <em>Notre Dame Journal of Formal Logic</em>,\n24(1): 93–105. doi:10.1305/ndjfl/1093870223",
                "Curry, Haskell Brooks, 1951, <em>Outlines of a Formalist\nPhilosophy of Mathematics</em>, (Studies in Logic and the Foundations\nof Mathematics), Amsterdam: North-Holland Publishing.",
                "Field, Hartry, 1991, “Metalogic and Modality”,\n<em>Philosophical Studies: An International Journal for Philosophy in\nthe Analytic Tradition,</em> 62(1): 1–22.",
                "Frege, Gottlob, 1976 [1980], <em>Wissenschaftlicher\nBriefwechsel</em>, volume 2 of <em>Nachgelassene Schriften und\nWissenschaftlicher Briefwechsel</em>, Gottfried Gabriel, Hans Hermes,\nFriedrich Kambartel, Christian Thiel, and Albert Veraart (eds),\nHamburg: Meiner. Abridged version translated as <em>Philosophical and\nMathematical Correspondence</em>, Brian McGuinness (ed.), Hans Kaal\n(trans.), Chicago: University of Chicago Press and Oxford:\nBlackwell.",
                "Gödel, Kurt, 1930, “Die Vollständigkeit der Axiome\ndes logischen Funktionenkalküls”, <em>Monatshefte für\nMathematik und Physik, </em>37(1): 349–60.\ndoi:10.1007/BF01696781.",
                "–––, 1931, “Über formal\nunentscheidbare Sätze der Principia Mathematica und verwandter\nSysteme I”, <em>Monatshefte für Mathematik und Physik,</em>\n38(1): 173–98. doi:10.1007/BF01700692.",
                "Hellman, Geoffrey, 1989, <em>Mathematics without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Clarendon Press.\ndoi:10.1093/0198240341.001.0001",
                "–––, 2021, “If ‘If-Then’ Then\nWhat?”, in his <em>Mathematics and Its Logics: Philosophical\nEssays</em>, Cambridge: Cambridge University Press, 237–255 (ch.\n14).",
                "Hellman, Geoffrey and Stewart Shapiro, 2019, <em>Mathematical\nStructuralism</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781108582933",
                "Hilbert, David, 1900a, “Über den Zahlbegriff.”,\n<em>Jahresbericht der Deutschen Mathematiker-Vereinigung</em>, 8:\n180–183.",
                "–––, 1900b, “Mathematische\nProbleme”. <em>Nachrichten von der Gesellschaft der\nWissenschaften zu Göttingen, Mathematisch-Physikalische\nKlasse</em> 1900: 253–297.",
                "Kennedy, Hubert C., 1972, “The Origins of Modern Axiomatics:\nPasch to Peano”, <em>The American Mathematical Monthly</em>,\n79(2): 133–136. doi:10.1080/00029890.1972.11993005",
                "Kraal, Anders, 2014, “The Aim of Russell’s Early\nLogicism: A Reinterpretation”, <em>Synthese</em>, 191(7):\n1493–1510. doi:10.1007/s11229-013-0342-9",
                "Leng, Mary, 2010, <em>Mathematics and Reality</em>, Oxford/New\nYork: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199280797.001.0001",
                "Linnebo, Øystein, 2017, <em>Philosophy of Mathematics</em>,\n(Princeton Foundations of Contemporary Philosophy), Princeton, NJ:\nPrinceton University Press.",
                "Maddy, Penelope, 2022, <em>A Plea for Natural Philosophy: And\nOther Essays</em>, New York: Oxford University Press.",
                "Melia, Joseph, 2003, <em>Modality</em>, (Central Problems of\nPhilosophy), Montreal: McGill-Queen’s University Press.",
                "Parsons, Charles, 2008, <em>Mathematical Thought and its\nObjects</em>. Cambridge: Cambridge University Press.",
                "Pasch, Moritz, 1882/1926, <em>Vorlesungen uber neuere\nGeometrie</em>, first edition, Leipzig: B.G.Teubner. Second edition,\n(Die Grundlehren der mathematischen Wissenschaften in\nEinzeldarstellungen 23), Berlin: J. Springer.",
                "–––, 1917 [2010], “Grundfragen der\nGeometrie.”, <em>Journal für die reine und angewandte\nMathematik</em>, 147: 184–190. Translated as “Fundamental\nQuestions of Geometry”, in Pasch 2010: 45–50.\ndoi:10.1515/crll.1917.147.184 (de) doi:10.1007/978-90-481-9416-2_2\n(en)",
                "–––, 1918 [2010], “Die Forderung der\nEntscheidbarkeit”, <em>Jahresbericht der Deutschen\nMathematiker-Vereinigung</em>, 27: 228–232. Translated as\n“The Decidability Requirement”, in Pasch 2010:\n51–54. doi:10.1007/978-90-481-9416-2_3 (en)",
                "–––, 2010, <em>Essays on the Foundations of\nMathematics by Moritz Pasch</em>, Stephen Pollard (ed./tran.), (The\nWestern Ontario Series in Philosophy of Science 83), Dordrecht:\nSpringer Netherlands. doi:10.1007/978-90-481-9416-2",
                "Paseau, Alexander C., 2005, “Naturalism in Mathematics and\nthe Authority of Philosophy”, <em>The British Journal for the\nPhilosophy of Science</em>, 56(2): 377–396.\ndoi:10.1093/bjps/axi123",
                "–––, 2015, “Knowledge of Mathematics\nwithout Proof”, <em>The British Journal for the Philosophy of\nScience</em>, 66(4): 775–799. doi:10.1093/bjps/axu012",
                "–––, forthcoming a, “Trumping Naturalism\nRevisited”, in <em>On the Philosophy of Penelope Maddy:\nSet-theoretic Foundations and Naturalistic Methodology</em>, Juliette\nCara Kennedy (ed.), Springer.",
                "–––, forthcoming b, <em>What is Mathematics\nAbout?</em> Oxford: Oxford University Press.",
                "Putnam, Hilary, 1967a [1975], “The Thesis That Mathematics\nIs Logic”, in <em>Bertrand Russell, Philosopher of the\nCentury</em>, Ralph Schoenman (ed.), London: Allen and Unwin, ch. 18.\nReprinted In his <em>Mathematics, Matter, and Method</em>, London/New\nYork: Cambridge University Press, 1975, 12–42 (ch. 2). Page refs\nare to the reprint.",
                "–––, 1967b, “Mathematics without\nFoundations”, <em>The Journal of Philosophy</em>, 64(1):\n5–22. doi:10.2307/2024603",
                "Quine, Willard Van Orman, 1970, <em>Philosophy of Logic</em>,\nEnglewood Cliffs, NJ: Prentice-Hall. Second edition, Cambridge, MA:\nHarvard University Press, 1986.",
                "Resnik, Michael D., 1980, <em>Frege and the Philosophy of\nMathematics</em>,. Ithaca, NY: Cornell University Press.",
                "Rheinwald, Rosemarie, 1984, <em>Der Formalismus und seine Grenzen.\nUntersuchungen zur neueren Philosophie der Mathematik</em> (Analyse\nund Grundlegung, 11), Königstein: Hain.",
                "Robson, Eleanor, 2008, <em>Mathematics in Ancient Iraq: A Social\nHistory</em>, Princeton, NJ: Princeton University Press.",
                "Russell, Bertrand, 1903 [2009], <em>Principles of\nMathematics</em>, first edition, Cambridge: University Press.\nReprinted London: Routledge, 2009.",
                "–––, 1937 [2010], <em>Principles of\nMathematics</em>, second edition, London: G. Allen &amp; Unwin.\nReprinted London: Routledge, 2010.",
                "Schlimm, Dirk, 2010, “Pasch’s Philosophy of\nMathematics”, <em>The Review of Symbolic Logic</em>, 3(1):\n93–118. doi:10.1017/S1755020309990311",
                "Shapiro, Stewart, 1997, <em>Philosophy of Mathematics: Structure\nand Ontology</em>, New York: Oxford University Press.\ndoi:10.1093/0195139305.001.0001",
                "–––, 2000, <em>Thinking about Mathematics: The\nPhilosophy of Mathematics</em>, New York: Oxford University\nPress.",
                "Sieg, Wilfried, 2020, “The Ways of Hilbert’s\nAxiomatics: Structural and Formal”, in <em>The Prehistory of\nMathematical Structuralism</em>, Erich H. Reck and Georg Schiemer\n(eds.), New York: Oxford University Press, 142–165 (ch. 6).\ndoi:10.1093/oso/9780190641221.003.0006",
                "Warren, Jared, 2020, <em>Shadows of Syntax: Revitalizing Logical\nand Mathematical Conventionalism</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780190086152.001.0001",
                "Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: MIT Press.\ndoi:10.7551/mitpress/9780262013017.001.0001",
                "Williamson, Timothy, 2014, “Logic, Metalogic and\nNeutrality”, <em>Erkenntnis</em>, 79(S2): 211–231.\ndoi:10.1007/s10670-013-9474-z"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Benacerraf, Paul, 1973, “Mathematical Truth”, <em>The\nJournal of Philosophy</em>, 70(19): 661–679.\ndoi:10.2307/2025075</li>\n<li>Bostock, David, 2009, <em>Philosophy of Mathematics: An\nIntroduction</em>, Chichester, UK/Malden, MA: Wiley-Blackwell.</li>\n<li>Brouwer, Luitzen Egbertus Jan, 1981, <em>Brouwer’s Cambridge\nLectures on Intuitionism</em>, Dirk van Dalen (ed.), Cambridge/New\nYork: Cambridge University Press.</li>\n<li>Burgess, John Patton, 1983, “Why I Am Not a\nNominalist.”, <em>Notre Dame Journal of Formal Logic</em>,\n24(1): 93–105. doi:10.1305/ndjfl/1093870223</li>\n<li>Curry, Haskell Brooks, 1951, <em>Outlines of a Formalist\nPhilosophy of Mathematics</em>, (Studies in Logic and the Foundations\nof Mathematics), Amsterdam: North-Holland Publishing.</li>\n<li>Field, Hartry, 1991, “Metalogic and Modality”,\n<em>Philosophical Studies: An International Journal for Philosophy in\nthe Analytic Tradition,</em> 62(1): 1–22.</li>\n<li>Frege, Gottlob, 1976 [1980], <em>Wissenschaftlicher\nBriefwechsel</em>, volume 2 of <em>Nachgelassene Schriften und\nWissenschaftlicher Briefwechsel</em>, Gottfried Gabriel, Hans Hermes,\nFriedrich Kambartel, Christian Thiel, and Albert Veraart (eds),\nHamburg: Meiner. Abridged version translated as <em>Philosophical and\nMathematical Correspondence</em>, Brian McGuinness (ed.), Hans Kaal\n(trans.), Chicago: University of Chicago Press and Oxford:\nBlackwell.</li>\n<li>Gödel, Kurt, 1930, “Die Vollständigkeit der Axiome\ndes logischen Funktionenkalküls”, <em>Monatshefte für\nMathematik und Physik, </em>37(1): 349–60.\ndoi:10.1007/BF01696781.</li>\n<li>–––, 1931, “Über formal\nunentscheidbare Sätze der Principia Mathematica und verwandter\nSysteme I”, <em>Monatshefte für Mathematik und Physik,</em>\n38(1): 173–98. doi:10.1007/BF01700692.</li>\n<li>Hellman, Geoffrey, 1989, <em>Mathematics without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Clarendon Press.\ndoi:10.1093/0198240341.001.0001</li>\n<li>–––, 2021, “If ‘If-Then’ Then\nWhat?”, in his <em>Mathematics and Its Logics: Philosophical\nEssays</em>, Cambridge: Cambridge University Press, 237–255 (ch.\n14).</li>\n<li>Hellman, Geoffrey and Stewart Shapiro, 2019, <em>Mathematical\nStructuralism</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781108582933</li>\n<li>Hilbert, David, 1900a, “Über den Zahlbegriff.”,\n<em>Jahresbericht der Deutschen Mathematiker-Vereinigung</em>, 8:\n180–183.</li>\n<li>–––, 1900b, “Mathematische\nProbleme”. <em>Nachrichten von der Gesellschaft der\nWissenschaften zu Göttingen, Mathematisch-Physikalische\nKlasse</em> 1900: 253–297.</li>\n<li>Kennedy, Hubert C., 1972, “The Origins of Modern Axiomatics:\nPasch to Peano”, <em>The American Mathematical Monthly</em>,\n79(2): 133–136. doi:10.1080/00029890.1972.11993005</li>\n<li>Kraal, Anders, 2014, “The Aim of Russell’s Early\nLogicism: A Reinterpretation”, <em>Synthese</em>, 191(7):\n1493–1510. doi:10.1007/s11229-013-0342-9</li>\n<li>Leng, Mary, 2010, <em>Mathematics and Reality</em>, Oxford/New\nYork: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199280797.001.0001</li>\n<li>Linnebo, Øystein, 2017, <em>Philosophy of Mathematics</em>,\n(Princeton Foundations of Contemporary Philosophy), Princeton, NJ:\nPrinceton University Press.</li>\n<li>Maddy, Penelope, 2022, <em>A Plea for Natural Philosophy: And\nOther Essays</em>, New York: Oxford University Press.</li>\n<li>Melia, Joseph, 2003, <em>Modality</em>, (Central Problems of\nPhilosophy), Montreal: McGill-Queen’s University Press.</li>\n<li>Parsons, Charles, 2008, <em>Mathematical Thought and its\nObjects</em>. Cambridge: Cambridge University Press.</li>\n<li>Pasch, Moritz, 1882/1926, <em>Vorlesungen uber neuere\nGeometrie</em>, first edition, Leipzig: B.G.Teubner. Second edition,\n(Die Grundlehren der mathematischen Wissenschaften in\nEinzeldarstellungen 23), Berlin: J. Springer.</li>\n<li>–––, 1917 [2010], “Grundfragen der\nGeometrie.”, <em>Journal für die reine und angewandte\nMathematik</em>, 147: 184–190. Translated as “Fundamental\nQuestions of Geometry”, in Pasch 2010: 45–50.\ndoi:10.1515/crll.1917.147.184 (de) doi:10.1007/978-90-481-9416-2_2\n(en)</li>\n<li>–––, 1918 [2010], “Die Forderung der\nEntscheidbarkeit”, <em>Jahresbericht der Deutschen\nMathematiker-Vereinigung</em>, 27: 228–232. Translated as\n“The Decidability Requirement”, in Pasch 2010:\n51–54. doi:10.1007/978-90-481-9416-2_3 (en)</li>\n<li>–––, 2010, <em>Essays on the Foundations of\nMathematics by Moritz Pasch</em>, Stephen Pollard (ed./tran.), (The\nWestern Ontario Series in Philosophy of Science 83), Dordrecht:\nSpringer Netherlands. doi:10.1007/978-90-481-9416-2</li>\n<li>Paseau, Alexander C., 2005, “Naturalism in Mathematics and\nthe Authority of Philosophy”, <em>The British Journal for the\nPhilosophy of Science</em>, 56(2): 377–396.\ndoi:10.1093/bjps/axi123</li>\n<li>–––, 2015, “Knowledge of Mathematics\nwithout Proof”, <em>The British Journal for the Philosophy of\nScience</em>, 66(4): 775–799. doi:10.1093/bjps/axu012</li>\n<li>–––, forthcoming a, “Trumping Naturalism\nRevisited”, in <em>On the Philosophy of Penelope Maddy:\nSet-theoretic Foundations and Naturalistic Methodology</em>, Juliette\nCara Kennedy (ed.), Springer.</li>\n<li>–––, forthcoming b, <em>What is Mathematics\nAbout?</em> Oxford: Oxford University Press.</li>\n<li>Putnam, Hilary, 1967a [1975], “The Thesis That Mathematics\nIs Logic”, in <em>Bertrand Russell, Philosopher of the\nCentury</em>, Ralph Schoenman (ed.), London: Allen and Unwin, ch. 18.\nReprinted In his <em>Mathematics, Matter, and Method</em>, London/New\nYork: Cambridge University Press, 1975, 12–42 (ch. 2). Page refs\nare to the reprint.</li>\n<li>–––, 1967b, “Mathematics without\nFoundations”, <em>The Journal of Philosophy</em>, 64(1):\n5–22. doi:10.2307/2024603</li>\n<li>Quine, Willard Van Orman, 1970, <em>Philosophy of Logic</em>,\nEnglewood Cliffs, NJ: Prentice-Hall. Second edition, Cambridge, MA:\nHarvard University Press, 1986.</li>\n<li>Resnik, Michael D., 1980, <em>Frege and the Philosophy of\nMathematics</em>,. Ithaca, NY: Cornell University Press.</li>\n<li>Rheinwald, Rosemarie, 1984, <em>Der Formalismus und seine Grenzen.\nUntersuchungen zur neueren Philosophie der Mathematik</em> (Analyse\nund Grundlegung, 11), Königstein: Hain.</li>\n<li>Robson, Eleanor, 2008, <em>Mathematics in Ancient Iraq: A Social\nHistory</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Russell, Bertrand, 1903 [2009], <em>Principles of\nMathematics</em>, first edition, Cambridge: University Press.\nReprinted London: Routledge, 2009.</li>\n<li>–––, 1937 [2010], <em>Principles of\nMathematics</em>, second edition, London: G. Allen &amp; Unwin.\nReprinted London: Routledge, 2010.</li>\n<li>Schlimm, Dirk, 2010, “Pasch’s Philosophy of\nMathematics”, <em>The Review of Symbolic Logic</em>, 3(1):\n93–118. doi:10.1017/S1755020309990311</li>\n<li>Shapiro, Stewart, 1997, <em>Philosophy of Mathematics: Structure\nand Ontology</em>, New York: Oxford University Press.\ndoi:10.1093/0195139305.001.0001</li>\n<li>–––, 2000, <em>Thinking about Mathematics: The\nPhilosophy of Mathematics</em>, New York: Oxford University\nPress.</li>\n<li>Sieg, Wilfried, 2020, “The Ways of Hilbert’s\nAxiomatics: Structural and Formal”, in <em>The Prehistory of\nMathematical Structuralism</em>, Erich H. Reck and Georg Schiemer\n(eds.), New York: Oxford University Press, 142–165 (ch. 6).\ndoi:10.1093/oso/9780190641221.003.0006</li>\n<li>Warren, Jared, 2020, <em>Shadows of Syntax: Revitalizing Logical\nand Mathematical Conventionalism</em>, New York: Oxford University\nPress. doi:10.1093/oso/9780190086152.001.0001</li>\n<li>Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: MIT Press.\ndoi:10.7551/mitpress/9780262013017.001.0001</li>\n<li>Williamson, Timothy, 2014, “Logic, Metalogic and\nNeutrality”, <em>Erkenntnis</em>, 79(S2): 211–231.\ndoi:10.1007/s10670-013-9474-z</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "algebra",
            "Gödel, Kurt: incompleteness theorems",
            "logicism and neologicism",
            "mathematics, philosophy of: fictionalism",
            "mathematics, philosophy of: formalism",
            "mathematics, philosophy of: intuitionism",
            "mathematics, philosophy of: nominalism",
            "mathematics, philosophy of: Platonism",
            "mathematics, philosophy of: structuralism\n\n To be completed."
        ],
        "entry_link": [
            {
                "../algebra/": "algebra"
            },
            {
                "../goedel-incompleteness/": "Gödel, Kurt: incompleteness theorems"
            },
            {
                "../logicism/": "logicism and neologicism"
            },
            {
                "../fictionalism-mathematics/": "mathematics, philosophy of: fictionalism"
            },
            {
                "../formalism-mathematics/": "mathematics, philosophy of: formalism"
            },
            {
                "../intuitionism/": "mathematics, philosophy of: intuitionism"
            },
            {
                "../nominalism-mathematics/": "mathematics, philosophy of: nominalism"
            },
            {
                "../platonism-mathematics/": "mathematics, philosophy of: Platonism"
            },
            {
                "../structuralism-mathematics/": "mathematics, philosophy of: structuralism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=deductivism-mathematics\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/deductivism-mathematics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=deductivism-mathematics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/deductivism-mathematics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=deductivism-mathematics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/deductivism-mathematics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=deductivism-mathematics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/deductivism-mathematics/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}