{
    "url": "dharmakiirti",
    "title": "Dharmakīrti",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Tom Tillemans\n<Tom.Tillemans@unil.ch>",
        "author_links": [
            {
                "mailto:Tom%2eTillemans%40unil%2ech": "Tom.Tillemans@unil.ch"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nTom Tillemans\n&lt;<a href=\"mailto:Tom%2eTillemans%40unil%2ech\"><em>Tom<abbr title=\" dot \">.</abbr>Tillemans<abbr title=\" at \">@</abbr>unil<abbr title=\" dot \">.</abbr>ch</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 19, 2011",
        "substantive revision Tue Dec 22, 2020"
    ],
    "preamble": "\n\nThe life of Dharmakīrti, a profound and rigorous philosopher of\nIndian Buddhism, is a subject of hagiography with little solid data\nupon which we can confidently\n rely.[1]\n If we go by Tibetan sources, he seems to have been born in South\nIndia and then to have moved to the great monastic university of\nNālandā (in present day Bihar state) where he was supposedly\nin contact with other Buddhist luminaries, such as Dharmapāla\n(530–561 C.E.). Tibetan sources describe his life in very\ncolorful terms. Indeed some make him out as initially a\nMīmāṃsaka who then broke with that non-Buddhist\nschool; others depict him as extraordinarily skilled in debate and\nhint at a difficult and arrogant personality. Judging by the opening\nverses in his most famous (and by far his longest) work, the\nPramāṇavārttika (Commentary on\nEpistemology), Dharmakīrti himself thought that his\nphilosophy would not be understood by his contemporaries because of\ntheir small-minded vanity. At the end of the\nPramāṇavārttika, he went further and\nprophesied that his work of unrivalled depth would never receive its\nproper recognition, but would age in obscurity locked away in\n itself.[2]\n\nHe was wrong about that, fortunately for us. His philosophy certainly\ndid find recognition, at least it did in many parts of Asia. He, and\nhis predecessor Dignāga (c. 480–c. 540 C.E.), were\nresponsible for a school of Buddhist thought that actually had no name\nin Sanskrit, although in Tibetan it was known as “those who\nfollow reasoning” (rigs pa rjes su ‘brang ba); in\nmodern literature it is sometimes known by the convenient Sanskrit\nmisnomer pramāṇavāda, or more simply,\n“the Epistemological School.” In any case, it is the\nBuddhist school that provoked the most sophisticated and most\nimportant philosophical debates with non-Buddhist rivals. It\nrepresented Buddhism in the pan-Indian debates on problems of\nuniversals, philosophies of logic and language, and issues of\njustification, and had an enormous influence on Mahāyāna\nBuddhism in Central Asia, especially in Tibet. Finally, although its\ninfluence was relatively limited in medieval China (only a few of the\nworks of Dignāga were translated into Chinese, none of the works\nof Dharmakīrti were translated), it has nonetheless become\nincreasingly important in modern Japan in supplying the epistemology\nfor Buddhist thought.\n\nIt is still debated in the modern community of researchers on\nDharmakīrti whether one should place this philosopher in the\nseventh century C.E. or in the sixth. Part of the reason for this\nindecision is that a significant time seems to have elapsed before\nDharmakīrti achieved notoriety in India, although it is unclear\nhow much. Erich Frauwallner came out strongly for 600–660 C.E.\nas Dharmakīrti’s dates, using an argumentum ex silentio\nthat is short of conclusive—hardly more than one piece in the\n puzzle.[3]\n One problem is that there may indeed be some counterevidence that\nwould place Dharmakīrti a half-century earlier, inter\nalia his possible connections with Dharmapāla, a\nsixth-century idealist philosopher who, according to Tibetan\nhistorians, was the monk that ordained Dharmakīrti. Some have\nthought that there is even a reference to Dharmakīrti in\nDharmapāla’s commentary to Dignāga’s\nĀlambanaparīkṣā (“Analysis of the\nobject [of perception]”). However, because this commentary is\nonly available to us at this time in Chinese in an unreliable\ntranslation by Yijing, it is not clear that the passage in question\ndoes in fact refer to Dharmakīrti. Caution or even agnosticism on\nthe matter of Dharmakīrti’s dates still seems to be warranted,\nalthough the scales are tipping towards an earlier date. Krasser\n(2012) relies heavily on connections between Dharmakīrti,\nBhāviveka and Kumārila to push the dates of\nDharmakīrti’s activity back to the mid sixth century C.E.\n [4]\n Balcerowicz (2016) argues that Dharmakīrti directly influenced\nthe Jaina writer Samantabhadra. He proposes 530-590 as the dates for\nthe latter and 550-610 as the dates for Dharmakīrti.\n\nLeaving aside the question of dates, Frauwallner (1954) did most\nlikely pin down the order in which Dharmakīrti composed five of\nhis seven works, namely, and in this order, the\nPramāṇavārttika,\nPramāṇaviniścaya (“Ascertainment of\nEpistemology”), Nyāyabindu (“Drop of\nReasoning”), Hetubindu (“Drop of Logical\nReasons”), and Vādanyāya (“Logic of\nArgumentation”). The two minor works, the\nSambandhaparīkṣā (“Analysis of\nRelations”) and Saṃtānāntarasiddhi\n(“Proof of Other Minds”), are more difficult to place in\nthe sequence. There is also an autocommentary to the\nPramāṇavārttika, the\nPramāṇavārttikasvavṛtti. However, the\nhypothesis of Frauwallner that there was a proto-text that later\nbecame the Pramāṇavārttikasvavṛtti is\nstill speculative.\n\nIn what follows, most of our discussion will center around the\nPramāṇavārttika, as it is by far the largest\nand most important of Dharmakīrti’s works. It is an unfinished,\nhighly philosophical, commentary on the\nPramāṇasamuccaya (“Compendium of\nEpistemology”) of Dignāga. At various key places in the\ntext we see that Dharmakīrti seems to have formulated some basic\nideas as a reaction to now lost commentaries by Dignāga’s\nstudents, the most important being the commentary on the\nPramāṇasamuccaya by Īśvarasena. A\nnotable reaction to Īśvarasena is Dharmakīrti’s\nemphasis on certainty (niścaya) (see sections\n 1.4\n and\n 3.1).\n There are also innovations that, as far as we know, were not provoked\nby earlier commentators. Whether in metaphysics, epistemology or\nphilosophy of language, causal theories carry considerable\nphilosophical weight. These theories are probably to quite a degree\noriginal, not found in Dignāga’s own writings. In what follows,\nwe will examine what we consider to be the most salient features of\nDharmakīrti’s philosophy, bringing out inter alia the\nimportance of this causal stance. It is however impossible to discuss\nall the major themes that were traditionally commented upon by\nBuddhist scholastic writers on Dharmakīrti. Choices and\nexclusions had to be made. For readers who seek a comprehensive\ntreatment of the historical development of Dharmakīrti’s\npositions in his seven works, the best reference to date is\nEltschinger (2010). Quite detailed summaries of Dharmakīrti’s\nworks are found in Potter (2017).\n",
    "toc": [
        {
            "#Met": "1. Metaphysics"
        },
        {
            "#Nom": "1.1. Nominalism"
        },
        {
            "#ReaMom": "1.2. Reality and momentariness"
        },
        {
            "#TwoArgForMom": "1.3 Two arguments for momentariness"
        },
        {
            "#CauThePro": "1.4 A causal theory of properties"
        },
        {
            "#HumDhaCau": "1.5 Humean and Dharmakīrtian causality"
        },
        {
            "#EpiLan": "2. Epistemology and philosophy of language"
        },
        {
            "#PraJus": "2.1 Pramāṇas and justification"
        },
        {
            "#AboTheApo": "2.2 Aboutness: the theory of apoha"
        },
        {
            "#LogLog": "3. Logic and Philosophy of logic"
        },
        {
            "#GooReaTriCri": "3.1 Good reasons and the triple criterion"
        },
        {
            "#InfForOth": "3.2 Inference-for-others"
        },
        {
            "#OpaCon": "3.3 Opaque contexts"
        },
        {
            "#RelEth": "4. Religion and ethics"
        },
        {
            "#EdiTraPra": "5. Editions and translations of the Pramāṇavārttika"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Metaphysics\n\nThe Dignāga-Dharmakīrti school—contrary to certain\nglobally anti-realist Buddhist schools like the\nMadhyamaka—recognizes that there are, indeed must be, some\nentities that are fully real. It is, however, a school that is\nthoroughly nominalist. What is real for them is only the\nparticular (svalakṣaṇa). By contrast, anything\nthat is a universal (sāmānyalakṣaṇa) is\nunreal; at most it is a customarily recognized fiction needed for\nthought and language. What demarcates the real from the fictional is\nthat the former has causal powers and exists in a purely punctual way,\na new entity each moment. Both Dignāga and Dharmakīrti were,\nin their final positions, followers of the Yogācāra\nidealism, although they clearly went to great effort to make their\npositions largely acceptable to proponents of external objects and to\nidealists alike. Indeed in Dharmakīrti’s case, most of his\nphilosophy is presented from a point of view in which external objects\n(bāhyārtha) are (provisionally at least) accepted\nas real. Idealism only enters the picture after verse 194 of the third\nchapter of Pramāṇavārttika. He certainly does\nhave sophisticated arguments to prove idealism, that is, the view for\nhim that there are no external objects, that “everything\ncognizable is internal” (antarjñeyavāda),\n“only mere data” (vijñaptimātra),\n [5]\n and that subject (grāhaka) and object\n(grāhya) are not two distinct entities. Nonetheless, it\nis striking that the main thrust of Dharmakīrti’s\nmetaphysics—his nominalism, his proofs of impermanence and his\ncausal theories of properties—is largely unaffected by the\nchoice of external realism or idealism. Similarly for his\nepistemology, philosophy of language and logic, with a few adjustments\nhere and there. Even on matters of solipsism and other minds, the\nchoice of idealism makes little difference for Dharmakīrti. In\nthe Saṃtānāntarasiddhi, for example, he goes\nto great length to show that the Yogācāra idealist can use\nthe same arguments for other minds–i.e., the argument from\nanalogy—as the Sautrāntika realist, and just as the realist\ncan avoid solipsism so the idealist supposedly can\n too.[6]\n For our purposes, essentially for simplicity and conciseness, we\nshall treat of Dharmakīrti’s philosophy as accepting external\nobjects, with the proviso that most of the same ideas can be\nreinterpreted to conform to idealism. Another way to put it is that\nwe’ll read the Pramāṇavārttika along the\nbroad lines of what Tibetan siddhānta (grub\nmtha’) literature terms the “position common to\nSautrāntika [external realism] and Cittamātra\n[idealism]” (mdo sde pa dang sems tsam pa thun mong ba’i\nlugs).\n1.1. Nominalism\n\n\nIt [i.e., the universal present in one instance] does\nnot go [to another], it was not there [before the\ninstances], nor is it there after [them], nor does it have\nparts. [And even when in other places] it does not leave the previous\nlocus. Oh my! It’s just one disaster after another.\n(Pramāṇavārttika\n I.152)[7]\n\n\nNo doubt the fundamental intuition in Buddhist nominalism, just as in\nother nominalisms, is that universals are occult pseudo-entities that\nshould not be taken seriously by a responsible thinker concerned with\nontology. As the above quotation from\nPramāṇavārttika shows, Dharmakīrti lists\na series of anomalies: they don’t go anywhere, don’t exist before\nor after their instances, they are partless, are in several\nplaces at one time, and so and so on. Such bogusness of\npseudo-entities becomes a recurrent theme in Buddhist Epistemology. A\nlater Indian Buddhist writer, Paṇḍit Aśoka, inspired\nby Dharmakīrti and Dignāga, ridiculed real universals as\nfollows in his Sāmānyadūṣaṇa\n(“Refutation of Universals”):\n\n\nOne can clearly see five fingers in one’s own hand. One who commits\nhimself to a sixth general entity fingerhood, side by side with the\nfive fingers, might as well postulate horns on top of his\n head.[8]\n\n\nThe collection of intuitive anomalies and appeal to seriousness may\nvery well be the most powerful strategies nominalists East and West\nhave, even though their realist adversaries will predictably maintain\nthat they are untouched because universals are not the kind of things\nthat need to be in one place at one time, etc. However, there are\nother considerations for Dharmakīrti besides the intuitive ones.\nThere are metaphysical arguments and even an underlying political\nstance behind his nominalism (see\n section 4).\n The recurring Buddhist metaphysical argument against the reality of\nuniversals is that they would be subject to an intractable\n“one-many” problem: the universal, which would be one\nthing, would have to be somehow present in and share the nature of\nseveral different particulars. The problem for Dharmakīrti would\nthen be that because the universal would share the multiple natures of\nthe various particulars it, too, would itself have to be many\ndifferent\n things.[9]\n The alternative whereby the universal would be a radically separate\nentity (arthāntara) from the particulars and remain\nunitary in nature is dismissed as irreconcilable with the obvious fact\nthat we say that several things possess the same property. Buddhists,\nnot surprisingly, have to consecrate considerable attention to the\nNyāya idea that universals are indeed such radically\nseparate entities but linked to particulars via an inherence\n(samāvāya) relation. The counter-arguments in\nPramāṇavārttika and\nSambandhaparīkṣā become technical, turning in\npart on the unreality of relations, but again the intuitive Buddhist\nstance is clearly that inherence, like universals, is an occult\nentity, posited ad hoc and without any discernible effects in the\nworld.\n1.2. Reality and momentariness\n\nWhat figures again and again in Dharmakīrti’s philosophical\narguments against universals and other pseudo-entities—and is a\nmajor innovation upon Dignāga—is the principle that what is\nreal must actually affect things and bring about a change. More\nexactly, the criterion for something being real is that it must have\n“causal powers” (arthakriyāsamartha) and\n“perform causal roles”\n (arthakriyākāritva).[10]\n And crucially, particulars have such powers and perform such roles\nwhile universals and other pseudo-entities do not.\nPramāṇavārttika III.3 (with Manorathanandin’s\nadditions in brackets) summarizes his idea:\n\n\nWhatever has causal powers (arthakriyāsamartha), that\nreally exists (paramārthasat) in this context [i.e.,\nwhen we examine reality]. Anything else is declared to be [just]\ncustomarily existent (saṃvṛtisat) [because it is\npractically accepted through mere conceptual fictions]. These two\n[i.e., the real and the customary] are [respectively] particulars and\n universals.[11]\n\n\nThings, properties, powers, whatever they may be, if real and causally\nefficient, must occupy just one location in time (kāla)\nand space (deśa) and have only a singular nature\n(svabhāva), by which Dharmakīrti means that nothing\nreal can span, or be present in, several distinct objects over\ndifferent times and places, and possess the many natures of the\nvarious\n particulars.[12]\n This not only rules out “horizontal universals”\n(tiryaglakṣaṇa), like blueness, which would have\nto be present in several blue particulars at one time, but it also\nrules out “vertical universals”\n(ūrdhvatālakṣaṇa), or substances\npersisting throughout time, the numerically identical individual that\nwould be present in each time-slice of a\n thing.[13]\n It is only series of qualitatively similar moments that constitute\nwhat we customarily take to be enduring objects, but there is actually\nnothing that remains numerically the same for more than one\ninstant.\n1.3 Two arguments for momentariness\n\nDharmakīrti has two arguments for the momentariness\n(kṣaṇikatva) of all that exists, one quite\nobscure and unconvincing, which he inherited from previous writers\nlike Vasubandhu (5 century C.E.), and the other more\n promising.[14]\n The first argument, which nowadays is commonly known as the\nvināśitvānumāna, or “the inference\nof things perishing [spontaneously],” turns on the long-attested\nBuddhist idea that perishing must be of the intrinsic nature of any\nobject. Perishing due to its intrinsic nature, something will always\nperish as soon it\n exists.[15]\n The point is that such moment by moment destruction is spontaneous\n(ākasmika) and is the uncaused real nature of things,\nbecause it cannot be an effect of any cause. The effect of such a\ncause, i.e., the absence of the entity, would have to be a type of\nnon-being (abhāva), and non-being is unreal.\n\nA key underlying principle of the\nvināśitvānumāna is that negative facts,\nsuch as absences, are not part of the ultimate furniture of the\nworld but are just fictional conceptual constructions, as they\nare devoid of causal powers. Equally, a fiction lacking causal powers\nis not the effect of something else. While it is obviously impossible\nto deny that hammers smash pots, the absence (abhāva) of\nthe pot, i.e., the non-existent pot, is not an effect, just as other\nnon-existent things (abhāva), like horns of rabbits, are\nnot effects of anything either. Hammers and the like are thus not\nactually causes of the pot’s absence but of it turning into potsherds.\nThat idea is perhaps defensible, in that arguably the mere absence of\nsomething—a purely negative fact—might be less real and\nless efficacious than the presence of other\n things.[16]\n Nonetheless, the rest of the argument looks to consist in a number of\nnon-sequiturs going from that difference in efficacy and\nreality between absences and presences to the idea that perishing is\nsomehow the real nature of things, that it must be intrinsic to them,\nand that therefore things must perish spontaneously moment after\nmoment. Let’s grant the Buddhist view that the perishing of x\nis the real property of changing into a new thing, and not just\nx becoming absent. If it is accepted that hammer blows\ndo change pots into potsherds, then why couldn’t someone\nskeptical about the Buddhist’s arguments just take that as\nthe model of how things perish when they do? It does not follow from\nthat model of perishing that a pot could not endure for quite a\nwhile.\n\nThere is, fortunately, a much better argument for intrinsic\nmomentariness than the problematic\nvināśitvānumāna. This argument is known\nas “the inference [of things’ momentariness] from the [mere]\nfact of [them] existing” (sattvānumāna), and\nseems to be largely Dharmakīrti’s own invention, first developed\nin the second chapter of his\nPramāṇaviniścaya. If anything exists and is a\nspecific thing rather than another, it is because of its causal\nefficacy (arthakriyā), or powers to produce such and\nsuch effects. Thus, the sattvānumāna reasoning,\nconcisely formulated, is that things are impermanent, i.e., are new\nthings moment after moment, because they are always causally efficient\nin some way. (Although not stated, it seems to be presupposed that\nreal things are every moment causing some or another\ndifferent effect. The differences between effects would be subtle ones\nthat often escape our perception.) The key step in the argument is\nthat nothing causes new effects while itself remaining the same.\nDharmakīrti, in the opening passages of the\nVādanyāya, argues that if something were permanent\n(nitya), it would be causally inert as it would neither\nproduce its effects all at once (yaugapadyena) nor serially\n(kramena). Of course, it is the second hypothesis that is the\nmost attractive possibility for an espouser of permanently enduring\nthings: he would hold that a permanent unchanging cause would produce\na series of different effects, not because the cause changes in any\nway, but simply because of the presence of new and different\nsurrounding circumstances.\n\n\nSuppose it said that a permanent thing has successive concomitant\ncircumstances in dependence upon which it brings about a collection of\neffects\n serially.[17]\n\n\nTo this objection, Dharmakīrti, and especially the later\ncommentators like Śāntarakṣita and\nKamalaśīla, reply that if a would-be cause remained\nunchanged over time and if it was only the concomitant circumstances\nthat changed, then it would have to be the new circumstances that were\nthe actual cause of the new effects. After all, the permanent thing\nwould be present unchanged both when the new effects are present and\nwhen they are absent. This failure of the co-presence and co-absence\n(anvayavyatireka) conditions for determining cause and effect\nwould show, for Dharmakīrti, that the ever-present thing is not\nthe actual cause of the new developments, but that something else is.\nThis is not unreasonable. If an epidemiologist, for example, found\nthat certain factors had been constant for quite some time before the\noutbreak of an infectious disease and remained unchanged at the time\nof the outbreak, he would tend to discount them as being responsible\nfor the epidemic. And if he found that some new powerful factors\nimmediately preceded the outbreak, he most likely would pin the\ncausality on them rather than on what had remained constant all along.\nThe logic in these arguments against permanence can be generalized to\nvarious would-be entities, including notably the non-Buddhist idea of\nthe permanent creator God (īśvara) who remains the\nsame throughout time while supposedly producing a series of\neffects.\n1.4 A causal theory of properties\n\nWe seem to have in Dharmakīrti what would nowadays be termed a\ntype of “causal theory of\n properties.”[18]\n Particulars have causal properties, that is, powers\n(śakti) or “fitness” (yogyatā)\nto produce such and such results, in that they will produce those\nresults when the right “complete collections”\n(sāmagrī) of circumstances and other properties are\nunited. And what makes any property what it is consists in the\ncontribution it makes to the potential causal behaviour of what has\nit.\n\nThe question then arises in what way particulars have properties or\npowers. It is important to emphasize that for Dharmakīrti and\nmany other Buddhists particulars are not separate entities that\nown or have separately existing properties/powers.\nMuch of the argument here in Buddhist Epistemology (and in other\nschools of Buddhism) is essentially an appeal to perceptual evidence\nand common sense: particulars are real and must be objects of\nperception; nobody perceives a particular without its properties, and\nindeed nobody can see a difference between the bearer of the\nproperties and the properties themselves; hence any such distinction\nis unreal. These reasons are also fleshed out into a fundamental\nposition, initially strongly advocated by Dignāga, that\nsubject-predicate differences in language do not mirror a\ncorresponding difference between substances and properties in reality\n(see\n section 2.2).\n Bare particulars that somehow have properties, or in which properties\nare instantiated, would thus be ruled\n out.[19]\n\nAre the powers themselves particulars or universals? It can be argued\nthat Dharmakīrti and his fellow Buddhists are best understood as\ntrope theorists: the powers/properties that make up\nparticulars are themselves particular entities, differing according to\neach location in space and time (see\n section 2.2.2).\n Charles Goodman and others have made a persuasive case that\nproperties (dharma) for Ābhidharmika Buddhists are\nindeed tropes, i.e., properties that are particular—a blueness,\na heat, or a hardness specific to one place-time and not common to\nseveral. The Epistemologists’ version of dharmas would be no\nexception in that respect of being particulars rather than\n universals.[20]\n The causal theory, however, does make for some significant\ndifferences from Ābhidharmikas. Many important\nĀbhidharmikas, i.e., those of the Sarvāstivāda school,\nregarded dharmas from a complex double perspective: a) their\nintrinsic natures (svabhāva), i.e., what they\nare, and b) their present causal activity\n(kāritra) along with their capabilities\n(sāmarthya) to lead to effects when the appropriate\ncircumstances obtain. The intrinsic natures of dharmas are\ngiven in terms of categorical properties—being blue, being\nsquare, being hard, etc—and are treated like quiddities, what\ndharmas simply are in themselves. The activities and\ncapabilities, on the other hand, are presented in causal terms, e.g.,\ngiving rise to perceptions of blue and square, producing subsequent\nsimilar things, etc. Not surprisingly, there are involved Abhidharma\ndebates on the relationship between the intrinsic natures and causal\nactivities/capabilities, a rather typically evasive\nSarvāstivādin response (i.e., that of Saṅghabhadra)\nbeing that they are neither the same nor\n different.[21]\n The most radical way out of this problem of the relationship between\nthe intrinsic and the causal is to say, as do Nāgārjuna and\nhis Mādhyamika followers, that there cannot really be any\nintrinsic natures at all: if anything had a quiddity intrinsically, as\nĀbhidharmikas and others hold, it would absurdly need to have it\ncompletely acausally—nothing could ever cause a thing to be what\nit is intrinsically. A less radical strategy is a causal theory that\nmakes no separation at all between what something is and what\nit does. That is the strategy that Dharmakīrti ably\n pursued.[22]\n\nLet us grant that for Dharmakīrti particulars are somehow\nidentified with appropriate causal powers. Is it then an essential or\nan accidental feature of a thing x that it will produce\ny under the appropriate conditions, and is it essential or\naccidental to y that it is caused by x? In a causal\ntheory of properties these features are generally taken to be\nessential. To what degree does Dharmakīrti subscribe to that? The\npoint needs analysis. On the one hand, Dharmakīrti does very\nstrongly advocate a type of connection that seems to be more than an\naccidental feature of things. This is the so-called “connection\nby essential natures” (svabhāva­pratibandha)\n [23]\n between cause and effect, and this connection will guarantee that\nthere is a “nexus where [the effect] will not be without [the\ncause]” (avinābhāvaniyama). Arguments\ninvoking this nexus can, for example, be seen in the\nPramāṇavārttikasvavṛtti’s discussion of\nI.34–47. He begins by introducing verse 34 as follows:\n\n\nWell, if observation and non-observation were no basis for knowing the\nco-presence and co-absence [of smoke and fire], how then does one know\nthat smoke does not deviate (na vyabhicarati) from\n fire?[24]\n\n\nDharmakīrti then argues that whatever is smoke must have\noriginated from fire in order for it to be smoke—otherwise it’s\njust a smoke-like thing, a pseudo-smoke. And he also says that if\nsomething like a “termite tower”\n(śakramūrdhan) did actually have the causal\nproperties of fire—i.e., the fitness (yogyatā) to\nproduce real smoke—then it indeed would be on fire (see\nDunne 2004, 335–338).\n\nThat said, on the other hand, there certainly is no development of a\nmodal logic of necessity and possibility and talk of possible worlds\nin Dharmakīrti, nor in Indian philosophy generally for that\n matter.[25]\n Although Buddhist Epistemologists do often talk of non-existent\nthings, like rabbit’s horns\n(śaśaviṣāṇa), it is far from clear\nthat they would predicate positive properties (say, sharpness) of them\nin such and such possible situations or “worlds.” What\nthen is the force of the “must” in the smoke-fire cases,\nand more generally when terms have a “nexus” so that one\nwill not be without the other? Words that are typically used in these\nkind of Dharmakīrtian discussions are niścaya\n(certainty) and avyabhicāra (not-deviating). Many modern\ninterpreters have used the term “necessity” in\ninterpreting these and related terms (See e.g., Dunne 2004, ch. 3;\nIwata 2004); this might lead one to think that when F and\nG have a nexus, it is a necessary truth (i.e., true in all\npossible worlds) that for all x, if x is F\nthen x is G. A more likely interpretation, however,\nis that Dharmakīrti is dealing with the actual world and that\nthese key terms are to be interpreted epistemically in terms of\njustification: given such and such natural connections between\nF and G, we can be sure that for all\nx, if x is F then x is G.\nTaking niścaya in this way, his point would not be about\nmetaphysical necessity throughout worlds but more about justified very\nstrong confidence that a universally quantified material implication\nholds without exception in the actual world because of natures in this\n world.[26]\n1.5 Humean and Dharmakīrtian causality\n\nA comparison with Hume may bring the tensions in Dharmakīrti’s\nposition into better focus. Hume had famously said in Section 7 of his\nEnquiry Concerning Human Understanding: “We may define\na cause to be an object followed by another, and where all the\nobjects, similar to the first, are followed by objects similar to the\nsecond.” Causal connections are said to consist in\ncontingent regularities established by observation. What the\nabove-cited passage from the\nPramāṇavārttikasvavṛtti suggests,\nhowever, is that for Dharmakīrti such mere regularities are\nsomehow not enough and that something stronger is at stake: there are\nfeatures “in” the causal relata themselves. Indeed his\ncausal theory of properties allows him to assert that fire, being what\nit is, must cause smoke under the right conditions and that smoke,\nbeing smoke, must be caused by fire. That being said, there\nare also very important passages in Dharmakīrti’s works\nwhere he does speak of establishing causality because one observes an\neffect when there is a particular cause and does not observe it when\nthat cause is absent. As in the case of Hume, this too is an\nobservation of regularities and would seem to be fallible, subject to\nexceptions. It is the Indian method of observing successive\nco-presence (anvaya) and co-absence (vyatireka) and\nis a type of induction used throughout Indian philosophy to establish\nconnections between two types of things. Dharmakīrti relies on a\nmulti-step procedure that is sometimes explained in terms of a\nthreefold combination of observations (upalabdhi) and\nnon-observations (anupalabdhi) and sometimes in terms of\nfive. Thus we have the so-called “triple” or\n“fivefold examination”\n(trikapañcakacintā) of causality that is\ndeveloped by later Buddhist writers, such as Dharmottara,\nJñānaśrīmitra and\n Mokṣākaragupta.[27]\n Other provisos are also added in an attempt to rule out certain bogus\ncircumstances that would vitiate the procedure (see e.g., Lasic 1999).\nThe details and problems cannot be taken up here. This method of\nanvaya and vyatireka has been profitably compared\nwith J.S. Mill’s “Method of Agreement and Difference” to\nestablish causation (see Matilal 1998,17; cf. Tillemans 2004,\n265–269).\n\nSo how are these passages in Dharmakīrti and the commentarial\nliterature to be taken? How do his two positions hang together? One\ninterpretation might be to say that Dharmakīrti, somewhat\nnaïvely, thought he could arrive at a thoroughly\ninfallible inductive procedure by ever more adroit qualifications of\nthe observations and non-observations. Gillon (1991) is an attempt to\nshow that Dharmakīrti’s philosophy, in attempting to come up with\nsuch a watertight procedure, ran up against a problem of induction\nthat wouldn’t go away. A more charitable exegesis is to say that his\nphilosophy recognizes that the way we find out through a\nposteriori methods whether or not x and y are\ncausally related is a quite different matter from what causality\nis—the latter, as we had remarked, involves causal\nproperties of things that make them what they are. Thus we might have\nto discover empirically that fire will burn fuel under such and such\nconditions, but nonetheless that property is not one that it could do\nwithout and still be fire. The more sophisticated interpretation of\nDharmakīrti would then be that causality between things is a\nmore-than-contingent connection due to the constitutive properties of\nthings in this world, but nonetheless one that is established a\nposteriori. To take a modern analogy in a Kripkean vein, while\nwater must be H2O and whales must be mammals, we discover those facts,\nwhich in some sense could not be otherwise, through empirical\nmethods and fallibly  .\n2. Epistemology and philosophy of language\n\nHere is the basic epistemological stance that Dharmakīrti\ninherited from Dignāga’s Pramāṇasamuccaya.\nJust as there are only two kinds of objects of knowledge, real\nparticulars and fictional universals, there are only two types of\nknowledge, or more exactly “sources of knowledge”\n(pramāṇa), viz., “perception”\n(pratyakṣa) and “inference”\n(anumāṇa). Perception is always purely\nnon-conceptual and non-linguistic whereas inference is conceptual,\nlinguistic\n thinking[28]\n that proceeds on the basis of good reasons. Particulars are the\nobjects of perception and universals are the objects of\ninference—one sees specific shapes, colors, but when one thinks\n“red is a color” the subject and predicate terms range\nover several things. Perception has the special status of giving\ndirect access to the real, whereas conceptual thought is, in an\nimportant way, distorted (bhrānta) because it\n“superimposes” universals that aren’t actually there in\nthe particulars themselves.\n\nFor Dignāga (and his successors) this split between perception\nand conceptual thought was part and parcel of a type of\nfoundationalism. Perception is directly causally bound to particulars\nand “fixed” (niyata) by them: its internal\nrepresentation (ākāra) of the object is causally\ndetermined by, and corresponds to, the particular itself. It is for\nthat reason that perception is the fundamental “contact”\nwith the world upon which the superstructure of conceptual cognition\nrests; conceptual cognition, on the other hand, is not fixed in this\nway by particulars and can to a large degree think what it will about\nwhatever it chooses. The separation between perception and conceptual\nthinking in Pramāṇasamuccaya is thus radical\nindeed and yields what seems to be a counterintuitive consequence. For\nDignāga it would seem that one and the same object could never be\nboth perceived and thought about. Non-Buddhist thinkers, such as\nNaiyāyikas and Mīmāṃsakas, did not have this\nproblem. They could cheerfully allow that when one person sees a vase\nand another thinks about it, the type of understanding may be\ndifferent but the object is the same in that the conceptual thought\ngrasps a real universal vaseness that inheres in the same particular\nvase that is perceived. But Dignāga could not go that route as a\nnominalist. For him if the object of thought is vaseness, that object\nis unreal and thus quite different from the real particular vases that\none sees.\n\nTwo problems loom large in Dignāga’s account: (1) What are the\nnecessary and sufficient conditions of a source of knowledge\n(pramāṇa) and when are we justified in thinking\nthat these conditions are met? (2) Given that only perception has\ndirect access to the real and is causally bound to it, how is it that\nconceptual thought could ever be about real particulars at\nall and be considered a genuine source of knowledge? We’ll take up the\nquestions one by one.\n2.1 Pramāṇas and justification\n\nDignāga had left the problem of the nature of\npramāṇas largely open, as he did with the issue of\njustification. These matters were left to Dharmakīrti, who\ndefines a “source of knowledge” in\nPramāṇavārttika II.1 as a “reliable\n(avisaṃvādin) cognition\n(jñāna),” by which he means that the\ncognition is right and reliable as a basis for\n action.[29]\n Some commentators, such as Dharmottara, have unpacked\n“reliability” as meaning that the cognition leads to one\nobtaining (prāpaka) the object one desires, a position\nwhich, along with passages concerning arthakriyā, might\nseem to reinforce the view of some modern scholars that\nDharmakīrti was a pragmatist (see e.g., Powers 1994; Cabezon\n2000; Katsura 1984).\n [30]\n Tillemans (1999, 6–12) examines this would-be pragmatism,\nseeing the theory of truth in Dharmakīrti as a weak form of\ncorrespondence. The pragmatism is better taken as a pragmatic theory\nof justification rather than truth. We can justifiably affirm that a\ncognition is correct if we can “confirm causal efficacy”\n(arthakriyāsthiti), by which it is meant that we come to\nunderstand that the object does in fact have the causal powers we\nexpected. We can justifiably conclude, for example, that we saw a vase\nand not some vase-like illusion because after the initial perception\nwe then confirmed that what we saw does really hold water, as we\nexpected and wished (iṣṭa). Note that while most\nsense perceptions are to be confirmed by subsequent perceptions or\ninferences, there is no infinite regress here: some\nperceptions—e.g., those of very familiar objects or of the\ncapacity of such objects to produce effects—need no subsequent\nconfirmation. Logical inference too needs no ulterior confirmation.\nThese are said to be “intrinsically sources of knowledge”\n(svataḥ prāmāṇya) and are prima\nfacie reliable in that they will be trusted as knowledge unless\nit is shown that some cause of error is\n present.[31]\n\nIt is important to emphasize, against a simplistic pragmatic\ninterpretation of Dharmakīrti’s position, that a reliable\ncognition is not one that just happens to be right and works\nto enable one to obtain what one seeks. It must also be a cognition\nthat came about via a reliable route, i.e., an appropriate causal\npathway or a set of good reasons. Tibetan scholars will emphasize that\nto conceptually know P the knower must herself ascertain\nP (Tib. nges pa = Skt. niścaya,\nniścita) with a pramāṇa, and that this\nascertainment must itself involve antecedent reliable cognitions\n(i.e., perceptual or conceptual pramāṇas) in order\nto be genuine. Thus, for example, one ascertains P\non the basis of good reasons Q, R, etc., whose\ncharacteristics one has ascertained earlier. If, however, one rightly\nthinks P is the case, but did “not [first] ascertain\nwith a pramāṇa” (tshad mas ma nges\npa) the characteristics of Q, R, this is deemed\nto be, in Geluk (dge lugs) texts, a “true presumption\nwhere the [character of the] reason was not determined” (Tib.\nrgyu mtshan gtan la ma phab pa’i yid dpyod), or following the\nSakya (sa skya) thinkers, a mere “doubt that is in\naccord with the real” (Tib. the tshom don mthun). For\nboth these Tibetan schools, such an understanding of P is not\nitself a pramāṇa. This is a credible account of\nwhat Dharmakīrti held. In short, pramāṇas do\nwork out as we wish, but only because they are cognitions that have\nfollowed the requisite reliable route.\n\nBut does this talk of ascertainment then mean that the Buddhist\nEpistemologist adopts an internalist account of epistemic\njustification? Is the Buddhist saying that when you genuinely know\nsomething, you need to know that you know it, i.e., be able to\nestablish to yourself and others that you have the requisite\njustification?\n [32]\n It is not at all clear that Dharmakīrti or his Tibetan\ninterpreters were internalists about epistemic justification. Nothing\nin his own talk of “ascertainment” clinches an internalist\ninterpretation that the person who infers must also himself access the\nreason and ascertain with a pramāṇa that it does\njustify the inference. When the debater ascertains the characteristics\nof the reason, all this may mean is that a person making an inference\nmust only in fact have followed a number of reliable\nprocedures to initially determine the characteristics of the reason.\nIt need not mean that when one knows something inferentially one must\nalso be aware of the justification basis, i.e., the reason, and know\nthat it does indeed justify the inference.\n\nIt might be retorted that Dharmakīrti’s idea of all awareness\nbeing “reflexive awareness” (svasaṃvedana)\nshows his internalism. But “reflexive\nawareness”—often termed “self-awareness” (even\nthough for Buddhists it is emphatically not an awareness of a\nself and its states)—will not get us all the way to internalism\nabout justification either. Following Williams (1998), Kellner (2010)\nand Arnold (2010), there seem to be to be two basic themes in the\npositions from Dignāga and Dharmakīrti to\nŚāntarakṣita that all consciousness is\nnon-conceptually reflexive: (1) that the mind perceives such and\nsuch objects as well as how it experiences those objects; it is thus\nnon-conceptually aware of the objective and subjective aspects\n(ākāra), or appearances\n(ābhāsa), of all its states; (2) that reflexive\nawareness is a condition of sentience: an experience is not just a\nmaterial process (like, say, digestion), but can lead to subsequent\nmemory and conceptualization because it is non-conceptually\n “auto-illuminated.”[33]\n On both versions, however, while someone could be aware that she is\nnow inferring P in reliance upon a reason Q, it is\nhard to see that her simple awareness of processes “going on in\nher head” would also mean that she herself would know that or\nwhy the inference was justified. Reflexive awareness is aware of\nwhatever conscious processes are occurring, be they delusions\nor reliable. So, while a person would be aware of the brute fact that\nthoughts were occurring, their credentials are another matter.\n2.2 Aboutness: the theory of apoha\n\nAt the heart of Dignāga’s and Dharmakīrti’s philosophies is\nthe principle that particulars, i.e., what is real, are only properly\ngrasped by perception; the way they are in themselves is thus said to\nbe “ineffable” (avyapadeśya; Tib. bstan\nbya min), “not an object of words”\n (śabdasyāviṣaya).[34]\n Now, obviously, we do in some way manage to talk about\nparticulars—otherwise language would be useless in daily life.\nBut why then say that language and thought fail to capture them?\nThe answer is twofold. First of all, grammatical elements, like\nsubject and predicate, qualifier and qualificand, agent and action,\netc., have no corresponding ontological features, as particulars are\nunities admitting no distinctions between possessors of properties\n(dharmin) and properties (dharma). Dharmakīrti\nputs the point as follows in Pramāṇavārttika\nI.61:\n\n\nIn all cases words expressing substances and their properties just\nmake this [conceptual] distinction. Thus there is no difference\nwhatsoever in the [object] to which they\n refer.[35]\n\n\nSecondly, and perhaps more decisively, the kinds or universals that we\nthink and talk about are not features of the particulars themselves\nbut are merely fictions. Of course, the fact that we do use terms like\n“cow” non-arbitrarily may easily lead us to think that the\nterm must have corresponding real “grounds for its\napplication” (pravṛttinimitta),\nand that cow particulars themselves are grouped in a natural\nkind due to their common essential properties. But the\nclear upshot of the Buddhist’s nominalist position about universals is\nthat there are no such natural kinds, and that the usage of terms is\nnot explicable by matching up terms with them.\n\nIneffability thus unpacks as a thorough mismatch between\nrepresentations due to thought and language on the one hand and what\nthere is on the other. For Buddhist Epistemologists this mismatch\nmeans that they cannot adopt unnuanced the predominant Brahmanical\napproach of vyākaraṇa, a grammatically oriented\nmetaphysics in which genuine ontological features would be revealed by\nthe features of Sanskrit grammar (such as case and gender accord\nbetween adjectives and nouns, connections between substantives via the\ngenitive case, etc. Much of Dignāga’s philosophy of language is\nindeed an attempt to account for such Sanskrit grammatical phenomena,\nbut without the realist baggage.) However, it also leads to a larger\nmatter. The problem is that if the real world is composed only of\nparticulars that are ineffable, it becomes difficult to see how\nlanguage could nonetheless somehow refer to real things or ever be\nabout entities in the world. The Buddhist Epistemologists\nare, in effect, to borrow an idea of Donald Davidson (1984),\nsubscribers to a rigid separation between a conceptual scheme\nand a perceptual content free from the scheme’s additions and\ndistortions, and their problem then becomes how to bridge that very\nscheme-content gap so that thought and language are still somehow\nabout reality. To solve this problem of “aboutness”\nDignāga had devised the theory of concepts, i.e., apoha\n(“exclusions”). Dharmakīrti reinterpreted this\ntheory, once again, in terms of causal relations. Here are the broad\n outlines.[36]\n2.2.1 Dignāga’s apoha\n\nLet us speak about two Buddhist approaches to bridge the\nscheme-content gap, “top-down”, or descriptive, approaches\nand “bottom-up”, or causal, approaches. By\n“top-down” we shall mean an account which maintains that\nit is because of some specific (and perhaps ingenious) features of the\nfictional proxy, or concept, that it pertains to particular things.\nEven though it does not have the ontological baggage of a real\nuniversal, the fictional proxy determines the reference of the words\nbecause the descriptive content it provides does in some way have its\ncounterpart in the objects. Thus on a top-down approach, the fictional\nstand-in for a universal like “blueness” would behave like\na property, a sense or a meaning, that belongs to the conceptual\nscheme but would nonetheless qualify and serve to pick out the real\nblue particulars in the world. This can be accomplished, according to\nBuddhist Epistemologists, because the fictional proxies are, or can be\nanalyzed to be, “exclusions of what is other”\n(anyāpoha), a type of double negation which applies to\nparticular patches of blue in the sense that each such patch is\n non-non-blue.[37]\n As Dignāga had put it in his\nSāmānyaparīkṣā (“Analysis of\nUniversals”):\n\n\nA word talks about entities only as they are qualified by the negation\nof other\n things.[38]\n\n\nIn fact, Dignāga applied his analysis both to things and to the\nwords that express them: non-non-blue is the universal-qua-object\n(arthasāmānya) signified by the term\n“blue”, and non-non-“blue” is the\nuniversal-qua-word (śabdasāmānya) that applies\nto particular articulations of the word “blue”. For\nDignāga, the signified-signifier (vācyavācaka)\nrelation holds between these two\n quasi-universals.[39]\n\nWhy are they “quasi” and not full-fledged universals? The\nreasoning is not explicit in Dignāga. However, it can be\nplausibly reconstructed. Buddhist Epistemologists generally subscribed\nto the principle that mere absences of properties are of a lesser\nontological status than positive things. They would stress that\nnegative facts, like x not being blue, heavy, etc., are\nconstituted by our mere interests (i.e., we seek a blue thing at such\nand such a location and come away empty-handed), and are less real\nthan the fact that x causes perceptions of blue, a fact which\nis what it is objectively and independently of interests. It seems\nthat it is this general Buddhist intuition of the unreality of\nabsences upon which Dignāga relied. As the “exclusion of\nwhat is other” is itself only a negative property/absence of\nsomething rather than a presence, we are spared commitment to there\nbeing real universals in addition to real particulars.\n\nDignāga’s approach in the fifth chapter of\nPramāṇasamuccaya is indeed top-down in that he\nrelies upon the descriptive content of the apoha to pick out\nthe appropriate particulars. And top-down is also how the\n“exclusion theory” (apohavāda) is presented\nin the works of non-Buddhist opponents of Dignāga, as well as in\nmodern works treating of the subject. Bimal K. Matilal interpreted the\ntheory in this fashion (see Matilal 1971, 41), as did Hans Herzberger.\nHerzberger (1975), developed an ingenious logical strategy, using some\npossibilities offered by Emil Post’s theory of twofold propositions,\nto come up with what he termed a “resourceful nominalism,”\none that would explain how predicates applied non-arbitrarily to\nindividual things, that would account for our naïve semantic\nintuitions, and that would nonetheless avoid ontological commitment to\nuniversals. Every proposition would be analyzable as an ordered pair\nof content and commitment—“apohist double negation”\nwould affirm content but deny ontological commitment. In what seems to\nbe at least partially a top-down approach, Mark Siderits has taken the\nrelevant double negation as involving two different types of negation,\nchoice and exclusion, so that it is the combination of the two that\npicks out a class of individuals, all the while staying\nnominalistically unengaged to universals (Siderits 1995; 2005).\nFinally, perhaps the most striking modern use of a comparable double\nnegation—i.e., difference from others— is\nthe view in the Cours de linguistique\ngénérale of Ferdinand de Saussure\nthat word-types and phonemes are only characterized by their\ndifferences from other ones in a system, although this\n19th–20th century Swiss structuralist was\nneither aware of possible 6th century parallels in Indian\nphilosophy nor motivated primarily by nominalist ontological\nworries (see D’Ottavi 2010).\n\nIt remains far from clear, however, how genuine nominalist mileage is\nto be gained on a top-down approach, ingenious as it may be. The usual\ncharge against it by non-Buddhist critics, like Kumārila and\nUddyotakara, is circularity: if an understanding of blue is to be\nanalyzed as an understanding of non-non-blue and any negation\npresupposes understanding the negandum, then understanding what\nnon-non-blue is would depend on understanding blue—we go round\nin circles. Hugon (2011) gives Dharmakīrti’s response to that\ncharge, which consists essentially of a tu quoque\nargument—one needs to understand what a term excludes as much as\nwhat it applies to. Hale (2011) reformulates the difficulty as being\nthat the Buddhist seems to run counter to the compositionality of\nlanguage; he argues that the non-Buddhist criticism will thus remain.\nThe problem is discussed intensely by Indo-Tibetan thinkers, like\nŚāntarakṣita (for further discussion, see the entry on\n Śāntarakṣita)\n and Sa skya Paṇḍita (see Hugon 2008, 479–485,\n205–210). What is striking is that while it can certainly be\nargued—as these thinkers do—that a meaningful term\npresents both a class of things to which it applies and another to\nwhich it does not apply, it is difficult to see how the latter would\nor should occupy a privileged place. Why would we understand words\nfirst and foremost by the via negativa?\n2.2.2 Dharmakīrti’s causal version of apoha\n\nOn a bottom-up approach, on the other hand, the double exclusion plays\na comparatively minor role, and thus some of the\nKumārila-Uddyotakara criticisms may be less telling. Causal\nchains and error are what serve to bridge the scheme-content gap,\nrather than the descriptive content of the apoha. It is\nnotable that such reliance on causality seems to be entirely absent in\nDignāga: it is Dharmakīrti’s major contribution to the\ntheory. The way words link to things is thus primarily explained\nthrough the existence of a causal chain from particular things to\nperceptions to thoughts and to the utterances of words—in short\nwe have a type of causal theory of\n reference.[40]\n While modern day causal theories of reference—such as that of\nSaul Kripke—are typically used to explain how proper names can\nrefer without descriptive content, the theory can be extended in\nvarious ways to kind terms. Such is the move of Hilary Putnam who\nemphasized that descriptive content, or at its simplest just\n“what is in one’s head,” is not enough to distinguish\nbetween seemingly similar kinds. Dharmakīrti’s causal theory too\nis not restricted to the reference of proper names, but also seeks to\nexplain causally reference to kinds of things. The causal connection\nis needed to guarantee “contact” with the world, i.e.,\nthat language ultimately must rest upon perception, which is\nnon-abitrary in that it is “fixed” by things.\nDharmakīrti thus explains how an individual (to be called\n“Jones”) can think about and refer to such and such an\nobject in the world through a complex and long causal chain from the\nparticular objects to the mental invention of a quasi-universal and\nthe use of a word on a specific occasion. Thoughts and talk of blue\nare thus about blue things because only blue things play the\nappropriate causal role in leading to the thought and finally the\n word.[41]\n\nHere are the bare bones of the causal account as we find it in the\nPramāṇavārttika: Jones sees particular blue\nthings and they cause perceptual images (ākāra) in\nhis mind; these images (and often other factors, like longstanding\nhabits) cause him to make the “same judgment”\n(ekapratyavamarśa), “This is blue,” a\njudgment to which appears an apoha, i.e., a generic\nrepresentation of non-non-blue. Because the particular perceptual\nimages all have the same effect in leading to the same judgment\n“This is blue”, they all therefore share a key causal\npower and are grouped together. The judgments and resulting use of\nwords are about blue things, and not red things, precisely because\nthere is a causal chain from blue particulars and there isn’t one from\nred\n particulars.[42]\n\nSo much for causal connections replacing real universals to group\nentities. How then do words refer to grouped entities via a causal\nchain? And how does the causal chain get passed on over time in a\ncommunity of speakers? It looks like we have something much like the\ntwo-fold process of reference-fixing and reference-borrowing that\nfigure in causal theories of\n reference.[43]\n\nThe initial reference-fixing is done “at the time of\n[establishing] the linguistic convention”\n (saṃketakāle)[44]\n by dubbing a sample case with the words, “This is blue”.\nThis dubbing is a purely causal event not dependent on any descriptive\ncontent. It is an arbitrary choice, or speech-intention\n(vivakṣā), of the dubber to designate a blue\nsample with the term “blue” rather than\n another.[45]\n Other things will then also be grouped together under\n“blue” by the combination of perception and judgment\ndescribed above. This initial reference-fixing is then preserved in a\ncommonly respected convention that transmits the original intention\nand dubbing from speaker to\n speaker.[46]\n Subsequently “at the time of using [language]\nconventions” (vyavahārakāle) other speakers\nwill rely on their previous habits, or “imprints”\n(vāsanā), and the earlier reference-fixing that is\nnow a well-established convention in the community. Although speakers\ncould in principle use the word “blue” to refer to, say,\nthe colour of chocolate, practical considerations generally mean that\nthey won’t: if someone wishes to tap into the causal chain transmitted\nfrom the initial dubbing, she will use “blue” for blue\nthings exclusively.\n\nDharmakīrti’s version of the apoha theory is developed\nin long sections in several chapters of\nPramāṇavārttika. No doubt, many questions\nneed a fuller treatment. Here are two of the main ones. (1) Given that\nthis is a causal rather than descriptive account of aboutness, what\nrole remains for the apoha, i.e., the double negations upon\nwhich Dignāga had placed so much emphasis? (2) Wouldn’t having\nthe same powers to produce such and such a judgment depend on having\nsome common universals, or even itself be a common universal, and thus\nforce us to reinstate realism?\n\n(1)\nDharmakīrti and his commentators constantly account for the\nmental content of thought in terms of generic representations that are\n“exclusions of what is other” (anyāpoha),\nthis from the “time of [establishing] the linguistic\nconvention” (saṃketakāla) to the “time\nwhen one uses the convention”\n(vyavahārakāla). But if aboutness is indeed assured\ncausally, what is the theoretical interest of anyāpoha?\nEither Dharmakīrti’s theory of reference is not purely causal,\nbut is a hybrid theory involving both causal and descriptive\n elements,[47]\n or anyāpoha is not there in Dharmakīrti’s theory\nto assure aboutness/reference but is his response to another type of\nconcern. Although there certainly are modern hybrid theories of\nreference combining the causal and the descriptive, it is not clear\nhow (or if) Dharmakīrti proposes to do that. What seems more\nlikely following\nPramāṇavārttikasvavṛtti ad 68–75\nand ad 128 (see Dunne 2004, 134–136 and 339–352) is that\nanyāpoha is there in the theory essentially to answer\nmetaphysical worries. Granted that we think that the mental content,\ni.e., the generic representation, has a distribution (anvaya)\nover several instances, is it genuinely distinct from or the same as\nthe instances? In the former case, it would not apply to them; in the\nlatter case it would itself be a particular and unable to apply to\nother particulars. The postulate of anyāpoha is designed\nto avoid that dilemma of a quasi-universal being the same or\ndifferent—it is neither as it unreal. As Dunne (2004, 136) puts\nit: “…by relegating distribution to a negation,\nDharmakīrti blocks any attempt at raising distribution (or a\ndistributed entity) to the level of ultimate reality.”\n(2)\nThat multiple particulars all have the same power to produce the\nsame judgment is not, for Dharmakīrti, itself based on any\nunderlying same intrinsic features that would explain why this is so.\nIn Pramāṇavārttika III.73–74 he cites a\nfamous example of different plants that all have the capacity to\nalleviate fever, but where one cannot point out any features in common\nthat would account for the fact that all the various plants work as\nfebrifuges. Similarly for particulars all causing the same judgment:\nthere is no common property that would explain why this\n happens.[48]\n But can’t one say that all of them having that capacity just\nis possession of a common universal, i.e. having the power to\nproduce the same judgment? Lacking that common universal-feature, how\ncould we judge that the particulars have the same power? This argument\nshould seem déjà vu for the nominalist. We’ve\ncome full circle back to realist’s basic worry: how could we group\nthings without there being some real universal in common?\nDharmakīrti’s response is to say that in fact particulars don’t\nreally possess a common power, if one means by that a power that would\nitself be a universal. The powers themselves are all particulars and\ndiffer from each other—the way one plant works is not the way\nthe other works to cure fever and the way one blue particular causes\nthe judgment “This is blue” differs from the way another\ndoes. These multiple ways exhibit no intrinsic properties in common\nthat would explain why they all work to produce a desired common\neffect. At most there is just the negative grouping of being distinct\nfrom everything which lacks the power, and that, as we know by now, is\nan apoha and not a real property.\n\n3. Logic and Philosophy of logic\n\nThe way the Dignāga-Dharmakīrti school represent the mental\nprocess of reasoning is that one thinks: “A is\nB because of being C, like D.” More\nspecifically, one invokes a logical reason C to prove the\ntruth of the conclusion A is B; the example\nD, which is actually sometimes omitted, is a commonly\nacknowledged case of B-ness and C-ness that permits\nan individual to understand that all Cs are indeed\nBs. The latter generalization is known as\n“pervasion” (vyāpti; Tibetan khyab\npa) of C by B—a universally generalized\nmaterial implication, for all x: if x is C then x is B, with\nthe interesting feature that the quantification ranges over both\nactual and non-actual items. (The indispensability or dispensability\nof the example for one to ascertain/establish the pervasion becomes a\nhotly debated topic amongst later\n theoreticians.[49])\n\nThere is also an important variant where the truth of\n“A is B” is not being established, but\nonly the fact that it would follow from an acceptance\n(abhyupagama) of A being C. Thus a debater\ncan present an opponent with a prasaṅga (consequence)\nof the sort: “It would follow absurdly that A would be\nB, because of being C.” Such a consequence\nwill constitute the key step in a proof by reductio ad absurdum, a\nproof that will culminate in a type of contraposition, turning on\nmodus tollens. When the pervasion in the consequence holds\nand the opponent understands that A is not in fact\nB, the opponent will then be led by a “contraposition\nof the consequence” (prasaṅgaviparyaya, literally\n“reversing the consequence”) to understand that A\nis not in fact C because of not being B. Both these\nstructures, i.e., proofs by logical reasons and consequences, are to\nbe found in Indian and Tibetan writing on a variety of subjects.\n3.1 Good reasons and the triple criterion\n\nSince T. Stcherbatsky’s two volume study and translation of\nDharmakīrti’s Nyāyabindu, entitled Buddhist\nLogic (i.e., Stcherbatsky 1930/32), one often sees the Buddhist\ntheory of reasons/indices designated as “logic,” a term\nthat sometimes has the unwanted effect of leading readers to think\nthat good reasons for Buddhists are simply those that are formally\nvalid. In fact, the notion of formal validity (i.e., the conclusion’s\nbeing guaranteed true, provided the premises are true) is not\nitself explicitly discussed by Buddhist\ntheoreticians; it is in any case not distinguished from other, more\ninformal, considerations. Instead of formally valid reasons, Buddhist\ntheoreticians developed the notion of a good reason\n(saddhetu, Tibetan rtags yang dag), i.e., one which\nsatisfies a triple criterion (trairūpya). These three\ncriteria for “goodness” are given in the following fashion\nfrom Dharmakīrti on:\n\npakṣadharmatva (the logical reason’s being a\nproperty of the subject): the subject A is ascertained\n(niścita) as having the property C;\nanvayavyāpti (pervasion [that is formulated] as\nco-presence ): C is ascertained as present in only instances\nthat are similar (sapakṣa) to A insofar as\nthey possess B;\nvyatirekavyāpti (pervasion [formulated] as\nco-absence): C is ascertained as wholly absent from instances\ndissimilar (vipakṣa) to A insofar as they do\nnot possess\n B.[50]\n\n\nTrue, in texts like the Hetucakra of Dignāga (which was\ntaken up in detail by Dharmakīrti in\nPramāṇavārttika IV and\nPramāṇaviniścaya III), a version of the\ntriple criterion (trairūpya) for good reasons and the\noperators “partial presence,” “complete\npresence,” and “complete absence” were correlated to\nyield a series of nine types of reasons, types that are\nabstracted from content and subject matter. Not inappropriately, the\ngreat historian of logic, Innocentius Bocheński, in the chapter\non Indian Logic in his History of Formal Logic, stated that\nthe Hetucakra thus suggested an awareness of formal\nconsiderations. R.S.Y. Chi, in his Buddhist Formal Logic (Chi\n1984), went several steps further and attempted to show that the\nHetucakra, taken in its formal aspects, might present a\nnumber of interesting features to a modern logician. That being said,\nthere is certainly much more to “good reasons” satisfying\nDharmakīrti’s triple criterion than simple formal validity. The\nterm “ascertained” (niścita), when unpacked\nby Dharmakīrti and his commentators, demands that good reasons\nmust be sound (i.e., the premises must in fact be true and the\nconclusion must follow from them), that their three characteristics\nmust be ascertained, and that the opponent have the appropriate\n“desire to know” (jijñāsā)\nsomething new that he does not already know. This latter demand leads\nto a host of other requirements: in order to be convinced of something\nnew the opponent must have the requisite doubt, understand the terms\nand accept the subject of debate. In short, good reasons involve\nformal considerations (what follows from what?); factual\nconsiderations (what is so? what is true?); epistemic considerations\n(what needs to be known in order for people to genuinely know\nsomething else? when is doubt possible?); and what can be termed\n“rhetorical considerations” (what is newly convincing to\nwhom? when does the debate have a point and when does it fall flat?).\nThe weighting of these aspects in the theory of the “triple\ncriterion” changes over history in complex fashions. At certain\npoints what were factual matters become epistemic matters, and this\neven leads to interesting reorientations of the triple\n criterion.[51]\n3.2 Inference-for-others\n\nLater theoretical elaborations by Dignāga, Dharmakīrti, et\nal. about how to present publicly (i.e., verbally) a good\nreason (saddhetu) to an adversary in a debate prescribe the\nuse of complex verbal forms known as prayoga (formal\nreasonings). Thus, for example, the standard formal reasoning that\nDharmakīrti and his Indo-Tibetan successors prescribed\nwas a two-membered form, known as an\n“inference-for-others”\n(parārthānumāna):\n\n\nAll Cs are Bs, like D.\n\nA is C.\n\n\nCommentators make an explicit correlation with the triple criterion\n(trairūpya). Thus the first statement perspicuously\nexpresses the pervasion (i.e., the anvayavyāpti and\nvyatirekavyāpti) and the second expresses the fact of\nthe reason being a property of the subject\n(pakṣadharmatva). The statement of the conclusion,\nA is B, is omitted. Indeed it is explicitly ruled\nout in later prescriptive accounts of how Buddhists should argue.\nDharmakīrti’s own position on this hardens over time to arrive,\nin the Vādanyāya, at the view that stating the\nconclusion is actually a “point of defeat”\n(nigrahasthāna). The irrelevance of the conclusion is\nsupposedly because the only function of an inference-for-others is to\nshow “provers” (sādhana), and a conclusion\ncannot prove itself. Although A is B, i.e.,\n“what is to be proved” (sādhya), can be\nunderstood indirectly, it should not be stated. While the\ninference-for-others has often been thought to somehow formally\nresemble a syllogism in Aristotelian logic, it is apparent that the\npresence and absence of conclusions in syllogisms and\ninferences-for-others respectively as well as the idea of what\nconstitutes a “prover” for Buddhists, means that\nparārthānumāna and Aristotelian syllogisms are\naccounted for in terms of considerably different philosophies of logic\n(see Tillemans 1999, 69–87).\n3.3 Opaque contexts\n\nWhile provers (sādhana), i.e., logical reasons and\nexamples, can of course be expressed in words, as in a\n“public” inference-for-others, they are not themselves\nwords. Although Dharmakīrti et al. speak in terms of one\nstate of affairs, or one entity (artha), proving another, in\nfact the picture has all the complex features of the scheme-content\ngap and its bridges: logical reasoning is a mental process that\ndirectly treats of fictional proxies, i.e., concepts, which are in\nturn connected in apoha-fashion to real particular entities.\nNot surprisingly, the idea that provers are apoha-properties\nrather than words has its philosophical complexities. When do we have\nthe same property and when do they differ? When a pervasion is\nbidirectional, or \"equal\" (samavyāpti), as in the case\nof being impermanent (anityatva) and being produced\n(kṛtakatva), it’s quite easy to see that the\nimpermanent particulars will be identical with the produced\nparticulars. Given that the bidirectional pervasion analyzes as\n“for all x, x is produced if and only if\nx is impermanent”, the extension of the two concepts\n(i.e., the set of impermanent particulars and the set of produced\nparticulars) is the same for Buddhists. Nonetheless, substitutivity of\none term for the other would seem to lead to an invalid inference\nwhere the premises are true but the conclusion is not. To bring out\nthe problem, take the following tempting, but invalid, inference:\n\n\n\n\nBeing a product is a good reason for proving that sound is\nimpermanent. \n\nBeing a\nproduct is coextensive with being impermanent (i.e., for all\nx: x is a product if and only if x is\nimpermanent). \n\nTherefore, being impermanent is a good reason for proving that\nsound is impermanent.  \n\n\n\nWe go from two true premises to a false conclusion, for it is clear\nthat for a Buddhist (as for most people) arguing that something is so\nsimply because it is so is not giving a good reason. And yet\nit might also be thought that the move from premises to conclusion is\nan acceptable application of the principle of substitutivity of\nidenticals for identicals salva veritate. What went\nwrong?\n\nDharmakīrti, in Pramāṇavārttika I verse\n40 et sq. and Svavṛtti, diagnosed the problem as one of\nbidirectional pervasions (i.e., coextensive concepts) seeming to force\nus to accept pratijñārthaikadeśahetu\n“reasons that are one part of the thesis” (e.g., when one\nsays “sound is impermanent because it is impermanent,”\nthen the reason “being impermanent” is also a part of the\nthesis that is being proved). He saw this undesirable consequence as\none of the main challenges to logical thought, i.e.,\n“inference,” being a source of knowledge\n(pramāṇa), for unless one can somehow rule out the\nproblematic substitutions in what I have called the “tempting\ninference,” we would be saddled with having to accept as good a\nhuge number of singularly uninformative reasons.\n\nThe problem is recognizably the familiar one of substitutivity in\nreferentially opaque contexts, such as propositional attitudes and\nmodal\n contexts.[52]\n Talk of good reasons being ones where the debater has a desire to\nknow P but not an equivalent Q is indeed an opaque\ncontext. To analyse what goes wrong in the tempting inference,\nDharmakīrti, in effect, made a recognizable move by\ndistinguishing between types of identities: “being\nimpermanent” and “being produced” are extensionally\nidentical, but somehow not intensionally so—what he terms being\nthe same concept, i.e., exclusion (apoha;\nvyāvṛtti). And in the opaque context substitution\nshould only be made between conceptually identical terms.\n\nIn fact, though, it could be said that the usual idea of an\nintensional identity (one that is understood to hold between\nproperties F and G when the biconditional for\nall x: x is F if and only if x is G is true in all possible\nworlds) will not get us very far out of the woods, as being\nimpermanent and being produced are arguably identical in that\nway, and it would thus seem that if that is what conceptual\nidentity is about for a Buddhist Epistemologist it should be\npossible to make the substitution in the opaque contexts under\ndiscussion. Dharmakīrti’s idea of concepts F and\nG being identical thus demands a much stronger criterion than\nthe necessary truth of the biconditional for all x: x is F iff x\nis G. In his Svavṛtti ad verse 40 and in\nconsiderable detail in the Tibetan Geluk (dge lugs)\n“Collected Topics” (bsdus grwa) literature and\ncommentaries on Pramāṇavārttika, we find the\nmakings of an idea of “conceptual identity/difference”\n(Tibetan ldog pa gcig/tha dad) such that to each meaningful\nsubject or predicate term in a language there is a different\nconcept—synonyms, for example, will express different concepts.\nInterestingly enough, although this individuation of\nexclusions/concepts might seem to lead to an undesirable proliferation\nof strange ultra-intensional entities, at least certain\nEpistemologists—e.g., Śāntarakṣita,\nKamalaśīla and very clearly the twelfth-thirteenth century\nTibetan Sa skya Paṇḍita (in the first chapter of his\nTshad ma rigs gter)—emphasized that concepts were just\nfictions, façons de parler for different states of\nmind, and even that concepts were not to be reified as any\nkind of object (viṣaya; Tibetan yul) at all.\nThe states of mind could be individuated unproblematically, and so\nderivatively we could somehow perhaps individuate the concepts too\nwithout committing ourselves to a plethora of occult objects, one for\neach word. It remains to be seen, however, whether shifting the burden\nto states of mind gets us out of the woods or still leaves us with\n“subsistent” entities that should make ontologically\nscrupulous nominalists cringe in horror.\n4. Religion and ethics\n\nFinally, what of the Buddhist religion? While Dharmakīrti has\nsometimes been depicted as a dry practitioner of an essentially\nsecular philosophy, this seems hardly defensible. Technical logical\nand epistemological discussions on sources of knowledge were not just\npursued for their own sake. They were also used to establish Buddhist\nreligious doctrines, like the Four Noble Truths, the proofs of the\nBuddha being an authoritative/reliable person\n(pramāṇapuruṣa, Tibetan tshad ma’i skyes\nbu), the law of retribution of acts (karman),\nreincarnation, compassion, omniscience, the innate Buddha-nature,\nabsence of real personal identity,\n etc.[53]\n All these topics are treated in extenso in the second\nchapter of Pramāṇavārttika, and some form the\nsubject of independent treatises by later Epistemologists. There is\nalso a concern with direct perception of religious truths and the\nmethods leading to that extraordinary type of knowledge. In the third\nchapter of Pramāṇavārttika and in the\nperception chapters of the Nyāyabindu and\nPramāṇaviniścaya, for example,\nDharmakīrti seeks to explain and rationalize the perception of a\nyogin (yogipratyakṣa). He advocates a quite remarkable\nmethod of meditation—more literally “cultivation”\n(bhāvanā; abhyāsa)—in which\nphilosophical analysis plays an indispensable role (see e.g., Taber\n2009; see Tillemans 2016, chapter 10, on Dharmakīrti-style\nmeditation, its epistemological challenges and the contrast with Chan\nBuddhist approaches).\n\nThe whys and wherefores of Dharmakīrti’s philosophy of religion\nare no doubt partly explained by the historical context in which he\nlived, one in which Buddhist institutions and power were confronted\nwith forceful challenges of a reinvigorated\n Brahmanism.[54]\n Indeed, not just on matters of Buddhist doctrine but also on many\nmetaphysical issues was there a religious dimension to his arguments.\nIn the latter half of the first chapter of\nPramāṇavārttika, Dharmakīrti proceeds to\na detailed attack on the authority of the Vedas, the Brahmins that\nexpound them, the Brahmanical ideas about the efficacy of mantras, and\nthe system of caste (see Eltschinger 2000). It is noteworthy that a\nfrequent Sanskrit term for “universal”,\n“kind”, i.e., jāti, is also the term for\n“caste.” As Eltschinger (2000) shows, the discussions on\nthe unreality of universals and the unreality of caste were related\nfor Dharmakīrti and were explicitly taken to be related by\ncommentators like Śākyabuddhi and Karṇakagomin. Castes\nwere natural kinds explainable through universals for non-Buddhists,\nand they were not arbitrary or man-made customary distinctions. An\nobvious pay-off of Dharmakīrti’s nominalism, then, was that\nBuddhists could further distance themselves from Brahmanical\nprinciples of social organization and ethics by attacking the\nmetaphysical foundations of caste.\n\nThe debate with Brahmanical schools on specific doctrinal questions\nnaturally moved to long and involved discussions on issues of\nscriptural authority, such as the Mīmāṃsaka school’s\njustification of the Vedas as being eternal, uncreated by\nhumans (apauruṣeya) and hence authoritative because\nfree from any human influence. (The Buddhist retort is essentially\nthat if per impossibile scriptures were uncreated, they would\nbe incomprehensible, for there would be no speakers’ intentions to\nmean one thing rather than another in using a specific\nword.) On the role of scripture Dharmakīrti actually had a\nnuanced position. In Pramāṇavārttika\nI.213–217 et sq. and in IV.48–108 he maintains that\nscripture shouldn’t be used on factual or rationally decidable\nmatters; perception and logical reasoning trump the scriptures of\none’s own school; one is not to be faulted for rejecting one’s\nschool’s scriptures when reason dictates it; on rationally undecidable\nmatters, however, that is on so-called “radically inaccessible\nthings” (atyantaparokṣa), like the specific\ndetails of the law of karman (exactly what actions in past\nlives lead to what results in the future?), scriptural accounts need\nto be relied upon because of the absence of any other means\n(agatyā) (I.216). Scripture, if it passes certain\nconditions, can be designated as being an inferential source of\nknowledge, but is always fallible and not to be considered a\nfull-fledged source of knowledge, as “it has no claim to\ncertainty” (nāto niścayaḥ), unlike bona\nfide inferences (Svavṛtti ad I.318). The eighth century\ncommentator Śākyabuddhi summarizes things interestingly in\nhis commentary to I.216: scripture is simply needed by (indeed,\nindispensable to) those who wish to set out upon the spiritual path\n(pravṛttikāma), but it is not grounded in any\nobjective facts (vastutas) (Tillemans 1999, ch. 2).\n\nThis is a surprisingly fallibilist and pragmatic position for a deeply\nreligious thinker. Taken further, it would have major consequences for\nBuddhist ethics. The use of appeals to “radically\ninaccessible” facts to justify ethical positions was recognized\nby Dharmakīrti to be flawed in public debate. Indeed he seems to\nhave been quite aware that invoking such purely scriptural positions\nwould fall flat outside the context of convinced\n Buddhists.[55]\n The lesson could have been that Buddhists should genuinely privilege\nrational considerations debatable by all, rather than heavily\nweighting “proofs” that were for the faithful.\nUnfortunately, however, over history the later Indo-Tibetan Buddhist\nscholastic apologists transformed the Dharmakīrtian view on\nscripture, indeed all of his religious philosophy, into an\nincreasingly rigid\n edifice.[56]\n Dharmakīrti became the defender of the Buddhist\nfaith—the “lord of reasoning” (Tib. rigs pa’i\ndbang phyug). It is regrettable that much of the thought of this\nhighly inquisitive and subtle philosopher often became, in later\nIndian and Tibetan Buddhism, a series of unquestioned formulae to\nsecure Buddhist fundamentalism.\n5. Editions and translations of the Pramāṇavārttika\n\nAn ongoing bibliography of editions and translations of\nDharmakīrti’s seven works and those of other major Buddhist\nauthors on epistemology and logic is presented on the site\nEpistemology and Argumentation in South Asia and Tibet\n(www.east.ikga.oeaw.ac.at). Here are what we consider to be principal\neditions and translations of Dharmakīrti’s main work, the\nPramāṇavārttika.\n\nThe Sanskrit and Tibetan texts of the verses of\nPramāṇavārttika are edited in Miyasaka\n(1971/72). The Sanskrit of the autocommentary\n(Svavṛtti) is edited in Gnoli (1960). Partial\neditions are also found in several of the translations. Chapter I\nand autocommentary are partially translated in several publications:\nI.1–10 plus autocommentary is translated into English in Gillon\nand Hayes (1991); I.1–51 plus autocommentary are translated into\nEnglish in Mookerjee and Nagasaki (1964). For a German translation of\nChapter I.40–185 plus autocommentary, see Frauwallner (1932;\n1933). Steinkellner (2013) is a German translation\nof various parts of Chapter I and the\nautocommentary that pertain to the theory of logical\nreasons. Eltschinger (2007) gives a French translation of\nI.213–268. Eltschinger, Krasser, and Taber (2012) contains an\nEnglish translation of I.312-340 and the autocommentary.\nEltschinger, Taber, Much, and Ratié (2018) is an English\ntranslation of I.40–91 and the autocommentary. Dunne (2004)\ngives English translations of I.34–37, 68–75,\n137–142, 214–223 and autocommentary. Chapter II.1-6\nalong with selections from the commentaries of Devendrabuddhi\nand  Śākyabuddhi are translated in Dunne\n(2004): II.1-7 are translated in van Bijlert\n(1989); II.34-72 along with the commentary of\nPrajñākaragupta are translated into English in Franco\n(1997);  Vetter (1990) gives a German translation of\nII.131cd-285. Pecchia (2015) contains an English translation of\nII.190–216 and the commentary of Manorathanandin. Jackson (1993)\ncontains an English translation of Chapter II and rGyal tshab’s\nTibetan commentary.  Chapter III is translated into Japanese in\nTosaki (1979; 1985); Dunne (2004) translated III.1–10,\n194–224 into English along with selections from the commentaries\nof Devendrabuddhi and Śākyabuddhi; Franco and Notake\n(2014) translated III.1-63 into English. Chapter IV.1–148\nis translated into English in Tillemans (2000). For other partial\ntranslations of Pramāṇavārttika and passages\nfrom its Indian commentaries, see also the table in Dunne (2004), p.\n333–334. For an earlier, but still important, bibliography on\nthe research on Buddhist epistemology and logic, see Steinkellner and\nMuch (1995).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Arnold, Dan A., 2003, “Candrakīrti on Dignāga on\n<em>Svalakṣaṇa</em>s,” <em>Journal of the\nInternational Association of Buddhist Studies</em>, 26(1):\n139–174.",
                "–––, 2006, “On Semantics and\n<em>Saṃketa</em>: Thoughts on a Neglected Problem with Buddhist\n<em>Apoha</em> Doctrine,” <em>Journal of Indian Philosophy</em>,\n34: 415–478.",
                "–––, 2010, “Self-Awareness\n(<em>svasaṃvitti</em>) and Related Doctrines of Buddhists\nfollowing Dignāga: Philosophical Characterization of Some of the\nMain Issues,” <em>Journal of Indian Philosophy</em>, 38:\n323–378.",
                "Balcerowicz, Piotr, 2016, “On the Relative Chronology of\nDharmakīrti and Samantabhadra,” <em>Journal of Indian\nPhilosophy</em>, 44: 437–483.",
                "Cabezón, José I., 2000, “Truth in Buddhist\nTheology,” in R. Jackson and J. Makransky, (eds.), <em>Buddhist\nTheology</em>, Critical Reflections by Contemporary Buddhist Scholars.\nLondon: Curzon, 136–154.",
                "Chi, Richard S.Y., 1984, <em>Buddhist Formal Logic</em>, Delhi:\nMotilal Banarsidass.",
                "Cox, Collett, 1995, <em>Disputed Dharmas. Early Buddhist Theories\non Existence </em>(Studia Philologica Buddhica, Monograph Series\nXI), Tokyo: The International Institute for Buddhist\nStudies.",
                "Davidson, Donald, 1984, “The Very Idea of a Conceptual\nScheme,” reprinted in his <em>Inquiries into Truth and\nInterpretation</em>, Oxford: Clarendon Press, 1984.",
                "D’Ottavi, Giuseppe, 2010, “Saussure et l’Inde: La\nThéorie de l’apoha et les entités négatives du\nlangage,” in Jean-Paul Bronchart, Ecatarina Bulea, and Cristian Bota\n(eds.), <em>Le Projet de Ferdinand de Saussure</em>, Geneva:\nLibrairie Droz, 169–191.",
                "Dreyfus, Georges B., 1995, “Is Dharmakīrti a\nPragmatist?” <em>Asiatische Studien / Etudes asiatiques</em>\n(Bern: P. Lang Verlag), 49(4): 671–691.",
                "–––, 1997, <em>Recognizing Reality</em>,\n<em>Dharmakīrti’s Philosophy and its Tibetan\nInterpretations</em>, Albany, NY: State University of New York\nPress.",
                "Dunne, John D., 2004, <em>Foundations of Dharmakīrti’s\nPhilosophy</em> (Studies in Indian and Tibetan Buddhism), Cambridge\nMA: Wisdom Publications.",
                "–––, 2011, “Key Features of\nDharmakīrti’s <em>Apoha</em>-Theory,” in Siderits,\nTillemans, Chakrabarti (eds.) 2011.",
                "Eltschinger, Vincent, 2000, <em>“Caste” et philosophie\nbouddhique. Continuité de quelques arguments bouddhiques contre\nle traitement réaliste des dénominations sociales</em> \n(Wiener Studien zur Tibetologie und Buddhismuskunde\n47), Vienna: Arbeitskreis für Tibetische und Buddhistische\nStudien Universität Wien.",
                "–––, 2001, <em>Dharmakīrti sur les</em>\nmantra <em>et la perception du suprasensible</em> (Wiener Studien zur\nTibetologie und Buddhismuskunde 51), Vienna: Arbeitskreis für\nTibetische und Buddhistische Studien Universität Wien.",
                "–––, 2007, <em>Penser l’autorité des\nÉcritures. La polémique de Dharmakīrti contre la\nnotion brahmanique orthodoxe d’un Veda sans auteur. Autour de\nPramāṇavārttika I.213–268 et\nSvavṛtti</em>, Vienna: Verlag der Österreichischen Akademie\nder Wissenschaften.",
                "–––, 2007b, “On 7<sup>th</sup> and\n8<sup>th</sup> Century Buddhist Accounts of Human Action, Practical\nRationality and Soteriology,” in Birgit Kellner, Helmut Krasser,\nHorst Lasic, Michael Torsten Much (eds.),\n<em>Pramāṇakīrtiḥ, Papers Dedicated to Ernst\nSteinkellner on the Occasion of his 70<sup>th</sup> Birthday</em> (2\nvolumes, Wiener Studien zur Tibetologie und Buddhismuskunde 70),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien, 135–162.",
                "–––, 2010, “Dharmakīrti,”\n<em>Revue internationale de philosophie</em>, 3: 397–440 (in\nEnglish).",
                "–––, 2014, <em>Buddhist Epistemology as\nApologetics. Studies on the History, Self-understanding and Dogmatic\nFoundations of Late Indian Buddhist Philosophy</em>, Vienna: Verlag\nder Österreichischen Akademie der Wissenschaften.",
                "Eltschinger, Vincent, Helmut Krasser, John Taber, 2012, <em>Can\nthe Veda Speak? Dharmakīrti against Mīmāṃsā\nExegetics and Vedic Authority, An Annotated Translation of PVSV\n164,24-176,16</em>, Vienna: Verlag der Österreichischen Akademie\nder Wissenschaften.",
                "Eltschinger, Vincent, John Taber, Michael Torsten Much, Isabelle\nRatié, 2018, <em>Dharmakīrti’s Theory of Exclusion\n(apoha). Part I. On Concealing. An Annotated Translation of PVSV 24,\n16–45, 20 (PV I.40–91)</em> (<em>Studia Philologica\nBuddhica</em> XXXVI), Tokyo: The International Institute for Buddhist\nStudies.",
                "Franco, Eli, 1997, <em>Dharmakīrti on Compassion and\nRebirth</em> (Wiener Studien zur Tibetologie und Buddhismuskunde 38),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien.",
                "Franco, Eli and Miyako Notake, 2014, <em>Dharmakīrti on the\nDuality of Objects. Pramāṇavārttika\nIII.1-63</em>, Berlin: LIT Verlag.",
                "Frauwallner, Erich, 1932, “Beiträge zur Apohalehre. 1.\nDharmakīrti.Übersetzung,” <em>Wiener Zeitschrift\nfür die Kunde des Morgenlandes</em>, 39: 247–285.",
                "–––, 1933, “Beiträge zur Apohalehre.\n1. Dharmakīrti.Übersetzung (Fortsetzung),” <em>Wiener\nZeitschrift für die Kunde des Morgenlandes</em>, 40:\n51–94.",
                "–––, 1934, “Dharmakīrtis\nSambandhaparīkṣā. Text und Übersetzung,”\n<em>Wiener Zeitschrift für die Kunde des Morgenlandes</em>, 41:\n261–300. Reprinted in E. Frauwallner, <em>Kleine Schriften,</em>\nHerausgegeben von Gerhard Oberhammer und Ernst Steinkellner.\nWiesbaden: Franz Steiner, 1982.",
                "–––, 1954, “Die Reihenfolge und Entstehung\nder Werke Dharmakīrti’s,” <em>Asiatica, Festschrift\nFriedrich Weller</em>, Leipzig, 142–154. Reprinted in <em>Kleine\nSchriften</em>, 677–689.",
                "–––, 1961, “Landmarks in the History of\nIndian Logic,” <em>Wiener Zeitschrift für die Kunde\nSüd- und Ostasiens</em>, 5: 125–148. Reprinted in\n<em>Kleine Schriften</em> 847–870.",
                "Ganeri, Jonardon, 2001, <em>Philosophy in Classical India</em>,\nNew York: Routledge.",
                "Gillon, Brendan S., 1991, “Dharmakīrti and the Problem\nof Induction,” in Steinkellner (ed.) 1991, 53–58.",
                "Gillon, Brendan S. and Richard P. Hayes, 1991, “Introduction\nto Dharmakirti’s theory of inference as presented in\nPramāṇavārttika Svopajñāvṛtti\n1–10,” <em>Journal of Indian Philosophy</em>, 19(1):\n1–73.",
                "Gnoli, Raniero, 1960, <em>The Pramāṇavārttikam of\nDharmakīrti. The First Chapter with the Autocommentary</em> (Text\nand critical notes. Serie Orientale Roma 23), Rome: Istituto Italiano\nper Il Medio ed Estremo Oriente.",
                "Goodman, Charles, 2004, “The Treasury of Metaphysics and the\nPhysical World,” <em>Philosophical Quarterly</em>, 54: 216,\n389–401.",
                "Hale, Bob, 2011, “Apoha Semantics—Some Simple-minded\nQuestions and Doubts,” in Siderits, Tillemans, Chakrabarti\n(eds.), 2011.",
                "Hattori, Masaaki, 1968, <em>Dignāga on Perception. Being\nthe Pratyakṣapariccheda of Dignāga’s\nPramāṇasamuccaya</em> (Harvard Oriental Series 47),\nCambridge MA: Harvard University Press.",
                "Hayes, Richard P., 1980, “Diṅnāga’s Views on\nReasoning (<em>svārthānumāna</em>),” <em>Journal\nof Indian Philosophy</em>, 8: 219–277.",
                "–––, 1987, <em>Dignāga on the\nInterpretation of Signs</em> (Studies of Classical India 9),\nDordrecht, Holland: Kluwer Academic Publishers.",
                "Herzberger, Hans G., 1975, “Double Negation in Buddhist\nLogic,” <em>Journal of Indian Philosophy</em>, 3:\n3–16.",
                "Hugon, Pascale, 2008, <em>Trésors du raisonnement</em>, Sa\nskya Paṇḍita et ses prédécesseurs\ntibétains sur les modes de fonctionnement de la pensée\net le fondement de l’inférence. Édition et traduction\nannotée du quatrième chaptre et d’une section du\ndixième chapitre du <em>Tshad ma rigs pa’i gter</em> (Wiener\nStudien zur Tibetologie und Buddhismuskunde, Volume 69, Numbers 1,2),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien.",
                "–––, 2011, “Dharmakīrti’s Discussion\nof Circularity,” in Siderits, Tillemans, Chakrabarti (eds.),\n2011.",
                "Inami, Masahiro, 1999, “On the Determination of\nCausality,” in Katsura (ed.) 1999, 131–154.",
                "–––, 2001, “The Problem of Other Minds in\nthe Buddhist Epistemological Tradition,” <em>Journal of Indian\nPhilosophy</em>, 29: 465–483.",
                "Iwata, Takashi, 1984, “One Interpretation of the\n<em>saṃvedana-</em>inference of Dharmakīrti,”\n<em>Indogaku Bukkyōgaku Kenkyū / The Journal of Indian and\nBuddhist Studies</em>, 33(1): 397–394.",
                "–––, 1991, <em>Sahopalambhaniyama. Struktur und\nEntwicklung des Schlusses von der Tatsache, dass Erkenntnis und\nGegenstand ausschliesslich zusammen wahrgenommen werden, auf deren\nNichtverschiedenheit</em>, Stuttgart: Franz Steiner.",
                "–––, 2004, “On the Concept of Necessity in\nBuddhist Texts—from the Perspectives of the Yogācāras\nand the Buddhist Logical Tradition,” <em>Hōrin</em>,\n<em>Vergleichende Studien zur japanischen Kultur</em>, 11:\n57–81.",
                "Jackson, Roger, 1993, <em>Is Enlightenment Possible?\nDharmakīrti and rGyal tshab rje on Knowledge, Rebirth, No-Self\nand Liberation</em>, Ithaca, NY: Snow Lion Publications.",
                "Kajiyama, Yuichi, 1958, “On the Theory of Intrinsic\nDetermination of Universal Concomitance in Buddhist Logic,”\n<em>Indogaku Bukkyōgaku Kenkyū / The Journal of Indian and\nBuddhist Studies</em>, 7(1): 364–360. Reprinted in Mimaki et al.\n(eds.), 1989.",
                "–––, 1963, “Trikapañcakacintā:\nDevelopment of the Buddhist Theory on the Determination of\nCausality,” <em>Miscellanea Indologica Kiotiensia</em>, 4/5:\n1–15. Reprinted in Mimaki et al. (eds.), 1989.",
                "–––, 1966, <em>An Introduction to Buddhist\nPhilosophy. An Annotated Translation of the Tarkabhāṣā\nof Mokṣākaragupta</em>, Kyoto: Memoirs of the Faculty of\nLetters, Kyoto University. Reprinted in Mimaki et al. (eds.),\n1989.",
                "Kataoka, Kei, 2003, “The Mīmāṃsā\nDefinition of <em>Pramāṇa</em> as a Source of New\nInformation,” <em>Journal of Indian Philosophy</em>, 31:\n89–103.",
                "Katsura, Shoryu, 1979, “The <em>Apoha</em> Theory of\nDignāga,” <em>Indogaku Bukkyōgaku Kenkyū / The\nJournal of Indian and Buddhist Studies</em>, 28: 16–20.",
                "–––, 1984, “Dharmakīrti’s Theory of\nTruth,” <em>Journal of Indian Philosophy</em>, 12:\n215–235.",
                "–––, 1992,\n“<em>Pramāṇavārttika</em>\nIV.202–206—Towards the Correct Understanding of\n<em>Svabhāvapratibandha</em>,” <em>Indogaku Bukkyōgaku\nKenkyū / The Journal of Indian and Buddhist Studies</em>, 40:\n1047–1052 [35–40].",
                "–––, (ed.), 1999, <em>Dharmakīrti’s Thought\nand its Impact on Indian and Tibetan Philosophy: Proceedings of the\nThird International Dharmakīrti Conference</em> (Beiträge\nzur Kultur—und Geistesgeschichte Asiens), Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.",
                "Keira, Ryusei, 2004, <em>Mādhyamika and Epistemology. A Study\nof Kamalaśīla’s Method for Proving the Voidness of all\nDharmas</em>, Introduction, annotated translations and Tibetan texts\nof selected sections of the second chapter of the\n<em>Madhyamakāloka</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde 59), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien.",
                "Kellner, Birgit, 2001, “Negation—Failure or Success?\nRemarks on an Allegedly Characteristic Trait of Dharmakīrti’s\n<em>Anupalabdhi</em>-Theory,” <em>Journal of Indian\nPhilosophy</em>, 29: 495–517.",
                "–––, 2003, “Integrating Negative Knowledge\ninto <em>Pramāṇa</em> Theory: The Development of the\n<em>Dṛśyānupalabdhi</em> in Dharmakīrti’s Earlier\nWorks,” <em>Journal of Indian Philosophy</em>, 31:\n121–159.",
                "–––, 2010, “Self-Awareness\n(<em>svasaṃvedana</em>) in Dignāga’s\n<em>Pramāṇasamuccaya</em> and -<em>vṛtti</em>: A\nClose Reading,” <em>Journal of Indian Philosophy</em>, 38:\n203–231.",
                "–––, 2017, “Proving Idealism:\nDharmakīrti,” in Jonardon Ganeri (ed.), <em>The Oxford\nHandbook of Indian Philosophy</em>, New York: Oxford University Press,\npp. 307–326.",
                "Krasser, Helmut, 2001, “On Dharmakīrti’s Understanding\nof <em>pramāṇabhūta</em> and His Definition of\n<em>pramāṇa</em>,” <em>Wiener Zeitschrift für\ndie Kunde Südasiens</em>, 45: 173–199.",
                "–––, 2003, “On the Ascertainment of\nValidity in the Buddhist Epistemological Tradition,” <em>Journal\nof Indian Philosophy</em>, 31: 161–184.",
                "–––, 2012, “Bhāviveka,\nDharmakīrti and Kumārila,” in François Voegeli,\nVincent Eltschinger, Danielle Feller, Maria Piera Candotti, Bogdan\nDiaconescu and Malhar Kulkarni (eds.), <em>Devadattīyam. Johannes\nBronkhorst Felicitation Volume</em> (World of South and Inner Asia,\nVolume 5), Bern: Peter Lang, pp. 535–594.",
                "Krasser, Helmut, Horst Lasic, Eli Franco, and Birgit Kellner\n(eds.), 2011, <em> Religion and Logic in Buddhist Philosophical\nAnalysis: Proceedings of the Fourth International Dharmakīrti\nConference. Vienna, August 23-27, 2005</em> (Beiträge zur\nKultur—und Geistesgeschichte Asiens), Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.",
                "Lasic, Horst, 1999, “Dharmakīrti and his Successors on\nthe Determination of Causality,” in Katsura (ed.), 1999,\n233–242.",
                "–––, 2003, “On the Utilization of\nCausality as a Basis of Inference. Dharmakīrti’s Statements and\nTheir Interpretation,” <em>Journal of Indian Philosophy</em>,\n31: 185–197.",
                "MacKenzie, Matthew, 2017, “Luminous Mind: Self-Luminosity\nversus Other-Luminosity in Indian Philosophy of Mind,” in\nJoerg Tuske (ed.), <em>The Bloomsbury Reasearch Handbook of Indian\nEpistemology and Metaphysics</em>, Oxford: Bloomsbury\nAcademic, 335-353.",
                "Matilal, Bimal K., 1971, <em>Epistemology, Logic, and Grammar in\nIndian Philosophical Analysis</em> (Series Minor 111), The Hague:\nMouton and Co.",
                "–––, 1974, “A Critique of Buddhist\nIdealism,” in Lance Cousins et al. (eds.), <em>Buddhist Studies\nin Honour of I.B. Horner</em>, Dordrecht: D. Reidel, pp.\n139–169.",
                "–––, 1998, <em>The Character of Logic in\nIndia</em>, Albany: State University of New York Press.",
                "McClintock, Sara L., 2010, <em>Omniscience and the Rhetoric of\nReason. Śāntarakṣita and Kamalaśīla on\nRationality, Argumentation and Religious Authority</em> (Studies in\nIndian and Tibetan Buddhism), Cambridge MA: Wisdom Publications.",
                "Mimaki, Katsumi, 1976, <em>La Réfutation bouddhique de la\npermanence des choses (sthirasiddhidūṣaṇa) et la\npreuve de la momentanéité des choses\n(kṣaṇabhaṅgasiddhi)</em> (Publications de l’Institut\nde Civilisation Indienne 41), Paris: A. Maisonneuve.",
                "Mimaki, Katsumi et al. (eds.), 1989, <em>Y. Kajiyama: Studies in\nBuddhist Philosophy</em>, Kyoto: Rinsen.",
                "Miyasaka, Yusho (ed.), 1971/72,\n<em>Pramāṇavārttika-kārikā</em> (Sanskrit\nand Tibetan), <em>Acta Indologica</em> (Narita: Naritasan Shinshoji),\n2: 1–206.",
                "Mookerjee, Satkari, 1935, <em>The Buddhist Philosophy of Universal\nFlux</em>, Calcutta: University of Calcutta. Reprinted Delhi: Motilal\nBanarsidass, 1980.",
                "Mookerjee, Satkari and Hojun Nagasaki, 1964, <em>The\nPramāṇavārttika of Dharmakīrti</em>, Patna: Nava\nNālandā Mahāvihāra.",
                "Oetke, Claus, 1991, “<em>Svabhāvapratibandha</em> and\nthe Types of Reasons in Dharmakīrti’s Theory of Inference,”\nin E. Steinkellner (ed.) 1991, 243–268.",
                "–––, 1993, <em>Bemerkungen zur buddhistischen\nDoktrin der Momentanheit des Seienden: Dharmakīrtis\nSattvānumāna</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde 29), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien.",
                "Pecchia, Cristina, 2015, <em>Dharmakīrti on the Cessation of\nSuffering. A Critical Edition with Translation and Comments of\nManorathanandin’s</em> Vṛtti<em> and\nVibhūticandra’s Glosses on PV II.190–216</em>\n(Brill’s Indological Library 47), Leiden: Brill.",
                "Pind, Ole H., 1991, “Dignāga on\n<em>śabdasāmānya</em> and\n<em>śabdaviśeṣa</em>,” in Ernst Steinkellner\n(ed.), 1991, 269–280.",
                "–––, 1999, “Dharmakīrti’s\nInterpretation of <em>Pramāṇasamuccayavṛtti</em> V\n36: <em>śabdo\n‘rthāntaranivṛttiviśiṣṭān eva\nbhāvān āha</em>,” in Katsura (ed.), 1999,\n317–332.",
                "–––, 2009, <em>Dignāga’s Philosophy\nof Language–Dignāga on anyāpoha.\nPramāṇasamuccaya V, Texts, Translation, and\nAnnotation</em>, Ph.D. Dissertation, University of Vienna,\nPhilologisch-Kulturwissenschaftliche Fakultät, \n<a href=\"https://othes.univie.ac.at/8283/\" target=\"other\">Pind 2009 available online</a>.",
                "–––, 2011, “Dignāga’s <em>Apoha</em>\nTheory, Its Presuppositions and Main Theoretical Implications,”\nin Siderits, Tillemans, and Chakrabarti (eds.) 2011.",
                "Potter, Karl H. (ed.), 2017, <em>Enclyclopedia of Indian\nPhilosophies</em> (Volume XXI: <em>Buddhist Philosophy from 600 to 750\nA.D.</em>),  Delhi: Motilal Banarsidass.",
                "Powers, John, 1994, “Empiricism and Pragmatism in the\nThought of Dharmakīrti and William James,” <em>American\nJournal of Theology and Philosophy</em>, 15(1): 59–85.",
                "Sakai, Masamichi, 2011, “Śākyabuddhi and\nDharmottara on the Inference of Momentariness Based on the Absence of\nExternal Causes of Destruction,” in Helmut Krasser, Horst Lasic,\nEli Franco, Birgit Kellner, eds, <em>Religion and Logic in Buddhist\nPhilosophical Analysis. Proceedings of the Fourth International\nDharmakīrti Conference, Vienna, August 23–27, 2005</em>,\nVienna 2011, 407–421.",
                "Sāṅkṛtyāyana, Rāhula, 1938,\n<em>Pramāṇavārttikam</em>, by Ācārya\nDharmakīrti, edited by R. Sāṅkṛtyāyana.\nAppendix to the <em>Journal of the Bihar and Orissa Research\nSociety</em>, 24.",
                "Siderits, Mark, 1999, “Apohavāda, Nominalism and\nResemblance Theories,” in Katsura (ed.), 1999,\n349–362.",
                "–––, 2003, “Deductive, Inductive, Both or\nNeither,” <em>Journal of Indian Philosophy</em>, 31:\n303–321.",
                "–––, 2005, “Buddhist Nominalism and Desert\nOrnithology,” in <em>Universals, Concepts and Qualities</em>,\nArindam Chakrabarti and Peter Strawson (eds.), Abingdon: Ashgate,\n91–103.",
                "–––, 2007, <em>Buddhism as Philosophy. An\nIntroduction</em> (Ashgate World Philosophies Series), Indianapolis:\nHackett.",
                "Siderits, Mark, Tom Tillemans and Arindam Chakrabarti (eds.),\n2011, <em>Apoha. Buddhist Nominalism and Human Cognition</em>, New\nYork: Columbia University Press.",
                "Stcherbatsky, T., 1930, 1932, <em>Buddhist Logic</em>, 2 volumes,\nLeningrad: Bibliotheca Buddhica 26. Reprinted The Hague: Mouton and\nCo., 1958.",
                "Steinkellner, Ernst, 1968, “Die Entwicklung des\n<em>kṣaṇikatvānumānam</em> bei\nDharmakīrti,” <em>Wiener Zeitschrift für die Kunde\nSüd- und Ostasiens</em>, 12/13: 361–377.",
                "–––, 1971, “Wirklichkeit und Begriff bei\nDharmakīrti,” <em>Wiener Zeitschrift für die Kunde\nSüdasiens</em>, 15: 179–211.",
                "–––, 1973,\n<em>Dharmakīrti’s Pramāṇaviniścayaḥ.\nZweites Kapitel: Svārthānumānam. Teil 1: Tibetischer\nText und Sanskrittexte</em>, Vienna: Verlag der Österreichischen\nAkademie der Wissenschaften.",
                "–––, 1979,\n<em>Dharmakīrti’s Pramāṇaviniścayaḥ.\nZweites Kapitel: Svārthānumānam. Teil 2:\nÜbersetzung und Anmerkungen</em>, Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.",
                "–––, 1982, “The Spiritual Place of the\nEpistemological Tradition in Buddhism,” <em>Nanto\nBukkyō</em>, 49: 1–15.",
                "–––, 1988, “Remarks on\n<em>niścitagrahaṇa</em>,” in G. Gnoli and L.\nLanciotti (eds.), <em>Orientalia Iosephi Tucci Memoriae\nDicata</em> (Serie Orientale Roma, Volume 56, Number 3), Rome:\nIstituto Italiano per Il Medio ed Estremo Oriente,\n1427–1444.",
                "–––, (ed.), 1991, <em>Studies in the Buddhist\nEpistemological Tradition: Proceedings of the Second International\nDharmakīrti Conference (Vienna, June 11–16, 1989)</em>,\nVienna: Verlag der Österreichischen Akademie der\nWissenschaften.",
                "–––, 1998, “Dharmakīrti,” in E.\nCraig (ed.) <em>The Routledge Encyclopedia of Philosophy</em>, London:\nRoutledge, Volume 3, 51–53.",
                "–––, 2013, <em>Dharmakīrtis\nfr</em><em>ühe Logik: Annotierte Übersetzung der\nlogischen Teile von Pramāṇavārttika 1 mit der\nVṛtti</em> (I. Introduction, Übersetzung,\nAnalyse. II. Introduction, Anmerkungen, Anhänge, etc. [Studia\nPhilologica Buddhica XXIXa,b]), Tokyo: The International\nInstitute for Buddhist Studies.",
                "Steinkellner, Ernst and Torsten Much, 1995, <em>Texte der\nerkenntnistheoretischen Schule des Buddhismus</em> (Systematische\nÜbersicht über die buddhistische Sanskrit-Literatur 2.\nAbhandlungen der Akademie der Wissenschaften in Göttingen),\nGöttingen: Vandenhoeck und Ruprecht.",
                "Taber, John, 2003, “Dharmakīrti against\nPhysicalism,” <em>Journal of Indian Philosophy</em>, 31:\n479–502.",
                "–––, 2009, “Yoga and Our Epistemic\nPredicament,” in Eli Franco (ed.), <em>Yogic Perception,\nMeditation and Altered States of Consciousness</em>, Vienna: Verlag\nder Österreichischen Akademie der Wissenschaften,\n71–92.",
                "Taber, John and Kei Kataoka, 2017, “Coreference and\nQualification.  Dignāga Debated by Kumārila and\nDharmakīrti,” in Jonardon Ganeri (ed.), <em>The Oxford\nHandbook of Indian Philosophy</em>, New York: Oxford University Press,\npp. 255–271.",
                "Tillemans, Tom J.F., 1986, “Identity and Referential Opacity\nin Tibetan Buddhist <em>Apoha</em> Theory,” in B.K. Matilal and\nR.D. Evans, (eds.), <em>Buddhist Logic and Epistemology. Studies in\nthe Buddhist Analysis of Inference and Language</em> (Studies of\nClassical India 7), Dordrecht: D. Reidel Publishing,\n207–227.",
                "–––, 1999, <em>Scripture, Logic, Language.\nEssays on Dharmakīrti and his Tibetan Successors</em> (Studies in\nIndian and Tibetan Buddhism), Somerville MA: Wisdom Publications.",
                "–––, 2000, <em>Dharmakīrti’s\nPramāṇavārttika. An Annotated Translation of the\nFourth Chapter (parārthānumāna)</em> (Volume 1, k.\n1–148), Vienna: Verlag der Österreichischen Akademie der\nWissenschaften.",
                "–––, 2004,“Inductiveness, Deductiveness,\nand Examples in Buddhist Logic,” in Shoryu Katsura and Ernst\nSteinkellner (eds.), <em>The Role of the Example\n(dṛṣṭānta) in Classical Indian Logic</em>\n(Wiener Studien zur Tibetologie und Buddhismuskunde 58), Vienna:\nArbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien, p. 251–275.",
                "–––, 2004b, “The Slow Death of the\n<em>Trairūpya</em> in Buddhist Logic : a propos of Sa skya\nPaṇḍita,” <em>Hōrin, Vergleichende Studien zur\njapanischen Kultur</em>, 11: 83–93.",
                "–––, 2011, “How to Talk about Ineffable\nThings: Dignāga and Dharmakīrti on Apoha,” in\nSiderits, Tillemans, Chakrabarti (eds.), 2011.",
                "–––, 2011b, “Dignāga, Bhāviveka\nand Dharmakīrti on Apoha,” in Helmut Krasser, Horst Lasic,\nEli Franco, and Birgit Kellner (eds.), 2011, p. 449-458.",
                "–––, 2016. <em>How do Mādhyamikas Think?\nAnd Other Essays on the Buddhist Philosophy of the Middle</em>\n(Studies in Indian and Tibetan Buddhism), Somerville MA: Wisdom\nPublications.",
                "Tosaki, Hiromasa, 1979, 1985, <em>Bukkyō Ninshikiron no\nKenkyū</em> (Jōkan =1979; Gekan =1985). Sanskrit edition and\nJapanese translation of <em>Pramāṇavārttika</em> III.\nTokyo: Daitōshuppansha.",
                "van Bijlert, Vittorio A., 1989, <em>Epistemology and Spiritual\nAuthority</em>, The development of epistemology and logic in the old\nNyāya and the Buddhist school of epistemology with an annotated\ntranslation of Dharmakīrti’s\n<em>Pramāṇavārttika</em> II\n(<em>Pramāṇasiddhi</em>) vv. 1–7 (Wiener Studien zur\nTibetologie und Buddhismuskunde 20), Vienna: Arbeitskreis für\nTibetische und Buddhistische Studien Universität Wien.",
                "van der Kuijp, Leonard W.J., 1983, <em>Contributions to the\nDevelopment of Tibetan Buddhist Epistemology. From the Eleventh to the\nThirteenth Century</em> (Alt- und Neu-Indische Studien 26), Wiesbaden:\nFranz Steiner Verlag.",
                "Vetter, Tilmann, 1990, <em>Der Buddha und seine Lehre in\nDharmakīrti’s Pramāṇavārttika. Der Abschnitt\nüber den Buddha und die vier edlen Wahrheiten in\nPramāṇasiddhi-Kapitel</em> (Wiener Studien zur Tibetologie\nund Buddhismuskunde 12), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien. Second and revised\nedition.",
                "von Rospatt, Alexander, 1995, <em>The Buddhist Doctrine of\nMomentariness. A Survey of the Origins and Early Phase of this\nDoctrine up to Vasubandhu</em>, Stuttgart: Franz Steiner Verlag.",
                "Williams, Paul, 1998, <em>The Reflexive Nature of Awareness</em>:\n<em>A Tibetan Madhyamaka Defence</em>, Richmond, UK: Curzon\nPress.",
                "Yoshimizu, Chizuko, 1999, “The Development of\n<em>Sattvānumāna</em> from the Refutation of a Permanent\nExistent in the Sautrāntika Tradition,” <em>Wiener\nZeitschrift für die Kunde Südasiens</em>, 43:\n231–254.",
                "–––, 2007, “Augenblicklichkeit\n(<em>kṣaṇikatva</em>) und Eigenwesen\n(<em>svabhāva</em>): Dharmakīrtis Polemik im\nHetubindu,” <em>Wiener Zeitschrift für die Kunde\nSüdasiens</em>, 47: 197–216."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Arnold, Dan A., 2003, “Candrakīrti on Dignāga on\n<em>Svalakṣaṇa</em>s,” <em>Journal of the\nInternational Association of Buddhist Studies</em>, 26(1):\n139–174.</li>\n<li>–––, 2006, “On Semantics and\n<em>Saṃketa</em>: Thoughts on a Neglected Problem with Buddhist\n<em>Apoha</em> Doctrine,” <em>Journal of Indian Philosophy</em>,\n34: 415–478.</li>\n<li>–––, 2010, “Self-Awareness\n(<em>svasaṃvitti</em>) and Related Doctrines of Buddhists\nfollowing Dignāga: Philosophical Characterization of Some of the\nMain Issues,” <em>Journal of Indian Philosophy</em>, 38:\n323–378.</li>\n<li>Balcerowicz, Piotr, 2016, “On the Relative Chronology of\nDharmakīrti and Samantabhadra,” <em>Journal of Indian\nPhilosophy</em>, 44: 437–483.</li>\n<li>Cabezón, José I., 2000, “Truth in Buddhist\nTheology,” in R. Jackson and J. Makransky, (eds.), <em>Buddhist\nTheology</em>, Critical Reflections by Contemporary Buddhist Scholars.\nLondon: Curzon, 136–154.</li>\n<li>Chi, Richard S.Y., 1984, <em>Buddhist Formal Logic</em>, Delhi:\nMotilal Banarsidass.</li>\n<li>Cox, Collett, 1995, <em>Disputed Dharmas. Early Buddhist Theories\non Existence </em>(Studia Philologica Buddhica, Monograph Series\nXI), Tokyo: The International Institute for Buddhist\nStudies.</li>\n<li>Davidson, Donald, 1984, “The Very Idea of a Conceptual\nScheme,” reprinted in his <em>Inquiries into Truth and\nInterpretation</em>, Oxford: Clarendon Press, 1984.</li>\n<li>D’Ottavi, Giuseppe, 2010, “Saussure et l’Inde: La\nThéorie de l’apoha et les entités négatives du\nlangage,” in Jean-Paul Bronchart, Ecatarina Bulea, and Cristian Bota\n(eds.), <em>Le Projet de Ferdinand de Saussure</em>, Geneva:\nLibrairie Droz, 169–191.</li>\n<li>Dreyfus, Georges B., 1995, “Is Dharmakīrti a\nPragmatist?” <em>Asiatische Studien / Etudes asiatiques</em>\n(Bern: P. Lang Verlag), 49(4): 671–691.</li>\n<li>–––, 1997, <em>Recognizing Reality</em>,\n<em>Dharmakīrti’s Philosophy and its Tibetan\nInterpretations</em>, Albany, NY: State University of New York\nPress.</li>\n<li>Dunne, John D., 2004, <em>Foundations of Dharmakīrti’s\nPhilosophy</em> (Studies in Indian and Tibetan Buddhism), Cambridge\nMA: Wisdom Publications.</li>\n<li>–––, 2011, “Key Features of\nDharmakīrti’s <em>Apoha</em>-Theory,” in Siderits,\nTillemans, Chakrabarti (eds.) 2011.</li>\n<li>Eltschinger, Vincent, 2000, <em>“Caste” et philosophie\nbouddhique. Continuité de quelques arguments bouddhiques contre\nle traitement réaliste des dénominations sociales</em> \n(Wiener Studien zur Tibetologie und Buddhismuskunde\n47), Vienna: Arbeitskreis für Tibetische und Buddhistische\nStudien Universität Wien.</li>\n<li>–––, 2001, <em>Dharmakīrti sur les</em>\nmantra <em>et la perception du suprasensible</em> (Wiener Studien zur\nTibetologie und Buddhismuskunde 51), Vienna: Arbeitskreis für\nTibetische und Buddhistische Studien Universität Wien.</li>\n<li>–––, 2007, <em>Penser l’autorité des\nÉcritures. La polémique de Dharmakīrti contre la\nnotion brahmanique orthodoxe d’un Veda sans auteur. Autour de\nPramāṇavārttika I.213–268 et\nSvavṛtti</em>, Vienna: Verlag der Österreichischen Akademie\nder Wissenschaften.</li>\n<li>–––, 2007b, “On 7<sup>th</sup> and\n8<sup>th</sup> Century Buddhist Accounts of Human Action, Practical\nRationality and Soteriology,” in Birgit Kellner, Helmut Krasser,\nHorst Lasic, Michael Torsten Much (eds.),\n<em>Pramāṇakīrtiḥ, Papers Dedicated to Ernst\nSteinkellner on the Occasion of his 70<sup>th</sup> Birthday</em> (2\nvolumes, Wiener Studien zur Tibetologie und Buddhismuskunde 70),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien, 135–162.</li>\n<li>–––, 2010, “Dharmakīrti,”\n<em>Revue internationale de philosophie</em>, 3: 397–440 (in\nEnglish).</li>\n<li>–––, 2014, <em>Buddhist Epistemology as\nApologetics. Studies on the History, Self-understanding and Dogmatic\nFoundations of Late Indian Buddhist Philosophy</em>, Vienna: Verlag\nder Österreichischen Akademie der Wissenschaften.</li>\n<li>Eltschinger, Vincent, Helmut Krasser, John Taber, 2012, <em>Can\nthe Veda Speak? Dharmakīrti against Mīmāṃsā\nExegetics and Vedic Authority, An Annotated Translation of PVSV\n164,24-176,16</em>, Vienna: Verlag der Österreichischen Akademie\nder Wissenschaften.</li>\n<li>Eltschinger, Vincent, John Taber, Michael Torsten Much, Isabelle\nRatié, 2018, <em>Dharmakīrti’s Theory of Exclusion\n(apoha). Part I. On Concealing. An Annotated Translation of PVSV 24,\n16–45, 20 (PV I.40–91)</em> (<em>Studia Philologica\nBuddhica</em> XXXVI), Tokyo: The International Institute for Buddhist\nStudies.</li>\n<li>Franco, Eli, 1997, <em>Dharmakīrti on Compassion and\nRebirth</em> (Wiener Studien zur Tibetologie und Buddhismuskunde 38),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien.</li>\n<li>Franco, Eli and Miyako Notake, 2014, <em>Dharmakīrti on the\nDuality of Objects. Pramāṇavārttika\nIII.1-63</em>, Berlin: LIT Verlag.</li>\n<li>Frauwallner, Erich, 1932, “Beiträge zur Apohalehre. 1.\nDharmakīrti.Übersetzung,” <em>Wiener Zeitschrift\nfür die Kunde des Morgenlandes</em>, 39: 247–285.</li>\n<li>–––, 1933, “Beiträge zur Apohalehre.\n1. Dharmakīrti.Übersetzung (Fortsetzung),” <em>Wiener\nZeitschrift für die Kunde des Morgenlandes</em>, 40:\n51–94.</li>\n<li>–––, 1934, “Dharmakīrtis\nSambandhaparīkṣā. Text und Übersetzung,”\n<em>Wiener Zeitschrift für die Kunde des Morgenlandes</em>, 41:\n261–300. Reprinted in E. Frauwallner, <em>Kleine Schriften,</em>\nHerausgegeben von Gerhard Oberhammer und Ernst Steinkellner.\nWiesbaden: Franz Steiner, 1982.</li>\n<li>–––, 1954, “Die Reihenfolge und Entstehung\nder Werke Dharmakīrti’s,” <em>Asiatica, Festschrift\nFriedrich Weller</em>, Leipzig, 142–154. Reprinted in <em>Kleine\nSchriften</em>, 677–689.</li>\n<li>–––, 1961, “Landmarks in the History of\nIndian Logic,” <em>Wiener Zeitschrift für die Kunde\nSüd- und Ostasiens</em>, 5: 125–148. Reprinted in\n<em>Kleine Schriften</em> 847–870.</li>\n<li>Ganeri, Jonardon, 2001, <em>Philosophy in Classical India</em>,\nNew York: Routledge.</li>\n<li>Gillon, Brendan S., 1991, “Dharmakīrti and the Problem\nof Induction,” in Steinkellner (ed.) 1991, 53–58.</li>\n<li>Gillon, Brendan S. and Richard P. Hayes, 1991, “Introduction\nto Dharmakirti’s theory of inference as presented in\nPramāṇavārttika Svopajñāvṛtti\n1–10,” <em>Journal of Indian Philosophy</em>, 19(1):\n1–73.</li>\n<li>Gnoli, Raniero, 1960, <em>The Pramāṇavārttikam of\nDharmakīrti. The First Chapter with the Autocommentary</em> (Text\nand critical notes. Serie Orientale Roma 23), Rome: Istituto Italiano\nper Il Medio ed Estremo Oriente.</li>\n<li>Goodman, Charles, 2004, “The Treasury of Metaphysics and the\nPhysical World,” <em>Philosophical Quarterly</em>, 54: 216,\n389–401.</li>\n<li>Hale, Bob, 2011, “Apoha Semantics—Some Simple-minded\nQuestions and Doubts,” in Siderits, Tillemans, Chakrabarti\n(eds.), 2011.</li>\n<li>Hattori, Masaaki, 1968, <em>Dignāga on Perception. Being\nthe Pratyakṣapariccheda of Dignāga’s\nPramāṇasamuccaya</em> (Harvard Oriental Series 47),\nCambridge MA: Harvard University Press.</li>\n<li>Hayes, Richard P., 1980, “Diṅnāga’s Views on\nReasoning (<em>svārthānumāna</em>),” <em>Journal\nof Indian Philosophy</em>, 8: 219–277.</li>\n<li>–––, 1987, <em>Dignāga on the\nInterpretation of Signs</em> (Studies of Classical India 9),\nDordrecht, Holland: Kluwer Academic Publishers.</li>\n<li>Herzberger, Hans G., 1975, “Double Negation in Buddhist\nLogic,” <em>Journal of Indian Philosophy</em>, 3:\n3–16.</li>\n<li>Hugon, Pascale, 2008, <em>Trésors du raisonnement</em>, Sa\nskya Paṇḍita et ses prédécesseurs\ntibétains sur les modes de fonctionnement de la pensée\net le fondement de l’inférence. Édition et traduction\nannotée du quatrième chaptre et d’une section du\ndixième chapitre du <em>Tshad ma rigs pa’i gter</em> (Wiener\nStudien zur Tibetologie und Buddhismuskunde, Volume 69, Numbers 1,2),\nVienna: Arbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien.</li>\n<li>–––, 2011, “Dharmakīrti’s Discussion\nof Circularity,” in Siderits, Tillemans, Chakrabarti (eds.),\n2011.</li>\n<li>Inami, Masahiro, 1999, “On the Determination of\nCausality,” in Katsura (ed.) 1999, 131–154.</li>\n<li>–––, 2001, “The Problem of Other Minds in\nthe Buddhist Epistemological Tradition,” <em>Journal of Indian\nPhilosophy</em>, 29: 465–483.</li>\n<li>Iwata, Takashi, 1984, “One Interpretation of the\n<em>saṃvedana-</em>inference of Dharmakīrti,”\n<em>Indogaku Bukkyōgaku Kenkyū / The Journal of Indian and\nBuddhist Studies</em>, 33(1): 397–394.</li>\n<li>–––, 1991, <em>Sahopalambhaniyama. Struktur und\nEntwicklung des Schlusses von der Tatsache, dass Erkenntnis und\nGegenstand ausschliesslich zusammen wahrgenommen werden, auf deren\nNichtverschiedenheit</em>, Stuttgart: Franz Steiner.</li>\n<li>–––, 2004, “On the Concept of Necessity in\nBuddhist Texts—from the Perspectives of the Yogācāras\nand the Buddhist Logical Tradition,” <em>Hōrin</em>,\n<em>Vergleichende Studien zur japanischen Kultur</em>, 11:\n57–81.</li>\n<li>Jackson, Roger, 1993, <em>Is Enlightenment Possible?\nDharmakīrti and rGyal tshab rje on Knowledge, Rebirth, No-Self\nand Liberation</em>, Ithaca, NY: Snow Lion Publications.</li>\n<li>Kajiyama, Yuichi, 1958, “On the Theory of Intrinsic\nDetermination of Universal Concomitance in Buddhist Logic,”\n<em>Indogaku Bukkyōgaku Kenkyū / The Journal of Indian and\nBuddhist Studies</em>, 7(1): 364–360. Reprinted in Mimaki et al.\n(eds.), 1989.</li>\n<li>–––, 1963, “Trikapañcakacintā:\nDevelopment of the Buddhist Theory on the Determination of\nCausality,” <em>Miscellanea Indologica Kiotiensia</em>, 4/5:\n1–15. Reprinted in Mimaki et al. (eds.), 1989.</li>\n<li>–––, 1966, <em>An Introduction to Buddhist\nPhilosophy. An Annotated Translation of the Tarkabhāṣā\nof Mokṣākaragupta</em>, Kyoto: Memoirs of the Faculty of\nLetters, Kyoto University. Reprinted in Mimaki et al. (eds.),\n1989.</li>\n<li>Kataoka, Kei, 2003, “The Mīmāṃsā\nDefinition of <em>Pramāṇa</em> as a Source of New\nInformation,” <em>Journal of Indian Philosophy</em>, 31:\n89–103.</li>\n<li>Katsura, Shoryu, 1979, “The <em>Apoha</em> Theory of\nDignāga,” <em>Indogaku Bukkyōgaku Kenkyū / The\nJournal of Indian and Buddhist Studies</em>, 28: 16–20.</li>\n<li>–––, 1984, “Dharmakīrti’s Theory of\nTruth,” <em>Journal of Indian Philosophy</em>, 12:\n215–235.</li>\n<li>–––, 1992,\n“<em>Pramāṇavārttika</em>\nIV.202–206—Towards the Correct Understanding of\n<em>Svabhāvapratibandha</em>,” <em>Indogaku Bukkyōgaku\nKenkyū / The Journal of Indian and Buddhist Studies</em>, 40:\n1047–1052 [35–40].</li>\n<li>–––, (ed.), 1999, <em>Dharmakīrti’s Thought\nand its Impact on Indian and Tibetan Philosophy: Proceedings of the\nThird International Dharmakīrti Conference</em> (Beiträge\nzur Kultur—und Geistesgeschichte Asiens), Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.</li>\n<li>Keira, Ryusei, 2004, <em>Mādhyamika and Epistemology. A Study\nof Kamalaśīla’s Method for Proving the Voidness of all\nDharmas</em>, Introduction, annotated translations and Tibetan texts\nof selected sections of the second chapter of the\n<em>Madhyamakāloka</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde 59), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien.</li>\n<li>Kellner, Birgit, 2001, “Negation—Failure or Success?\nRemarks on an Allegedly Characteristic Trait of Dharmakīrti’s\n<em>Anupalabdhi</em>-Theory,” <em>Journal of Indian\nPhilosophy</em>, 29: 495–517.</li>\n<li>–––, 2003, “Integrating Negative Knowledge\ninto <em>Pramāṇa</em> Theory: The Development of the\n<em>Dṛśyānupalabdhi</em> in Dharmakīrti’s Earlier\nWorks,” <em>Journal of Indian Philosophy</em>, 31:\n121–159.</li>\n<li>–––, 2010, “Self-Awareness\n(<em>svasaṃvedana</em>) in Dignāga’s\n<em>Pramāṇasamuccaya</em> and -<em>vṛtti</em>: A\nClose Reading,” <em>Journal of Indian Philosophy</em>, 38:\n203–231.</li>\n<li>–––, 2017, “Proving Idealism:\nDharmakīrti,” in Jonardon Ganeri (ed.), <em>The Oxford\nHandbook of Indian Philosophy</em>, New York: Oxford University Press,\npp. 307–326.</li>\n<li>Krasser, Helmut, 2001, “On Dharmakīrti’s Understanding\nof <em>pramāṇabhūta</em> and His Definition of\n<em>pramāṇa</em>,” <em>Wiener Zeitschrift für\ndie Kunde Südasiens</em>, 45: 173–199.</li>\n<li>–––, 2003, “On the Ascertainment of\nValidity in the Buddhist Epistemological Tradition,” <em>Journal\nof Indian Philosophy</em>, 31: 161–184.</li>\n<li>–––, 2012, “Bhāviveka,\nDharmakīrti and Kumārila,” in François Voegeli,\nVincent Eltschinger, Danielle Feller, Maria Piera Candotti, Bogdan\nDiaconescu and Malhar Kulkarni (eds.), <em>Devadattīyam. Johannes\nBronkhorst Felicitation Volume</em> (World of South and Inner Asia,\nVolume 5), Bern: Peter Lang, pp. 535–594.</li>\n<li>Krasser, Helmut, Horst Lasic, Eli Franco, and Birgit Kellner\n(eds.), 2011, <em> Religion and Logic in Buddhist Philosophical\nAnalysis: Proceedings of the Fourth International Dharmakīrti\nConference. Vienna, August 23-27, 2005</em> (Beiträge zur\nKultur—und Geistesgeschichte Asiens), Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.</li>\n<li>Lasic, Horst, 1999, “Dharmakīrti and his Successors on\nthe Determination of Causality,” in Katsura (ed.), 1999,\n233–242.</li>\n<li>–––, 2003, “On the Utilization of\nCausality as a Basis of Inference. Dharmakīrti’s Statements and\nTheir Interpretation,” <em>Journal of Indian Philosophy</em>,\n31: 185–197.</li>\n<li>MacKenzie, Matthew, 2017, “Luminous Mind: Self-Luminosity\nversus Other-Luminosity in Indian Philosophy of Mind,” in\nJoerg Tuske (ed.), <em>The Bloomsbury Reasearch Handbook of Indian\nEpistemology and Metaphysics</em>, Oxford: Bloomsbury\nAcademic, 335-353.</li>\n<li>Matilal, Bimal K., 1971, <em>Epistemology, Logic, and Grammar in\nIndian Philosophical Analysis</em> (Series Minor 111), The Hague:\nMouton and Co.</li>\n<li>–––, 1974, “A Critique of Buddhist\nIdealism,” in Lance Cousins et al. (eds.), <em>Buddhist Studies\nin Honour of I.B. Horner</em>, Dordrecht: D. Reidel, pp.\n139–169.</li>\n<li>–––, 1998, <em>The Character of Logic in\nIndia</em>, Albany: State University of New York Press.</li>\n<li>McClintock, Sara L., 2010, <em>Omniscience and the Rhetoric of\nReason. Śāntarakṣita and Kamalaśīla on\nRationality, Argumentation and Religious Authority</em> (Studies in\nIndian and Tibetan Buddhism), Cambridge MA: Wisdom Publications.</li>\n<li>Mimaki, Katsumi, 1976, <em>La Réfutation bouddhique de la\npermanence des choses (sthirasiddhidūṣaṇa) et la\npreuve de la momentanéité des choses\n(kṣaṇabhaṅgasiddhi)</em> (Publications de l’Institut\nde Civilisation Indienne 41), Paris: A. Maisonneuve.</li>\n<li>Mimaki, Katsumi et al. (eds.), 1989, <em>Y. Kajiyama: Studies in\nBuddhist Philosophy</em>, Kyoto: Rinsen.</li>\n<li>Miyasaka, Yusho (ed.), 1971/72,\n<em>Pramāṇavārttika-kārikā</em> (Sanskrit\nand Tibetan), <em>Acta Indologica</em> (Narita: Naritasan Shinshoji),\n2: 1–206.</li>\n<li>Mookerjee, Satkari, 1935, <em>The Buddhist Philosophy of Universal\nFlux</em>, Calcutta: University of Calcutta. Reprinted Delhi: Motilal\nBanarsidass, 1980.</li>\n<li>Mookerjee, Satkari and Hojun Nagasaki, 1964, <em>The\nPramāṇavārttika of Dharmakīrti</em>, Patna: Nava\nNālandā Mahāvihāra.</li>\n<li>Oetke, Claus, 1991, “<em>Svabhāvapratibandha</em> and\nthe Types of Reasons in Dharmakīrti’s Theory of Inference,”\nin E. Steinkellner (ed.) 1991, 243–268.</li>\n<li>–––, 1993, <em>Bemerkungen zur buddhistischen\nDoktrin der Momentanheit des Seienden: Dharmakīrtis\nSattvānumāna</em> (Wiener Studien zur Tibetologie und\nBuddhismuskunde 29), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien.</li>\n<li>Pecchia, Cristina, 2015, <em>Dharmakīrti on the Cessation of\nSuffering. A Critical Edition with Translation and Comments of\nManorathanandin’s</em> Vṛtti<em> and\nVibhūticandra’s Glosses on PV II.190–216</em>\n(Brill’s Indological Library 47), Leiden: Brill.</li>\n<li>Pind, Ole H., 1991, “Dignāga on\n<em>śabdasāmānya</em> and\n<em>śabdaviśeṣa</em>,” in Ernst Steinkellner\n(ed.), 1991, 269–280.</li>\n<li>–––, 1999, “Dharmakīrti’s\nInterpretation of <em>Pramāṇasamuccayavṛtti</em> V\n36: <em>śabdo\n‘rthāntaranivṛttiviśiṣṭān eva\nbhāvān āha</em>,” in Katsura (ed.), 1999,\n317–332.</li>\n<li>–––, 2009, <em>Dignāga’s Philosophy\nof Language–Dignāga on anyāpoha.\nPramāṇasamuccaya V, Texts, Translation, and\nAnnotation</em>, Ph.D. Dissertation, University of Vienna,\nPhilologisch-Kulturwissenschaftliche Fakultät, \n<a href=\"https://othes.univie.ac.at/8283/\" target=\"other\">Pind 2009 available online</a>.</li>\n<li>–––, 2011, “Dignāga’s <em>Apoha</em>\nTheory, Its Presuppositions and Main Theoretical Implications,”\nin Siderits, Tillemans, and Chakrabarti (eds.) 2011.</li>\n<li>Potter, Karl H. (ed.), 2017, <em>Enclyclopedia of Indian\nPhilosophies</em> (Volume XXI: <em>Buddhist Philosophy from 600 to 750\nA.D.</em>),  Delhi: Motilal Banarsidass.</li>\n<li>Powers, John, 1994, “Empiricism and Pragmatism in the\nThought of Dharmakīrti and William James,” <em>American\nJournal of Theology and Philosophy</em>, 15(1): 59–85.</li>\n<li>Sakai, Masamichi, 2011, “Śākyabuddhi and\nDharmottara on the Inference of Momentariness Based on the Absence of\nExternal Causes of Destruction,” in Helmut Krasser, Horst Lasic,\nEli Franco, Birgit Kellner, eds, <em>Religion and Logic in Buddhist\nPhilosophical Analysis. Proceedings of the Fourth International\nDharmakīrti Conference, Vienna, August 23–27, 2005</em>,\nVienna 2011, 407–421.</li>\n<li>Sāṅkṛtyāyana, Rāhula, 1938,\n<em>Pramāṇavārttikam</em>, by Ācārya\nDharmakīrti, edited by R. Sāṅkṛtyāyana.\nAppendix to the <em>Journal of the Bihar and Orissa Research\nSociety</em>, 24.</li>\n<li>Siderits, Mark, 1999, “Apohavāda, Nominalism and\nResemblance Theories,” in Katsura (ed.), 1999,\n349–362.</li>\n<li>–––, 2003, “Deductive, Inductive, Both or\nNeither,” <em>Journal of Indian Philosophy</em>, 31:\n303–321.</li>\n<li>–––, 2005, “Buddhist Nominalism and Desert\nOrnithology,” in <em>Universals, Concepts and Qualities</em>,\nArindam Chakrabarti and Peter Strawson (eds.), Abingdon: Ashgate,\n91–103.</li>\n<li>–––, 2007, <em>Buddhism as Philosophy. An\nIntroduction</em> (Ashgate World Philosophies Series), Indianapolis:\nHackett.</li>\n<li>Siderits, Mark, Tom Tillemans and Arindam Chakrabarti (eds.),\n2011, <em>Apoha. Buddhist Nominalism and Human Cognition</em>, New\nYork: Columbia University Press.</li>\n<li>Stcherbatsky, T., 1930, 1932, <em>Buddhist Logic</em>, 2 volumes,\nLeningrad: Bibliotheca Buddhica 26. Reprinted The Hague: Mouton and\nCo., 1958.</li>\n<li>Steinkellner, Ernst, 1968, “Die Entwicklung des\n<em>kṣaṇikatvānumānam</em> bei\nDharmakīrti,” <em>Wiener Zeitschrift für die Kunde\nSüd- und Ostasiens</em>, 12/13: 361–377.</li>\n<li>–––, 1971, “Wirklichkeit und Begriff bei\nDharmakīrti,” <em>Wiener Zeitschrift für die Kunde\nSüdasiens</em>, 15: 179–211.</li>\n<li>–––, 1973,\n<em>Dharmakīrti’s Pramāṇaviniścayaḥ.\nZweites Kapitel: Svārthānumānam. Teil 1: Tibetischer\nText und Sanskrittexte</em>, Vienna: Verlag der Österreichischen\nAkademie der Wissenschaften.</li>\n<li>–––, 1979,\n<em>Dharmakīrti’s Pramāṇaviniścayaḥ.\nZweites Kapitel: Svārthānumānam. Teil 2:\nÜbersetzung und Anmerkungen</em>, Vienna: Verlag der\nÖsterreichischen Akademie der Wissenschaften.</li>\n<li>–––, 1982, “The Spiritual Place of the\nEpistemological Tradition in Buddhism,” <em>Nanto\nBukkyō</em>, 49: 1–15.</li>\n<li>–––, 1988, “Remarks on\n<em>niścitagrahaṇa</em>,” in G. Gnoli and L.\nLanciotti (eds.), <em>Orientalia Iosephi Tucci Memoriae\nDicata</em> (Serie Orientale Roma, Volume 56, Number 3), Rome:\nIstituto Italiano per Il Medio ed Estremo Oriente,\n1427–1444.</li>\n<li>–––, (ed.), 1991, <em>Studies in the Buddhist\nEpistemological Tradition: Proceedings of the Second International\nDharmakīrti Conference (Vienna, June 11–16, 1989)</em>,\nVienna: Verlag der Österreichischen Akademie der\nWissenschaften.</li>\n<li>–––, 1998, “Dharmakīrti,” in E.\nCraig (ed.) <em>The Routledge Encyclopedia of Philosophy</em>, London:\nRoutledge, Volume 3, 51–53.</li>\n<li>–––, 2013, <em>Dharmakīrtis\nfr</em><em>ühe Logik: Annotierte Übersetzung der\nlogischen Teile von Pramāṇavārttika 1 mit der\nVṛtti</em> (I. Introduction, Übersetzung,\nAnalyse. II. Introduction, Anmerkungen, Anhänge, etc. [Studia\nPhilologica Buddhica XXIXa,b]), Tokyo: The International\nInstitute for Buddhist Studies.</li>\n<li>Steinkellner, Ernst and Torsten Much, 1995, <em>Texte der\nerkenntnistheoretischen Schule des Buddhismus</em> (Systematische\nÜbersicht über die buddhistische Sanskrit-Literatur 2.\nAbhandlungen der Akademie der Wissenschaften in Göttingen),\nGöttingen: Vandenhoeck und Ruprecht.</li>\n<li>Taber, John, 2003, “Dharmakīrti against\nPhysicalism,” <em>Journal of Indian Philosophy</em>, 31:\n479–502.</li>\n<li>–––, 2009, “Yoga and Our Epistemic\nPredicament,” in Eli Franco (ed.), <em>Yogic Perception,\nMeditation and Altered States of Consciousness</em>, Vienna: Verlag\nder Österreichischen Akademie der Wissenschaften,\n71–92.</li>\n<li>Taber, John and Kei Kataoka, 2017, “Coreference and\nQualification.  Dignāga Debated by Kumārila and\nDharmakīrti,” in Jonardon Ganeri (ed.), <em>The Oxford\nHandbook of Indian Philosophy</em>, New York: Oxford University Press,\npp. 255–271.</li>\n<li>Tillemans, Tom J.F., 1986, “Identity and Referential Opacity\nin Tibetan Buddhist <em>Apoha</em> Theory,” in B.K. Matilal and\nR.D. Evans, (eds.), <em>Buddhist Logic and Epistemology. Studies in\nthe Buddhist Analysis of Inference and Language</em> (Studies of\nClassical India 7), Dordrecht: D. Reidel Publishing,\n207–227.</li>\n<li>–––, 1999, <em>Scripture, Logic, Language.\nEssays on Dharmakīrti and his Tibetan Successors</em> (Studies in\nIndian and Tibetan Buddhism), Somerville MA: Wisdom Publications.</li>\n<li>–––, 2000, <em>Dharmakīrti’s\nPramāṇavārttika. An Annotated Translation of the\nFourth Chapter (parārthānumāna)</em> (Volume 1, k.\n1–148), Vienna: Verlag der Österreichischen Akademie der\nWissenschaften.</li>\n<li>–––, 2004,“Inductiveness, Deductiveness,\nand Examples in Buddhist Logic,” in Shoryu Katsura and Ernst\nSteinkellner (eds.), <em>The Role of the Example\n(dṛṣṭānta) in Classical Indian Logic</em>\n(Wiener Studien zur Tibetologie und Buddhismuskunde 58), Vienna:\nArbeitskreis für Tibetische und Buddhistische Studien\nUniversität Wien, p. 251–275.</li>\n<li>–––, 2004b, “The Slow Death of the\n<em>Trairūpya</em> in Buddhist Logic : a propos of Sa skya\nPaṇḍita,” <em>Hōrin, Vergleichende Studien zur\njapanischen Kultur</em>, 11: 83–93.</li>\n<li>–––, 2011, “How to Talk about Ineffable\nThings: Dignāga and Dharmakīrti on Apoha,” in\nSiderits, Tillemans, Chakrabarti (eds.), 2011.</li>\n<li>–––, 2011b, “Dignāga, Bhāviveka\nand Dharmakīrti on Apoha,” in Helmut Krasser, Horst Lasic,\nEli Franco, and Birgit Kellner (eds.), 2011, p. 449-458.</li>\n<li>–––, 2016. <em>How do Mādhyamikas Think?\nAnd Other Essays on the Buddhist Philosophy of the Middle</em>\n(Studies in Indian and Tibetan Buddhism), Somerville MA: Wisdom\nPublications.</li>\n<li>Tosaki, Hiromasa, 1979, 1985, <em>Bukkyō Ninshikiron no\nKenkyū</em> (Jōkan =1979; Gekan =1985). Sanskrit edition and\nJapanese translation of <em>Pramāṇavārttika</em> III.\nTokyo: Daitōshuppansha.</li>\n<li>van Bijlert, Vittorio A., 1989, <em>Epistemology and Spiritual\nAuthority</em>, The development of epistemology and logic in the old\nNyāya and the Buddhist school of epistemology with an annotated\ntranslation of Dharmakīrti’s\n<em>Pramāṇavārttika</em> II\n(<em>Pramāṇasiddhi</em>) vv. 1–7 (Wiener Studien zur\nTibetologie und Buddhismuskunde 20), Vienna: Arbeitskreis für\nTibetische und Buddhistische Studien Universität Wien.</li>\n<li>van der Kuijp, Leonard W.J., 1983, <em>Contributions to the\nDevelopment of Tibetan Buddhist Epistemology. From the Eleventh to the\nThirteenth Century</em> (Alt- und Neu-Indische Studien 26), Wiesbaden:\nFranz Steiner Verlag.</li>\n<li>Vetter, Tilmann, 1990, <em>Der Buddha und seine Lehre in\nDharmakīrti’s Pramāṇavārttika. Der Abschnitt\nüber den Buddha und die vier edlen Wahrheiten in\nPramāṇasiddhi-Kapitel</em> (Wiener Studien zur Tibetologie\nund Buddhismuskunde 12), Vienna: Arbeitskreis für Tibetische und\nBuddhistische Studien Universität Wien. Second and revised\nedition.</li>\n<li>von Rospatt, Alexander, 1995, <em>The Buddhist Doctrine of\nMomentariness. A Survey of the Origins and Early Phase of this\nDoctrine up to Vasubandhu</em>, Stuttgart: Franz Steiner Verlag.</li>\n<li>Williams, Paul, 1998, <em>The Reflexive Nature of Awareness</em>:\n<em>A Tibetan Madhyamaka Defence</em>, Richmond, UK: Curzon\nPress.</li>\n<li>Yoshimizu, Chizuko, 1999, “The Development of\n<em>Sattvānumāna</em> from the Refutation of a Permanent\nExistent in the Sautrāntika Tradition,” <em>Wiener\nZeitschrift für die Kunde Südasiens</em>, 43:\n231–254.</li>\n<li>–––, 2007, “Augenblicklichkeit\n(<em>kṣaṇikatva</em>) und Eigenwesen\n(<em>svabhāva</em>): Dharmakīrtis Polemik im\nHetubindu,” <em>Wiener Zeitschrift für die Kunde\nSüdasiens</em>, 47: 197–216.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Abhidharma",
            "Indian Philosophy (Classical): perceptual experience and concepts",
            "justification, epistemic: internalist vs. externalist conceptions of",
            "mental content: causal theories of",
            "natural kinds",
            "propositions: structured",
            "reference",
            "Śāntarakṣita",
            "Tibetan epistemology and philosophy of language",
            "tropes"
        ],
        "entry_link": [
            {
                "../abhidharma/": "Abhidharma"
            },
            {
                "../perception-india/": "Indian Philosophy (Classical): perceptual experience and concepts"
            },
            {
                "../justep-intext/": "justification, epistemic: internalist vs. externalist conceptions of"
            },
            {
                "../content-causal/": "mental content: causal theories of"
            },
            {
                "../natural-kinds/": "natural kinds"
            },
            {
                "../propositions-structured/": "propositions: structured"
            },
            {
                "../reference/": "reference"
            },
            {
                "../saantarak-sita/": "Śāntarakṣita"
            },
            {
                "../epistemology-language-tibetan/": "Tibetan epistemology and philosophy of language"
            },
            {
                "../tropes/": "tropes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dharmakiirti\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/dharmakiirti/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=dharmakiirti&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/dharmakiirti/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dharmakiirti": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/dharmakiirti/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=dharmakiirti&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/dharmakiirti/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}