{
    "url": "dynamic-semantics",
    "title": "Dynamic Semantics",
    "authorship": {
        "year": "Copyright © 2016",
        "author_text": "Rick Nouwen\n<rnouwen@gmail.com>\nAdrian Brasoveanu\n<abrsvn@gmail.com>\nJan van Eijck\n\nAlbert Visser",
        "author_links": [
            {
                "http://ricknouwen.org": "Rick Nouwen"
            },
            {
                "mailto:rnouwen%40gmail%2ecom": "rnouwen@gmail.com"
            },
            {
                "mailto:abrsvn%40gmail%2ecom": "abrsvn@gmail.com"
            },
            {
                "https://staff.fnwi.uva.nl/d.j.n.vaneijck2/": "Jan van Eijck"
            },
            {
                "http://www.phil.uu.nl/profiel/albert.visser/": "Albert Visser"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2016</a> by\n\n<br/>\n<a href=\"http://ricknouwen.org\" target=\"other\">Rick Nouwen</a>\n&lt;<a href=\"mailto:rnouwen%40gmail%2ecom\"><em>rnouwen<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\nAdrian Brasoveanu\n&lt;<a href=\"mailto:abrsvn%40gmail%2ecom\"><em>abrsvn<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"https://staff.fnwi.uva.nl/d.j.n.vaneijck2/\" target=\"other\">Jan van Eijck</a>\n<br/>\n<a href=\"http://www.phil.uu.nl/profiel/albert.visser/\" target=\"other\">Albert Visser</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Aug 23, 2010",
        "substantive revision Tue Jul 12, 2016"
    ],
    "preamble": "\n\nDynamic semantics is a perspective on natural language semantics that\nemphasizes the growth of information in time. It is an approach to\nmeaning representation where pieces of text or discourse are viewed as\ninstructions to update an existing context with new information, the\nresult of which is an updated context. In a slogan: meaning is context\nchange potential. \n\nIt is important to be aware of the abstractness of this perspective so\nas to guard against various non sequiturs. For one thing, one could\neasily think that dynamic semantics or update semantics is committed\nat least in part to an internalist idea of semantics since the\ninformation states are “internal”—in the sense that\nthey are wholly contained in the individual mind/brain. In other\nwords, one might think that the information states of dynamic\nsemantics are what Putnam (1975) calls “states in the sense of\nmethodological solipsism”. See the entries on\n scientific realism,\n computational theory of mind,\n externalism about mental content,\n and\n narrow mental content.\n However, the general framework says nothing about what the states\nare. The state could very well include the environment in which the\ninterpreter is embedded and thus contain an “external”\ncomponent.\n\nA second possible misunderstanding is that dynamic semantics or update\nsemantics is in complete opposition to classical truth conditional\nsemantics (compare the entries on\n classical logic\n and\n first-order model theory).\n In fact, as this entry will soon make clear, what dynamic semantics\nprovides is a generalization of truth conditional semantics rather\nthan a radically different alternative. The classical meanings become\nthe preconditions for success of the discourse actions.\nDynamic semanticists claim that compositional meanings have\nthe nature of functions or relations and the classical meanings are\nrecoverable from the relational dynamic meanings as\nprojections onto their “input” coordinate.\n\nThe point of the use of an abstract framework is not to give empirical\npredictions. This is the task of specific realizations inside the\nframework. The framework of dynamic semantics (i) provides a direction\nof thinking and (ii) allows us to import methods from the mathematical\nstudy of the framework. It follows that the question whether natural\nlanguage meaning is intrinsically dynamic does not have an empirical\nanswer. Still, what can be said is that the study of interpretation as\na linearly-ordered process has proven quite fruitful and\nrewarding.\n\nSince dynamic semantics focuses on the discourse actions of sender and\nreceiver, it is in a sense close to use-oriented approaches to meaning\nin philosophy such as the work of Wittgenstein and Dummett. However,\neasy identifications between dynamic semantics and these approaches\nare to be avoided. Dynamic semantics as an abstract framework is\ncompatible with many philosophical ways of viewing meaning and\ninterpretation. Dynamic semantics aims to model meaning and\ninterpretation. You can do that without answering broader\nphilosophical questions such as the question of what it is that makes\nit possible for the subject to be related to these meanings at all.\nFor example, in dynamic predicate logic we take the meaning of\nhorse as given without making any substantial claim about\nwhat it means for a subject to have the concept of horse; we\njust stipulate the subject has it. This is not to say such\nquestions—which are at the center of the work of Wittgenstein\nand Dummett—should not ultimately be answered: it’s just\nthat a model can be of interest even if it does not answer them. (Note\nthat dynamic semantics tries to give a systematic and compositional\naccount of meaning, which makes it markedly different in spirit from\nWittgenstein’s later philosophy.)\n\nOne approach to dynamic semantics is\n discourse representation theory\n (DRT, Kamp 1981). (Closely related to Kamp’s approach is Irene\nHeim’s file change semantics (FCS, Heim 1983a) and the\ndiscourse semantics of Seuren 1985). Meanings in DRT are so-called\ndiscourse representation structures (DRSs). These structures\nare a type of database that contains specific pieces of information.\nIn and of itself a DRS is a static object, but DRT can be said to be a\ndynamic semantic framework because it allows us to understand the\nprocess of composing meanings as a process of merging\ndiscourse representation structures. In this way, information change\nbecomes an integral part of the interpretation process.\n\nOur main focus in this entry is a second approach to dynamic\nsemantics, although we will compare things to DRT along the way. In\nthis second approach, dynamic meanings are types of actions, things\nthat are individuated by the changes they effect. This is the approach\nassociated with dynamic predicate logic (DPL, Groenendijk and\nStokhof 1991a). According to this dynamic semantic tradition, a\nmeaning is a specification of how a receiver’s information state\nwould be modified. It could for instance be a function that maps an\nold information state to one which has been updated with the\ninformation that the meaning embodies. Alternatively, it could be a\nrelation that expresses the kind of information change that the\nmeaning brings about. (For early work in this tradition, see\nGroenendijk and Stokhof 1991a,b; Muskens 1991; Dekker 1993; Vermeulen\n1993; van Eijck 1994; Vermeulen 1994; Krahmer 1995; van den Berg 1996;\nGroenendijk et al. 1996; Aloni 1997; Muskens et al. 1997).\n",
    "toc": [
        {
            "#InteProc": "1. Interpretation as a Process"
        },
        {
            "#UpdaSema": "1.1 Update Semantics"
        },
        {
            "#PropLogiUpdaLogi": "1.2 Propositional Logic as an Update Logic"
        },
        {
            "#ProgStatTheiExec": "1.3 Programming Statements and their Execution"
        },
        {
            "#NotiContDynaSema": "1.4 The notion of context in dynamic semantics"
        },
        {
            "#DynaPredLogi": "2. Dynamic Predicate Logic"
        },
        {
            "#ConcUnde": "2.1. Conceptual Underpinnings"
        },
        {
            "#SpecDynaPredLogi": "2.2 Specifying Dynamic Predicate Logic"
        },
        {
            "#ExamDonkSent": "2.3 Example: donkey sentences"
        },
        {
            "#DynaGeneQuan": "2.4 Dynamic generalized quantification"
        },
        {
            "#DynaBeyoAnap": "2.5 Dynamics beyond anaphora"
        },
        {
            "#Pres": "3. Presupposition"
        },
        {
            "#PresDynaSemaConn": "3.1 Presupposition and dynamic semantics of connectives"
        },
        {
            "#PresDynaEpisLogi": "3.2 Presuppositions and Dynamic Epistemic Logic"
        },
        {
            "#BeyoPres": "3.3. Beyond presupposition"
        },
        {
            "#EncoDynaTypeLogi": "4. Encoding Dynamics in Typed Logic"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Interpretation as a Process\n\nInterpretation of declarative sentences can be viewed as a product or\nas a process. In the product perspective, one focuses on the notion of\ntruth in a given situation. In the process perspective, interpretation\nof a proposition is viewed as an information updating step that allows\nus to replace a given state of knowledge by a new, more accurate\nknowledge state. Dynamic semantics focuses on interpretation as a\nprocess.\n1.1 Update Semantics\n\nUpdate semantics is a particular way in which the\ninterpretation-as-process idea can be implemented. The central idea\nbehind update semantics is very simple. We start with a simple model\nof a hearer/receiver who receives items of information sequentially.\nAt every moment the hearer is in a certain state: she possesses\ncertain information. This state is modified by the incoming\ninformation in a systematic way. We now analyze the meaning of the\nincoming items as their contribution to the change of the information\nstate of the receiver. Thus, meanings are seen as actions, or, more\nprecisely, as action types: They are not the concrete changes\nof some given state into another, but what such concrete changes have\nin common.\n1.2 Propositional Logic as an Update Logic\n\nPropositional logic (the logic of negation, disjunction and\nconjunction) can be viewed as an update logic as follows. Consider the\ncase where we have three basic propositions \\(p, q\\) and \\(r\\), and\nwe know nothing about their truth. Then there are eight possibilities:\n\\(\\{ \\bar{p} \\bar{q} \\bar{r}, p \\bar{q} \\bar{r}, \\bar{p} q \\bar{r},\n\\bar{p} \\bar{q} r, pq \\bar{r}, p \\bar{q} r, \\bar{p} qr, pqr \\}\\) Here\n\\(\\bar{p} \\bar{q} \\bar{r}\\) should be read as: none of \\(p, q, r\\) is\ntrue, \\(p \\bar{q} \\bar{r}\\) as: \\(p\\) is true but \\(q\\) and\n\\(r\\) are false, and so on. If now \\(\\neg p\\) (“not\n\\(p\\)”) is announced, four of these disappear, and we are\nleft with \\(\\{\\bar{p} \\bar{q} \\bar{r}, \\bar{p} q \\bar{r}, \\bar{p}\n\\bar{q} r, \\bar{p} qr\\}\\). If next \\(q \\vee \\neg r\\) (“\\(q\\)\nor not \\(r\\)”) is announced, the possibility \\(\\bar{p}\n\\bar{q} r\\) gets ruled out, and we are left with \\(\\{ \\bar{p} \\bar{q}\n\\bar{r}, \\bar{p} q \\bar{r}, \\bar{p} qr \\}\\). And so on. We can view\nthe meaning of propositions like \\(\\neg p\\) and \\(q \\vee \\neg r\\) as\nmappings from sets of possibilities to subsets thereof.\n\nSets of possibilities represent states of knowledge. In the example,\n\\(\\{ \\bar{p} \\bar{q} \\bar{r}, p \\bar{q} \\bar{r}, \\bar{p} q \\bar{r},\n\\bar{p} \\bar{q} r, pq \\bar{r}, p \\bar{q} r, \\bar{p} qr, pqr \\}\\)\nrepresents the state of complete ignorance about propositions \\(p, q,\nr\\). Singleton sets like \\(\\{ pq \\bar{r} \\}\\) represent states of\nfull knowledge about these propositions, and the empty set\n\\(\\varnothing\\) represents the inconsistent state that results from\nprocessing incompatible statements about \\(p, q\\) and \\(r\\). Here\nwe spell out the dynamic meanings of the statements of our\npropositional language: \n\nAtomic statements. These are \\(p, q, r\\). The\ncorresponding update action is to select those possibilities from the\ncurrent context where the letter is not struck out (overlined).\nNegated statements. These are of the form \\(\\neg \\phi\\).\nThe corresponding update action is to select those possibilities from\nthe current context that form the complement of the set of\npossibilities selected by the \\(\\phi\\) statement.\nConjunctions of statements. These are of the form \\(\\phi\n\\wedge \\psi\\). The corresponding update action is to select those\npossibilities from the current context that form the intersection of\nthe selections from the current context made by the \\(\\phi\\) and the\n\\(\\psi\\) statements.\nDisjunctions of statements. These are of the form \\(\\phi\n\\vee \\psi\\). The corresponding update action is to select those\npossibilities from the current context that form the union of the\nselections made by the \\(\\phi\\) and the \\(\\psi\\) statements.\n\n\nThis gives the meanings of the propositional connectives as operations\nfrom an old context representing a state of knowledge to a new context\nrepresenting the state of knowledge that results from processing the\npropositional information.\n1.3 Programming Statements and their Execution\n\nIt is instructive to compare the actions of update semantics to\nprogramming statements and their execution. Such a comparison provides\na first glimpse into how quantification works within a dynamic\nsetting. Programming statements of imperative languages are\ninterpreted (or “executed”) in the context of a machine\nstate, where machine states can be viewed as allocations of values to\nregisters. Assume the registers are named by variables \\(x, y, z\\),\nand that the contents of the registers are natural numbers. Then the\nfollowing is a machine state: \n\n\\[\n\\begin{array}{|c|c|}\\hline\nx & 12 \\\\\\hline\ny & 117 \\\\\\hline\nz & 3 \\\\\\hline\n\\end{array}\n\\]\n\n\nIf the statement \\(z := x\\) is executed, i.e.,\n“interpreted”, in this state (in C syntax, this statement\nwould have the simpler form \\(z = x)\\), the result is a new machine\nstate: \n\n\\[\n\\begin{array}{|c|c|}\\hline\nx & 12 \\\\\\hline\ny & 117 \\\\\\hline\nz & 12 \\\\\\hline\n\\end{array}\n\\]\n\n\nIf the sequence of statements \\(x := y\\); \\(y := z\\) is executed in\nthis state, the result is: \n\n\\[\n\\begin{array}{|c|c|}\\hline\nx & 117 \\\\\\hline\ny & 12 \\\\\\hline\nz & 12 \\\\\\hline\n\\end{array}\n\\]\n\n\nThis illustrates that the result of the sequence \\(z := x\\); \\(x :=\ny\\); \\(y := z\\) is that the values of \\(x\\) and \\(y\\) are\nswapped, with the side effect that the old value of \\(z\\) gets\nlost. In other words, the meaning of the program \\(z := x\\); \\(x :=\ny\\); \\(y := z\\) can be viewed as a mapping from an input machine state\n\\(s\\) to an output machine state \\(s'\\) that differs from \\(s\\)\nin several respects: \\(s'(x) = s(y)\\) and \\(s'(y) = s(x)\\) (that is,\nthe input values of \\(x\\) and \\(y\\) are swapped in the\noutput state), and \\(s'(z) = s'(y)\\).\n\nNow consider the existential quantifier “there exists an\n\\(x\\) such that \\(A\\)”. Suppose we add this quantifier to\nan imperative programming language. What would be its meaning? It\nwould be an instruction to replace the old value of \\(x\\) by a new\nvalue, where the new value has property \\(A\\). We can decompose\nthis into a part “there exists \\(x\\)” and a test\n“\\(A\\)”. A formula/instruction is a test if\nthe update contributed by it takes the states in the input context one\nat a time and tests that they satisfy a particular condition. If they\ndo, they are included in the output context; if they don’t, they\nare discarded. That is, a test is an update that takes an input\ncontext and outputs a context that is a subset of the input context.\nAll the formulas of propositional logic in the\n Propositional logic as an update logic\n section above are tests.\n\nThe two parts “there exists \\(x\\)” and the test\n“\\(A\\)” are glued together by sequential composition:\n“\\(\\exists x\\); \\(A\\)”. Focusing on the part\n“\\(\\exists x\\)”, what would be its natural meaning? An\ninstruction to replace the old value of \\(x\\) by some arbitrary new\nvalue. This is again a relation between input states and output\nstates, but the difference with definite assignments like \\(x := y\\)\nis that now the relation is not a function. In fact, this relational\nmeaning of quantifiers shows up in the well known Tarski-style truth\ndefinition for first order logic (compare the entry on\n Tarski’s truth definitions):\n\n\n\\(\\exists x\\phi\\) is true in a model \\(M\\) relative to a variable\nassignment \\(\\alpha\\) iff (if and only if) there is some variable\nassignment \\(\\beta\\) such that \\(\\beta\\) differs from \\(\\alpha\\) at\nmost with respect to the value it assigns to \\(x\\) and such that\n\\(\\phi\\) is true in \\(M\\) relative to assignment \\(\\beta\\). \n\n\nImplicit in the Tarskian definition is a relation that holds between\nassignment \\(\\alpha\\) and assignment \\(\\beta\\) iff for all variables\n\\(y\\) that are different from \\(x\\), it is the case that\n\\(\\alpha(y) = \\beta(y)\\). This relation is often called a random\nreset of x and is written as [\\(x\\)]. For any variable\n\\(x\\), the binary relation between total assignments [\\(x\\)] is\nan equivalence relation between assignments, i.e., it is a reflexive,\nsymmetric and transitive binary relation. Below, we see how such\nrelations are put to work in a dynamicised version of first order\npredicate logic. \n\nAdopting [\\(x\\)] as the meaning of “\\(\\exists x\\)”,\nnote that its meaning is quite different in nature from that of a test\nin that it creates new values in the output context. In contrast, the\noutput context resulting from an update with a test is always a subset\nof the input context and can therefore never contain anything new\nrelative to the input context.\n1.4 The notion of context in dynamic semantics\n\nInformation states are often called contexts, since the state\nis a precondition for the “interpretation”, i.e., semantic\nevaluation, of expressions in a formal or natural language. The use of\nthe word “context” also makes it clear that we are not\ninterested in the total state of the receiver but only in aspects of\nit relevant to the interpretation of the expressions/informational\nitems we are focusing on. Thus, meanings are often called context\nchange potentials in the dynamic tradition.\n\nAlthough it is broadly speaking true that the changes brought about by\nmeanings in dynamic semantics concern aspects of context, it\nis important to note that semanticists may mean various things when\nthey talk about context (compare the entries on\n epistemic contextualism\n and\n indexicals),\n and these different views engender varieties of dynamic semantics\nthat deal with a variety of issues. Some of these issues are:\nconstructing an appropriate mechanism for pronominal reference\n(compare the entries on\n anaphora\n and\n reference),\n explaining the semantics of conditionals (compare the entries on\n conditionals\n and\n the logic of conditionals),\n giving a semantic treatment of the distinction between assertion and\npresupposition (compare the entries on\n assertion,\n speech acts,\n implicature,\n pragmatics) and developing a theory of “presupposition\nprojection”, explaining how the interpretation of discourse is\ninfluenced and guided by the common ground that exists between speaker\nand hearer, and developing a theory of how this common ground develops\nas the discourse proceeds (compare the entries on\n pragmatics\n and\n implicature).\n\nContext plays a role in two separate distinctions. The first\ndistinction is between context and that which modifies the context.\nHere the context is the information state or a suitable abstraction\nthereof (compare the entry on\n semantic conceptions of information).\n The context modifier is (the meaning of) the received informational\nitem. The information cannot be received without the correct kind of\npresupposed information state. The proper analogues in classical\nstatic predicate logic (compare the entries on\n classical logic\n and\n first-order model theory)\n are as follows: the information state is an assignment (environment)\nor a set of assignments, and the received information is a set of\nassignments. The second distinction is between context and content.\nHere the context is something like the storage capacity of the\nreceiver and various other features that could influence how new\nexpressions/informational items are interpreted. The content is the\n(factual, truth conditional) information that is stored. Thus, e.g.,\nthe context in this sense could be a set of registers/variables or in\nDRT/FCS terms, discourse referents or files. The content would then be\nsome set of assignments or, perhaps, world/assignment pairs\nconstraining the values of these discourse referents and the set of\nworlds that are live candidates for the actual world.\n\nHere is an example to illustrate the distinctions. Suppose we view an\ninformation state as a pair of a finite set of discourse referents and\na set of world/assignment pairs, where the assignments have as domain\nthe given finite set of discourse referents. Such a state would be a\ncontext-in-the-first-sense and the set of discourse referents would be\na context-in-the-second-sense. One basic kind of update would be\nupdate of content: here we constrain the set of world/assignment\npairs, and leave the set of referents constant. A second basic kind of\nupdate would be extension of the set of referents: we extend our\nallocated storage capacity. We modify the given world/assignments\npairs to pairs of worlds and extended assignments, where our extended\nassignments are constrained by the old ones, but take all possible\nvalues on the new referents. Thus, the update process in our example\nis two-dimensional: we have both update of content and update of\ncontext-in-the-second-sense.\n2. Dynamic Predicate Logic\n2.1. Conceptual Underpinnings\n\nThe motivation for a dynamic semantic framework for natural language\ncomes first and foremost from potential dependencies between the\nreference of a personal pronoun and that of an indefinite noun phrase.\nThe simplest example of such a dependency is that of coreferential\ndiscourse anaphora, as in:\n\n(1) Mary\nmet a student yesterday. He needed help. \n\n\nThe observation is that this sequence of sentences has the same\nmeaning as the single sentence:\n\n(2)\nYesterday, Mary met a student who needed help. \n\n\nIf we assume that indefinites are existential quantifiers, then the\nanalysis of\n (2)\n is easy. It simply says that there exists an \\(x\\) that is a\nstudent, that met Mary yesterday and that needed her help then. In\npredicate logic:\n\n(3)\n\n\\(\\exists x(\\texttt{student}(x)\\wedge\\texttt{met}(m,x)\\wedge\\texttt{need-help}(x))\\)\n\n\nHowever, a similar analysis is unavailable for the equivalent\ntwo-sentence example in\n (1).\n This is because interpretation is compositional (see the\nentry on\n compositionality\n for discussion) and in our compositional analysis, we will first come\nto an analysis of Mary met a student yesterday, which will\nhave the form \\(\\exists\nx(\\texttt{student}(x)\\wedge\\texttt{met}(m,x))\\). Likewise, the second\nsentence will correspond to \\(\\texttt{need-help}(x)\\). Assuming that\nthe default mode of combining multiple sentences is to conjoin them,\nwe now arrive at:\n\n(4)\n\n\\(\\exists x(\\texttt{student}(x)\\wedge\\texttt{met}(m,x))\\wedge\\texttt{need-help}(x)\\)\n\n\nThe final occurrence of \\(x\\) is not bound and so in classical\npredicate logic, we have not arrived at an equivalent translation for\n (1)\n and\n (2).\n The upshot is that if we want to account for the equivalence between\n (1)\n and\n (2)\n within a static semantic framework, we will not be able to maintain a\ncompositional interpretation for individual sentences. We will have to\nassume that the discourse in\n (1)\n is interpreted as a whole.\n\nThis is counter-intuitive. We know what the individual sentences in\n (1)\n mean and we would like to capture the potential these meanings have\nin combining with other meanings to form a meaningful whole, one which\ncorresponds to a sequence of sentences. Dynamic semantics allows us to\ndeliver a fully compositional analysis of meaning at the sentential\nand supra-sentential level. It does so by guaranteeing that in\ncontrast to classical predicate logic,\n (3)\n and\n (4)\nare equivalent in a dynamic interpretation of\nclassical predicate logic syntax. In particular, the following is\nvalid in dynamic predicate logic: \n\n\\[\\exists x(\\psi \\wedge \\phi) \\textrm{ iff }  \\exists x(\\psi)\\wedge \\phi\\]\n\n\nIn this kind of dynamic semantics for natural language, the meaning of\na sentence does not correspond to a set of truth-conditions, but\nrather to an action performed on a context. There are two kinds of\nactions. Predications like \\(\\texttt{need-help}(x)\\) or\n\\(\\texttt{met}(m,x)\\) are tests. They merely check if every\nstate/assignment in the current context assigns a value to \\(x\\)\nthat satisfies the relevant predicate; if (and only if) this is the\ncase, the test passes the unaltered assignment on to the output\ncontext. In contrast, the existential quantifier is not a test. It has\nthe potential to alter the context by randomly resetting the value of\nits associated variable. So, \\(\\exists x(\\psi)\\) takes a context,\nrandomly changes the value of \\(x\\) in each assignment in the\ncontext and passes these changed assignments on to the output context\nif they also satisfy the condition contributed by the test\n\\(\\psi\\).\n\nOne of the main consequences of this semantics is that the scope of\nthe existential quantifier is in principle limitless. It changes the\nvalue of some variable and until a further change to that variable\noccurs, any subsequent test accesses the particular value that was\nset. This also means that the semantics of existential quantification\ncan be given without reference to any scope: the meaning of \\(\\exists\nx\\) is the action that takes a context and returns the same context\nwith at most the value of \\(x\\) randomly replaced by another value.\n(We will work this out in detail below.)\n\nRight now, two senses of the term dynamic semantics (as applied to\nnatural language) emerge. First and foremost, dynamic semantics is the\ngeneral idea that logical statements do not express truth-conditions\nbut rather actions on contexts (where contexts can be conceptualized\nin various ways). A second understanding of the term dynamic semantics\nis a set of theoretical positions taken within debates concerning the\nsemantics of certain natural language phenomena, most notably\npronominal anaphora. (See below for a similar take on dynamic\nsemantics with respect to presupposition). For the case of\nanaphora, this theoretical understanding embodies the combination of\ntwo hypotheses: (i) pronouns correspond to variables; (ii) indefinites\nare non-quantificational, they simply contribute a dynamic variable\nassignment update. As is clear from the second hypothesis, this\ntheoretical use of the term dynamic semantics presupposes the more\ngeneral view that meanings are actions on contexts. \n\nBefore we turn to defining dynamic predicate logic, we should note\nthat the route dynamic semantics takes to account for anaphora is by\nno means the only one to be found in the literature. We could also\nchoose to give up the idea that pronouns are correspond to variables\nand instead assign them a more intricate meaning, one akin to that of\ndefinite descriptions. In the contemporary tradition, such ideas\nemerge as early as Quine 1960 and Geach 1962, before being brought to\nmaturity by (especially) Evans (1977, 1980), Parsons (1978, Other\nInternet Resources), Heim (1990), and Elbourne (2001, 2005). See\nNouwen (forthcoming) for discussion.\n2.2 Specifying Dynamic Predicate Logic\n\nThe previous subsection gave a first glimpse into the basic aim of a\ndynamic semantic framework, which is to define a logical semantics in\nwhich statements express actions and specifically, in which\nexistential quantification has the potential to reset variables, thus\nchanging the context. We get our clue about how to do this by\nexamining the definition of existential quantification in ordinary\npredicate logic. Suppose we work with total assignments on a fixed set\nof variables \\(\\textsf{VAR}\\) over a fixed domain \\(D\\). The set of\ntotal assignments \\(\\textsf{ASSIGN}\\) is therefore the set of all\n(total) functions from \\(\\textsf{VAR}\\) to \\(D\\).\n\nLet the meaning of atomic formulas like \\(P(x)\\) be the set \\(F\\)\nof all assignments \\(\\alpha\\) such that \\(\\alpha(x)\\) is an object\nsatisfying \\(P\\).\n\nNow define: \n\n\\[\n\\alpha[x]\\beta := \\forall v \\in \\textsf{VAR}\\setminus\\{x\\}\\ (\\alpha(v) = \\beta(v)).\n\\]\n\n So [\\(x\\)] is the binary relation\n“assignment \\(\\beta\\) is a result of (at most) resetting the\nvalue of the variable \\(x\\) in assignment \\(\\alpha\\)”. As\nalready mentioned, this is an equivalence relation over variable\nassignments. Now the meaning \\(G\\) of \\(\\exists x P(x)\\), will be:\n\n\\[\nG := \\{\\alpha \\in \\textsf{ASSIGN } \\mid \\exists \\beta \\in F \\alpha[x]\\beta \\}.\n\\]\n\n Thus, \\(G\\) is the set of assignments that can be\nsuccessfully reset with respect to \\(x\\) and obtain an assignment\nin \\(F\\) as a result of this resetting. Viewed differently,\n\\(G\\) is the domain of the relation \\(R\\) given by\n\n\\[\\alpha R\\beta := \\alpha[x]\\beta \\textrm{ and } \\beta \\in F.\n\\]\n\n \n\nWe could say that \\(G\\) is the precondition for the resetting\naction \\(R\\). Now the idea of \\(\\textsf{DPL}\\) is to take the\nmeaning of \\(\\exists x P(x)\\) to be not the precondition \\(G\\) (as\nin classical static first order logic) but the resetting action\n\\(R\\). In this way we do not lose information since \\(G\\) can\nalways be obtained from \\(R\\). Moreover, the range of the relation\n\\(R\\) consists of assignments \\(\\beta\\) that differ from\nassignments in the precondition \\(G\\) at most with respect to the\nvalue of \\(x\\) and that are also in \\(F\\) (i.e., \\(\\beta(x)\\) is\nin the interpretation of \\(P)\\). The \\(x\\) values stored in the\nrange of the binary relation \\(R\\) are precisely the \\(x\\)\nvalues that satisfy \\(P\\), i.e., the values we were looking\nfor.\n\nMore generally, we take as \\(\\textsf{DPL}\\)-meanings binary\nrelations between assignments. Such relations can be seen as\n(modeling) resetting actions. This is an instance of an\nadmittedly simplistic but well-known and useful way of modeling\nactions: an action is viewed as a relation between the states of the\nworld before the action and the corresponding states after the\naction.\n\nHere is the full definition. Assume a non-empty domain \\(D\\), a set\nof variables \\(\\textsf{VAR}\\) and a model \\(\\mathcal{M}=\\langle D,\nI\\rangle\\) of signature \\(\\Sigma\\). Atomic conditions \\(\\pi\\) are of\nthe form \\(P(x_0 , \\ldots ,x_{n-1})\\), where \\(P\\in \\Sigma\\) is of\narity \\(n\\). Atomic resets \\(\\varepsilon\\) are of the form\n\\(\\exists v\\), where \\(v\\) is a variable. The language of predicate\nlogic for \\(\\Sigma\\) is given below (\\(\\cdot\\) is conjunction and\n\\({\\sim}\\) is negation):  \n\n\\[\n\\phi ::= \\bot \\mid \\top \\mid \\pi \\mid \\varepsilon \\mid \\phi \\cdot \\phi \\mid {\\sim}(\\phi).\n\\]\n\n\nAssignments are elements \\(\\alpha , \\beta ,\\ldots\\), of\n\\(\\textsf{ASSIGN} := D^{\\textsf{VAR}}\\). We define the\ndynamic/relational semantics for this language as follows: \n\n\\(\\alpha[\\bot]\\beta := \\alpha \\ne \\alpha\\).\n\\(\\alpha[\\top]\\beta := \\alpha = \\beta\\).\n\\(\\alpha[P(x_0 , \\ldots ,x_{n-1})]\\beta := \\alpha = \\beta\\) and\n\\(\\langle \\alpha(x_0), \\ldots ,\\alpha(x_{n-1})\\rangle \\in I(P)\\),\nwhere \\(P\\in \\Sigma\\) has arity \\(n\\).\n\\(\\alpha[\\exists v]\\beta := \\alpha[v]\\beta\\)\n\\(\\alpha[\\phi \\cdot \\psi]\\beta :=\\) there is a \\(\\gamma\\) such\nthat \\(\\alpha[\\phi]\\gamma\\) and \\(\\gamma[\\psi]\\beta\\), or\n\\(\\alpha[\\phi]\\gamma[\\psi]\\beta\\) for short.\n\\(\\alpha[{\\sim}(\\phi)]\\beta := \\alpha = \\beta\\) and there is no\n\\(\\gamma\\) such that \\(\\alpha[\\phi]\\gamma\\).\n\n\nNote that conjunction \\(\\cdot\\) is interpreted as relation\ncomposition, and negation \\({\\sim}\\) is basically interpreted as\ncomplementation with respect to the domain of the relation denoted by\nthe negated formula.\n\nTruth is defined in terms of relational meanings; we basically project\nthe binary relations between assignments onto their first\ncoordinate: \n\n\\[\\alpha \\vDash \\phi := \\exists \\beta\\ \\alpha[\\phi]\\beta.\\]\n\n\nWe can define implication \\(\\phi \\rightarrow \\psi\\) as \\({\\sim}(\\phi\n\\cdot {\\sim}\\psi)\\). Applying the truth definition to this gives:\n\n\n\\(\\alpha \\vDash \\phi \\rightarrow \\psi \\textrm{ iff } \\forall\n\\beta(\\alpha[\\phi]\\beta \\Rightarrow \\beta \\vDash \\psi)\\), i.e., any\nassignment \\(\\beta\\) that results from updating \\(\\alpha\\) with the\nantecedent \\(\\phi\\) satisfies the consequent \\(\\psi\\). \n\n\nRelational meanings also yield the following beautiful definition of\ndynamic entailment: \n\n\\[\\phi \\vDash \\psi := \\forall \\alpha , \\beta(\\alpha[\\phi]\\beta \\Rightarrow \\exists \\gamma \\beta[\\psi]\\gamma).\\]\n\n\nThis definition was first introduced by Hans Kamp in his pioneering\npaper Kamp 1981. Informally, it says that any assignment \\(\\beta\\)\nthat has incorporated the update contributed by \\(\\phi\\) is guaranteed\nto support/satisfy \\(\\psi\\).\n\nNote that \\({\\sim}\\phi\\) is equivalent to \\((\\phi \\rightarrow \\bot)\\),\nand that \\((\\phi \\rightarrow \\psi)\\) is true iff \\(\\phi \\vDash \\psi\\).\nEqually importantly, we can define \\(\\forall x (\\phi)\\) as \\((\\exists\nx \\rightarrow \\phi)\\).\n\nA possible alternative notation for \\(\\exists v\\) would be [\\(v := ?\\)] \n(random reset). This emphasizes the connection with random\nassignment in programming languages.\n\nThe interpretations of predicate symbols are conditions. They\nare subsets of the diagonal \\(\\{\\langle \\alpha , \\alpha \\rangle \\mid\n\\alpha \\in \\textsf{ASSIGN}\\}\\) (which is the meaning of \\(\\top)\\).\nSubsets of the diagonal are tests: they modify nothing and simply pass\non what is OK (satisfies the condition) and throw away what is not.\nThe mapping \\(\\textsf{diag}\\) that sends a set \\(F\\) of assignments\nto a condition \\(\\{\\langle \\alpha , \\alpha \\rangle \\mid \\alpha \\in\nF\\}\\) is the link between the classical static and the dynamic world.\nFor example, the relational composition of \\(\\textsf{diag}(F)\\) and\n\\(\\textsf{diag}(G)\\) is \\(\\textsf{diag}(F\\cap G)\\).\n\nClassical first-order logic (FOL) can be interpreted in\n\\(\\textsf{DPL}\\) as follows. We assume that the FOL language has the\nfollowing connectives and quantifiers: \\(\\top , \\bot , \\wedge ,\n\\rightarrow , \\exists x\\). We translate as follows:\n\n\\(( )^*\\) commutes with atomic formulas and with\n\\(\\rightarrow\\)\n\\((\\phi \\wedge \\psi)^* := \\phi^* \\cdot \\psi^*\\)\n\\((\\exists x(\\phi))^* := \\neg \\neg(\\exists x \\cdot \\phi^*)\\)\n\n\nWe get that \\([\\phi^*]\\) is the diagonal of the classical\ninterpretation of \\(\\phi\\). Our translation is compositional. It shows\nthat FOL can be taken as a fragment of \\(\\textsf{DPL}\\).\n\nIt is, conversely, possible to translate any \\(\\textsf{DPL}\\)-formula\n\\(\\phi\\) to a predicate logical formula \\(\\phi\\)°, such that the\ndomain of \\([\\phi]\\) is the classical interpretation of \\(\\phi\\)°.\nOne of the ways to define this translation is by means of a\nprecondition calculus, with Floyd-Hoare rules (Eijck and de Vries\n1992). The following is a variation on this. Take the language of\nstandard predicate logic, with diamond modalities \\(\\langle \\psi\n\\rangle \\phi\\) added, where \\(\\psi\\) ranges over DPL formulas and\n\\(\\alpha \\vDash \\langle \\psi \\rangle \\phi\\) iff there is an assignment\n\\(\\beta\\) with \\(\\alpha[\\psi]\\beta\\), and \\(\\beta \\vDash \\phi\\). Then\nthe following equivalences show that this extension does not increase\nexpressive power.\n\n\\(\\langle \\bot \\rangle \\phi \\leftrightarrow \\bot\\).\n\\(\\langle \\top \\rangle \\phi \\leftrightarrow \\phi\\).\n\\(\\langle P(x_1 \\ldots x_n)\\rangle \\phi \\leftrightarrow (P(x_1\n\\ldots x_n) \\wedge \\phi)\\).\n\\(\\langle \\exists v\\rangle \\phi \\leftrightarrow \\exists\nv\\phi\\).\n\\(\\langle \\psi_1 \\cdot \\psi_2\\rangle \\phi \\leftrightarrow \\langle\n\\psi_1\\rangle \\langle \\psi_2\\rangle \\phi\\).\n\\(\\langle{\\sim}(\\psi)\\rangle \\phi \\leftrightarrow(\\neg(\\langle\n\\psi \\rangle \\top) \\wedge \\phi)\\).\n\n\n So in a weak sense “nothing new happens in\n\\(\\textsf{DPL}\\)”. We cannot define a set that we cannot also\ndefine in FOL. The equivalences for the modalities fix a translation\n( )° that yields the weakest precondition for achieving a\ngiven postcondition; see the next section for an illustration of such\na translation.\n\n2.3 Example: donkey sentences\n\nAn example of the merits of dynamic predicate logic is that it allows\nfor a straightforward compositional analysis of donkey sentences\n(Geach 1962; see the entry on anaphora).\n\n(5) If a\nfarmer owns a donkey, he beats it. \n\n\nThere is obviously a dependency between the pronouns \\(he\\) and \\(it\\)\nand the indefinites a farmer and a donkey,\nrespectively. In a nutshell, the problem for\n (5)\n in a classical analysis is that such an analysis gives us two\nchoices, which taken together do not cover the possible meanings of\n (5).\n If we treat the indefinites as referring to a particular farmer and a\nparticular donkey and the pronouns as simply picking up that same\nentities, then we get a possible yet not very salient reading for\n (5).\n The most prominent reading describes a co-variation between the\nowning relation and the beating relation: any farmer-donkey pair that\nstands in the own relation also stands in the beat\nrelation. Clearly, we will need to interpret the indefinites as\nquantifiers. Yet if we do so, they won’t be able to bind the\nvariables in the consequent of the conditional since a compositional\nanalysis will place the variables contributed by the pronouns outside\nthe classical scope of the existential quantifiers in the antecedent\nof the conditional. That is,\n (6)\n does not yield the correct truth-conditions for\n (5).\n\n(6)\n\n\\((\\exists x(\\textrm{farmer}(x)\\wedge \\exists y(\\textrm{donkey}(y)\\wedge\\textrm{own}(x,y))))\\rightarrow\\textrm{beat}(x,y)\\)\n\n\nThe dynamic version of\n (6)\n is\n (7),\n which yields the correct truth conditions: any random reset of\n\\(x\\) and \\(y\\) such that \\(x\\) is a farmer and \\(y\\) is a\ndonkey owned by \\(x\\) is also such that \\(x\\) beats\n\\(y\\).\n\n(7)\n\n\\(\\exists x\\cdot \\textrm{farmer}(x)\\cdot \\exists y\\cdot \\textrm{donkey}(y)\\cdot \\textrm{own}(x,y)\\rightarrow \\textrm{beat}(x,y)\\)\n\n\nInterestingly, the translation ( )° of\n (7)\n into predicate logic is not\n (6)\n but\n (8).\n So the problem is not that predicate logic cannot express the\ntruth-conditions of donkey conditionals but that sentences like\n (8)\n are unlikely to be the end product of a compositional interpretation\nprocess (but see Barker and Shan 2008). \n\n(8)\n\n\\(\\neg \\exists x (\\textrm{farmer} (x) \\wedge \\exists y (\\textrm{donkey} (y) \\wedge  \\textrm{own}(x,y)  \\wedge \\neg \\textrm{beat}(x,y))).\\)\n\n\nThis is how\n (8)\n is derived from\n (6):\n \n\n\\[\n\\begin{array}{l}\n  (\\langle(\\exists x \\cdot  \n   Fx \\cdot \\exists y \\cdot Dy  \\cdot   Hxy ) \\rightarrow   Bxy  \\rangle \\top) °  \\\\ \n = (\\langle{\\sim}((\\exists x \\cdot Fx \\cdot \\exists y \\cdot Dy  \\cdot   Hxy ) \\cdot   {\\sim}  Bxy )  \\rangle \\top) °  \\\\\n = \\neg(\\langle(\\exists x \\cdot Fx \\cdot \\exists y \\cdot Dy  \\cdot   Hxy ) \\cdot   {\\sim}  Bxy   \\rangle \\top) °  \\\\\n  =\\ldots   \\\\\n = \\neg \\exists x (Fx \\wedge \\exists y (Dy \\wedge   Hxy   \\wedge \\neg  Bxy ))).\\\\\n\\end{array}\n\\]\n\n\n2.4 Dynamic generalized quantification\n\nThe successful application of dynamic predicate logic to the\ninteraction of quantification and anaphora in natural languages hinges\non the fact that in DPL, existential quantification is dynamic whereas\nuniversal quantification is not. What would happen if universal\nquantification were dynamic too? Note first of all, that it makes no\nsense to define a universal quantification action \\(\\forall x\\) in\nparallel to the random reset action \\(\\exists x\\). This is because\nuniversal quantification only makes sense on a given domain (the\nrestrictor) and with respect to some given property (the\nscope). Second, if we give \\(\\forall x(\\phi)(\\psi)\\) a\ndynamic interpretation, it predicts that universal quantifiers can\nstand in anaphoric relations to singular pronouns across clausal\nboundaries, just as existential quantifiers can. For cases like\n (9),\n this is clearly undesirable.\n\n(9) Every boy\nwrote an essay. #He wrote a research proposal too. \n\n\nHowever, as soon as one looks at plural anaphora it becomes\napparent that the static nature of universal quantification (and, in\nfact, that of other non-indefinite generalized quantifiers) should not\nbe taken for granted. For example,\n (10)\n allows a reading in which they is anaphorically linked to\nevery boy.\n\n(10) Every\nboy wrote an essay. They wrote a research proposal too. \n\n\nOn the assumption that examples like\n (10)\n should receive a dynamic treatment (see the earlier remark on\nalternative explanations and Nouwen, forthcoming, for discussion), the\nconclusion can only be that universal quantifiers should not be given\na static interpretation. The next question is then what kind of\ninterpretation is appropriate, and how this interpretation can\ndistinguish the infelicitous case of anaphora in\n (9)\n from the case in\n (10).\n One option would be to distinguish between the values assigned to the\nvariables that are bound by the quantifier in its scope and the value\nassigned to that variable outside the scope of the quantifier. (See,\nfor instance, Kamp and Reyle 1993 for such a strategy and Nouwen 2007\nfor discussion.) In order to account for\n (10),\n one would have the variable occurrences bound by the quantifier in\nthe first sentence of\n (10)\n range over individual boys, while that variable gets assigned the\nplurality of all boys outside the quantifier’s scope (i.e. in\nthe second sentence). As van den Berg (1996) was the first to show,\nhowever, such a solution only gets there half-way. In discourse,\npronouns do not just have access to pluralities associated to\nquantifiers, but also to the relations such quantifiers are engaged\nin. For instance, in the second sentence of\n (11)\n the pronoun \\(it\\) covaries with the quantification over the boys in\nthe subject in such a way that the second sentence is understood to\nmean that each boy submitted the paper that \\(he\\) wrote (cf. van den\nBerg 1996; Krifka 1996; Nouwen 2003; Brasoveanu 2007, 2008).\n\n(11) Every\nboy wrote an essay. Each of them submitted it to a journal.\n\n\n\nThe leading idea in dynamic treatments of generalized quantification\nand plural anaphora is to represent plural values not by assigning\npluralities to variables, but rather to adopt a notion of context that\nallows for pluralities (e.g., sets) of assignment functions. Say that\nthe first sentence in\n (11)\n is translated into dynamic predicate logic with dynamic quantifiers\nas follows: \\(\\forall x(\\textrm{boy}(x))(\\exists y\\cdot\n\\textrm{essay}(y)\\cdot \\textrm{wrote}(x,y))\\). The interpretation of\nsuch formulas requires collecting assignment functions in which the\nvalue of \\(x\\) is a boy and the value of \\(y\\) is an essay\nwritten by this boy. The universal quantifier requires such\ncollections to include all possible values for the predicate\nboy. In the subsequent discourse, we now have access to the\nset of all \\(x\\) values, i.e., the set of all boys, the set of all\n\\(y\\) values, i.e., the set of essays written by the boys, as well\nas the individual boy-essay pairs: each atomic assignment \\(f\\) in\nthe set of contextual assignments following the first sentence of\n (11)\n is such that \\(f(y)\\) is an essay written by boy \\(f(x)\\). All that\nis now needed to account for the case of anaphora in\n (11) is the assumption that the universal\n quantification there involves universal quantification over\n assignment functions, rather than just quantification over\n values. See van den Berg (1996), Nouwen (2007,\n forthcoming), Brasoveanu (2007, 2008, 2013) for various ways of\n implementing this idea.\n\nThe upshot is that given a suitably structured notion of context,\nquantifiers can be given dynamic interpretations generally. An\nimportant consequence is that this kind of analysis extends to\nnon-nominal quantifiers (Brasoveanu 2007). Cases like\n (11)\n could be described as cases of quantificational subordination, and\nthe structured context approach can be seen as designed to offer a\nwindow into the mechanism behind subordination. Cases of modal\nsubordination (Roberts 1987, 1989), like the famous\n (12),\n can receive a parallel treatment.\n\n(12) A wolf\nmight come in. It may eat you. \n\n\nThe modal might introduces a quantifier over possible worlds\nthat takes scope over the indefinite a wolf, in the same way\nthat every boy takes scope over an essay in\n (11)\n above. The set of assignment functions that is the output of the\nupdate contributed by the first sentence in\n (12)\n will therefore store a set of possible worlds contributed by\nmight that are epistemically possible relative to the actual\nworld, and a set of wolves that come in in these epistemically\naccessible worlds. The second sentence in\n (12)\n can then further elaborate on the dependency between worlds and\nwolves requiring at least some of the epistemic possibilities to be\nsuch that the corresponding wolf not only comes in but also eats\nyou.\n2.5 Dynamics beyond anaphora\n\nAlthough anaphora and presuppositions (see below) are the central\nlinguistic phenomena that may be thought to require a dynamic semantic\nanalysis, in principle any aspect of the context could be the target\nof a phenomenon that warrants a dynamic analysis of interpretation.\nBarker’s 2002\ntreatment of the information provided by vague statements is\nillustrative. Barker assumes that contexts contain precise standards\nfor vague adjectives like tall. A sentence like\n (19)\n can then be used in two distinct ways.\n (19)\n John is tall. If the information state contains precise (enough)\ninformation about what counts as tall, then an utterance of\n (19)\n may be used to provide information about John’s height. If,\nhowever, the hearer has no idea about the appropriate precisification\nof an expression like tall (say, s/he is an alien or a\nforeigner), but s/he does have information about John’s height,\nthen\n (19)\n can be used to provide information about the standard.\n3. Presupposition\n3.1 Presupposition and dynamic semantics of connectives\n\nContext plays an important role in presupposition. A sentence like\n (13)\n presupposes that John is late. But put this sentence in a context\nproviding this very information, as in\n (14),\n and the presupposition disappears. That John is late is\nasserted in\n (14),\n not presupposed.\n\n(13) Mary\nknows that John is late\n(14) John is\nlate and Mary knows that he is late.\n\n\nStalnaker 1973 takes\npresupposition to be based on presumed common knowledge. Uttering a\nsentence like\n (13)\ntakes for granted that it is common knowledge that John is\nlate. In this sense,\n (13)\n requires the context of utterance to be such that this common\nknowledge is in place. In contrast,\n (14)\n lacks such a requirement simply because the first conjunct in\n (14)\n asserts what the second conjunct takes for granted. The crucial\nassumption made by Stalnaker is that interpretation is incremental in\nthe following sense: for a sentence of the form [\\(S\\)1 and\n\\(S\\)2], the interpretation of \\(S\\)2 occurs in a context which\nis already updated with \\(S\\)1. Schematically:\n\n(15)\n\n\\({C}[{S1 \\textrm{ and } S2}] = ({C}[{S1}])({S2})\\)\n\n\nStalnaker’s interpretation of the scheme in\n (15)\n is pragmatic: when we encounter a series of clauses in discourse, we\ninterpret these clauses in light of a context that is already\ninformed by the interpretation of previous clauses. This idea of\nincremental interpretation is simple yet powerful and it makes perfect\nsense for complex discourses with conjunctive interpretations (for\ninstance, coordinations with and and simple sequences of\ndeclarative sentences). Since the conjuncts in a conjunction have\nassertoric force, they can be used to update the context in order to\ncreate a new local context. The problem is though that presuppositions\ndo not just disappear in conjunctive environments. Just like\n (14),\n (16) also lacks the requirement that it should be common\nknowledge that John is late. But here the first disjunct does not have\nassertoric force (see, for instance, Schlenker 2009 for discussion).\nIt is not obvious what kind of pragmatic rule could account for the\nlack of a presupposition in\n (16).\n\n(16) Either\nJohn is not late or Mary does not know that he is late. \n\n\nExamples like\n (16)\n call into question the value of an incremental interpretation schema\nlike\n (15).\n On top of that,\n (15)\n is rather presumptuous in its assumptions of how interpretation\nproceeds. Asserting a clause with propositional content \\(p\\) does\nnot automatically make it common knowledge that \\(p\\). Rather, such\nan assertion should be regarded as a proposal to make\n\\(p\\) common knowledge. Whether or not \\(p\\) becomes common\nground is dependent on the willingness of the other interlocutors to\naccept the proposition (for instance, by not objecting against the\nassertion). In other words,\n (15)\n seems ill-suited for capturing the pragmatics of (the dynamics of)\ninformation flow.\n\nA possible way out is to regard\n (15)\n not as a pragmatic rule, but rather as a semantic rule, couched in a\ndynamic notion of interpretation. This was most prominently proposed\nin Heim 1983b, following Karttunen 1973. Karttunen distinguishes\nglobal contexts, which are contexts relative to which the\ncurrent sentence is evaluated, from local contexts, which are\ncontexts relative to which the current clause (or potentially some\nsub-clausal entity) is interpreted. The idea now is that a rule like\n (15)\n can express the semantics of and. In\n (15),\n \\(C\\) is the global context. A crucial part of the semantics of\nconjunction is that the local context for \\(S\\)2 is the update of\nthe global context with \\(S\\)1. Thus, there is no presupposition in\n (14)\n simply because of the dynamic semantics of and. All\nwe need to account for the lack of presupposition in\n (16)\n is to come up with a semantics for disjunction in which the local\ncontext for the second disjunct has already been updated with the\nnegation of the first disjunct; see Krahmer and Muskens 1996 for such\nan account that also captures interactions between (double) negation\nand anaphora.\n\nTo make things more concrete let us assume that contexts are sets of\npossible worlds and that an update \\(C[S]\\) of \\(C\\) with a simple\nclause \\(S\\) is \\(C\\cap p\\), where \\(p\\) is the propositional\ncontent of \\(S\\): updating \\(C\\) with a clause outputs the\n\\(C\\) worlds in which the clause is true. The rules in\n (18)\n show a Heimian fragment of a dynamic interpretation of the main\npropositional operators in English.\n\n(17)\n\n\\({C}[{\\textrm{not } S1}] = {C}  \\backslash {C}[{S1}]\\)\n\n\\({C}[{S1 \\textrm{ and } S2}] = ({C}[{S1}])[{S2}]\\)\n\n\\({C}[{\\textrm{If }S1, \\textrm{ then } S2}] = ({C}[{\\textrm{not }S1}]) \\cup ({C}[{S1}])[{S2}]\\)\n\n\\({C}[{S1 \\textrm{ or } S2}] = {C}[{S1}] \\cup ({C}[{\\textrm{not }S1}])[{S2}]\\)\n\n\nSome question the explanatory value of such a dynamic interpretation\nin the sense that the framework fails to account for why there appear\nto be no natural language expressions that encode a minimal variation\nof\n (17),\n where the local context of the second disjunct \\(S\\)2 is \\(C[S1]\\)\ninstead of \\(C[\\textrm{not }S1]\\), or where the local context of\n\\(S\\)1 is based on an update with \\(S\\)2, or where there are no\nlocal contexts at all as in\n (18)\n (see, for instance, Soames 1989).\n\n(18)\n\n\\({C}[{S1 \\textrm{ or } S2}] = {C}[{S1}] \\cup {C}[{S2}]\\)\n\n\nIn light of such criticisms, there has been a recent resurgence of\nstatic approaches to presupposition projection, such as the pragmatic\napproaches of Schlenker (2008, 2009), Chemla (2008, Other Internet\nResources) and the semantic (trivalent) approaches of George (2008)\nand Fox (2008). As Rothschild points out though, there is a route to\nmaking a semantics along the lines of\n (17)\n explanatory. To do so, one has to show that permissible dynamic\ninterpretations of connectives share certain properties. As Rothschild\n(2011) shows, an\nexplanatory and empirically adequate dynamic treatment of\npresupposition is possible if we assume that context change potentials\nadhere to certain principles of definedness. Let us assume that\n\\(C[S]\\) (for a simple clause \\(S\\)) is only defined if and only if\nany presupposition of \\(S\\) is true in all the worlds in \\(C\\).\nThe rules in\n (17)\n determine the definedness conditions for complex statements. For\ninstance, according to\n (17)\n [not S] is only undefined in \\(C\\) if \\(S\\) is undefined in\n\\(C\\). Rothschild’s insight is that we can constrain dynamic\ninterpretation by constraining the resulting definedness\nconditions.\n3.2 Presuppositions and Dynamic Epistemic Logic\n\nEpistemic logic, the logic of knowledge, is a branch of modal logic\nwhere the modality “\\(i\\) knows that” is studied\n(compare the entries:\n epistemic logic,\n logic of belief revision). The dynamic turn in epistemic logic, which took place\naround 2000, introduced a focus on change of state, but now with\nstates taken to be representations of the knowledge of a set of\nagents.\n\nIf we fix a set of basic propositions \\(P\\) and a set of agents\n\\(I\\), then a knowledge state for \\(P\\) and \\(I\\) consists of\na set \\(W\\) of possible worlds, together with a valuation function\n\\(V\\) that assigns a subset of \\(P\\) to each \\(w\\) in\n\\(W\\) (if \\(w \\in W\\), then \\(V(w)\\) lists the basic propositions\nthat are true in \\(w)\\) and for each agent \\(i \\in I\\), a relation\n\\(R_i\\) stating the epistemic similarities for \\(i\\) (if \\(wR_i\nw'\\), this means that agent \\(i\\) cannot distinguish world \\(w\\)\nfrom world w\\('\\)). Epistemic models \\(M = (W, V, \\{R_i \\mid\ni \\in I\\})\\) are known as multimodal Kripke models. Pointed epistemic\nmodels are epistemic models with a designated world \\(w_0\\)\nrepresenting the actual world.\n\nWhat happens to a given epistemic state \\((M, w_0) = ((W, V, \\{ R_i\n\\mid i \\in I\\}), w_0)\\) if a public announcement \\(\\phi\\) is made?\nIntuitively, the world set \\(W\\) of \\(M\\) is restricted to those\nworlds \\(w \\in W\\) where \\(\\phi\\) holds, and the valuation function\n\\(V\\) and epistemic relations \\(R_i\\) are restricted accordingly.\nCall the new model \\(M\\mid\\phi\\). In case \\(\\phi\\) is true in \\(w_0\\),\nthe meaning of the public announcement \\(\\phi\\) can be viewed as a map\nfrom \\((M, w_0)\\) to \\((M\\mid\\phi , w_0)\\). In case \\(\\phi\\) is false\nin \\(w_0\\), no update is possible.\n\nVeltman’s update logic can be accommodated in public\nannouncement logic (compare the entry on\n common knowledge)\n by allowing public announcements of the form \\(\\Diamond \\phi\\), where\nthe modality is read as reachability under common knowledge. If an\n\\(S\\)5 knowledge state for a set of agents (compare the entry on\n epistemic logic)\n is updated with the public announcement \\(\\Diamond \\phi\\), then in\ncase \\(\\phi\\) is true somewhere in the model, the update changes\nnothing (for in this case \\(M\\mid\\Diamond \\phi\\) equals \\(M)\\), and\notherwise the update yields inconsistency (since public announcements\nare assumed to be true). This is in accordance with the update logic\ndefinition.\n\nThe logical toolbox for epistemic logic with communicative updates is\ncalled dynamic epistemic logic or DEL. DEL started out from the\nanalysis of the epistemic and doxastic effects of public announcements\n(Plaza 1989; Gerbrandy 1999). Public announcement is interesting\nbecause it creates common knowledge. There is a variety of other kinds\nof announcements—private announcements, group announcements,\nsecret sharing, lies, and so on—that also have well-defined\nepistemic effects. A general framework for a wide class of update\nactions was proposed in Baltag et al. 1999 and Baltag and Moss 2004. A\nfurther generalization to a complete logic of communication and\nchange, with enriched actions that allow changing the facts of the\nworld, is provided in Benthem et al. 2006. A textbook treatment of\ndynamic epistemic logic is given in Ditmarsch et al. 2006.\n\nWithin an epistemic logic setting, one may represent the communicative\nsituation of an utterance with presuppositions as follows. First, we\nneed to represent what a speaker assumes about what her audience knows\nor believes in a multi-agent belief (or knowledge) state, then we need\nto model the effect of the communicative action on the belief state. A\nsimple way to handle presupposing utterances in dynamic epistemic\nlogic is by modeling a presupposition \\(P\\) as a public\nannouncement “it is common knowledge that \\(P\\)”. In\ncases where it is indeed common knowledge that \\(P\\), an update\nwith this information changes nothing. In cases where \\(P\\) is not\ncommon knowledge, however, the utterance is false, and public\nannouncements of falsehoods yield an inconsistent knowledge state.\n3.3. Beyond presupposition\n\nDynamic semantics is particularly suitable to describe how different\ntypes of linguistic material affect different aspects of the\ninformation state. In particular, dynamic semantics allows one to\nefficiently model the difference between at-issue content,\ne.g., the content that is asserted by the utterance of a declarative\nsentence and non-at issue content, content that plays some\nsecondary role. For instance, the at-issue content of\n (19)\n is that John’s neighbor was arrested yesterday: it is the\nmessage the speaker intends to assert. The appositive who I have\nnever met is not at issue. One way to see this is that an\ninterlocutor can only respond to\n (19)\n with No! That’s not true! if s/he intends to challenge\nthe fact that the neighbor was arrested, not if s/he merely wishes to\nexpress their disbelief in the speaker’s claim of never having\nmet the neighbor.\n\n(19)\nJohn’s neighbour, who I have never met, was arrested yesterday.\n\n\n\nDynamic semantics is a suitable framework for analyzing what goes on\nwhen such sentences are interpreted, since it naturally allows the\nmodeling of separate streams of information. For instance, AnderBois\net al. 2015 provide an account of sentences like\n (19)\n where the matrix sentence updates a local set of possible worlds. The\nupdated set can be seen as a potential candidate for updating the\ncommon ground with. In contrast, the appositive directly updates the\ncommon ground. Rather than a proposed common ground update,\nit can be seen as an imposed update (see Nouwen 2007 for an\nalternative dynamic logic). The ideas of AnderBois et al. 2015 are\npartly inspired by similar ideas that were successfully applied in the\nrealm of evidentials; see in particular Murray 2014.\n4. Encoding Dynamics in Typed Logic\n\nCompositionality has always been an important concern in the use of\nlogical systems in natural language semantics (see the entry on\n compositionality).\n Through the use of higher order logics (see the entries on\n second-order and higher-order logics\n and\n Church’s type theory),\n a thoroughly compositional account of, e.g., the quantificational\nsystem of natural language can be achieved, as is demonstrated in\nclassical Montague grammar (Montague 1974a,b, 1973; compare the entry\non\n logical form).\n We will review how the dynamic approach can be extended to higher\norder systems. The link between dynamic semantics and type theory is\nmore like a liaison than a stable marriage: there is no intrinsic need\nfor the connection. The connection is treated here to explain the\nhistorical influence of Montague grammar on dynamic semantics.\n\nMost proposals for dynamic versions of Montague grammar develop what\nare in fact higher order versions of dynamic predicate logic (DPL).\nThis holds for Groenendijk and Stokhof 1990; Chierchia 1992, 1995;\nMuskens 1994, 1995, 1996; Eijck 1997; Eijck and Kamp 1997; Kohlhase et\nal. 1996; and Kuschert 2000. These systems all inherit a feature (or\nbug) from the DPL approach: they make re-assignment destructive. DRT\ndoes not suffer from this problem: the discourse representation\nconstruction algorithms of Kamp 1981 and Kamp and Reyle 1993 are\nstated in terms of functions with finite domains, and carefully talk\nabout “taking a fresh discourse referent” to extend the\ndomain of a verifying function, for each new noun phrase to be\nprocessed.\n\nIn extensional Montague grammar “a man” translates as:\n \n\n\\[\\lambda P\\exists x(\\textrm{man } x \\wedge Px).\\]\n\n\nHere \\(P\\), of type \\(e \\rightarrow t\\), is the variable for the VP\nslot: it is assumed that VPs denote sets of entities. \n\nIn Dynamic Montague Grammar (DMG) of Groenendijk and Stokhof 1990, the\ntranslation of an indefinite NP introduces an anaphoric index. The\ntranslation of “a man” is  \n\n\\[\\lambda P\\lambda a\\lambda a' \\cdot \\exists x(\\textrm{man }x \\wedge Pu_i (u_i \\mid x) aa').\\]\n\n\nInstead of the basic types e and t of classical extensional Montague\ngrammar, DMG has basic types \\(e, t\\) and \\(m (m\\) for marker). States\npick out entities for markers, so they can be viewed as objects of\ntype \\(m \\rightarrow e\\). Abbreviating \\(m \\rightarrow e\\) as \\(s\\)\n(for “state”), we call objects of type \\(s \\rightarrow s\n\\rightarrow t\\) state transitions. The variable \\(P\\) in the DMG\ntranslation of “a man” has type \\(m \\rightarrow s\n\\rightarrow s \\rightarrow t\\), so VP meanings have been lifted from\ntype \\(e \\rightarrow t\\) to this type. Note that \\(\\rightarrow\\)\nassociates to the right, so \\(m \\rightarrow s \\rightarrow s\n\\rightarrow t\\) is shorthand for \\(m \\rightarrow(s \\rightarrow(s\n\\rightarrow t))\\). Indeed, DMG can be viewed as the result of\nsystematic replacement of entities by markers and of truth values by\nstate transitions. A VP meaning for “is happy” is a\nfunction that maps a marker to a state transition. The state\ntransition for marker \\(u_i\\) will check whether the input state maps\n\\(u_i\\) to a happy entity, and whether the output context equals the\ninput context. The variables \\(a\\), a\\('\\) range over\nstates, and the expression \\((u_i \\mid x)a\\) denotes the result of\nresetting the value of \\(u_i\\) in \\(a\\) to \\(x\\), so the old\nvalue of \\(u_i\\) gets destroyed (destructive assignment). The\nanaphoric index \\(i\\) on reference marker \\(u_i\\) is introduced by\nthe translation. In fact, the translation starts from the indexed\nindefinite noun phrase “a man\\(_i\\)”. The connection\nbetween Montagovian compositionality and dynamic semantics as well as\nthe basic Montagovian and dynamic ingredients are much more\ntransparent and streamlined in the typed Logic of Change proposed in\nMuskens 1991, 1995, 1996. Because of this, Muskens’s\nCompositional DRT is probably the de facto standard and\nstarting point for current research in compositional dynamic\nsemantics. An alternative treatment is given in Incremental Typed\nLogic (ITL), an extension to typed logic of a “stack\nsemantics” that is based on variable free indexing and that\navoids the destructive assignment problem. The basic idea of the stack\nsemantics for DPL, developed in Vermeulen 1993, is to replace the\ndestructive assignment of ordinary DPL, which throws away old values\nwhen resetting, by a stack-valued one that allows old values to be\nreused. Stack-valued assignments assign to each variable a stack of\nvalues, the top of the stack being the current value. Existential\nquantification pushes a new value on the stack, but there is also the\npossibility of popping the stack to reuse a previously assigned value.\nEijck’s 2000 ITL is in fact a typed version of stack semantics,\nusing a single stack.\n\nAssuming a domain of entities, contexts are finite lists of entities.\nIf \\(c\\) is a context of length \\(n\\), then we refer to its\nelements as \\(c[0]\\), \\(\\ldots ,c[n-1]\\), and to its length as\n\\(\\lvert c\\rvert\\). We will refer to the type of contexts of length\n\\(i\\) as \\([e]^i\\). If \\(c\\) is a context in \\([e]^i\\), then\nobjects of type \\(\\{0, \\ldots ,i-1\\}\\) can serve as indices into\n\\(c\\). If \\(c \\in[e]^i\\) and \\(j \\in \\{0, \\ldots ,i-1\\}\\), then\n\\(c[j]\\) is the object of type e that occurs at position \\(j\\) in\nthe context. A key operation on contexts is extension with an element.\nIf \\(c :: [e]^i\\) and \\(x :: e\\) (\\(c\\) is a context of length\n\\(i\\) and \\(x\\) is an entity) then \\(c\\mcaret x\\) is the context\nof length \\(i+1\\) that has elements \\(c\\)[0], \\(\\ldots ,c[i-1],\nx\\). Thus \\(\\mcaret\\) is an operator of type \\([e]^i \\rightarrow e\n\\rightarrow[e]^{i+1}\\). Also note that types like \\([e]^i\\) are in\nfact polymorphic types, with \\(i\\) acting as a type variable. See\nMilner 1978.\n\nIn ITL there is no destructive assignment, and indefinite noun phrases\ndo not carry indexes in the syntax. The ITL translation of “a\nman” picks up an index from context, as follows: \n\n\\[\\lambda P\\lambda c\\lambda c' \\cdot \\exists x (\\textrm{man } x \\mcaret P\\lvert c\\rvert  (c^x)c').\\]\n\n\nHere \\(P\\) is a variable of type \\(\\{0, \\ldots ,i\\}\n\\rightarrow[e]^{i+1} \\rightarrow [e]^j \\rightarrow t\\), while \\(c\\)\nis a variable of type [\\(e]^i\\) representing the input context of\nlength \\(i\\), and \\(c'\\) is a variable of type [\\(e]^j\\)\nrepresenting the output context. Note that the type \\(\\{0, \\ldots ,i\\}\n\\rightarrow [e]^{i+1} \\rightarrow [e]^j \\rightarrow t\\) for \\(P\\)\nindicates that \\(P\\) first takes an index in the range \\(\\{0,\n\\ldots ,i\\}\\), next a context fitting this range (a context of length\n\\(i+1)\\), next a context of a yet unknown length, and then gives a\ntruth value. \\(P\\) is the type of unary predicates, lifted to the\nlevel of context changers, as follows. Instead of using a variable to\nrange over objects to form an expression of type \\(e\\), a lifted\npredicate uses a variable ranging over the size of an input context to\nform an expression that denotes a changer for that context. \n\nThe ITL translation of “a man” has type \n\n\\[(\\{0, \\ldots ,i\\} \\rightarrow[e]^{i+1} \\rightarrow [e]^j \\rightarrow t) \\rightarrow [e]^i \\rightarrow [e]^j \\rightarrow t.\\] \n\n In\n\\(P\\lvert c\\rvert (c\\mcaret x)c'\\), the \\(P\\) variable marks the\nslot for the VP interpretation; \\(\\lvert c\\rvert\\) gives the length of\nthe input context to \\(P\\); it picks up the value \\(i\\), which\nis the position of the next available slot when the context is\nextended. This slot is filled by an object \\(x\\) denoting a man.\nNote that \\(c\\mcaret x[\\lvert c\\rvert ] = c\\mcaret x[i] = x\\), so the\nindex \\(i\\) serves to pick out that man from the context.\n\nTo see that a dynamic higher order system is expressible in ITL, it is\nenough to show how to define the appropriate dynamic operations.\nAssume \\(\\phi\\) and \\(\\psi\\) have the type of context transitions,\ni.e. type [\\(e] \\rightarrow[e] \\rightarrow t\\) (using [\\(e\\)] for\narbitrary contexts), and that \\(c, c', c''\\) have type [\\(e\\)].\nThen we can define the dynamic existential quantifier, dynamic\nnegation and dynamic composition as follows:  \n\n\\[\n\\begin{align*}\n\\cal{E}    & :=    \\lambda cc'\\cdot \\exists x(c \\mcaret x = c')  \\\\\n  {\\sim}\\phi     & :=   \\lambda cc'\\cdot (c = c' \\mcaret \\neg \\exists c'' \\phi cc'')  \\\\\n\\phi ; \\psi &  :=    \\lambda cc'\\cdot \\exists c''(\\phi cc'' \\mcaret \\psi cc')\n\\end{align*}\n\\]\n\n\nDynamic implication \\(\\Rightarrow\\) is defined in the usual way by\nmeans of \\({\\sim}(\\phi; {\\sim}\\psi)\\).\n\nITL and Muskens style Compositional DRT are not incompatible; see\nBittner 2014 for example. We will end this section by noting that the\nrange of systems integrating Montagovian compositionality and dynamic\nsemantics is far from being completely charted. A recent series of\ncontributions integrating continuation-based and dynamic semantics is\nexploring new ways of integrating and generalizing them; see de Groote\n2006, Bumford and Barker 2013, Charlow 2014, Bumford 2015, and Martin\n2016.\n5. Conclusion\n\nHopefully, the above has given the reader a sense of Dynamic Semantics\nas a fruitful and flexible approach to meaning and information\nprocessing. Dynamic semantics comes with a set of flexible tools, and\nwith a collection of “killer applications”, such as the\ncompositional treatment of donkey sentences, the account of anaphoric\nlinking, the account of presupposition projection, the account of\nepistemic updating and fine-grained distinctions between different\nkinds of (non-at-issue) updates. Dynamic semantics is a very lively\nsubfield of formal semantics and the cross-linguistic range of\nphenomena for which dynamic approaches are being pursued is expanding\nat an increasing pace.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "AnderBois, Scott, Adrian Brasoveanu, and Robert Henderson, 2015,\n“At-issue Proposals and Appositive Impositions in\nDiscourse”, <em>Journal of Semantics</em>, 32: 93–138.\ndoi:10.1093/jos/fft014",
                "Aloni, Maria, 1997, “Quantification in Dynamic\nSemantics”, in <em>Proceedings of the Eleventh Amsterdam\nColloquium</em>, P. Dekker (ed.), 73–78.",
                "Baltag, Alexandru and Lawrence S. Moss, 2004, “Logics for\nEpistemic Programs”, <em>Synthese</em>, 139(2): 165–224.\ndoi:10.1023/B:SYNT.0000024912.56773.5e ",
                "Baltag, Alexandru, Lawrence S. Moss, and Slawomir Solecki, 1999,\n“The Logic of Public Announcements, Common Knowledge, and\nPrivate Suspicions”, Technical Report SEN-R9922, CWI, Amsterdam.\n [<a href=\"http://www.cs.indiana.edu/cgi-bin/techreports/TRNNN.cgi?trnum=TR534\" target=\"other\">Baltag et al. 1999 available online</a>]",
                "Barker, Chris, 2002, “The Dynamics of\nVagueness”, <em>Linguistics and Philosophy</em>, 25(1):\n1–36.",
                "Barker, Chris and Chung-chieh Shan, 2008, “Donkey Anaphora\nis In-scope Binding”, <em>Semantics and Pragmatics</em>, 1:\n1–46. doi:10.3765/sp.1.1",
                "Beaver, David, 1997, “Presupposition”, in van Benthem\nand ter Meulen 1997: 939–1008.",
                "–––, 2001, <em>Presupposition and Assertion in\nDynamic Semantics</em>, Stanford: CSLI Publications.",
                "Benthem, Johan van, 1989, “Semantic Parallels in Natural\nLanguage and Computation”, in <em>Logic Colloquium, Granada,\n1987</em>, Heinz-Dieter Ebbinghaus et al. (eds.), Amsterdam: Elsevier,\n331–375.",
                "–––, 1996, <em>Exploring Logical Dynamics</em>,\nStanford: CSLI &amp; Folli.",
                "Benthem, Johan van and Alice ter Meulen (eds.), 1997, <em>Handbook\nof Logic and Language</em>, Amsterdam: Elsevier.",
                "Benthem, Johan van, Jan van Eijck, and Barteld Kooi, 2006,\n“Logics of Communication and Change”, <em>Information and\nComputation</em>, 204(11): 1620–1662.\ndoi:10.1016/j.ic.2006.04.006",
                "van den Berg, Martin H., 1996, <em>The Internal Structure of\nDiscourse</em>, Ph.D. Thesis, ILLC Dissertation Series 1996–3,\nAmsterdam: ILLC Publications.",
                "Bittner, Maria, 2014, <em>Temporality: Universals and\nVariation</em>, Hoboken, NJ: Wiley-Blackwell.",
                "Brasoveanu, Adrian, 2007, <em>Structured Nominal and Modal\nreference</em>, Ph.D. Thesis, Rutgers University.",
                "–––, 2008, “Donkey Pluralities: Plural\nInformation States Versus Non-Atomic Individuals”,\n<em>Linguistics and Philosophy</em>, 31 (2): 129–209.\ndoi:10.1007/s10988-008-9035-0",
                "–––, 2013, “The Grammar of Quantification\nand the Fine Structure of Interpretation Contexts”,\n<em>Synthese</em>, 190(15): 3001–3051.\ndoi:10.1007/s11229-012-0118-7",
                "Bumford, Dylan, 2015, “Incremental Quantification and the\nDynamics of Pair-list Phenomena”, <em>Semantics and\nPragmatics</em>, 8(9): 1–70. doi:10.3765/sp.8.9",
                " Bumford, Dylan and Chris Barker, 2013, “Association with\nDistributivity and the Problem of Multiple Antecedents for Singular\nDifferent”, in <em>Linguistics and Philosophy</em>, 36(5):\n355–369. doi:10.1007/s10988-013-9139-z",
                "Charlow, Simon, 2014, <em>On the Semantics of Exceptional\nScope</em>, Ph.D. Thesis, New York University.",
                "Chierchia, Gennaro, 1992, “Anaphora and Dynamic\nBinding”, <em>Linguistics and Philosophy</em>, 15(2):\n111–183.\n [<a href=\"http://scholar.harvard.edu/chierchia/publications/anaphora-and-dynamic-binding\" target=\"other\">Chierchia 1992 available online</a>]",
                "–––, 1995, <em>Dynamics of Meaning: Anaphora,\nPresupposition, and the Theory of Grammar</em>, Chicago: University of\nChicago Press.",
                "Dekker, Paul Jacques Edgar, 1993, <em>Transsentential Meditations,\nups and downs in dynamic semantics</em>, Ph.D. Thesis, University of\nAmsterdam, ILLC.\n [<a href=\"http://hdl.handle.net/11245/1.392554\" target=\"other\">Dekker 1993 available online</a>]",
                "Ditmarsch, Hans van, Wiebe van der Hoek, and Barteld Kooi, 2006,\n<em>Dynamic Epistemic Logic</em> (Synthese Library: Volume 337),\nDordrecht: Springer.",
                "Eijck, Jan van, 1994, “Presupposition Failure—a Comedy\nof Errors”, <em>Formal Aspects of Computing</em>, 6(supplement\n1): 766–787. doi:10.1007/BF01213602",
                "–––, 1997, “Typed Logics with\nStates”, <em>Logic Journal of the IGPL</em>, 5(5):\n623–645. doi:10.1093/jigpal/5.5.623",
                "–––, 2000, “On the Proper Treatment of\nContext in NL”, in <em>Computational Linguistics in the\nNetherlands 1999; Selected Papers from the Tenth CLIN Meeting</em>,\nPaola Monachesi (ed.), Utrecht Institute of Linguistics OTS,\n41–51.",
                "Eijck, Jan van and Fer-Jan de Vries, 1992, “Dynamic\nInterpretation and Hoare Deduction”, <em>Journal of Logic,\nLanguage, and Information</em>, (1)1: 1–44.\ndoi:10.1007/BF00203385",
                "Eijck, Jan van and Hans Kamp, 1997, “Representing Discourse\nin Context”, in van Benthem and ter Meulen 1997:\n179–237.",
                "Elbourne, Paul, 2001, “E-Type Anaphora as\nNP-Deletion”, <em>Natural Language Semantics</em>, 9(3):\n241–288. doi:10.1023/A:1014290323028",
                "–––, 2005, <em>Situations and Individuals</em>,\nCambridge, MA: MIT Press.",
                "Evans, Gareth, 1977, “Pronouns, Quantifiers and Relative\nClauses (I)”, <em>Canadian Journal of Philosophy</em>, 7(3):\n467–536.",
                "–––, 1980, “Pronouns”,\n<em>Linguistic Inquiry</em>, 11(2): 337–362.",
                "Fox, Danny, 2008, “Two Short Notes on Schlenker’s theory\nof Presupposition Projection”, <em>Theoretical Linguistics</em>,\n34(3): 237–252. doi:10.1515/THLI.2008.016",
                "Geach, Peter Thomas, 1962 [1980], <em>Reference and Generality: An\nExamination of Some Medieval and Modern Theories</em>, Ithaca, NY:\nCornell University Press. Third revised edition: 1980. ",
                "George, Benjamin Ross, 2008, <em>Presupposition Repairs: a Static,\nTrivalent Approach to Predicting Projection</em>, M.A. Thesis,\nUCLA.",
                "Gerbrandy, Jelle, 1999, “Dynamic Epistemic Logic”, in\n<em>Logic, Language and Computation, Vol. 2</em>, Lawrence S. Moss,\nJonathan Ginzburg, and Maarten de Rijke (eds.), Stanford: CSLI\nPublications.",
                "Groenendijk, Jeroen and Martin Stokhof, 1990, “Dynamic\nMontague Grammar”, in <em>Papers from the Second Symposium on\nLogic and Language</em>, L. Kalman and L. Polos (eds.), Budapest:\nAkademiai Kiadoo, 3–48.",
                "–––, 1991a, “Dynamic Predicate\nlogic”, <em>Linguistics and Philosophy</em>, 14(1):\n39–100. doi:10.1007/BF00628304",
                "–––, 1991b, “Two Theories of Dynamic\nSemantics”, in <em>JELIA ‘90, European Workshop on Logics\nin AI</em> (Lecture Notes in Computer Science: Volume 478), Jan van\nEijck (ed.), Berlin: Springer, 55–64.\ndoi:10.1007/BFb0018433",
                "Groenendijk, Jeroen, Martin Stokhof, and Frank Veltman, 1996,\n“Coreference and Modality”, in <em>Handbook of\nContemporary Semantic Theory</em>, Shalom Lappin (ed.), Oxford:\nBlackwell, 179–213.",
                "Groeneveld, Willem, 1995, <em>Logical Investigations into Dynamic\nSemantics</em>, Ph.D. Thesis, University of Amsterdam.",
                "de Groote, Philippe, 2006, “Towards a Montagovian Account of\nDynamics”, in <em>Proceedings of Semantics and Linguistic Theory\n(SALT) 16</em>, Masayuki Gibson and Jonathan Howell (eds.), 1–16.\ndoi:10.3765/salt.v16i0.2952",
                "Heim, Irene, 1983a, “File Change Semantics and the\nFamiliarity Theory of Definiteness”, in <em>Meaning, Use and\nInterpretation of Language</em>, Rainer Bäuerle, Christoph\nSchwarze, and Arnim von Stechow (eds.), Berlin: De Gruyter,\n164–189.",
                "–––, 1983b, “On the Projection Problem for\nPresuppositions”, <em>Proceedings of the Second West Coast\nConference on Formal Linguistics</em>, Michael Barlow, Dan P.\nFlickinger and MIchael T. Wescoat (eds.), Stanford, CA: Stanford\nUniversity Department of Lingustics, 114–126.",
                "–––, 1990, “E-Type Pronouns and Donkey\nAnaphora”, <em>Linguistics and Philosophy</em>, 13(2):\n137–138.",
                "Hollenberg, Marco and Kees Vermeulen, 1996, “Counting\nVariables in a Dynamic Setting”, <em>Journal of Logic and\nComputation</em>, 6(5): 725–744. doi:10.1093/logcom/6.5.725",
                "Kamp, Hans, 1981, “A Theory of Truth and Semantic\nRepresentation”, in <em>Formal Methods in the Study of\nLanguage</em>, Jeroen Groenendijk, Theo Janssen, and Martin Stokhof\n(eds.), Amsterdam: Mathematisch Centrum, 277–322.",
                "Kamp, Hans and Uwe Reyle, 1993, <em>From Discourse to Logic</em>,\nDordrecht: Kluwer.",
                "Karttunen, Lauri, 1973, “Presuppositions of Compound\nSentences”, <em>Linguistic Inquiry</em>, 4(2):\n169–193.",
                "–––, 1974, “Presupposition and Linguistic\nContext”, <em>Theoretical Linguistics</em>, 1:\n181–194.",
                "Kohlhase, Michael, Susanna Kuschert, and Manfred Pinkal, 1996,\n“A Type-Theoretic Semantics for \\(\\lambda\\)-DRT”, in\n<em>Proceedings of the Tenth Amsterdam Colloquium</em>, Paul Dekker\nand Martin Stokhof (eds.), Amsterdam: ILLC Publications.",
                "Krahmer, Emiel, 1995, <em>Discourse and Presupposition</em>, Ph.D.\nThesis, Tilburg University; revised and published under the\ntitle <em>Presupposition and Anaphora</em>, Stanford: CSLI\nPublications, 1998.",
                "Krahmer, Emiel and Reinhard Muskens, 1996, “Negation and\nDisjunction in Discourse Representation Theory” <em>Journal of\nSemantics</em>, 12: 357–376. doi: 10.1093/jos/12.4.357",
                "Krifka, Manfred, 1996, “Parametrized Sum Individuals for\nPlural Reference and Partitive Quantification” <em>Linguistics\nand Philosophy</em>, 19: 555–598.\n [<a href=\"http://amor.cms.hu-berlin.de/~h2816i3x/Publications/Krifka%201996%20Plural%20Anaphora.PDF\" target=\"other\">Krifka 1996 available online (pdf)</a>]",
                "Kuschert, Susanna, 2000, <em>Dynamic Meaning and\nAccommodation</em>, Ph.D. Thesis, Universität des Saarlandes.",
                "Martin, Scott, 2016, “Supplemental Update”,\n<em>Semantics and Pragmatics</em>, 9(5). doi:10.3765/sp.9.5",
                "Milner, Robin, 1978, “A Theory of Type Polymorphism in\nProgramming”, <em>Journal of Computer and System Sciences</em>,\n17: 348–375.",
                "Montague, Richard, 1973, “The Proper Treatment of\nQuantification in Ordinary English”, in <em>Approaches to\nNatural Language</em>, Jaakko Hintikka, Julius Moravcsik, and Patrick\nSuppes (eds.), Dordrecht: Reidel, 221–242.",
                "–––, 1974a, “English as a Formal\nLanguage”, in Montague 1974c: 188–221.",
                "–––, 1974b, “Universal Grammar”, in\nMontague 1974c: 222–246.",
                "–––, 1974c, <em>Formal Philosophy; Selected\nPapers of Richard Montague</em>, R.H. Thomason (ed.), New Haven and\nLondon: Yale University Press.",
                "Murray, Sarah E., 2014, “Varieties of Update”,\n<em>Semantics and Pragmatics</em>, 7: 1–53.\ndoi:10.3765/sp.7.2",
                "Muskens, Reinhard, 1991, “Anaphora and the Logic of\nChange”, in <em>JELIA ‘90, European Workshop on Logics in\nAI</em> (Lecture Notes in Computer Science: Volume 478), Jan van Eijck\n(ed.), Berlin and New York, 414–430.\ndoi:10.1007/BFb0018456",
                "–––, 1994, “A Compositional Discourse\nRepresentation Theory”, in <em>Proceedings 9<sup>th</sup>\nAmsterdam Colloquium</em>, Paul Dekker and Martin Stokhof (eds.),\nAmsterdam: ILLC Publications, 467–486.",
                "–––, 1995, “Tense and the Logic of\nChange”, in <em>Lexical Knowledge in the Organization of\nLanguage</em>, U. Egli et al. (ed.), Amsterdam: John Benjamins,\n147–183.",
                "–––, 1996, “Combining Montague Semantics\nand Discourse Representation”, <em>Linguistics and\nPhilosophy</em>, 19: 143–186.",
                "Muskens, Reinhard, Johan van Benthem, and Albert Visser, 1997,\n“Dynamics”, in van Benthem and ter Meulen 1997:\n587–648.",
                "Nouwen, Rick, 2003, “Complement Anaphora and\nInterpretation”, <em>Journal of Semantics</em>, 20: \n73–113.",
                "–––, 2007, “On Dependent Pronouns and\nDynamic Semantics”, <em>Journal of Philosophical Logic</em>,\n36(2): 123–154.",
                "–––, forthcoming, “E-type Pronouns:\nCongressmen, Sheep and Paychecks”, in L. Matthewson, C. Meier,\nH. Rullmann, and T.E. Zimmerman (eds.),\n<em>The Blackwell Companion to Semantics</em>, Oxford: Wiley.",
                "Plaza, Jan A., 1989, “Logics of Public\nCommunications”, in <em>Proceedings of the 4<sup>th</sup>\nInternational Symposium on Methodologies for Intelligent Systems</em>,\nM.L. Emrich, M.S. Pfeifer, M. Hadzikadic, and Z.W. Ras (eds.),\nAmsterdam: North Holland, 201–216.",
                "Putnam, Hilary, 1975, “The Meaning of\n‘Meaning’”, in <em>Philosophical Papers</em> (Volume\n2), Cambridge: Cambridge University Press.",
                "Quine, Willard van Orman, 1960, <em>Word and Object</em>,\nCambridge, MA: MIT Press.",
                "Roberts, Craige, 1987, <em>Modal Subordination, Anaphora and\nDistributivity</em>, Ph.D. Thesis, University of\nMassachusetts/Amherst; New York: Garland, 1990.",
                "–––, 1989, “Modal Subordination and\nPronominal Anaphora in Discourse”, <em>Linguistics and\nPhilosophy</em>, 12: 683–721.",
                "Rothschild, Daniel, 2011, “Explaining Presupposition\nProjection with Dynamic Semantics”, <em>Semantics and\nPragmatics</em>, 4(3): 1“43.",
                "Sandt, Rob A. van der, 1992, “Presupposition Projection as\nAnaphora Resolution”, <em>Journal of Semantics</em> (Special\nIssue: Presupposition, Part 2), 9: 333–377.\ndoi:10.1093/jos/9.4.333",
                "Schlenker, Philippe, 2007, “Anti-dynamics: Presupposition\nProjection without Dynamic Semantics”, <em>Journal of Logic,\nLanguage and Information</em>, 16(3): 325–356.",
                "–––, 2008, “Be Articulate: A Pragmatic\nTheory of Presupposition Projection”, <em>Theoretical\nLinguistics</em>, 34(3): 157–212.",
                "–––, 2009, “Local Contexts”,\n<em>Semantics and Pragmatics</em>, 2(3): 1–78.",
                "Seuren, Pieter, 1985, <em>Discourse Semantics</em>, Oxford:\nBlackwell.",
                "Soames, Scott, 1989, “Presuppositions”, in Dov M.\nGabbay &amp; Franz Guenther (eds.), <em>Handbook of Philosophical\nLogic</em>, vol. IV, 553–616. Dordrecht.\ndoi:10.1007/978-94-009-1171-0_9",
                "Stalnaker, Robert C., 1972, “Pragmatics”, in\n<em>Semantics of Natural Language</em>, Donald Davidson and Gilbert\nHarman (eds.), Dordrecht: Reidel, 380–397.\ndoi:10.1007/978-94-010-2557-7_11",
                "–––, 1973,\n“Presuppositions”, <em>Journal of Philosophical\nLogic</em>, 2: 447–457.",
                "–––, 1974, “Pragmatic\nPresuppositions”, in <em>Semantics and Philosophy</em>, Milton\nK. Munitz and Peter K. Unger (eds.), New York: New York University\nPress, 197–213.",
                "Veltman, Frank, 1991, “Defaults in Update Semantics”,\nin <em>Conditionals, Defaults and Belief Revision</em>, Hans Kamp\n(ed.), Edinburgh: Dyana Deliverable R2.5A.",
                "–––, 1996, “Defaults in Update\nSemantics”, <em>Journal of Philosophical Logic</em>, 25:\n221–261.",
                "Vermeulen, C.F.M., 1993, “Sequence Semantics for Dynamic\nPredicate Logic”, <em>Journal of Logic, Language and\nInformation</em>, 2: 217–254. doi:10.1007/BF01050788",
                "–––, 1994, <em>Explorations of the Dynamic\nEnvironment</em>, Ph.D. thesis, Utrecht University.",
                "–––, 1995, “Merging without Mystery,\nVariables in Dynamic Semantics”, <em>Journal of Philosophical\nLogic</em>, 24: 405–450.",
                "Werth, Paul, 2000, <em>Text Worlds: Representing Conceptual Space\nin Discourse</em>, London: Pearson Education/Longman.",
                "Zeevat, Hank, 1989, “A Compositional Approach to Discourse\nRepresentation Theory”, <em>Linguistics and Philosophy</em>,\n12(1): 95–131. doi:10.1007/BF00627399"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>AnderBois, Scott, Adrian Brasoveanu, and Robert Henderson, 2015,\n“At-issue Proposals and Appositive Impositions in\nDiscourse”, <em>Journal of Semantics</em>, 32: 93–138.\ndoi:10.1093/jos/fft014</li>\n<li>Aloni, Maria, 1997, “Quantification in Dynamic\nSemantics”, in <em>Proceedings of the Eleventh Amsterdam\nColloquium</em>, P. Dekker (ed.), 73–78.</li>\n<li>Baltag, Alexandru and Lawrence S. Moss, 2004, “Logics for\nEpistemic Programs”, <em>Synthese</em>, 139(2): 165–224.\ndoi:10.1023/B:SYNT.0000024912.56773.5e </li>\n<li>Baltag, Alexandru, Lawrence S. Moss, and Slawomir Solecki, 1999,\n“The Logic of Public Announcements, Common Knowledge, and\nPrivate Suspicions”, Technical Report SEN-R9922, CWI, Amsterdam.\n [<a href=\"http://www.cs.indiana.edu/cgi-bin/techreports/TRNNN.cgi?trnum=TR534\" target=\"other\">Baltag et al. 1999 available online</a>]</li>\n<li>Barker, Chris, 2002, “The Dynamics of\nVagueness”, <em>Linguistics and Philosophy</em>, 25(1):\n1–36.</li>\n<li>Barker, Chris and Chung-chieh Shan, 2008, “Donkey Anaphora\nis In-scope Binding”, <em>Semantics and Pragmatics</em>, 1:\n1–46. doi:10.3765/sp.1.1</li>\n<li>Beaver, David, 1997, “Presupposition”, in van Benthem\nand ter Meulen 1997: 939–1008.</li>\n<li>–––, 2001, <em>Presupposition and Assertion in\nDynamic Semantics</em>, Stanford: CSLI Publications.</li>\n<li>Benthem, Johan van, 1989, “Semantic Parallels in Natural\nLanguage and Computation”, in <em>Logic Colloquium, Granada,\n1987</em>, Heinz-Dieter Ebbinghaus et al. (eds.), Amsterdam: Elsevier,\n331–375.</li>\n<li>–––, 1996, <em>Exploring Logical Dynamics</em>,\nStanford: CSLI &amp; Folli.</li>\n<li>Benthem, Johan van and Alice ter Meulen (eds.), 1997, <em>Handbook\nof Logic and Language</em>, Amsterdam: Elsevier.</li>\n<li>Benthem, Johan van, Jan van Eijck, and Barteld Kooi, 2006,\n“Logics of Communication and Change”, <em>Information and\nComputation</em>, 204(11): 1620–1662.\ndoi:10.1016/j.ic.2006.04.006</li>\n<li>van den Berg, Martin H., 1996, <em>The Internal Structure of\nDiscourse</em>, Ph.D. Thesis, ILLC Dissertation Series 1996–3,\nAmsterdam: ILLC Publications.</li>\n<li>Bittner, Maria, 2014, <em>Temporality: Universals and\nVariation</em>, Hoboken, NJ: Wiley-Blackwell.</li>\n<li>Brasoveanu, Adrian, 2007, <em>Structured Nominal and Modal\nreference</em>, Ph.D. Thesis, Rutgers University.</li>\n<li>–––, 2008, “Donkey Pluralities: Plural\nInformation States Versus Non-Atomic Individuals”,\n<em>Linguistics and Philosophy</em>, 31 (2): 129–209.\ndoi:10.1007/s10988-008-9035-0</li>\n<li>–––, 2013, “The Grammar of Quantification\nand the Fine Structure of Interpretation Contexts”,\n<em>Synthese</em>, 190(15): 3001–3051.\ndoi:10.1007/s11229-012-0118-7</li>\n<li>Bumford, Dylan, 2015, “Incremental Quantification and the\nDynamics of Pair-list Phenomena”, <em>Semantics and\nPragmatics</em>, 8(9): 1–70. doi:10.3765/sp.8.9</li>\n<li> Bumford, Dylan and Chris Barker, 2013, “Association with\nDistributivity and the Problem of Multiple Antecedents for Singular\nDifferent”, in <em>Linguistics and Philosophy</em>, 36(5):\n355–369. doi:10.1007/s10988-013-9139-z</li>\n<li>Charlow, Simon, 2014, <em>On the Semantics of Exceptional\nScope</em>, Ph.D. Thesis, New York University.</li>\n<li>Chierchia, Gennaro, 1992, “Anaphora and Dynamic\nBinding”, <em>Linguistics and Philosophy</em>, 15(2):\n111–183.\n [<a href=\"http://scholar.harvard.edu/chierchia/publications/anaphora-and-dynamic-binding\" target=\"other\">Chierchia 1992 available online</a>]</li>\n<li>–––, 1995, <em>Dynamics of Meaning: Anaphora,\nPresupposition, and the Theory of Grammar</em>, Chicago: University of\nChicago Press.</li>\n<li>Dekker, Paul Jacques Edgar, 1993, <em>Transsentential Meditations,\nups and downs in dynamic semantics</em>, Ph.D. Thesis, University of\nAmsterdam, ILLC.\n [<a href=\"http://hdl.handle.net/11245/1.392554\" target=\"other\">Dekker 1993 available online</a>]</li>\n<li>Ditmarsch, Hans van, Wiebe van der Hoek, and Barteld Kooi, 2006,\n<em>Dynamic Epistemic Logic</em> (Synthese Library: Volume 337),\nDordrecht: Springer.</li>\n<li>Eijck, Jan van, 1994, “Presupposition Failure—a Comedy\nof Errors”, <em>Formal Aspects of Computing</em>, 6(supplement\n1): 766–787. doi:10.1007/BF01213602</li>\n<li>–––, 1997, “Typed Logics with\nStates”, <em>Logic Journal of the IGPL</em>, 5(5):\n623–645. doi:10.1093/jigpal/5.5.623</li>\n<li>–––, 2000, “On the Proper Treatment of\nContext in NL”, in <em>Computational Linguistics in the\nNetherlands 1999; Selected Papers from the Tenth CLIN Meeting</em>,\nPaola Monachesi (ed.), Utrecht Institute of Linguistics OTS,\n41–51.</li>\n<li>Eijck, Jan van and Fer-Jan de Vries, 1992, “Dynamic\nInterpretation and Hoare Deduction”, <em>Journal of Logic,\nLanguage, and Information</em>, (1)1: 1–44.\ndoi:10.1007/BF00203385</li>\n<li>Eijck, Jan van and Hans Kamp, 1997, “Representing Discourse\nin Context”, in van Benthem and ter Meulen 1997:\n179–237.</li>\n<li>Elbourne, Paul, 2001, “E-Type Anaphora as\nNP-Deletion”, <em>Natural Language Semantics</em>, 9(3):\n241–288. doi:10.1023/A:1014290323028</li>\n<li>–––, 2005, <em>Situations and Individuals</em>,\nCambridge, MA: MIT Press.</li>\n<li>Evans, Gareth, 1977, “Pronouns, Quantifiers and Relative\nClauses (I)”, <em>Canadian Journal of Philosophy</em>, 7(3):\n467–536.</li>\n<li>–––, 1980, “Pronouns”,\n<em>Linguistic Inquiry</em>, 11(2): 337–362.</li>\n<li>Fox, Danny, 2008, “Two Short Notes on Schlenker’s theory\nof Presupposition Projection”, <em>Theoretical Linguistics</em>,\n34(3): 237–252. doi:10.1515/THLI.2008.016</li>\n<li>Geach, Peter Thomas, 1962 [1980], <em>Reference and Generality: An\nExamination of Some Medieval and Modern Theories</em>, Ithaca, NY:\nCornell University Press. Third revised edition: 1980. </li>\n<li>George, Benjamin Ross, 2008, <em>Presupposition Repairs: a Static,\nTrivalent Approach to Predicting Projection</em>, M.A. Thesis,\nUCLA.</li>\n<li>Gerbrandy, Jelle, 1999, “Dynamic Epistemic Logic”, in\n<em>Logic, Language and Computation, Vol. 2</em>, Lawrence S. Moss,\nJonathan Ginzburg, and Maarten de Rijke (eds.), Stanford: CSLI\nPublications.</li>\n<li>Groenendijk, Jeroen and Martin Stokhof, 1990, “Dynamic\nMontague Grammar”, in <em>Papers from the Second Symposium on\nLogic and Language</em>, L. Kalman and L. Polos (eds.), Budapest:\nAkademiai Kiadoo, 3–48.</li>\n<li>–––, 1991a, “Dynamic Predicate\nlogic”, <em>Linguistics and Philosophy</em>, 14(1):\n39–100. doi:10.1007/BF00628304</li>\n<li>–––, 1991b, “Two Theories of Dynamic\nSemantics”, in <em>JELIA ‘90, European Workshop on Logics\nin AI</em> (Lecture Notes in Computer Science: Volume 478), Jan van\nEijck (ed.), Berlin: Springer, 55–64.\ndoi:10.1007/BFb0018433</li>\n<li>Groenendijk, Jeroen, Martin Stokhof, and Frank Veltman, 1996,\n“Coreference and Modality”, in <em>Handbook of\nContemporary Semantic Theory</em>, Shalom Lappin (ed.), Oxford:\nBlackwell, 179–213.</li>\n<li>Groeneveld, Willem, 1995, <em>Logical Investigations into Dynamic\nSemantics</em>, Ph.D. Thesis, University of Amsterdam.</li>\n<li>de Groote, Philippe, 2006, “Towards a Montagovian Account of\nDynamics”, in <em>Proceedings of Semantics and Linguistic Theory\n(SALT) 16</em>, Masayuki Gibson and Jonathan Howell (eds.), 1–16.\ndoi:10.3765/salt.v16i0.2952</li>\n<li>Heim, Irene, 1983a, “File Change Semantics and the\nFamiliarity Theory of Definiteness”, in <em>Meaning, Use and\nInterpretation of Language</em>, Rainer Bäuerle, Christoph\nSchwarze, and Arnim von Stechow (eds.), Berlin: De Gruyter,\n164–189.</li>\n<li>–––, 1983b, “On the Projection Problem for\nPresuppositions”, <em>Proceedings of the Second West Coast\nConference on Formal Linguistics</em>, Michael Barlow, Dan P.\nFlickinger and MIchael T. Wescoat (eds.), Stanford, CA: Stanford\nUniversity Department of Lingustics, 114–126.</li>\n<li>–––, 1990, “E-Type Pronouns and Donkey\nAnaphora”, <em>Linguistics and Philosophy</em>, 13(2):\n137–138.</li>\n<li>Hollenberg, Marco and Kees Vermeulen, 1996, “Counting\nVariables in a Dynamic Setting”, <em>Journal of Logic and\nComputation</em>, 6(5): 725–744. doi:10.1093/logcom/6.5.725</li>\n<li>Kamp, Hans, 1981, “A Theory of Truth and Semantic\nRepresentation”, in <em>Formal Methods in the Study of\nLanguage</em>, Jeroen Groenendijk, Theo Janssen, and Martin Stokhof\n(eds.), Amsterdam: Mathematisch Centrum, 277–322.</li>\n<li>Kamp, Hans and Uwe Reyle, 1993, <em>From Discourse to Logic</em>,\nDordrecht: Kluwer.</li>\n<li>Karttunen, Lauri, 1973, “Presuppositions of Compound\nSentences”, <em>Linguistic Inquiry</em>, 4(2):\n169–193.</li>\n<li>–––, 1974, “Presupposition and Linguistic\nContext”, <em>Theoretical Linguistics</em>, 1:\n181–194.</li>\n<li>Kohlhase, Michael, Susanna Kuschert, and Manfred Pinkal, 1996,\n“A Type-Theoretic Semantics for \\(\\lambda\\)-DRT”, in\n<em>Proceedings of the Tenth Amsterdam Colloquium</em>, Paul Dekker\nand Martin Stokhof (eds.), Amsterdam: ILLC Publications.</li>\n<li>Krahmer, Emiel, 1995, <em>Discourse and Presupposition</em>, Ph.D.\nThesis, Tilburg University; revised and published under the\ntitle <em>Presupposition and Anaphora</em>, Stanford: CSLI\nPublications, 1998.</li>\n<li>Krahmer, Emiel and Reinhard Muskens, 1996, “Negation and\nDisjunction in Discourse Representation Theory” <em>Journal of\nSemantics</em>, 12: 357–376. doi: 10.1093/jos/12.4.357</li>\n<li>Krifka, Manfred, 1996, “Parametrized Sum Individuals for\nPlural Reference and Partitive Quantification” <em>Linguistics\nand Philosophy</em>, 19: 555–598.\n [<a href=\"http://amor.cms.hu-berlin.de/~h2816i3x/Publications/Krifka%201996%20Plural%20Anaphora.PDF\" target=\"other\">Krifka 1996 available online (pdf)</a>]</li>\n<li>Kuschert, Susanna, 2000, <em>Dynamic Meaning and\nAccommodation</em>, Ph.D. Thesis, Universität des Saarlandes.</li>\n<li>Martin, Scott, 2016, “Supplemental Update”,\n<em>Semantics and Pragmatics</em>, 9(5). doi:10.3765/sp.9.5</li>\n<li>Milner, Robin, 1978, “A Theory of Type Polymorphism in\nProgramming”, <em>Journal of Computer and System Sciences</em>,\n17: 348–375.</li>\n<li>Montague, Richard, 1973, “The Proper Treatment of\nQuantification in Ordinary English”, in <em>Approaches to\nNatural Language</em>, Jaakko Hintikka, Julius Moravcsik, and Patrick\nSuppes (eds.), Dordrecht: Reidel, 221–242.</li>\n<li>–––, 1974a, “English as a Formal\nLanguage”, in Montague 1974c: 188–221.</li>\n<li>–––, 1974b, “Universal Grammar”, in\nMontague 1974c: 222–246.</li>\n<li>–––, 1974c, <em>Formal Philosophy; Selected\nPapers of Richard Montague</em>, R.H. Thomason (ed.), New Haven and\nLondon: Yale University Press.</li>\n<li>Murray, Sarah E., 2014, “Varieties of Update”,\n<em>Semantics and Pragmatics</em>, 7: 1–53.\ndoi:10.3765/sp.7.2</li>\n<li>Muskens, Reinhard, 1991, “Anaphora and the Logic of\nChange”, in <em>JELIA ‘90, European Workshop on Logics in\nAI</em> (Lecture Notes in Computer Science: Volume 478), Jan van Eijck\n(ed.), Berlin and New York, 414–430.\ndoi:10.1007/BFb0018456</li>\n<li>–––, 1994, “A Compositional Discourse\nRepresentation Theory”, in <em>Proceedings 9<sup>th</sup>\nAmsterdam Colloquium</em>, Paul Dekker and Martin Stokhof (eds.),\nAmsterdam: ILLC Publications, 467–486.</li>\n<li>–––, 1995, “Tense and the Logic of\nChange”, in <em>Lexical Knowledge in the Organization of\nLanguage</em>, U. Egli et al. (ed.), Amsterdam: John Benjamins,\n147–183.</li>\n<li>–––, 1996, “Combining Montague Semantics\nand Discourse Representation”, <em>Linguistics and\nPhilosophy</em>, 19: 143–186.</li>\n<li>Muskens, Reinhard, Johan van Benthem, and Albert Visser, 1997,\n“Dynamics”, in van Benthem and ter Meulen 1997:\n587–648.</li>\n<li>Nouwen, Rick, 2003, “Complement Anaphora and\nInterpretation”, <em>Journal of Semantics</em>, 20: \n73–113.</li>\n<li>–––, 2007, “On Dependent Pronouns and\nDynamic Semantics”, <em>Journal of Philosophical Logic</em>,\n36(2): 123–154.</li>\n<li>–––, forthcoming, “E-type Pronouns:\nCongressmen, Sheep and Paychecks”, in L. Matthewson, C. Meier,\nH. Rullmann, and T.E. Zimmerman (eds.),\n<em>The Blackwell Companion to Semantics</em>, Oxford: Wiley.</li>\n<li>Plaza, Jan A., 1989, “Logics of Public\nCommunications”, in <em>Proceedings of the 4<sup>th</sup>\nInternational Symposium on Methodologies for Intelligent Systems</em>,\nM.L. Emrich, M.S. Pfeifer, M. Hadzikadic, and Z.W. Ras (eds.),\nAmsterdam: North Holland, 201–216.</li>\n<li>Putnam, Hilary, 1975, “The Meaning of\n‘Meaning’”, in <em>Philosophical Papers</em> (Volume\n2), Cambridge: Cambridge University Press.</li>\n<li>Quine, Willard van Orman, 1960, <em>Word and Object</em>,\nCambridge, MA: MIT Press.</li>\n<li>Roberts, Craige, 1987, <em>Modal Subordination, Anaphora and\nDistributivity</em>, Ph.D. Thesis, University of\nMassachusetts/Amherst; New York: Garland, 1990.</li>\n<li>–––, 1989, “Modal Subordination and\nPronominal Anaphora in Discourse”, <em>Linguistics and\nPhilosophy</em>, 12: 683–721.</li>\n<li>Rothschild, Daniel, 2011, “Explaining Presupposition\nProjection with Dynamic Semantics”, <em>Semantics and\nPragmatics</em>, 4(3): 1“43.</li>\n<li>Sandt, Rob A. van der, 1992, “Presupposition Projection as\nAnaphora Resolution”, <em>Journal of Semantics</em> (Special\nIssue: Presupposition, Part 2), 9: 333–377.\ndoi:10.1093/jos/9.4.333</li>\n<li>Schlenker, Philippe, 2007, “Anti-dynamics: Presupposition\nProjection without Dynamic Semantics”, <em>Journal of Logic,\nLanguage and Information</em>, 16(3): 325–356.</li>\n<li>–––, 2008, “Be Articulate: A Pragmatic\nTheory of Presupposition Projection”, <em>Theoretical\nLinguistics</em>, 34(3): 157–212.</li>\n<li>–––, 2009, “Local Contexts”,\n<em>Semantics and Pragmatics</em>, 2(3): 1–78.</li>\n<li>Seuren, Pieter, 1985, <em>Discourse Semantics</em>, Oxford:\nBlackwell.</li>\n<li>Soames, Scott, 1989, “Presuppositions”, in Dov M.\nGabbay &amp; Franz Guenther (eds.), <em>Handbook of Philosophical\nLogic</em>, vol. IV, 553–616. Dordrecht.\ndoi:10.1007/978-94-009-1171-0_9</li>\n<li>Stalnaker, Robert C., 1972, “Pragmatics”, in\n<em>Semantics of Natural Language</em>, Donald Davidson and Gilbert\nHarman (eds.), Dordrecht: Reidel, 380–397.\ndoi:10.1007/978-94-010-2557-7_11</li>\n<li>–––, 1973,\n“Presuppositions”, <em>Journal of Philosophical\nLogic</em>, 2: 447–457.</li>\n<li>–––, 1974, “Pragmatic\nPresuppositions”, in <em>Semantics and Philosophy</em>, Milton\nK. Munitz and Peter K. Unger (eds.), New York: New York University\nPress, 197–213.</li>\n<li>Veltman, Frank, 1991, “Defaults in Update Semantics”,\nin <em>Conditionals, Defaults and Belief Revision</em>, Hans Kamp\n(ed.), Edinburgh: Dyana Deliverable R2.5A.</li>\n<li>–––, 1996, “Defaults in Update\nSemantics”, <em>Journal of Philosophical Logic</em>, 25:\n221–261.</li>\n<li>Vermeulen, C.F.M., 1993, “Sequence Semantics for Dynamic\nPredicate Logic”, <em>Journal of Logic, Language and\nInformation</em>, 2: 217–254. doi:10.1007/BF01050788</li>\n<li>–––, 1994, <em>Explorations of the Dynamic\nEnvironment</em>, Ph.D. thesis, Utrecht University.</li>\n<li>–––, 1995, “Merging without Mystery,\nVariables in Dynamic Semantics”, <em>Journal of Philosophical\nLogic</em>, 24: 405–450.</li>\n<li>Werth, Paul, 2000, <em>Text Worlds: Representing Conceptual Space\nin Discourse</em>, London: Pearson Education/Longman.</li>\n<li>Zeevat, Hank, 1989, “A Compositional Approach to Discourse\nRepresentation Theory”, <em>Linguistics and Philosophy</em>,\n12(1): 95–131. doi:10.1007/BF00627399</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "anaphora",
            "assertion",
            "common knowledge",
            "compositionality",
            "conditionals",
            "contextualism, epistemic",
            "discourse representation theory",
            "externalism about the mind",
            "implicature",
            "indexicals",
            "information: semantic conceptions of",
            "logic: classical",
            "logic: conditionals",
            "logic: epistemic",
            "logic: of belief revision",
            "logic: second-order and higher-order",
            "logical form",
            "mental content: narrow",
            "mind: computational theory of",
            "model theory: first-order",
            "pragmatics",
            "reference",
            "scientific realism",
            "speech acts",
            "Tarski, Alfred: truth definitions",
            "type theory: Church’s type theory"
        ],
        "entry_link": [
            {
                "../anaphora/": "anaphora"
            },
            {
                "../assertion/": "assertion"
            },
            {
                "../common-knowledge/": "common knowledge"
            },
            {
                "../compositionality/": "compositionality"
            },
            {
                "../conditionals/": "conditionals"
            },
            {
                "../contextualism-epistemology/": "contextualism, epistemic"
            },
            {
                "../discourse-representation-theory/": "discourse representation theory"
            },
            {
                "../content-externalism/": "externalism about the mind"
            },
            {
                "../implicature/": "implicature"
            },
            {
                "../indexicals/": "indexicals"
            },
            {
                "../information-semantic/": "information: semantic conceptions of"
            },
            {
                "../logic-classical/": "logic: classical"
            },
            {
                "../logic-conditionals/": "logic: conditionals"
            },
            {
                "../logic-epistemic/": "logic: epistemic"
            },
            {
                "../logic-belief-revision/": "logic: of belief revision"
            },
            {
                "../logic-higher-order/": "logic: second-order and higher-order"
            },
            {
                "../logical-form/": "logical form"
            },
            {
                "../content-narrow/": "mental content: narrow"
            },
            {
                "../computational-mind/": "mind: computational theory of"
            },
            {
                "../modeltheory-fo/": "model theory: first-order"
            },
            {
                "../pragmatics/": "pragmatics"
            },
            {
                "../reference/": "reference"
            },
            {
                "../scientific-realism/": "scientific realism"
            },
            {
                "../speech-acts/": "speech acts"
            },
            {
                "../tarski-truth/": "Tarski, Alfred: truth definitions"
            },
            {
                "../type-theory-church/": "type theory: Church’s type theory"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\">\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dynamic-semantics\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\">\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/dynamic-semantics/\" target=\"other\">Preview the PDF version of this entry</a>\n at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\">\n<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>\n",
            "<a href=\"https://www.inphoproject.org/entity?sep=dynamic-semantics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\">\n<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>\n",
            "<a href=\"http://philpapers.org/sep/dynamic-semantics/\" target=\"other\">Enhanced bibliography for this entry</a>\n at\n <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>,\n with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=dynamic-semantics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/dynamic-semantics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=dynamic-semantics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/dynamic-semantics/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Chemla, Emmanuel, 2008,\n “<a href=\"http://semanticsarchive.net/Archive/WI1ZTU3N/Chemla-SIandPres.html\" target=\"other\">Similarity: Towards a Unified Account of Scalar Implicatures, Free Choice Permission and Presupposition Projection</a>,” \n unpublished manuscript, Ecole Normale Superieur.",
            "Parsons, Terence, 1978, \n“<a href=\"http://www.philosophy.ucla.edu/people/faculty/tparsons/Pronouns%20as%20Paraphrases/Pronouns%20as%20Paraphrases.pdf\" target=\"other\">Pronouns as Paraphrases</a>,”,\n  unpublished manuscript, University of Massachusetts/Amherst."
        ],
        "listed_links": [
            {
                "http://semanticsarchive.net/Archive/WI1ZTU3N/Chemla-SIandPres.html": "Similarity: Towards a Unified Account of Scalar Implicatures, Free Choice Permission and Presupposition Projection"
            },
            {
                "http://www.philosophy.ucla.edu/people/faculty/tparsons/Pronouns%20as%20Paraphrases/Pronouns%20as%20Paraphrases.pdf": "Pronouns as Paraphrases"
            }
        ]
    }
}