{
    "url": "ethics-social-networking",
    "title": "Social Networking and Ethics",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Shannon Vallor\n<svallor@ed.ac.uk>",
        "author_links": [
            {
                "https://www.ed.ac.uk/profile/shannon-vallor/": "Shannon Vallor"
            },
            {
                "mailto:svallor%40ed%2eac%2euk": "svallor@ed.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://www.ed.ac.uk/profile/shannon-vallor/\" target=\"other\">Shannon Vallor</a>\n&lt;<a href=\"mailto:svallor%40ed%2eac%2euk\"><em>svallor<abbr title=\" at \">@</abbr>ed<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 3, 2012",
        "substantive revision Mon Aug 30, 2021"
    ],
    "preamble": "\n\nIn the 21st century, new media technologies for social\nnetworking such as Facebook, Twitter, WhatsApp and YouTube began to\ntransform the social, political and informational practices of\nindividuals and institutions across the globe, inviting philosophical\nresponses from the community of applied ethicists and philosophers of\ntechnology. While scholarly responses to social media continue to be\nchallenged by the rapidly evolving nature of these technologies, the\nurgent need for attention to the social networking phenomenon is\nunderscored by the fact that it has profoundly reshaped how many human\nbeings initiate and/or maintain virtually every type of ethically\nsignificant social bond or role: friend-to-friend, parent-to-child,\nco-worker-to co-worker, employer-to-employee, teacher-to-student,\nneighbor-to-neighbor, seller-to-buyer, doctor-to-patient, and\nvoter-to-voter, to offer just a partial list. Nor are the ethical\nimplications of these technologies strictly interpersonal, as it has\nbecome evident that social networking services (hereafter referred to\nas SNS) and other new digital media have profound implications for\ndemocracy, public institutions and the rule of law. The complex web of\ninteractions between SNS developers and users, and their online and\noffline communities, corporations and governments—along with the\ndiverse and sometimes conflicting motives and interests of these\nvarious stakeholders—will continue to require rigorous ethical\nanalysis for decades to come.\n\nSection 1 of the entry outlines the history and working definition of\nsocial networking services. Section 2 identifies the early\nphilosophical foundations of reflection on the ethics of online social\nnetworks, leading up to the emergence of Web 2.0 standards (supporting\nuser interactions) and full-fledged SNS. Section 3 reviews the primary\nethical topic areas around which philosophical reflections on SNS\nhave, to date, converged: privacy; identity and community; friendship,\nvirtue and the good life; democracy, free speech,\nmisinformation/disinformation and the public sphere; and cybercrime.\nFinally, Section 4 reviews some of the metaethical issues potentially\nimpacted by the emergence of SNS.\n",
    "toc": [
        {
            "#HisDefSocNetSer": "1. History and Definitions of Social Networking Services"
        },
        {
            "#OnlSocNetEmeWeb20": "1.1 Online Social Networks and the Emergence of ‘Web 2.0’"
        },
        {
            "#EarSchEngSocNetSer": "1.2 Early Scholarly Engagement with Social Networking Services"
        },
        {
            "#EarPhiConAboOnlSocNet": "2. Early Philosophical Concerns about Online Social Networks"
        },
        {
            "#BorCriSocHyp": "2.1 Borgmann’s Critique of Social Hyperreality"
        },
        {
            "#HubDreIntSocAnoVerCom": "2.2 Hubert Dreyfus on Internet Sociality: Anonymity versus Commitment"
        },
        {
            "#LegPheCriSocNet": "2.3 Contemporary Reassessment of Early Phenomenological Critiques of SNS"
        },
        {
            "#BorgDreyCancCult": "2.3.1 Borgmann, Dreyfus and the ‘Cancel Culture’ Debates"
        },
        {
            "#CiviHarmSociHype": "2.3.2 The Civic Harms of Social Hyperreality"
        },
        {
            "#ConEthConAboSocNetSer": "3. Contemporary Ethical Concerns about Social Networking Services"
        },
        {
            "#SocNetSerPri": "3.1 Social Networking Services and Privacy"
        },
        {
            "#EthIdeComSocNetSer": "3.2 The Ethics of Identity and Community on Social Networking Services"
        },
        {
            "#FriVirGooLifSocNetSer": "3.3 Friendship, Virtue and the Good Life on Social Networking Services"
        },
        {
            "#DemFreSocNetSerPubSph": "3.4 Democracy, Freedom and Social Networking Services in the Public Sphere"
        },
        {
            "#SocNetSerCyb": "3.5 Social Networking Services and Cybercrime"
        },
        {
            "#SocNetSerMetIss": "4. Social Networking Services and Metaethical Issues"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. History and Definitions of Social Networking Services\n\n‘Social networking’ is an inherently ambiguous term\nrequiring some clarification. Human beings have been socially\n‘networked’ in one manner or another for as long as we\nhave been on the planet, and we have historically availed ourselves of\nmany successive techniques and instruments for facilitating and\nmaintaining such networks. These include structured social\naffiliations and institutions such as private and public clubs, lodges\nand churches as well as communications technologies such as postal and\ncourier systems, telegraphs and telephones. When philosophers speak\ntoday, however, of ‘Social Networking and Ethics’, they\nusually refer more narrowly to the ethical impact of an evolving and\nloosely defined group of information technologies, most based on or\ninspired by the ‘Web 2.0’ software standards that emerged\nin the first decade of the 21st century. While the most\nwidely used social networking services are free, they operate on large\nplatforms that offer a range of related products and services that\nunderpin their business models, from targeted advertising and data\nlicensing to cloud storage and enterprise software. Ethical impacts of\nsocial networking services are loosely clustered into three categories\n– direct impacts of social networking activity itself, indirect\nimpacts associated with the underlying business models that are\nenabled by such activity, and structural implications of SNS as novel\nsociopolitical and cultural forces.\n1.1 Online Social Networks and the Emergence of ‘Web 2.0’\n\nPrior to the emergence of Web 2.0 standards, the computer had already\nserved for decades as a medium for various forms of social networking,\nbeginning in the 1970s with social uses of the U.S. military’s\nARPANET and evolving to facilitate thousands of Internet newsgroups\nand electronic mailing lists, BBS (bulletin board systems), MUDs\n(multi-user dungeons) and chat rooms dedicated to an eclectic range of\ntopics and social identities (Barnes 2001; Turkle 1995). These early\ncomputer social networks were systems that grew up organically,\ntypically as ways of exploiting commercial, academic or other\ninstitutional software for more broadly social purposes. In contrast,\nWeb 2.0 technologies evolved specifically to facilitate\nuser-generated, collaborative and shared Internet content, and while\nthe initial aims of Web 2.0 software developers were still largely\ncommercial and institutional, the new standards were designed\nexplicitly to harness the already-evident potential of the Internet\nfor social networking. Most notably, Web 2.0 social interfaces\nredefined the social topography of the Internet by enabling users to\nbuild increasingly seamless connections between their online social\npresence and their existing social networks offline—a trend that\nshifted the Internet away from its earlier function as a haven for\nlargely anonymous or pseudonymous identities forming sui\ngeneris social networks (Ess 2011).\n\nStarting in the first decade of the 21st century, among the first\nwebsites to employ the new standards explicitly for general social\nnetworking purposes were Orkut, MySpace, LinkedIn, Friendster, Bebo,\nHabbo and Facebook. Subsequent trends in online social networking\ninclude the rise of sites dedicated to media and news sharing\n(YouTube, Reddit, Flickr, Instagram, Vine, Snapchat, TikTok),\nmicroblogging (Tumblr, Twitter, Weibo), location-based networking\n(Foursquare, Loopt, Yelp, YikYak), messaging and VoIP (WhatsApp,\nMessenger, WeChat), social gaming (Steam, Twitch) and interest-sharing\n(Pinterest).\n1.2 Early Scholarly Engagement with Social Networking Services\n\nStudy of the ethical implications of SNS was initially seen as a\nsubpart of Computer and Information Ethics (Bynum 2018). While\nComputer and Information Ethics certainly accommodates an\ninterdisciplinary approach, its direction and problems were initially\nlargely defined by philosophically-trained scholars such as James Moor\n(1985) and Deborah G. Johnson (1985). Yet this has not been the early\npattern for the ethics of social networking. Partly due to the\ncoincidence of the social networking phenomenon with the emerging\ninterdisciplinary social science field of ‘Internet\nStudies’ (Consalvo and Ess, 2011), the ethical implications of\nsocial networking technologies were initially targeted for inquiry by\na loose coalition of sociologists, social psychologists,\nanthropologists, ethnographers, law and media scholars and political\nscientists (see, for example, Giles 2006; Boyd 2007; Ellison et al.\n2007; Ito 2009). Consequently, philosophers who have turned their\nattention to social networking and ethics have had to decide whether\nto pursue their inquiries independently, drawing primarily from\ntraditional philosophical resources in applied computer ethics and the\nphilosophy of technology, or to develop their views in consultation\nwith the growing body of empirical data and conclusions already being\ngenerated by other disciplines. While this entry will primarily\nconfine itself to reviewing existing philosophical research on social\nnetworking ethics, links between those researches and studies in other\ndisciplinary contexts remain vital.\n\nIndeed, recent academic and popular debates about the harms and\nbenefits of large social media platforms have been driven far more\nvisibly by scholars in sociology (Benjamin 2019), information studies\n(Roberts 2019), psychology (Zuboff 2019) and other social sciences\nthan by philosophers, who remain comparatively disengaged. In turn,\nrather than engage with philosophical ethics, social science\nresearchers in this field typically anchor normative dimensions of\ntheir analyses in broader political frameworks of justice and human\nrights, or psychological accounts of wellbeing. This has led to a\ngrowing debate about whether philosophical ‘ethics’\nremains the right lens through which to subject social networking\nservices or other emerging technologies to normative critique (Green\n2021, Other Internet Resources). This debate is driven by several\nconcerns. First is the growing professionalization of applied ethics\n(Stark and Hoffmann 2019) and its perceived detachment from social\ncritique. A second concern is the trend of insincere corporate\nappropriation of the language of ethics for marketing, crisis\nmanagement and public relations purposes, known as\n‘ethicswashing’ (Bietti 2020). Finally, there is the\nquestion of whether philosophical theories of ethics, which have\ntraditionally focused on individual actions, are sufficiently\nresponsive to the structural conditions of social injustice that drive\nmany SNS-associated harms.\n2. Early Philosophical Concerns about Online Social Networks\n\nAmong the first philosophers to take an interest in the ethical\nsignificance of social uses of the Internet were phenomenological\nphilosophers of technology Albert Borgmann and Hubert Dreyfus. These\nthinkers were heavily influenced by Heidegger’s (1954 [1977]) view\nof technology as a monolithic force with a distinctive vector of\ninfluence, one that tends to constrain or impoverish the human\nexperience of reality in specific ways. While Borgmann and Dreyfus\nwere primarily responding to the immediate precursors of Web 2.0\nsocial networks (e.g., chat rooms, newsgroups, online gaming and\nemail), their conclusions, which aim at online sociality broadly\nconstrued, are directly relevant to SNS.\n2.1 Borgmann’s Critique of Social Hyperreality\n\nBorgmann’s early critique (1984) of modern technology addressed\nwhat he called the device paradigm, a technologically-driven\ntendency to conform our interactions with the world to a model of easy\nconsumption. By 1992’s Crossing the Postmodern Divide,\nhowever, Borgmann had become more narrowly focused on the ethical and\nsocial impact of information technologies, employing the concept of\nhyperreality to critique (among other aspects of information\ntechnology) the way in which online social networks may subvert or\ndisplace organic social realities by allowing people to “offer\none another stylized versions of themselves for amorous or convivial\nentertainment” (1992, 92) rather than allowing the fullness and\ncomplexity of their real identities to be engaged. While Borgmann\nadmits that in itself a social hyperreality seems “morally\ninert” (1992, 94), he insists that the ethical danger of\nhyperrealities lies in their tendency to leave us “resentful and\ndefeated” when we are forced to return from their\n“insubstantial and disconnected glamour” to the organic\nreality which “with all its poverty inescapably asserts its\nclaims on us” by providing “the tasks and blessings that\ncall forth patience and vigor in people.” (1992, 96)\n\nThere might be an inherent ambiguity in Borgmann’s analysis,\nhowever. On the one hand he tells us that it is the\ncompetition with our organic and embodied social presence\nthat makes online social environments designed for convenience,\npleasure and ease ethically problematic, since the latter will\ninevitably be judged more satisfying than the ‘real’\nsocial environment. But he goes on to claim that online social\nenvironments are themselves ethically deficient:\n\nThose who become present via a communication link have a diminished\npresence, since we can always make them vanish if their presence\nbecomes burdensome. Moreover, we can protect ourselves from unwelcome\npersons altogether by using screening devices….The extended\nnetwork of hyperintelligence also disconnects us from the people we\nwould meet incidentally at concerts, plays and political gatherings.\nAs it is, we are always and already linked to the music and\nentertainment we desire and to sources of political information. This\nimmobile attachment to the web of communication works a twofold\ndeprivation in our lives. It cuts us off from the pleasure of seeing\npeople in the round and from the instruction of being seen and judged\nby them. It robs us of the social resonance that invigorates our\nconcentration and acumen when we listen to music or watch a\nplay.…Again it seems that by having our hyperintelligent eyes\nand ears everywhere, we can attain world citizenship of unequaled\nscope and subtlety. But the world that is hyperintelligently spread\nout before us has lost its force and resistance. (1992, 105–6)\n\n\nCritics of Borgmann saw him as adopting Heidegger’s (1954 [1977])\nsubstantivist, monolithic model of technology as a singular,\ndeterministic force in human affairs (Feenberg 1999; Verbeek 2005).\nThis model, known as technological determinism, represents\ntechnology as an independent driver of social and cultural change,\nshaping human institutions, practices and values in a manner largely\nbeyond our control. Whether or not this is ultimately Borgmann’s\nview (or Heidegger’s), his critics saw it in remarks of the\nfollowing sort: “[Social hyperreality] has already begun to\ntransform the social fabric…At length it will lead to a\ndisconnected, disembodied, and disoriented sort of life…It is\nobviously growing and thickening, suffocating reality and rendering\nhumanity less mindful and intelligent.” (Borgmann 1992,\n108–9)\n\nCritics asserted that Borgmann’s analysis suffered from his lack\nof attention to the substantive differences between particular social\nnetworking technologies and their varied contexts of use, as well as\nthe different motivations and patterns of activity displayed by\nindividual users in those contexts. For example, Borgmann neglected\nthe fact that physical reality does not always enable or facilitate\nconnection, nor does it do so equally for all persons. For example,\nthose who live in remote rural areas, neurodivergent persons, disabled\npersons and members of socially marginalized groups are often not well\nserved by the affordances of physical social spaces. As a consequence,\nAndrew Feenberg (1999) claims that Borgmann overlooked how online\nsocial networks can supply sites of democratic resistance for those\nwho are physically or politically disempowered by many\n‘real-world’ networks.\n2.2 Hubert Dreyfus on Internet Sociality: Anonymity versus Commitment\n\nPhilosopher Hubert Dreyfus (2001) shared Borgmann’s early\ncritical suspicion of the ethical possibilities of the Internet; like\nBorgmann, Dreyfus’s reflections on the ethical dimension of\nonline sociality conveyed a view of such networks as an impoverished\nsubstitute for the real thing. Like Borgmann, Dreyfus’s\nsuspicion was informed by his phenomenological roots, which led him to\nfocus his critical attention on the Internet’s suspension of\nfully embodied presence. Yet rather than draw upon Heidegger’s\nmetaphysical framework, Dreyfus (2004) reached back to Kierkegaard in\nforming his criticisms of life online. Dreyfus asserts that what\nonline engagements intrinsically lack is exposure to risk,\nand without risk, Dreyfus tells us, there can be no true meaning or\ncommitment found in the electronic domain. Instead, we are drawn to\nonline social environments precisely because they allow us to\nplay with notions of identity, commitment and meaning,\nwithout risking the irrevocable consequences that ground real\nidentities and relationships. As Dreyfus put it:\n\n…the Net frees people to develop new and exciting selves. The\nperson living in the aesthetic sphere of existence would surely agree,\nbut according to Kierkegaard, “As a result of knowing and being\neverything possible, one is in contradiction with oneself”\n(Present Age, 68). When he is speaking from the point of view of the\nnext higher sphere of existence, Kierkegaard tells us that the self\nrequires not “variableness and brilliancy,” but\n“firmness, balance, and steadiness” (Dreyfus 2004, 75)\n\n\nWhile Dreyfus acknowledges that unconditional commitment and\nacceptance of risk are not excluded in principle by online\nsociality, he insists that “anyone using the Net who was led to\nrisk his or her real identity in the real world would have to act\nagainst the grain of what attracted him or her to the Net in the first\nplace” (2004, 78).\n2.3 Contemporary Reassessment of Early Phenomenological Critiques of SNS\n\nWhile Borgmann and Dreyfus’s views continue to inform the\nphilosophical conversation about social networking and ethics, both of\nthese early philosophical engagements with the phenomenon manifest\ncertain predictive failures (as is perhaps unavoidable when reflecting\non new and rapidly evolving technological systems). Dreyfus did not\nforesee the way in which popular SNS such as Facebook, LinkedIn and\nTwitter would shift away from the earlier online norms of anonymity\nand identity play, instead giving real-world identities an online\npresence which in some ways is less ephemeral than bodily presence (as\nthose who have struggled to erase online traces of past tweets or to\ndelete Facebook profiles of deceased loved ones can attest).\n\nLikewise, Borgmann’s critiques of “immobile\nattachment” to the online datastream did not anticipate the rise\nof mobile social networking applications which not only encourage us\nto physically seek out and join our friends at those same concerts,\nplays and political events that he envisioned us passively digesting\nfrom an electronic feed, but also enable spontaneous physical\ngatherings in ways never before possible. That said, such short-term\npredictive failures may not, in the long view, turn out to be fatal to\ntheir legacies. After all, some of the most enthusiastic champions of\nthe Internet’s liberating social possibilities to be challenged\nby Dreyfus (2004, 75), such as Sherry Turkle, have since articulated\nfar more pessimistic views of the trajectory of new social\ntechnologies. Turkle’s concerns about social media in particular\n(2011, 2015), namely that they foster a peculiar alienation in\nconnectedness that leaves us feeling “alone together,”\nresonate well with Borgmann’s earlier warnings about electronic\nnetworks.\n2.3.1 Borgmann, Dreyfus and the ‘Cancel Culture’ Debates\n\nThe SNS phenomenon continues to be ambiguous with respect to\nconfirming Borgmann and Dreyfus’ early predictions. One of their\nmost unfounded worries was that online social media would lead to a\nculture in which personal beliefs and actions are stripped of enduring\nconsequence, cut adrift from real-world identities as persons\naccountable to one another. Today, no regular user of Twitter or\nReddit is cut off from “the instruction of being seen and\njudged” (Borgmann 1992). And contra Dreyfus, it is primarily\nthrough the power of social media that people’s\nidentities in the real world are now exposed to greater risk\nthan before – from doxing to loss of employment to being\nphysically endangered by ‘swatting.’\n\nIf anything, contemporary debates about social media’s alleged\npropagation of a stifling ‘cancel culture,’ which bend\nback upon the philosophical community itself (Weinberg 2020, Other\nInternet Resources), reflect growing anxieties among many that social\nnetworking environments primarily lack affordances for forgiveness and\nmercy, not judgment and personal accountability. Yet others see the\nemergent phenomenon of online collective judgment as performing a\nvital function of moral and political levelling, one in which social\nmedia enable the natural ethical consequences of an agent’s\nspeech and acts to at last be imposed upon the powerful, not merely\nthe vulnerable and marginalized.\n2.3.2. The Civic Harms of Social Hyperreality\n\nOne aspect of Borgmann’s (1992) account has recently rebounded\nin plausibility; namely, his prediction of a dire decline in civic\nvirtues among those fully submerged in the distorted political reality\ncreated by the disembodied and disorienting\n‘hyperintelligence’ of online social media. In the wake of\nthe 2016 UK and US voter manipulation by foreign armies of social\nmedia bots, sock puppets, and astroturf accounts, the world has seen a\nrapid global expansion and acceleration of political disinformation\nand conspiracy theories through online social networks like Facebook,\nTwitter, YouTube and WhatsApp.\n\nThe profound harms of the ‘weaponization’ of social media\ndisinformation go well beyond voter manipulation. In 2020,\ndisinformation about the COVID-19 pandemic greatly impeded public\nhealth authorities by clouding the public’s perception of the\nseverity and transmissibility of the virus as well as the utility of\nprophylactics such as mask-wearing. Meanwhile, the increasing global\ninfluence of ever-mutating conspiracy theories borne on social media\nplatforms by the anonymous group QAnon suggests that Borgmann’s\nwarning of the dangers of our rising culture of\n‘hyperreality,’ long derided as technophobic ‘moral\npanic,’ was dismissed far too hastily. While the notorious\n‘Pizzagate’ episode of 2016 (Miller 2021) was the first\nvisible link between QAnon conspiracies and real-world violence, the\nalarming uptake in 2020 of QAnon conspiracies by violent right-wing\nmilitias in the United States led Facebook and Twitter to abandon\ntheir prior tolerance of the movement and ban or limit access to\nhundreds of thousands of QAnon-associated accounts.\n\nSuch moves came too late to stabilize the epistemic and political rift\nin a shared reality. By late 2020, QAnon had boosted a widely\nsuccessful effort by supporters of outgoing President Donald Trump to\ncreate a (manifestly false) counter-narrative around the 2020 election\npurporting that he had actually won, leading to a failed insurrection\nat the U.S. Capitol on January 6, 2021. Borgmann’s warnings on\n‘hyperreality’ seem less like moral panic and more like\nprescience when one considers the existence of a wide swath of\nAmerican voters who remain convinced that Donald Trump remains\nlegitimately in office, directing actions against his enemies. Such\ncounter-narratives are not merely ‘underground’ belief\nsystems; they compete directly with reality itself. On June 17, 2021,\nthe mainstream national newspaper USA Today found it necessary to\npublish a piece titled “Fact Check: Hilary Clinton was not\nhanged at Guantanamo Bay” (Wagner 2021) in response to a video\nbeing widely shared on the social media platforms TikTok and\nInstagram, which describes in fine detail the (very much alive)\nClinton’s last meal.\n\nBorgmann’s long-neglected work on social hyperreality thus\nmerits reevaluation in light of the growing fractures and\nincoherencies that now splinter and twist our digitally mediated\nexperience of what remains, underneath it all, a common world. The\nCOVID-19 pandemic and increasingly catastrophic impacts of climate\nchange testify to humanity’s vital need to remain anchored in\nand intelligently responsive to a shared physical reality.\n\nYet both the spread of social media-driven disinformation and the rise\nof online moral policing reveal an unresolved philosophical tension\nthat Borgmann’s own work did not explicitly confront. This is\nthe\n Concept of Toleration and its Paradoxes,\n which continue to bedevil modern political thought. Social networking\nservices have transformed this festering concern of political\nphilosophy into something verging on an existential crisis. When\nmalice and madness can be amplified on a global scale at lightspeed,\nin a manner affordable and accessible to anyone with a smartphone or\nwifi connection, what is too injurious and too irremediable, to be\nsaid, or shared (Marin 2021)?\n\nSocial media continue to drive a range of new philosophical\ninvestigations in the domains of\n social epistemology\n and ethics, including ‘vice epistemology’ (Kidd, Battaly,\nCassam 2020). Such investigations raise urgent questions about the\nrelationship between online disinformation/misinformation, individual\nmoral and epistemic responsibility, and the responsibility of social\nmedia platforms themselves. On this point, Regina Rini (2017) has\nargued that the problem of online disinformation/misinformation is not\nproperly conceived in terms of individual epistemic vice, but rather\nmust be seen as a “tragedy of the epistemic commons” that\nwill require institutional and structural solutions.\n3. Contemporary Ethical Concerns about Social Networking Services\n\nWhile early SNS scholarship in the social and natural sciences tended\nto focus on SNS impact on users’ psychosocial markers of\nhappiness, well-being, psychosocial adjustment, social capital, or\nfeelings of life satisfaction, philosophical concerns about social\nnetworking and ethics have generally centered on topics less amenable\nto empirical measurement (e.g., privacy, identity, friendship, the\ngood life and democratic freedom). More so than ‘social\ncapital’ or feelings of ‘life satisfaction,’ these\ntopics are closely tied to traditional concerns of ethical theory\n(e.g., virtues, rights, duties, motivations and consequences). These\ntopics are also tightly linked to the novel features and distinctive\nfunctionalities of SNS, more so than some other issues of interest in\ncomputer and information ethics that relate to more general Internet\nfunctionalities (for example, issues of copyright and intellectual\nproperty).\n\nDespite the methodological challenges of applying philosophical theory\nto rapidly shifting empirical patterns of SNS influence, philosophical\nexplorations of the ethics of SNS have continued in recent years to\nmove away from Borgmann and Dreyfus’ transcendental-existential\nconcerns about the Internet, to the empirically-driven space of\napplied technology ethics. Research in this space explores three\ninterlinked and loosely overlapping kinds of ethical phenomena:\n\ndirect ethical impacts of social networking activity\nitself (just or unjust, harmful or beneficial) on participants as well\nas third parties and institutions;\nindirect ethical impacts on society of social networking\nactivity, caused by the aggregate behavior of users, platform\nproviders and/or their agents in complex interactions between these\nand other social actors and forces;\nstructural impacts of SNS on the ethical shape of\nsociety, especially those driven by the dominant surveillant and\nextractivist value orientations that sustain social networking\nplatforms and culture.\n\n\nMost research in the field, however, remains topic- and\ndomain-driven—exploring a given potential harm or\ndomain-specific ethical dilemma that arises from direct, indirect, or\nstructural effects of SNS, or more often, in combination. Sections\n3.1–3.5 outline the most widely discussed of contemporary\nSNS’ ethical challenges.\n3.1 Social Networking Services and Privacy\n\nFundamental practices of concern for direct ethical impacts on privacy\ninclude: the transfer of users’ data to third parties for\nintrusive purposes, especially marketing, data mining, and\nsurveillance; the use of SNS data to train facial-recognition systems\nor other algorithmic tools that identify, track and profile people\nwithout their free consent; the ability of third-party applications to\ncollect and publish user data without their permission or awareness;\nthe dominant reliance by SNS on opaque or inadequate privacy settings;\nthe use of ‘cookies’ to track online user activities after\nthey have left a SNS; the abuse of social networking tools or data for\nstalking or harassment; widespread scraping of social media data by\nacademic researchers for a variety of unconsented purposes;\nundisclosed sharing of user information or patterns of activity with\ngovernment entities; and, last but not least, the tendency of SNS to\nfoster imprudent, ill-informed or unethical information sharing\npractices by users, either with respect to their own personal data or\ndata related to other persons and entities. Facebook has been a\nparticular lightning-rod for criticism of its privacy practices\n(Spinello 2011, Vaidhyanathan 2018), but it is just the most visible\nmember of a far broader and more complex network of SNS actors with\naccess to unprecedented quantities of sensitive personal data.\n\nIndirectly, the incentives of social media environments create\nparticular problems with respect to privacy norms. For example, since\nit is the ability to access information freely shared by others that\nmakes SNS uniquely attractive and useful, and since platforms are\ngenerally designed to reward disclosure, it turns out that contrary to\ntraditional views of information privacy, giving users greater control\nover their information-sharing practices can actually lead to\ndecreased privacy for themselves and others in their network.\nIndeed, advertisers, insurance companies and employers are\nincreasingly less interested in knowing the private facts of\nindividual users’ lives, and more interested in using their data\nto train algorithms that can predict the behavior of people very\nmuch like that user. Thus the real privacy risk of our social\nmedia practices is often not to ourselves but to other people; if a\nperson is comfortable with the personal risk of their data sharing\nhabits, it does not follow that these habits are ethically benign.\nMoreover, users are still caught in the tension between their personal\nmotivations for using SNS and the profit-driven motivations of the\ncorporations that possess their data (Baym 2011, Vaidhyanathan 2018).\nJared Lanier frames the point cynically when he states that:\n“The only hope for social networking sites from a business point\nof view is for a magic formula to appear in which some method of\nviolating privacy and dignity becomes acceptable” (Lanier\n2010).\n\nScholars also note the way in which SNS architectures are often\nstructurally insensitive to the granularity of human sociality (Hull,\nLipford & Latulipe 2011). That is, such architectures tend to\ntreat human relations as if they are all of a kind, ignoring the\nprofound differences among types of social relation (familial,\nprofessional, collegial, commercial, civic, etc.). As a consequence,\nthe privacy controls of such architectures often flatten the\nvariability of privacy norms within different but overlapping social\nspheres. Among philosophical accounts of privacy, Nissenbaum’s\n(2010) view of contextual integrity has seemed to many to be\nparticularly well suited to explaining the diversity and complexity of\nprivacy expectations generated by new social media (see for example\nGrodzinsky and Tavani 2010; Capurro 2011). Contextual integrity\ndemands that our information practices respect context-sensitive\nprivacy norms, where ‘context’ refers not to the overly\ncoarse distinction between ‘private’ and\n‘public,’ but to a far richer array of social settings\ncharacterized by distinctive roles, norms and values. For example, the\nsame piece of information made ‘public’ in the context of\na status update to family and friends on Facebook may nevertheless be\nconsidered by the same discloser to be ‘private’ in other\ncontexts; that is, she may not expect that same information to be\nprovided to strangers Googling her name, or to bank employees\nexamining her credit history.\n\nOn the design side, such complexity means that attempts to produce\nmore ‘user-friendly’ privacy controls face an uphill\nchallenge—they must balance the need for simplicity and ease of\nuse with the need to better represent the rich and complex structures\nof our social universes. A key design question, then, is how SNS\nprivacy interfaces can be made more accessible and more\nsocially intuitive for users.\n\nHull et al. (2011) also take note of the apparent plasticity of user\nattitudes about privacy in SNS contexts, as evidenced by the pattern\nof widespread outrage over changed or newly disclosed privacy\npractices of SNS providers being followed by a period of accommodation\nto and acceptance of the new practices (Boyd and Hargittai 2010). In\ntheir 2018 book Re-Engineering Humanity, Brett Frischmann and\nEvan Selinger argue that SNS contribute to a slippery slope of\n“techno-social engineering creep” that produces a gradual\nnormalization of increasingly pervasive and intrusive digital\nsurveillance. A related concern is the “privacy paradox,”\nin which users’ voluntary sharing of data online belies their\nown stated values concerning privacy. However, recent data from\nApple’s introduction in iOS 14.5 of opt-in for ad tracking,\nwhich the vast majority of iOS users have declined to allow, suggests\nthat most people continue to value and act to protect their privacy,\nwhen given a straightforward choice that does not inhibit their access\nto services (Axon 2021). Working from the late writings of Foucault,\nHull (2015) has explored the way in which the\n‘self-management’ model of online privacy protection\nembodied in standard ‘notice and consent’ practices only\nreinforces a narrow neoliberal conception of privacy, and of\nourselves, as commodities for sale and exchange. The debate continues\nabout whether privacy violations can be usefully addressed by users\nmaking wiser privacy-preserving choices (Véliz 2021), or\nwhether the responsibilization of individuals only obscures the urgent\nneed for radical structural reforms of SNS business models\n(Vaidhyanathan 2018).\n\nIn an early study of online communities, Bakardjieva and Feenberg\n(2000) suggested that the rise of communities predicated on the open\nexchange of information may in fact require us to relocate our focus\nin information ethics from privacy concerns to concerns about\nalienation; that is, the exploitation of information for\npurposes not intended by the relevant community. Such considerations\ngive rise to the possibility of users deploying “guerrilla\ntactics” of misinformation, for example, by providing SNS hosts\nwith false names, addresses, birthdates, hometowns or employment\ninformation. Such tactics would aim to subvert the emergence of a new\n“digital totalitarianism” that uses the power of\ninformation rather than physical force as a political control (Capurro\n2011).\n\nFinally, privacy issues with SNS highlight a broader philosophical and\nstructural problem involving the intercultural dimensions of\ninformation ethics and the challenges for ethical pluralism in global\ndigital spaces (Ess 2021). Pak Hang Wong (2013) has argued for the\nneed for privacy norms to be contextualized in ways that do not impose\na culturally hegemonic Western understanding of why privacy matters;\nfor example, in the Confucian context, it is familial privacy rather\nthan individual privacy that is of greatest moral concern. Rafael\nCapurro (2005) has also noted the way in which narrowly Western\nconceptions of privacy occlude other legitimate ethical concerns\nregarding new media practices. For example, he notes that in addition\nto Western worries about protecting the private domain from public\nexposure, we must also take care to protect the public sphere\nfrom the excessive intrusion of the private. Though he illustrates the\npoint with a comment about intrusive uses of cell phones in public\nspaces (2005, 47), the rise of mobile social networking has amplified\nthis concern by several factors. When one must compete with Facebook\nor Twitter for the attention of not only one’s dinner companions\nand family members, but also one’s fellow drivers, pedestrians,\nstudents, moviegoers, patients and audience members, the integrity of\nthe public sphere comes to look as fragile as that of the private.\n3.2 The Ethics of Identity and Community on Social Networking Services\n\nSocial networking technologies open up a new type of ethical space in\nwhich personal identities and communities, both ‘real’ and\nvirtual, are constructed, presented, negotiated, managed and\nperformed. Accordingly, philosophers have analyzed SNS both in terms\nof their uses as Foucaultian “technologies of the self”\n(Bakardjieva and Gaden 2012) that facilitate the construction and\nperformance of personal identity, and in terms of the distinctive\nkinds of communal norms and moral practices generated by SNS (Parsell\n2008).\n\nThe ethical and metaphysical issues generated by the formation of\nvirtual identities and communities have attracted much philosophical\ninterest (see Introna 2011 and Rodogno 2012). Yet as noted by Patrick\nStokes (2012), unlike earlier forms of online community in which\nanonymity and the construction of alter-egos were typical, SNS such as\nFacebook increasingly anchor member identities and connections to\nreal, embodied selves and offline ‘real-world’ networks.\nYet SNS still enable users to directly manage their self-presentation\nand their social networks in ways that offline social spaces at home,\nschool or work often do not permit. The result, then, is an identity\ngrounded in the person’s material reality and embodiment but\nmore explicitly “reflective and aspirational” (Stokes\n2012, 365) in its presentation, a phenomenon encapsulated in social\nmedia platforms such as Instagram. This raises a number of ethical\nquestions: first, from what source of normative guidance or value does\nthe aspirational content of an SNS user’s identity primarily\nderive? Do identity performances on SNS generally represent the same\naspirations and reflect the same value profiles as users’\noffline identity performances? Do they display any notable differences\nfrom the aspirational identities of non-SNS users? Are the values and\naspirations made explicit in SNS contexts more or less heteronomous in\norigin than those expressed in non-SNS contexts? Do the more\nexplicitly aspirational identity performances on SNS encourage users\nto take steps to actually embody those aspirations offline, or do they\ntend to weaken the motivation to do so?\n\nA further SNS phenomenon of relevance here is the persistence and\ncommunal memorialization of Facebook profiles after the user’s\ndeath; not only does this reinvigorate a number of classical ethical\nquestions about our ethical duties to honor and remember the dead, it\nalso renews questions about whether our moral identities can persist\nafter our embodied identities expire, and whether the dead have\nongoing interests in their social presence or reputation (Stokes\n2012).\n\nMitch Parsell (2008) raised early concerns about the unique\ntemptations of ‘narrowcast’ social networking communities\nthat are “composed of those just like yourself, whatever your\nopinion, personality or prejudices.” (41) Such worries about\n‘echo chambers’ and ‘filter bubbles’ have only\nbecome more acute as political polarization continues to dominate\nonline culture. Among the structural affordances of SNS is a tendency\nto constrict our identities to a closed set of communal norms that\nperpetuate increased polarization, prejudice and insularity. Parsells\nadmitted that in theory the many-to-many or one-to-many\nrelations enabled by SNS allow for exposure to a greater variety of\nopinions and attitudes, but in practice they often have the\nopposite effect. Building from de Laat (2006), who suggests that\nmembers of virtual communities embrace a distinctly\nhyperactive style of communication to compensate for\ndiminished informational cues, Parsell claimed that in the absence of\nthe full range of personal identifiers evident through face-to-face\ncontact, SNS may also indirectly promote the deindividuation\nof personal identity by exaggerating and reinforcing the significance\nof singular shared traits (liberal, conservative, gay, Catholic, etc.)\nthat lead us to see ourselves and our SNS contacts more as\nrepresentatives of a group than as unique persons (2008, 46).\n\nParsell also noted the existence of inherently pernicious\nidentities and communities that may be enabled or enhanced by SNS\ntools—he cites the example of apotemnophiliacs, or would-be\namputees, who use such resources to create mutually supportive\nnetworks in which their self-destructive desires receive validation\n(2008, 48). Related concerns have been raised about\n“Pro-ANA” sites that provide mutually supportive networks\nfor anorexics seeking information and tools to allow them to\nperpetuate disordered and self-harming identities (Giles 2006;\nManders-Huits 2010).\n\nRestraint of such affordances necessarily comes at some cost to user\nautonomy—a value that in other circumstances is critical to\nrespecting the ethical demands of identity, as noted by Noemi\nManders-Huits (2010). Manders-Huits explores the tension between the\nway in which SNS treat users as profiled and forensically\nreidentifiable “objects of (algorithmic) computation”\n(2010, 52) while at the same time offering those users an attractive\nspace for ongoing identity construction. She argues that SNS\ndevelopers have a duty to protect and promote the interests of their\nusers in autonomously constructing and managing their own moral and\npractical identities. This autonomy exists in some tension with\nwidespread but still crude practices of automated SNS content\nmoderation that seek on the one hand, to preserve a ’safe’\nspace for expression, yet may disproportionately suppress marginalized\nidentities (Gillespie 2020).\n\nThe ethical concern about SNS constraints on user autonomy is also\nvoiced by Bakardjieva and Gaden (2012) who note that whether they wish\ntheir identities to be formed and used in this manner or not, the\nonline selves of SNS users are constituted by the categories\nestablished by SNS developers, and ranked and evaluated according to\nthe currency which primarily drives the narrow “moral\neconomy” of SNS communities: popularity (2012, 410). They note,\nhowever, that users are not rendered wholly powerless by this schema;\nusers retain, and many exercise, “the liberty to make informed\nchoices and negotiate the terms of their self-constitution and\ninteraction with others,” (2012, 411) whether by employing means\nto resist the “commercial imperatives” of SNS sites\n(ibid.) or by deliberately restricting the scope and extent of their\npersonal SNS practices.\n\nSNS can also enable authenticity in important ways. While a\n‘Timeline’ feature that displays my entire online personal\nhistory for all my friends to see can prompt me to ‘edit’\nmy past, it can also prompt me to face up to and assimilate into my\nself-conception thoughts and actions that might otherwise be\nconveniently forgotten. The messy collision of my family, friends and\ncoworkers on Facebook can be managed with various tools offered by the\nsite, allowing me to direct posts only to specific sub-networks that I\ndefine. But the far simpler and less time-consuming strategy is to\ncome to terms with the collision—allowing each network member to\nget a glimpse of who I am to others, while at the same time asking\nmyself whether these expanded presentations project a person that is\nmore multidimensional and interesting, or one that is manifestly\ninsincere. As Tamara Wandel and Anthony Beavers put it:\n\nI am thus no longer radically free to engage in creating a completely\nfictive self, I must become someone real, not who I really am pregiven\nfrom the start, but who I am allowed to be and what I am able to\nnegotiate in the careful dynamic between who I want to be and who my\nfriends from these multiple constituencies perceive me, allow me, and\nneed me to be. (2011, 93)\n\n\nEven so, Dean Cocking (2008) has argued that many online social\nenvironments, by amplifying active aspects of self-presentation under\nour direct control, compromise the important function of\npassive modes of embodied self-presentation beyond our\nconscious control, such as body language, facial expression, and\nspontaneous displays of emotion (130). He regards these as important\nindicators of character that play a critical role in how others see\nus, and by extension, how we come to understand ourselves through\nothers’ perceptions and reactions. If Cocking’s view is\ncorrect, then SNS that privilege text-based and asynchronous\ncommunications may hamper our ability to cultivate and express\nauthentic identities. The subsequent rise in popularity of video and\nlivestream SNS services such as YouTube, TikTok, Stream and Twitch\nmight therefore be seen as enabling of greater authenticity in\nself-presentation. Yet in reality, the algorithmic and profit\nincentives of these platforms have been seen to reward distorted\npatterns of expression: compulsive, ‘always performing’\nnorms that are reported to contribute to burnout and breakdown by\ncontent creators (Parkin 2018).\n\nEthical preoccupations with the impact of SNS on our authentic\nself-constitution and representation may be assuming a false dichotomy\nbetween online and offline identities; the informational theory of\npersonal identity offered by Luciano Floridi (2011) problematizes this\ndistinction. Soraj Hongladarom (2011) employs such an informational\nmetaphysic to deny that any clear boundary can be drawn between our\noffline selves and our selves as cultivated through SNS. Instead, our\npersonal identities online and off are taken as externally constituted\nby our informational relations to other selves, events and\nobjects.\n\nLikewise, Charles Ess makes a link between relational models of the\nself found in Aristotle, Confucius and many contemporary feminist\nthinkers and emerging notions of the networked individual as a\n“smeared-out self” (2010, 111) constituted by a shifting\nweb of embodied and informational relations. Ess points out that by\nundermining the atomic and dualistic model of the self upon which\nWestern liberal democracies are founded, this new conception of the\nself forces us to reassess traditional philosophical approaches to\nethical concerns about privacy and autonomy—and may even promote\nthe emergence of a much-needed “global information ethics”\n(2010, 112). Yet he worries that our ‘smeared-out selves’\nmay lose coherence as the relations that constitute us are\nincreasingly multiplied and scattered among a vast and expanding web\nof networked channels. Can such selves retain the capacities of\ncritical rationality required for the exercise of liberal democracy,\nor will our networked selves increasingly be characterized by\npolitical and intellectual passivity, hampered in self-governance by\n“shorter attention spans and less capacity to engage with\ncritical argument” (2010, 114)? Ess suggests that we hope for,\nand work to enable the emergence of, ‘hybrid selves’ that\ncultivate the individual moral and practical virtues needed to\nflourish within our networked and embodied relations (2010, 116).\n3.3 Friendship, Virtue and the Good Life on Social Networking Services\n\nSNS can facilitate many types of relational connections: LinkedIn\nencourages social relations organized around our professional lives,\nTwitter is useful for creating lines of communication between ordinary\nindividuals and figures of public interest, MySpace was for a time a\npopular way for musicians to promote themselves and communicate with\ntheir fans, and Facebook, which began as a way to link university\ncohorts and now connects people across the globe, also hosts business\nprofiles aimed at establishing links to existing and future customers.\nYet the overarching relational concept in the SNS universe has been,\nand continues to be, the ‘friend,’ as underscored by the\nnow-common use of this term as a verb to refer to acts of instigating\nor confirming relationships on SNS.\n\nThis appropriation and expansion of the concept ‘friend’\nby SNS has provoked a great deal of scholarly interest from\nphilosophers and social scientists, more so than any other ethical\nconcern except perhaps privacy. Early concerns about SNS friendship\ncentered on the expectation that such sites would be used primarily to\nbuild ‘virtual’ friendships between physically separated\nindividuals lacking a ‘real-world’ or\n‘face-to-face’ connection. This perception was an\nunderstandable extrapolation from earlier patterns of Internet\nsociality, patterns that had prompted philosophical worries about\nwhether online friendships could ever be ‘as good as the real\nthing’ or were doomed to be pale substitutes for embodied\n‘face to face’ connections (Cocking and Matthews 2000).\nThis view was robustly opposed by Adam Briggle (2008), who claimed\nthat online friendships might enjoy certain unique advantages. For\nexample, Briggle asserted that friendships formed online might be more\ncandid than offline ones, thanks to the sense of security provided by\nphysical distance (2008, 75). He also noted the way in which\nasynchronous written communications can promote more deliberate and\nthoughtful exchanges (2008, 77).\n\nThese sorts of questions about how online friendships measure up to\noffline ones, along with questions about whether or to what extent\nonline friendships encroach upon users’ commitments to embodied,\n‘real-world’ relations with friends, family members and\ncommunities, defined the ethical problem-space of online friendship as\nSNS began to emerge. But it did not take long for empirical studies of\nactual SNS usage trends to force a profound rethinking of this\nproblem-space. Within five years of Facebook’s launch, it was\nevident that a significant majority of SNS users were relying on these\nsites primarily to maintain and enhance relationships with those with\nwhom they also had a strong offline connection—including close\nfamily members, high-school and college friends and co-workers\n(Ellison, Steinfeld and Lampe 2007; Ito et al. 2009; Smith 2011). Nor\nare SNS used to facilitate purely online exchanges—many SNS\nusers today rely on the sites’ functionalities to organize\neverything from cocktail parties to movie nights, outings to athletic\nor cultural events, family reunions and community meetings. Mobile SNS\napplications amplify this type of functionality further, by enabling\nfriends to locate one another in their community in real-time,\nenabling spontaneous meetings at restaurants, bars and shops that\nwould otherwise happen only by coincidence.\n\nYet lingering ethical concerns remain about the way in which SNS can\ndistract users from the needs of those in their immediate physical\nsurroundings (consider the widely lamented trend of users obsessively\nchecking their social media feeds during family dinners, business\nmeetings, romantic dates and symphony performances). Such phenomena,\nwhich scholars like Sherry Turkle (2011, 2015) continue to worry are\nindicative of a growing cultural tolerance for being ‘alone\ntogether,’ bring a new complexity to earlier philosophical\nconcerns about the emergence of a zero-sum game between offline\nrelationships and their virtual SNS competitors. They have also\nprompted a shift of ethical focus away from the question of whether\nonline relationships are “real” friendships (Cocking and\nMatthews 2000), to how well the real friendships we bring to SNS are\nbeing served there (Vallor 2012). The debate over the value and\nquality of online friendships continues (Sharp 2012; Froding and\nPeterson 2012; Elder 2014; Turp 2020; Kristjánsson 2021); in\nlarge part because the typical pattern of those friendships, like most\nsocial networking phenomena, continues to evolve.\n\nSuch concerns intersect with broader philosophical questions about\nwhether and how the classical ethical ideal of ‘the good\nlife’ can be engaged in the 21st century. Pak-Hang\nWong claims that this question requires us to broaden the standard\napproach to information ethics from a narrow focus on the\n“right/the just” (2010, 29) that defines ethical action\nnegatively (e.g., in terms of violations of privacy,\ncopyright, etc.) to a framework that conceives of a positive\nethical trajectory for our technological choices; for example, the\nethical opportunity to foster compassionate and caring communities, or\nto create an environmentally sustainable economic order. Edward Spence\n(2011) further suggests that to adequately address the significance of\nSNS and related information and communication technologies for the\ngood life, we must also expand the scope of philosophical inquiry\nbeyond its present concern with narrowly interpersonal ethics to the\nmore universal ethical question of prudential wisdom. Do SNS\nand related technologies help us to cultivate the broader intellectual\nvirtue of knowing what it is to live well, and how to best pursue it?\nOr do they tend to impede its development?\n\nThis concern about prudential wisdom and the good life is part of a\ngrowing philosophical interest in using the resources of classical and\ncontemporary virtue ethics to evaluate the impact of SNS and related\ntechnologies (Vallor 2016, 2010; Wong 2012; Ess 2008). This program of\nresearch promotes inquiry into the impact of SNS not merely on the\ncultivation of prudential virtue, but on the development of a host of\nother moral and communicative virtues, such as honesty, patience,\njustice, loyalty, benevolence and empathy.\n3.4 Democracy, Freedom and Social Networking Services in the Public Sphere\n\nAs is the case with privacy, identity, community and friendship on\nSNS, ethical debates about the impact of SNS on civil discourse,\nfreedom and democracy in the public sphere must be seen as extensions\nof a broader discussion about the political implications of the\nInternet, one that predates Web 2.0 standards. Much of the literature\non this subject focuses on the question of whether the Internet\nencourages or hampers the free exercise of deliberative public reason,\nin a manner informed by Jürgen Habermas’s (1992/1998)\naccount of discourse ethics and deliberative democracy in the public\nsphere (Ess 1996 and 2005b; Dahlberg 2001; Bohman 2008). A related\ntopic of concern is SNS fragmentation of the public sphere by\nencouraging the formation of ‘echo chambers’ and\n‘filter bubbles’: informational silos for like-minded\nindividuals who deliberately shield themselves from exposure to\nalternative views. Early worries that such insularity would promote\nextremism and the reinforcement of ill-founded opinions, while also\npreventing citizens of a democracy from recognizing their shared\ninterests and experiences (Sunstein 2008), have unfortunately proven\nto be well-founded (as noted in section 2.3.2). Early optimism that\nSNS would facilitate popular revolutions resulting in the overthrow of\nauthoritarian regimes (Marturano 2011; Frick and Oberprantacher 2011)\nhave likewise given way to the darker reality that SNS are perhaps\neven more easily used as tools to popularize authoritarian and\ntotalitarian movements, or foster genocidal impulses, as in the use of\nFacebook to drive violence against the Rohingya minority in Myanmar\n(BBC 2018).\n\nWhen SNS in particular are considered in light of these questions,\nsome distinctive considerations arise. First, sites like Facebook and\nTwitter (as opposed to narrower SNS utilities such as LinkedIn)\nfacilitate the sharing of, and exposure to, an extremely diverse range\nof types of discourse. On any given day on Facebook a user\nmay encounter in her NewsFeed a link to an article in a respected\npolitical magazine followed by a video of a cat in a silly costume,\nfollowed by a link to a new scientific study, followed by a lengthy\nstatus update someone has posted about their lunch, followed by a\nphoto of a popular political figure overlaid with a clever and\nsubversive caption. Vacation photos are mixed in with political rants,\ninvitations to cultural events, birthday reminders and data-driven\ngraphs created to undermine common political, moral or economic\nbeliefs. Thus while a user has a tremendous amount of liberty to\nchoose which forms of discourse to pay closer attention to, and tools\nwith which to hide or prioritize the posts of certain members of her\nnetwork, the sheer diversity of the private and public concerns of her\nfellows would seem to offer at least some measure of protection\nagainst the extreme insularity and fragmentation of discourse that is\nincompatible with the public sphere.\n\nYet in practice, the function of hidden platform algorithms can defeat\nthis diversity. Trained on user behavior to optimize for engagement\nand other metrics that advertisers and platform companies associate\nwith their profit, these algorithms can ensure that I experience only\na pale shadow of the true diversity of my social network, seeing at\nthe top of my feed only those posts that I am most likely to find\nsubjectively rewarding to engage with. If, for example, I support the\nBlack Lives Matter movement, and tend to close the app in frustration\nand disappointment whenever I see BLM denigrated by someone I consider\na friend, the platform algorithm can easily learn this association and\noptimize my experience for one that is more conducive to retaining my\npresence. It is important to note, however, that in this case the\neffect is an interaction between the algorithm and my own behavior.\nHow much responsibility for echo chambers and resulting polarization\nor insularity falls upon users, and how much on the designers of\nalgorithms that track and amplify our expressed preferences?\n\nPhilosophers of technology often speak of the affordances or\ngradients of particular technologies in given contexts\n(Vallor 2010) insofar as they make certain patterns of use more\nattractive or convenient for users (while not rendering alternative\npatterns impossible). Thus while I can certainly seek out\nposts that will cause me discomfort or anxiety, the platform gradient\nwill not be designed to facilitate such experiences. Yet it is not\nobvious if or when it should be designed to do so. As Alexis\nElder notes (2020), civic discourse on social media can be furthered\nrather than inhibited by prudent use of tools enabling disconnection.\nAdditionally, a platform affordance that makes a violent white\nsupremacist feel accepted, valued, safe and respected in their social\nmilieu (precisely for their expressed attitudes and beliefs\nin white supremacist violence) facilitates harm to others, in a way\nthat a platform affordance that makes an autistic person or a\ntransgender woman feel accepted, valued, safe and respected for who\nthey are, does not. Fairness and equity in SNS platform design do not\nentail neutrality. Ethics explicitly demands non-neutrality\nbetween harm and nonharm, between justice and injustice. But ethics\nalso requires epistemic anchoring in reality. Thus even if my own\nattitudes and beliefs harm no one, I may still have a normative\nepistemic duty to avoid the comfort of a filter bubble. Do SNS\nplatforms have a duty to keep their algorithms from helping me into\none? In truth, those whose identities are historically marginalized\nwill rarely have the luxury of the filter bubble option; online and\noffline worlds consistently offer stark reminders of their\nmarginalization. So how do SNS designers, users, and regulators\nmitigate the deleterious political and epistemic effects of filter\nbubble phenomena without making platforms more inhospitable to\nvulnerable groups than they already are?\n\nOne must also ask whether SNS can skirt the dangers of a plebiscite\nmodel of democratic discourse, in which minority voices are dispersed\nand drowned out by the many. Certainly, compared to the\n‘one-to-many’ channels of communication favored by\ntraditional media, SNS facilitate a ‘many-to-many’ model\nof communication that appears to lower the barriers to participation\nin civic discourse for everyone, including the marginalized. However,\nSNS lack the institutional structures necessary to ensure that\nminoritized voices enjoy not only free, but substantively\nequal access to the deliberative function of the public\nsphere.\n\nWe must also consider the quality of informational exchanges on SNS\nand the extent to which they promote a genuinely dialogical\nand deliberative public sphere marked by the exercise of\ncritical rationality. SNS norms tend to privilege brevity and\nimmediate impact over substance and depth in communication; Vallor\n(2012) suggests that this bodes poorly for the cultivation of those\ncommunicative virtues essential to a flourishing public sphere. This\nworry is only reinforced by empirical data suggesting that SNS\nperpetuate the ‘Spiral of Silence’ phenomenon that results\nin the passive suppression of divergent views on matters of important\npolitical or civic concern (Hampton et. al. 2014). In a related\ncritique, Frick and Oberprantacher (2011) claim that the ability of\nSNS to facilitate public ‘sharing’ can obscure the deep\nambiguity between sharing as “a promising, active participatory\nprocess” and “interpassive, disjointed acts of having\ntrivia shared.” (2011, 22)\n\nThere remains a notable gap online between the prevalence of\ndemocratic discourse and debate—which require only the open\nvoicing of opinions and reasons, respectively—and the relative\nabsence of democratic deliberation, which requires the joint\nexercise of collective intentions, cooperation and compromise as well\nas a shared sense of reality on which to act. The greatest moral\nchallenges of our time—responding to the climate change crisis,\ndeveloping sustainable patterns of economic and social life, managing\nglobal threats to public health—aren’t going to be solved\nby ideological warfare but by deliberative, coordinated exercise of\npublic wisdom. Today’s social media platforms are great for\ncultivating the former; for the latter, not so much.\n\nAnother vital issue for online democracy relates to the contentious\ndebate emerging on social media platforms about the extent to which\ncontroversial or unpopular speech ought to be tolerated or punished by\nprivate actors, especially when the consequences manifest in\ntraditional offline contexts and spaces such as the university. For\nexample, the norms of academic freedom in the U.S. were greatly\ndestabilized by the ‘Salaita Affair’ (in which a tenured\njob offer by the University of Illinois at Urbana-Champaign to Steven\nSalaita was withdrawn on the basis of his tweets criticizing Israel)\nand several other cases in which academics were censured or otherwise\npunished by their institutions as a result of their controversial\nsocial media posts (Protevi 2018). Yet how should we treat a post by a\nprofessor that expresses a desire to sleep with their students, or\nthat expresses their doubts about the intelligence of women, or the\nintegrity of students of a particular nationality? It remains to be\nseen what equilibrium can be found between moral accountability and\nfree expression in communities increasingly mediated by SNS\ncommunications. A related debate concerns the ethical and social value\nof the kind of social media acts of moral policing frequently derided\nas insincere or performative ‘virtue signaling.’ To what\nextent are social media platforms a viable stage for moral\nperformances, and are such performances merely performative?\nAre they inherently ‘grandstanding’ abuses of moral\ndiscourse (Tosi and Warmke 2020), or can they in fact be positive\nforces for social progress and reform (Levy 2020, Westra 2021)?\n\nIt also remains to be seen to what extent civic discourse and activism\non SNS will continue to be manipulated or compromised by the\ncommercial interests that currently own and manage the technical\ninfrastructure. This concern is driven by the growing economic and\npolitical influence of companies in the technology sector, what\nLuciano Floridi (2015b) calls ‘grey power,’ and the\npotentially disenfranchising and disempowering effects of an economic\nmodel in which most users play a passive role (Floridi 2015a). Indeed,\nthe relationship between social media users and service providers has\nbecome increasingly contentious, as users struggle to demand more\nprivacy, better data security and more effective protections from\nonline harassment in an economic context where they have little or no\ndirect bargaining power (Zuboff 2019).\n\nThis imbalance was powerfully illustrated by the revelation in 2014\nthat Facebook researchers had quietly conducted psychological\nexperiments on users without their knowledge, manipulating their moods\nby altering the balance of positive or negative items in their News\nFeeds (Goel 2014). The study added yet another dimension to existing\nconcerns about the ethics and validity of social science research that\nrelies on SNS-generated data (Buchanan and Zimmer 2012), concerns that\ndrive an increasingly vital and contested area of research ethics\n(Woodfield 2018, franzke et al. 2020).\n\nIronically, in the power struggle between users and SNS providers,\nsocial networking platforms themselves have become the primary\nbattlefield, where users vent their collective outrage in an attempt\nto force service providers into responding to their demands. The\nresults are sometimes positive, as when Twitter users, after years of\ncomplaining, finally shamed the company in 2015 into providing better\nreporting tools for online harassment. Yet by its nature the process\nis chaotic and often controversial, as when later that year, Reddit\nusers successfully demanded the ouster of CEO Ellen Pao, under whose\nleadership Reddit had banned some of its more repugnant\n‘subreddit’ forums (such as “Fat People\nHate”).\n\nThe only clear consensus emerging from the considerations outlined\nhere is that if SNS are going to facilitate any enhancement of a\nHabermasian public sphere, or the civic virtues and praxes of reasoned\ndiscourse that any functioning public sphere must presuppose, then\nusers will have to actively mobilize themselves to exploit such an\nopportunity (Frick and Oberprantacher 2011). Such mobilization may\ndepend upon resisting the “false sense of activity and\naccomplishment” (Bar-Tura, 2010, 239) that may come from merely\nclicking ‘Like’ in response to acts of meaningful\npolitical speech, forwarding calls to sign petitions, or simply\n‘following’ an outspoken social critic on Twitter whose\n‘tweeted’ calls to action are drowned in a tide of\ncorporate announcements, celebrity product endorsements and personal\ncommentaries. Some argue that it will also require the cultivation of\nnew norms and virtues of online civic-mindedness, without which online\n‘democracies’ will continue to be subject to the\nself-destructive and irrational tyrannies of mob behavior (Ess\n2010).\n3.5 Social Networking Services and Cybercrime\n\nSNS are hosts for a broad spectrum of ‘cybercrimes’ and\nrelated direct harms, including but not limited to:\ncyberbullying/cyberharassment, cyberstalking, child exploitation,\ncyberextortion, cyberfraud, illegal surveillance, identity theft,\nintellectual property/copyright violations, cyberespionage,\ncybersabotage and cyberterrorism. Each of these forms of criminal or\nantisocial behavior has a history that well pre-dates Web 2.0\nstandards, and philosophers have tended to leave the specific\ncorrelations between cybercrime and SNS as an empirical matter for\nsocial scientists, law enforcement and Internet security firms to\ninvestigate. Nevertheless, cybercrime is an enduring topic of\nphilosophical interest for the broader field of computer ethics, and\nthe migration to and evolution of such crime on SNS platforms raises\nnew and distinctive ethical issues.\n\nAmong those of great ethical importance is the question of how SNS\nproviders ought to respond to government demands for user data for\ninvestigative or counterterrorism purposes. SNS providers are caught\nbetween the public interest in crime prevention and their need to\npreserve the trust and loyalty of their users, many of whom view\ngovernments as overreaching in their attempts to secure records of\nonline activity. Many companies have opted to favor user security by\nemploying end-to-end encryption of SNS exchanges, much to the chagrin\nof government agencies who insist upon ‘backdoor’ access\nto user data in the interests of public safety and national\nsecurity.\n\nA related feature of SNS abuse and cybercrime is the associated\nskyrocketing need for content moderation at scale by these platforms.\nBecause automated tools for content moderation remain crude and easily\ngamed, social media platforms rely on large human workforces working\nfor low wages, who must manually screen countless images of horrific\nviolence and abuse, often suffering grave and lasting psychological\nharm as a result (Roberts 2019). It is unclear how such harms to the\ncontent moderating workforce can be morally justified, even if they\nhelp to prevent the spread of such harm to others. The arrangement has\nuncomfortable echoes of Ursula LeGuin’s The Ones Who Walk\nAway From Omelas; so should platform users be the ones walking\naway? Or do platforms have an ethical duty to find a morally\npermissible solution, even if it endangers their business model?\n\nAnother emerging ethical concern is the increasingly political\ncharacter of cyberharassment and cyberstalking. In the U.S., women who\nspoke out about the lack of diversity in the tech and videogame\nindustries were early targets during online controversies such as\n2014’s ‘Gamergate’ (Salter 2017), during which some\nvictims were forced to cancel speaking appearances or leave their\nhomes due to physical threats after their addresses and other personal\ninfo were posted on social media (a practice known as\n‘doxing’ or ‘doxxing’). More recently,\njournalists have been doxed and subjected to violent threats,\nsometimes following accusations that their reporting itself\nconstituted doxing (Wilson 2018).\n\nDoxing presents complex ethical challenges (Douglas 2016). For victims\nof doxing and associated cyberthreats, traditional law enforcement\nbodies offer scant protection, as these agencies are often\nill-equipped to police the blurry boundary between online and physical\nharms. But moreover, it’s not always clear what distinguishes\nimmoral doxing from justified social opprobrium. If someone records a\nwoman spitting racial epithets in a passerby’s face, or a man\ndenying a disabled person service in a restaurant, and the victim or\nan observer posts the video online in a manner that allows the\nperpetrator to be identified by others in their social network, is\nthat unethical shaming or just deserts? What’s the difference\nbetween posting someone’s home address, allowing them and their\nfamily to be terrorized by a mob, and posting someone’s\nworkplace so that their employer can consider their conduct? Cases\nsuch as these get adjudicated by ad hoc social media juries\nweekly. Sometimes legal consequences do follow, as in the case of the\nnotorious Amy Cooper, who in 2020 was charged with filing a false\npolice report after being filmed by a Black man who she falsely\naccused of threatening her in Central Park. Are doxing and other modes\nof social media shaming legitimate tools of justice? Or are they\nindications of the dangers of unregulated moral policing? And if the\nanswer is ‘both,’ or ‘it depends,’ then what\nare the key moral distinctions that allow us to respond appropriately\nto this new practice?\n4. Social Networking Services and Metaethical Issues\n\nA host of metaethical questions are raised by the rapid emergence of\nSNS. For example, SNS lend new data to an earlier philosophical debate\n(Tavani 2005; Moor 2008) about whether classical ethical traditions\nsuch as utilitarianism, Kantian ethics or virtue ethics possess\nsufficient resources for illuminating the implications of emerging\n information technology for moral values,\n or whether we require a new ethical framework to handle such\nphenomena. Charles Ess (2006, 2021) has suggested that a new,\npluralistic “global information ethics” may be the\nappropriate context from which to view novel information technologies.\nOther scholars have suggested that technologies such as SNS invite\nrenewed attention to existing ethical approaches such as\n pragmatism\n (van den Eede 2010),\n virtue ethics\n (Vallor 2016)\n feminist or care ethics\n (Hamington 2010; Puotinen 2011) that have often been neglected by\napplied ethicists in favor of conventional utilitarian and\ndeontological resources.\n\nA related metaethical project relevant to SNS is the development of an\nexplicitly intercultural information ethics (Ess 2005a;\nCapurro 2008; Honglaradom and Britz 2010). SNS and other emerging\ninformation technologies do not reliably confine themselves to\nnational or cultural boundaries, and this creates a particular\nchallenge for applied ethicists. For example, SNS practices in\ndifferent countries must be analyzed against a conceptual background\nthat recognizes and accommodates complex differences in moral norms\nand practices (Capurro 2005; Hongladarom 2007, Wong 2013). SNS\nphenomena that one might expect to benefit from intercultural analysis\ninclude: varied cultural patterns and preference/tolerance for\naffective display, argument and debate, personal exposure, expressions\nof political, interfamilial or cultural criticism, religious\nexpression and sharing of intellectual property. Alternatively, the\nvery possibility of a coherent information ethics may come under\nchallenge, for example, from a\n constructivist\n view that emerging socio-technological practices like SNS continually\nredefine ethical norms—such that our analyses of SNS\nand related technologies are not only doomed to operate from shifting\nground, but from ground that is being shifted by the intended\nobject of our ethical analysis.\n\nFinally, there are pressing practical concerns about whether and how\nphilosophers can actually have an impact on the ethical profile of\nemerging technologies such as SNS. If philosophers direct their\nethical analyses only to other philosophers, then such analyses may\nfunction simply as ethical postmortems of human-technology relations,\nwith no opportunity to actually pre-empt, reform or redirect unethical\ntechnological practices. But to whom else can, or should, these\nethical concerns be directed: SNS users? Regulatory bodies and\npolitical institutions? SNS software developers? How can the\ntheoretical content and practical import of these analyses be made\naccessible to these varied audiences? What motivating force are they\nlikely to have?\n\nThese questions have become particularly acute of late with the\ncontroversy over alleged corporate capture by technology companies of\nthe language of ethics, and associated charges of\n‘ethics-washing’ (Green 2021 [Other Internet Resources],\nBietti 2020). Some argue that ethics is the wrong tool to fight the\nharms of emerging technologies and large technology platforms (Hao\n2021); yet alternative proposals to focus on justice, rights, harms,\nequity or the legitimate use of power unwittingly fall right back\nwithin the normative scope of ethics. Unless we resort to a cynical\nframe of ‘might makes right,’ there is no escaping the\nneed to use ethics to distinguish the relationships with\nsociotechnical phenomena and powers that we regard as permissible,\ngood, or right, from those that should be resisted and dismantled.\n\nThe profound urgency of this task becomes apparent once we recognize\nthat unlike those ‘life or death’ ethical dilemmas with\nwhich many applied ethicists are understandably often preoccupied\n(e.g., abortion, euthanasia and capital punishment), emerging\ninformation technologies such as SNS have in a very short time worked\nthemselves into the daily moral fabric of virtually all of our lives,\ntransforming the social landscape and the moral habits and\npractices with which we navigate it. The ethical concerns illuminated\nhere are, in a very real sense, anything but ‘academic,’\nand neither philosophers nor the broader human community can afford\nthe luxury of treating them as such.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Axon, S. 2021, “96% of US Users Opt-Out of App Tracking in\niOS 14.5, Analytics Find,” <em>Ars Technica</em>, May 7, 2021.\n [<a href=\"https://arstechnica.com/gadgets/2021/05/96-of-us-users-opt-out-of-app-tracking-in-ios-14-5-analytics-find/\" target=\"other\">Axion 2021 available online</a>]",
                "Bakardjieva, M. and A. Feenberg, 2000, “Involving the\nVirtual Subject,” <em>Ethics and Information Technology</em>,\n2(4): 233–240.",
                "Bakardjieva, M. and G. Gaden, 2012, “Web 2.0 Technologies\nof the Self,” <em>Philosophy and Technology</em>, 25(3):\n399–413.",
                "Bar-Tura, A., 2010, “Wall-to-Wall or Face-to-Face,” in\n<em>Facebook and Philosophy</em>, D.E. Wittkower (ed.), Chicago: Open\nCourt, pp. 231–239.",
                "Barnes, S.B., 2001, <em>Online Connections: Internet Interpersonal\nRelationship</em>s, Cresskill, NJ: Hampton Press.",
                "Baym, N.K., 2011, “Social Networks 2.0,” in <em>The\nHandbook of Internet Studies</em>, M. Consalvo and C. Ess (eds.),\nOxford: Wiley-Blackwell, pp. 384-405.",
                "Benjamin, R., 2019, <em>Race After Technology: Abolitionist Tools\nfor the New Jim Code</em>, New York: Polity.",
                "BBC, 2018, “Facebook Admits it was Used to ‘Incite\nOffline Violence’ in Myanmar,” November 6, 2018.\n [<a href=\"https://www.bbc.co.uk/news/world-asia-46105934\" target=\"other\">available online</a>]",
                "Bietti, E., 2020, “From Ethics Washing to Ethics Bashing: A\nView on Tech Ethics From Within Moral Philosophy,”\n<em>Proceedings of the 2020 Conference on Fairness, Accountability and\nTransparency</em>, New York: Association for Computing Machinery, pp.\n210–219.",
                "Bohman, J., 2008, “The Transformation of the Public Sphere:\nPolitical Authority, Communicative Freedom and Internet\nPublics,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge UK:\nCambridge University Press, pp. 66–92.",
                "Borgmann, A., 1984, <em>Technology and the Character of\nContemporary Life</em>, Chicago: University of Chicago Press.",
                "–––, 1992, <em>Crossing the Postmodern\nDivide</em>, Chicago: University of Chicago Press.",
                "Boyd, D., 2007, “Why Youth (Heart) Social Networking Sites:\nThe Role of Networked Publics in Teenage Social Life,” in\n<em>Youth, Identity and Social Media</em>, D. Buckingham (Ed.),\nCambridge MA: MIT Press, pp. 119–142.",
                "Boyd, D. and E. Hargittai, 2010, “Facebook Privacy\nSettings: Who Cares?” <em>First Monday</em>, 15(8):\n13–20.",
                "Briggle, A., 2008, “Real Friends: How the Internet can\nFoster Friendship,” <em>Ethics and Information Technology</em>,\n10(1): 71–79.",
                "Buchanan, E.A. and M. Zimmer, 2012, “Internet Research\nEthics,” <em>The Stanford Encyclopedia of Philosophy</em>\n(Spring 2015 Edition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/\">https://plato.stanford.edu/archives/spr2015/entries/ethics-internet-research/</a>&gt;",
                "Bynum, T., 2011, “Computer and Information Ethics,”\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2011\nEdition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/\">https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/</a>&gt;",
                "Capurro, R., 2005, “Privacy. An Intercultural\nPerspective,” <em>Ethics and Information Technology</em>, 7(1):\n37–47.",
                "–––, 2008, “Intercultural Information\nEthics,” in <em>Handbook of Information and Computer\nEthics</em>, K.E. Himma and H.T. Tavani (eds.), Hoboken, NJ: Wiley and\nSons, pp. 639–665.",
                "–––, 2011, “Never Enter Your Real\nData,” <em>International Review of Information Ethics</em>, 16:\n74–78.",
                "Cocking, D., 2008, “Plural Selves and Relational\nIdentity,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge UK:\nCambridge University Press, pp. 123–141.",
                "Cocking, D. and S. Matthews, 2000, “Unreal Friends,”\n<em>Ethics and Information Technology</em>, 2(4): 223–231.",
                "Consalvo, M. and C. Ess, 2011, <em>The Handbook of Internet\nStudies</em>, Oxford: Wiley-Blackwell.",
                "Dahlberg, L., 2001, “The Internet and Democratic Discourse:\nExploring the Prospects of Online Deliberative Forums Extending the\nPublic Sphere,” <em>Information, Communication and Society</em>,\n4(4): 615–633.",
                "de Laat, P. 2006, “Trusting Virtual Trust,” <em>Ethics\nand Information Technology</em>, 7(3): 167–180.",
                "Dreyfus, H., 2001, <em>On the Internet</em>, New York:\nRoutledge.",
                "–––, 2004, “Nihilism on the Information\nHighway: Anonymity versus Commitment in the Present Age,” in\n<em>Community in the Digital Age: Philosophy and Practice</em>, A.\nFeenberg and D. Barney (eds.), Lanham, MD: Rowman &amp; Littlefield,\npp. 69–81.",
                "Douglas, D.M., 2016, “Doxing: A Conceptual Analysis.”\n<em>Ethics and Information Technology</em>, 18: 199–210.",
                "Elder, A., 2014, “Excellent Online Friendships: An\nAristotelian Defense of Social Media,” <em>Ethics and\nInformation Technology</em>, 16(4): 287–297.",
                "–––, 2020, “The Interpersonal is\nPolitical: Unfriending to Promote Civic Discourse on Social\nMedia,” <em>Ethics and Information Technology</em>, 22:\n15–24.",
                "Elgesem, D., 1996, “Privacy, Respect for Persons, and\nRisk,” in <em>Philosophical Perspectives on Computer-Mediated\nCommunication</em>, C. Ess (ed.), Albany, NY: SUNY Press, pp.\n45–66.",
                "Ellison, N.B., C. Steinfeld, and C. Lampe, 2007, “The\nBenefits of Facebook ‘Friends’: Social Capital and College\nStudents’ Use of Online Social Network Sites,” <em>Journal\nof Computer-Mediated Communication</em>, 12(4): article 1.",
                "Ess, C., 1996, “The Political Computer: Democracy, CMC and\nHabermas,” in <em>Philosophical Perspectives on\nComputer-Mediated Communication</em>, (C. Ess, ed.), Albany, NY: SUNY\nPress, pp. 197–230.",
                "–––, 2005a, “Lost in Translation?\nIntercultural Dialogues on Privacy and Information Ethics,”\n<em>Ethics and Information Technology</em>, 7(1): 1–6.",
                "–––, 2005b, “Moral Imperatives for Life in\nan Intercultural Global Village,” in <em>The Impact of the\nInternet on our Moral Lives</em>, R.J. Cavalier (ed.), Albany NY: SUNY\nPress, pp. 161–193.",
                "–––, 2006, “Ethical Pluralism and Global\nInformation Ethics,” <em>Ethics and Information Technology</em>,\n8(4): 215–226.",
                "–––, 2010, “The Embodied Self in a Digital\nAge: Possibilities, Risks and Prospects for a Pluralistic\n(democratic/liberal) Future?” <em>Nordicom Information</em>,\n32(2): 105–118.",
                "–––, 2011, “Self, Community and Ethics in\nDigital Mediatized Worlds,” in <em>Trust and Virtual Worlds:\nContemporary Perspectives</em>, C. Ess and M. Thorseth (eds.), Oxford:\nPeter Lang, pp. vii–xxix.",
                "–––, 2021, “Interpretative Pros Hen\nPluralism: from computer-mediated colonization to a pluralistic\nintercultural digital ethics,” <em>Philosophy and\nTechnology</em>, 33(4): 551–569.",
                "Feenberg, A., 1999, <em>Questioning Technology</em>, New York:\nRoutledge.",
                "Floridi, L., 2011, “The Informational Nature of Personal\nIdentity,” <em>Minds and Machines</em>, 21(4):\n549–566.",
                "–––, 2015a, “Free Online Services:\nEnabling, Disenfranchising, Disempowering,” <em>Philosophy and\nTechnology</em>, 28: 163–166.",
                "–––, 2015b, “The New Grey Power,”\n<em>Philosophy and Technology</em>, 28: 329–332.",
                "franzke, a. s., A. Bechmann, M. Zimmer, C. Ess, and the\nAssociation of Internet Researchers, 2020, <em>Internet Research:\nEthical Guidelines 3.0</em>, Association of Internet Researchers.\n [<a href=\"https://aoir.org/reports/ethics3.pdf\" target=\"other\">franzke, et al. 2020 available online</a>]",
                "Frick, M. and A. Oberprantacher, 2011, “Shared is Not Yet\nSharing, Or: What Makes Social Networking Services Public?”\n<em>International Review of Information Ethics</em>, 15:\n18–23.",
                "Frischmann, B. and E. Selinger, 2018, <em>Re-Engineering\nHumanity</em>, Cambridge: Cambridge University Press.",
                "Froding, B. and Peterson, M., 2012, “Why Virtual Friendship\nis No Genuine Friendship,” <em>Ethics and Information\nTechnology</em>, 14(3): 201–207.",
                "Giles, D., 2006, “Constructing Identities in Cyberspace: The\nCase of Eating Disorders,” <em>British Journal of Social\nPsychology</em>, 45: 463–477.",
                "Gillespie, T., 2020, “Content Moderation, AI, and the\nQuestion of Scale,” <em>Big Data and Society</em>, 7(2).\n [<a href=\"https://journals.sagepub.com/doi/full/10.1177/2053951720943234\" target=\"other\">Gillespie 2020 available online</a>]",
                "Goel, V., 2014, “Facebook Tinkers with Users’ Emotions\nin News Feed Experiment, Stirring Outcry,” <em>The New York\nTimes</em> (Technology section), June 29, 2014.\n [<a href=\"https://www.nytimes.com/2014/06/30/technology/facebook-tinkers-with-users-emotions-in-news-feed-experiment-stirring-outcry.html?searchResultPosition=1\" target=\"other\">Goel 2014 available online</a>]",
                "Grodzinsky, F.S. and H.T. Tavani, 2010, “Applying the\n‘Contextual Integrity’ Model of Privacy to Personal Blogs\nin the Blogosphere,” <em>International Journal of Internet\nResearch Ethic</em>s, 3(1): 38–47.",
                "Habermas, J., 1992/1998, <em>Between Facts and Norms:\nContributions to a Discourse Theory of Law and Democracy</em>,\nCambridge, MA: MIT Press.",
                "Hamington, M., 2010, “Care Ethics, Friendship and\nFacebook,” in <em>Facebook and Philosophy</em>, D.E. Wittkower\n(ed.), Chicago: Open Court, pp. 135–145.",
                "Hampton, K., L. Rainie, W. Lu, M. Dwyer, I. Shin, and K. Purcell,\n2014, “Social Media and the ‘Spiral of\nSilence’,” Pew Research Center, Published August 26, 2014,\navailable online.",
                "Hao, K. 2021. “Stop Talking About AI Ethics. It’s Time\nto Talk About Power,” <em>MIT Technology Review</em>, April 23,\n2021.\n [<a href=\"https://www.technologyreview.com/2021/04/23/1023549/kate-crawford-atlas-of-ai-review/\" target=\"other\">Hao 2021 available online</a>]",
                "Heidegger, M., 1954 [1977], <em>The Question Concerning Technology\nand Other Essays</em>, New York: Harper and Row.",
                "Honglaradom, S., 2007, “Analysis and Justification of\nPrivacy from a Buddhist Perspective,” in S. Hongladarom and C.\nEss (eds.), <em>Information Technology Ethics: Cultural\nPerspectives</em>, Hershey, PA: Idea Group, pp. 108–122.",
                "–––, 2011, “Personal Identity and the Self\nin the Online and Offline World,” <em>Minds and Machines</em>,\n21(4): 533–548.",
                "Hongladarom, S. and J. Britz, 2010, “Intercultural\nInformation Ethics,” <em>International Review of Information\nEthics</em>, 13: 2–5.",
                "Hull, G., 2015, “Successful Failure: What Foucault Can Teach\nUs about Privacy Self-Management in a World of Facebook and Big\nData,” <em>Ethics and Information Technology</em>, online.\ndoi:10.1007/s10676-015-9363-z",
                "Hull, G., H.R. Lipford, and C. Latulipe, 2011, “Contextual\nGaps: Privacy Issues on Facebook,” <em>Ethics and Information\nTechnology</em>, 13(4): 289–302.",
                "Introna, L., 2011, “Phenomenological Approaches to Ethics\nand Information Technology,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2011 Edition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/sum2011/entries/ethics-it-phenomenology/\">https://plato.stanford.edu/archives/sum2011/entries/ethics-it-phenomenology/</a>&gt;",
                "Ito, M., et al., 2009, <em>Hanging Out, Messing Around, Geeking\nOut: Living and Learning with New Medi</em>a, Cambridge, MA: MIT\nPress.",
                "Johnson, Deborah G., 1985, <em>Computer Ethics, </em>Englewood\nCliffs, NJ: Prentice Hall.",
                "Kidd, I.J., H. Battaly, and Q. Cassam, 2020, <em>Vice\nEpistemology</em>, New York : Routledge.",
                "Kristjánsson, K., 2021, “Online Aristotelian\nCharacter Friendship as an Augmented Form of Penpalship,”\n<em>Philosophy and Technology</em>, 34: 289–307.",
                "Lanier, J. 2010, <em>You Are Not a Gadget: A Manifesto</em>, New\nYork: Knopf.",
                "Levy, N., 2020, “Virtue Signaling Is Virtuous,”\n<em>Synthese</em>, published online 16 April 2020.\ndoi:10.1007/s11229-020-02653-9",
                "Manders-Huits, N., 2010, “Practical versus Moral Identities\nin Identity Management,” <em>Ethics and Information\nTechnolog</em>y, 12(1): 43–55.",
                "Marin, L., 2021, “Sharing (Mis)information on Social\nNetworking Sites: An Exploration of the Norms for Distributing Content\nAuthored by Others,” <em>Ethics and Information Technology</em>,\npublished online 02 February 2021. doi:10.1007/s10676-021-09578-y",
                "Marturano, A., 2011, “The Ethics of Online Social\nNetworks—An Introduction,” <em>International Review of\nInformation Ethics</em>, 16: 3–5.",
                "Miller, M.E., 2021, “Pizzagate’s Violent\nLegacy,” <em>The Washington Post</em>, February 16, 2021.\n [<a href=\"https://www.washingtonpost.com/dc-md-va/2021/02/16/pizzagate-qanon-capitol-attack/\" target=\"other\">Miller 2021 available online</a>]",
                "Moor, J., 1985, “What is Computer Ethics?”\n<em>Metaphilosophy</em>, 16(4): 266–275.",
                "–––, 2008, “Why We Need Better Ethics for\nEmerging Technologies,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge:\nUK: Cambridge University Press, pp. 26–39.",
                "Nissenbaum, M., 2004, “Privacy as Contextual\nIntegrity,” <em>Washington Law Review</em>, 79(1):\n119–157.",
                "–––, 2010, Privacy in Context: <em>Technology,\nPolicy, and the Integrity of Social Life</em>, Palo Alto, CA: Stanford\nUniversity Press.",
                "Parkin, S., 2018, “The YouTube Stars Heading for Burnout:\n‘The Most Fun Job Imaginable Became Deeply Bleak’”,\n<em>The Guardian</em>, September 8, 2018.\n [<a href=\"https://www.theguardian.com/technology/2018/sep/08/youtube-stars-burnout-fun-bleak-stressed\" target=\"other\">Parkin 2018 available online</a>]",
                "Parsell, M., 2008, “Pernicious Virtual Communities:\nIdentity, Polarisation and the Web 2.0,” <em>Ethics and\nInformation Technology</em>, 10(1): 41–56.",
                "Protevi, J., 2018. “Realpolitik and Academic Freedom,”\nin <em>Academic Freedom</em>, J. Lackey (ed.), Oxford: Oxford\nUniversity Press, pp. 85–101.",
                "Puotinen, S., 2011, “Twitter Cares? Using Twitter to Care\nAbout, Care for and Care With Women Who Have Had Abortions,”\n<em>International Review of Information Ethics</em>, 16:\n79–84.",
                "Rini, R., 2017, “Fake News and Partisan Epistemology,”\n<em>Kennedy Institute of Ethics Journal</em>,\n [<a href=\"https://kiej.georgetown.edu/fake-news-partisan-epistemology/\" target=\"other\">Rini 2017 available online</a>]",
                "Roberts, S.T., 2019, <em>Behind the Screen: Content Moderation in\nthe Shadows of Social Media</em>, New Haven: Yale University\nPress.",
                "Rodogno, R., 2012, “Personal Identity Online,”\n<em>Philosophy and Technology</em>, 25(3): 309–328.",
                "Salter, M., 2017, <em>Crime, Justice and Social Media</em>, New\nYork: Routledge.",
                "Sharp, R., 2012, “The Obstacles Against Reaching the Highest\nLevel of Aristotelian Friendship Online,” <em>Ethics and\nInformation Technolog</em>y, 14(3): 231–239.",
                "Smith, A., 2011, “Why Americans Use Social Media,” Pew\nResearch Center, 15 November 2011,\n [<a href=\"https://www.pewresearch.org/internet/2011/11/15/why-americans-use-social-media/\" target=\"other\">Smith 2011 available online</a>].",
                "Spinello, R.A., 2011, “Privacy and Social Networking\nTechnology,” <em>International Review of Information\nEthics</em>, 16: 41–46.",
                "Stark, L. and A.L. Hoffmann, 2019, “Data is the New What?\nPopular Metaphors and Professional Ethics in Emerging Data\nCultures.” <em>Journal of Cultural Analytics</em>, 1(1), May 2,\n2019.\n [<a href=\"https://culturalanalytics.org/article/11052-data-is-the-new-what-popular-metaphors-amp-professional-ethics-in-emerging-data-culture\" target=\"other\">Stark and Hoffman 2019 available online</a>]",
                "Stokes, P., 2012, “Ghosts in the Machine: Do the Dead Live\non in Facebook?,” <em>Philosophy and Technology</em>, 25(3):\n363–379.",
                "Sunstein, C., 2008, “Democracy and the Internet,” in\n<em>Information Technology and Moral Philosophy</em>, J. van den Hoven\nand J. Weckert (eds.), Cambridge UK: Cambridge University Press, pp.\n93–110.",
                "Tavani, H.T., 2005, “The Impact of the Internet on our Moral\nCondition: Do we Need a New Framework of Ethics?” in <em>The\nImpact of the Internet on our Moral Lives</em>, R.J. Cavalier (ed.),\nAlbany, NY: SUNY Press, pp. 215–237.",
                "–––, 2007, “Philosophical Theories of\nPrivacy: Implications for an Adequate Online Privacy Policy,”\n<em>Metaphilosophy</em>, 38(1): 1–22.",
                "Tosi, J. and B. Warmke, 2020, <em>Grandstanding: The Use and\nAbuse of Moral Talk</em>, New York: Oxford University Press.",
                "Turkle, S., 1995, <em>Life on the Screen: Identity in the Age of\nthe Internet</em>, New York: Simon and Schuster.",
                "–––, 2011, <em>Alone Together: Why we Expect\nMore from Technology and Less from Each Other</em>, New York: Basic\nBooks.",
                "–––, 2015, <em>Reclaiming Conversation: The\nPower of Talk in a Digital Age</em>, New York: Penguin Press.",
                "Turp, M.-J. 2020., “Social Media, Interpersonal Relations\nand the Objective Attitude,” <em>Ethics and Information\nTechnology</em>, 22: 269–279.",
                "Vaidhyanathan, S., 2018, <em>Antisocial Media</em><em>: How\nFacebook Disconnects Us and Undermines Democracy</em>, New York:\nOxford University Press.",
                "Vallor, S., 2010, “Social Networking Technology and the\nVirtues,” <em>Ethics and Information Technology</em>, 12 (2):\n157–170.",
                "–––, 2012, “Flourishing on Facebook:\nVirtue Friendship and New Social Media,” <em>Ethics and\nInformation Technology</em>, 14(3): 185–199.",
                "–––, 2016, <em>Technology and the Virtues: A\nPhilosophical Guide to a Future Worth Wanting</em>. New York: Oxford\nUniversity Press.",
                "van den Eede, Y., 2010, “‘Conversation of\nMankind’ or ‘Idle Talk’?: A Pragmatist Approach to\nSocial Networking Sites,” <em>Ethics and Information\nTechnology</em>, 12(2): 195–206.",
                "Véliz, C., 2021, <em>Privacy is Power</em>, New York:\nPenguin Press.",
                "Verbeek, P., 2005, <em>What Things Do: Philosophical Reflections\non Technology, Agency and Design</em>, University Park, PA:\nPennsylvania State University Press.",
                "Wagner, B., 2021. “Fact Check: Hilary Clinton was not Hanged\nat Guantanamo Bay,” <em>USA Today</em>, June 17 2021.\n [<a href=\"https://eu.usatoday.com/story/news/factcheck/2021/06/17/fact-check-hillary-clinton-not-hanged-guantanamo-bay/7687922002/\" target=\"other\">Wagner 2021 available online</a>]",
                "Wandel, T. and A. Beavers, 2011, “Playing Around with\nIdentity,” in <em>Facebook and Philosoph</em>y, D.E. Wittkower\n(ed.), Chicago: Open Court, pp. 89–96.",
                "Westra, E., 2021, “Virtue Signaling and Moral\nProgress,” <em>Philosophy and Public Affairs</em>, 49(2).\n [<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/papa.12187\" target=\"other\">Westra 2021 available online</a>]",
                "Wilson, J., 2018, “Doxxing, assault, death threats: the new\ndangers facing US journalists covering extremism,” <em>The\nGuardian</em>, June 14, 2018.\n [<a href=\"https://www.theguardian.com/world/2018/jun/14/doxxing-assault-death-threats-the-new-dangers-facing-us-journalists-covering-extremism\" target=\"other\">Wilson 2018 available online</a>]",
                "Wong, P.H., 2010, “The Good Life in Intercultural\nInformation Ethics: A New Agenda,” <em>International Review of\nInformation Ethics</em>, 13: 26–32.",
                "–––, 2012, “Dao, Harmony and Personhood:\nTowards a Confucian Ethics of Technology,” <em>Philosophy and\nTechnology</em>, 25(1): 67–86.",
                "–––, 2013, “Confucian Social Media: An\nOxymoron?” <em>Dao</em>, 12: 283–296.",
                "Woodfield, K. (ed.), 2018, <em>The Ethics of Online Research</em>,\nBingley, UK: Emerald Publishing.",
                "Zuboff, S., 2019, <em>The Age of Surveillance Capitalism: The\nFight for A Human Future at the New Frontier of Power</em>, New York:\nPublic Affairs."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Axon, S. 2021, “96% of US Users Opt-Out of App Tracking in\niOS 14.5, Analytics Find,” <em>Ars Technica</em>, May 7, 2021.\n [<a href=\"https://arstechnica.com/gadgets/2021/05/96-of-us-users-opt-out-of-app-tracking-in-ios-14-5-analytics-find/\" target=\"other\">Axion 2021 available online</a>]</li>\n<li>Bakardjieva, M. and A. Feenberg, 2000, “Involving the\nVirtual Subject,” <em>Ethics and Information Technology</em>,\n2(4): 233–240.</li>\n<li>Bakardjieva, M. and G. Gaden, 2012, “Web 2.0 Technologies\nof the Self,” <em>Philosophy and Technology</em>, 25(3):\n399–413.</li>\n<li>Bar-Tura, A., 2010, “Wall-to-Wall or Face-to-Face,” in\n<em>Facebook and Philosophy</em>, D.E. Wittkower (ed.), Chicago: Open\nCourt, pp. 231–239.</li>\n<li>Barnes, S.B., 2001, <em>Online Connections: Internet Interpersonal\nRelationship</em>s, Cresskill, NJ: Hampton Press.</li>\n<li>Baym, N.K., 2011, “Social Networks 2.0,” in <em>The\nHandbook of Internet Studies</em>, M. Consalvo and C. Ess (eds.),\nOxford: Wiley-Blackwell, pp. 384-405.</li>\n<li>Benjamin, R., 2019, <em>Race After Technology: Abolitionist Tools\nfor the New Jim Code</em>, New York: Polity.</li>\n<li>BBC, 2018, “Facebook Admits it was Used to ‘Incite\nOffline Violence’ in Myanmar,” November 6, 2018.\n [<a href=\"https://www.bbc.co.uk/news/world-asia-46105934\" target=\"other\">available online</a>]</li>\n<li>Bietti, E., 2020, “From Ethics Washing to Ethics Bashing: A\nView on Tech Ethics From Within Moral Philosophy,”\n<em>Proceedings of the 2020 Conference on Fairness, Accountability and\nTransparency</em>, New York: Association for Computing Machinery, pp.\n210–219.</li>\n<li>Bohman, J., 2008, “The Transformation of the Public Sphere:\nPolitical Authority, Communicative Freedom and Internet\nPublics,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge UK:\nCambridge University Press, pp. 66–92.</li>\n<li>Borgmann, A., 1984, <em>Technology and the Character of\nContemporary Life</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1992, <em>Crossing the Postmodern\nDivide</em>, Chicago: University of Chicago Press.</li>\n<li>Boyd, D., 2007, “Why Youth (Heart) Social Networking Sites:\nThe Role of Networked Publics in Teenage Social Life,” in\n<em>Youth, Identity and Social Media</em>, D. Buckingham (Ed.),\nCambridge MA: MIT Press, pp. 119–142.</li>\n<li>Boyd, D. and E. Hargittai, 2010, “Facebook Privacy\nSettings: Who Cares?” <em>First Monday</em>, 15(8):\n13–20.</li>\n<li>Briggle, A., 2008, “Real Friends: How the Internet can\nFoster Friendship,” <em>Ethics and Information Technology</em>,\n10(1): 71–79.</li>\n<li>Buchanan, E.A. and M. Zimmer, 2012, “Internet Research\nEthics,” <em>The Stanford Encyclopedia of Philosophy</em>\n(Spring 2015 Edition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/\">https://plato.stanford.edu/archives/spr2015/entries/ethics-internet-research/</a>&gt;</li>\n<li>Bynum, T., 2011, “Computer and Information Ethics,”\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2011\nEdition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/\">https://plato.stanford.edu/archives/spr2011/entries/ethics-computer/</a>&gt;</li>\n<li>Capurro, R., 2005, “Privacy. An Intercultural\nPerspective,” <em>Ethics and Information Technology</em>, 7(1):\n37–47.</li>\n<li>–––, 2008, “Intercultural Information\nEthics,” in <em>Handbook of Information and Computer\nEthics</em>, K.E. Himma and H.T. Tavani (eds.), Hoboken, NJ: Wiley and\nSons, pp. 639–665.</li>\n<li>–––, 2011, “Never Enter Your Real\nData,” <em>International Review of Information Ethics</em>, 16:\n74–78.</li>\n<li>Cocking, D., 2008, “Plural Selves and Relational\nIdentity,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge UK:\nCambridge University Press, pp. 123–141.</li>\n<li>Cocking, D. and S. Matthews, 2000, “Unreal Friends,”\n<em>Ethics and Information Technology</em>, 2(4): 223–231.</li>\n<li>Consalvo, M. and C. Ess, 2011, <em>The Handbook of Internet\nStudies</em>, Oxford: Wiley-Blackwell.</li>\n<li>Dahlberg, L., 2001, “The Internet and Democratic Discourse:\nExploring the Prospects of Online Deliberative Forums Extending the\nPublic Sphere,” <em>Information, Communication and Society</em>,\n4(4): 615–633.</li>\n<li>de Laat, P. 2006, “Trusting Virtual Trust,” <em>Ethics\nand Information Technology</em>, 7(3): 167–180.</li>\n<li>Dreyfus, H., 2001, <em>On the Internet</em>, New York:\nRoutledge.</li>\n<li>–––, 2004, “Nihilism on the Information\nHighway: Anonymity versus Commitment in the Present Age,” in\n<em>Community in the Digital Age: Philosophy and Practice</em>, A.\nFeenberg and D. Barney (eds.), Lanham, MD: Rowman &amp; Littlefield,\npp. 69–81.</li>\n<li>Douglas, D.M., 2016, “Doxing: A Conceptual Analysis.”\n<em>Ethics and Information Technology</em>, 18: 199–210.</li>\n<li>Elder, A., 2014, “Excellent Online Friendships: An\nAristotelian Defense of Social Media,” <em>Ethics and\nInformation Technology</em>, 16(4): 287–297.</li>\n<li>–––, 2020, “The Interpersonal is\nPolitical: Unfriending to Promote Civic Discourse on Social\nMedia,” <em>Ethics and Information Technology</em>, 22:\n15–24.</li>\n<li>Elgesem, D., 1996, “Privacy, Respect for Persons, and\nRisk,” in <em>Philosophical Perspectives on Computer-Mediated\nCommunication</em>, C. Ess (ed.), Albany, NY: SUNY Press, pp.\n45–66.</li>\n<li>Ellison, N.B., C. Steinfeld, and C. Lampe, 2007, “The\nBenefits of Facebook ‘Friends’: Social Capital and College\nStudents’ Use of Online Social Network Sites,” <em>Journal\nof Computer-Mediated Communication</em>, 12(4): article 1.</li>\n<li>Ess, C., 1996, “The Political Computer: Democracy, CMC and\nHabermas,” in <em>Philosophical Perspectives on\nComputer-Mediated Communication</em>, (C. Ess, ed.), Albany, NY: SUNY\nPress, pp. 197–230.</li>\n<li>–––, 2005a, “Lost in Translation?\nIntercultural Dialogues on Privacy and Information Ethics,”\n<em>Ethics and Information Technology</em>, 7(1): 1–6.</li>\n<li>–––, 2005b, “Moral Imperatives for Life in\nan Intercultural Global Village,” in <em>The Impact of the\nInternet on our Moral Lives</em>, R.J. Cavalier (ed.), Albany NY: SUNY\nPress, pp. 161–193.</li>\n<li>–––, 2006, “Ethical Pluralism and Global\nInformation Ethics,” <em>Ethics and Information Technology</em>,\n8(4): 215–226.</li>\n<li>–––, 2010, “The Embodied Self in a Digital\nAge: Possibilities, Risks and Prospects for a Pluralistic\n(democratic/liberal) Future?” <em>Nordicom Information</em>,\n32(2): 105–118.</li>\n<li>–––, 2011, “Self, Community and Ethics in\nDigital Mediatized Worlds,” in <em>Trust and Virtual Worlds:\nContemporary Perspectives</em>, C. Ess and M. Thorseth (eds.), Oxford:\nPeter Lang, pp. vii–xxix.</li>\n<li>–––, 2021, “Interpretative Pros Hen\nPluralism: from computer-mediated colonization to a pluralistic\nintercultural digital ethics,” <em>Philosophy and\nTechnology</em>, 33(4): 551–569.</li>\n<li>Feenberg, A., 1999, <em>Questioning Technology</em>, New York:\nRoutledge.</li>\n<li>Floridi, L., 2011, “The Informational Nature of Personal\nIdentity,” <em>Minds and Machines</em>, 21(4):\n549–566.</li>\n<li>–––, 2015a, “Free Online Services:\nEnabling, Disenfranchising, Disempowering,” <em>Philosophy and\nTechnology</em>, 28: 163–166.</li>\n<li>–––, 2015b, “The New Grey Power,”\n<em>Philosophy and Technology</em>, 28: 329–332.</li>\n<li>franzke, a. s., A. Bechmann, M. Zimmer, C. Ess, and the\nAssociation of Internet Researchers, 2020, <em>Internet Research:\nEthical Guidelines 3.0</em>, Association of Internet Researchers.\n [<a href=\"https://aoir.org/reports/ethics3.pdf\" target=\"other\">franzke, et al. 2020 available online</a>]</li>\n<li>Frick, M. and A. Oberprantacher, 2011, “Shared is Not Yet\nSharing, Or: What Makes Social Networking Services Public?”\n<em>International Review of Information Ethics</em>, 15:\n18–23.</li>\n<li>Frischmann, B. and E. Selinger, 2018, <em>Re-Engineering\nHumanity</em>, Cambridge: Cambridge University Press.</li>\n<li>Froding, B. and Peterson, M., 2012, “Why Virtual Friendship\nis No Genuine Friendship,” <em>Ethics and Information\nTechnology</em>, 14(3): 201–207.</li>\n<li>Giles, D., 2006, “Constructing Identities in Cyberspace: The\nCase of Eating Disorders,” <em>British Journal of Social\nPsychology</em>, 45: 463–477.</li>\n<li>Gillespie, T., 2020, “Content Moderation, AI, and the\nQuestion of Scale,” <em>Big Data and Society</em>, 7(2).\n [<a href=\"https://journals.sagepub.com/doi/full/10.1177/2053951720943234\" target=\"other\">Gillespie 2020 available online</a>]</li>\n<li>Goel, V., 2014, “Facebook Tinkers with Users’ Emotions\nin News Feed Experiment, Stirring Outcry,” <em>The New York\nTimes</em> (Technology section), June 29, 2014.\n [<a href=\"https://www.nytimes.com/2014/06/30/technology/facebook-tinkers-with-users-emotions-in-news-feed-experiment-stirring-outcry.html?searchResultPosition=1\" target=\"other\">Goel 2014 available online</a>]</li>\n<li>Grodzinsky, F.S. and H.T. Tavani, 2010, “Applying the\n‘Contextual Integrity’ Model of Privacy to Personal Blogs\nin the Blogosphere,” <em>International Journal of Internet\nResearch Ethic</em>s, 3(1): 38–47.</li>\n<li>Habermas, J., 1992/1998, <em>Between Facts and Norms:\nContributions to a Discourse Theory of Law and Democracy</em>,\nCambridge, MA: MIT Press.</li>\n<li>Hamington, M., 2010, “Care Ethics, Friendship and\nFacebook,” in <em>Facebook and Philosophy</em>, D.E. Wittkower\n(ed.), Chicago: Open Court, pp. 135–145.</li>\n<li>Hampton, K., L. Rainie, W. Lu, M. Dwyer, I. Shin, and K. Purcell,\n2014, “Social Media and the ‘Spiral of\nSilence’,” Pew Research Center, Published August 26, 2014,\navailable online.</li>\n<li>Hao, K. 2021. “Stop Talking About AI Ethics. It’s Time\nto Talk About Power,” <em>MIT Technology Review</em>, April 23,\n2021.\n [<a href=\"https://www.technologyreview.com/2021/04/23/1023549/kate-crawford-atlas-of-ai-review/\" target=\"other\">Hao 2021 available online</a>]</li>\n<li>Heidegger, M., 1954 [1977], <em>The Question Concerning Technology\nand Other Essays</em>, New York: Harper and Row.</li>\n<li>Honglaradom, S., 2007, “Analysis and Justification of\nPrivacy from a Buddhist Perspective,” in S. Hongladarom and C.\nEss (eds.), <em>Information Technology Ethics: Cultural\nPerspectives</em>, Hershey, PA: Idea Group, pp. 108–122.</li>\n<li>–––, 2011, “Personal Identity and the Self\nin the Online and Offline World,” <em>Minds and Machines</em>,\n21(4): 533–548.</li>\n<li>Hongladarom, S. and J. Britz, 2010, “Intercultural\nInformation Ethics,” <em>International Review of Information\nEthics</em>, 13: 2–5.</li>\n<li>Hull, G., 2015, “Successful Failure: What Foucault Can Teach\nUs about Privacy Self-Management in a World of Facebook and Big\nData,” <em>Ethics and Information Technology</em>, online.\ndoi:10.1007/s10676-015-9363-z</li>\n<li>Hull, G., H.R. Lipford, and C. Latulipe, 2011, “Contextual\nGaps: Privacy Issues on Facebook,” <em>Ethics and Information\nTechnology</em>, 13(4): 289–302.</li>\n<li>Introna, L., 2011, “Phenomenological Approaches to Ethics\nand Information Technology,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2011 Edition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/sum2011/entries/ethics-it-phenomenology/\">https://plato.stanford.edu/archives/sum2011/entries/ethics-it-phenomenology/</a>&gt;</li>\n<li>Ito, M., et al., 2009, <em>Hanging Out, Messing Around, Geeking\nOut: Living and Learning with New Medi</em>a, Cambridge, MA: MIT\nPress.</li>\n<li>Johnson, Deborah G., 1985, <em>Computer Ethics, </em>Englewood\nCliffs, NJ: Prentice Hall.</li>\n<li>Kidd, I.J., H. Battaly, and Q. Cassam, 2020, <em>Vice\nEpistemology</em>, New York : Routledge.</li>\n<li>Kristjánsson, K., 2021, “Online Aristotelian\nCharacter Friendship as an Augmented Form of Penpalship,”\n<em>Philosophy and Technology</em>, 34: 289–307.</li>\n<li>Lanier, J. 2010, <em>You Are Not a Gadget: A Manifesto</em>, New\nYork: Knopf.</li>\n<li>Levy, N., 2020, “Virtue Signaling Is Virtuous,”\n<em>Synthese</em>, published online 16 April 2020.\ndoi:10.1007/s11229-020-02653-9</li>\n<li>Manders-Huits, N., 2010, “Practical versus Moral Identities\nin Identity Management,” <em>Ethics and Information\nTechnolog</em>y, 12(1): 43–55.</li>\n<li>Marin, L., 2021, “Sharing (Mis)information on Social\nNetworking Sites: An Exploration of the Norms for Distributing Content\nAuthored by Others,” <em>Ethics and Information Technology</em>,\npublished online 02 February 2021. doi:10.1007/s10676-021-09578-y</li>\n<li>Marturano, A., 2011, “The Ethics of Online Social\nNetworks—An Introduction,” <em>International Review of\nInformation Ethics</em>, 16: 3–5.</li>\n<li>Miller, M.E., 2021, “Pizzagate’s Violent\nLegacy,” <em>The Washington Post</em>, February 16, 2021.\n [<a href=\"https://www.washingtonpost.com/dc-md-va/2021/02/16/pizzagate-qanon-capitol-attack/\" target=\"other\">Miller 2021 available online</a>]</li>\n<li>Moor, J., 1985, “What is Computer Ethics?”\n<em>Metaphilosophy</em>, 16(4): 266–275.</li>\n<li>–––, 2008, “Why We Need Better Ethics for\nEmerging Technologies,” in <em>Information Technology and Moral\nPhilosophy</em>, J. van den Hoven and J. Weckert (eds.), Cambridge:\nUK: Cambridge University Press, pp. 26–39.</li>\n<li>Nissenbaum, M., 2004, “Privacy as Contextual\nIntegrity,” <em>Washington Law Review</em>, 79(1):\n119–157.</li>\n<li>–––, 2010, Privacy in Context: <em>Technology,\nPolicy, and the Integrity of Social Life</em>, Palo Alto, CA: Stanford\nUniversity Press.</li>\n<li>Parkin, S., 2018, “The YouTube Stars Heading for Burnout:\n‘The Most Fun Job Imaginable Became Deeply Bleak’”,\n<em>The Guardian</em>, September 8, 2018.\n [<a href=\"https://www.theguardian.com/technology/2018/sep/08/youtube-stars-burnout-fun-bleak-stressed\" target=\"other\">Parkin 2018 available online</a>]</li>\n<li>Parsell, M., 2008, “Pernicious Virtual Communities:\nIdentity, Polarisation and the Web 2.0,” <em>Ethics and\nInformation Technology</em>, 10(1): 41–56.</li>\n<li>Protevi, J., 2018. “Realpolitik and Academic Freedom,”\nin <em>Academic Freedom</em>, J. Lackey (ed.), Oxford: Oxford\nUniversity Press, pp. 85–101.</li>\n<li>Puotinen, S., 2011, “Twitter Cares? Using Twitter to Care\nAbout, Care for and Care With Women Who Have Had Abortions,”\n<em>International Review of Information Ethics</em>, 16:\n79–84.</li>\n<li>Rini, R., 2017, “Fake News and Partisan Epistemology,”\n<em>Kennedy Institute of Ethics Journal</em>,\n [<a href=\"https://kiej.georgetown.edu/fake-news-partisan-epistemology/\" target=\"other\">Rini 2017 available online</a>]</li>\n<li>Roberts, S.T., 2019, <em>Behind the Screen: Content Moderation in\nthe Shadows of Social Media</em>, New Haven: Yale University\nPress.</li>\n<li>Rodogno, R., 2012, “Personal Identity Online,”\n<em>Philosophy and Technology</em>, 25(3): 309–328.</li>\n<li>Salter, M., 2017, <em>Crime, Justice and Social Media</em>, New\nYork: Routledge.</li>\n<li>Sharp, R., 2012, “The Obstacles Against Reaching the Highest\nLevel of Aristotelian Friendship Online,” <em>Ethics and\nInformation Technolog</em>y, 14(3): 231–239.</li>\n<li>Smith, A., 2011, “Why Americans Use Social Media,” Pew\nResearch Center, 15 November 2011,\n [<a href=\"https://www.pewresearch.org/internet/2011/11/15/why-americans-use-social-media/\" target=\"other\">Smith 2011 available online</a>].</li>\n<li>Spinello, R.A., 2011, “Privacy and Social Networking\nTechnology,” <em>International Review of Information\nEthics</em>, 16: 41–46.</li>\n<li>Stark, L. and A.L. Hoffmann, 2019, “Data is the New What?\nPopular Metaphors and Professional Ethics in Emerging Data\nCultures.” <em>Journal of Cultural Analytics</em>, 1(1), May 2,\n2019.\n [<a href=\"https://culturalanalytics.org/article/11052-data-is-the-new-what-popular-metaphors-amp-professional-ethics-in-emerging-data-culture\" target=\"other\">Stark and Hoffman 2019 available online</a>]</li>\n<li>Stokes, P., 2012, “Ghosts in the Machine: Do the Dead Live\non in Facebook?,” <em>Philosophy and Technology</em>, 25(3):\n363–379.</li>\n<li>Sunstein, C., 2008, “Democracy and the Internet,” in\n<em>Information Technology and Moral Philosophy</em>, J. van den Hoven\nand J. Weckert (eds.), Cambridge UK: Cambridge University Press, pp.\n93–110.</li>\n<li>Tavani, H.T., 2005, “The Impact of the Internet on our Moral\nCondition: Do we Need a New Framework of Ethics?” in <em>The\nImpact of the Internet on our Moral Lives</em>, R.J. Cavalier (ed.),\nAlbany, NY: SUNY Press, pp. 215–237.</li>\n<li>–––, 2007, “Philosophical Theories of\nPrivacy: Implications for an Adequate Online Privacy Policy,”\n<em>Metaphilosophy</em>, 38(1): 1–22.</li>\n<li>Tosi, J. and B. Warmke, 2020, <em>Grandstanding: The Use and\nAbuse of Moral Talk</em>, New York: Oxford University Press.</li>\n<li>Turkle, S., 1995, <em>Life on the Screen: Identity in the Age of\nthe Internet</em>, New York: Simon and Schuster.</li>\n<li>–––, 2011, <em>Alone Together: Why we Expect\nMore from Technology and Less from Each Other</em>, New York: Basic\nBooks.</li>\n<li>–––, 2015, <em>Reclaiming Conversation: The\nPower of Talk in a Digital Age</em>, New York: Penguin Press.</li>\n<li>Turp, M.-J. 2020., “Social Media, Interpersonal Relations\nand the Objective Attitude,” <em>Ethics and Information\nTechnology</em>, 22: 269–279.</li>\n<li>Vaidhyanathan, S., 2018, <em>Antisocial Media</em><em>: How\nFacebook Disconnects Us and Undermines Democracy</em>, New York:\nOxford University Press.</li>\n<li>Vallor, S., 2010, “Social Networking Technology and the\nVirtues,” <em>Ethics and Information Technology</em>, 12 (2):\n157–170.</li>\n<li>–––, 2012, “Flourishing on Facebook:\nVirtue Friendship and New Social Media,” <em>Ethics and\nInformation Technology</em>, 14(3): 185–199.</li>\n<li>–––, 2016, <em>Technology and the Virtues: A\nPhilosophical Guide to a Future Worth Wanting</em>. New York: Oxford\nUniversity Press.</li>\n<li>van den Eede, Y., 2010, “‘Conversation of\nMankind’ or ‘Idle Talk’?: A Pragmatist Approach to\nSocial Networking Sites,” <em>Ethics and Information\nTechnology</em>, 12(2): 195–206.</li>\n<li>Véliz, C., 2021, <em>Privacy is Power</em>, New York:\nPenguin Press.</li>\n<li>Verbeek, P., 2005, <em>What Things Do: Philosophical Reflections\non Technology, Agency and Design</em>, University Park, PA:\nPennsylvania State University Press.</li>\n<li>Wagner, B., 2021. “Fact Check: Hilary Clinton was not Hanged\nat Guantanamo Bay,” <em>USA Today</em>, June 17 2021.\n [<a href=\"https://eu.usatoday.com/story/news/factcheck/2021/06/17/fact-check-hillary-clinton-not-hanged-guantanamo-bay/7687922002/\" target=\"other\">Wagner 2021 available online</a>]</li>\n<li>Wandel, T. and A. Beavers, 2011, “Playing Around with\nIdentity,” in <em>Facebook and Philosoph</em>y, D.E. Wittkower\n(ed.), Chicago: Open Court, pp. 89–96.</li>\n<li>Westra, E., 2021, “Virtue Signaling and Moral\nProgress,” <em>Philosophy and Public Affairs</em>, 49(2).\n [<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/papa.12187\" target=\"other\">Westra 2021 available online</a>]</li>\n<li>Wilson, J., 2018, “Doxxing, assault, death threats: the new\ndangers facing US journalists covering extremism,” <em>The\nGuardian</em>, June 14, 2018.\n [<a href=\"https://www.theguardian.com/world/2018/jun/14/doxxing-assault-death-threats-the-new-dangers-facing-us-journalists-covering-extremism\" target=\"other\">Wilson 2018 available online</a>]</li>\n<li>Wong, P.H., 2010, “The Good Life in Intercultural\nInformation Ethics: A New Agenda,” <em>International Review of\nInformation Ethics</em>, 13: 26–32.</li>\n<li>–––, 2012, “Dao, Harmony and Personhood:\nTowards a Confucian Ethics of Technology,” <em>Philosophy and\nTechnology</em>, 25(1): 67–86.</li>\n<li>–––, 2013, “Confucian Social Media: An\nOxymoron?” <em>Dao</em>, 12: 283–296.</li>\n<li>Woodfield, K. (ed.), 2018, <em>The Ethics of Online Research</em>,\nBingley, UK: Emerald Publishing.</li>\n<li>Zuboff, S., 2019, <em>The Age of Surveillance Capitalism: The\nFight for A Human Future at the New Frontier of Power</em>, New York:\nPublic Affairs.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, General Topics: ethics",
            "character, moral",
            "computing: and moral responsibility",
            "ethics: search engines and",
            "ethics: virtue",
            "Habermas, Jürgen",
            "information technology: and moral values",
            "information technology: and privacy",
            "information technology: phenomenological approaches to ethics and",
            "personal identity: and ethics",
            "privacy",
            "publicity",
            "technology, philosophy of"
        ],
        "entry_link": [
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../moral-character/": "character, moral"
            },
            {
                "../computing-responsibility/": "computing: and moral responsibility"
            },
            {
                "../ethics-search/": "ethics: search engines and"
            },
            {
                "../ethics-virtue/": "ethics: virtue"
            },
            {
                "../habermas/": "Habermas, Jürgen"
            },
            {
                "../it-moral-values/": "information technology: and moral values"
            },
            {
                "../it-privacy/": "information technology: and privacy"
            },
            {
                "../ethics-it-phenomenology/": "information technology: phenomenological approaches to ethics and"
            },
            {
                "../identity-ethics/": "personal identity: and ethics"
            },
            {
                "../privacy/": "privacy"
            },
            {
                "../publicity/": "publicity"
            },
            {
                "../technology/": "technology, philosophy of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ethics-social-networking\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ethics-social-networking/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ethics-social-networking&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/ethics-social-networking/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ethics-social-networking": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ethics-social-networking/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ethics-social-networking&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/ethics-social-networking/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Green, B., 2021,\n “<a href=\"https://arxiv.org/abs/2106.01784\" target=\"other\">The Contestation of Tech Ethics: A Sociotechnical Approach to Ethics and Technology in Action,” manuscript available at <em>arXiv.org</em>.</a>",
            "<a href=\"https://arxiv.org/abs/2106.01784\" target=\"other\">Weinberg, J. 2020, “</a><a href=\"https://dailynous.com/2020/07/09/illusion-agreement-debate-intolerance/\" target=\"other\">Illusion and Agreement in the Debate Over Intolerance</a>,”\n <em>Daily Noûs</em>, July 9, 2020.",
            "<a href=\"http://www.pewinternet.org/topics/Social-Networking.aspx\" target=\"other\">Social Networking</a>,\n Pew Research Center, Internet and American Life Project.",
            "<a href=\"http://epic.org/privacy/socialnet\" target=\"other\">Electronic Privacy Information Center</a>."
        ],
        "listed_links": [
            {
                "https://arxiv.org/abs/2106.01784": "The Contestation of Tech Ethics: A Sociotechnical Approach to Ethics and Technology in Action,” manuscript available at arXiv.org."
            },
            {
                "https://arxiv.org/abs/2106.01784": "Weinberg, J. 2020, “"
            },
            {
                "https://dailynous.com/2020/07/09/illusion-agreement-debate-intolerance/": "Illusion and Agreement in the Debate Over Intolerance"
            },
            {
                "http://www.pewinternet.org/topics/Social-Networking.aspx": "Social Networking"
            },
            {
                "http://epic.org/privacy/socialnet": "Electronic Privacy Information Center"
            }
        ]
    }
}