{
    "url": "federalism",
    "title": "Federalism",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Andreas Follesdal\n<andreas@follesdal.net>",
        "author_links": [
            {
                "http://www.follesdal.net/": "Andreas Follesdal"
            },
            {
                "mailto:andreas%40follesdal%2enet": "andreas@follesdal.net"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.follesdal.net/\" target=\"other\">Andreas Follesdal</a>\n&lt;<a href=\"mailto:andreas%40follesdal%2enet\"><em>andreas<abbr title=\" at \">@</abbr>follesdal<abbr title=\" dot \">.</abbr>net</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sun Jan 5, 2003",
        "substantive revision Wed Nov 2, 2022"
    ],
    "preamble": "\n\nFederalism is the theory or advocacy of federal principles for\ndividing powers between member units and common institutions. Unlike\nin a unitary state, sovereignty in federal political orders is\nnon-centralized, often constitutionally, between at least two levels\nso that units at each level have final authority and can be self\ngoverning in some issue area. Citizens thus have political obligations\nto, or have their rights secured by, two authorities. The division of\npower between the member unit and center may vary, typically the\ncenter has powers regarding defense and foreign policy, but member\nunits may also have international roles. The decision-making bodies of\nmember units may also participate in central decision-making bodies.\nMuch recent philosophical attention is spurred by renewed political\ninterest in federalism and backlashes against particular instances,\ncoupled with empirical findings concerning the requisite and\nlegitimate basis for stability and trust among citizens in federal\npolitical orders. Philosophical contributions have addressed the\ndilemmas and opportunities facing Canada, Australia, Europe, Russia,\nIraq, Nepal, Ethiopia and Nigeria, to mention just a few areas where\nfederal arrangements are seen as interesting solutions to accommodate\ndifferences among populations divided by ethnic or cultural cleavages\nyet seeking a common, often democratic, political order.\n",
    "toc": [
        {
            "#Taxo": "1. Taxonomy"
        },
        {
            "#HistFede": "2. History of Federalism"
        },
        {
            "#SomeGlobPers": "2.1 Some global perspectives"
        },
        {
            "#WestCont": "2.2 Western contributions"
        },
        {
            "#ReasForFede": "3. Reasons for Federalism"
        },
        {
            "#ReasForFedeOrdeRathThanSepaStatSece": "3.1 Reasons for a federal order rather than separate states or secession"
        },
        {
            "#ReasForPrefFedeOrdeOverUnitStat": "3.2 Reasons to prefer federal orders over a unitary state"
        },
        {
            "#FurtPhilIssu": "4. Further Philosophical Issues"
        },
        {
            "#SoveFede": "4.1 Sovereignty or federalism"
        },
        {
            "#IssuConsInstDesi": "4.2 Issues of Constitutional and Institutional Design"
        },
        {
            "#SourStab": "4.3 Sources of Stability"
        },
        {
            "#DiviPowe": "4.4 Division of Power"
        },
        {
            "#DistJust": "4.5 Distributive Justice"
        },
        {
            "#DemoTheo": "4.6 Democratic Theory"
        },
        {
            "#PoliReco": "4.7 Politics of Recognition"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Hist": "Historical"
        },
        {
            "#Cont": "Contemporary"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Taxonomy\n\nMuch valuable scholarship explicates the central terms\n‘federalism’, ‘federation’ and ‘federal\nsystems’ (cf. Wheare 1964, King 1982, Elazar 1987, Elazar 1987a,\nRiker 1993, Watts 1998).\n\nA federal political order is here taken to be “the\ngenus of political organization that is marked by the combination of\nshared rule and self-rule” (Watts 1998, 120).\nFederalism is the descriptive theory or normative advocacy of\nsuch an order, including principles for dividing final authority\nbetween member units and the common institutions.\n\nA federation is one species of such a federal order; other\nspecies are unions, confederations, leagues and decentralised\nunions—and hybrids such as the present European Union (Elazar\n1987, Watts 1998). A federation in this sense involves a\nterritorial division of power between constituent\nunits—sometimes called ‘provinces’,\n‘cantons’, possibly ‘cities’, or confusingly\n‘states’—and a common government. This division of\npower is typically entrenched in a constitution which neither a member\nunit nor the common government can alter unilaterally. The member unit\nand the common government both have direct effect on the\ncitizenry—the common government operates “on the\nindividual citizens composing the nation” (Federalist Paper\n39)—and the authorities of both are directly elected (Watts\n1998, 121). In comparison, decentralized authority in unitary states\ncan typically be revoked by the central legislature at will. Many\nmultilevel forms of governance may also be revised by units at one\nlevel without consent by bodies at other levels. Such entrenchments\nnotwithstanding, some centralization often occurs owing to the\nconstitutional interpretations by a federal level court in charge of\nsettling conflicts regarding the scopes of final legislative and/or\njudicial authority.\n\nIn contrast, ‘confederation’ has come to mean a political\norder with a weaker center than a federation, often dependent on the\nconstituent units (Watts 1998, 121). Typically, in a confederation a)\nmember units may legally exit, b) the center only exercises authority\ndelegated by member units, c) the center is subject to member unit\nveto on many issues, d) center decisions bind member units but not\ncitizens directly, e) the center lacks an independent fiscal or\nelectoral base, and/or f) the member units do not cede\nauthority permanently to the center. Confederations are often based on\nagreements for specific tasks, and the common government may be\ncompletely exercised by delegates of the member unit governments. Thus\nmany would count as confederations the North American states during\n1776–1787, Switzerland 1291–1847, and the present European\nUnion—though it has several elements typical of federations.\n\nIn symmetric (con)federations the member\nunits have the same bundles of powers, while in asymmetric\n(con)federations such as Russia, Canada, the\nEuropean Union, Spain, or India the bundles may be different among\nmember units; some member units may for instance have special rights\nregarding language or culture. Some asymmetric arrangements involve\none smaller state and a larger, where the smaller partakes in\ngoverning the larger while retaining sovereignty on some issues\n(Elazar 1987, Watts 1998).\n\nA helpful categorisation among federal arrangements concerns the\nrelationship between the central unit, member units and individuals.\nIf the decisions made centrally do not involve member units at all, we\nmay speak of separate (split or compact)\nfederalism. Some issues may be the responsibility of the central unit,\nothers belonging to the member units, where citizens vote their\nrepresentatives directly to both bodies (U.S. Constitution Art. II\nSection 1; cf. Dahl 2001). Federations can involve member units in\ncentral decision-making in at least two different ways in various\nforms of interlocking (or cooperative) federalism.\nMember unit representatives can participate within central\nbodies—in cabinets or legislatures—(collective agency\ncompositional arrangement). Or they constitute one central body\nthat interacts with other central bodies, for instance where member\nunit government representatives form an Upper House with power to veto\nor postpone decisions by majority or qualified majority vote\n(divided agency/relational arrangements). These\nlegal arrangements give rise to varieties of multi-level governance:\ncontinuous negotiations among authorities at different territorial\nlevels (Marks 1993, Hooghe and Marks 2003, Scharpf 1983).\nResponsiveness to individuals may benefit from interlocking\nfederalism, but often at the cost of transparency and\naccountability.\n\nSeveral authors identify two quite distinct processes that lead to a\nfederal political order (Friedrich 1968, Buchanan 1995, Stepan 1999\nand others). Independent states may aggregate by ceding or pooling\nsovereign powers in certain domains for the sake of goods otherwise\nunattainable, such as security or economic prosperity. Such coming\ntogether federal political orders are typically arranged to\nconstrain the center and prevent majorities from overriding a member\nunit. Examples include the present USA, Canada, Switzerland, and\nAustralia. Holding together federal political orders develop\nfrom unitary states, as governments devolve authority to alleviate\nthreats of unrest or secession by territorially clustered minorities.\nSuch federal political orders often grant some member units particular\ndomains of sovereignty e.g. over language and cultural rights in an\nasymmetric federation, while maintaining broad scope of\naction for the central government and majorities. Examples include\nIndia, Belgium and Spain.\n\nIn addition to territorially organized federal political orders, other\ninteresting alternatives to unitary states occur when\nnon-territorial member units are constituted by groups\nsharing ethnic, religious or other characteristics. These systems are\nsometimes referred to as ‘non-territorial’ federations.\nKarl Renner and Otto Bauer explored such arrangements for\ngeographically dispersed cultural minorities, allowing them some\ncultural and “personal” autonomy without territorial self\nrule (Bauer 1903; Renner 1907; Bottomore and Goode 1978; cf. Tamir\n1993 and Nimni 2005). Consociations consist of somewhat\ninsulated groups in member units who in addition are represented in\ncentral institutions often governing by unanimity rather than by\nmajority (Lijphart 1977).\n2. History of Federalism\n\nA wide-spread interest among political philosophers in topics\nconcerning the centralised nation state have fuelled attention to\nhistorical contributions on unitary sovereignty. However, we can also\nidentify a steady stream of contributions to the philosophy of\nfederalism, also by those more well known for their arguments\nconcerning centralised power (cf. Karmis and Norman 2005 for such\nreadings). Much of the Western literature on federalism has focused on\nthe unit of states. To underscore this bias, consider first some\nnon-Western practices and theories of federal features.\n2.1 Some global perspectives\n\nWe find federal modes of political organisation on many continents,\nand contributions to theories about federalism in written sources\nacross philosophical traditions. A range of philosophical\ncontributions underscore that federal perspectives can apply to a wide\nrange of units other than the sovereign states central in European and\nU.S. thought.\n\nThe tribal organisation of the Māori in what is now New Zealand\nincluded family groups (whanau), who would work together and\ncollaborate for defense as a clan (hapū). The tribe\n(iwi) would in turn operate as a federation among several\nhapū for common defense (Ballara 1998, 19).\n\nSeveral extinct African societies had federal elements. Edward Wamala\ndescribes what we recognise as federal features in pre-14th century\nGanda society, in what later became the kingdom of the Baganda, now\npart of Uganda. The power structures between the chief\n(ssabataka) and heads of tribes (mutaka) was one of\nprimus inter pares. The tribes enjoyed immunity, in that the\nhigher units should no usurp the responsibilities of the lower units\nof power but only promote the well-being of the lower units (Wamala\n2004: 436–437)\n\nNahua (Aztek) culture illustrates multi-level federalism: Tlaxilacalli\n- badly translated and understood as “neighbourhoods” -\nwould submit to the authority of the sovereign local polity, or\naltepetl, which then scaled up to autonomous mega-provinces\n(huei altepetl) and finally to the entire empire. At each\nlevel, submission was traded for autonomy, undercutting any attempt at\ndirect centralising rule (Johnson 2017). In the 1428 triple alliance\nfor military purposes among the three city-states (altepeme)\nof Tenochtitlan, Texcoco and Totoquihuatzin, each of these rules over\ntheir dependent altepetl without interference by the other\ntwo (Lockhart 1992).\n\nThe Confucian political philosopher Mencius (379–298 BC) laid\nout a three level ‘familial’ order (Chan 2003). The family\nhad primary responsibility for those unable to care for themselves,\nand rulers should be the parents of the people. (Mencius 2003, 1B.13).\nWhen the family could not assist, the community network\nshould provide support. Only when the community was unable\nwould what we might call the state have an obligation to\naid.\n\nWe find expressions of federalism in the third pillar of Islam:\nObligatory charity in the form of zakat provided to certain\nneedy persons outside one’s own household (Qur’an 9: 103).\nEvery able Muslim must provide a fixed proportion of their net\nwealth—2.5%—to support others in need. The role of the\nstate may vary when it comes to assess, collect and distribute zakat.\nIn some states, the collection or distribution of zakat is the\nresponsibility of civil society organisations or mosques. In other\nstates, it is the government’s responsibility to either ensure\nthat zakat is managed if Muslims fail to pay; or the whole system may\nbe managed by the state (Bilo and Mechado 2018).\n\nThe sub-Saharan philosophy of Ubuntu has federal features that have\nalso contributed to legal theory. The term ‘Ubuntu’ stems\nfrom the Nguni phrase “Umuntu ngumuntu ngabantu”\nmeaning a person is a person through other persons. Ubuntu emphasises\nthe harmonious relationships between persons as constitutive of the\nindividual, underscoring compassion and commitment to one\nanother’s growth (Mbiti 1969, Gädeke 2019, Metz 2011). The\ntask of governments at various territorial levels is to promote\nharmonious flourishing and community of the constituent parts (Shutte\n2001). Ubuntu was included in the epilogue of the 1993 Interim\nConstitution of South Africa, but not explicitly in its 1996\nConstitution.\n\nThe confederacy among five (later six) Haudenosaunee (Iroquois)\nnations dates back to between the 12th and 15th century. The oral\nconstitution—The Great Law of Peace—specified that each\nnation elected delegates, or sachems, who dealt with internal\naffairs. The confederacy’s Grand Council could not interfere\nwith the internal affairs of each tribe, but would discuss particular\nmatters of common concern such as war, peace, and treaty making. The\nHaudenosaunee practice of granting the member units immunity\napparently influenced Benjamin Franklin’s and others’ call\nfor a union among the English colonies (Fenton 1998). Iris Marion\nYoung explored this tradition to develop a theory of federalism that\nwould secure immunity and redress power imbalances (Young 2000; Levy\n2008).\n2.2 Western contributions\n\nAristotle (384–322 BC) provides an early Western example of\nfederal thought, where some of the member units are not political. The\ntasks of households and villages is to secure individuals’\nnecessities of life. The city-state (polis) is a\nself-sufficient community of such households, clans and villages, for\nprotection and fulfilment (Politics, III.9, 1280b).\n\nSeveral of the early European contributors to federalist thought\nexplored the rationale and weaknesses of centralised states as they\nemerged and developed in the 17th and 18th century. Johannes Althusius\n(1557–1630) is often regarded as the father of modern federalist\nthought. He argued in Politica Methodice Digesta (Althusius\n1603) for autonomy of his city Emden, both against its Lutheran\nprovincial Lord and against the Catholic Emperor. Althusius was\nstrongly influenced by French Huguenots and Calvinism. As a permanent\nminority in several states, Calvinists developed a doctrine of\nresistance as the right and duty of “natural leaders” to\nresist tyranny. Orthodox Calvinists insisted on sovereignty in the\nsocial circles subordinate only to God’s laws. The French\nProtestant Huguenots developed a theory of legitimacy further,\npresented 1579 by an author with the telling pseudonym “Junius\nBrutus” in Vindiciae Contra Tyrannos. The people,\nregarded as a corporate body in territorial hierarchical communities,\nhas a God-granted right to resist rulers without rightful claim.\nRejecting theocracy, Althusius developed a non-sectarian,\nnon-religious contractualist political theory of federations that\nprohibited state intervention even for purposes of promoting the right\nfaith. Accommodation of dissent and diversity prevailed over any\ninterest in subordinating political powers to religion or vice\nversa.\n\nSince humans are fundamentally dependent on others for the reliable\nprovision of requirements of a comfortable and holy life, we require\ncommunities and associations that are both instrumentally and\nintrinsically important for supporting [subsidia] our needs.\nAlthusius, like Aristotle, included non-political units in his federal\ntheory. Families, guilds, cities, provinces, states and other\nassociations owe their legitimacy and claims to political power to\ntheir various roles in enabling a holy life, rather than to\nindividuals’ interest in autonomy. Each association claims\nautonomy within its own sphere against intervention by other\nassociations. Borrowing a term originally used for the alliance\nbetween God and men, Althusius holds that associations enter into\nsecular agreements—pactum foederis—to live\ntogether in mutual benevolence.\n\nSeveral early contributors explored what we may now regard as various\nspecies of federal political orders, partly with an eye to resolving\ninter-state conflicts.\n\nLudolph Hugo (ca. 1630–1704) was the first to distinguish\nconfederations based on alliances, decentralized unitary states such\nas the Roman Empire, and federations, characterized by ‘double\ngovernments’ with territorial division of powers, in De\nStatu Regionum Germanie (1661) (cf. Elazar 1998; Riley 1976).\n\nA recurring concern was tensions between federalism and conceptions of\nsovereignty. Samuel Pufendorf (1632–1684) maintained that\nsovereign states could at most “agree to intertwine for all\ntime” in a confederation deciding by unanimity. Move to majority\nrule turned the legal order into an ‘irregular system’\ncloser to a state. If sovereignty is a unique site of final and\nindependent authority, federations are no more than voluntary treaties\namong fundamentally independent states, argued Emmerik Vattel\n(1714–1767). Later thinkers challenged this understanding of\nsovereignty, in debates continuing to this day concerning the European\nUnion. (MacCormick 1999, Schütze 2009).\n\nIn The Spirit of Laws (1748) Charles de Secondat, Baron de\nMontesquieu (1689–1755) argued for confederal arrangements as\ncombining the best of small and large political units, without the\ndisadvantages of either. On the one hand they could provide the\nadvantages of small states such as republican participation and\nliberty understood as non-domination—that is, security against\nabuse of power. At the same time confederal orders secure the benefits\nof larger states such as military security, without the risks of small\nand large states. A ‘confederate republic’ with separation\nof powers allows sufficient homogeneity and identification within\nsufficiently small member units. The member units in turn pool powers\nsufficient to secure external security, reserving the right to secede\n(Book 9, 1). Member units serve as checks on each other, since other\nmember units may intervene to quell insurrection and power abuse in\none member unit. These themes reoccur in later contributions, up to\nand including discussions concerning the European Union (cf. Levy\n2004, 2005, 2007).\n\nDavid Hume (1711–1776) disagreed with Montesquieu that smaller\nsize is better. Instead, “in a large democracy … there is\ncompass and room enough to refine the democracy.” In “Idea\nof a Perfect Commonwealth” (Hume 1752) Hume recommended a\nfederal arrangement for deliberation of laws involving both member\nunit and central legislatures. Member units enjoy several powers and\npartake in central decisions, but their laws and court judgments can\nalways be overruled by the central bodies, hence it seems that\nHume’s model is not federal as the term is used here. He held\nthat such a numerous and geographically large system would do better\nthan small cities in preventing decisions based on “intrigue,\nprejudice or passion” against the public interest.\n\nSeveral 18th century peace plans for Europe recommended confederal\narrangements. The 1713 Peace Plan of Abbé Charles de\nSaint-Pierre (1658–1743) would allow intervention in member\nunits to quell rebellion and wars on non-members to force them to join\nan established confederation, and required unanimity for changes to\nthe agreement.\n\nJean-Jacques Rousseau (1712–1778) presented and critiqued\nSaint-Pierre’s proposal, listing several conditions including\nthat all major powers must be members, that the joint legislation must\nbe binding, that the joint forces must be stronger than any single\nstate, and that secession must be illegal. Again, unanimity was\nrequired for changes to the agreement.\n\nImmanuel Kant (1724–1804) defended a confederation for peace in\nOn Perpetual Peace (1796). His Second Definite Article of a\nPerpetual Peace holds that the right of nations shall be based on a\npacific federation among free states rather than a peace treaty or an\ninternational state: “This federation does not aim to acquire\nany power like that of a state, but merely to preserve and secure the\nfreedom of each state in itself, along with that of the other\nconfederated states, although this does not mean that they need to\nsubmit to public laws and to a coercive power which enforces them, as\ndo men in a state of nature.”\n\nThe discussions surrounding the U.S. Constitutional Convention of 1787\nmarks a clear development in federal thought, also as regards the\ntensions between unitary sovereignty and divided authority. One\ncentral feature is that federations were seen as uniting not only\nmember units as in confederations, but also the citizenry\ndirectly.\n\nThe Articles of Confederation of 1781 among the 13 American states\nfighting British rule had established a center too weak for law\nenforcement, defense and for securing interstate commerce. What has\nbecome known as the U.S. Constitutional Convention met May\n25–September 17, 1787. It was explicitly restricted to revise\nthe Articles, but ended up recommending more fundamental changes. The\nproposed constitution prompted widespread debate and arguments\naddressing the benefits and risks of federalism versus confederal\narrangements, leading eventually to the Constitution that took effect\nin 1789.\n\nThe “Anti-federalists” were fearful of undue\ncentralization. They worried that the powers of central authorities\nwere not sufficiently constrained e.g., by a bill of rights (John\nDeWitt 1787) that was eventually ratified in 1791. They also feared\nthat the center might gradually usurp the member units’ powers.\nCiting Montesquieu, another pseudonymous ‘Brutus’ doubted\nwhether a republic of such geographical size with so many inhabitants\nwith conflicting interests could avoid tyranny and would allow common\ndeliberation and decision based on local knowledge (Brutus (Robert\nYates?) 1787).\n\nIn The Federalist Papers, James Madison (1751–1836),\nAlexander Hamilton (1755–1804) and John Jay (1745–1829)\nargued vigorously for the suggested model of interlocking federal\narrangements (Federalist 10, 45, 51, 62). Madison and Hamilton agreed\nwith Hume that the risk of tyranny by passionate majorities was\nreduced in larger republics where member units of shared interest\ncould and would check each other: “A rage for paper money, for\nan abolition of debts, for an equal division of property, or for any\nimproper or wicked project, will be less likely to pervade the whole\nbody of the Union than a particular member of it.” (Federalist\n10). Splitting sovereignty between member unit and center would also\nprotect individuals’ rights against abuse by authorities at\neither level, or so believed Hamilton, quoting Montesquieu at length\nto this effect (Federalist 9).\n\nNoting the problems of allocating powers correctly, Madison supported\nplacing some authority with member units since they would be best fit\nto address “local circumstances and lesser interests”\notherwise neglected by the center (Federalist 37).\n\nMadison and Hamilton urged centralized powers of defense and\ninterstate commerce (Federalist 11, 23), and argued for the need to\nsolve coordination and assurance problems of partial compliance,\nthrough two new means: Centralized enforcement and direct\napplicability of central decisions to individuals (Federalist 16, also\nnoted by Tocqueville 1835–40). They were wary of granting member\nunits veto power typical of confederal arrangements, since that would\nrender the center weak and cause “tedious delays; continual\nnegotiation and intrigue; contemptible compromises of the public\ngood.” (Madison and Hamilton, Federalist 22; and cf. 20).\n\nThey were particularly concerned to address worries of undue\ncentralization, arguing that such worries should be addressed not by\nconstraining the extent of power in the relevant fields, such as\ndefense, but instead by the composition of the central authority\n(Federalist 31). They also claimed that the people would maintain\nstronger “affection, esteem, and reverence” towards the\nmember unit government owing to its public visibility in the\nday-to-day administration of criminal and civil justice (Federalist\n17).\n\nJohn Stuart Mill (1806–1873), in chapter 17 of\nConsiderations on Representative Government (1861),\nrecommended federations among “portions of mankind” not\ndisposed to live under a common government, to prevent wars among\nthemselves and protect against aggression. He would also allow the\ncenter sufficient powers so as to ensure all benefits of\nunion—including powers to prevent frontier duties to facilitate\ncommerce. He listed three necessary conditions for a federation:\nsufficient mutual sympathy “of race, language, religion, and,\nabove all, of political institutions, as conducing most to a feeling\nof identity of political interest”; no member unit so powerful\nas to not require union for defense nor tempt unduly to secession; and\nrough equality of strength among member units to prevent internal\ndomination by one or two. Mill also claimed among the benefits of\nfederations that they reduce the number of weak states hence reduce\ntemptation to aggression, ending wars and restrictions on commence\namong member units; and that federations are less aggressive, only\nusing their power defensively. Further benefits from\nfederations—and from decentralized authority in\ngeneral—might include learning from ‘experiments in\nliving’.\n\nPierre-Joseph Proudhon (1809–1865), in Du Principe\nfédératif (1863) defended federalism as the best\nway to retain individual liberty within ‘natural’\ncommunities such as families and guilds who enter pacts among\nthemselves for necessary and specific purposes. The state is only one\nof several non-sovereign agents in charge of coordinating, without\nfinal authority.\n\nWhile Proudhon was wary of centralisation, authors such as Harold\nLaski warned of ‘The Obsolesence of Federalism’ (1939).\nThe important problems, such as those wrought by ‘giant\ncapitalism,’ require more centralised responses than federal\narrangements can muster.\n\nPhilosophical reflections on federalism were invigorated during and\nafter the Second World War, for several reasons. Altiero Spinelli and\nErnesto Rossi called for a European federal state in the Ventotene\nManifesto, published 1944. They condemned totalitarian,\ncentralised states and the never ending conflicts among them. Instead\nthere should be enough shared control over military and economic\npower, yet “each State will retain the autonomy it needs for a\nplastic articulation and development of political life according to\nthe particular characteristics of the various peoples.” Many\nexplain and justify the European Union along precisely these lines,\nwhile others are more critical.\n\nHannah Arendt (1906–1975) traced both totalitarianism and\nindustrialized mass murder to flaws in the sovereign nation-state\nmodel. Skeptical both of liberal internationalism and political\nrealism, she instead urged a Republican federal model or ideal type\nwherein “the federated units mutually check and control their\npowers” (Arendt 1972).\n\nThe exit of colonial powers also left multi-ethnic states that\nrequired creative solutions to combine self rule and shared rule\n(Karmis and Norman 2005). In addition, globalisation has prompted not\nonly integration and harmonisation, but also—partly in\nresponse—explorations of ways to still maintain some local self\nrule (Watts 1998).\n\nDevelopments of the European Union and backlash against its particular\nforms of political and legal integration is one major cause of renewed\nattention to the philosophy of federalism. Recent philosophical\ndiscussions have addressed several issues, including centrally the\nreasons for federalism, and attention to the sources of stability and\ninstability; the legitimate division of power between member unit and\ncenter; distributive justice, challenges to received democratic\ntheory, and concerns about the politics of recognition.\n3. Reasons for Federalism\n\nMany arguments for federalism have traditionally been put in terms of\npromoting various forms of liberty in the form of non-domination,\nimmunity or enhanced opportunity sets (Elazar 1987a). When considering\nreasons offered in the literature for federal political orders, many\nappear to be in favor of decentralization without requiring\nconstitutional entrenchment of split authority. Two sets of arguments\ncan be distinguished: Arguments favoring federal orders compared with\nsecession and completely independent sovereign states; and arguments\nsupporting federal arrangements rather than a (further) centralized\nunitary state. They occur in different forms and from different\nstarting points, in defense of ‘coming together’\nfederalism, and in favor of ‘holding together’\nfederalism.\n3.1 Reasons for a federal order rather than separate states or secession\n\nThere are several suggested reasons for a federal order rather than\nseparate states or secession.\n\nFederations can facilitate some objectives of sovereign states,\nsuch as credible commitments, certain kinds of coordination to secure\n‘public goods’ of various sorts, and to control\nexternalities that affect other parties, by transferring some powers\nto a common body. Since cooperation in some areas can ‘spill\nover’ and create demands for further coordination in other\nsectors, federations often exhibit creeping centralisation. Note that\nseveral of these objectives require getting the allocation of\ncompetences and veto points right within the federal order. For some\ncomplex common objectives such as environmental problems, federal\nfeatures otherwise risk becoming part of the problem (Adler 2005,\nDalmazzone 2006).\n\n\nFederations may foster peace, in the senses of preventing wars and\npreventing fears of war, in several ways. States can join a\n(con)federation to become jointly powerful enough to dissuade external\naggressors, and/or to prevent aggressive and preemptive wars among\nthemselves. The European federalists Altieri Spinelli, Ernesto Rossi\nand Eugenio Colorni argued the latter in the 1941 Ventotene Manifesto:\nOnly a European federation could prevent war between totalitarian,\naggressive states. Such arguments assume, of course, that the\n(con)federation will not become more aggressive than each state\nseparately, a point Mill argued. \n\n\nFederations can promote economic prosperity by removing\ninternal barriers to trade, through economies of scale, by\nestablishing and maintaining inter-member unit trade agreements, or by\nbecoming a sufficiently large global player to affect international\ntrade regimes (for the latter regarding the EU, cf. Keohane and Nye\n2001, 260). \n\n\nFederal arrangements may protect individuals against political\nauthorities by constraining state sovereignty, placing some powers\nwith the center. By entrusting the center with authority to intervene\nin member units, the federal arrangements can protect\nminorities’ human rights against member unit authorities\n(Federalist, Watts 1999). Such arguments assume, of course, that abuse\nby the center is less likely. \n\n\nFederal arrangements may enhance the political influence of\nformerly sovereign governments, both by facilitating coordination,\nand—particularly for small states—by giving these member\nunits influence or even veto over policy making, rather than remaining\nmere policy takers. \n\n\nFederal political orders can be preferred as the appropriate form of\nnested organizations, for instance in ‘organic’\nconceptions of the political and social order. The federation may\npromote cooperation, justice or other values among and within member\nunits as well as among and within their constituent units, for\ninstance by monitoring, legislating, enforcing or funding agreements,\nhuman rights, immunity from interference, or development. Starting\nwith the family, each larger unit responsible for facilitating the\nflourishing of member units and securing common goods beyond their\nreach without a common authority. Such arguments have been offered by\nsuch otherwise divergent authors as Althusius, the Catholic traditions\nof subsidiarity as expressed by popes Leo XIII (1891) and Pius XI\n(1931), and Proudhon. \n\n3.2 Reasons to prefer federal orders over a unitary state\n\nThere are several arguments that may apply in favor of federal orders\nover a unitary state. Among the challenges for some of these arguments\nis how to allocate authority when there are conflicting claims to\nprovide different benefits for partly overlapping groups; and how to\nconstruct overrides in cases of emergencies such as pandemics\n(Steytler 2021). Who has the power to decide what are exceptions is\nimportant, even if we may disagree with Schmitt that it defines who is\nsovereign (Schmitt 1985).\n\n\n\nFederal arrangements may protect against central authorities by\nsecuring immunity and non-domination for minority groups or nations.\nConstitutional allocation of powers to a member unit protects\nindividuals from the center, while interlocking arrangements provide\ninfluence on central decisions via member unit bodies (Madison, Hume,\nGoodin 1996). Member units may thus check central authorities and\nprevent undue action contrary to the will of minorities: “A\ngreat democracy must either sacrifice self-government to unity or\npreserve it by federalism. The coexistence of several nations under\nthe same State is a test, as well as the best security of its freedom\n… The combination of different nations in one State is as\nnecessary a condition of civilized life as the combination of men in\nsociety” (Acton 1907, 277). \n\n\nMore specifically, federal arrangements can accommodate minority\nnations who aspire to self determination, political expressions of\ntheir sense of shared identity and belonging, and the preservation of\ntheir culture, language or religion (Carla 2012). Such autonomy and\nimmunity arrangements are clearly preferable to the political\nconflicts that might result from such groups’ attempts at\nsecession. Central authorities may respond with human rights abuses,\ncivil wars or ethnic cleansing to prevent such secessionist\nmovements. \n\n\nFederal orders may increase the opportunities for citizen\nparticipation in public decision-making; through deliberation and\noffices in both member unit and central bodies that ensures character\nformation through political participation among more citizens (Mill\n1861, ch. 15). \n\n\nFederal orders may facilitate learning by fostering alternative\nsolutions to similar problems and sharing lessons from such a\nlaboratory of ‘experiments in living’ (Rose-Ackerman\n1980). \n\n\nFederations may facilitate efficient preference maximization more\ngenerally, as formalized in the literature on economic and fiscal\nfederalism—though many such arguments support decentralization\nrather than federalism proper. Research on ‘fiscal\nfederalism’ addresses the optimal allocation of authority,\ntypically recommending central redistribution but local provision of\npublic goods. Federal arrangements may allow more optimal matching of\nthe authority to create public goods to specific affected subsets of\nthe populations. If individuals’ preferences vary systematically\nby territory according to external or internal parameters such as\ngeography or shared tastes and values, federal—or\ndecentralized—arrangements that allow local variation may be\nwell suited for several reasons. Local decisions prevent overload of\ncentralised decision-making, and local decision-makers may also have a\nbetter grasp of affected preferences and alternatives, making for\nbetter service than would be provided by a central government that\ntends to ignore local preference variations (Smith 1776, 680).\nGranting powers to population subsets that share preferences regarding\npublic services may also increase efficiency by allowing these subsets\nto create such ‘internalities’ and ‘club\ngoods’ at costs borne only by them (Musgrave 1959, 179–80,\nOlson 1969, Oates’ 1972 ‘Decentralization\nTheorem’). \n\n\nFederal arrangements can also shelter territorially based groups with\npreferences that diverge from the majority population, such as ethnic\nor cultural minorities, so that they are not subject to majority\ndecisions severely or systematically contrary to their preferences.\nNon-unitary arrangements may thus minimize coercion and be responsive\nto as many citizens as possible (Mill 1861 ch. 15, Elazar 1968;\nLijphart 1999). Such considerations of economic efficiency and\nmajority decisions may favor federal solutions, with “only\nindivisibilities, economies of scale, externalities, and strategic\nrequirements … acceptable as efficiency arguments in favor of\nallocating powers to higher levels of government”\n(Padou-Schioppa 1995, 155). \n\n\nFederal arrangements may not only protect existing clusters of\nindividuals with shared values or preferences, but may also promote\nmobility and hence territorial clustering of individuals with similar\npreferences. Member unit autonomy to experiment may foster competition\nfor individuals who are free to move where their preferences are best\nmet. Such mobility towards member units with like-minded individuals\nmay add to the benefits of local autonomy over the provision of public\nservices—absent economies of scale and externalities (Tiebout\n1956, Buchanan 2001)—though the result may be that those with\ncostly needs and who are less mobile are left worse off. \n\n4. Further Philosophical Issues\n\nMuch recent attention has focused on philosophical issues arising from\nempirical findings concerning federalism (for an overview of such\nempirical research, cf. Burris 2015), and has been spurred by quite\ndifferent dilemmas facing—inter alia—Canada, Australia,\nNepal, Ethiopia, several European states and the European Union.\n4.1 Sovereignty or federalism\n\nThe tensions between sovereignty and federalism still pose puzzles,\nreflected in ‘international’ and ‘national’\nunderstandings of the latter (Schütze 2009). If sovereignty is a\nunique site of final and independent authority, federal orders cannot\nbe sovereign, since no one has the ‘last word’ on all\npolitical matters (Friedrich 1968), and “authority and power are\ndispersed among a network of arenas” (Elazar 1994, xiii).\nAnother tradition, including Madison (Federalist Paper 39), and more\nrecently Beaud (2009) and Schütze (2009), seeks to square the\ncircle allowing dual sovereignty. Several contributions to the\npolitical and legal theory of the European Union resolve these issues\nin different directions (Bellamy 2019; Schütze 2020).\n4.2 Issues of Constitutional and Institutional Design\n\nFederal political orders require attention to several constitutional\nand other institutional issues. The great variation and how the\nfeatures interact require careful comparative studies to understand\ntheir impact on law and politics (Palermo and Kössler 2017). The\ndesign of federal orders raise peculiar and intriguing issues of\nnormative political theory (Watts 1998; Norman 2006).\n\n\n\nComposition: How to determine the boundaries of the member units,\ne.g., along geographical, ethnic or cultural lines; whether\nestablishment of new member units from old should require\nconstitutional changes, whether to allow secession and if so how,\netc. \n\n\nDistribution of Power: The allocation of legislative, executive,\njudicial and constitution-amending power between the member\nunits and the central institutions. In asymmetric arrangements some of\nthese may differ among member units. \n\n\nPower Sharing: The form of influence by member units in central\ndecision-making bodies within the interlocking political systems.\n\n\n\nThese tasks must be resolved taking due account of several important\nconsiderations noted below.\n4.3 Sources of Stability\n\nAs political orders go, federal political arrangements pose peculiar\nproblems concerning stability and trust. Federations tend to drift\ntoward disintegration in the form of secession, or toward\ncentralization in the direction of a unitary state.\n\nSuch instability should come as no surprise given the tensions\ntypically giving rise to federal political orders in the first place,\nsuch as tensions between majority and minority national communities in\nmultinational federations. Federal political orders are therefore\noften marked by a high level of ‘constitutional\ncontestation’. The details of their constitutions and other\ninstitutions may affect these conflicts and their outcomes in drastic\nways. Political parties often disagree on constitutional issues\nregarding the appropriate areas of member unit autonomy, the forms of\ncooperation and how to prevent fragmentation. Such sampling bias among\nstates that federalize to hold together makes it difficult to assess\noften heard claims that federal responses such as granting some local\nautonomy perpetuate cleavages and fuel rather than quell secessionist\nmovements. Some nevertheless argue that democratic, interlocking\nfederations alleviate such tendencies (Simeon 1998, Simeon and Conway\n2001, Linz 1997; cf. McKay 2001, Filippov, Ordeshook and Shvetsova\n2004).\n\nMany authors note that the challenges of stability must be addressed\nnot only by institutional design, but also by ensuring that citizens\nhave an ‘overarching loyalty’ or ‘federal\nspirit’ to the federation as whole in addition to loyalty toward\ntheir own member unit (Franck 1968, Linz 1997, Burgess 2012). The\nlegitimate bases, content and division of such a public dual\nallegiance are central topics of political philosophies of federalism\n(Norman 1995a, Choudhry 2001). Some accept (limited) appeals to\nconsiderations such as shared history, practices, culture, or\nethnicity for delineating member units and placing certain powers with\nthem, even if such ‘communitarian’ features are regarded\nas more problematic bases for (unitary) political orders (Kymlicka\n1995, Habermas 1996, 500). Debates about the existence of a\n‘European demos’ and the need for a common ‘European\nidentity’ merit more careful scrutiny (Habermas 1992). The\nappropriate consideration that voters and their member unit\npoliticians should give to the interests of others in the federation\nin interlocking arrangements must be clarified if the notion of\ncitizen of two commonwealths is to be coherent and durable. Several of\nthese challenges are especially acute for ‘ethnic\nfederalism’ when the member units are delineated along ethnic\nlines: Any ‘internal minorities’ of other ethnicity risk\npersecution, the prospects of an overarching loyalty are dimmer, and\nethnic nationalism may fuel secessionist movements (Selassie 2003)\n4.4 Division of Power\n\nAnother and related central philosophical topic is the critical\nassessment of alleged grounds for federal arrangements in general, and\nthe division of power between member units and central bodies in\nparticular, indicated in the preceding sections. Recent contributions\ninclude Knop et al. 1995, Kymlicka 2001, Kymlicka and Norman\n2000, Nicolaidis and Howse 2001, Norman 2006. Among the important\nissues, especially due to the risks of instability, are:\n\n\n\nHow the powers should be allocated, given that they should be\nused—but may be abused—by political entrepreneurs at\nseveral levels to affect their claims. The concerns about stability\nrequire careful attention to the impact of these powers on the ability\nto create and maintain ‘dual loyalties’ among the\ncitizenry. \n\n\nHow to ensure that neither member units nor the central authorities\noverstep their jurisdiction. As Mill noted, “the power to decide\nbetween them in any case of dispute should not reside in either of the\ngovernments, or in any functionary subject to it, but in an umpire\nindependent of both.” (1861) Such a court must be sufficiently\nindependent, yet not utterly unaccountable. Many scholars seem to\ndetect a centralising tendency among such courts (Watts 1998).\n\n\n\nHow to maintain sufficient democratic control over central bodies when\nthese are composed by representatives of the executive branch of\nmember units? The chains of accountability may be too long for\nadequate responsiveness. This is part of the core concerns about a\n‘democratic deficit’ in the European Union (Watts 1998,\nFøllesdal and Hix 2006). \n\n\nWho shall have the authority to revise the constitutionally embedded\ndivision of power? Some hold that a significant shift in national\nsovereignty occurs when such changes may occur without the unanimity\ncharacteristic of treaties. \n\n\nThe “Principle of Subsidiarity” has often been used to\nguide the decisions about allocation of power. This principle has\nrecently received attention owing to its inclusion in European Union\ntreaties. It holds that authority should rest with the member units\nunless allocating them to a central unit would ensure higher\ncomparative efficiency or effectiveness in achieving certain goals.\nThis principle can be specified in several ways, for instance\nconcerning which units are included, which goals are to be achieved,\nand who has the authority to apply it. The principle has multiple\npedigrees, and came to recent political prominence largely through its\nrole in quelling fears of centralization in Europe—a contested\nrole which the principle has not quite filled (Fleiner and Schmitt\n1996, Burgess and Gagnon 1993, Føllesdal 1998).\n4.5 Distributive Justice\n\nRegarding distributive justice, federal political orders must manage\ntensions between ensuring member unit autonomy and securing the\nrequisite redistribution within and among the member units. Indeed,\nthe Federalists regarded federal arrangements as an important\nsafeguard against “the equal division of property”\n(Federalist 10). The political scientists Linz and Stepan may be seen\nas finding support for the Federalists’ hypothesis: Compared to\nunitary states in the OECD, the ‘coming together’\nfederations tend to have higher child poverty rate in solo mother\nhouseholds and a higher percentage of population over-sixty living in\npoverty. Linz and Stepan explain this inequality as stemming from the\n‘demos constraining’ arrangements of these federations,\nseeking to protect individuals and member units from central\nauthorities, combined with a weak party system. By comparison, the\nConstitution of Germany (not a ‘coming together’\nfederation) explicitly requires equalization of living conditions\namong the member units (Art. 72.2). Presbey argues that ethnic\nfederalism further exacerbates unfair distribution of resources among\nindividuals of different ethnic groups in Africa (Presbey 2003).\nNormative arguments may also support some distributive significance of\nfederal arrangements, for instance owing to trade-offs between member\nunit autonomy and redistributive claims among member units\n(Føllesdal 2001), or the relevance of a shared\n‘identity‘ (Grégoire and Jewkes 2015, de Schutter\n2011). A central normative issue is to what extent a shared culture\nand bonds among citizens within a historically sovereign state reduce\nthe claims on redistribution among the member units.\n4.6 Democratic Theory\n\nFederalism may increase citizens’ control over matters important\nto them but also raises several challenges to democratic theory,\nespecially as developed for unitary states. Federal arrangements are\noften more complex, thereby challenging standards of transparency,\naccountability and public deliberation (Habermas 2001). The restricted\npolitical agendas of each center of authority also require defense\n(Dahl 1983; Braybrooke 1983). One of several sets of issues concern\nthe standing of member units. Challenging puzzles concern federal\norders where some or all units are not internally democratic (for\nfurther issues, cf., Norman 2006, 144–150).\n\nThe power that member units wield in federations often restricts or\nviolates majority rule, in ways that merit careful scrutiny.\nDemocratic theory has long been concerned with how to prevent\ndomination of minorities, and many federal political orders do so by\ngranting member units some influence over common decisions. Federal\npolitical orders typically influence individuals’ political\ninfluence by skewing their voting weight in favor of citizens of small\nmember units, or by granting member unit representatives veto rights\non central decisions. Minorities thus exercise control in apparent\nviolation of principles of political equality and\none-person-one-vote—more so when member units are of different\nsize. These features raises fundamental normative questions concerning\nwhy member units should matter for the allocation of political power\namong individuals who live in different member units. Some of these\npuzzles are addressed in terms of ‘demoicracy’, especially\nregarding the European Union (van Parijs 1997, Nicolaidis 2012,\nSchütze 2020). Thus theorists disagree about whether every EU\nmember state should maintain sovereignty in the sense of enjoying a\nveto for all decisions (Bellamy 2019, Cheneval et al 2015).\n4.7 Politics of Recognition\n\nMany federal political orders accommodate minority groups in two ways\ndiscussed above: both through a division of power, and by granting\nthem influence over common decisions. These measures of\n identity politics\n can be valuable ways to give public acknowledgment and recognition to\ngroups and their members, sometimes on the very basis of previous\ndomination. But identity politics also create challenges (Gutman\n1994), especially in federal arrangements that face greater risks of\ninstability and must maintain citizens’ dual political\nloyalties. Self-government arrangements may threaten the federal\npolitical order: “demands for self-government reflect a desire\nto weaken the bonds with the larger community and, indeed, question\nits very nature, authority and permanence” (Kymlicka and Norman\n1994, 375). The emphasis on “recognition and\ninstitutionalization of difference could undermine the conditions that\nmake a sense of common identification and thus mutuality\npossible” (Carens 2000, 193).\n\nFederations are often thought to be sui generis,\none-of-a-kind deviations from the ideal-type unitary sovereign state\nfamiliar from the Westphalian world order. Indeed, every federation\nmay well be federal in its very own way, and not easy to summarize and\nassess as an ideal-type political order. Yet the phenomenon of\nnon-unitary sovereignty is not new, and federal accommodation of\ndifferences may well be better than the alternatives. When and why\nthis is so has long been the subject of philosophical, theoretical and\nnormative analysis and reflection. Such public arguments may\nthemselves contribute to develop the overarching loyalty required\namong citizens of stable, legitimate federations, who must understand\nthemselves as members of two commonwealths.\n",
    "bibliography": {
        "categories": [
            "Historical",
            "Contemporary"
        ],
        "cat_ref_text": {
            "Historical": [
                "</h3>\n<h4>Primary</h4>\n<p>\nSeveral of the historical writings—those marked ‘*’\nbelow and others—are reprinted in part or full in <em>Theories\nof Federalism: A Reader</em>, Dimitrios Karmis and Wayne Norman\n(eds.), New York: Palgrave, 2005.</p>\n<ul class=\"hanging\">",
                "Brutus, Junius (Philippe Duplessis-Mornay?), 1579, <em>Vindiciae\ncontra tyrannos</em>, George Garnett (transl. and ed.), Cambridge:\nCambridge University Press, 1994.",
                "*Althusius, Johannes, 1603, <em>Politica Methodice Digesta</em>,\nFrederick S. Carney (transl.), Daniel J. Elazar (introd.),\nIndianapolis: Liberty Press, 1995.",
                "Arendt, Hannah, 1972, “Thoughts on Politics and\nRevolution,” in <em>Crises of the Republic</em>, New York:\nHarcourt Brace, 199–233.",
                "Hugo, Ludolph, 1661, De Statu Regionum Germaniae. Helmstadt:\nSumptibus Hammianis.",
                "Saint-Pierre, Abbé Charles, 1713, <em>Projet pour rendre la\npaix perpêtuelle en Europe</em> (Project to make peace perpetual\nin Europe), Paris: Fayard, 1986.",
                "*Montesquieu, Baron de, 1748, <em>The Spirit of Laws</em>,\nAmherst, NY: Prometheus Books, 2002.",
                "*Rousseau, Jean-Jacques, 1761, <em>A Lasting Peace Through the\nFederation of Europe</em>, C.E. Vaughan (trans.), London: Constable,\n1917.",
                "*–––, 1761, “Summary and Critique of\nAbbé Saint-Pierre’s Project for Perpetual Peace,”\nin Grace G. Roosevelt (ed.), <em>Reading Rousseau in the Nuclear\nAge</em>, Philadelphia: Temple University Press, 1990.",
                "Hume, David, 1752, “Idea of a Perfect Commonwealth,”\nin T.H. Green and T.H. Grose (eds.), <em>Essays moral, political and\nliterary</em>, London: Longmans, Green, 1882",
                "Smith, Adam, 1776, <em>An Inquiry into the Nature and Causes of\nthe Wealth of Nations</em>, London: Dent, 1954.",
                "Storing, Herbert, and Murray Dry (eds.), 1981, <em>The Complete\nAnti-Federalist</em> (7 Volumes), Chicago: University of Chicago\nPress.",
                "*Hamilton, Alexander, James Madison, and John Jay, 1787–88,\n<em>The Federalist Papers</em>, Jacob E. Cooke (ed.), Middletown, CT:\nWesleyan University Press, 1961.",
                "Kant, Immanuel, 1784, “An Answer to the Question:\n‘What Is Enlightenment?’” in Hans Reiss (ed.),\n<em>Kant’s Political Writings</em>, Cambridge: Cambridge\nUniversity Press, 1970, 54–60.",
                "*–––, 1796, “Perpetual Peace: A\nPhilosophical Sketch,” in Hans Reiss (ed.), <em>Kant’s\nPolitical Writings</em>, Cambridge: Cambridge University Press, 1970,\n93–130.",
                "*de Tocqueville, Alexis, 1835–40, <em>Democracy in\nAmerica</em>, P. Bradley (ed.), New York: Vintage, 1945\n [<a href=\"https://www.gutenberg.org/ebooks/815\" target=\"other\">Text available online</a>].",
                "*Mill, John Stuart, 1861, <em>Considerations on Representative\nGovernment</em>, New York: Liberal Arts Press, 1958\n [<a href=\"http://www.gutenberg.org/ebooks/5669\" target=\"other\">Text available online</a>].",
                "*Proudhon, Pierre Joseph, 1863, <em>Du Principe Federatif</em>,\nJ.-L. Puech and Th. Ruyssen (eds.), Paris: M. Riviere, 1959.",
                "Leo XIII, 1891, “Rerum Novarum,” in <em>The Papal\nEncyclicals 1903–1939</em>, Raleigh: Mcgrath, 1981.",
                "Renner, Karl, 1899, <em>Staat und Nation</em>, Vienna. Reprinted\nas “State and Nation” in Ephraim Nimni (ed.), <em>National\nCultural Autonomy and Its"
            ],
            "Contemporary": [
                "Critics</em>, London:\nRoutledge, 2005, 64–82.",
                "Pius XI, 1931. “Quadragesimo Anno,” in <em>The Papal\nEncyclicals 1903–1939</em>, Raleigh: Mcgrath, 1981.",
                "*Spinelli, Altiero, and Ernesto Rossi, 1944, <em>Il manifesto di\nVentotene</em> (<em>The Ventotene Manifesto</em>), Naples: Guida,\n1982; reprinted in Karmis and Norman 2005.\n [<a href=\"https://web.archive.org/web/20150329020754/http://www.altierospinelli.org/manifesto/manifesto_en.html\" target=\"other\">Text available online</a>]",
                "Vattel, Emmerich, 1758 (2008), “The Law of Nations (Le Droit\nDes Gens),” in <em>The Classics of International Law, edited by\nBela Kapossy and Richard Whatmore</em>, Indianapolis: Liberty\nFund.\n</ul>\n<h4>Secondary sources</h4>\n<ul class=\"hanging\">",
                "Aroney, Nicholas, 2007, “Subsidiarity, Federalism and the\nBest Constitution: Thomas Aquinas on City, Province and Empire,”\n<em>Law and Philosophy</em>, 26(2): 161–228.",
                "Dimitrios, Karmis, 2010, “Togetherness in Multinational\nFederal Democracies. Tocqueville, Proudhon and the Theoretical Gap in\nthe Modern Federal Tradition,” in M. Burgess and A. G. Gagnon\n(eds.), <em>Federal Democracies</em>, Abingdon: Routledge,\n46–63.",
                "Elazar, Daniel J., 1987, <em>Federalism As Grand Design: Political\nPhilosophers and the Federal Principle</em>, Lanham, MD: University\nPress of America.",
                "Forsyth, Murray, 1981, <em>Union of States: the Theory and\nPractice of Confederation</em>, Leicester: Leicester University\nPress.",
                "Hueglin, Thomas O., 1999, <em>Early Modern Concepts for a Late\nModern World: Althusius on Community and Federalism</em>, Waterloo,\nOntario: Wilfrid Laurier University Press.",
                "Jewkes, Michael, 2016, “Diversity, Federalism and the\nNineteenth-Century Liberals,” <em>Critical Review of\nInternational Social and Political Philosophy</em>, 19(2):\n184–205.",
                "Klusmeyer, Douglas, 2010, “Hannah Arendt’s Case for\nFederalism,” <em>Publius</em>, 40(1): 31–58.",
                "Levinson, Sanford, 2015, <em>An Argument Open to All: Reading\n“the Federalist” in the 21st Century</em>, New Haven: Yale\nUniversity Press.",
                "Riley, Patrick, 1973, “Rousseau As a Theorist of National\nand International Federalism,” <em>Publius</em>, 3(1):\n5–18.",
                "–––, 1976, “Three Seventeenth-Century\nTheorists of Federalism: Althusius, Hugo and Leibniz,”\n<em>Publius</em>, 6(3): 7–42.",
                "–––, 1979, “Federalism in Kant’s\nPolitical Philosophy,” <em>Publius</em>, 9(4): 43–64.",
                "Stoppenbrink, Katja, 2016, “Representative Government and\nFederalism in John Stuart Mill,” in D. Heidemann and K.\nStoppenbrink (eds.), <em>Join, or Die: Philosophical Foundations of\nFederalism</em>, Berlin: de Gruyter: 209–232.\n</ul>\n<h3 id=\"Cont\">"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"Hist\">Historical</h3>\n<h4>Primary</h4>\n<p>\nSeveral of the historical writings—those marked ‘*’\nbelow and others—are reprinted in part or full in <em>Theories\nof Federalism: A Reader</em>, Dimitrios Karmis and Wayne Norman\n(eds.), New York: Palgrave, 2005.</p>\n<ul class=\"hanging\">\n<li>Brutus, Junius (Philippe Duplessis-Mornay?), 1579, <em>Vindiciae\ncontra tyrannos</em>, George Garnett (transl. and ed.), Cambridge:\nCambridge University Press, 1994.</li>\n<li>*Althusius, Johannes, 1603, <em>Politica Methodice Digesta</em>,\nFrederick S. Carney (transl.), Daniel J. Elazar (introd.),\nIndianapolis: Liberty Press, 1995.</li>\n<li>Arendt, Hannah, 1972, “Thoughts on Politics and\nRevolution,” in <em>Crises of the Republic</em>, New York:\nHarcourt Brace, 199–233.</li>\n<li>Hugo, Ludolph, 1661, De Statu Regionum Germaniae. Helmstadt:\nSumptibus Hammianis.</li>\n<li>Saint-Pierre, Abbé Charles, 1713, <em>Projet pour rendre la\npaix perpêtuelle en Europe</em> (Project to make peace perpetual\nin Europe), Paris: Fayard, 1986.</li>\n<li>*Montesquieu, Baron de, 1748, <em>The Spirit of Laws</em>,\nAmherst, NY: Prometheus Books, 2002.</li>\n<li>*Rousseau, Jean-Jacques, 1761, <em>A Lasting Peace Through the\nFederation of Europe</em>, C.E. Vaughan (trans.), London: Constable,\n1917.</li>\n<li>*–––, 1761, “Summary and Critique of\nAbbé Saint-Pierre’s Project for Perpetual Peace,”\nin Grace G. Roosevelt (ed.), <em>Reading Rousseau in the Nuclear\nAge</em>, Philadelphia: Temple University Press, 1990.</li>\n<li>Hume, David, 1752, “Idea of a Perfect Commonwealth,”\nin T.H. Green and T.H. Grose (eds.), <em>Essays moral, political and\nliterary</em>, London: Longmans, Green, 1882</li>\n<li>Smith, Adam, 1776, <em>An Inquiry into the Nature and Causes of\nthe Wealth of Nations</em>, London: Dent, 1954.</li>\n<li>Storing, Herbert, and Murray Dry (eds.), 1981, <em>The Complete\nAnti-Federalist</em> (7 Volumes), Chicago: University of Chicago\nPress.</li>\n<li>*Hamilton, Alexander, James Madison, and John Jay, 1787–88,\n<em>The Federalist Papers</em>, Jacob E. Cooke (ed.), Middletown, CT:\nWesleyan University Press, 1961.</li>\n<li>Kant, Immanuel, 1784, “An Answer to the Question:\n‘What Is Enlightenment?’” in Hans Reiss (ed.),\n<em>Kant’s Political Writings</em>, Cambridge: Cambridge\nUniversity Press, 1970, 54–60.</li>\n<li>*–––, 1796, “Perpetual Peace: A\nPhilosophical Sketch,” in Hans Reiss (ed.), <em>Kant’s\nPolitical Writings</em>, Cambridge: Cambridge University Press, 1970,\n93–130.</li>\n<li>*de Tocqueville, Alexis, 1835–40, <em>Democracy in\nAmerica</em>, P. Bradley (ed.), New York: Vintage, 1945\n [<a href=\"https://www.gutenberg.org/ebooks/815\" target=\"other\">Text available online</a>].</li>\n<li>*Mill, John Stuart, 1861, <em>Considerations on Representative\nGovernment</em>, New York: Liberal Arts Press, 1958\n [<a href=\"http://www.gutenberg.org/ebooks/5669\" target=\"other\">Text available online</a>].</li>\n<li>*Proudhon, Pierre Joseph, 1863, <em>Du Principe Federatif</em>,\nJ.-L. Puech and Th. Ruyssen (eds.), Paris: M. Riviere, 1959.</li>\n<li>Leo XIII, 1891, “Rerum Novarum,” in <em>The Papal\nEncyclicals 1903–1939</em>, Raleigh: Mcgrath, 1981.</li>\n<li>Renner, Karl, 1899, <em>Staat und Nation</em>, Vienna. Reprinted\nas “State and Nation” in Ephraim Nimni (ed.), <em>National\nCultural Autonomy and Its Contemporary Critics</em>, London:\nRoutledge, 2005, 64–82.</li>\n<li>Pius XI, 1931. “Quadragesimo Anno,” in <em>The Papal\nEncyclicals 1903–1939</em>, Raleigh: Mcgrath, 1981.</li>\n<li>*Spinelli, Altiero, and Ernesto Rossi, 1944, <em>Il manifesto di\nVentotene</em> (<em>The Ventotene Manifesto</em>), Naples: Guida,\n1982; reprinted in Karmis and Norman 2005.\n [<a href=\"https://web.archive.org/web/20150329020754/http://www.altierospinelli.org/manifesto/manifesto_en.html\" target=\"other\">Text available online</a>]</li>\n<li>Vattel, Emmerich, 1758 (2008), “The Law of Nations (Le Droit\nDes Gens),” in <em>The Classics of International Law, edited by\nBela Kapossy and Richard Whatmore</em>, Indianapolis: Liberty\nFund.</li>\n</ul>\n<h4>Secondary sources</h4>\n<ul class=\"hanging\">\n<li>Aroney, Nicholas, 2007, “Subsidiarity, Federalism and the\nBest Constitution: Thomas Aquinas on City, Province and Empire,”\n<em>Law and Philosophy</em>, 26(2): 161–228.</li>\n<li>Dimitrios, Karmis, 2010, “Togetherness in Multinational\nFederal Democracies. Tocqueville, Proudhon and the Theoretical Gap in\nthe Modern Federal Tradition,” in M. Burgess and A. G. Gagnon\n(eds.), <em>Federal Democracies</em>, Abingdon: Routledge,\n46–63.</li>\n<li>Elazar, Daniel J., 1987, <em>Federalism As Grand Design: Political\nPhilosophers and the Federal Principle</em>, Lanham, MD: University\nPress of America.</li>\n<li>Forsyth, Murray, 1981, <em>Union of States: the Theory and\nPractice of Confederation</em>, Leicester: Leicester University\nPress.</li>\n<li>Hueglin, Thomas O., 1999, <em>Early Modern Concepts for a Late\nModern World: Althusius on Community and Federalism</em>, Waterloo,\nOntario: Wilfrid Laurier University Press.</li>\n<li>Jewkes, Michael, 2016, “Diversity, Federalism and the\nNineteenth-Century Liberals,” <em>Critical Review of\nInternational Social and Political Philosophy</em>, 19(2):\n184–205.</li>\n<li>Klusmeyer, Douglas, 2010, “Hannah Arendt’s Case for\nFederalism,” <em>Publius</em>, 40(1): 31–58.</li>\n<li>Levinson, Sanford, 2015, <em>An Argument Open to All: Reading\n“the Federalist” in the 21st Century</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Riley, Patrick, 1973, “Rousseau As a Theorist of National\nand International Federalism,” <em>Publius</em>, 3(1):\n5–18.</li>\n<li>–––, 1976, “Three Seventeenth-Century\nTheorists of Federalism: Althusius, Hugo and Leibniz,”\n<em>Publius</em>, 6(3): 7–42.</li>\n<li>–––, 1979, “Federalism in Kant’s\nPolitical Philosophy,” <em>Publius</em>, 9(4): 43–64.</li>\n<li>Stoppenbrink, Katja, 2016, “Representative Government and\nFederalism in John Stuart Mill,” in D. Heidemann and K.\nStoppenbrink (eds.), <em>Join, or Die: Philosophical Foundations of\nFederalism</em>, Berlin: de Gruyter: 209–232.</li>\n</ul>\n<h3 id=\"Cont\">Contemporary</h3>\n<p>\n<em>Publius: The Journal of Federalism</em>, regularly publishes\nphilosophical articles.</p>\n<h4>Anthologies</h4>\n<ul class=\"hanging\">\n<li>Bakvis, Herman, and William M. Chandler (eds.), 1987,\n<em>Federalism and the Role of the State</em>, Toronto: Toronto\nUniversity Press.</li>\n<li>Bottomore, Tom and Patrick Goode (eds.), 1978,\n<em>Austro-Marxism</em>, Oxford: Oxford University Press.</li>\n<li>Burgess, Michael, and Alain G. Gagnon (eds.), 1993,\n<em>Comparative Federalism and Federation: Competing Traditions and\nFuture Directions</em>, London: Harvester Wheatsheaf.</li>\n<li>–––, 2010, <em>Federal Democracies</em>,\nAbingdon: Routledge.</li>\n<li>Fleiner, Thomas, and Nicolas Schmitt (eds.), 1996, <em>Towards\nEuropean Constitution: Europe and Federal Experiences</em>, Fribourg:\nInstitute of Federalism.</li>\n<li>Fleming, James E., and Jacob T. Levy (eds.), 2014, <em>Federalism\nand Subsidiarity</em>, <em>Nomos</em> (Volume 55), New York: New York\nUniversity Press.</li>\n<li>Franck, Thomas M. (ed.), 1968, <em>Why Federations Fail: An\nInquiry into the Requisites for Successful Federalism</em>, New York:\nNew York University Press.</li>\n<li>Gagnon, Alain-G., and James Tully (eds.), 2001, <em>Multinational\nDemocracies</em>, Cambridge: Cambridge University Press.</li>\n<li>Gaudreault-DesBiens, Jean-François, and Fabien\nGélinas (eds.), 2005, <em>The States and Moods of Federalism:\nGovernance, Identity and Methodology—Le\nFédéralisme Dans Tous Ses États : Gouvernance,\nIdentité Et Méthodologie</em> Quebec: Éditions\nYvon Blais.</li>\n<li>Grégoire, Jean-Francois, and Michael Jewkes, (eds.), 2015,\n<em>Recognition and Redistribution in Multinational Federations</em>,\nLeuven: Leuven University Press.</li>\n<li>Gutmann, Amy (ed.), 1994, <em>Multiculturalism: Examining the\nPolitics of Recognition</em>, Princeton: Princeton University\nPress.</li>\n<li>Härtel, Ines (ed.), 2012, <em>Handbuch Föderalismus:\n– Föderalismus als Demokratische Rechtsordnung und\nRechtskultur in Deutschland, Europa und der Welt</em>, 4 volumes,\nBerlin: Springer.</li>\n<li>Heidemann, Dietmar, and Katja Stoppenbrink (eds.), 2016, <em>Join,\nor Die: Philosophical Foundations of Federalism</em>, Berlin: De\nGruyter.</li>\n<li>Karmis, Dimitrios, and Wayne Norman (eds.), 2005, <em>Theories of\nFederalism: A Reader</em>, New York: Palgrave.</li>\n<li>Kincaid, John (ed.), 2011, <em>Federalism, 4 Vols.</em>, Sage\nLibrary of Political Science London.</li>\n<li>Knop, Karen, Sylvia Ostry, Richard Simeon and Katherine Swinton\n(eds.), 1995, <em>Rethinking Federalism: Citizens, Markets and\nGovernments in a Changing World</em>, Vancouver: University of British\nColumbia Press.</li>\n<li>Kymlicka, Will, and Wayne Norman (eds.), 2000, <em>Citizenship in\nDiverse Societies</em>, Oxford: Oxford University Press.</li>\n<li>Nicolaidis, Kalypso, and Robert Howse (eds.), 2001, <em>The\nFederal Vision: Legitimacy and Levels of Governance in the US and the\nEU</em>, Oxford: Oxford University Press.</li>\n<li>Nimni, Ephraim (ed.), 2005, <em>National-Cultural Autonomy and its\nContemporary Critics</em>, Milton Park: Routledge.</li>\n<li>Steytler, Nico (ed.) 2021. <em>Comparative federalism and\nCovid-19: Combating the Pandemic</em>, Routledge.</li>\n<li>Trechsel, Alexander (ed.), 2006, <em>Towards a Federal\nEurope</em>, London: Routledge.</li>\n<li>Tushnet, Mark (ed.), 1990, <em>Comparative Constitutional\nFederalism: Europe and America</em>, New York: Greenwood Press.</li>\n<li>Ward, Ann, and Lee Ward (eds.), 2009, <em>The Ashgate Research\nCompanion to Federalism</em>. Farnham: Ashgate.</li>\n</ul>\n<h4>Books and Articles</h4>\n<ul class=\"hanging\">\n<li>Acton, Lord, 1907, “Nationality,” in J. N. Figgis\n(ed.), <em>The History of Freedom and Other Essays</em>, London:\nMacmillan.</li>\n<li>Adler, Joseph H., 2005, “Jurisdictional mismatch in\nenvironmental federalism,” <em>New York University Environmental\nLaw Journal</em>, 14: 130–178.</li>\n<li>Ballara, Angela, 1998, <em>Iwi: The Dynamics of Māori Tribal\nOrganisation from C.1769 to C.1945</em>. Wellington: Victoria\nUniversity Press</li>\n<li>Bauer, Otto, 2000, <em>The Question of Nationalities and Social\nDemocracy</em> (with introduction by Ephraim Nimni), Minneapolis:\nUniversity of Minnesota Press. [original 1907, <em>Die\nNationalitätenfrage und die Sozialdemokratie</em>, Vienna].</li>\n<li>Beaud, Olivier, 2009. <em>Théorie de la\nFédération (2nd ed)</em>. Paris, PUF.</li>\n<li>Beer, Samuel H., 1993, <em>To Make a Nation: the Rediscovery of\nAmerican Federalism</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Bellamy, Richard, 2019, <em>A Republican Europe of States:\nCosmopolitanism, Intergovernmentalism and Democracy in the EU</em>.\nCambridge, Cambridge University Press.</li>\n<li>Bilo, Charlotte, and Anna Carolina Mechado, 2018, “The Role\nof Zakat in the Provision of Social Protection – a Comparison\nbetween Jordan, Palestine and Sudan,” <em>International Journal\nof Sociology and Social Policy</em> 40, no. 3/4: 236–48.</li>\n<li>Braybrooke, David, 1983, “Can Democracy Be Combined With\nFederalism or With Liberalism?” , in J. R. Pennock and John W.\nChapman (eds.), <em>Nomos XXV: Liberal Democracy</em>, New York,\nLondon: New York University Press.</li>\n<li>Buchanan, James, 1995, “Federalism as an ideal political\norder and an objective for constitutional reform,”\n<em>Publius</em>, 25(2): 19–27.</li>\n<li>–––, 1999/2001, <em>Federalism, Liberty and the\nLaw</em>, <em>Collected Works</em> (Volume 18), Indianapolis: Liberty\nFund.</li>\n<li>Burgess, M. 2012, <em>In Search of the Federal Spirit: New\nComparative Empirical and Theoretical Perspectives</em>, Oxford\nUniversity Press.</li>\n<li>Burris, A., 2015, “Federalism,” <em>International\nEncyclopedia of the Social &amp; Behavioral Sciences (Second\nEdition)</em>, J. D. Wright. Oxford, Elsevier: 875–877.</li>\n<li>Carens, J. H., 2000, <em>Culture, Citizenship, and Community. A\nContextual Exploration of Justice as Evenhandedness</em>, Oxford:\nOxford University Press.</li>\n<li>Carla, A., 2018, “Peace in South Tyrol and the Limits of\nConsociationalism,” <em>Nationalism and Ethnic Politics</em>,\n24(3): 251–275.</li>\n<li>Chan, Joseph, 2003. “Giving Priority to the Worst Off. A\nConfucian Perspective on Social Welfare,” in <em>Confucianism\nfor the Modern World</em>, edited by Daniel Bell and Hahm Chaibong,\n236–56. Cambridge: Cambridge University Press.</li>\n<li>Cheneval, Francis, Sandra Lavenex and Frank Schimmelfennig, 2015,\n“Demoi-cracy in the European Union: principles, institutions,\npolicies,” <em>Journal of European Public Policy</em> 22(1):\n1–18.</li>\n<li>Choudhry, Sujit, 2001, “Citizenship and Federations: Some\nPreliminary Reflections,” in Nicolaidis and Howse (eds.) 2001,\n377–402.</li>\n<li>Dahl, Robert A., 1983, “Federalism and the Democratic\nProcess,” in J. R. Pennock and J. W. Chapman (eds.), <em>NOMOS\nXXV: Liberal Democracy</em>, New York: New York University Press,\n95–108.</li>\n<li>–––, 2001, <em>How Democratic Is the American\nConstitution?</em>, New Haven: Yale University Press.</li>\n<li>Dalmazzone, Silvana, 2006, “Decentralization and the\nenvironment,” <em>Handbook of fiscal federalism</em>, E. Ahmad\nand G. Brosio (eds.), 459–477.</li>\n<li>Davis, S. Rufus, 1978, <em>The Federal Principle</em>. Berkeley:\nUniversity of California Press.</li>\n<li>De Schutter, Helder, 2011, “Federalism as Fairness,”\n<em>The Journal of Political Philosophy</em>, 19(2):\n167–189.</li>\n<li>Deuerlein, Ernst, 1972, <em>Föderalismus: Die Historischen\nUnd Philosophischen Grundlagen Des Föderativen Prinzips</em>.\nBerlin: List Verlag.</li>\n<li>Elazar, Daniel J., 1968, “Federalism,”\n<em>International Encyclopedia of the Social Sciences</em>, New York:\nMacmillan, p. 356–361.</li>\n<li>–––, 1987, <em>Exploring Federalism</em>,\nTuscaloosa: University of Alabama Press.</li>\n<li>–––, 1994, <em>Federal Systems of the World: A\nHandbook of Federal, Confederal and Autonomy Arrangements</em>:\nLongman.</li>\n<li>–––, 1998, <em>Covenant and Civil Society</em>,\nNew Brunswick, NJ: Transaction Publishers.</li>\n<li>Fenton, William N., 1998, <em>The Great Law and the Longhouse: A\nPolitical History of the Iroquois Confederacy</em>. Norman: University\nof Oklahoma Press.</li>\n<li>Filippov, Mikhail, Peter C. Ordeshook, and Olga Shvetsova, 2004,\n<em>Designing Federalism: A Theory of Self-sustainable Federal\nInstitutions</em>, Cambridge: Cambridge University Press.</li>\n<li>Føllesdal, Andreas, 1998, “Subsidiarity,”\n<em>Journal of Political Philosophy</em>, 6(2): 231–59.</li>\n<li>–––, and Simon Hix, 2006, “Why There Is a\nDemocratic Deficit in the EU,” <em>Journal of Common Market\nStudies</em>, 44(3): 533–62.</li>\n<li>–––, 2021, “A Just yet Unequal European\nUnion: A Defense of Moderate Economic Inequality,” <em>Review of\nSocial Economy</em>. doi:10.1080/00346764.2021.1967433</li>\n<li>Friedrich, Carl, 1968, <em>Trends of Federalism in Theory and\nPractice.</em>, New York: Praeger.</li>\n<li>Gädeke, Dorothea, 2009, “Relational Normative Thought\nin Ubuntu and Neo-Republicanism,” in <em>Debating African\nPhilosophy: Perspectives on Identify, Decolonial Ethics and\nComparative Philosophy</em>, edited by George Hull, 269–87.\nAbigdon: Routledge.</li>\n<li>Golemboski, David, 2015, “Federalism and the Catholic\nPrinciple of Subsidiarity,” <em>Publius</em>, 45(4):\n526–51.</li>\n<li>Goodin, Robert, 1996, “Designing constitutions: the\npolitical constitution of a mixed commonwealth,” <em>Political\nStudies</em>, 44: 635–46.</li>\n<li>Habermas, Jürgen, 1992. “Citizenship and national\nidentity: some reflections on the future of Europe,” <em>Praxis\nInternational</em> 12(1): 1–19.</li>\n<li>–––, 1992, <em>Faktizität und Geltung</em>,\nFrankfurt am Main: Suhrkamp; translated as <em>Between Facts and\nNorms</em>, William Rehg (trans.), Oxford: Polity, 1996.</li>\n<li>–––, 2001, <em>Postnational Constellation</em>,\nCambridge, Mass: MIT Press.</li>\n<li>Hooghe, Liesbet, and Gary Marks, 2003, “Unraveling the\nCentral State, but How? Types of Multi-Level Governanec,”\n<em>American Political Science Review</em> 97, 2: 233–43.</li>\n<li>Keohane, Robert O., and Joseph S. Nye, 2001, <em>Power and\nInterdependence: World Politics in Transition</em> (3rd Edition), New\nYork: Longman.</li>\n<li>Hueglin, Thomas O., and Alan Fenna, 2015, <em>Comparative\nFederalism: A Systematic Inquiry (2nd Ed)</em>. Toronto: University of\nToronto Press.</li>\n<li>Johnson, Benjamin, 2017, <em>Pueblos within Pueblos: Tlaxilacalli\nCommunities in Acolhuacan, Mexico, Ca. 1272–1692.</em> Boulder,\nCO: University Press of Colorado.</li>\n<li>King, Preston, 1982, <em>Federalism and Federation</em>,\nBaltimore: Johns Hopkins, and London: Croom Helm.</li>\n<li>Klusmeyer, Douglas, 2010, “Hannah Arendt’s Case for\nFederalism,” <em>Publius</em>, 40(1): 31–58.</li>\n<li>Kymlicka, Will, 2001, “Minority Nationalism and Multination\nFederalism,” in <em>Politics in the Vernacular</em>, Oxford:\nOxford University Press, pp. 91–119.</li>\n<li>–––, 2002, <em>Contemporary Political\nPhilosophy: An Introduction</em> (2nd edition), Oxford: Clarendon\nPress.</li>\n<li>–––, and Wayne Norman, 1994, “Return of\nthe Citizen: A Survey of Recent Work on Citizenship Theory,”\n<em>Ethics</em>, 104(2): 352–381.</li>\n<li>Laski, Harold, 1939, “The Obsolesence of Federalism,”\n<em>The New Republic</em>, 98 (May 3): 367–69. Reprinted in\nKarmis and Norman 2005.</li>\n<li>Lépine, Frédéric, 2012, “A Journey\nthrough the History of Federalism: Is Multilevel Governance a Form of\nFederalism?” <em>L’Europe en formation</em> 1:\n21–62.</li>\n<li>Levy, Jacob, 2004, “National Minorities Without\nNationalism,” in Alain Dieckhoff (ed.), <em>The Politics of\nBelonging: Nationalism, Liberalism, and Pluralism</em>, Lanham, MD:\nRowman &amp; Littlefield.</li>\n<li>–––, 2006, “Beyond Publius: Montesquieu,\nLiberal Republicanism, and the Small-Republic Thesis,”\n<em>History of Political Thought</em>, 27(1): 50–90.</li>\n<li>–––, 2007a, “Federalism, Liberalism, and\nthe Separation of Loyalties,” <em>American Political Science\nReview</em>, 101(3): 459–77.</li>\n<li>–––, 2007b, “Federalism and the Old and\nNew Liberalisms,” <em>Social Philosophy and Policy</em>, 24(1):\n306–26.</li>\n<li>–––, 2008, “Self-determination,\nnon-domination, and federalism,” <em>Hypatia</em>, 23(3):\n60–78.</li>\n<li>Lijphart, Arend, 1977, <em>Democracy in Plural Societies: A\nComparative Exploration</em>, Yale University Press, New Haven.</li>\n<li>–––, 1999, <em>Patterns of Democracy: Government\nForms and Performance in Thirty-Six Countries</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Linz, Juan J., 1999, “Democracy, multinationalism and\nfederalism,” in A. Busch and W. Merkel (eds.), <em>Demokratie in\nOst und West</em>, Frankfurt am Main: Suhrkamp, 382–401.</li>\n<li>Lockhart, James, 1992, <em>The Nahuas after the Conquest : A\nSocial and Cultural History of the Indians of Central Mexico,\nSixteenth through Eighteenth Centuries</em>: Stanford University\nPress.</li>\n<li>MacCormick, Neil, 1999, <em>Questioning Sovereignty. Law. State,\nand Nation in the European Commonwealth.</em> Oxford: Oxford\nUniversity Press.</li>\n<li>Marks, Gary, 1993, “Structural Policy and Multi-Level\nGoverance in the Ec,” in <em>The State of the European Community\n(Vol 2)</em>, edited by A. Cafruny and G. Rosenthal, Harlow:\nLongman.</li>\n<li>Mbiti, John S., 1969, <em>African Religions and Philosophy.</em>\nNew Hampshire: Heinemann.</li>\n<li>McKay, David, 2001, <em>Designing Europe—Comparative Lessons\nfrom the Federal Experience</em>, Oxford: Oxford University\nPress.</li>\n<li>Mencius. (2003) <em>Mencius: A Bilingual Edition.</em> Translated\nby D. C. Lau. Hong Kong: Chinese University Press.</li>\n<li>Musgrave, Robert A., 1959, <em>The Theory of Public Finance: a\nStudy in Political Economy</em>, New York: Mcgraw-Hill.</li>\n<li>Metz, Thaddeus, 2011, “Ubuntu as a Moral Theory and Human\nRights in South Africa,” <em>African Human Rights Law\nJournal</em>, 11: 532–59.</li>\n<li>Nicolaidis, Calypso, 2012, “The Idea of European\nDemoicracy,” in <em>Philosophical Foundations of European Union\nLaw</em>, edited by J. Dickson and Pavlos Eleftheriadis, 247–74,\nOxford: Oxford University Press.</li>\n<li>Norman, Wayne J., 1994, “Towards a Philosophy of\nFederalism,” in Judith Baker (ed.), <em>Group Rights</em>,\nToronto: University of Toronto Press, 79–100.</li>\n<li>–––, 1995a, “The Ideology of Shared\nValues: A Myopic Vision of Unity in the Multi-Nation State,” in\nJoseph Carens (ed.), <em>Is Quebec Nationalism Just? Perspectives From\nAnglophone Canada</em>, Montreal: McGill-Queens University Press,\n137–59.</li>\n<li>–––, 1995b, “The Morality of Federalism\nand the Evolution of the European Union,” <em>Archiv für\nRechts- und Sozialphilosophie</em>, 59: 202–211.</li>\n<li>–––, 2006, <em>Negotiating Nationalism:\nNation-building, Federalism and Secession in the Multinational\nState</em>, Oxford: Oxford University Press.</li>\n<li>Oates, Wallace, 1972, <em>Fiscal Federalism</em>, New York:\nHarcourt Brace Jovanovich.</li>\n<li>Olson, Mancur, 1969, “Strategic Theory and Its Applications:\nthe Principle of ‘Fiscal Equivalence’: the Division of\nResponsibility Among Different Levels of Government,”\n<em>American Economic Review</em>, 59(2): 479–532.</li>\n<li>Padou-Schioppa, Tommaso, 1995, “Economic Federalism and the\nEuropean Union,” in Knop <em>et al</em>. 1995,\n154–65.</li>\n<li>Palermo, F. and K. Kössler (2017). Comparative federalism:\nConstitutional arrangements and case law, Hart.</li>\n<li>van Parijs, Philippe, 1997, “Should the European Union\nBecome More Democratic?” In <em>Democracy and the European\nUnion</em>, edited by Andreas Follesdal and Peter Koslowski,\n287–301. Berlin: Springer.</li>\n<li>Presbey, Gail M. (2003) “Unfair Distribution of Resources in\nAfrica: What Should Be Done About the Ethnicity Factor?”\n<em>Human Studies</em> 26: 21–40.</li>\n<li>Renner, Karl, 1917, “The Development of the National\nIdea,” in Bottomore and Goode 1978, 118–25.</li>\n<li>Riker, William H., with Andreas Føllesdal, 2007,\n“Federalism,” in Robert E. Goodin, Philip Pettit and\nThomas Pogge (eds.), <em>A Companion to Contemporary Political\nPhilosophy</em>, Oxford: Blackwell.</li>\n<li>Rose-Ackerman, Susan, 1980, “Risk Taking and Reelection:\nDoes Federalism Promote Innovation?,” <em>The Journal of Legal\nStudies</em>, 9(3): 593–616</li>\n<li>Sbragia, Alberta M., 1992, “Thinking about the European\nfuture: the uses of comparison,” in Alberta M. Sbragia (ed.),\n<em>Euro-Politics: Institutions and policymaking in the\n‘new’ European Community</em>, Washington, DC: The\nBrookings Institution, 257–90.</li>\n<li>Scharpf, Fritz W., 1988, “The Joint Decision Trap: Lessons\nfrom German Federalism and European Integration,” <em>Public\nAdministration</em> 66, 3: 239–78.</li>\n<li>Schmitt, Carl, 1985, <em>Political theology.</em> Chicago, The\nUniversity of Chicago Press.</li>\n<li>Schütze, Robert, 2009, <em>From Dual to Cooperative\nFederalism: The Changing Structure of European Law.</em> Oxford,\nOxford University Press.</li>\n<li>–––, 2020, “Models of Demoicracy: Some\nPreliminary Thoughts,” <em>EUI Law</em> no. 8.\n [<a href=\"https://cadmus.eui.eu/handle/1814/67823\" target=\"other\">Schütze 2020 available online</a>]</li>\n<li>Selassie, Alemante, 2003, “Ethnic Federalism: Its Promise\nand Pitfalls for Africa,” <em>Yale Journal of International\nLaw</em> 28: 51–107.</li>\n<li>Shepsle, Kenneth A., 1986, “Institutional equilibrium and\nEquilibrium institutions,” in Herbert Weisberg (ed.),\n<em>Political Science: The science of politics</em>, New York: Agathon\nPress, 51–81.</li>\n<li>Shutte, Augustine, 2001 <em>Ubuntu: An Ethic for a New South\nAfrica.</em> Cape Town: Cluster Publications.</li>\n<li>Simeon, Richard, 1998, “Considerations on the Design of\nFederations: The South African Constitution in Comparative\nPerspective,” <em>SA Publiekreg/Public Law</em>, 13(1):\n42–72.</li>\n<li>Simeon, Richard, and Daniel-Patrick Conway, 2001,\n“Federalism and the Management of Conflict in Multinational\nSocieties,” in Gagnon and Tully 2001, 338–65.</li>\n<li>Stepan, Alfred, 1999, “Federalism and Democracy: Beyond the\nU.S. Model,” <em>Journal of Democracy</em>, 10: 19–34;\nreprinted in Karmis and Norman 2005.</li>\n<li>Tamir, Yael, 1993, <em>Liberal Nationalism</em>, Princeton:\nPrinceton University Press.</li>\n<li>Taylor, Charles, 1993, <em>Reconciling the Solitudes: Essays on\nCanadian Federalism and Nationalism</em>, Montreal:\nMcGill-Queen’s Press.</li>\n<li>Tiebout, Charles M., 1956, “A Pure Theory of Local\nExpenditures,” <em>Journal of Political Economy</em>, 64(5):\n416–24.</li>\n<li>Tully, James, 1995, <em>Strange Multiplicity: Constitutionalism in\nan Age of Diversity</em>, Cambridge: Cambridge University Press.</li>\n<li>Tushnet, Mark, 1996, “Federalism and Liberalism,”\n<em>Cardozo Journal of International and Comparative Law</em>, 4:\n329–44.</li>\n<li>Voyenne, Bernard, 1975, <em>Histoire De L’idée\nFédéraliste</em>. Paris: Presses d’Europe.</li>\n<li>Wamala, Edward. “Government by Consensus: An Analysis of a\nTraditional Form of Democracy,” in <em>A Companion to African\nPhilosophy</em>, edited by Kwasi Wiredu, 435–42, Oxford:\nBlackwell.</li>\n<li>Watts, Ronald L., 1998, “Federalism, Federal Political\nSystems, and Federations,” <em>Annual Review of Political\nScience</em>, 1: 117–37.</li>\n<li>–––, 1999, <em>Comparing Federal Systems</em>,\nMontreal: McGill-Queens University Press.</li>\n<li>Weinstock, Daniel, 2011, “Self-Determination for (some)\ncities?” in Axel Gosseries and Yannick Vanderborght (eds.),\n<em>Arguing About Justice: Essays for Philippe Van Parijs</em>,\nLouvain: Presses universitaires de Louvain, 377–86.</li>\n<li>Wheare, Kenneth C., 1964, <em>Federal Government</em> (4th\nedition), Oxford: Oxford University Press.</li>\n<li>Young, Iris Marion, 2000, “Hybrid Democracy: Iroquois\nFederalism and the Postcolonial Project,” in <em>Political\nTheory and the Rights of Indigenous Peoples</em>, edited by Duncan\nIvison, Paul Patton and Will Sanders, 236–58, Cambridge:\nCambridge University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Arendt, Hannah",
            "authority",
            "citizenship",
            "Hume, David",
            "identity politics",
            "Kant, Immanuel",
            "liberty: positive and negative",
            "Mill, John Stuart",
            "Montesquieu, Charles-Louis de Secondat, Baron de",
            "Proudhon, Pierre",
            "Rousseau, Jean Jacques",
            "sovereignty"
        ],
        "entry_link": [
            {
                "../arendt/": "Arendt, Hannah"
            },
            {
                "../authority/": "authority"
            },
            {
                "../citizenship/": "citizenship"
            },
            {
                "../hume/": "Hume, David"
            },
            {
                "../identity-politics/": "identity politics"
            },
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../liberty-positive-negative/": "liberty: positive and negative"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../montesquieu/": "Montesquieu, Charles-Louis de Secondat, Baron de"
            },
            {
                "../rousseau/": "Rousseau, Jean Jacques"
            },
            {
                "../sovereignty/": "sovereignty"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=federalism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/federalism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=federalism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/federalism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=federalism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/federalism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=federalism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/federalism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.jcpa.org/dje/index-fs.htm\" target=\"other\">Daniel J. Elazar’s writings on federalism</a>\n (maintained at the Jerusalem Center for Public Affairs)"
        ],
        "listed_links": [
            {
                "http://www.jcpa.org/dje/index-fs.htm": "Daniel J. Elazar’s writings on federalism"
            }
        ]
    }
}