{
    "url": "feminist-power",
    "title": "Feminist Perspectives on Power",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Amy Allen\n<ara17@psu.edu>",
        "author_links": [
            {
                "http://philosophy.la.psu.edu/directory/ara17": "Amy Allen"
            },
            {
                "mailto:ara17%40psu%2eedu": "ara17@psu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://philosophy.la.psu.edu/directory/ara17\" target=\"other\">Amy Allen</a>\n&lt;<a href=\"mailto:ara17%40psu%2eedu\"><em>ara17<abbr title=\" at \">@</abbr>psu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Oct 19, 2005",
        "substantive revision Thu Oct 28, 2021"
    ],
    "preamble": "\n\nAlthough any general definition of feminism would no doubt be\ncontroversial, it seems undeniable that much work in feminist theory\nis devoted to the tasks of critiquing gender subordination, analyzing\nits intersections with other forms of subordination such as racism,\nheterosexism, and class oppression, and envisioning prospects for\nindividual and collective resistance and emancipation. Insofar as the\nconcept of power is central to each of these theoretical tasks, power\nis clearly a central concept for feminist theory as well. And yet,\ncuriously, it is one that is not often explicitly thematized in\nfeminist work (exceptions include Allen 1998, 1999, Caputi 2013,\nHartsock 1983 and 1996, Yeatmann 1997, and Young 1992). Indeed, Wendy\nBrown contends that “Power is one of those things we cannot\napproach head-on or in isolation from other subjects if we are to\nspeak about it intelligently” (Brown 1988, 207). This poses a\nunique challenge for assessing feminist perspectives on power, as\nthose perspectives must first be reconstructed from discussions of\nother topics. Nevertheless, it is possible to identify three main ways\nin which feminists have conceptualized power: as a resource to be\n(re)distributed, as domination, and as empowerment. After a brief\ndiscussion of the power debates in social and political theory, this\nentry will survey each of these feminist conceptions.\n",
    "toc": [
        {
            "#DefiPowe": "1. Defining power"
        },
        {
            "#PoweResoLibeFemiAppr": "2. Power as Resource: Liberal Feminist Approaches"
        },
        {
            "#PoweDomi": "3. Power as Domination"
        },
        {
            "#PhenFemiAppr": "3.1 Phenomenological Feminist Approaches"
        },
        {
            "#RadiFemiAppr": "3.2 Radical Feminist Approaches"
        },
        {
            "#SociFemiAppr": "3.3 Socialist Feminist Approaches"
        },
        {
            "#InteAppr": "3.4 Intersectional Approaches"
        },
        {
            "#PostFemiAppr": "3.5 Poststructuralist Feminist Approaches"
        },
        {
            "#PostDecoFemiAppr": "3.6 Postcolonial and Decolonial Feminist Approaches"
        },
        {
            "#AnalFemiAppr": "3.7 Analytic Feminist Approaches"
        },
        {
            "#PoweEmpo": "4. Power as Empowerment"
        },
        {
            "#ConcThou": "5. Concluding thoughts"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Defining power\n\nIn social and political theory, power is often regarded as an\nessentially contested concept (see Lukes 1974 and 2005, and Connolly\n1983). Although this claim is itself contested (see Haugaard 2010 and\n2020, 4–10; Morriss 2002, 199–206 and Wartenberg 1990,\n12–17), there is no doubt that the literature on power is marked\nby deep, widespread, and seemingly intractable disagreements over how\nthe term should be understood.\n\nOne such disagreement pits those who define power as getting someone\nelse to do what you want them to do, that is, as an exercise of\npower-over others, against those who define it as an ability or a\ncapacity to act, that is, as a power-to do something. The classic\nformulation of the former definition is offered by Max Weber, who\ndefines power as “the probability that one actor within a social\nrelationship will be in a position to carry out his own will despite\nresistance…” (1978, 53). Similarly, Robert Dahl offers\nwhat he calls an “intuitive idea of power” according to\nwhich “A has power over B to the extent that he can get B to do\nsomething that B would not otherwise do” (1957, 202–03).\nDahl’s discussion of power sparked a vigorous debate that\ncontinued until the mid-1970s, but even his sharpest critics seemed to\nconcede his definition of power as an exercise of power-over others\n(see Bachrach and Baratz 1962 and Lukes 1974). As Steven Lukes notes,\nDahl’s one-dimensional view of power, Bachrach and\nBaratz’s two-dimensional view, and his own three-dimensional\nview are all variations of “the same underlying conception of\npower, according to which A exercises power over B when A affects B in\na manner contrary to B’s interests” (1974, 30). Similarly,\nbut from a very different theoretical background, Michel\nFoucault’s highly influential analysis implicitly presupposes\nthat power is a kind of power-over; and he puts it, “if we speak\nof the structures or the mechanisms of power, it is only insofar as we\nsuppose that certain persons exercise power over others” (1983,\n217). Notice that there are two salient features of this definition of\npower: power is understood in terms of power-over relations, and it is\ndefined in terms of its actual exercise.\n\nClassic articulations of power understood as power-to have been\noffered by Thomas Hobbes – power is a person’s\n“present means…to obtain some future apparent Good”\n(Hobbes 1985 (1641), 150) – and Hannah Arendt – power is\n“the human ability not just to act but to act in concert”\n(1970, 44). Arguing in favor of this way of conceptualizing power,\nHanna Pitkin notes that the word “power” is related\netymologically to the French pouvoir and the Latin\npotere, both of which mean to be able. “That\nsuggests,” she writes, “that power is a something –\nanything – which makes or renders somebody able to do, capable\nof doing something. Power is capacity, potential, ability, or\nwherewithal” (1972, 276). Similarly, Peter Morriss (2002) and\nLukes (2005) define power as a dispositional concept, meaning, as\nLukes puts it, that power “is a potentiality, not an actuality\n– indeed a potentiality that may never be actualized”\n(2005, 69). (Note that this statement amounts to a significant\nrevision of Lukes’s earlier analysis of power, in which he\nargued against defining power as power-to on the grounds that such a\ndefinition obscures “the conflictual aspect of power – the\nfact that it is exercised over people” and thus fails to address\nwhat we care about most when we decide to study power (1974, 31). For\nhelpful discussion of whether Lukes’s embrace of the\ndispositional conception of power is compatible with his other\ntheoretical commitments, see Haugaard (2010)). Some of the theorists\nwho analyze power as power-to leave power-over entirely out of their\nanalysis. For example, Arendt distinguishes power sharply from\nauthority, strength, force, and violence, and offers a normative\naccount in which power is understood as an end in itself (1970). As\nJürgen Habermas has argued, this has the effect of screening any\nand all strategic understandings of power (where power is understood\nin the Weberian sense as imposing one’s will on another) out of\nher analysis (Habermas 1994). (Although Arendt defines power as a\ncapacity, she also maintains that “power springs up between men\nwhen they act together and vanishes the moment they disperse”\n(1958, 200); hence, it is not clear whether she fully accepts a\ndispositional view of power). Others suggest that both aspects of\npower are important, but then focus their attention on either\npower-over (e.g., Connolly 1993) or power-to (e.g., Morriss 2002).\nStill others define power-over as a particular type of capacity,\nnamely, the capacity to impose one’s will on others; on this\nview, power-over is a derivative form of power-to (Allen 1999, Lukes\n2005). However, others have argued power-over and power-to refer to\nfundamentally different concepts and that it is a mistake to try to\ndevelop an account of power that integrates them (Pitkin 1972,\nWartenberg 1990).\n\nAnother way of carving up the power literature is to distinguish\nbetween action-theoretical conceptions – that is, those that\ndefine power in terms of either the actions or the dispositional\nabilities of individual actors – and broader systemic or\nconstitutive conceptions – that is, those that view power as\nsystematically structuring possibilities for action, or, more\nstrongly, as constitutive of social actors and the social world in\nwhich they act. On this way of distinguishing various conceptions of\npower, Hobbes and Weber are on the same side, since both of them\nunderstand power in primarily instrumentalist, individualist, and\naction-theoretical terms (Saar 2010, 10). The systemic conception, by\ncontrast, views power as “the ways in which given social systems\nconfer differentials of dispositional power on agents, thus\nstructuring their possibilities for action” (Haugaard 2010, 425;\nsee Clegg 1989). The systemic conception thus highlights the ways in\nwhich broad historical, political, economic, cultural, and social\nforces enable some individuals to exercise power over others, or\ninculcate certain abilities and dispositions in some actors but not in\nothers. Saar argues, however, that the systemic conception of power\nshould be understood not as an alternative to the action-theoretical\nconception of power, but rather as a more complex and sophisticated\nvariant of that model. For, as he says, its “basic scenario\nremains individualistic at the methodological level: power operates on\nindividuals as individuals, in the form of a ‘bringing to\naction’ or external determination” (Saar 2010, 14).\n\nThe constitutive conception of power pushes the insight of the\nsystemic conception further by focusing on the constitutive\nrelationships between power, individuals, and the social worlds they\ninhabit. The roots of this constitutive conception can be traced back\nto Spinoza (2002a and 2002b; Saar 2013), but variants of this view are\nalso found in the work of more contemporary theorists such as Arendt\nand Foucault. Here it is important to note that Foucault’s work\non power contains both action-theoretical and constitutive strands.\nThe former strand is evident in his claim, cited above, that “if\nwe speak of the structures or the mechanisms of power, it is only\ninsofar as we suppose that certain persons exercise power over\nothers” (Foucault 1983, 217), whereas the latter strand is\nevident in his definition of power as “the multiplicity of force\nrelations immanent in the sphere in which they operate and which\nconstitute their own organization; as the processes which, through\nceaseless struggles and confrontations, transforms, strengthens, or\nreverses them;…thus forming a chain or system” (Foucault\n1979, 92).\n\nWhat accounts for the highly contested nature of the concept of power?\nOne explanation is that how we conceptualize power is shaped by the\npolitical and theoretical interests that we bring to our study of it\n(Lukes 1986, Said 1986). For example, democratic theorists are\ninterested in different things when they study power than are social\nmovement theorists or critical race theorists or postcolonial\ntheorists, and so on. Thus, a specific conceptualization of power\ncould be more or less useful depending on the specific disciplinary or\ntheoretical context in which it is deployed, where usefulness is\nevaluated in terms of how well it “accomplishes the task the\ntheorists set for themselves” (Haugaard 2010, 426). On this\nview, if we suppose that feminists who are interested in power are\ninterested in understanding and critiquing gender-based relations of\ndomination and subordination as these intersect with other axes of\noppression and thinking about how such relations can be transformed\nthrough individual and collective resistance, then we would conclude\nthat specific conceptions of power should be evaluated in terms of how\nwell they enable feminists to fulfill those aims.\n\nLukes suggests another, more radical, explanation for the essentially\ncontested nature of the concept of power: our conceptions of power\nare, according to him, themselves shaped by power relations. As he\nputs it, “how we think about power may serve to reproduce and\nreinforce power structures and relations, or alternatively it may\nchallenge and subvert them. It may contribute to their continued\nfunctioning, or it may unmask their principles of operation, whose\neffectiveness is increased by their being hidden from view. To the\nextent that this is so, conceptual and methodological questions are\ninescapably political and so what ‘power’ means is\n‘essentially contested’…” (Lukes 2005, 63).\nThe thought that conceptions of power are themselves shaped by power\nrelations is behind the claim, made by many feminists, that the\ninfluential conception of power as power-over is itself a product of\npatriarchal domination (for further discussion, see section 4\nbelow).\n2. Power as Resource: Liberal Feminist Approaches\n\nThose who conceptualize power as a resource understand it as a\npositive social good that is currently unequally distributed. For\nfeminists who understand power in this way, the goal is to\nredistribute this resource so that women will have power equal to men.\nImplicit in this view is the assumption that power is, as Iris Marion\nYoung puts it, “a kind of stuff that can be possessed by\nindividuals in greater or lesser amounts” (Young 1990, 31).\n\nThe conception of power as a resource is arguably implicit in the work\nof some liberal feminists (Mill 1970, Okin 1989). For example, in\nJustice, Gender, and the Family, Susan Moller Okin argues\nthat the modern gender-structured family unjustly distributes the\nbenefits and burdens of familial life amongst husbands and wives. Okin\nincludes power on her list of the benefits, which she calls\n“critical social goods.” As she puts it, “when we\nlook seriously at the distribution between husbands and wives of such\ncritical social goods as work (paid and unpaid), power, prestige,\nself-esteem, opportunities for self-development, and both physical and\neconomic security, we find socially constructed inequalities between\nthem, right down the list” (Okin, 1989, 136). Here, Okin seems\nto presuppose that power is a resource that is unequally and unjustly\ndistributed between men and women; hence, one of the goals of feminism\nwould be to redistribute this resource in more equitable ways.\n\nAlthough she doesn’t discuss Okin’s work explicitly, Young\noffers a compelling critique of this view, which she calls the\ndistributive model of power. First, Young maintains that it is wrong\nto think of power as a kind of stuff that can be possessed; on her\nview, power is a relation, not a thing that can be distributed or\nredistributed. Second, she claims that the distributive model tends to\npresuppose a dyadic, atomistic understanding of power; as a result, it\nfails to illuminate the broader social, institutional and structural\ncontexts that shape individual relations of power. According to Young,\nthis makes the distributive model unhelpful for understanding the\nstructural features of domination. Third, the distributive model\nconceives of power statically, as a pattern of distribution, whereas\nYoung, following Foucault (1980), claims that power exists only in\naction, and thus must be understood dynamically, as existing in\nongoing processes or interactions. Finally, Young argues that the\ndistributive model of power tends to view domination as the\nconcentration of power in the hands of a few. According to Young,\nalthough this model might be appropriate for some forms of domination,\nit is not appropriate for the forms that domination takes in\ncontemporary industrial societies such as the United States (Young\n1990a, 31–33). On her view, in contemporary industrial\nsocieties, power is “widely dispersed and diffused” and\nyet it is nonetheless true that “social relations are tightly\ndefined by domination and oppression” (Young 1990a,\n32–33).\n3. Power as Domination\n\nYoung’s critique of the distributive model points toward an\nalternative way of conceptualizing power, one that understands power\nnot as a resource or critical social good, but instead views it as a\nrelation of domination. Although feminists have often used a variety\nof terms to refer to this kind of relation – including\n“oppression,” “patriarchy,”\n“subjection,” and so forth –the common thread in\nthese analyses is an understanding of power as an unjust or\nillegitimate power-over relation. In the remainder of this entry, I\nuse the term “domination” simply to refer to unjust or\noppressive power-over relations. In this section, I discuss the\nspecific ways in which feminists with different political and\nphilosophical commitments – influenced by phenomenology, radical\nfeminism, Marxist socialism, intersectionality theory,\npost-structuralism, postcolonial and decolonial theory, and analytic\nphilosophy – have conceptualized domination.\n3.1 Phenomenological Feminist Approaches\n\nThe locus classicus of feminist phenomenological approaches\nto theorizing male domination is Simone de Beauvoir’s The\nSecond Sex. Beauvoir’s text provides a brilliant analysis\nof the situation of women: the social, cultural, historical, and\neconomic conditions that define their existence. Her diagnosis of\nwomen’s situation relies on the distinction between being\nfor-itself – self-conscious subjectivity that is capable of\nfreedom and transcendence – and being in-itself – the\nun-self-conscious things that are incapable of freedom and mired in\nimmanence. Beauvoir argues that whereas men have assumed the status of\nthe transcendent subject, women have been relegated to the status of\nthe immanent Other. As she puts it in a famous passage from the\nIntroduction to The Second Sex: “She is defined and\ndifferentiated with reference to man and not he with reference to her;\nshe is the incidental, the inessential as opposed to the essential. He\nis the Subject, he is the Absolute – she is the Other”\n(Beauvoir, xxii). This distinction – between man as Subject and\nwoman as Other – is the key to Beauvoir’s understanding of\ndomination or oppression. She writes, “every time transcendence\nfalls back into immanence, stagnation, there is a degradation of\nexistence into the ‘en-soi’ – the brutish life of\nsubjection to given conditions – and liberty into constraint and\ncontingence. This downfall represents a moral fault if the subject\nconsents to it; if it is inflicted upon him, it spells frustration and\noppression. In both cases it is an absolute evil” (Beauvoir,\nxxxv). Although Beauvoir suggests that women are partly responsible\nfor submitting to the status of the Other in order to avoid the\nanguish of authentic existence (hence, they are in bad faith) (see\nBeauvoir xxvii), she maintains that women are oppressed because they\nare compelled to assume the status of the Other, doomed to immanence\n(xxxv). Women’s situation is thus marked by a basic tension\nbetween transcendence and immanence; as self-conscious human beings,\nthey are capable of transcendence, but they are compelled into\nimmanence by cultural and social conditions that deny them that\ntranscendence (see Beauvoir, chapter 21).\n\nSome feminists have criticized Beauvoir's conception of oppression for\nits reliance on a problematic analogy between race and gender (see,\nfor example, her claim that “there are deep similarities between\nthe situation of woman and that of the Negro,” (Beauvoir,\nxxix)). Beauvoir's frequent use of such analogies, critics contend,\nerases the experience of Black women by implicitly coding all women as\nwhite and all Blacks as male (Gines (Belle) 2010 and 2017, Collins\n2019, 194–198, and Simons 2002). As Kathryn T. Gines (now Kathryn\nSophia Belle) argues further, Beauvoir's analysis deploys\n“comparative and competing frameworks of oppression”\n(Gines (Belle) 2014a). At times, Beauvoir treats not just sexism and\nracism but also antisemitism, colonialism, and class oppression\ncomparatively, arguing that they rest of similar dynamics of Othering.\nHer comparative analysis of race and gender is most problematic in her\nfrequent analogy between the situation of women and that of the slave.\nAs Belle argues, this analogy not only obscures the experiences of\nBlack female slaves, it also leads Beauvior to “engage in an\nappropriation of Black suffering in the form of slavery to advance her\nphilosophical discussion of woman's situation” (265). At other\ntimes, Beauvoir treats racism, sexism, antisemitism, colonialism, and\nclass oppression as competing frameworks and argues that gender\nsubordination is the most significant and constitutive form of\noppression. Both moves are problematic, according to Belle, the former\nfor its erasure of the oppression of Black women and the latter for\nits privileging of gender oppression over other forms of\noppression.\n\nFeminist phenomenologists have engaged critically with Beauvoir's work\nwhile extending her insights into power. For example, Young argues\nthat Beauvoir pays relatively little attention to the role that female\nembodiment plays in women’s oppression (Young 1990b,\n142–3). Although Beauvoir does discuss women’s bodies in\nrelation to their status as immanent Other, she tends to focus on\nwomen’s physiology and how physiological features such as\nmenstruation and pregnancy tie women more closely to nature, thus, to\nimmanence. In her essay, “Throwing Like a Girl,” Young\ndraws on Maurice Merleau-Ponty’s phenomenological analysis of\nthe lived body to analyze “the situatedness of the woman’s\nactual bodily movement and orientation to its surroundings and its\nworld” (Young 1990b, 143). She notes that girls and women often\nfail to use fully the spatial potential of their bodies (for example,\nthey throw “like girls”), they try not to take up too much\nspace, and they tend to approach physical activity tentatively and\nuncertainly (Young 1990b, 145–147). Young argues that feminine\nbodily comportment, movement, and spatial orientation exhibit the same\ntension between transcendence and immanence that Beauvoir diagnoses in\nThe Second Sex. “At the root of those\nmodalities,” Young writes, “is the fact that the woman\nlives her body as object as well as subject. The source of this is\nthat patriarchal society defines woman as object, as a mere body, and\nthat in sexist society women are in fact frequently regarded by others\nas objects and mere bodies” (Young 1990b, 155). And yet women\nare also subjects, and, thus, cannot think of themselves as mere\nbodily objects. As a result, woman “cannot be in unity with\nherself” (Young 1990b, 155). Young explores the tension between\ntranscendence and immanence and the lack of unity characteristic of\nfeminine subjectivity in more detail in several other essays that\nexplore pregnant embodiment, women’s experience with their\nclothes, and breasted experience (See Young 1990b, chapters\n9–11).\n\nMuch important work in feminist phenomenology follows Young in drawing\ninspiration from Merleau-Ponty’s analyses of embodiment and\nintercorporeality (see Heinamaa 2003, Weiss 1999); like Young, these\nauthors use a Merleau-Pontyian approach to phenomenology to explore\nthe fundamental modalities of female embodiment or feminine bodily\ncomportment. Feminists have also mined the work of Edmund Husserl, the\nfounder of phenomenology, for useful resources for feminist\nphenomenology (Al-Saji 2010 and Oksala 2016).\n\nMore generally, Oksala defends the importance of feminist\nphenomenology as an exploration of gendered experience against\npoststructuralist critics who find such a project hopelessly\nessentialist. While Oksala acknowledges that essentialism is a danger\nfound in some work in feminist phenomenology – for example, she\nis critical of Sonia Kruks (2001) for “considering ‘female\nexperience’ as an irreducible given grounded in a female\nbody” (Oksala 2016, 72) – she also insists that a\nphenomenological analysis of experience is crucial for feminism. As\nshe puts it, “it is my contention that feminist theory must\n‘retrieve experience’, but this cannot mean returning to a\npre discursive female experience grounded in the commonalities of\nwomen’s embodiment” (40). On her view, experience is\nalways constructed in such a way that it “reflects oppressive\ndiscourses and power relations” (43); and yet, experience and\nthought or discourse are not co-extensive. This means that there is\nalways a gap between our personal experience and the linguistic\nrepresentations that we employ to make sense of that experience, and\nit is this gap that provides the space for contestation and critique.\nThus, Oksala concludes, “experiences can contest discourses even\nif, or precisely because, they are conceptual through and\nthrough” (50). For Oksala, experience plays a crucial role in\nreinforcing and reproducing oppressive power relations, but radical\nreflection on our experience opens up a space for individual and\ncollective resistance to and transformation of those power\nrelations.\n\nThe concept of experience is also central to Mariana Ortega's analysis\nof Latina feminist phenomenology (Ortega 2016). Ortega reads the\nprominent Latina feminists Gloria Anzaldúa and María\nLugones as phenomenologists “whose writings are deeply informed\nby their lived experience, specifically by their experience of\nmarginalization and oppression as well as their experience of\nresistance” (7). By highlighting the experience of marginalized\nand oppressed selves who live their lives at the borderlands or in a\nstate of in-betweenness, Latina feminist phenomenology, as Ortega\nreads it, offers an important corrective to and expansion of the\ncritique of modern subjectivity in the European phenomenological\ntradition.\n\nFor other influential feminist-phenomenological analyses of domination\nsee Bartky 1990, 2002, Bordo 1993, and Kruks 2001. For helpful\noverviews of feminist phenomenology, see Fisher and Embree 2000, and\nHeinamaa and Rodemeyer 2010. For a highly influential articulation of\nqueer phenomenology, drawing on the work of Husserl, Heidegger,\nMerleau-Ponty, and Fanon, see Ahmed (2006). For a compelling\nphenomenological analysis of transgender experience, see Salamon\n(2010).\n3.2 Radical Feminist Approaches\n\nUnlike liberal feminists, who view power as a positive social resource\nthat ought to be fairly distributed, and feminist phenomenologists,\nwho understand domination in terms of a tension between transcendence\nand immanence, radical feminists tend to understand power in terms of\ndyadic relations of dominance/subordination, often understood on\nanalogy with the relationship between master and slave.\n\nFor example, in the work of legal theorist Catharine MacKinnon,\ndomination is closely bound up with her understanding of gender\ndifference. According to MacKinnon, gender difference is simply the\nreified effect of domination. As she puts it, “difference is the\nvelvet glove on the iron fist of domination. The problem is not that\ndifferences are not valued; the problem is that they are defined by\npower” (MacKinnon 1989, 219). If gender difference is itself a\nfunction of domination, then the implication is that men are powerful\nand women are powerless by definition. As MacKinnon puts it,\n“women/men is a distinction not just of difference, but of power\nand powerlessness….Power/powerlessness is the sex\ndifference” (MacKinnon 1987, 123). (In this passage, MacKinnon\nglosses over the distinction, articulated by many second-wave\nfeminists, between sex – the biologically rooted traits that\nmake one male or female, traits that are often presumed to be natural\nand immutable – and gender – the socially and culturally\nrooted, hence contingent and mutable, traits, characteristics,\ndispositions, and practices that make one a woman or a man. This\npassage suggests that MacKinnon, like Judith Butler (1990) and other\ncritics of the sex/gender distinction, thinks that sex difference, no\nless than gender difference, is socially constructed and shaped by\nrelations of power.) If men are powerful and women powerless as such,\nthen male domination is, on this view, pervasive. Indeed, MacKinnon\nclaims that it is a basic “fact of male supremacy” that\n“no woman escapes the meaning of being a woman within a gendered\nsocial system, and sex inequality is not only pervasive but may be\nuniversal (in the sense of never having not been in some form”\n(MacKinnon 1989, 104–05). For MacKinnon, heterosexual\nintercourse is the paradigm of male domination; as she puts it,\n“the social relation between the sexes is organized so that men\nmay dominate and women must submit and this relation is sexual –\nin fact, is sex” (MacKinnon 1987, 3). As a result, she tends to\npresuppose a dyadic conception of domination, according to which\nindividual women are subject to the will of individual men. If male\ndomination is pervasive and women are powerless by definition, then it\nfollows that female power is “a contradiction in terms, socially\nspeaking” (MacKinnon 1987, 53). The claim that female power is a\ncontradiction in terms has led many feminists to criticize MacKinnon\non the grounds that she denies women’s political agency and\npresents them as helpless victims (for exemplary versions of this\ncriticism, see Brown 1995 and Butler 1997a).\n\nMarilyn Frye likewise offers a radical feminist analysis of power that\nseems to presuppose a dyadic model of domination. Frye identifies\nseveral faces of power, one of the most important of which is access.\nAs Frye puts it, “total power is unconditional access; total\npowerlessness is being unconditionally accessible. The creation and\nmanipulation of power is constituted of the manipulation and control\nof access” (Frye 1983, 103). If access is one of the most\nimportant faces of power, then feminist separatism, insofar as it is a\nway of denying access to women’s bodies, emotional support,\ndomestic labor, and so forth, represents a profound challenge to male\npower. For this reason, Frye maintains that all feminism that is worth\nthe name entails some form of separatism. She also suggests that this\nis the real reason that men get so upset by acts of separatism:\n“if you are doing something that is so strictly forbidden by the\npatriarchs, you must be doing something right” (Frye 1983, 98).\nFrye frequently compares male domination to a master/slave\nrelationship (see, for example, 1983, 103–105), and she defines\noppression as “a system of interrelated barriers and forces\nwhich reduce, immobilize, and mold people who belong to a certain\ngroup, and effect their subordination to another group (individually\nto individuals of the other group, and as a group, to that\ngroup)” (Frye 1983, 33). In addition to access, Frye discusses\ndefinition as another, related, face of power. Frye claims that\n“the powerful normally determine what is said and sayable”\n(105). For example, “when the Secretary of Defense calls\nsomething a peace negotiation…then whatever it is that he\ncalled a peace negotiation is an instance of negotiating peace”\n(105). Under conditions of subordination, women typically do not have\nthe power to define the terms of their situation, but by controlling\naccess, Frye argues, they can begin to assert control over their own\nself-definition. Both of these – controlling access and\ndefinition – are ways of taking power. Although she does not go\nso far as MacKinnon does in claiming that female power is a\ncontradiction in terms, Frye does claim that “if there is one\nthing women are queasy about it is actually taking power” (Frye\n1983, 107).\n\nA similar dyadic conception of male domination can arguably be found\nin Carole Pateman’s The Sexual Contract (1988)\n(although Pateman's work is heavily influenced by socialist feminism,\nher account of power is closer to radical feminism). Like MacKinnon,\nPateman claims that gender difference is constituted by domination; as\nshe puts it, “the patriarchal construction of the difference\nbetween masculinity and femininity is the political difference between\nfreedom and subjection” (Pateman 1988, 207). She also claims\nthat male domination is pervasive, and she explicitly appeals to a\nmaster/subject model to understand it; as she puts it, “in\nmodern civil society all men are deemed good enough to be\nwomen’s masters” (Pateman 1988, 219). In Pateman’s\nview, the social contract that initiates civil society and provides\nfor the legitimate exercise of political rights is also a sexual\ncontract that establishes what she calls “the law of male\nsex-right,” securing male sexual access to and dominance over\nwomen (1988, 182). As Nancy Fraser has argued, on Pateman’s\nview, the sexual contract “institutes a series of male/female\nmaster/subject dyads” (Fraser 1993, 173). Fraser is highly\ncritical of Pateman’s analysis, which she terms the\n“master/subject model,” a model that presents\nwomen’s subordination “first and foremost as the condition\nof being subject to the direct command of an individual man”\n(1993, 173). The problem with this dyadic account of women’s\nsubordination, according to Fraser, is that “gender inequality\nis today being transformed by a shift from dyadic relations of mastery\nand subjection to more impersonal structural mechanisms that are lived\nthrough more fluid cultural forms” (1993, 180). Fraser suggests\nthat, in order to understand women’s subordination in\ncontemporary Western societies, feminists will have to move beyond the\nmaster/subject model to analyze how women’s subordination is\nsecured through cultural norms, social practices, and other impersonal\nstructural mechanisms. (For Pateman’s response to Fraser’s\ncriticism, see Pateman and Mills (2007, 205–06)).\n\nAlthough feminists such as Fraser, Judith Butler, and Wendy Brown have\nbeen highly critical of the radical feminist account of domination,\nanalytic feminists have found this account more productive. For\nexample, Rae Langton (2009) has used speech act theory to defend\nMacKinnon's claims that pornography both causes and constitutes\nwomen's subordination. More generally, Langton (2009) and Sally\nHaslanger (2012) have drawn on MacKinnon's work to develop an account\nof sexual objectification and to explore the ways that objectification\nis often obscured by claims to objectivity (for further discussion of\nHaslanger's work, see section 3.7 below).\n3.3 Socialist Feminist Approaches\n\nAccording to the traditional Marxist account of power, domination is\nunderstood on the model of class exploitation; domination results from\nthe capitalist appropriation of the surplus value that is produced by\nthe workers. As many second wave feminist critics of Marx have pointed\nout, however, Marx’s categories are gender-blind (see, for\nexample, Firestone 1970, Hartmann 1980, Hartsock 1983, Rubin 1976).\nMarx ignores the ways in which class exploitation and gender\nsubordination are intertwined; because he focuses solely on economic\nproduction, Marx overlooks women’s reproductive labor in the\nhome and the exploitation of this labor in capitalist modes of\nproduction. As a result of this gender-blindness, second wave Marxist\nor socialist feminists argued that Marx’s analysis of class\ndomination must be supplemented with a radical feminist critique of\npatriarchy in order to yield a satisfactory account of women’s\noppression; the resulting theory is referred to as dual systems theory\n(see, for example, Eisenstein 1979, Hartmann 1980). As Young describes\nit, “dual systems theory says that women’s oppression\narises from two distinct and relatively autonomous systems. The system\nof male domination, most often called ‘patriarchy’,\nproduces the specific gender oppression of women; the system of the\nmode of production and class relations produces the class oppression\nand work alienation of most women” (Young 1990b, 21). Although\nYoung agrees with the aim of theorizing class and gender domination in\na single theory, she is critical of dual systems theory on the grounds\nthat “it allows Marxism to retain in basically unchanged form\nits theory of economic and social relations, on to which it merely\ngrafts a theory of gender relations” (Young 1990b, 24). Young\ncalls instead for a more unified theory, a truly feminist historical\nmaterialism that would offer a critique of the social totality.\n\nIn a later essay, Young offers a more systematic analysis of\noppression, an analysis that is grounded in her earlier call for a\ncomprehensive socialist feminism. Young identifies five faces of\noppression: economic exploitation, socio-economic marginalization,\nlack of power or autonomy over one’s work, cultural imperialism,\nand systematic violence (Young 1992, 183–193). The first three\nfaces of oppression in this list expand on the Marxist account of\neconomic exploitation, and the last two go beyond that account,\nbringing out other aspects of oppression that are not well explained\nin economic terms. According to Young, being subject to any one of\nthese forms of power is sufficient to call a group oppressed, but most\noppressed groups in the United States experience more than one of\nthese forms of power, and some experience all five (Young 1992, 194).\nShe also claims that this list is comprehensive, both in the sense\nthat “covers all the groups said by new left social movements to\nbe oppressed” and that it “covers all the ways they are\noppressed” (Young 1992, 181; for critical discussion, see Allen\n2008b).\n\nNancy Hartsock offers a different vision of feminist historical\nmaterialism in her book Money, Sex, and Power: Toward a\nFeminist Historical Materialism (1983). In this book, Hartsock is\nconcerned with “(1) how relations of domination along lines of\ngender are constructed and maintained and (2) whether social\nunderstandings of domination itself have been distorted by men’s\ndomination of women” (Hartsock 1983, 1). Following Marx’s\nconception of ideology, Hartsock maintains that the prevailing ideas\nand theories of a time period are rooted in the material, economic\nrelations of that society. This applies, in her view, to theories of\npower as well. Thus, she criticizes theories of power in mainstream\npolitical science for presupposing a market model of economic\nrelations – a model that understands the economy primarily in\nterms of exchange, which is how it appears from the perspective of the\nruling class rather than in terms of production, which is how it\nappears from the perspective of the worker. She also argues that power\nand domination have consistently been associated with masculinity.\nBecause power has been understood from the position of the socially\ndominant – the ruling class and men – the feminist task,\naccording to Hartsock, is to reconceptualize power from a specifically\nfeminist standpoint, one that is rooted in women’s life\nexperience, specifically, their role in reproduction. Conceptualizing\npower from this standpoint can, according to Hartsock, “point\nbeyond understandings of power as power over others” (Hartsock\n1983, 12). (We’ll come back to this point in section 4).\n\nSocialist feminism fell largely out of fashion during the latter part\nof the 20th century, fueled in part by the rise of poststructuralism,\nthe prominence of identity and recognition based politics, and the\nemergence of a neoliberal consensus (for a trenchant critique of these\ndevelopments, see Fraser 1996 and 2013). However, in the wake of the\nglobal financial crisis of 2008, socialist feminism, now often\nreferred to as Social Reproduction Theory (SRT), has made a comeback.\nSRT has a long history, with important early contributions by Silvia\nFederici (1975) and Maria Mies (1986) and connections to the Italian\nwages for housework campaign that began in the 1970s; for more recent\ndiscussions, see Tithi Bhattacharya (2017), Federici (2014 and 2019),\nand Alessandra Mezzadri (2019). SRT is a Marxist feminist project that\norients itself to a question that remains implicit in Marx's theory of\nvalue: how is labor power, which is the source of value and thus of\nexploitation in Marx's account, itself produced, reproduced, and\nmaintained? SRT maintains that labor power is produced and reproduced\noutside of the official economy, largely through women's unpaid labor\nwithin the family or domestic sphere. For social reproduction\ntheorists, the production of goods and services is thus possible only\non the basis of (largely) unpaid social reproduction, which includes\nchildbirth, domestic work, caring for children, the elderly and others\nwho cannot work for wages, and so on. For Federici, this represents an\nongoing process of expropriation akin to Marx's notion of primitive\naccumulation (Federici 2014). Social reproduction theorists understand\nproduction and reproduction as parts of an integrated system; indeed,\nthey view the distinction between the two as ultimately misleading\ninasmuch as it obscures the ways in which social reproduction is\nitself productive of value (Mezzadri 2019). For a related attempt to\nunderstand capitalism as a social totality whose relations of\nproduction are made possible by the expropriation of socially\nreproductive labor, environmental resources, and the labor of\ndispossessed and colonized peoples, see Fraser in Fraser and Jaeggi\n(2018).\n3.4 Intersectional Approaches\n\nTheories of intersectionality highlight the complex, interconnected,\nand cross-cutting relationships between diverse modes of domination,\nincluding (but not limited to) sexism, racism, class oppression, and\nheterosexism. The project of intersectional feminism grew out of Black\nfeminism, which, as scholars have recently noted, has a long tradition\nof examining the interconnections between racism and sexism,\nstretching back to the writing and activism of late 19th and early\n20th century black feminists such as Maria W. Stewart, Ida. B. Wells,\nAnna Julia Cooper, and Sojourner Truth (see Gines 2014b and Cooper\n2016). Because these thinkers and activists did not use the term\nintersectionality, Gines (now Belle) characterizes their work as\nproto-intersectional, which she defines as follows: “identifying\nand combating racism and sexism – through activist organizing and\ncampaigning – not only as separate categories impacting identity and\noppression, but also as systems of oppression that work together and\nmutually reinforce one another, presenting unique problems for black\nwomen who experience both, simultaneously and differently than white\nwomen and/or black men” (Gines 2014b, 14). Other important\nantecedents to contemporary intersectionality theory include the\nCombahee River Collective’s notion of “interlocking\nsystems of oppression” (CRC 1977), Deborah King’s analysis\nof multiple jeopardy and multiple consciousness (King 1988), and the\nwork from the 1980s of Black feminists such as Audre Lorde (1984),\nAngela Davis (1984), and bell hooks (1981). As Mariana Ortega has\nargued (2016), there are also important conceptions of\nintersectionality developed in Latina feminism, particularly in\nAnzaldúa's account of the borderlands and mestiza consciusness\n(Anzaldúa 1987) and Lugones's account of the intermeshedness of\nrace, sex, gender, sexual orientation, and class (Lugones 2003).\n\nIn other words, the concept of intersectionality has a long history\nand a complex genealogy (for discussions, see Cooper 2016, Collins\n2011 and 2019, 123–126, and Nash 2019). Still, it is widely\nacknowledged that the contemporary discussion and use of the term\nintersectionality was sparked by the work of legal theorist Kimberle\nCrenshaw (Crenshaw 1991a and 1991b), specifically, by her critique of\nsingle-axis frameworks for understanding domination in the context of\nlegal discrimination. A single-axis framework treats race and gender\nas mutually exclusive categories of experience. In so doing, such a\nframework implicitly privileges the perspective of the most privileged\nmembers of oppressed groups – sex or class-privileged Blacks in\nrace discrimination cases; race or class-privileged women in sex\ndiscrimination cases. Thus, a single-axis framework distorts the\nexperiences of Black women, who are simultaneously subject to multiple\nand intersecting forms of subordination. As Crenshaw explains,\n“the intersection of racism and sexism factors into Black\nwomen’s lives in ways that cannot be captured wholly by looking\nat the race or gender dimensions of those experiences\nseparately” (Crenshaw 1991b, 1244).\n\nIn the thirty years since the publication of Crenshaw’s essays\non intersectionality, this framework has become extraordinarily\ninfluential in women’s, gender, and sexuality studies. Indeed,\nit has been called “the most important contribution that\nwomen’s studies, in conjunction with other fields, has made so\nfar” (McCall 2005, 1771). However, feminist philosophers have\nnoted that this influence has yet to be felt within the mainstream of\nthe discipline of philosophy, where “intersectionality is\nlargely ignored as a philosophical theme or framework” (Goswami,\nO’Donovan and Yount 2014, 6). Moreover, intersectionality is not\nwithout its feminist critics.\n\nSome sympathetic critics of intersectionality have suggested that the\nconcept is limited in that it focuses primarily on the\naction-theoretical level. A full analysis of the intertwining of\nracial, gender, and class-based subordination also requires, on this\nview, a systemic or macro-level concept that corresponds to the\nconcept of intersectionality. Echoing the Combahee River Collective\n(CRC 1977), Patricia Hill Collins proposes the term\n“interlocking systems of oppression” to fulfill this role.\nAs she explains, “the notion of interlocking oppressions refers\nto the macro-level connections linking systems of oppression such as\nrace, class, and gender. This is the model describing the social\nstructures that create social positions. Second, the notion of\nintersectionality describes micro-level processes – namely, how\neach individual and group occupies a social position within\ninterlocking structures of oppression described by the metaphor of\nintersectionality. Together they shape oppression” (Collins\net al. 2002, 82).\n\nOthers have worried that discussions of intersectionality tend to\nfocus too much on relations and sites of oppression and subordination,\nwithout also taking into account relations of privilege and dominance.\nAs Jennifer Nash has argued, this has led to “the question of\nwhether all identities are intersectional or whether only\nmultiply marginalized subjects have an intersectional identity”\n(Nash 2008, 9). Although some feminist scholars claim that\nintersectionality encompasses all subject positions, not just those\nthat are marginalized or oppressed, Nash notes that “the\noverwhelming majority of intersectional scholarship has centred on the\nparticular positions of multiply marginalized subjects” (Nash\n2008, 9–10). The over-emphasis on oppression in theories of\nintersectionality leads theorists “to ignore the intimate\nconnections between privilege and oppression,” for example, by\n“ignor[ing] the ways in which subjects might be both victimized\nby patriarchy and privileged by race” (Nash 2008, 12). In\nresponse to this concern, philosophers such as Ann Garry have offered\na broader, more inclusive conception of intersectionality that\nemphasizes both oppression and privilege (see Garry 2011).\n\nRather than supplementing the notion of intersectionality with a\nmacro-level concept of interlocking systems of oppression or\nbroadening it to include relations of oppression and privilege, Naomi\nZack argues that feminists should move beyond it. Zack maintains that\nintersectionality undermines its own goal of making feminism more\ninclusive. It does this, on Zack’s view, by dividing women into\nsmaller and smaller groups, formed by specific intersections of race,\nclass, gender, sexuality, and so forth. As Zack puts it, “as a\ntheory of women’s identity, intersectionality is not inclusive\ninsofar as members of specific intersections of race and class create\nonly their own feminisms” (Zack 2005, 2). Because it\ntends toward “the reification of intersections as\nincommensurable identities,” Zack maintains that\n“intersectionality has not borne impressive political\nfruit” (Zack 2005, 18).\n\nFrom a very different perspective, queer theorists such as Lynne\nHuffer and Jasbir Puar have also criticized intersectionality as a\ntheory of identity. Unlike Zack, however, their concern is not with\nthe proliferation of incommensurable identities but rather with the\nways in which the notion of intersectionality remains, as Puar says,\n“primarily trapped within the logic of identity” (Puar\n2012, 60). As Huffer puts the point: “the institutionalization\nof intersectionality as the only approach to gender and\nsexuality that takes difference seriously masks\nintersectionality’s investment in a subject-making form of\npower-knowledge that runs the risk of perpetuating precisely the\nproblems intersectionality had hoped to alleviate” (Huffer 2013,\n18). Puar argues further that the primary concepts of\nintersectionality, including gender, race, class, and sexuality, are\nthemselves the product of Eurocentric, modernist, and colonial\ndiscourses and practices and, as such, are problematic from the point\nof view of postcolonial and transnational feminism (Puar 2012).\n\nFinally, Anna Carastathis has argued that the problem with\nintersectionality theory lies in its very success (Carastathis 2013\nand 2014). Intersectionality has been, on her view, too easily\nappropriated by white-dominated feminist theory, cut off from its\nroots in Black and women of color feminism, and incorporated into a\nself-congratulatory progressivist narrative according to which\n“intersectionality is celebrated as a methodological triumph\nover ‘previous’ essentialist and exclusionary approaches\nto theorizing identity and power relations” (Carastathis 2014,\n59; for related critiques, see Nash 2008 and 2019 and Puar 2012).\nCarastathis cites Kimberle Crenshaw’s lament that\nintersectionality’s reach is wide but not very deep, and\nsuggests that this may be the result of aversive racism – that\nis, a desire to assert or establish racial innocence, but without\nreally coming to terms with their own internalized racism – on\nthe part of white feminists (Carastathis, 2014, 68–69).\n\nIn response to these sorts of criticisms of intersectionality, some\nscholars have attempted to reformulate the concept by understanding it\nas a family resemblance concept (Garry 2011) or by highlighting its\nprovisionality (Carastathis, 2014). Others have argued for an\nexpansion of the intersectional framework to better account for the\nexperiences of diasporic subjects (Sheth 2014) or for a rethinking of\nthis framework in relation to a Deleuzian notion of assemblage (Puar\n2007 and 2012). Collins (2019) has proposed the development of\nintersectionality as a critical social theory through a reflection on\nits genealogy, epistemology, and methodology.\n3.5 Poststructuralist Feminist Approaches\n\nMost of the work on power done by post-structuralist feminists has\nbeen inspired by Foucault. In his middle period works (Foucault 1977,\n1978, and 1980), Foucault analyzes modern power as a mobile and\nconstantly shifting set of force relations that emerge from every\nsocial interaction and thus pervade the social body. As he puts it,\n“power is everywhere, not because it embraces everything, but\nbecause it comes from everywhere” (1978, 93). Foucault endeavors\nto offer a “micro-physics” of modern power (1977, 26), an\nanalysis that focuses not on the concentration of power in the hands\nof the sovereign or the state, but instead on how power flows through\nthe capillaries of the social body. Foucault criticizes previous\nanalyses of power (primarily Marxist and Freudian) for assuming that\npower is fundamentally repressive, a belief that he terms the\n“repressive hypothesis” (1978, 17–49). Although\nFoucault does not deny that power sometimes functions repressively\n(see 1978, 12), he maintains that it is primarily productive; as he\nputs it, “power produces; it produces reality; it produces\ndomains of objects and rituals of truth” (1977, 194). It also,\naccording to Foucault, produces subjects. As he puts it, “the\nindividual is not the vis-à-vis of power; it is, I believe, one\nof its prime effects” (1980, 98). According to Foucault, modern\npower subjects individuals, in both senses of the term; it\nsimultaneously creates them as subjects by subjecting them to power.\nAs we will see in a moment, Foucault’s account of subjection and\nhis account of power more generally have been extremely fruitful, but\nalso quite controversial, for feminists interested in analyzing\ndomination.\n\nIt should come as no surprise that so many feminists have drawn on\nFoucault’s analysis of power. Foucault’s analysis of power\nhas arguably been the most influential discussion of the topic over\nthe last forty years; even those theorists of power who are highly\ncritical of Foucault’s work acknowledge this influence (Lukes\n2005 and, in a somewhat backhanded way, Morriss 2002). Moreover,\nFoucault’s focus on the local and capillary nature of modern\npower clearly resonates with feminist efforts to redefine the scope\nand bounds of the political, efforts that are summed up by the slogan\n“the personal is political.” At this point, the feminist\nwork that has been inspired by Foucault’s analysis of power is\nso extensive and varied that it defies summarization (see, for\nexample, Allen 1999 and 2008a, Bartky 1990, Bordo 2003, Butler 1990,\n1993, 1997, Diamond and Quinby (eds) 1988, Fraser 1989, Hekman (ed)\n1996, Heyes 2007, McLaren 2002, McNay 1992, McWhorter 1999, Sawicki\n1990, and Young 1990). I will concentrate on highlighting a few\ncentral issues from this rich and diverse body of scholarship.\n\nSeveral of the most prominent Foucaultian-feminist analyses of power\ndraw on his account of disciplinary power in order to critically\nanalyze normative femininity. In Discipline and Punish,\nFoucault analyzes the disciplinary practices that were developed in\nprisons, schools, and factories in the 18th century – including\nminute regulations of bodily movements, obsessively detailed time\nschedules, and surveillance techniques – and how these practices\nshape the bodies of prisoners, students and workers into docile bodies\n(1977, 135–169). In a highly influential essay, Sandra Bartky\ncriticizes Foucault for failing to notice that disciplinary practices\nare gendered and that, through such gendered discipline, women’s\nbodies are rendered more docile than the bodies of men (1990, 65).\nDrawing on and extending Foucault’s account of disciplinary\npower, Bartky analyzes the disciplinary practices that engender\nspecifically feminine docile bodies – including dieting\npractices, limitations on gestures and mobility, and bodily\nornamentation. She also expands Foucault’s analysis of the\nPanopticon, Jeremy Bentham’s design for the ideal prison, a\nbuilding whose spatial arrangement was designed to compel the inmate\nto surveil himself, thus becoming, as Foucault famously put it,\n“the principle of his own subjection” (1977, 203). With\nrespect to gendered disciplinary practices such as dieting,\nrestricting one’s movement so as to avoid taking up too much\nspace, and keeping one’s body properly hairless, attired,\nornamented and made up, Bartky observes “it is women themselves\nwho practice this discipline on and against their own\nbodies….The woman who checks her make-up half a dozen times a\nday to see if her foundation has caked or her mascara run, who worries\nthat the wind or rain may spoil her hairdo, who looks frequently to\nsee if her stocking have bagged at the ankle, or who, feeling fat,\nmonitors everything she eats, has become, just as surely as the inmate\nin the Panopticon, a self-policing subject, a self committed to\nrelentless self-surveillance. This self-surveillance is a form of\nobedience to patriarchy” (1990, 80).\n\nAs Susan Bordo points out, this model of self-surveillance does not\nadequately illuminate all forms of female subordination – all\ntoo often women are actually compelled into submission by means of\nphysical force, economic coercion, or emotional manipulation.\nNevertheless, Bordo agrees with Bartky that “when it comes to\nthe politics of appearance, such ideas are apt and illuminating”\n(1993, 27). Bordo explains that, in her own work, Foucault’s\nanalysis of disciplinary power has been “extremely helpful both\nto my analysis of the contemporary disciplines of diet and exercise\nand to my understanding of eating disorders as arising out of and\nreproducing normative feminine practices of our culture, practices\nwhich train the female body in docility and obedience to cultural\ndemands while at the same time being experienced in terms of power and\ncontrol” (ibid). Bordo also highlights and makes use of\nFoucault’s understanding of power relations as inherently\nunstable, as always accompanied by, even generating, resistance (see\nFoucault 1983). “So, for example, the woman who goes into a\nrigorous weight-training program in order to achieve the currently\nstylish look may discover that her new muscles give her the\nself-confidence that enables her to assert herself more forcefully at\nwork” (1993, 28).\n\nWhereas Bartky and Bordo focus on Foucault’s account of\ndisciplinary power, Judith Butler draws primarily on his analysis of\nsubjection. For example, in her early and massively influential book,\nGender Trouble (1990), Butler notes that “Foucault\npoints out that juridical systems of power produce the subjects they\nsubsequently come to represent. Juridical notions of power appear to\nregulate political life in purely negative terms…..But the\nsubjects regulated by such structures are, by virtue of being\nsubjected to them, formed, defined, and reproduced in accordance with\nthe requirements of those structures” (1990, 2). The implication\nof this for feminists is, according to Butler, that “feminist\ncritique ought also to understand how the category of\n‘women’, the subject of feminism, is produced and\nrestrained by the very structures of power through which emancipation\nis sought” (1990, 2). This Foucaultian insight into the nature\nof subjection – into the ways in which becoming a subject means\nat the same time being subjected to power relations – thus forms\nthe basis for Butler’s trenchant critique of the category of\nwomen, and for her call for a subversive performance of the gender\nnorms that govern the production of gender identity. In Bodies\nthat Matter (1993), Butler extends this analysis to consider the\nimpact of subjection on the bodily materiality of the subject. As she\nputs is, “power operates for Foucault in the constitution of the\nvery materiality of the subject, in the principle which simultaneously\nforms and regulates the ‘subject’ of subjectivation”\n(1993, 34). Thus, for Butler, power understood as subjection is\nimplicated in the process of determining which bodies come to matter,\nwhose lives are livable and whose deaths grievable. In The Psychic\nLife of Power (1997b), Butler expands further on the Foucaultian\nnotion of subjection, bringing it into dialogue with a Freudian\naccount of the psyche. In the introduction to that text, Butler notes\nthat subjection is a paradoxical form of power. It has an element of\ndomination and subordination, to be sure, but, she writes, “if,\nfollowing Foucault, we understand power as forming the subject as\nwell, as providing the very condition of its existence and the\ntrajectory of its desire, then power is not simply what we oppose but\nalso, in a strong sense, what we depend on for our existence and what\nwe harbor and preserve in the beings that we are” (1997b, 2).\nAlthough Butler credits Foucault with recognizing the fundamentally\nambivalent character of subjection, she also argues that he does not\noffer an account of the specific mechanisms by which the subjected\nsubject is formed. For this, Butler maintains, we need an analysis of\nthe psychic form that power takes, for only such an analysis can\nilluminate the passionate attachment to power that is characteristic\nof subjection.\n\nAlthough many feminists have found Foucault’s analysis of power\nextremely fruitful and productive, Foucault has also had his share of\nfeminist critics. In a very influential early assessment, Nancy Fraser\nargues that, although Foucault’s work offers some interesting\nempirical insights into the functioning of modern power, it is\n“normatively confused” (Fraser 1989, 31). In his writings\non power, Foucault seems to eschew normative categories, preferring\ninstead to describe the way that power functions in local practices\nand to argue for the appropriate methodology for studying power. He\neven seems to suggest that such normative notions as autonomy,\nlegitimacy, sovereignty, and so forth, are themselves effects of\nmodern power (this point has been contested recently in the literature\non Foucault; see Allen 2008a and Oksala 2005). Fraser claims that this\nattempt to remain normatively neutral or even critical of normativity\nis incompatible with the politically engaged character of\nFoucault’s writings. Thus, for example, although Foucault claims\nthat power is always accompanied by resistance, Fraser argues that he\ncannot explain why domination ought to be resisted. As she puts it,\n“only with the introduction of normative notions of some kind\ncould Foucault begin to answer such questions. Only with the\nintroduction of normative notions could he begin to tell us what is\nwrong with the modern power/knowledge regime and why we ought to\noppose it” (1989, 29). Other feminists have criticized the\nFoucaultian claim that the subject is an effect of power. According to\nfeminists such as Linda Martín Alcoff and Seyla Benhabib, such\na claim implies a denial of agency that is incompatible with the\ndemands of feminism as an emancipatory social movement (Alcoff 1990,\nBenhabib 1992, and Benhabib et al. 1995; for a reply to this line of\ncriticism, see Allen 2008a chs. 2 and 3). Finally, Nancy Hartsock\n(1990 and 1996) calls into question the usefulness of Foucault’s\nwork as an analytical tool. Hartsock makes two related arguments\nagainst Foucault. First, she argues that his analysis of power is not\na theory for women because it does not examine power from the\nepistemological point of view of the subordinated; in her view,\nFoucault analyzes power from the perspective of the colonizer, rather\nthan the colonized (1990). Second, Foucault’s analysis of power\nfails to adequately theorize structural relations of inequality and\ndomination that undergird women’s subordination; this is related\nto the first argument because “domination, viewed from above, is\nmore likely to look like equality”(1996, 39; for a response to\nthis critique, see Allen 1996 and 1999).\n\nDespite these and other trenchant feminist critiques of Foucault (see,\nfor example, Hekman, ed. 1996 and Ramazanoglu, ed. 1993), his analysis\nof power continues to be an extremely useful resource for feminist\nconceptions of domination. For recent important feminist work that\ndraws on Foucault’s genealogical method to offer an\nintersectional analysis of racism and gender or sexual oppression see\nFeder (2007) and McWhorter (2009).\n3.6 Postcolonial and Decolonial Feminist Approaches\n\nPostcolonial and decolonial theory offer overlapping critiques of\nhistorical and contemporary practices and discourses of imperial and\ncolonial domination. Yet they also have distinct lineages, theoretical\ncommitments, and implications (for helpful discussion, see Bhambra\n2014 and Ramamurthy and Tambe 2017). Postcolonial theory rose to\nprominence in the late 20th century, in association with the\ngroundbreaking work of Edward Said (1979) and the Subaltern Studies\nCollective, and has been most influential in literary and cultural\nstudies. Taking as its primary point of reference the northern\nEuropean colonization of Southeast Asia and focusing primarily on the\ndiscursive and cultural effects of colonialism, postcolonial theory is\ndeeply (though not uncritically) influenced by poststruturalism,\nparticularly the work of Foucault and Jacques Derrida. Decolonial\ntheory emerged somewhat later, in the early 2000s, in association with\nthe Latin American and Carribean scholars in the Modernity/Coloniality\ngroup. Its primary point of reference is the colonization of the\nAmericas that began in 1492. Heavily influenced by Latin American\nMarxism, world systems theory, and indigenous political struggles,\ndecolonial theory focuses on the connections between capitalism,\ncolonialism, and racial hierarchies. Although these two approaches are\nnot mutually exclusive, decolonial theory is often viewed as the more\nradical of the two, due to its broader historical range and its calls\nfor epistemic decolonization and delinking from capitalist\nmodernity/coloniality (Ruíz 2021).\n\nGayatri Spivak's “Can the Subaltern Speak?” (1988) is\nwidely viewed as the watershed text in postcolonial feminism. Spivak's\nessay opens with a critical discussion of an exchange betweeen\nFoucault and Gilles Deleuze, in which they reject the idea of speaking\nfor the oppressed, insisting instead that the oppressed should speak\nfor themselves. The first part of her essay is devoted to a critique\nof this claim and of the myriad ways in which Foucault and Deleuze\nignore the epistemic violence of imperialism. It is Foucault and\nDeleuze’s insistence that the oppressed “can speak and\nknow their conditions” that leads Spivak to formulate her famous\nquestion, “can the subaltern speak?” (78). If, as Spivak\ngoes on to suggest, the subaltern can not speak, then the\n“subaltern as female is even more deeply in shadow” (83).\nDrawing on the example of the British banning the practice of sati in\ncolonial India, Spivak suggests that the subaltern cannot speak\nbecause she is caught between imperialist discourse and patriarchal\ntraditionalism, neither of which enables her to voice her experience:\n“Between patriarchy and imperialism, subject-constitution and\nobject-formation, the figure of the woman disappears, not into a\npristine nothingness, but into a violent shuttling which is the\ndisplaced figuration of the ‘third world woman’ caught\nbetween tradition and modernization” (102). In other words,\nthere is no space from which the subaltern as female can speak and no\nway she can be heard or read.\n\nAnother emblematic text in postcolonial feminism is Chandra Talpade\nMohanty's “Under Western Eyes” (1988). Mohanty's essay is\nframed as a critique of Western feminist analyses of “Third\nWorld Women” for their reductive and overly simplistic\nunderstandings of power and oppression. In such discourses, as Mohanty\nexplains, “power is automatically defined in binary terms:\npeople who have it (read: men) and people who do not (read: women).\nMen exploit, women are exploited. Such simplistic formulations are\nhistorically reductive; they are also ineffectual in designing\nstrategies to combat oppressions” (73). By contrast, Mohanty\ncalls for an intersectional understanding of power that refuses to\nhomogenize or falsely universalize women's experience:\n“the…homogenization of class, race, religion, and daily\nmaterial practices of women in the Third World can create a false\nsense of the commonality of oppressions, interests, and struggles\nbetween and among women globally. Beyond sisterhood there are still\nracism, colonialism, and imperialism” (77). Furthermore, by\nrepresenting “Third World Women” as mere passive objects\nor victims of oppression, Western feminists implicitly position\nthemselves as active subjects of resistance and revolutionary agents\n– which Mohanty calls “the colonialist move”\n(79).\n\nMuch of the agenda for decolonial feminism was set by Lugones in a\npair of essays published in Hypatia (2007 and 2010). Building\non the work of Anibal Quijano (2000), who argued that racialization is\nrooted in the structure of colonial capitalism, Lugones contends that\ngender itself is “a colonial concept and mode of organization of\nrelations of production, property relations, of cosmologies and ways\nof knowing” (2007, 186). Seeing gender as a colonial concept\nenables feminists to break out of the ahistorical framework of\npatriarchy. As she explains: “To understand the relation of the\nbirth of the colonial/modern gender system to the birth of global\ncolonial capitalism–with the centrality of the coloniality of\npower to that system of global power–is to understand our\npresent organization of life anew” (2007, 187). Lugones's\ndecolonial feminist framework combines the insights of\nintersectionality theory with Quijano’s understanding of the\ncoloniality of power (2007, 187–88). This brings into focus what\nLugones calls the “modern/colonial gender system” (2007,\n189), a system that is characterized by strict sexual dimorphism and\npresumed correspondence between biological sex and gender. In the\nlater essay, Lugones simplifies her formulation somewhat: “I\ncall the analysis of racialized, capitalist, gender oppression\n”the coloniality of gender.“ I call the possibility of\novercoming the coloniality of gender ”decolonial\nfeminism“” (2010, 747).\n3.7 Analytic Feminist Approaches\n\nAlthough most of the approaches to dominaiton discussed above have\nbeen informed by the Continental philosophical tradition, analytic\nfeminists have made important contributions to the feminist literature\non domination as well. For example, Ann Cudd (2006) draws on the\nframework of rational choice theory to analyze oppression (for related\nwork on rational choice theory and power, see Dowding 2001 and 2009;\nfor critical discussion, see Allen 2008c).\n\nCudd defines oppression in terms of four conditions: 1) the group\ncondition, which states that individuals are subjected to unjust\ntreatment because of their membership (or ascribed membership) in\ncertain social groups (Cudd 2006, 21); 2) the harm condition, which\nstipulates that individuals are systematically and unfairly harmed as\na result of such membership (Cudd 2006, 21); 3) the coercion\ncondition, which specifies that the harms that those individuals\nsuffer are brought about through unjustified coercion (Cudd 2006, 22);\nand 4) the privilege condition, which states that such coercive,\ngroup-based harms count as oppression only when there exist other\nsocial groups who derive a reciprocal privilege or benefit from that\nunjust harm (Cudd 2006, 22–23). Cudd then defines oppression as\n“an objective social phenomenon” characterized by these\nfour conditions (Cudd 2006, 23).\n\nAs Cudd sees it, the most difficult and interesting question that an\nanalysis of oppression must confront is the “endurance question:\nhow does oppression endure over time in spite of humans’ rough\nnatural equality?” (Cudd 2006, 25). Any satisfactory answer to\nthis question must draw on a combination of empirical,\nsocial-scientific research and normative philosophical theorizing,\ninasmuch as a theory of oppression is an explanatory theory of a\nnormative concept (Cudd 2006, 26). (That oppression is a normative\n– rather than a purely descriptive – concept is evident\nfrom the fact that it is defined as an unjust or unfair set of power\nrelations). Cudd argues that social-theoretical frameworks such as\nfunctionalism, psychoanalysis, and evolutionary psychology are\ninadequate for theorizing oppression (Cudd 2006, 39–45).\nStructural rational choice theory, in her view, best meets reasonable\ncriteria of explanatory adequacy and therefore provides the best\nsocial-theoretical framework for analyzing oppression. By appealing to\na  structural  theory of rational choice, Cudd’s\nanalysis of oppression avoids relying on assumptions about the\npsychology of individual agents. Rather, as Cudd puts it, “the\nstructural theory of rational choice assesses the objective social\nrewards and penalties that are consequent on” the interactions\nand social status of specific group members and “uses these\nassessments to impute preferences and beliefs to individuals based\npurely on their social group memberships” (Cudd 2006, 45). But,\nas a structural theory of rational choice, the framework\nassumes “that agents behave rationally in the sense that they\nchoose actions that maximize their (induced) expected utilities”\n(Cudd 2006, 46). In other words, structural rational choice theory\nmodels human actions as “(basically instrumentally rational)\nindividual choice constrained within socially structured\npayoffs” (Cudd 2006, 37). When utilized to analyze oppression,\nstructural rational choice theory suggests that the key to answering\nthe endurance question lies in the fact that “the oppressed are\nco-opted through their own short-run rational choices to reinforce the\nlong-run oppression of their social group” (Cudd 2006,\n21–22).\n\nSally Haslanger’s work on gender and racial oppression, like\nCudd’s, is heavily informed by the tools of analytic philosophy,\nthough Haslanger also situates her work within the tradition of\nCritical Theory (see Haslanger 2012, 22–30). Haslanger distinguishes\nbetween two kinds of cases of oppression: agent oppression, in which\n“a person or persons (the oppressor(s)) inflicts harm upon\nanother (the oppressed) wrongfully or unjustly” (314) and\nstructural oppression, in which “the oppression is not an\nindividual wrong but a social/political wrong; that is, it is a\nproblem lying in our collective arrangements, an injustice in our\npractices or institutions” (314). Having made this distinction,\nHaslanger then argues for a mixed analysis of oppression that does not\nattempt to reduce agent oppression to structural oppression or vice\nversa. The danger of reducing structural oppression to agent\noppression – what Haslanger calls the individualistic approach to\noppression – is that doing so fails to acknowledge that\n“sometimes structures themselves, not individuals are the\nproblem” (320). The danger of reducing agent oppression to\nstructural oppression – what Haslanger calls the institutionalist\napproach – is that such an approach “fails to distinguish those\nwho abuse their power to do wrong and those who are privileged but do\nnot exploit their power” (320). Haslanger’s mixed\napproach, by contrast, is “attentive simultaneously [and, we\nmight add, non-reductively] to both agents and structures”\n(11).\n\nHaslanger also connects her account of structural domination and\noppression to her analysis of gender. Haslanger offers what she calls\na “focal analysis” of gender, according to which the core\nof gender is “the pattern of social relations that constitute\nthe social classes of men as dominant and women as subordinate”\n(228). Other things – such as norms, identities, symbols, etc – are\nthen gendered in relation to those social relations. On her analysis,\ngender categories are defined in terms of how one is socially\npositioned with respect to a broad complex of oppressive relations\nbetween groups that are distinguished from one another by means of\nsexual difference (see 229–230). As Haslanger explains, the\n“background idea” informing this account of gender is\n“that women are oppressed, and that they are oppressed\nas women” (231).\n\nBy claiming that women are oppressed as women, Haslanger reiterates an\nearlier claim made by radical feminists such as Catharine MacKinnon\n(see, for example, MacKinnon 1987, 56–57). Indeed, Haslanger’s\nanalysis is heavily indebted to MacKinnon’s work (see Haslanger\n2012, 35–82), though she does not endorse MacKinnon’s strong\nclaims about the link between objectivity and masculinity, nor does\nshe adopt a dyadic (or, to use Haslanger’s terminology,\nreductively agent focused) understanding of oppression. But, like\nMacKinnon, Haslanger believes that “gender categories are\ndefined relationally – one is a woman (or a man) by virtue of\none’s position in a system of social relations” (58). This\nmeans that “one’s gender is an extrinsic property,\nand…it is not necessary that we each have the gender we now have, or\nthat we have any gender at all” (58). Since the social relations\nin terms of which gender categories are defined are relations of\nhierarchical domination and structural oppression, “gender is,\nby definition, hierarchical: Those who function socially as men have\npower over those who function socially as women” (61). As\nHaslanger admits, referencing the sex/gender distinction, this does\nnot mean that all males have power over all females – but it does\nmean that females who are not subordinated by males are not, strictly\nspeaking, women, and vice versa. Moreover, as Haslanger notes,\n“MacKinnon’s account of gender, like others that define\ngender hierarchically, has the consequence that feminism aims to\nundermine the very distinction it depends upon. If feminism is\nsuccessful, there will no longer be a gender distinction as\nsuch” because the complex of social relations of domination and\nstructural oppression that give gender its meaning will no longer\nexist (62). While endorsing MacKinnon’s radical conclusion with\nrespect to the currently existing gender categories of\n‘man’ and ‘woman’, Haslanger’s own\naccount offers a somewhat more nuanced view that allows for the future\npossibility of a kind of gender difference that would not be predicted\non gender dominance: “gender can be fruitfully understood as a\nhigher order genus that includes not only the hierarchical social\npositions of man and woman, but potentially other non-hierarchical\nsocial positions defined in part by reference to reproductive\nfunction. I believe gender as we know it takes hierarchical\nforms as men and women; but the theoretical move of treating men and\nwomen as only two kinds of gender provides resources for thinking\nabout other (actual) genders, and the political possibility of\nconstructing non-hierarchical genders” (235)\n4. Power as Empowerment\n\nUp to this point, this entry has focused on power understood in terms\nof an oppressive or unjust power-over relationship. I have used the\nterm “domination” to refer to such relationships, though\nsome of the theorists discussed above prefer the terms\n“oppression” or “subjection,” and others refer\nto this phenomenon simply as “power.” However, a\nsignificant strand of feminist theorizing of power starts with the\ncontention that the conception of power as power-over, domination, or\ncontrol is implicitly masculinist. In order to avoid such masculinist\nconnotations, many feminists from a variety of theoretical backgrounds\nhave argued for a reconceptualization of power as a capacity or\nability, specifically, the capacity to empower or transform oneself\nand others. Thus, these feminists have tended to understood power not\nas power-over but as power-to. Wartenberg (1990) argues that this\nfeminist understanding of power, which he calls transformative power,\nis actually a type of power-over, albeit one that is distinct from\ndomination because it aims at empowering those over whom it is\nexercised. However, most of the feminists who embrace this\ntransformative or empowerment-based conception of power explicitly\ndefine it as an ability or capacity and present it as an alternative\nto putatively masculine notions of power-over. Thus, in what follows,\nI will follow their usage rather than Wartenberg’s.\n\nFor example, Jean Baker Miller claims that “women’s\nexamination of power…can bring new understanding to the whole\nconcept of power” (Miller 1992, 241). Miller rejects the\ndefinition of power as domination; instead, she defines it as\n“the capacity to produce a change – that is, to move\nanything from point A or state A to point B or state B” (Miller\n1992, 241). Miller suggests that power understood as domination is\nparticularly masculine; from women’s perspective, power is\nunderstood differently: “there is enormous validity in\nwomen’s not wanting to use power as it is presently conceived\nand used. Rather, women may want to be powerful in ways that\nsimultaneously enhance, rather than diminish, the power of\nothers” (Miller 1992, 247–248).\n\nSimilarly, Virginia Held argues against the masculinist conception of\npower as “the power to cause others to submit to one’s\nwill, the power that led men to seek hierarchical control\nand…contractual constraints” (Held 1993, 136). Held views\nwomen’s unique experiences as mothers and caregivers as the\nbasis for new insights into power; as she puts it, “the capacity\nto give birth and to nurture and empower could be the basis for new\nand more humanly promising conceptions than the ones that now prevail\nof power, empowerment, and growth” (Held 1993, 137). According\nto Held, “the power of a mothering person to empower others, to\nfoster transformative growth, is a different sort of power from that\nof a stronger sword or a dominant will” (Held 1993, 209). On\nHeld’s view, a feminist analysis of society and politics leads\nto an understanding of power as the capacity to transform and empower\noneself and others.\n\nThis conception of power as transformative and empowering is also a\nprominent theme in lesbian feminism and ecofeminism. For example,\nSarah Lucia Hoagland is critical of the masculine conception of power\nwith its focus on “state authority, police and armed forces,\ncontrol of economic resources, control of technology, and hierarchy\nand chain of command” (Hoagland 1988, 114). Instead, Hoagland\ndefines power as “power-from-within” which she understands\nas “the power of ability, of choice and engagement. It is\ncreative; and hence it is an affecting and transforming power but not\na controlling power” (Hoagland 1988, 118). Similarly, Starhawk\nclaims that she is “on the side of the power that emerges from\nwithin, that is inherent in us as the power to grow is inherent in the\nseed” (Starhawk 1987, 8). For both Hoagland and Starhawk,\npower-from-within is a positive, life-affirming, and empowering force\nthat stands in stark contrast to power understood as domination,\ncontrol or imposing one’s will on another.\n\nA similar understanding of power can also be found in the work of the\nprominent French feminists Luce Irigaray and Hélène\nCixous. Irigaray, for example, urges feminists to question the\ndefinition of power in phallocratic cultures, for if feminists\n“aim simply for a change in the distribution of power, leaving\nintact the power structure itself, then they are resubjecting\nthemselves, deliberately or not, to a phallocratic order”\n(Irigaray 1985, 81), that is, to a discursive and cultural order that\nprivileges the masculine, represented by the phallus. If we wish to\nsubvert the phallocratic order, according to Irigaray, we will have to\nreject “a definition of power of the masculine type”\n(Irigaray 1985, 81). Some feminists interpret Irigaray’s work on\nsexual difference as suggesting an alternative conception of power as\ntransformative, a conception that is grounded in a specifically\nfeminine economy (see Irigaray 1981 and Kuykendall 1983). Similarly,\nCixous claims that “les pouvoirs de la femme” do not\nconsist in mastering or exercising power over others, but instead are\na form of “power over oneself” (Cixous 1977,\n483–84).\n\nAlong similar lines, Nancy Hartsock refers to the understanding of\npower “as energy and competence rather than dominance” as\n“the feminist theory of power” (Hartsock 1983, 224).\nHartsock argues that precursors of this theory can be found in the\nwork of some women who did not consider themselves to be feminists\n– most notably, Hannah Arendt, whose rejection of the\ncommand-obedience model of power and definition of ‘power’\nas “the human ability not just to act but to act in\nconcert” overlaps significantly with the feminist conception of\npower as empowerment (1970, 44). Arendt’s definition of\n‘power’ brings out another aspect of the definition of\n‘power’ as empowerment because of her focus on community\nor collective empowerment (on the relationship between power and\ncommunity, see Hartsock 1983, 1996). This aspect of empowerment is\nevident in Mary Parker Follett’s distinction between power-over\nand power-with; for Follett, power-with is a collective ability that\nis a function of relationships of reciprocity between members of a\ngroup (Follett 1942). Hartsock finds it significant that the theme of\npower as capacity or empowerment has been so prominent in the work of\nwomen who have written about power. In her view, this points in the\ndirection of a feminist standpoint that “should allow us to\nunderstand why the masculine community constructed…power, as\ndomination, repression, and death, and why women’s accounts of\npower differ in specific and systematic ways from those put forward by\nmen….such a standpoint might allow us to put forward an\nunderstanding of power that points in more liberatory\ndirections” (Hartsock 1983, 226).\n\nThe notion of empowerment has also been taken up widely by advocates\nof so-called “power feminism.” A reaction against a\nperceived over-emphasis on women’s victimization and oppression\nin feminism of the 1980s, power feminism emerged in the 1990s in the\nwritings of feminists such as Camille Paglia, Katie Roiphe, Christina\nHoff Sommers, and Naomi Wolf. Although this movement has had more\ninfluence in mainstream media and culture than in academia –\nindeed, in many ways it can be read as a critique of academic feminism\n– it has also sparked scholarly debate. As Mary Caputi argues in\nher book Feminism and Power: The Need for Critical Theory\n(2013), power feminists reject not only the excessive focus on\nwomen’s victimization but also the claim, made by earlier\nempowerment theorists, that women are “sensitive creatures given\nmore to a caring, interconnected web of human relationships than to\nthe rugged individualism espoused by men” (Caputi 2013, 4). In\ncontrast, power feminists endorse a more individualistic,\nself-assertive, even aggressive conception of empowerment, one that\ntends to define empowerment in terms of individual choice with little\nconcern for the contexts within which choices are made or the options\nfrom which women are able to choose. Caputi argues that power feminism\nrelies on and mimetically reproduces a problematically masculinist\nconception of power, one “enthralled by the display of\n‘power over’ rather than ‘power\nwith’…” (Caputi 2013, xv). As she puts it:\n“feminism must query the uncritical endorsement of an\nempowerment aligned with a masculinist will to power, and disown the\ntough, sassy, self-assured but unthinking\n‘feminist’” (Caputi 2013, 17). Because of its\ntendency to mimic an individualistic, sovereign, and masculinist\nconception of power over, power feminism, according to Caputi,\n“does little, if anything, to rethink our conception of\npower” (Caputi 2013, 89). In order to prompt such a rethinking,\nCaputi turns to the resources of the early Frankfurt School of\ncritical theory and to the work of Jacques Derrida.\n\nSerene Khader’s Adaptive Preferences and Women’s\nEmpowerment offers another rethinking of empowerment in feminist\ntheory. Focusing on empowerment in the context of international\ndevelopment practice, Khader develops a deliberative perfectionist\naccount of adaptive preferences. Rather than defining adaptive\npreferences in terms of autonomy deficits, Khader defines them as\npreferences “inconsistent with basic flourishing…that are\nformed under conditions nonconductive to basic flourishing and…that\nwe believe people might be persuaded to transform upon normative\nscrutiny of their preferences and exposure to conditions more\nconducive to flourishing” (Khader 2011, 42). The perfectionism\nin her account leads her to emphasize the distinction between merely\nadaptive preferences – those formed through adaptation to existing\nsocial conditions – and what she calls “inappropriately\nadaptive preferences” (IAPs) – preferences that are\nadaptive to bad or oppressive social conditions and that are harmful\nto those who adopt them (52–53). She also insists that IAPs are most\noften selective rather than global self-entitlement deficits (109),\nwhich means that they impact individuals’ sense of their own\nworth or entitlement to certain goods not globally but rather in\nparticular domains and contexts and in relation to certain specific\nindividuals or groups. This allows her to acknowledge the\npsychological effects of oppression working through the mechanism of\nIAPs without denying the possibility of agency on the part of the\noppressed.\n\nKhader draws on her deliberative perfectionist account of IAPs to\ndiagnose and move beyond certain controversies over the notion of\nempowerment that have emerged in feminist development practice and\ntheorizing. As the concept of women’s empowerment has become\ncentral to international development practice, feminists have raised\nconcerns about the ideological effects of this shift. While\nacknowledging that the language of empowerment in development practice\ncan have ideological effects, Khader addresses these concerns by\nproviding a clearer conception of empowerment than the one implicit in\nthe development literature and emphasizing what she understands as the\nnormative core of this concept, its relation to human flourishing. She\ndefines empowerment as the “process of overcoming one or\nmany IAPs through processes that enhance some element of a\nperson’s concept of self-entitlement and increase her capacity\nto pursue her own flourishing” (Khader 2011, 176). This\ndefinition of empowerment enables her to rethink certain dilemmas of\nempowerment that have emerged in development theory and practices. For\nexample, many development practitioners define empowerment in terms of\nchoice, and then struggle to make sense of apparently\nself-subordinating choices. If choice equals empowerment, then does\nthis mean that the choice to subordinate or disempower oneself is an\ninstance of empowerment? Khader’s finely grained analysis\nprovides an elegant way out of this dilemma by emphasizing the\nconditions under which choices are made and the tradeoffs among\ndifferent domains or aspects of flourishing that these conditions may\nnecessitate. Discussing a case of young women in Tanzania who chose to\nundergo clitoridectomy after receiving education about the\npractice aimed at empowering them, Khader writes: “Are the young\nwomen who choose clitoridectomy disempowered because they have few\noptions for unambiguously pursuing their flourishing or are they\nempowered because they have exercised agential capacities by making a\nchoice? My analysis of IAP allows us to say both” (187). For\nKhader, empowerment is a messy, complex, and incremental concept. Her\nanalysis of empowerment enables us to see that\n“self-subordinating choices can have selective empowering\neffects under disempowering conditions” (189). But the normative\ncore of her account, its deliberative perfectionism, insists that\n“a situation where one cannot seek one’s basic flourishing\nacross multiple domains is a tragic one” (189).\n5. Concluding thoughts\n\nThe concept of power is central to a wide variety of debates in\nfeminist philosophy. Indeed, the very centrality of this concept to\nfeminist theorizing creates difficulties in writing an entry such as\nthis one: since the concept of power is operative on one way or\nanother in almost all work in feminist theory, it is extremely\ndifficult to place limits on the relevant sources. Throughout, I have\nemphasized those texts and debates in which the concept of power is a\ncentral theme, even if sometimes an implicit one. I have also\nprioritized those authors and texts that have been most influential\nwithin feminist philosophy, as opposed to the wider terrain of\nfeminist theory or gender studies, though I acknowledge that this\ndistinction is difficult to maintain and perhaps not always terribly\nuseful. Debatable as such framing choices may be, they do offer some\nmuch needed help in delimiting the range of relevant sources and\nproviding focus and structure to the discussion.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ahmed, Sara, 2006. <em>Queer Phenomenology: Orientations, Objects,\nOthers</em>, Durham, NC: Duke University Press.",
                "Alcoff, Linda, 1990. “Feminist Politics and Foucault: The\nLimits to a Collaboration,” in Arlene Dallery and Charles Scott\n(eds.), <em>Crises in Continental Philosophy</em>, Albany, NY: SUNY\nPress.",
                "Allen, Amy, 1996. “Foucault on Power: A Theory for\nFeminists,” in Susan Hekman (ed.), <em>Feminist Interpretations\nof Michel Foucault</em>, University Park, PA: The Pennsylvania State\nUniversity Press.",
                "–––, 1998. “Rethinking Power,”\n<em>Hypatia</em>, 13: 21–40.",
                "–––, 1999. <em>The Power of Feminist Theory:\nDomination, Resistance, Solidarity</em>, Boulder, CO: Westview\nPress.",
                "–––, 2008a. <em>The Politics of Our Selves:\nPower, Autonomy, and Gender in Contemporary Critical Theory</em>, New\nYork: Columbia University Press.",
                "–––, 2008b. “Power and the Politics of\nDifference: Oppression, Empowerment, and Transnational Justice,”\n<em>Hypatia</em>, 23(3): 156–172.",
                "–––, 2008c. “Rationalizing\nOppression,” <em>Journal of Power</em>, 1(1): 51–65.",
                "Al-Saji, Alia, 2010. “Bodies and Sensings: On the Uses of\nHusserlian Phenomenology for Feminist Theory,” <em>Continental\nPhilosophy Review</em>, 43(1): 13–37.",
                "Anzaldúa, Gloria, 1987, <em>Borderlands/La Frontera: The\nNew Mestiza</em>, San Francisco, CA: Aunt Lute Books.",
                "Arendt, Hannah, 1958. <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.",
                "–––, 1970. <em>On Violence</em>, New York:\nHarcourt Brace &amp; Co..",
                "Bachrach, P. and Baratz, M.S., 1962. “The Two Faces of\nPower,” <em>American Political Science Review</em>, 56:\n941–52.",
                "Bartky, Sandra, 1990. <em>Femininity and Domination: Studies in\nthe Phenomenology of Oppression</em>, New York: Routledge.",
                "–––, 2002. <em>“Sympathy and\nSolidarity” and Other Essays</em>, Lanham, MD: Rowman and\nLittlefield.",
                "Beauvoir, Simone de, 1974. <em>The Second Sex</em>, New York:\nVintage Books.",
                "Benhabib, Seyla, 1992. <em>Situating the Self: Gender, Community\nand Postmodernism in Contemporary Ethics</em>, New York:\nRoutledge.",
                "Benhabib, Seyla, Judith Butler, Drucilla Cornell, and Nancy\nFraser, 1995. <em>Feminist Contentions: A Philosophical Exchange</em>,\nLinda Nicholson (ed.). New York: Routledge.",
                "Bhambra, Gurminder, 2014. “Postcolonial and decolonial\ndialogues,” <em>Postcolonial Studies</em>, 17(2): 115–121.",
                "Bhattacharya, Tithi (ed.), 2017. “Introduction: Mapping\nSocial Reproduction Theory,” in Bhattacharya (ed.), <em>Social\nReproduction Theory: Remapping Class, Recentering Oppression</em>,\nLondon: Pluto Press.",
                "Bordo, Susan, 1993. <em>Unbearable Weight: Feminism, Western\nCulture, and the Body</em>, Berkeley, CA: University of California\nPress.",
                "Brown, Wendy, 1988. <em>Manhood and Politics: A Feminist Reading\nin Political Theory</em>, Totowa, NJ: Rowman and Littlefield.",
                "–––, 1995. “The Mirror of\nPornography,” in <em>States of Injury: Power and Freedom in Late\nModernity</em>, Princeton, NJ: Princeton University Press.",
                "Butler, Judith, 1990. <em>Gender Trouble: Feminism and the\nSubversion of Identity</em>, New York: Routledge.",
                "–––, 1993. <em>Bodies that Matter: On the\nDiscursive Limits of ‘Sex’</em>, New York: Routledge.",
                "–––, 1997a. <em>Excitable Speech: A Politics of\nthe Performative</em>, New York: Routledge.",
                "–––, 1997b. <em>The Psychic Life of Power:\nTheories in Subjection</em>, Stanford: Stanford University Press.",
                "Caputi, Mary, 2013. <em>Feminism and Power: The Need for Critical\nTheory</em>, Lanham, MD: Lexington Books.",
                "Carastathis, Anna, 2013. “Basements and Intersections”\n<em>Hypatia</em>, 28(4): 698–715.",
                "–––, 2014. “Reinvigorating\nIntersectionality as a Provisional Concept,” in Goswami,\nO’Donovan and Yount (eds.), <em>Why Race and Gender Still\nMatter: An Intersectional Approach</em>, New York: Routledge.",
                "Cixous, Hélène, 1977. “Entrieten avec\nFrançoise van Rossum-Guyon,” <em>Revue des sciences\nhumaines</em>, 168: 479–493.",
                "Clegg, Stewart, 1989. <em>Frameworks of Power</em>, London:\nSage.",
                "Collins, Patricia Hill, 2011. “Piecing Together a\nGenealogical Puzzle: Intersectionality and American Pragmatism,”\n<em>European Journal of Pragmatism and American Philosophy</em>, 3(2):\n88–112.",
                "–––, 2019.<em> Intersectionality as Critical\nSocial Theory</em>, Durham, NC: Duke University Press.",
                "Collins, Patricia Hill, <em>et al</em>., 2002. “Symposium on\nWest and Fenstermaker’s ‘Doing Difference’,”\nin Sarah Fenstermaker and Candace West (eds.), <em>Doing Gender, Doing\nDifference</em>, New York: Routledge.",
                "Combahee River Collective, 1981. “A Black Feminist Statement\n(1977),” in Cherrie Moraga and Glora Anzaldua (eds.), <em>This\nBridge Called My Back: Writings by Radical Women of Color</em>, New\nYork: Kitchen Table/Women of Color Press.",
                "Connolly, William, 1993. <em>The Terms of Political Discourse</em>\n(third edition), Princeton, NJ: Princeton University Press.",
                "Cooper, Brittney, 2016. “Intersectionality,” in Lisa\nDisch and Mary Hawkesworth (eds.), <em>The Oxford Handbook of Feminist\nTheory</em>, Oxford: Oxford University Press.",
                "Crenshaw, Kimberle, 1991a. “Demarginalizing the Intersection\nof Race and Sex: A Black Feminist Critique of Antidiscrimination\nDoctrine, Feminist Theory, and Antiracist Politics,” in\nKatharine T. Barlett and Rosanne Kennedy (eds.), <em>Feminist Legal\nTheory: Readings in Law and Gender</em>, Boulder, CO: Westview\nPress.",
                "–––, 1991b. “Mapping the Margins:\nIntersectionality, Identity Politics, and Violence Against Women of\nColor,” <em>Stanford Law Review</em>, 43(6):\n1241–1299.",
                "Cudd, Ann, 2006. <em>Analyzing Oppression</em>, Oxford: Oxford\nUniversity Press.",
                "Dahl, Robert, 1957. “The Concept of Power,”\n<em>Behavioral Science</em>, 2: 201–15.",
                "Davis, Angela, 1983. <em>Women, Race and Class</em>, New York:\nVintage.",
                "Diamond, Irene and Lee Quinby (eds.), 1988. <em>Feminism and\nFoucault: Reflections on Resistance</em>, Boston: Northeastern\nUniversity Press.",
                "Dowding, Keith, 2001. “Rational Choice Approaches to\nAnalyzing Power,” in Nash and Scott (eds.), <em>The Blackwell\nCompanion to Political Sociology</em>, Oxford: Blackwell.",
                "–––, 2009. “Rational Choice\nApproaches,” in Clegg and Haugaard (eds.), <em>The SAGE Handbook\nof Power</em>, London: Sage.",
                "Eisenstein, Zillah, 1979. “Developing a Theory of Capitalist\nPatriarchy,” in Eisenstein (ed.), <em>Capitalist Patriarchy and\nthe Case for Socialist Feminism</em>, New York: Monthly Review\nPress.",
                "Feder, Ellen, 2007. <em>Family Bonds: Genealogies of Race and\nGender</em>, New York: Oxford University Press.",
                "Federici, Silvia, 1975. <em>Wages Against Housework</em>, Bristol:\nFalling Wall Press.",
                "–––, 2014. <em>Caliban and the Witch: Women, the\nBody, and Primitive Accumulation</em>, Brooklyn: Autonomedia.",
                "–––, 2019. “Social Reproduction Theory:\nHistory, Issues and Present Challenges,” <em>Radical\nPhilosophy</em>, 2(4): 55–57.",
                "Fisher, Linda, and Lester Embree (eds.), 2000. <em>Feminist\nPhenomenology</em>, Dordrecht: Kluwer Academic\nPress.",
                "Firestone, Shulamith, 1970. <em>The Dialectic of Sex: The Case for\nFeminist Revolution</em>, New York: William Morrow and Company.",
                "Follett, Mary Parker, 1942. <em>“Power,” in Dynamic\nAdministration: The Collected Papers of Mary Parker Follett</em>,\nHenry C. Metcalf and L. Urwick (eds.). New York: Harper.",
                "Foucault, Michel, 1977. <em>Discipline and Punish: The Birth of\nthe Prison</em>, trans. Alan Sheridan, New York: Vintage.",
                "–––, 1979. <em>The History of Sexuality</em>,\n<em>Volume 1: An Introduction</em>, trans. Robert Hurley, New York:\nVintage.",
                "–––, 1980. “Two Lectures”in Colin\nGordon (ed.), <em>Power/Knowledge: Selected Interviews and Other\nWritings, 1972–1977</em>, New York: Pantheon.",
                "–––, 1983. “Afterword: The Subject and\nPower” in Hubert Dreyfus and Paul Rabinow, <em>Michel Foucault:\nBeyond Structuralism and Hermeneutics</em>, 2nd edition, Chicago:\nUniversity of Chicago Press.",
                "Fraser, Nancy, 1989. <em>Unruly Practices: Power, Discourse and\nGender in Contemporary Social Theory</em>, Minneapolis, MN: University\nof Minnesota Press.",
                "–––, 1993. “Beyond the Master/Subject\nModel: Reflections on Carole Pateman’s Sexual Contract,”\n<em>Social Text</em>, 37: 173–181.",
                "–––, 1996. <em>Justice Interruptus: Critical\nReflections on the ‘Postsocialist’ Condition</em>, New\nYork: Routledge.",
                "–––, 2013. <em>Fortunes of Feminism: From State\nManaged Capitailsm to Neoliberal Crisis</em>, London: Verso.",
                "Fraser, Nancy and Rahel Jaeggi, 2018. <em>Capitalism: A\nConversation in Critical Theory</em>, Cambridge: Polity Press.",
                "Frye, Marilyn, 1983. <em>The Politics of Reality: Essays in\nFeminist Theory</em>, Freedom, California; The Crossing Press.",
                "Garry, Ann, 2011. “Intersectionality, Metaphors, and the\nMultiplicity of Gender,” <em>Hypatia</em>, 26(4): 826–850.",
                "Gines, Kathryn T. (now Kathryn Sophia Belle), 2010. “Sartre,\nBeauvoir, and the Race/Gender Analogy: A Case for Black Feminist\nPhilosophy,” in Maria del Guadalupe Davidson, Kathryn T. Gines,\nand Donna-Dale Marcano (eds.), <em>Convergences: Black Feminism and\nContinental Philosophy</em>, Albany, NY: SUNY Press.",
                "–––, 2014a. “Comparative and Competing\nFrameworks of Oppression in Simone de Beauvoir's <em>The Second\nSex</em>,” <em>Graduate Faculty Philosophy Journal</em>, 35\n(1–2): 251–273.",
                "–––, 2014b. “Race Women, Race Men and\nEarly Expressions of Proto-Intersectionality, 1930s-1930s,” in\nGoswami, O’Donovan, and Yount (eds.), <em>Why Race and Gender\nStill Matter: An Intersectional Approach</em>, New York:\nRoutledge.",
                "–––, 2017. “Simone de Beauvoir and the\nRace/Gender Analogy in <em>The Second Sex</em> Revisited,” in\nNancy Bauer and Laura Hengehold (eds.), <em>A Companion to Simone de\nBeauvoir</em>, Hoboken, NJ: Wiley Blackwell.",
                "Goswami, Namita, Maeve M. O’Donovan and Lisa Yount (eds.),\n2014. <em>Why Race and Gender Still Matter: An Intersectional\nApproach</em>, New York: Routledge.",
                "Habermas, Jürgen, 1994. “Hannah Arendt’s\nCommunications Concept of Power,” in Lewis P. Hinchman and\nSandra K. Hinchman (eds.), <em>Hannah Arendt: Critical Essays</em>,\nAlbany, NY: SUNY Press.",
                "Hartmann, Heidi, 1980. “The Unhappy Marriage of Marxism and\nFeminism: Toward a More Progressive Union,” in Lydia Sargent\n(ed.), <em>Women and Revolution</em>, Boston: South End Press.",
                "Hartsock, Nancy, 1983. <em>Money, Sex, and Power: Toward a\nFeminist Historical Materialism</em>, Boston: Northeastern University\nPress.",
                "–––, 1990. “Foucault on Power: A Theory\nfor Women?” in Linda Nicholson (ed.),\n<em>Feminism/Postmodernism</em>, New York: Routledge.",
                "–––, 1996. “Community/Sexuality/Gender:\nRethinking Power,” in Nancy J. Hirschmann and Christine Di\nStefano (eds.), <em>Revisioning the Political: Feminist\nReconstructions of Traditional Concepts in Western Political\nTheory</em>, Boulder, CO: Westview Press.",
                "Haslanger, Sally, 2012. <em>Resisting Reality: Social Construction\nand Social Critique</em>, New York: Oxford University Press.",
                "Haugaard, Mark, 2010. “Power: A ‘Family\nResemblance’ Concept,” <em>European Journal of Cultural\nStudies</em>, 13(4): 419–438.",
                "–––, 2020. <em>The Four Dimensions of Power:\nUnderstanding Domination, Empowerment and Democracy</em>, Manchester:\nManchester University Press.",
                "Heinamaa, Sara, 2003. <em>Toward a Phenomenology of Sexual\nDifference: Husserl, Merleau-Ponty, Beauvoir</em>, Lanham, MD: Rowman\nand Littlefield.",
                "Heinamaa, Sara and Lanei Rodemeyer (eds.), 2010. <em>Feminist\nPhenomenologies</em>: Special Issue of <em>Continental Philosophy\nReview</em>, 43(1): 1–140.",
                "Hekman, Susan (ed.), 1996. <em>Feminist Interpretations of Michel\nFoucault</em>, University Park, PA: The Pennsylvania State University\nPress.",
                "Held, Virginia, 1993. <em>Feminist Morality: Transforming Culture,\nSociety, and Politics</em>, Chicago: University of Chicago Press.",
                "Heyes, Cressida, 2007. <em>Self-Transformations: Foucault, Ethics,\nand Normalized Bodies</em>, Oxford: Oxford University Press.",
                "Hoagland, Sarah Lucia, 1988. <em>Lesbian Ethics: Toward a New\nValue</em>, Palo Alto: Institute of Lesbian Studies.",
                "Hobbes, Thomas, 1985 (1641). <em>Leviathan</em>, New York: Penguin\nBooks.",
                "hooks, bell, 1981. <em>Ain’t I a Woman? Black Women and\nFeminism</em>, Boston: South End Press.",
                "Huffer, Lynne, 2013. <em>Are the Lips a Grave? A Queer Feminist on\nthe Ethics of Sex</em>, New York: Columbia University Press.",
                "Irigaray, Luce, 1981. “And the One Doesn’t Stir\nWithout the Other,” trans. Hélène Vivienne Wenzel.\n<em>Signs</em>, 7(1): 60–67.",
                "–––, 1985. <em>This Sex Which Is Not One</em>,\nIthaca, NY: Cornell University Press.",
                "Khader, Serene, 2011. <em>Adaptive Preferences and Women’s\nEmpowerment</em>, New York: Oxford University Press.",
                "Kruks, Sonia, 2001. <em>Retrieving Experience: Subjectivity and\nRecognition in Feminist Politics</em>, Ithaca, NY: Cornell University\nPress.",
                "Kuykendall, Eléanor H., 1983. “Toward an Ethic of\nNurturance: Lluce Irigaray on Mothering and Power,” in Joyce\nTrebillcot (ed.), <em>Mothering: Essays in Feminist Theory</em>,\nSavage, MD: Rowman and Littlefield.",
                "Langton, Rae, 2009. <em>Sexual Solipsism: Philosophical Essays on\nPornography and Objectification</em>, Oxford: Oxford University\nPress.",
                "Lorde, Audre, 1984. <em>Sister/Outsider: Essays and Speeches by\nAudre Lorde</em>, Freedom, CA: Crossing Press.",
                "Lugones, María, 2003.<em> Pilgrimages/Peregrinajes:\nTheorizing Coalition against Multiple Oppressions</em>, Lanham, MD:\nRowman and Littlefield.",
                "–––, 2007. “Heterosexualism and the\nColonial/Modern Gender System,” <em>Hypatia</em>, 22 (1):\n186–209.",
                "–––, 2010. “Toward a Decolonial\nFeminism,” <em>Hypatia</em>, 25: (4): 742–759",
                "Lukes, Steven, 1974. <em>Power: A Radical View</em>, London:\nMacmillan.",
                "–––, 1986. “Introduction” in Steven\nLukes (ed.), <em>Power</em>, Oxford: Blackwell.",
                "–––, 2005. <em>Power: A Radical View</em>, 2nd\nexpanded edition. London: Macmillan.",
                "MacKinnon, Catharine, 1987. <em>Feminism Unmodified: Discourses on\nLife and Law</em>, Cambridge, MA: Harvard University Press.",
                "–––, 1989. <em>Toward a Feminist Theory of the\nState</em>, Cambridge, MA: Harvard University Press.",
                "McCall, Leslie, 2005. “The Complexity of\nIntersectionality,” <em>Signs: Journal of Women in Culture and\nSociety</em>, 30(3): 1771–1800.",
                "McLaren, Margaret, 2002. <em>Feminism, Foucault, and Embodied\nSubjectivity</em>, Albany, NY: SUNY Press.",
                "McNay, Lois, 1992. <em>Foucault and Feminism: Power, Gender, and\nthe Self</em>, Boston: Northeastern University Press.",
                "McWhorter, Ladelle, 1999. <em>Bodies and Pleasures: Foucault and\nthe Politics of Sexual Normalization</em>, Bloomington, IN: Indiana\nUniversity Press.",
                "–––. 2009. <em>Racism and Sexual Oppression in\nAnglo-America: A Genealogy</em>, Indianapolis, IN: Indiana University\nPress.",
                "Mezzadri, Alessandra, 2019. “On the Value of Social\nReproduction,” <em>Radical Philosophy</em>, 2(4):\n33–41.",
                "Mies, Maria, 1986. <em>Patriarchy and Accumulation on a World\nScale: Women in the International Division of Labor</em>, London: Zed\nBooks.",
                "Mill, John Stuart, 1970. “The Subjection of Women” in\nAlice Rossi (ed.), <em>Essays on Sex Equality</em>, Chicago:\nUniversity of Chicago Press.",
                "Miller, Jean Baker, 1992. “Women and Power” in Thomas\nWartenberg (ed.), <em>Rethinking Power</em>, Albany, NY: SUNY\nPress.",
                "Mohanty, Chandra Talpade, 1988. “Under Western Eyes:\nFeminist Scholarship and Colonial Discourses,” <em>Feminist\nReview</em>, 30: 61–88.",
                "Morriss, Peter, 2002. <em>Power: A Philosophical Analysis</em>,\n2nd edition. Manchester: Manchester University Press.",
                "Nash, Jennifer, 2008. “Re-thinking Intersectionality.”\n<em>Feminist Review</em>, 89: 1–15.",
                "–––, 2019. <em>Black Feminism Reimagined: After\nIntersectionality</em>, Durham, NC: Duke University Presss.",
                "Okin, Susan Moller, 1989. <em>Justice, Gender and the Family</em>,\nNew York: Basic Books.",
                "Oksala, Johanna, 2005. <em>Foucault on Freedom</em>, Cambridge:\nCambridge University Press.",
                "–––, 2016. <em>Feminist Experiences: Foucauldian\nand Phenomenological Investigations</em>, Evanston, IL: Northwestern\nUniversity Press.",
                "Ortega, Mariana, 2016. <em>In-Between: Latina Feminist\nPhenomenology, Multiplicity, and the Self</em>, Albany, NY: SUNY\nPress.",
                "Pateman, Carole, 1988. <em>The Sexual Contract</em>, Stanford:\nStanford University Press.",
                "Pateman, Carole, and Charles Mills, 2007. <em>Contract and\nDomination</em>, Cambridge: Polity Press.",
                "Pitkin, Hanna Fenichel, 1972. <em>Wittgenstein and Justice: On the\nSignificance of Ludwig Wittgenstein for Social and Political\nThought</em>, Berkeley, CA: University of California Press.",
                "Puar, Jasbir, 2007. <em>Terrorist Assemblages: Homonationalism in\nQueer Times</em>, Durham, NC: Duke University Press.",
                "–––, 2012. “‘I would rather be a\ncyborg than a goddess’: Becoming-Intersectional in Assemblage\nTheory,” <em>PhiloSOPHIA</em>, 2(1): 49–66.",
                "Quijano, Anibal, 2000. “Coloniality of Power, Eurocentrism,\nand Latin America,” <em>Nepantla: Views from South</em>, 1(3):\n533–580.",
                "Ramamurthy, Priti and Ashwini Tambe, 2017. “Preface,”\nin <em>Decolonial and Postcolonial Approaches: A Dialogue</em>,\nSpecial Issue of <em>Feminist Studies</em>, 43(3): 503–511.",
                "Ramazanoglu, Caroline (ed.), 1993. <em>Up Against Foucault:\nExplorations of some tensions between Foucault and feminism</em>, New\nYork: Routledge.",
                "Rubin, Gayle, 1976. “The Traffic in Women: Notes on the\nPolitical Economy of Sex,” in Rayna Reiter (ed.), <em>Toward an\nAnthropology of Women</em>, New York: Monthly Review Press.",
                "Ruíz, Elena, 2021. “Postcolonial and Decolonial\nTheories,” in Kim Q. Hall and Ásta (eds.), <em>The Oxford\nHandbook of Feminist Philosophy</em>, Oxford: Oxford University\nPress.",
                "Saar, Martin, 2010. “Power and Critique,” <em>Journal\nof Power</em>, 3(1): 7–20.",
                "–––, 2013. <em>Die Immanenz der Macht:\nPolitische Theorie nach Spinoza</em>, Berlin: Suhrkamp Verlag.",
                "Said, Edward, 1979. <em>Orientalism</em>, New York: Vintage\nBooks.",
                "–––, 1986. “Foucault and the Imagination\nof Power,” in David Couzens Hoy (ed.), <em>Foucault: A Critical\nReader</em>, Oxford: Blackwell.",
                "Salamon, Gayle, 2010. <em>Assuming a Body: Transgender and the\nRhetorics of Materiality</em>, New York: Columbia University\nPress.",
                "Sawicki, Jana, 1991. <em>Disciplining Foucault: Feminism, Power,\nand the Body</em>, New York: Routledge.",
                "Sheth, Falguni, 2014. “Interstitiality: Making Space for\nMigration, Diaspora, and Racial Complexity,” <em>Hypatia</em>,\n29(1): 75–93.",
                "Simons, Margaret, 2002. “Beauvoir and the Problem of\nRacism,” in Julie K. Ward and Tommy L. Lott (eds.),\n<em>Philosophers on Race: Critical Essays</em>, Oxford:\nBlackwell.",
                "Spinoza, Benedict de, 2002a. “Theological-political\nTreatise,” in M. L. Morgan (ed.), <em>Complete Works</em>,\nIndianapolis: Hackett, pp. 383–583.",
                "–––, 2002b. “Political Treatise,” in\nM. L. Morgan (ed), <em>Complete Works</em>, Indianapolis: Hackett, pp.\n676–754.",
                "Spivak, Gayatri, 1988. “Can the Subaltern Speak?”in C.\nNelson and L. Grossberg (eds.), <em>Marxism and the Interpretation of\nCulture</em>, Basingstoke: Macmillan.",
                "Starhawk, 1987. <em>Truth or Dare: Encounters with Power,\nAuthority, and Mystery</em>, San Francisco: Harper.",
                "Wartenberg, Thomas, 1990. <em>The Forms of Power: From Domination\nto Transformation</em>, Philadelphia: Temple University Press.",
                "Weber, Max, 1978. <em>Economy and Society: An Outline of\nInterpretive Sociology</em>, trans. Ephraim Fischoff et al., Berkeley,\nCA: University of California Press.",
                "Weiss, Gail, 1999. <em>Body Images: Embodiment as\nIntercorporeality</em>, New York: Routledge.",
                "Yeatmann, Anna, 1997. “Feminism and Power,” in Mary\nLyndon Shanley and Uma Narayan (eds.), <em>Reconstructing Political\nTheory: Feminist Perspectives</em>, University Park: The\nPennsylvania State University Press.",
                "Young, Iris Marion, 1990a. <em>Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press.",
                "–––, 1990b. <em>Throwing Like a Girl And Other\nEssays in Feminist Philosophy and Social Theory</em>, Bloomington:\nIndiana University Press.",
                "–––, 1992. “Five Faces of\nOppression” in Thomas Wartenberg (ed.), <em>Rethinking\nPower</em>, Albany: State University of New York Press.",
                "Zack, Naomi, 2005. <em>Inclusive Feminism: A Third Wave Theory of\nWomen’s Commonality</em>, Lanham, MD: Rowman and\nLittlefield."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Ahmed, Sara, 2006. <em>Queer Phenomenology: Orientations, Objects,\nOthers</em>, Durham, NC: Duke University Press.</li>\n<li>Alcoff, Linda, 1990. “Feminist Politics and Foucault: The\nLimits to a Collaboration,” in Arlene Dallery and Charles Scott\n(eds.), <em>Crises in Continental Philosophy</em>, Albany, NY: SUNY\nPress.</li>\n<li>Allen, Amy, 1996. “Foucault on Power: A Theory for\nFeminists,” in Susan Hekman (ed.), <em>Feminist Interpretations\nof Michel Foucault</em>, University Park, PA: The Pennsylvania State\nUniversity Press.</li>\n<li>–––, 1998. “Rethinking Power,”\n<em>Hypatia</em>, 13: 21–40.</li>\n<li>–––, 1999. <em>The Power of Feminist Theory:\nDomination, Resistance, Solidarity</em>, Boulder, CO: Westview\nPress.</li>\n<li>–––, 2008a. <em>The Politics of Our Selves:\nPower, Autonomy, and Gender in Contemporary Critical Theory</em>, New\nYork: Columbia University Press.</li>\n<li>–––, 2008b. “Power and the Politics of\nDifference: Oppression, Empowerment, and Transnational Justice,”\n<em>Hypatia</em>, 23(3): 156–172.</li>\n<li>–––, 2008c. “Rationalizing\nOppression,” <em>Journal of Power</em>, 1(1): 51–65.</li>\n<li>Al-Saji, Alia, 2010. “Bodies and Sensings: On the Uses of\nHusserlian Phenomenology for Feminist Theory,” <em>Continental\nPhilosophy Review</em>, 43(1): 13–37.</li>\n<li>Anzaldúa, Gloria, 1987, <em>Borderlands/La Frontera: The\nNew Mestiza</em>, San Francisco, CA: Aunt Lute Books.</li>\n<li>Arendt, Hannah, 1958. <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>–––, 1970. <em>On Violence</em>, New York:\nHarcourt Brace &amp; Co..</li>\n<li>Bachrach, P. and Baratz, M.S., 1962. “The Two Faces of\nPower,” <em>American Political Science Review</em>, 56:\n941–52.</li>\n<li>Bartky, Sandra, 1990. <em>Femininity and Domination: Studies in\nthe Phenomenology of Oppression</em>, New York: Routledge.</li>\n<li>–––, 2002. <em>“Sympathy and\nSolidarity” and Other Essays</em>, Lanham, MD: Rowman and\nLittlefield.</li>\n<li>Beauvoir, Simone de, 1974. <em>The Second Sex</em>, New York:\nVintage Books.</li>\n<li>Benhabib, Seyla, 1992. <em>Situating the Self: Gender, Community\nand Postmodernism in Contemporary Ethics</em>, New York:\nRoutledge.</li>\n<li>Benhabib, Seyla, Judith Butler, Drucilla Cornell, and Nancy\nFraser, 1995. <em>Feminist Contentions: A Philosophical Exchange</em>,\nLinda Nicholson (ed.). New York: Routledge.</li>\n<li>Bhambra, Gurminder, 2014. “Postcolonial and decolonial\ndialogues,” <em>Postcolonial Studies</em>, 17(2): 115–121.</li>\n<li>Bhattacharya, Tithi (ed.), 2017. “Introduction: Mapping\nSocial Reproduction Theory,” in Bhattacharya (ed.), <em>Social\nReproduction Theory: Remapping Class, Recentering Oppression</em>,\nLondon: Pluto Press.</li>\n<li>Bordo, Susan, 1993. <em>Unbearable Weight: Feminism, Western\nCulture, and the Body</em>, Berkeley, CA: University of California\nPress.</li>\n<li>Brown, Wendy, 1988. <em>Manhood and Politics: A Feminist Reading\nin Political Theory</em>, Totowa, NJ: Rowman and Littlefield.</li>\n<li>–––, 1995. “The Mirror of\nPornography,” in <em>States of Injury: Power and Freedom in Late\nModernity</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Butler, Judith, 1990. <em>Gender Trouble: Feminism and the\nSubversion of Identity</em>, New York: Routledge.</li>\n<li>–––, 1993. <em>Bodies that Matter: On the\nDiscursive Limits of ‘Sex’</em>, New York: Routledge.</li>\n<li>–––, 1997a. <em>Excitable Speech: A Politics of\nthe Performative</em>, New York: Routledge.</li>\n<li>–––, 1997b. <em>The Psychic Life of Power:\nTheories in Subjection</em>, Stanford: Stanford University Press.</li>\n<li>Caputi, Mary, 2013. <em>Feminism and Power: The Need for Critical\nTheory</em>, Lanham, MD: Lexington Books.</li>\n<li>Carastathis, Anna, 2013. “Basements and Intersections”\n<em>Hypatia</em>, 28(4): 698–715.</li>\n<li>–––, 2014. “Reinvigorating\nIntersectionality as a Provisional Concept,” in Goswami,\nO’Donovan and Yount (eds.), <em>Why Race and Gender Still\nMatter: An Intersectional Approach</em>, New York: Routledge.</li>\n<li>Cixous, Hélène, 1977. “Entrieten avec\nFrançoise van Rossum-Guyon,” <em>Revue des sciences\nhumaines</em>, 168: 479–493.</li>\n<li>Clegg, Stewart, 1989. <em>Frameworks of Power</em>, London:\nSage.</li>\n<li>Collins, Patricia Hill, 2011. “Piecing Together a\nGenealogical Puzzle: Intersectionality and American Pragmatism,”\n<em>European Journal of Pragmatism and American Philosophy</em>, 3(2):\n88–112.</li>\n<li>–––, 2019.<em> Intersectionality as Critical\nSocial Theory</em>, Durham, NC: Duke University Press.</li>\n<li>Collins, Patricia Hill, <em>et al</em>., 2002. “Symposium on\nWest and Fenstermaker’s ‘Doing Difference’,”\nin Sarah Fenstermaker and Candace West (eds.), <em>Doing Gender, Doing\nDifference</em>, New York: Routledge.</li>\n<li>Combahee River Collective, 1981. “A Black Feminist Statement\n(1977),” in Cherrie Moraga and Glora Anzaldua (eds.), <em>This\nBridge Called My Back: Writings by Radical Women of Color</em>, New\nYork: Kitchen Table/Women of Color Press.</li>\n<li>Connolly, William, 1993. <em>The Terms of Political Discourse</em>\n(third edition), Princeton, NJ: Princeton University Press.</li>\n<li>Cooper, Brittney, 2016. “Intersectionality,” in Lisa\nDisch and Mary Hawkesworth (eds.), <em>The Oxford Handbook of Feminist\nTheory</em>, Oxford: Oxford University Press.</li>\n<li>Crenshaw, Kimberle, 1991a. “Demarginalizing the Intersection\nof Race and Sex: A Black Feminist Critique of Antidiscrimination\nDoctrine, Feminist Theory, and Antiracist Politics,” in\nKatharine T. Barlett and Rosanne Kennedy (eds.), <em>Feminist Legal\nTheory: Readings in Law and Gender</em>, Boulder, CO: Westview\nPress.</li>\n<li>–––, 1991b. “Mapping the Margins:\nIntersectionality, Identity Politics, and Violence Against Women of\nColor,” <em>Stanford Law Review</em>, 43(6):\n1241–1299.</li>\n<li>Cudd, Ann, 2006. <em>Analyzing Oppression</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Dahl, Robert, 1957. “The Concept of Power,”\n<em>Behavioral Science</em>, 2: 201–15.</li>\n<li>Davis, Angela, 1983. <em>Women, Race and Class</em>, New York:\nVintage.</li>\n<li>Diamond, Irene and Lee Quinby (eds.), 1988. <em>Feminism and\nFoucault: Reflections on Resistance</em>, Boston: Northeastern\nUniversity Press.</li>\n<li>Dowding, Keith, 2001. “Rational Choice Approaches to\nAnalyzing Power,” in Nash and Scott (eds.), <em>The Blackwell\nCompanion to Political Sociology</em>, Oxford: Blackwell.</li>\n<li>–––, 2009. “Rational Choice\nApproaches,” in Clegg and Haugaard (eds.), <em>The SAGE Handbook\nof Power</em>, London: Sage.</li>\n<li>Eisenstein, Zillah, 1979. “Developing a Theory of Capitalist\nPatriarchy,” in Eisenstein (ed.), <em>Capitalist Patriarchy and\nthe Case for Socialist Feminism</em>, New York: Monthly Review\nPress.</li>\n<li>Feder, Ellen, 2007. <em>Family Bonds: Genealogies of Race and\nGender</em>, New York: Oxford University Press.</li>\n<li>Federici, Silvia, 1975. <em>Wages Against Housework</em>, Bristol:\nFalling Wall Press.</li>\n<li>–––, 2014. <em>Caliban and the Witch: Women, the\nBody, and Primitive Accumulation</em>, Brooklyn: Autonomedia.</li>\n<li>–––, 2019. “Social Reproduction Theory:\nHistory, Issues and Present Challenges,” <em>Radical\nPhilosophy</em>, 2(4): 55–57.</li>\n<li>Fisher, Linda, and Lester Embree (eds.), 2000. <em>Feminist\nPhenomenology</em>, Dordrecht: Kluwer Academic\nPress.</li>\n<li>Firestone, Shulamith, 1970. <em>The Dialectic of Sex: The Case for\nFeminist Revolution</em>, New York: William Morrow and Company.</li>\n<li>Follett, Mary Parker, 1942. <em>“Power,” in Dynamic\nAdministration: The Collected Papers of Mary Parker Follett</em>,\nHenry C. Metcalf and L. Urwick (eds.). New York: Harper.</li>\n<li>Foucault, Michel, 1977. <em>Discipline and Punish: The Birth of\nthe Prison</em>, trans. Alan Sheridan, New York: Vintage.</li>\n<li>–––, 1979. <em>The History of Sexuality</em>,\n<em>Volume 1: An Introduction</em>, trans. Robert Hurley, New York:\nVintage.</li>\n<li>–––, 1980. “Two Lectures”in Colin\nGordon (ed.), <em>Power/Knowledge: Selected Interviews and Other\nWritings, 1972–1977</em>, New York: Pantheon.</li>\n<li>–––, 1983. “Afterword: The Subject and\nPower” in Hubert Dreyfus and Paul Rabinow, <em>Michel Foucault:\nBeyond Structuralism and Hermeneutics</em>, 2nd edition, Chicago:\nUniversity of Chicago Press.</li>\n<li>Fraser, Nancy, 1989. <em>Unruly Practices: Power, Discourse and\nGender in Contemporary Social Theory</em>, Minneapolis, MN: University\nof Minnesota Press.</li>\n<li>–––, 1993. “Beyond the Master/Subject\nModel: Reflections on Carole Pateman’s Sexual Contract,”\n<em>Social Text</em>, 37: 173–181.</li>\n<li>–––, 1996. <em>Justice Interruptus: Critical\nReflections on the ‘Postsocialist’ Condition</em>, New\nYork: Routledge.</li>\n<li>–––, 2013. <em>Fortunes of Feminism: From State\nManaged Capitailsm to Neoliberal Crisis</em>, London: Verso.</li>\n<li>Fraser, Nancy and Rahel Jaeggi, 2018. <em>Capitalism: A\nConversation in Critical Theory</em>, Cambridge: Polity Press.</li>\n<li>Frye, Marilyn, 1983. <em>The Politics of Reality: Essays in\nFeminist Theory</em>, Freedom, California; The Crossing Press.</li>\n<li>Garry, Ann, 2011. “Intersectionality, Metaphors, and the\nMultiplicity of Gender,” <em>Hypatia</em>, 26(4): 826–850.</li>\n<li>Gines, Kathryn T. (now Kathryn Sophia Belle), 2010. “Sartre,\nBeauvoir, and the Race/Gender Analogy: A Case for Black Feminist\nPhilosophy,” in Maria del Guadalupe Davidson, Kathryn T. Gines,\nand Donna-Dale Marcano (eds.), <em>Convergences: Black Feminism and\nContinental Philosophy</em>, Albany, NY: SUNY Press.</li>\n<li>–––, 2014a. “Comparative and Competing\nFrameworks of Oppression in Simone de Beauvoir's <em>The Second\nSex</em>,” <em>Graduate Faculty Philosophy Journal</em>, 35\n(1–2): 251–273.</li>\n<li>–––, 2014b. “Race Women, Race Men and\nEarly Expressions of Proto-Intersectionality, 1930s-1930s,” in\nGoswami, O’Donovan, and Yount (eds.), <em>Why Race and Gender\nStill Matter: An Intersectional Approach</em>, New York:\nRoutledge.</li>\n<li>–––, 2017. “Simone de Beauvoir and the\nRace/Gender Analogy in <em>The Second Sex</em> Revisited,” in\nNancy Bauer and Laura Hengehold (eds.), <em>A Companion to Simone de\nBeauvoir</em>, Hoboken, NJ: Wiley Blackwell.</li>\n<li>Goswami, Namita, Maeve M. O’Donovan and Lisa Yount (eds.),\n2014. <em>Why Race and Gender Still Matter: An Intersectional\nApproach</em>, New York: Routledge.</li>\n<li>Habermas, Jürgen, 1994. “Hannah Arendt’s\nCommunications Concept of Power,” in Lewis P. Hinchman and\nSandra K. Hinchman (eds.), <em>Hannah Arendt: Critical Essays</em>,\nAlbany, NY: SUNY Press.</li>\n<li>Hartmann, Heidi, 1980. “The Unhappy Marriage of Marxism and\nFeminism: Toward a More Progressive Union,” in Lydia Sargent\n(ed.), <em>Women and Revolution</em>, Boston: South End Press.</li>\n<li>Hartsock, Nancy, 1983. <em>Money, Sex, and Power: Toward a\nFeminist Historical Materialism</em>, Boston: Northeastern University\nPress.</li>\n<li>–––, 1990. “Foucault on Power: A Theory\nfor Women?” in Linda Nicholson (ed.),\n<em>Feminism/Postmodernism</em>, New York: Routledge.</li>\n<li>–––, 1996. “Community/Sexuality/Gender:\nRethinking Power,” in Nancy J. Hirschmann and Christine Di\nStefano (eds.), <em>Revisioning the Political: Feminist\nReconstructions of Traditional Concepts in Western Political\nTheory</em>, Boulder, CO: Westview Press.</li>\n<li>Haslanger, Sally, 2012. <em>Resisting Reality: Social Construction\nand Social Critique</em>, New York: Oxford University Press.</li>\n<li>Haugaard, Mark, 2010. “Power: A ‘Family\nResemblance’ Concept,” <em>European Journal of Cultural\nStudies</em>, 13(4): 419–438.</li>\n<li>–––, 2020. <em>The Four Dimensions of Power:\nUnderstanding Domination, Empowerment and Democracy</em>, Manchester:\nManchester University Press.</li>\n<li>Heinamaa, Sara, 2003. <em>Toward a Phenomenology of Sexual\nDifference: Husserl, Merleau-Ponty, Beauvoir</em>, Lanham, MD: Rowman\nand Littlefield.</li>\n<li>Heinamaa, Sara and Lanei Rodemeyer (eds.), 2010. <em>Feminist\nPhenomenologies</em>: Special Issue of <em>Continental Philosophy\nReview</em>, 43(1): 1–140.</li>\n<li>Hekman, Susan (ed.), 1996. <em>Feminist Interpretations of Michel\nFoucault</em>, University Park, PA: The Pennsylvania State University\nPress.</li>\n<li>Held, Virginia, 1993. <em>Feminist Morality: Transforming Culture,\nSociety, and Politics</em>, Chicago: University of Chicago Press.</li>\n<li>Heyes, Cressida, 2007. <em>Self-Transformations: Foucault, Ethics,\nand Normalized Bodies</em>, Oxford: Oxford University Press.</li>\n<li>Hoagland, Sarah Lucia, 1988. <em>Lesbian Ethics: Toward a New\nValue</em>, Palo Alto: Institute of Lesbian Studies.</li>\n<li>Hobbes, Thomas, 1985 (1641). <em>Leviathan</em>, New York: Penguin\nBooks.</li>\n<li>hooks, bell, 1981. <em>Ain’t I a Woman? Black Women and\nFeminism</em>, Boston: South End Press.</li>\n<li>Huffer, Lynne, 2013. <em>Are the Lips a Grave? A Queer Feminist on\nthe Ethics of Sex</em>, New York: Columbia University Press.</li>\n<li>Irigaray, Luce, 1981. “And the One Doesn’t Stir\nWithout the Other,” trans. Hélène Vivienne Wenzel.\n<em>Signs</em>, 7(1): 60–67.</li>\n<li>–––, 1985. <em>This Sex Which Is Not One</em>,\nIthaca, NY: Cornell University Press.</li>\n<li>Khader, Serene, 2011. <em>Adaptive Preferences and Women’s\nEmpowerment</em>, New York: Oxford University Press.</li>\n<li>Kruks, Sonia, 2001. <em>Retrieving Experience: Subjectivity and\nRecognition in Feminist Politics</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Kuykendall, Eléanor H., 1983. “Toward an Ethic of\nNurturance: Lluce Irigaray on Mothering and Power,” in Joyce\nTrebillcot (ed.), <em>Mothering: Essays in Feminist Theory</em>,\nSavage, MD: Rowman and Littlefield.</li>\n<li>Langton, Rae, 2009. <em>Sexual Solipsism: Philosophical Essays on\nPornography and Objectification</em>, Oxford: Oxford University\nPress.</li>\n<li>Lorde, Audre, 1984. <em>Sister/Outsider: Essays and Speeches by\nAudre Lorde</em>, Freedom, CA: Crossing Press.</li>\n<li>Lugones, María, 2003.<em> Pilgrimages/Peregrinajes:\nTheorizing Coalition against Multiple Oppressions</em>, Lanham, MD:\nRowman and Littlefield.</li>\n<li>–––, 2007. “Heterosexualism and the\nColonial/Modern Gender System,” <em>Hypatia</em>, 22 (1):\n186–209.</li>\n<li>–––, 2010. “Toward a Decolonial\nFeminism,” <em>Hypatia</em>, 25: (4): 742–759</li>\n<li>Lukes, Steven, 1974. <em>Power: A Radical View</em>, London:\nMacmillan.</li>\n<li>–––, 1986. “Introduction” in Steven\nLukes (ed.), <em>Power</em>, Oxford: Blackwell.</li>\n<li>–––, 2005. <em>Power: A Radical View</em>, 2nd\nexpanded edition. London: Macmillan.</li>\n<li>MacKinnon, Catharine, 1987. <em>Feminism Unmodified: Discourses on\nLife and Law</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 1989. <em>Toward a Feminist Theory of the\nState</em>, Cambridge, MA: Harvard University Press.</li>\n<li>McCall, Leslie, 2005. “The Complexity of\nIntersectionality,” <em>Signs: Journal of Women in Culture and\nSociety</em>, 30(3): 1771–1800.</li>\n<li>McLaren, Margaret, 2002. <em>Feminism, Foucault, and Embodied\nSubjectivity</em>, Albany, NY: SUNY Press.</li>\n<li>McNay, Lois, 1992. <em>Foucault and Feminism: Power, Gender, and\nthe Self</em>, Boston: Northeastern University Press.</li>\n<li>McWhorter, Ladelle, 1999. <em>Bodies and Pleasures: Foucault and\nthe Politics of Sexual Normalization</em>, Bloomington, IN: Indiana\nUniversity Press.</li>\n<li>–––. 2009. <em>Racism and Sexual Oppression in\nAnglo-America: A Genealogy</em>, Indianapolis, IN: Indiana University\nPress.</li>\n<li>Mezzadri, Alessandra, 2019. “On the Value of Social\nReproduction,” <em>Radical Philosophy</em>, 2(4):\n33–41.</li>\n<li>Mies, Maria, 1986. <em>Patriarchy and Accumulation on a World\nScale: Women in the International Division of Labor</em>, London: Zed\nBooks.</li>\n<li>Mill, John Stuart, 1970. “The Subjection of Women” in\nAlice Rossi (ed.), <em>Essays on Sex Equality</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Miller, Jean Baker, 1992. “Women and Power” in Thomas\nWartenberg (ed.), <em>Rethinking Power</em>, Albany, NY: SUNY\nPress.</li>\n<li>Mohanty, Chandra Talpade, 1988. “Under Western Eyes:\nFeminist Scholarship and Colonial Discourses,” <em>Feminist\nReview</em>, 30: 61–88.</li>\n<li>Morriss, Peter, 2002. <em>Power: A Philosophical Analysis</em>,\n2nd edition. Manchester: Manchester University Press.</li>\n<li>Nash, Jennifer, 2008. “Re-thinking Intersectionality.”\n<em>Feminist Review</em>, 89: 1–15.</li>\n<li>–––, 2019. <em>Black Feminism Reimagined: After\nIntersectionality</em>, Durham, NC: Duke University Presss.</li>\n<li>Okin, Susan Moller, 1989. <em>Justice, Gender and the Family</em>,\nNew York: Basic Books.</li>\n<li>Oksala, Johanna, 2005. <em>Foucault on Freedom</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2016. <em>Feminist Experiences: Foucauldian\nand Phenomenological Investigations</em>, Evanston, IL: Northwestern\nUniversity Press.</li>\n<li>Ortega, Mariana, 2016. <em>In-Between: Latina Feminist\nPhenomenology, Multiplicity, and the Self</em>, Albany, NY: SUNY\nPress.</li>\n<li>Pateman, Carole, 1988. <em>The Sexual Contract</em>, Stanford:\nStanford University Press.</li>\n<li>Pateman, Carole, and Charles Mills, 2007. <em>Contract and\nDomination</em>, Cambridge: Polity Press.</li>\n<li>Pitkin, Hanna Fenichel, 1972. <em>Wittgenstein and Justice: On the\nSignificance of Ludwig Wittgenstein for Social and Political\nThought</em>, Berkeley, CA: University of California Press.</li>\n<li>Puar, Jasbir, 2007. <em>Terrorist Assemblages: Homonationalism in\nQueer Times</em>, Durham, NC: Duke University Press.</li>\n<li>–––, 2012. “‘I would rather be a\ncyborg than a goddess’: Becoming-Intersectional in Assemblage\nTheory,” <em>PhiloSOPHIA</em>, 2(1): 49–66.</li>\n<li>Quijano, Anibal, 2000. “Coloniality of Power, Eurocentrism,\nand Latin America,” <em>Nepantla: Views from South</em>, 1(3):\n533–580.</li>\n<li>Ramamurthy, Priti and Ashwini Tambe, 2017. “Preface,”\nin <em>Decolonial and Postcolonial Approaches: A Dialogue</em>,\nSpecial Issue of <em>Feminist Studies</em>, 43(3): 503–511.</li>\n<li>Ramazanoglu, Caroline (ed.), 1993. <em>Up Against Foucault:\nExplorations of some tensions between Foucault and feminism</em>, New\nYork: Routledge.</li>\n<li>Rubin, Gayle, 1976. “The Traffic in Women: Notes on the\nPolitical Economy of Sex,” in Rayna Reiter (ed.), <em>Toward an\nAnthropology of Women</em>, New York: Monthly Review Press.</li>\n<li>Ruíz, Elena, 2021. “Postcolonial and Decolonial\nTheories,” in Kim Q. Hall and Ásta (eds.), <em>The Oxford\nHandbook of Feminist Philosophy</em>, Oxford: Oxford University\nPress.</li>\n<li>Saar, Martin, 2010. “Power and Critique,” <em>Journal\nof Power</em>, 3(1): 7–20.</li>\n<li>–––, 2013. <em>Die Immanenz der Macht:\nPolitische Theorie nach Spinoza</em>, Berlin: Suhrkamp Verlag.</li>\n<li>Said, Edward, 1979. <em>Orientalism</em>, New York: Vintage\nBooks.</li>\n<li>–––, 1986. “Foucault and the Imagination\nof Power,” in David Couzens Hoy (ed.), <em>Foucault: A Critical\nReader</em>, Oxford: Blackwell.</li>\n<li>Salamon, Gayle, 2010. <em>Assuming a Body: Transgender and the\nRhetorics of Materiality</em>, New York: Columbia University\nPress.</li>\n<li>Sawicki, Jana, 1991. <em>Disciplining Foucault: Feminism, Power,\nand the Body</em>, New York: Routledge.</li>\n<li>Sheth, Falguni, 2014. “Interstitiality: Making Space for\nMigration, Diaspora, and Racial Complexity,” <em>Hypatia</em>,\n29(1): 75–93.</li>\n<li>Simons, Margaret, 2002. “Beauvoir and the Problem of\nRacism,” in Julie K. Ward and Tommy L. Lott (eds.),\n<em>Philosophers on Race: Critical Essays</em>, Oxford:\nBlackwell.</li>\n<li>Spinoza, Benedict de, 2002a. “Theological-political\nTreatise,” in M. L. Morgan (ed.), <em>Complete Works</em>,\nIndianapolis: Hackett, pp. 383–583.</li>\n<li>–––, 2002b. “Political Treatise,” in\nM. L. Morgan (ed), <em>Complete Works</em>, Indianapolis: Hackett, pp.\n676–754.</li>\n<li>Spivak, Gayatri, 1988. “Can the Subaltern Speak?”in C.\nNelson and L. Grossberg (eds.), <em>Marxism and the Interpretation of\nCulture</em>, Basingstoke: Macmillan.</li>\n<li>Starhawk, 1987. <em>Truth or Dare: Encounters with Power,\nAuthority, and Mystery</em>, San Francisco: Harper.</li>\n<li>Wartenberg, Thomas, 1990. <em>The Forms of Power: From Domination\nto Transformation</em>, Philadelphia: Temple University Press.</li>\n<li>Weber, Max, 1978. <em>Economy and Society: An Outline of\nInterpretive Sociology</em>, trans. Ephraim Fischoff et al., Berkeley,\nCA: University of California Press.</li>\n<li>Weiss, Gail, 1999. <em>Body Images: Embodiment as\nIntercorporeality</em>, New York: Routledge.</li>\n<li>Yeatmann, Anna, 1997. “Feminism and Power,” in Mary\nLyndon Shanley and Uma Narayan (eds.), <em>Reconstructing Political\nTheory: Feminist Perspectives</em>, University Park: The\nPennsylvania State University Press.</li>\n<li>Young, Iris Marion, 1990a. <em>Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1990b. <em>Throwing Like a Girl And Other\nEssays in Feminist Philosophy and Social Theory</em>, Bloomington:\nIndiana University Press.</li>\n<li>–––, 1992. “Five Faces of\nOppression” in Thomas Wartenberg (ed.), <em>Rethinking\nPower</em>, Albany: State University of New York Press.</li>\n<li>Zack, Naomi, 2005. <em>Inclusive Feminism: A Third Wave Theory of\nWomen’s Commonality</em>, Lanham, MD: Rowman and\nLittlefield.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Arendt, Hannah",
            "Beauvoir, Simone de",
            "critical theory",
            "existentialism",
            "feminist philosophy, approaches: analytic philosophy",
            "feminist philosophy, approaches: continental philosophy",
            "feminist philosophy, approaches: intersections between analytic and continental philosophy",
            "feminist philosophy, interventions: liberal feminism",
            "feminist philosophy, topics: perspectives on class and work",
            "feminist philosophy, topics: perspectives on sex and gender",
            "feminist philosophy, topics: perspectives on the body",
            "feminist philosophy, topics: perspectives on the self",
            "Foucault, Michel",
            "identity politics",
            "Marx, Karl",
            "phenomenology",
            "race"
        ],
        "entry_link": [
            {
                "../arendt/": "Arendt, Hannah"
            },
            {
                "../beauvoir/": "Beauvoir, Simone de"
            },
            {
                "../existentialism/": "existentialism"
            },
            {
                "../femapproach-analytic/": "feminist philosophy, approaches: analytic philosophy"
            },
            {
                "../femapproach-continental/": "feminist philosophy, approaches: continental philosophy"
            },
            {
                "../femapproach-analy-cont/": "feminist philosophy, approaches: intersections between analytic and continental philosophy"
            },
            {
                "../feminism-liberal/": "feminist philosophy, interventions: liberal feminism"
            },
            {
                "../feminism-class/": "feminist philosophy, topics: perspectives on class and work"
            },
            {
                "../feminism-gender/": "feminist philosophy, topics: perspectives on sex and gender"
            },
            {
                "../feminist-body/": "feminist philosophy, topics: perspectives on the body"
            },
            {
                "../feminism-self/": "feminist philosophy, topics: perspectives on the self"
            },
            {
                "../foucault/": "Foucault, Michel"
            },
            {
                "../identity-politics/": "identity politics"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../race/": "race"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminist-power\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminist-power/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminist-power&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feminist-power/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminist-power": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminist-power/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminist-power&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feminist-power/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}