{
    "url": "feyerabend",
    "title": "Paul Feyerabend",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "John Preston",
        "author_links": [
            {
                "http://www.rdg.ac.uk/AcaDepts/ld/Philos/jmp/jmp.htm": "John Preston"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.rdg.ac.uk/AcaDepts/ld/Philos/jmp/jmp.htm\" target=\"other\">John Preston</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Aug 26, 1997",
        "substantive revision Mon Aug 24, 2020"
    ],
    "preamble": "\n\nPaul Feyerabend (b.1924, d.1994), having studied science at the\nUniversity of Vienna, moved into philosophy for his doctoral thesis,\nmade a name for himself both as an expositor and (later) as a critic\nof Karl Popper’s “critical rationalism”, and went on\nto become one of the twentieth century’s most famous\nphilosophers of science. An imaginative maverick, he became a critic\nof philosophy of science itself, particularly of\n“rationalist” attempts to lay down or discover rules of\nscientific method. \n",
    "toc": [
        {
            "#BrieChroFeyeLifeWork": "1. A Brief Chronology of Feyerabend’s Life and Work"
        },
        {
            "#FeyeEarlLife": "2. Feyerabend’s Early Life"
        },
        {
            "#Yout19241938": "2.1 Youth (1924 –1938)"
        },
        {
            "#Ansc1938": "2.2 The Anschluss (1938)"
        },
        {
            "#War1939": "2.3 The War (1939–1945)"
        },
        {
            "#PostWarActi1945": "2.4 Post-War Activities (1945–1947)"
        },
        {
            "#FeyeTurnPhilVienCircPoppWitt": "3. Feyerabend’s Turn to Philosophy: The Vienna Circle, Popper, and Wittgenstein"
        },
        {
            "#RetuVienUnivLifeAlpbPopp1947": "3.1 Return to Vienna: University Life, Alpbach, and Popper (1947–1948)"
        },
        {
            "#EarlContWitt1948": "3.2 Early Contact with Wittgenstein (1948–1952)"
        },
        {
            "#LifeLondSchoEcon1952": "3.3 Life at the London School of Economics (1952–1953)"
        },
        {
            "#RetuVien1953": "3.4 Return to Vienna (1953–1955)"
        },
        {
            "#FeyeEarlWorkLibeEmpi": "4. Feyerabend’s Early Work: Liberalizing Empiricism"
        },
        {
            "#FirsAcadAppoUnivBris1955": "4.1 First Academic Appointment: the University of Bristol (1955–1958)"
        },
        {
            "#UnivCaliBerkEarlYear1958": "4.2 The University of California at Berkeley: Early Years (1958–1964)"
        },
        {
            "#ImpaStudRevo": "4.3 The Impact of the “Student Revolution”"
        },
        {
            "#LateSixt": "4.4 The Late Sixties"
        },
        {
            "#FeyeLateWorkTowaRelaButThenBeyoIt": "5. Feyerabend’s Later Work: Towards Relativism, but then Beyond It"
        },
        {
            "#AgaiMeth1970": "5.1 Against Method (1970–75)"
        },
        {
            "#PoliConsEpisAnarScieFreeSoci1978": "5.2 The Political Consequences of Epistemological Anarchism: Science in a Free Society (1978)"
        },
        {
            "#TenWondYearEighBerkZuri": "5.3 Ten Wonderful Years: The Eighties in Berkeley and Zurich"
        },
        {
            "#FeyeNine": "5.4 Feyerabend in the Nineties"
        },
        {
            "#ConcLastThin": "6. Conclusion: Last Things"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#FeyeMajoWrit": "Feyerabend’s Major Writings"
        },
        {
            "#AudiReco": "Audio Recordings"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. A Brief Chronology of Feyerabend’s Life and Work\n\n\n1924\nBorn in Vienna. Son of a civil servant and a seamstress.\n\n\n1940\nWas inducted into the Arbeitsdienst (the work service\nintroduced by the Nazis). \n\n1942\nDrafted into the Pioneer Corps of the German army. After basic\ntraining, volunteered for Officers’ School. \n\n1943\nLearned of his mother’s suicide. \n\n1944\nDecorated, Iron Cross. Advanced to Lieutenant. Lectured to\nOfficers’ School. \n\n1945\nShot in the hand and in the belly during the retreat from the\nRussian Army. The bullet damaged his spinal nerves. \n\n1946\nReceived a fellowship to study singing and stage-management in\nWeimar. Joined the “Cultural Association for the Democratic\nReform of Germany”. \n\n1947\nReturned to Vienna to study history and sociology at the\nUniversity. Soon transferred to physics. First article, on the concept\nof illustration in modern physics, published. Feyerabend “a\nraving positivist” at the time. \n\n1948\nFirst visit to the Alpbach seminar of the Austrian College\nSociety. Became secretary of the seminars. Met Karl Popper and Walter\nHollitscher. Married first wife, Edeltrud. \n\n1949\nBecame student leader of the “Kraft Circle”, a\nstudent philosophy club centred around Viktor Kraft,\nFeyerabend’s dissertation supervisor and a former member of the\nVienna Circle. Ludwig Wittgenstein visited the Kraft Circle to give a\ntalk. Feyerabend also met Bertolt Brecht. \n\n1951\nReceived doctorate in philosophy for his thesis on “basic\nstatements”. Applied for a British Council scholarship to study\nunder Wittgenstein at Cambridge. But Wittgenstein died before\nFeyerabend arrived in England, so Feyerabend chose Popper as his\nsupervisor instead. \n\n1952\nCame to England, to study under Popper at the London School of\nEconomics. Concentrated on the quantum theory and Wittgenstein.\nStudied the typescript of Wittgenstein’s Philosophical\nInvestigations, and prepared a summary of the book. Befriended\nanother of Popper’s students, Joseph Agassi. \n\n1953\nFeyerabend returned to Vienna. Popper applied for an extension\nto his scholarship, but Feyerabend decided to remain in Vienna\ninstead. Translated Popper’s The Open Society and its\nEnemies into German. Declined the offer to become Popper’s\nresearch assistant. Agassi took the post. Feyerabend became research\nassistant to Arthur Pap in Vienna. \n\n1954\nFirst articles on quantum mechanics and on Wittgenstein\npublished. Pap introduced Feyerabend to Herbert Feigl. \n\n1955\nTook up his first full-time academic appointment as lecturer in\nphilosophy at the University of Bristol, England. His summary of\nWittgenstein’s Philosophical Investigations appeared as\na review of the book in The Philosophical Review. \n\n1956\nMarried second wife, Mary O’Neill. Published an article on\nthe “paradox of analysis”. Feyerabend got to know the\nquantum physicist David Bohm, whose ideas were to influence him\nsubstantially. \n\n1957\nGave a paper on the quantum theory of measurement to the Colston\nResearch Symposium at the University of Bristol. \n\n1958\nTook up visiting lectureship at the University of California,\nBerkeley. Two of his most important early papers, “An Attempt at\na Realistic Interpretation of Experience”, and\n“Complementarity” appeared in the proceedings of the\nAristotelian Society. In them, Feyerabend argued against positivism\nand in favour of a scientific realist account of the relation between\ntheory and experience, largely on grounds familiar from Karl\nPopper’s falsificationist views. \n\n1959\nAccepted a permanent position at Berkeley, and applied for a\nGreen Card to work in the US. \n\n1960\nAs a result of earlier discussions with Herbert Feigl,\nFeyerabend published “Das Problem der Existenz theoretischer\nEntitäten”, in which he argued that there is no special\n“problem” of theoretical entities, and that all\nentities are hypothetical. Gave two lectures to Oberlin College, Ohio,\nin which he embroidered on Popper’s views about the pre-Socratic\nthinkers. \n\n1962\n“Explanation, Reduction, and Empiricism” appeared.\nCriticised existing empiricist accounts of explanation and theoretical\nreduction (Hempel, Nagel), and introduced the concept of\nincommensurability, based on the “contextual theory of\nmeaning” which Feyerabend claimed to find in\nWittgenstein’s Investigations. \n\n1963\n“How to be a Good Empiricist”, a position paper\nsumming up his point of view, was published, along with his two main\narticles on the Mind/Body Problem in which he introduced the position\nnow known as “eliminative materialism”. \n\n1965\nPublication of the first part of the essay “Problems of\nEmpiricism”, and his “Reply to Criticism”, in which\nFeyerabend made his last serious attempt to construct a\n“tolerant”, “disinfected” empiricism. Although\nbeginning to put some distance between himself and Popper, Feyerabend\nwas still able to write a glowing review of Popper’s\nConjectures and Refutations. \n\n1967–8\nFocus of his published papers had by now moved to\n“theoretical pluralism”, the view that in order to\nmaximise the chances of falsifying existing theories, scientists\nshould construct and defend as many alternative theories as possible.\nFeyerabend’s articles “On a Recent Critique of\nComplementarity” defended Niels Bohr’s views against\nPopper’s critique. Popper not amused. \n\n1969\nIn a tiny article, “Science Without Experience”,\nFeyerabend finally gave up the attempt to be an empiricist, arguing\nthat in principle experience is necessary at no point in the\nconstruction, comprehension or testing of empirical scientific\ntheories. \n\n1970\nPublication of “Consolations for the Specialist”, in\nwhich Feyerabend attacked Popper from a Kuhnian point of view, and the\nessay version of “Against Method: Outline of an Anarchistic\nTheory of Knowledge”, in which “epistemological\nanarchism” was revealed for the first time. Feyerabend claimed\nto be applying the liberalism of John Stuart Mill’s On\nLiberty to scientific methodology. Published little during the\nnext few years. \n\n1974\nDeath of Feyerabend’s friend Imre Lakatos, putting paid to\ntheir plans to produce a dialogue volume, For and Against\nMethod. Feyerabend, lecturing at the University of Sussex, was\nill too. Published a scathing review of Popper’s Objective\nKnowledge. \n\n1975\nAppearance of Feyerabend’s first book, Against\nMethod, setting out “epistemological anarchism”,\nwhose main thesis was that there is no such thing as the\nscientific method. Great scientists are methodological opportunists\nwho use any moves that come to hand, even if they thereby violate\ncanons of empiricist methodology. \n\n1976–7\nFeyerabend replies to most of the major reviewers of Against\nMethod. Got depressed. Published his first major article on\nrelativism: the first time he explicitly endorsed the view. \n\n1978\nScience in a Free Society appears, including replies to\nreviewers of Against Method. Some clarification of\nepistemological anarchism, and very little retreat from the position\nset out in AM. Explored further the political implications of\nepistemological anarchism. The book also included one of\nFeyerabend’s major endorsements of relativism, one of the views\nfor which he was becoming known. First volume of the German edition of\nFeyerabend’s philosophical papers appears. (Feyerabend published\nincreasingly in German from this point onwards). \n\n1981\nEnglish publication of the first two volumes of\nFeyerabend’s Philosophical Papers, with new material in\nintroductory chapters. \n\n1983\nMet Grazia Borrini at his Berkeley lectures. \n\n1984\nPublishes “Science as an Art”, in which he defends\nan explicitly relativistic account of the history of science according\nto which there is change, but no “progress”. Also\ncontinues his campaign to rehabilitate Ernst Mach. \n\n1987\nPublication of Farewell to Reason, a volume collecting\nsome of the papers Feyerabend had published between 1981 and 1987.\nRelativism again at the forefront, especially in its\n“Protagorean” version. \n\n1988\nSecond, revised edition of Against Method, omitting the\nlong chapter on the history of the visual arts, but now incorporating\nparts of Science in a Free Society, appeared. \n\n1989\nPaul and Grazia married in January. Left for Italy and\nSwitzerland in the fall, at least partly because of the effects of the\nOctober earthquake in California. \n\n1990\nOfficially resigned from Berkeley in March. \n\n1991\nRetired from Zurich. Three Dialogues on Knowledge and\nBeyond Reason, a festschrift edited by a former pupil,\nGonzalo Munévar, published. Also lots of small publications,\nmany of them in Common Knowledge. Signs of an increasing\nunhappiness with relativism in Feyerabend’s publications around\nthis time. But still vigorously opposed to\n“objectivism”. \n\n1993\nThird edition of Against Method published. Feyerabend\ndeveloped an inoperable brain tumour, and was hospitalized. \n\n1994\nFeyerabend died in the Genolier clinic (Genolier, Canton of\nVaud, Switzerland), February 11th. Several major memorial symposia and\ncolloquia on his work took place over the next two years. \n\n1995\nKilling Time: The Autobiography of Paul Feyerabend\npublished. \n\n1999\nConquest of Abundance published. \n\n2. Feyerabend’s Early Life\n\n(Unless otherwise stated, page references are to Killing Time: The\nAutobiography of Paul Feyerabend, (Chicago: University of Chicago\nPress, 1995), henceforth referred to as “KT”).\n\n2.1 Youth (1924 –1938)\n\nPaul Karl Feyerabend was born into a middle-class Viennese family in\n1924. Times were hard in Vienna in the nineteen-twenties: in the\naftermath of the First World War there were famines, hunger riots, and\nrunaway inflation. Feyerabend’s family had a three-room\napartment on the Wolfganggasse, “a quiet street lined\nwith oak trees” (p. 11). The first chapters of his autobiography\ngive the impression of his being a strange child, whose activities\nwere entirely centred around his own family, and who was cut off from\nneighbors, other children and the outside world because “[t]he\nworld is a dangerous place” (p. 15). Between the ages of three\nand six, Feyerabend recalls, he spent most of his time in the\napartment’s kitchen and bedroom. Occasional visits to the cinema\nand numerous stories, especially stories with a magical aura, seem to\nhave taken the place usually filled by childhood friends. He was a\nsickly child, but ran away from home once, when he was five years old\n(p. 7). When he started school at the age of six, he “had no\nidea how other people lived or what to do with them” (p. 16).\nThe world seemed to be filled with strange and inexplicable\nhappenings. It took him some while to get used to school, which\ninitially made him sick. But when he did so, his health problems had\ndisappeared. When he learned to read, he found the new and magical\nworld of books waiting for him, and indulged himself to the full (p.\n25). But his sense of the world’s inexplicability took some time\nto dissipate—he recalls feeling that way about events during the\nnineteen-thirties and throughout the second world war.\n\nFeyerabend attended a Realgymnasium (High School) at which he\nwas taught Latin, English, and science. He was a\nVorzugsschüler, that is, “a student whose grades\nexceeded a certain average” (p. 22), and by the time he was\nsixteen he had the reputation of knowing more about physics and math\nthan his teachers. But he also got thrown out of school on one\noccasion.\n\nFeyerabend “stumbled into drama” (p. 26) by accident,\nbecoming something of a ham actor in the process. This accident then\nled to another, when he found himself forced to accept philosophy\ntexts among the bundles of books he had bought for the plays and\nnovels they contained. It was, he later claimed, “the dramatic\npossibilities of reasoning and… the power that arguments seem\nto exert over people” (p. 27) with which philosophy fascinated\nhim. Although his reputation was as a philosopher, he preferred to be\nthought of as an entertainer. His interests, he said, were always\nsomewhat unfocussed (p. 27).\n\nHowever, Feyerabend’s school physics teacher Oswald Thomas\ninspired in him an interest in physics and astronomy. The first\nlecture he gave (at school) seems to have been on these subjects (p.\n28). Together with his father, he built a telescope and “became\na regular observer for the Swiss Institute of Solar Research”\n(p. 29). He describes his scientific interests as follows:\n\nI was interested in both the technical and the more general aspects of\nphysics and astronomy, but I drew no distinction between them. For me,\nEddington, Mach (his Mechanics and Theory of Heat),\nand Hugo Dingler (Foundations of Geometry) were scientists\nwho moved freely from one end of their subject to the other. I read\nMach very carefully and made many notes. (p. 30).\n\n\nFeyerabend does not tell us how he became acquainted with another one\nof his main preoccupations—singing. He was proud of his voice,\nbecoming a member of a choir, and took singing lessons for years,\nlater claiming to have remained in California in order not to have to\ngive up his singing teacher. In his autobiography he talks of the\npleasure, greater than any intellectual pleasure, derived from having\nand using a well-trained singing voice (p. 83). During his time in\nVienna in the second world war, his interest led him to attend the\nopera (first the Volksoper, and then the Staatsoper)\ntogether with his mother. A former opera singer, Johann Langer, gave\nhim singing lessons and encouraged him to go to an academy. After\npassing the entrance examination, Feyerabend did so, becoming a pupil\nof Adolf Vogel. At this point in his life, he later recalled: \n\nThe course of my life was… clear: theoretical astronomy during\nthe day, preferably in the domain of perturbation theory; then\nrehearsals, coaching, vocal exercises, opera in the evening…;\nand astronomical observation at night… The only remaining\nobstacle was the war. (p. 35).\n\n2.2 The Anschluss (1938)\n\nFeyerabend tells how, without falling for Adolf Hitler’s\ncharisma, he appreciated Hitler’s oratorial style. Austria was\nre-unified with Germany in 1938. Jewish schoolmates were treated\ndifferently, and Jewish neighbours and acquaintances started\ndisappearing. But, as usual, Feyerabend had no clear view of the\nsituation: \n\nMuch of what happened I learned only after the war, from articles,\nbooks, and television, and the events I did notice either made no\nimpression at all or affected me in a random way. I remember them and\nI can describe them, but there was no context to give them meaning and\nno aim to judge them by. (pp. 37–8).\n\n\nFor me the German occupation and the war that followed were an\ninconvenience, not a moral problem, and my reactions came from\naccidental moods and circumstances, not from a well-defined outlook.\n(p. 38).\n\n\nThe general impression given by his autobiography is of an imaginative\nbut fairly solitary person with no stable or well-defined personality.\nRather, his decisions and courses of action seem to have been the\nresult of a struggle between his tendency to conform and his\ncontrariness. Just as when he was a child, events happening around him\nseemed strange, distant, and out of context. It is very difficult to\nsee him identifying with any group, and he must have made an unlikely\nsoldier. \n2.3 The War (1939–1945)\n\nAs far as his army record goes, Feyerabend claims in his autobiography\nthat his mind is a blank. But in fact this is one of the periods he\ntells us most about. Having passed his final high school exams in\nMarch 1942, he was drafted into the Arbeitsdienst (the work\nservice introduced by the Nazis), and sent for basic training in\nPirmasens, Germany. Feyerabend opted to stay in Germany to keep out of\nthe way of the fighting, but subsequently asked to be sent to where\nthe fighting was, having become bored with cleaning the barracks! He\neven considered joining the SS, for aesthetic reasons. His unit was\nthen posted at Quelerne en Bas, near Brest, in Brittany. Still, the\nevents of the war did not register. In November 1942, he returned home\nto Vienna, but left before Christmas to join the Wehrmacht’s\nPioneer Corps. \n\nTheir training took place in Krems, near Vienna. Feyerabend soon\nvolunteered for officers’ school, not because of an urge for\nleadership, but out of a wish to survive, his intention being to use\nofficers’ school as a way to avoid front-line fighting. The\ntrainees were sent to Yugoslavia. In Vukovar, during July 1943, he\nlearnt of his mother’s suicide, but was absolutely unmoved, and\nobviously shocked his fellow officers by displaying no feeling. In\nDecember that same year, Feyerabend’s unit was sent into battle\non the northern part of the Russian front, but although they blew up\nbuildings, they never encountered any Russian soldiers.\n\nDespite the fact that Feyerabend reports of himself that he was\nfoolhardy during battle, treating it as a theatrical event, he\nreceived the Iron Cross (second class) early in March 1944, for\nleading his men into a village under enemy fire, and occupying it. He\nwas advanced from private soldier to lance corporal, to sergeant, and\nthen, at the end of 1944, to lieutenant. At the end of November that\nyear, he gave a series of lectures to the officers’ school at\nDessau Rosslau, near Leipzig. Their theme was the\n(“historicist”) one that “historical periods such as\nthe Baroque, the Rococo, the Gothic Age are unified by a concealed\nessence that only a lonely outsider can understand” (p. 49). His\ndescription of these lectures, and of his notebook entries at the\ntime, reveals the influence of Friedrich Nietzsche in their\nfascination with this “lonely outsider”, “the\nsolitary thinker” (p. 48).\n\nHaving returned home for Christmas 1944, Feyerabend again boarded the\ntrain for the front, this time for Poland, in January 1945. There he\nwas put in charge of a bicycle company. Although he claims to have\nrelished the role of army officer no more than he later did that of\nuniversity professor, he must have been at least a competent soldier,\nsince in the field he came to take the place of a sequence of injured\nofficers: first a lieutenant, then a captain, and then a major, before\nhe was shot during another heroic act of carelessness performed in the\n1945 retreat westwards from the Russian army. The bullet lodged in his\nspine left him temporarily paralysed from the waist down, meaning that\nhe spent time in a wheelchair, then on crutches, and thereafter walked\nwith the aid of a stick. The war ended as he was recovering from his\ninjury, in a hospital in Apolda, a little town near Weimar, while\nfervently hoping not to recover before the war was over.\nGermany’s surrender came as a relief, but also as a\ndisappointment relative to past hopes and aspirations. He later said\nof his stint in the army that it was “an interruption, a\nnuisance; I forgot about it the moment it was over” (p.\n111).\n2.4 Post-War Activities (1945–1947)\n\nHowever, the war took its toll even on Feyerabend. The bullet in his\nspine left him impotent for the rest of his life. (His descriptions of\nsubsequent sexual encounters are one of the more amusing parts of his\nautobiography). Although he started off completely ignorant of women,\nhe married four times, and had, by his own account, plenty of affairs.\nBut he seems to have been distant not just in his relationship with\nhis parents, but in some of his marriages too. He hated the slavery\nlove seemed to imply, but hated equally the freedom achieved by taking\nevasive action. He got bogged down in cycles of dependence, isolation,\nand renewed dependence, which only dissolved into a more balanced\npattern after many years. \n\nAt the end of the war, Feyerabend went to the mayor of Apolda and\nasked for a job. He was assigned to the education section, given an\noffice and a secretary and, fittingly, put in charge of\nentertainment.\n\nIn 1946, having recovered from paralysis, he received a state\nfellowship to return to study singing and stage-management for a year\nat the Musikhochschule in Weimar. He moved from Apolda to\nWeimar after about three months. At the Weimar Institut zur\nMethodologischen Erneuerung des Deutschen Theaters he studied\ntheatre, and at the Weimar academy he took classes in Italian,\nharmony, piano, singing and enunciation. Singing remained one of his\nlife’s major interests. He attended performances (drama, opera,\nballet, concerts) at Weimar’s Nationaltheater, and\nlater reminisced about opera stars of the time, recalling debates and\narguments about theatre (e.g. the stereotyping of roles and plays)\nwith Maxim Vallentin, Hans Eisler, etc. He also played a small part in\none of the films of G.W.Pabst, a notable German film-director.\nAlthough, by his own account, he led a full life, he became restless\nand decided to move.\n3. Feyerabend’s Turn to Philosophy: The Vienna Circle, Popper, and Wittgenstein\n3.1 Return to Vienna: University Life, Alpbach, and Popper (1947–1948)\n\nFeyerabend therefore returned, still on crutches, to his\nparents“ apartment house in Vienna’s 15th district.\nAlthough he planned to study physics, maths and astronomy, he chose\ninstead to read history and sociology at the University of\nVienna’s Institut für Osterreichische\nGeschichtsforschung, thinking that history, unlike physics, is\nconcerned with real life. But he became dissatisfied with history, and\nreturned to theoretical physics. Together with a group of science\nstudents, who all regarded themselves as far superior to students of\nother subjects, Feyerabend invaded philosophy lectures and seminars.\nAlthough this was not his first contact with philosophy, it seems to\nhave been the period which cemented his interest. He recalls that in\nall interventions he took the radical positivist line that science is\nthe basis of knowledge; that it is empirical; and that nonempirical\nenterprises are either logic or nonsense (p. 68). These views would\nhave been familiar from the climate of Logical Positivism which found\nits main root in the Vienna Circle, a group of scientifically-minded\nphilosophers who, in the nineteen-twenties and ”thirties sought\nto deploy the newly-revitalised formal logic of Gottlob Frege and\nRussell and Whitehead’s Principia Mathematica to\nrepresent the structure of human knowledge. As we shall see,\nFeyerabend’s youthful positivist scientism makes quite a\ncontrast with his later conclusions. \n\nIn August 1948, at the first meeting of the international summer\nseminar of the Austrian College Society in Alpbach which he attended,\nFeyerabend met the philosopher of science Karl Popper, who had already\nmade a name for himself as the Vienna Circle’s “official\nopposition”. (The Austrian College Society had been founded in\n1945 by Austrian resistance fighters, “to provide a forum for\nthe exchange of scholars and ideas and so to prepare the political\nunification of Europe” (Science in a Free Society, p.\n109)). In his 1934 book Logik der Forschung Popper had\nelaborated the straightforward and appealing falsificationist view\nthat great science could be characterised as a process in which\nthinkers put forward bold conjectures and then do their best to\nimprove them by trying to refute them. Instead of trying to develop an\ninductive logic, Popper argued for the (deductivist) view that\nscientific method could be characterised in terms of logically valid\ndeductive inferences.\n\nPopper’s own autobiography, unfortunately, tells us nothing\nabout their meeting or their relationship, despite the fact that he\nwas to be the largest single influence (first positive, then negative)\non Feyerabend’s work. For those hoping that Feyerabend might use\nthe occasion of his autobiography to settle accounts with his\nerstwhile philosophical conscience, it is disappointing that the book\ntells us so little about his acquaintance with Popper. Elsewhere\nFeyerabend tells us that he\n\nadmired [Popper’s] freedom of manners, his cheek, his\ndisrespectful attitude towards the German philosophers who gave the\nproceedings weight in more senses than one, his sense of\nhumour… [and] his ability to restate ponderous problems in\nsimple and journalistic language. Here was a free mind, joyfully\nputting forth his ideas, unconcerned about the reaction of the\n“professionals”. (SFS, p. 115).\n\n\nBut Popper’s ideas themselves, Feyerabend alleges, were not new\nto him, deductivism having been defended as early as 1925 by Viktor\nKraft, and falsificationism being “taken for granted” at\nAlpbach. Popper’s ideas, he remarks, were also similar to those\nof another Viennese philosopher, Ludwig Wittgenstein (!), although\n“more abstract and anaemic” (SFS, p. 116). Over\nthe following years, Feyerabend attended the Alpbach symposium about\nfifteen times, first as a student, then as a lecturer and seminar\nchair. He was offered, and accepted, the post of “scientific\nsecretary” to the society, and this he calls “the most\ndecisive step of my life” (p. 70). In fact, it is this decision\nwhich answers his self-addressed questions about the origin of his\ncareer, his reputation, and his situation at the time of writing his\nautobiography, since he traces his situation back to it. \n\nAt Alpbach he was also approached by communists, including the Marxist\nintellectual Walter Hollitscher, who became his teacher and friend.\nFeyerabend resisted Hollitscher’s political arguments on the\nbasis of his own “youthful elitism” and “an almost\ninstinctive aversion to group thinking” (p. 73). But although\nFeyerabend later described himself as having been “a raving\npositivist” at the time, it was Hollitscher, he says, who\npersuaded him of the cogency of realism about the “external\nworld” (Popper’s important arguments for realism came\nsomewhat later). The considerations Hollitscher deployed were, first,\nthat scientific research was conducted on the assumption of realism,\nand could not be otherwise conducted, and, second, that realism is\nfruitful and productive of scientific progress, whereas positivism was\nsimply a commentary on scientific results, barren in itself.\n\nHollitscher never presented an argument that would lead, step by step,\nfrom positivism to realism and he would have regarded the attempt to\nproduce such an argument as philosophical folly. He rather developed\nthe realist position itself, illustrated it by examples from science\nand commonsense, showed how closely it was connected with scientific\nresearch and everyday action and so revealed its strength.\n(SFS, p. 113).\n\n\nFeyerabend eventually developed these thoughts in a fascinating series\nof papers beginning in 1957, arguing that science needs realism in\norder to progress, and that positivism would stultify such progress.\nThe argument was entirely in line with Popper’s approach, as\nwell as with his conclusions. \n3.2 Early Contact with Wittgenstein (1948–1952)\n\nFeyerabend’s principal intellectual engagement in the late 1940s\nand early 1950s was in his capacity as student leader of the\n“Kraft Circle”. Viktor Kraft was a former member of the\nVienna Circle, and became Feyerabend’s dissertation supervisor.\nThe Kraft Circle was a philosophy club centred around Kraft, which\nconstituted another part of the Austrian College Society. Bela Juhos,\nWalter Hollitscher, Georg Henrik von Wright, Elizabeth Anscombe and\nWittgenstein were all visiting speakers. Feyerabend reports that the\nCircle held meetings from 1949 to 1952 or 1953 (SFS, p. 109),\nthat they set themselves the task of “considering philosophical\nproblems in a nonmetaphysical manner and with special reference to the\nfindings of the sciences” (“Herbert Feigl: A Biographical\nSketch”, in P. K.Feyerabend & G.Maxwell (eds.), Mind,\nMatter, and Method: Essays in Philosophy and Science in Honor of\nHerbert Feigl, (Minneapolis: University of Minnesota Press,\n1966), pp. 1–2) and that their main topics of discussion were\nthe questions of the reality of theoretical entities and of the\n“external world”. About Wittgenstein’s lecture,\nFeyerabend recalls the following: \n\nNot even a brief and quite interesting visit by Wittgenstein himself\n(in 1952) could advance our discussion. Wittgenstein was very\nimpressive in his way of presenting concrete cases, such as amoebas\nunder a microscope… but when he left we still did not know\nwhether or not there was an external world, or, if there was one, what\nthe arguments were in favour of it. (Feyerabend & Maxwell ibid.,\np. 4. Note that Feyerabend must have got the date wrong, since\nWittgenstein died in April 1951).\n\n\nWittgenstein, who took a long time to make up his mind and then\nappeared over an hour late gave a spirited performance and seemed to\nprefer our disrespectful attitude to the fawning admiration he\nencountered elsewhere. (SFS, p. 109).\n\n\nIn 1949, Feyerabend was introduced to Bertolt Brecht, and Hollitscher\noffered him the opportunity to become one of Brecht’s production\nassistants, but he turned it down, later describing this as one of the\nbiggest mistakes of his life (SFS, p. 114). In the\nautobiography, however, he retracts this statement, saying that he\nwould not have enjoyed being part of the closely knit group that\nsurrounded Brecht. (The reasons for his later defection from the\nPopperian camp seem to have been similar). \n\nThe University of Vienna’s physicists were Hans Thirring, Karl\nPrzibram, and Felix Ehrenhaft. Feyerabend admired Thirring and\nEhrenhaft, and was influenced by Ehrenhaft, who had lectured on\nphysics there from 1947. Ehrenhaft was known as a fierce and\nindependent critic of all kinds of orthodoxy in physics, but was\nsometimes thought of as a charlatan. Feyerabend reports that he and\nhis fellow science students looked forward to exposing him as a fraud,\nbut in fact were treated, at the 1949 Alpbach seminar, to a battle\nbetween Ehrenhaft and the orthodox in which the former presented his\nexperiments but the latter defended their position by using strategies\nwhich Galileo’s opponents would have been proud of, ridiculing\nEhrenhaft’s phenomena as mere Dreckeffects. Feyerabend\ncommented that “Only much later did Ehrenhaft’s lesson\nsink in and our attitude at the time as well as the attitude of the\nentire profession provided me then with an excellent illustration of\nthe nature of scientific rationality” (SFS, p. 111).\nEhrenhaft did not convince the theoreticians, who protected themselves\nwith an iron curtain of dogmatic belief of exactly the same kind as\nthat deployed by Galileo’s opponents. His audience remained\nstaunch empiricists, never doubting that science had to be adapted to\nfacts. Feyerabend commented that the day-to-day business of science,\nwhat Thomas Kuhn called “normal science”, cannot exist\nwithout this kind of “split consciousness”.\n\nAt the University of Vienna, although he had originally planned to\nsubmit a thesis on physics, Feyerabend swapped to philosophy when he\ngot nowhere with the electrodynamics problem he was calculating (the\nphilosopher of science as failed scientist?). He completed his\ndoctoral thesis, “Zur Theorie der\nBasissätze” in 1951 under Kraft’s supervision.\nThe subject of the thesis was “basic sentences”, or\n“protocol sentences”, i.e. the kind of sentences that, the\nLogical Positivists had theorised, comprise the foundations of\nscientific knowledge. He later reported that in his philosophical work\nhe had “started from and returned to the discussion of protocol\nstatements in the Vienna Circle” (“Concluding\nUnphilosophical Conversation”, in Munévar (1991), p.\n526). This is unsurprising, given that Kraft was then the Vienna\nCircle’s only survivor in Vienna. However, Kraft’s\ninfluence on Feyerabend has only recently been emphasised. Much of the\nmaterial from Feyerabend’s thesis was presented at (or gleaned\nfrom) meetings of the Kraft Circle, and also appears in his early\narticles, such as “An Attempt at a Realistic Interpretation of\nExperience” (1958). The thesis itself was “a condensed\nversion of the discussions in the Kraft Circle” (p. 115).\n\nIn the early 1950’s, Feyerabend published several German papers\non Wittgenstein, written as a result of having read the proofs of the\nPhilosophical Investigations, lent to him by Elizabeth\nAnscombe. Feyerabend first met Anscombe when lecturing on Descartes to\nthe Austrian College Society. Anscombe had come to Vienna to perfect\nher German in order to translate Wittgenstein’s works.\n\nShe gave me manuscripts of Wittgenstein’s later writings and\ndiscussed them with me. The discussions extended over months and\noccasionally proceeded from morning over lunch until late into the\nevening. They had a profound influence upon me though it is not at all\neasy to specify particulars. (SFS, p. 114).\n\n\nFeyerabend planned to study with Wittgenstein in Cambridge, and\nWittgenstein was prepared to take him on as a student, but he died\nbefore Feyerabend arrived in England. Karl Popper became his\nsupervisor instead. \n3.3 Life at the London School of Economics (1952–1953)\n\nIn Feyerabend’s autobiography, we are told a little about\nPopper’s lectures and his famous LSE seminar. The lectures began\nwith the claim that there is no method in science, but that there\nare some simple and helpful rules of thumb. Popper tried to\nshow “how simple ideas that were derived from equally simple\nrequirements brought order into the complex world of research”\n(pp. 88–9). Having being convinced by Popper’s and Pierre\nDuhem’s critiques of inductivism (the view that science proceeds\nthrough generalisation from facts recorded in experience), Feyerabend\nconsidered falsificationism a real option, and, he says, “fell\nfor it” (p. 89), applying falsificationism in his papers and\nlectures. This is not his first admission that he was a\nfalsificationist, but it is notable that he did not see it as\nentailing his having been a Popperian. Feyerabend was (usually) a\nfairly liberal falsificationist, always emphasising the\ntenacity with which scientists should defend their theories, and\nallowing that scientific theories can start by being untestable.\nFaithful Popperians like John Watkins and Joseph Agassi, he\nemphasises, continually ticked him off for being unorthodox (he was\nlater accused, by Agassi, of plagiarising from Popper). Instead he\nlater saw this interlude as an example of the dangers of abstract\nreasoning. Rationalism is already dangerous, since it “paralyses\nour judgment” (p. 89) and is invested with “an almost\nsuperhuman authority” (p. 90). But Popper added a further\ndangerous element: simplicity. Such a philosophy, complains\nFeyerabend, “may be out of touch with reality… [that is],\nwith scientific practice” (p. 90).\n\nFeyerabend is here referring to Popper’s approach to the\nepistemology of science, which he himself followed and furthered for\nquite a while. In chapter II of The Logic of Scientific\nDiscovery (1934), Popper had distinguished between scientific\npractice and scientific standards, principles, or methodology. Arguing\nagainst a “naturalistic” theory of method which makes\nstandards depend on practice, Popper opted instead for a strongly\nnormative epistemology, a discipline which lays down optimum rules of\nmethod for scientists to follow. This is one of the most important\naspects of the Popperian perspective which Feyerabend originally took\non board.\n\nSuch an epistemology, Feyerabend now complains, makes the false\nassumption that “rational” standards can lead to a\npractice that is as mobile, rich and effective as the science we\nalready have. Falsificationism would destroy science as we know it.\nScience did not develop in accordance with Popper’s model. It is\nnot “irrational”, but it contains no overarching pattern.\nPopper’s rules could produce a science, but not the science we\nnow have. (Feyerabend remarks that the Logical Positivist Otto Neurath\nhad already put this criticism of Popper some time before (p.\n91)).\n\nIn 1952, Feyerabend presented his ideas on scientific change to\nPopper’s LSE seminar and to a gathering of illustrious\nWittgensteinians (Elizabeth Anscombe, Peter Geach, H.L.A.Hart and\nGeorg Henrik von Wright) in Anscombe’s Oxford flat. This meeting\nseems to have been the first airing of the important concept of\nincommensurability (although not the term itself, which crept\ninto publications only a decade later):\n\nOn one occasion which I remember vividly Anscombe, by a series of\nskilful questions, made me see how our conception (and even our\nperceptions) of well-defined and apparently self-contained facts may\ndepend on circumstances not apparent in them. There are entities such\nas physical objects which obey a “conservation principle”\nin the sense that they retain their identity through a variety of\nmanifestations and even when they are not present at all while other\nentities such as pains and after-images are “annihilated”\nwith their disappearance. The conservation principles may change from\none developmental stage of the human organism to another and they may\nbe different for different languages (cf. Whorf’s “covert\nclassifications”… ). I conjectured that such principles\nwould play an important role in science, that they might change during\nrevolutions and that deductive relations between pre-revolutionary and\npost-revolutionary theories might be broken off as a result.\n(SFS, p. 115).\n\n\nMajor discoveries, I said, are not like the discovery of America,\nwhere the general nature of the discovered object is already known.\nRather, they are like recognizing that one has been dreaming.\n(KT, p. 92).\n\n\nThese thoughts received an unenthusiastic reception from Hart, von\nWright and Popper. \n\nFeyerabend’s articles on Wittgenstein culminated in his review\nof the Philosophical Investigations, the text of which he\nstudied in detail while he was in London. (“Being of a pedantic\nturn of mind”, he says, “I rewrote the book so that it\nlooked more like a treatise with a continuous argument”.\n(SFS, p. 116)). Anscombe translated Feyerabend’s\nsummary into English and sent it to The Philosophical Review.\nIt was accepted by the editor, Norman Malcolm (having been turned down\nby Gilbert Ryle, editor of Mind—see KT, p.\n93). This review was Feyerabend’s first English-language\npublication; he called it his “Wittgensteinian monster”\n(p. 115). He later commented:\n\nI knew that Wittgenstein did not want to present a theory (of\nknowledge, or language), and I did not expressly formulate a theory\nmyself. But my arrangements made the text speak like a theory and\nfalsified Wittgenstein’s intentions. (KT, p. 93).\n\n\nWittgenstein’s emphasis on the need for concrete research and\nhis objections to abstract reasoning (“Look, don’t\nthink!”) somewhat clashed with my own inclinations and the\npapers in which his influence is noticeable are therefore mixtures of\nconcrete examples and sweeping principles. (SFS, p. 115).\n\n\nIn his review of the Philosophical Investigations, he\nsummarised the book in a very effective way, drawing particular\nattention to Wittgenstein’s critique of a family of\n“realist” or “essentialist” theories of\nmeaning according to which the meaning of a word is the object\ndesignated or referred to by that word. Feyerabend argued that\nWittgenstein was attempting a reductio ad absurdum of realist\ntheories, showing that they had the untenable implication that we\ncould not be said to know the meaning of words which we nevertheless\nconstantly use in totally unproblematic ways.\n\nUnfortunately, as argued in Preston 1997 (ch.2), Feyerabend completely\nfailed to follow up this insight by endorsing Wittgenstein’s\nnon-representationalist conception of meaning, according to which the\nmeaning of a term is determined by its use. Instead, wrongly\nassociating the idea that meaning is use with positivism, Feyerabend\nproferred what he called a “contextual” theory of meaning,\nwhich identified the meaning of a term or statement with whatever role\nit plays in theoretical contexts. But he over-extended the\nidea of the theoretical to cover any context whatever, thus\ncompletely depriving it of content. For Feyerabend, the theoretical\ncontrasts with nothing at all.\n\nThe book review was also critical of Wittgenstein, though. Notably, it\nrailed against Wittgenstein’s conception of philosophy (as\n“philosophical analysis”). In a short article published\nthe next year (1956), Feyerabend expanded on his critique, arguing\nthat consideration of G.E.Moore’s famous “paradox of\nanalysis” showed that “philosophy cannot be analytic\nand scientific, i.e., interesting, progressive, about a certain\nsubject matter, informative at the same time” (“A\nNote on the Paradox of Analysis”, p. 95). Feyerabend thenceforth\nplumped for (what he conceived of as) scientific philosophy.\nLike Popper, he had very little time for the kind of\n“analytic” philosophy or “linguistic”\nphilosophy which followed in Wittgenstein’s wake, and with which\nOxford University dominated the philosophical scene in the 1950s and\nearly 1960s.\n\nOne of the things that comes across most clearly from his\nautobiography is the consistently malleable nature of\nFeyerabend’s views. He records that his friend Agassi caused him\ncompletely to change his mind about a book he considered translating.\nWhen Agassi urged Feyerabend to become a faithful Popperian,\nFeyerabend’s resistance seems to have been based mainly on his\naversion to groups.\n3.4 Return to Vienna (1953–1955)\n\nBy the summer of 1953, when Popper had to apply for extra funds to\nallow Feyerabend to work as his assistant, Feyerabend had decided to\nleave the Popperian church and return to Vienna. Although the\nassistantship was soon approved, Feyerabend “felt quite\nuncomfortable. I couldn’t put my finger on it; I only knew that\nI wanted to remain in Vienna” (p. 99). \n\nDuring this period Feyerabend, having nothing to do and needing the\nmoney, translated Popper’s “war effort”, The\nOpen Society and its Enemies into German, wrote articles on\n“Methodology” and “Philosophy of Nature” for a\nFrench encyclopaedia, produced a report on post-war developments in\nthe Humanities in Austria for the U.S. Library of Congress, and made a\nmess of his first professional opportunity as a singer (p. 98). But he\nalso felt that he did not know what to do in the long run, so he\napplied for jobs in various universities.\n\nHe then met Arthur Pap, “who had come to Vienna to lecture on\nanalytic philosophy and who hoped, perhaps somewhat unrealistically,\nthat he would be able to revive what was left from the great years of\nthe Vienna Circle and the analytic tradition there”\n(“Herbert Feigl: A Biographical Sketch”, p. 3). Feyerabend\nbecame Pap’s assistant. Pap arranged for him to meet Herbert\nFeigl in Vienna in 1954, and together they studied Feigl’s\npapers. Feigl had been a member of the Vienna Circle until his\nemigration to the USA in 1930, but he had never given up the\n“realist” view that there is a knowable external world. He\nconvinced Feyerabend that the positivism of Kraft and Pap had not\nsolved the traditional problems of philosophy. His paper\n“Existential Hypotheses” (1950), together with\nKraft’s contributions and certain ideas Popper had put forward\nat Alpbach in 1948 and 1949, greatly diminished Feyerabend’s\ndoubts about realism (ibid., p. 4). Here is how Feyerabend recounts\nFeigl’s influence:\n\nIt was … quite a shock to hear Feigl expound fundamental\ndifficulties and to hear him explain in perfectly simple language\nwithout any recourse to formalism why the problem of application [of\nthe probability-calculus] was still without a solution. Formalization,\nthen, was not the last word in philosophical matters. There was still\nroom for fundamental discussion-for speculation (dreaded word!); there\nwas still a possibility of overthrowing highly formalized systems with\nthe help of a little common sense! (ibid., p. 5).\n\n\n1954 saw the publication of the first of Feyerabend’s many\narticles on the philosophy of quantum mechanics, the first fruits of\nthe time he spent studying with Popper. In these publications, he\ngenerally took the line that the dominance achieved by the\n“Copenhagen Interpretation” of the quantum theory was\nundeserved. Feyerabend was particularly keen to argue that it had not\nand could not be shown that this interpretation of the theory was a\ngeneral panacea for the problems of microphysics, or that its\ndefenders could justifiably believe it to be unassailable. He came to\ndefend the right of “hidden-variables” theorists such as\nLouis de Broglie, David Bohm, and Jean-Pierre Vigier to hypothesise\nthe existence of an unobserved deterministic substructure underpinning\nthe apparently indeterministic cavortings of objects on the\nquantum-mechanical level. \n\nHowever, Feyerabend also came to think that Popper’s earlier\ncritique of the Copenhagen orthodoxy had been somewhat limited and\nsuperficial. According to Popper, the Copenhagen Interpretation was\nsimply the result of some bad positivistic philosophising. Niels Bohr\nand Werner Heisenberg, on this view, had been seduced by positivist\nphilosophers (like Ernst Mach and his ostensible followers, the Vienna\nCircle) into thinking that their theory was not conjectural but was\nmerely a compendious, economical but non-hypothetical\ndescription of experience. Feyerabend argued that, on the\ncontrary, the Copenhagen theorists had some perfectly good\n“physical”, “scientific”, or\n“factual” arguments for thinking that their view alone was\ncurrently compatible with the observed results of experiments. He\ntherefore put forward a defence of their instrumentalist\ninterpretation of the quantum theory. But the defence was only\ntactical, since he ultimately argued that the observed results of\nexperiments themselves needed to be challenged by a point of\nview which would reveal their truth or falsity. So Feyerabend used the\nquantum case to push for a reconsideration of the methodological rules\nto which scientists subscribe. This is the genesis of his idea of a\n“pluralistic” test model, in which theories are compared\nwith one another, as well as against “experience”. (Note,\nhowever, that this idea can already be found in Popper, and that\nFeyerabend did initially acknowledge this fact). According to\nFeyerabend, only by endorsing scientific realism can the scientist\ncleave to a methodology which would consistently bring out the\n(conceptually) revolutionary potential of scientific\ntheories, rekindling the kind of fire Galileo had lit under the\nAristotelian world-view. Such a realism interprets theories\nnot as summaries of experience, but as genuine conjectures\nabout a mind-independent reality. It also puts the\nobservation-language of science in the same epistemological boat as\nits theoretical terms: observations, he urged, are just as\n“theoretical” (that is, hypothetical) as theories:\n“Logically speaking, all terms are\n”theoretical“” (Philosophical Papers, Volume\n1, p. 32 note).\n4. Feyerabend’s Early Work: Liberalizing Empiricism\n4.1 First Academic Appointment: the University of Bristol (1955–1958)\n\nIn 1955, with the help of references from Popper and Erwin\nSchrödinger, as well as his own big mouth (SFS, p. 116,\nKT, p. 102), Feyerabend secured his first academic post\nlecturing in philosophy of science at the University of Bristol,\nEngland. In his autobiography (pp. 103–4) he describes how\nAgassi had to help him prepare for these lectures, since they covered\na subject Feyerabend had never studied (see also SFS, p.\n116). He also describes how for some time he felt directionless and\nunsettled: he was “killing time”. \n\nIn the summer of that year, he again visited Alpbach, where he met the\nphilosopher of science Philipp Frank (another former Logical\nPositivist), who exerted on him a (somewhat delayed) influence:\n\nFrank argued that the Aristotelian objections against Copernicus\nagreed with empiricism, while Galileo’s law of inertia did not.\nAs in other cases, this remark lay dormant in my mind for years; then\nit started festering. The Galileo chapters of Against Method\nare a late result. (KT, p. 103. See also SFS, p.\n112).\n\n\nAround the same time, Feyerabend met David Bohm, who was lecturing in\nphysics at the University of Bristol. Bohm had been the favoured\nprotegé of Niels Bohr, and his first book, Quantum\nTheory (Englewood Cliffs, NJ: Prentice-Hall, 1951), was a lengthy\ndefence of the Copenhagen Interpretation of the quantum theory. But in\nthe early 1950s Bohm rejected his former view, and became one of the\nleading defenders of the then-unpopular “hidden-variables”\ntheory. He was to be a significant influence on Feyerabend, weaning\nhim away from Popper with his somewhat Hegelian account of the\nstructure of reality. Feyerabend produced a critical study of\nBohm’s 1957 book Causality and Chance in Modern Physics\nin 1960, when he was still very much under Popper’s influence.\nIn their later work, though, Bohm and Feyerabend moved in parallel\ndirections, towards an interest in “fringe” science. And\nBohm’s ideas sunk in gradually, having visible effects on\nFeyerabend’s published productions from the mid–1960s\nonwards (see Van Strien 2020). Feyerabend increasingly flirted with\nthe vaguely Hegelian metaphysic that he had discerned and critiqued in\nBohm’s book.\n\nIn 1956, Feyerabend got married for the second time, this time to one\nof his former students, Mary O’Neill. But this relationship\nseems to have been very short-lived, for he reports that his wife\nspent Christmas 1957 away from him with her parents, that she\nsubsequently had an affair, and that the last time he saw her was\n1958.\n\nFeyerabend remembers his Bristol lecture course on quantum mechanics\nas being a disaster. However, in the summer of 1956, along with Alfred\nLandé, he chaired a successful seminar on philosophical issues\nin quantum mechanics at Alpbach. A related success was his\ncontribution to the 1957 Colston Research Symposium, where he gave a\npaper “On the Quantum Theory of Measurement”. Here\nFeyerabend introduced what was to become a long-running theme in his\nwork: that there is no separate and neutral\n“observation-language” or “everyday language”\nagainst which the theoretical statements of science are tested, but\nthat “the everyday level is part of the theoretical\nrather then something self-contained and independent”\n(Philosophical Papers, Volume I, p. 217, emphasis added).\nThis was his principal contribution to his central subject, the\nrelation between theory and experience. It constituted not only a\ndecisive break with the positivist conception of theories, but also\nsomething of a step beyond Popper’s conception.\n4.2 The University of California at Berkeley: Early Years (1958–1964)\n\nIn the summer of 1957, Feyerabend accepted an invitation from Michael\nScriven to visit the Minnesota Center for the Philosophy of Science in\nMinneapolis. The Center was, as Feyerabend later said, “one of\nthe foremost institutions in the field” (p. 115). There he met\nFeigl, Carl Hempel, Ernest Nagel, Hilary Putnam, Adolf Grünbaum,\nGrover Maxwell, E.L.Hill, Paul Meehl, and others. He returned to the\nCenter in 1958, having accepted another invitation to work there,\nbacked by an NSF grant. He often went back there in subsequent years.\n\n\nAround this time, many of Feyerabend’s most important early\npapers were published. In them, under the influence of both Popper and\nWittgenstein, Feyerabend initiated a vigourous critique of the\nthen-orthodox philosophies of science provided by descendants of the\nVienna Circle, “Logical Empiricist” thinkers such as\nRudolph Carnap, Feigl, Nagel, and Hempel. This critique was conducted\nthrough a study of the relationship between observation and\ntheory.\n\nIn perhaps the most important of these early publications, “An\nAttempt at a Realistic Interpretation of Experience” (1958),\nFeyerabend argued against positivism and in favour of a scientific\nrealist account of the relation between theory and experience, largely\non grounds familiar from Karl Popper’s falsificationist views.\nPositivist theories of meaning, he complained, have consequences which\nare “at variance with scientific method and reasonable\nphilosophy” (Philosophical Papers, Volume 1, p. 17). In\nparticular, they imply what Feyerabend dubbed the “stability\nthesis”, that even major changes in theory will not affect the\nmeanings of terms in the scientific observation-language. Against this\nsupposition, Feyerabend defended what he called “Thesis\nI”, the idea that\n\nthe interpretation of an observation-language is determined by the\ntheories which we use to explain what we observe, and it changes as\nsoon as those theories change. (ibid., p. 31).\n\n\nThesis I reversed the direction of interpretation which the\npositivists had presupposed. Instead of meaning seeping upwards from\nthe level of experience (or the observation-language), Feyerabend had\nit trickling down from theory to experience. For\nhim, theory is meaningful independently of experience, rather than\nvice-versa. The roots of this view clearly lie in his contextual\ntheory of meaning, according to which meaning is conferred on terms by\nvirtue of their participation in theoretical contexts. It\nseems to imply that there is no principled semantic distinction\nbetween theoretical terms and observation terms. And Feyerabend soon\nfollowed up this implication with his “Pragmatic Theory of\nObservation”, according to which what is important about\nobservation-sentences is not their having a special core of empirical\nmeaning, but their causal role in the production and refutation of\ntheories. \n\nIn 1958, Feyerabend had been invited to spend one year at the\nUniversity of California at Berkeley, and accepted. When this visiting\nappointment ended, the University administration decided to hire him\non the basis of his publications and, of course, his big mouth (p.\n115). But because of his grant to work at Minneapolis, he only started\nlecturing full-time at Berkeley in 1960. There he encountered Thomas\nKuhn, and read Kuhn’s forthcoming book The Structure of\nScientific Revolutions in draft form. He then wrote to Kuhn about\nthe book (these letters have recently been published in Studies in\nthe History and Philosophy of Science, 26, 1995). But he was not\nquite ready to take on Kuhn’s descriptive-historical approach to\nthe philosophy of science. Although more and more historical examples\npeppered his published work, he was still using them to support fairly\northodox falsificationist conclusions.\n\nIn his meta-methodology, Feyerabend applied to the dispute over the\ninterpretation of scientific theories a strong measure of Popperian\nmethodological conventionalism, arguing that the dispute between\nrealists and instrumentalists is not a factual issue but a matter of\nchoice. We can choose to see theories either as descriptions of\nreality (scientific realism) or as instruments of prediction\n(instrumentalism), depending on what ideals of scientific knowledge we\naspire to. Adherence to these competing ideals (roughly: high\ninformative content on the one hand, and sense-certainty on the other)\nis to be judged by their respective consequences. Stressing that\nphilosophical theories have not merely reflected science but have\nchanged it, Feyerabend argued further that the form\nof our knowledge can be altered to fit our ideals. So we can\nhave certainty, and theories that merely summarise\nexperience, if we wish. But, mobilising the usual equation between\nempirical content and testability (common to Carnap, Popper and\nFeyerabend), he urged that we should decisively reject the ideal of\ncertainty and opt instead for theories which go beyond experience and\nsay something informative about reality itself. In this respect, he\nclearly followed Popper’s lead, reconstruing empiricism as a\ndoctrine about the most desirable form for our theories, rather than\nas a view about the sources of knowledge.\n\nFeyerabend argued that the idea, common to positivists, that the\ninterpretation of observation terms doesn’t depend upon the\nstatus of our theoretical knowledge, has consequences undesirable to\npositivists. One of these is that “every positivistic\nobservation language is based upon a metaphysical ontology”\n(Philosophical Papers, Volume 1, p. 21). Another follows from\nthe thesis, which he relishes, that the theories we hold influence our\nlanguage, and maybe even our perceptions. This implies that as long as\nwe use only one empirically adequate theory, we will be unable to\nimagine alternative accounts of reality. If we also accept the\npositivist view that our theories are summaries of experience, those\ntheories will be void of empirical content and untestable, and hence\nthere will be a diminution in the critical, argumentative function of\nour language. Just as purely transcendent metaphysical theories are\nunfalsifiable, so too what began as an all-embracing scientific theory\noffering certainty will, under these circumstances, have become an\nirrefutable dogma, a myth. It is argued in Preston 1997\n(chapter 5) that his antipathy toward this “myth\npredicament” was one the main driving-forces behind\nFeyerabend’s views at the time.\n\nFeyerabend defended a realism according to which “the\ninterpretation of a scientific theory depends upon nothing but the\nstate of affairs it describes” (Philosophical Papers, Volume\n1, p. 42). At the same time he claimed to find in\nWittgenstein’s Philosophical Investigations a\ncontextual theory of meaning according to which the meaning of terms\nis determined not by their use, nor by their connection with\nexperience, but by the role they play in the wider context of a theory\nor explanation. Thesis I, the key proposition of Feyerabend’s\nearly work, is supposed to encapsulate both the contextual\ntheory of meaning and scientific realism. Only realism, by insisting\non interpreting theories in their most vulnerable form as\nuniversally-quantified statements which strive for truth, leads to\nscientific progress instead of stagnation, he argued. Only realism\nallows us to live up to the highest intellectual ideals of critical\nattitude, honesty, and testability.\n\nUnlike positivism, which conflicts with science by taking experiences\nas unanalysable building-blocks, realism treats experiences as\nanalysable, explaining them as the result of processes not immediately\naccessible to observation. Experiences and observation-statements are\nthus revealed as more complex and structured than positivism had\nrealised. Feyerabend over-extended the contextual theory of meaning to\napply not only to theoretical terms but to observation terms too,\narguing that there is no special “problem” of theoretical\nentities, and that the distinction between observation terms and\ntheoretical terms is a purely pragmatic one. If, as the contextual\ntheory also implies, observation-statements depend on theoretical\nprinciples, any inadequacy in these principles will be transmitted to\nthe observation-statements they subtend, whence our beliefs about what\nis observed may be in error, and even our experiences themselves can\nbe criticised for giving only an approximate account of what is going\non in reality. All our statements, beliefs and experiences\nare “hypothetical”. Observations and experiments always\nneed interpretation, and different interpretations are supplied by\ndifferent theories. If existing meanings embody theoretical\nprinciples, then instead of passively accepting\nobservation-statements, we should attempt to find and test the\ntheoretical principles implicit in them, which may require us to\nchange those meanings.\n\nFeyerabend therefore idolised semantic instability, arguing that the\nsemantic stability presupposed by positivist accounts of reduction,\nexplanation and confirmation, has been and should be violated if we\nwant progress in science. If meaning is determined by theory, terms in\nvery different theories simply cannot share the same meaning: they\nwill be “incommensurable”. Any attempt to derive the\nprinciples of an old theory from those of a new one must either be\nunsuccessful or must effect a change in the meaning of the old\ntheory’s terms. The “theoretical reduction” beloved\nof Logical Empiricists is therefore actually more like\nreplacement of one theory and its ontology by another. At the\nend of his well-known 1962 paper “Explanation, Reduction, and\nEmpiricism”, in which he introduced the concept of\nincommensurability, Feyerabend concluded that this concept precluded\nany formal account of explanation, reduction or confirmation.\n(Kuhn’s book The Structure of Scientific Revolutions,\nin which the same term was used to characterize a related concept, was\npublished in the same year).\n\nIn his first major published excursion from the philosophy of science,\nFeyerabend applied these ideas to the mind/body problem. In two papers\npublished in 1963, he sought to defend materialism (roughly, the view\nthat everything which exists is physical) against the supposition that\nthe mind cannot be a physical thing. Although these papers exhibit a\nrather unclear mixture of views, they are now remembered primarily for\nhaving ushered in the position known as “eliminative\nmaterialism”, according to which our way of conceiving the\nmind and mental phenomena amounts to a seriously inadequate theory\nwhich is in conflict with a (materialistic) scientific account of\nthose same things. Feyerabend suggested that the two theories in\nquestion were incommensurable, but that nevertheless we ought to\nprefer the materialistic one on general methodological grounds. This\nradical view of the mind/body problem has been one of\nFeyerabend’s most important legacies. Even though Feyerabend\nhimself seems to have given it up in the late 1970s, it was taken up\nby Richard Rorty and, more recently, by Paul and Patricia\nChurchland.\n\nIn Feyerabend’s version of the incommensurability thesis, the\nsemantic principles of construction underpinning a theory (in its\nrealist interpretation) can be violated or\n“suspended” by another theory. As a result, theories\ncannot always be compared with respect to their content, as\n“rationalists” would like. It took Feyerabend a while to\nsee it, for he did not officially subscribe to this view\nuntil the late 1960s, but this opens the door to relativism, the view\nthat there is no objective way of choosing between theories or\ntraditions. This is perhaps the most notorious and widely-reviled\nconsequence of the contextual theory of meaning.\n\nIn the ground-breaking central papers from this period of\nFeyerabend’s oeuvre such as “How to be a Good\nEmpiricist” (1963), “Realism and Instrumentalism”\n(1964), “Problems of Empiricism” and “Reply to\nCriticism” (1965), his most important argument for scientific\nrealism was methodological: realism is desirable because it demands\nthe proliferation of new and incompatible theories. This leads to\nscientific progress because it results in each theory having more\nempirical content that it otherwise would, since a theory’s\ntestability is proportional to the number of potential falsifiers it\nhas, and the production of alternative theories is the only reliable\nway to ensure the existence of potential falsifiers. So scientific\nprogress comes through “theoretical pluralism”,\nallowing a plurality of incompatible theories, each of which will\ncontribute by competition to maintaining and enhancing the\ntestability, and thus the empirical content, of the others. According\nto Feyerabend’s pluralistic test model, theories are\ntested against one another. He thus idealised what Kuhn called\n“pre-paradigm” periods and “scientific\nrevolutions”, occasions when there are many incompatible\ntheories, all forced to develop through their competition with each\nother. But he downplayed the idea that theories are still compared\nwith one another primarily for their ability to account for the\nresults of observation and experiment. For Feyerabend, this idea was\nan empiricist myth which disguised the role of aesthetic and social\nfactors in theory-choice.\n\nThus far, the argument for theoretical pluralism largely follows that\nof John Stuart Mill’s On Liberty (1859), to which\nFeyerabend often paid homage. But Feyerabend went on to try to\ndemonstrate a mechanism whereby theories can augment their empirical\ncontent. According to this part of the argument, theories may face\ndifficulties which can only be discovered with the help of alternative\ntheories. A theory can be incorrect without our being able to discover\nthis in a direct way: sometimes the construction of new experimental\nmethods and instruments which would reveal the incorrectness is\nexcluded by laws of nature, sometimes the discrepancy (were it to be\ndiscovered) might be regarded as an oddity, and might never be given\nits correct interpretation. Circumstances can thus conspire to hide\nfrom us the infirmities of our theory. The methodological\n“principle of testability” demands that we develop\nalternative theories incompatible with the existing theory, and\ndevelop them in their strongest form, as descriptions of reality, not\nmere instruments of prediction. Instead of waiting until the current\ntheory gets into difficulties, and only then starting to look for\nalternatives, we ought vigorously to proliferate theories and\ntenaciously defend them in the hope that they may afford us an\nindirect refutation of our existing theory. Only theories\nwhich are empirically adequate will thus contribute to raising the\nempirical content of their fellows. But Feyerabend insists that\nany theory, no matter how weak, may become\nempirically adequate, and so may contribute to this process. To be a\nrealist, he therefore suggests, involves demanding support for any\ntheory, including implausible conjectures having no independent\nempirical support, conjectures which are inconsistent with data and\nwell-confirmed laws. We should retain theories that are in trouble,\nand invent and develop theories that contradict the observed\nphenomena, just because in doing so we will be respecting the\nintellectual ideal of testability.\n\nIn thus appealing to the “principle of testability” as the\nsupreme methodological maxim, Feyerabend forgets that testability must\nbe traded-off against other theoretical virtues. Only his pathological\nfear of theories losing their empirical content and becoming myths\nleads him to want to maximise testability and embrace an absolutely\nunrestricted principle of proliferation. He also disregards historical\nevidence that anti-realist approaches can be just as pluralistic as\nrealism.\n\nAt Alpbach in 1964, Feyerabend and Feigl jointly directed a seminar on\nthe recent development of analytic philosophy. There Feyerabend\nre-encountered the leading light of the Logical Positivist movement,\nRudolph Carnap (whom he had already met at UCLA). Carnap tried to\nconvince Feyerabend of the virtues of clarity, but failed. Feyerabend\nwas still attached to “scientific” philosophy, and\nconsidered philosophy worthless unless it made a positive and\nquantifiable contribution to the growth of knowledge (which, of\ncourse, meant science).\n\nBut a seminar in Hamburg in 1965, at which Feyerabend discussed the\nfoundations of quantum theory with the physicist C.F. von\nWeizsäcker, did have a lasting, if somewhat delayed, impact:\n\nVon Weizsäcker showed how quantum mechanics arose from concrete\nresearch while I complained, on general methodological grounds, that\nimportant alternatives had been omitted. The arguments supporting my\ncomplaint were quite good… but it was suddenly clear to me that\nimposed without regard to circumstances they were a hindrance rather\nthan a help: a person trying to solve a problem whether in science or\nelsewhere must be given complete freedom and cannot be\nrestricted by any demands, norms, however plausible they may seem to\nthe logician or the philosopher who has thought them out in the\nprivacy of his study. Norms and demands must be checked by research,\nnot by appeal to theories of rationality. In a lengthy article I\nexplained how Bohr had used this philosophy and how it differs from\nmore abstract procedures. Thus Professor von Weizsäcker has prime\nresponsibility for my change to “anarchism”—though\nhe was not at all pleased when I told him so in 1977. (SFS,\np. 117).\n\n4.3 The Impact of the “Student Revolution”\n\nThe mid-to-late 1960s was a time of ferment in Western culture, and\nFeyerabend was in the thick of it. In Berkeley, naturally, he ran into\nthe Free Speech Movement, and he encountered the “student\nrevolution” there too, as well as in London and Berlin. This\nobviously fired his interest in political philosophy, more especially\nin political questions about science. Of his post at Berkeley, he\nlater said: \n\nMy function was to carry out the educational policies of the State of\nCalifornia which means I had to teach people what a small group of\nwhite intellectuals had decided was knowledge. (SFS, p. 118).\n\n\nHowever, Feyerabend’s experience under these educational\npolicies was undoubtedly one of the defining periods of his\nintellectual life, a time in which he became deeply suspicious of\nthese intellectuals and “Western rationalism” as a whole:\n\n\nIn the years 1964ff. Mexicans, Blacks, Indians entered the university\nas a result of new educational policies. There they sat, partly\ncurious, partly disdainful, partly simply confused hoping to get an\n“education”. What an opportunity for a prophet in search\nof a following! What an opportunity, my rationalist friends told me,\nto contribute to the spreading of reason and the improvement of\nmankind! I felt very differently. For it dawned on me that the\nintricate arguments and the wonderful stories I had so far told to my\nmore or less sophisticated audience might just be dreams, reflections\nof the conceit of a small group who had succeeded in enslaving\neveryone else with their ideas. Who was I to tell these people what\nand how to think? (ibid. See also KT, p. 123).\n\n\nAt this time, Feyerabend gave two lectures, one on general philosophy,\nand one on philosophy of science. He seems to have got into some\ntrouble at Berkeley by running his seminar on unacceptably loose\nlines, regularly cancelling lectures, and failing to prepare for the\nlectures he did give: \n\nI often told the students to go home—the official notes would\ncontain everything they needed. As a result an audience of 300, 500,\neven 1,200 shrank to 50 or 30. I wasn’t happy about that; I\nwould have preferred a larger audience, and yet I repeated my advice\nuntil the administration intervened. Why did I do it? Was it because I\ndisliked the examination system, which blurred the line between\nthought and routine? Was it because I despised the idea that knowledge\nwas a skill that had to be acquired and stabilized by rigorous\ntraining? Or was it because I didn’t think much of my own\nperformance? All these factors may have played a role. (p. 122).\n\n\nBut although he sympathised with the original aims of the student\nmovement, Feyerabend was unimpressed by their leaders, feeling that\ntheir ideas were as authoritarian as those they were trying to\nreplace. He reports having cut fewer lectures during the student\nstrike than either before or afterwards! Nevertheless, by holding his\nlectures off-campus during this campus war, Feyerabend antagonised the\nadministration that had hired him. Tales of him giving “A”\ngrades to every student in his class, regardless of their production\n(or lack of it), abound. He had the impression that some of his\ncolleagues, especially John Searle, wanted to have him fired, and that\nthey only gave up when they realised how much paperwork would be\ninvolved (p. 126). \n4.4 The Late Sixties\n\nDuring the summer of 1966, Feyerabend lectured on church dogma at\nBerkeley. (“Why church dogma? Because the development of church\ndogma shares many features with the development of scientific\nthought” (pp. 137–8)). He eventually turned these thoughts\ninto a paper on “Classical Empiricism”, published in 1970,\nin which he argued that empiricism shared certain problematic features\nwith protestantism. He had already come some way from his 1965 defence\nof a “disinfected”, “tolerant” form of\nEmpiricism. The publication, in 1969, of the four-page article,\n“Science Without Experience”, which argued that in\nprinciple experience is necessary at no point in the\nconstruction, comprehension or testing of empirical scientific\ntheories finally gave notice that Feyerabend was no longer concerned\nto present himself as any kind of empiricist. \n\nDespite taking his academic duties and responsibilities decreasingly\nseriously, and coming into conflict with his own university’s\nadministration as a result, Feyerabend had not yet fouled his\nsubstantial reputation as a serious philosopher of science. He reports\nthat he received job offers from London, Berlin, Yale, and Auckland,\nthat he was invited to become a fellow of All Souls College, Oxford,\nand that he corresponded with Friedrich von Hayek (whom he already\nknew from the Alpbach seminars) about a job in Freiburg (p. 127). He\naccepted the posts in London, Berlin, and Yale. In 1968, he resigned\nfrom UC Berkeley and left for Minneapolis, but grew homesick, got\nre-appointed, and returned to Berkeley almost immediately.\n\nIn London, lecturing to University College and the LSE, he met Imre\nLakatos. The two became great friends, corresponding with one another\nregularly and voluminously until Lakatos’ death. Feyerabend\nrecalls that Lakatos, whose office was across the corridor from the\nLSE lecture hall, used to intervene in his lectures when Feyerabend\nmade a point he disagreed with (SFS, p. 13, KT, p.\n128).\n5. Feyerabend’s Later Work: Towards Relativism, but then Beyond It\n5.1 Against Method (1970–75)\n\nAfter stints in London, Berlin, and Yale (all of them running\nalongside his post at UC Berkeley), Feyerabend took up a visiting\nprofessorship at the University of Auckland, New Zealand, and lectured\nthere in 1972 and 1974 (pp. 134–5). He even considered settling\ndown in New Zealand around that time (p. 153), although this hardly\nseems compatible with his jet-setting lifestyle. \n\nBy the early 1970s Feyerabend had flown the falsificationist coop and\nwas ready to expound his own perspective on scientific method. In\n1970, he published a long article entitled “Against\nMethod” in which he attacked several prominent accounts of\nscientific methodology. In their correspondence, he and Lakatos\nsubsequently planned the construction of a debate volume, to be\nentitled For and Against Method, in which Lakatos would put\nforward the “rationalist” case that there was an\nidentifiable set of rules of scientific method which make all good\nscience science, and Feyerabend would attack it. Lakatos’\nunexpected death in February 1974, which seems to have shocked\nFeyerabend deeply, meant that the rationalist part of the joint work\nwas never completed.\n\nLater that year, Feyerabend found himself lecturing at the University\nof Sussex:\n\nI have no idea why and how I went to the University of Sussex at\nBrighton… what I do remember is that I taught two terms\n(1974/1975) and then resigned; twelve hours a week (one lecture\ncourse, the rest tutorials) was too much. (p. 153).\n\n\nA member of Feyerabend’s audience recalls things in rather more\ndetail:\n\nSussex University: the start of the Autumn Term, 1974. There was not a\nseat to be had in the biggest Arts lecture theatre on campus. Taut\nwith anticipation, we waited expectantly and impatiently for the\nadvertized event to begin. He was not on time—as usual. In fact\nrumour had it that he would not be appearing at all that illness (or\nwas it just ennui? or perhaps a mistress?) had confined him to bed.\nBut just as we began sadly to reconcile ourselves to the idea that\nthere would be no performance that day at all, Paul Feyerabend burst\nthrough the door at the front of the packed hall. Rather pale, and\nsupporting himself on a short metal crutch, he walked with a limp\nacross to the blackboard. Removing his sweater he picked up the chalk\nand wrote down three questions one beneath the other: What’s so\ngreat about knowledge? What’s so great about science?\nWhat’s so great about truth? We were not going to be\ndisappointed after all!\n\n\nDuring the following weeks of that term, and for the rest of his year\nas a visiting lecturer, Feyerabend demolished virtually every\ntraditional academic boundary. He held no idea and no person sacred.\nWith unprecedented energy and enthusiasm he discussed anything from\nAristotle to the Azande. How does science differ from witchcraft? Does\nit provide the only rational way of cognitively organizing our\nexperience? What should we do if the pursuit of truth cripples our\nintellects and stunts our individuality? Suddenly epistemology became\nan exhilarating area of investigation.\n\nFeyerabend created spaces in which people could breathe again. He\ndemanded of philosophers that they be receptive to ideas from the most\ndisparate and apparently far-flung domains, and insisted that only in\nthis way could they understand the processes whereby knowledge grows.\nHis listeners were enthralled, and he held his huge audiences until,\ntoo ill and too exhausted to continue, he simply began repeating\nhimself. But not before he had brought the house down by writing\n“Aristotle” in three-foot high letters on the blackboard\nand then writing “Popper” in tiny, virtually illegible\nletters beneath it! (Krige 1980, pp. 106–7).\n\n\nBecause his health was poor, Feyerabend started seeing a healer who\nhad been recommended to him. The treatment was successful, and\nthenceforth Feyerabend used to refer to his own case as an example of\nboth the failures of orthodox medicine and the largely unexplored\npossibilities of “alternative” or traditional remedies.\n\n\nInstead of the volume written jointly with Lakatos, Feyerabend put\ntogether his tour de force, the book version of Against\nMethod (London: New Left Books, 1975), which he sometimes\nconceived of as a letter to Lakatos (to whom the book is dedicated). A\nmore accurate description, however, is the one given in his\nautobiography:\n\nAM is not a book, it is a collage. It contains descriptions,\nanalyses, arguments that I had published, in almost the same words,\nten, fifteen, even twenty years earlier… I arranged them in a\nsuitable order, added transitions, replaced moderate passages with\nmore outrageous ones, and called the result “anarchism”. I\nloved to shock people… (pp. 139, 142).\n\n\nThe book contained many of the themes mentioned so far in this essay,\nsprinkled into a case study of the transition from geocentric to\nheliocentric astronomy. But whereas he had previously been arguing in\nfavour of methodology (a “pluralistic” methodology, that\nis), he had now become dissatisfied with any methodology. He\nemphasised that older scientific theories, like Aristotle’s\ntheory of motion, had powerful empirical and argumentative support,\nand stressed, correlatively, that the heroes of the scientific\nrevolution, such as Galileo, were not as scrupulous as they were\nsometimes represented to be. He portrayed Galileo as making full use\nof rhetoric, propaganda, and various epistemological tricks in order\nto support the heliocentric position. The Galileo case is crucial for\nFeyerabend, since the “scientific revolution” is his\nparadigm of scientific progress and of radical conceptual change, and\nGalileo is his hero of the scientific revolution. He also sought\nfurther to downgrade the importance of empirical arguments by\nsuggesting that aesthetic criteria, personal whims and social factors\nhave a far more decisive role in the history of science than\nrationalist or empiricist historiography would indicate. \n\nAgainst Method explicitly drew the “epistemological\nanarchist” conclusion that there are no useful and exceptionless\nmethodological rules governing the progress of science or the growth\nof knowledge. The history of science is so complex that if we insist\non a general methodology which will not inhibit progress the only\n“rule” it will contain will be the useless suggestion:\n“anything goes”. In particular, logical empiricist\nmethodologies and Popper’s Critical Rationalism would inhibit\nscientific progress by enforcing restrictive conditions on new\ntheories. The more sophisticated “methodology of scientific\nresearch programmes” developed by Lakatos either contains\nungrounded value-judgements about what constitutes good science, or is\nreasonable only because it is epistemological anarchism in disguise.\nThe phenomenon of incommensurability renders the standards which these\n“rationalists” use for comparing theories inapplicable.\nThe book thus (understandably) had Feyerabend branded an\n“irrationalist”. At a time when Kuhn was downplaying the\n“irrationalist” implications of his own book, Feyerabend\nwas perceived to be casting himself in the role others already saw as\nhis for the taking. (He did not, however, commit himself to\npolitical anarchism. His political philosophy was a mixture\nof liberalism and social democracy).\n\nHe later said:\n\nOne of my motives for writing Against Method was to free\npeople from the tyranny of philosophical obfuscators and abstract\nconcepts such as “truth”, “reality”, or\n“objectivity”, which narrow people’s vision and ways\nof being in the world. Formulating what I thought were my own attitude\nand convictions, I unfortunately ended up by introducing concepts of\nsimilar rigidity, such as “democracy”,\n“tradition”, or “relative truth”. Now that I\nam aware of it, I wonder how it happened. The urge to explain\none’s own ideas, not simply, not in a story, but by means of a\n“systematic account”, is powerful indeed. (pp.\n179–80).\n\n5.2 The Political Consequences of Epistemological Anarchism: Science in a Free Society (1978)\n\nThe critical reaction to Against Method seems to have taken\nFeyerabend by surprise. He was shocked to be accused of being\naggressive and nasty, so he replied by accusing his accusers of the\nvery same thing. He felt it necessary to respond to most of the\nbook’s major reviews in print, and later assembled these replies\ninto a section of his next book, Science in a Free Society,\nentitled “Conversations with Illiterates”. Here he berated\nthe unfortunate reviewers for having misread Against Method,\nas well as for being constitutionally incapable of distinguishing\nbetween irony, playfulness, argument by reductio ad absurdum, and the\n(apparently rather few) things he had really committed himself to in\nAM. The spectacle of Feyerabend levelling these accusations\nat others is not itself without irony. (His widow reports that in his\nlater years, SFS was the book he would most like to have\ndistanced himself from). In the commotion surrounding AM,\nFeyerabend succumbed to depression: \n\n… now I was alone, sick with some unknown affliction; my\nprivate life was in a mess, and I was without a defense. I often\nwished I had never written that fucking book. (KT, p. 147).\n\n\nFeyerabend saw himself as having undermined the arguments for\nscience’s privileged position within culture, and much of his\nlater work was a critique of the position of science within Western\nsocieties. Because there is no scientific method, we can’t\njustify science as the best way of acquiring knowledge. And the\nresults of science don’t prove its excellence, since\nthese results have often depended on the presence of non-scientific\nelements, science prevails only because “the show has been\nrigged in its favour” (SFS, p. 102), and other\ntraditions, despite their achievements, have never been given a\nchance. The truth, he suggests, is that \n\nscience is much closer to myth than a scientific philosophy is\nprepared to admit. It is one of the many forms of thought that have\nbeen developed by man, and not necessarily the best. It is\nconspicuous, noisy, and impudent, but it is inherently superior only\nfor those who have already decided in favour of a certain ideology, or\nwho have accepted it without ever having examined its advantages and\nits limits (AM, p. 295).\n\n\nThe separation of church and state should therefore be supplemented by\nthe separation of science and state, in order for us to achieve the\nhumanity we are capable of. Setting up the ideal of a free society as\n“a society in which all traditions have equal rights and equal\naccess to the centres of power” (SFS, p. 9), Feyerabend\nargues that science is a threat to democracy. To defend society\nagainst science we should place science under democratic control and\nbe intensely sceptical about scientific “experts”,\nconsulting them only if they are controlled democratically by juries\nof laypeople.\n5.3 Ten Wonderful Years: The Eighties in Berkeley and Zurich\n\nOut of all Feyerabend’s many academic positions, perhaps the one\nhe enjoyed most was his tenure throughout the 1980s at the\nEidgenössische Technische Hochschule, Zurich. Feyerabend\napplied for the post after his friend Eric Jantsch had told him that\nthe Polytechnic was looking for a philosopher of science. The\nselection process was, by Feyerabend’s account, very long and\nsomewhat involved (pp. 154ff.). Having recently left another post in\nKassel, he apparently gave up hopes of being hired by the Swiss, and\n“decided to remain in Berkeley and stop moving about” (p.\n158). But, after several stages in the decision-making procedure, he\nwas finally given the job, and “ten wonderful years of\nhalf-Berkeley, half-Switzerland” (p. 158) turned out to be\nexactly what he had been looking for. At Zurich he lectured on\nPlato’s Theaetetus and Timaeus, and then on\nAristotle’s Physics. The two-hour seminars, many of\nwhich were organised by Christian Thomas (with whom Feyerabend was to\nedit anthologies) were run on the same lines as Berkeley: no set\ntopic, but presentations by the participants (p. 160). Feyerabend\nlater considered this to be the period in which he “got his\nintellectual act together” (p. 162), meaning that he recovered\nfrom the critical reactions to Against Method and was finally\nfreed from the necessity of defending it against all criticism.\nHowever, this didn’t seem to have affected his attitude towards\nwork: in Zurich he refused offers of an office, because no office\nmeant no office hours, and therefore no waste of time (pp. 131, 158)!\n\n\nMany of the more important papers Feyerabend published during the\nmid-1980s were collected together in Farewell to Reason\n(London: Verso, 1987). The major message of this book is that\nrelativism is the solution to the problems of conflicting beliefs and\nof conflicting ways of life. Feyerabend starts by suggesting that the\ncontemporary intellectual scene in Western culture is by no means as\nfragmented and cacophonous as many intellectuals would have us\nbelieve. The surface diversity belies a deeper uniformity, a monotony\ngenerated and sustained by the cultural and ideological imperialism\nwhich the West uses to beat its opponents into submission. Such\nuniformity, however, can be shown to be harmful even when judged by\nthe standards of those who impose it. Cultural diversity, which\nalready exists in some societies, is a good thing not least because it\naffords the best defence against totalitarian domination.\n\nFeyerabend proposes to support the idea of cultural diversity both\npositively, by producing considerations in its favour, and negatively\n“by criticising philosophies that oppose it”\n(FTR, p. 5). Contemporary philosophies of the latter type are\nsaid to rest on the notions of Objectivity and\nReason. He seeks to undermine the former notion by pointing\nout that confrontations between cultures with strongly held opinions\nwhich are each believed by members of the cultures in question to be\nobjectively true can turn out in different ways. The result of such\nconfrontation may be the persistence of the old views, fruitful and\nmutual interaction, relativism, or argumentative evaluation.\n“Relativism” here means the decision to treat the other\npeople’s form of life and the beliefs it embodies as\n“true-for-them”, while treating our own views as\n“true-for-us”. Feyerabend feels that this is an\nappropriate way to resolve such confrontation.\n\nAdmittedly, these outcomes are indeed possible. But this does not\nestablish any form of relativism. Indeed, we might as well turn the\nargument around, and say that the possibility of the dispute being\nresolved by one participant freely coming around to the other’s\npoint of view shows the untenability of relativism.\n\nFeyerabend complains that the ideas of reason and rationality are\n“ambiguous and never clearly explained” (FTR, p.\n10); they are deified hangovers from autocratic times which no longer\nhave any content but whose “halo of excellence” (ibid.)\nclings to them and lends them spurious respectability:\n\n[R]ationalism has no identifiable content and reason no recognisable\nagenda over and above the principles of the party that happens to have\nappropriated its name. All it does now is to lend class to the general\ndrive towards monotony. It is time to disengage Reason from this drive\nand, as it has been thoroughly compromised by the association, to bid\nit farewell. (FTR, p. 13).\n\n\nRelativism is the tool with which Feyerabend hopes to “undermine\nthe very basis of Reason” (ibid.). But is it Reason with a\ncapital “R”, the philosophers’ abstraction alone,\nthat is to be renounced, or reason itself too? Feyerabend is on weak\nground when he claims that “Reason” is a\nphilosophers’ notion which has no content, for it is precisely\nthe philosopher who is willing to attach a specific content\nto the formal notion of rationality (unlike the layperson, whose\nnotion of reason is closer to what Feyerabend calls the\n“material” conception, where to be rational is “to\navoid certain views and to accept others” (ibid., p. 10)). \n\nRelativism is a result of cultural confrontation, an “attempt to\nmake sense of the phenomenon of cultural variety” (FTR,\np. 19). Feyerabend is well aware that the term\n“relativism” itself is understood in many different ways.\nBut his attempt to occupy a substantial yet defensible relativist\nposition is a failure. At some points he merely endorses views which\nno-one would deny, but which do not deserve to be called relativist\n(such as the idea that people may profit from studying other points of\nview, no matter how strongly they hold their own view (FTR,\np. 20)). At others he does manage to subscribe to a genuinely\nrelativist view, but fails to show why it must be accepted.\n\nIt was only in 1988, on the 50th anniversary of Austria’s\nunification with Germany, that Feyerabend became interested in his\npast (p. 1). The Feyerabends left California for life in Switzerland\nand Italy in the fall of 1989 (p. 2). It was during this move that\nFeyerabend re-discovered his mother’s suicide note (p. 9), which\nmay have been one of the factors that spurred him to write his\nautobiography. Feyerabend looked forward to his retirement, and he and\nGrazia decided to try to have children. He claimed to have forgotten\nthe thirty-five years of his academic career almost as quickly as he\nhad earlier forgotten his military service (p. 168).\n5.4 Feyerabend in the Nineties\n\nIn the early 1990s, Feyerabend worked up a course of lectures he had\npreviously given in Berkeley into a series of five lectures entitled\n‘What is knowledge? What is science?’. These were\noriginally delivered to a general audience, but later edited and\npublished by Eric Oberheim as a book entitled The Tyranny of\nScience [Feyerabend 2011]. \n\nThe main themes of the book are as follows. Scientists and\nphilosophers sometimes present science as a unified worldview, a\nmonolith (or a monster, depending on one’s preferences). It is\nnot. Science is both incomplete and quite strongly disunified. It does\nnot speak with a single voice, therefore appeals to the abstraction\n‘Science’ are out of place. The ideology known as\nobjectivism, or scientific materialism, which takes science to be our\nultimate measure of what exists, is therefore ungrounded. Its\ndefenders, who portray themselves as the defenders of Reason, are\noften the kind of intellectual imperialists whose attitudes and advice\nin the past led, or would have led, to the destruction of first-nation\ncommunities. \n\nOther equally popular philosophical claims about science are also\nflawed. The idea that science is successful needs interrogation.\nScience does have some successes, but these can be detached from the\nideology that seems to support them. The idea that science starts from\nfacts, and eschews theories until the facts are gathered, is a myth.\nThe same can be said of the idea that science is value-free, and also\nof the idea that scientific results are relevant to urgent social\nproblems. \n\nOne aspect of the disunity of science is that ‘scientists’\nshould not mean merely theoreticians: science also (and essentially)\nfeatures experimentalists. In their work the importance of hands-on\nexperience, and of what Michael Polanyi called ‘tacit\nknowledge’, is most obvious. But in fact these sorts of\nexperience and knowledge play an important role throughout the\nsciences, even in their most obviously theoretical parts. The\nPlatonic-rationalist picture of science as pure thinking about the\nnature of reality is a distortion.\n\nPerhaps the book’s central complaint is that a particular\nabstract, theoretical, ‘objectivist’ kind of science,\ntogether with an associated kind of thinking about science, now\ndominate our thinking, excluding more human modes of thought.\nScientism, the belief that science has the answer to all meaningful\nquestions, is also a target. Feyerabend’s typical strategy is to\ntake some hallowed idea (e.g., that the success of science is due to\nobservation and experiment), and ask: how did it arise? Tracing its\nancestry back to ancient Greek thinkers (usually Plato, Parmenides, or\nXenophanes), he assesses their arguments for it, and finds them\neminently resistible. His complaint is not that their arguments are\ninvalid, though—that would be already to take on a\nquasi-scientific mode of assessment. Instead, Feyerabend makes it\nclear that he prefers ‘stories’ (or even\n‘fairytales’) to arguments, and that rival stories are to\nbe assessed in terms of how interesting, appealing, or revealing they\nare. The sorts of stories the ancient Greek tragedians told, being\nmore obviously human, fare better on such measures than those of the\nancient Greek philosophers, so we should not assume that philosophers\nare our best guides in such matters. \n\nFeyerabend also published a surprisingly large number of papers in the\n1990s (although many of them were short ones with overlapping\ncontent). Several appeared in a new journal, Common\nKnowledge, in whose inauguration he had a hand, and which set out\nto integrate insights from all parts of the intellectual landscape.\n\n\nAlthough these papers were on scattered subjects, there are some\nstrong themes running through them, several of which bear comparison\nwith what gets called “post-modernism” (see Preston 1998).\nHere I shall sketch only the main ones.\n\nOne of the projects which Feyerabend worked on for a long time, but\nnever really brought to completion, went under the name “The\nRise of Western Rationalism”. Under this umbrella he hoped to\nshow that Reason (with a capital “R”) and Science had\ndisplaced the binding principles of previous world-views not\nas the result of having won an argument, but as the result of\npower-play. While the first philosophers (the pre-Socratic thinkers)\nhad interesting views, their attempt to replace, streamline or\nrationalise the folk-wisdom which surrounded them was eminently\nresistible. Their introduction of the appearance/reality dichotomy\nmade nonsense of many of the things people had previously known. Even\nnowadays, indigenous cultures and counter-cultural practices provide\nalternatives to Reason and that nasty Western science.\n\nHowever, Feyerabend sometimes also recognised that this is to present\nscience as too much of a monolith. In most of his work after\nAgainst Method, he emphasises what has come to be known as\nthe “disunity of science”. Science, he insists, is a\ncollage, not a system or a unified project. Not only does it include\nplenty of components derived from distinctly\n“non-scientific” disciplines, but these components are\noften vital parts of the “progress” science has made\n(using whatever criterion of progress you prefer). Science is a\ncollection of theories, practices, research traditions and world-views\nwhose range of application is not well-determined and whose merits\nvary to a great extent. All this can be summed up in his slogan:\n“Science is not one thing, it is many.”\n\nLikewise, the supposed ontological correlate of science, “the\nworld”, consists not only of one kind of thing but of countless\nkinds of things, things which cannot be “reduced” to one\nanother. In fact, there is no good reason to suppose that the world\nhas a single, determinate nature. Rather we inquirers construct the\nworld in the course of our inquiries, and the plurality of our\ninquiries ensures that the world itself has a deeply plural quality:\nthe Homeric gods and the microphysicist’s subatomic particles\nare simply different ways in which “Being” responds to\n(different kinds of) inquiry. How the world is “in-itself”\nis for ever unknowable. In this respect, Feyerabend’s last work\ncan be thought of as aligned with “social\nconstructivism”.\n6. Conclusion: Last Things\n\nFeyerabend’s autobiography occupied him right up until his death\non February 11th, 1994, at the Genolier Clinic, overlooking Lake\nGeneva. At the end of the book, he expressed the wish that what should\nremain of him would be “not papers, not final\ndeclarations, but love” (p. 181).\n\nHis autobiography was published in 1995, a third volume of his\nPhilosophical Papers appeared in 1999, and his last book\nThe Conquest of Abundance, edited by Bert Terpstra, appeared\nin the same year. A volume of his papers on the philosophy of quantum\nmechanics is currently being prepared, under the editorship of Stefano\nGattei and Joseph Agassi. \n\nAlthough the focus of philosophy of science has moved away from\ninterest in scientific methodology in recent years, this is not due in\nany great measure to acceptance of Feyerabend’s\nanti-methodological argument. His critique of science (which gave him\nthe reputation for being an “anti-science philosopher”,\n“the worst enemy of science”, etc.) is patchy. Some of its\nflaws stem directly from his scientific realism. It sets up a straight\nconfrontation between science and other belief-systems as if they are\nall aiming to do the same thing (give us “knowledge of\nthe world”) and must be compared for how well they deliver the\ngoods. A better approach would be, in Gilbert Ryle’s words,\n“to draw uncompromising contrasts” between the businesses\nof science and those of other belief-systems. Such an approach fits\nfar better with the theme Feyerabend approached later in his life:\nthat of the disunity of science.\n\nFeyerabend came to be seen as a leading cultural relativist, not just\nbecause he stressed that some theories are incommensurable, but also\nbecause he defended relativism in politics as well as in epistemology.\nHis denunciations of aggressive Western imperialism, his critique of\nscience itself, his conclusion that “objectively” there\nmay be nothing to choose between the claims of science and those of\nastrology, voodoo, and alternative medicine, as well as his concern\nfor environmental issues ensured that he was a hero of the\nanti-technological counter-culture.\n\nDifferent components and phases of Feyerabend’s work have\ninfluenced very different groups of thinkers. His early scientific\nrealism, contextual theory of meaning, and the way he proposed to\ndefend materialism were taken up by Paul and Patricia Churchland.\nRichard Rorty, for a time, also endorsed eliminative materialism.\nFeyerabend’s critique of reductionism has influenced\nphilosophers of science such as Cliff Hooker, Bas van Fraassen, and\nJohn Dupré, and his general point of view influenced books such\nas Alan Chalmers’ well-known introduction to philosophy of\nscience What Is This Thing Called Science? (1978).\n\nFeyerabend has also had considerable influence within the social\nstudies. He directly inspired books like D.L. Phillips’\nAbandoning Method (1973), in which the attempt was made to\ntranscend methodology. Less directly, he has exerted enormous\ninfluence on a generation of sociologists of science through his\nrelativism, social constructivism, and apparent irrationalism. It is\nstill far too early to say whether, and in what way, his philosophy\nwill be remembered.\n",
    "bibliography": {
        "categories": [
            "Feyerabend’s Major Writings",
            "Audio Recordings",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Feyerabend’s Major Writings": [
                "</h3>\n<ul class=\"hanging\">",
                "“Problems of Empiricism”, <em>Beyond the Edge of\nCertainty: Essays in Contemporary Science and Philosophy</em>, R.G.\nColodny (ed.), New Jersey: Prentice-Hall, 1965, pp.\n145–260.",
                "<em>Against Method</em>, London: Verso, 1975.",
                "<em>Science in a Free Society</em>, London: New Left Books,\n1978.",
                "<em>Der wissenschaftstheoretische Realismus und die Autorität\nder Wissenschaften</em>, Braunschweig: Vieweg, 1978.",
                "<em>Erkenntnis für freie Menschen</em>, Frankfurt am Main:\nSuhrkamp Verlag, 1980.",
                "<em>Realism, Rationalism, and Scientific Method</em>\n(Philosophical Papers, Volume 1), Cambridge: Cambridge University\nPress, 1981.",
                "<em>Problems of Empiricism</em> (Philosophical Papers, Volume 2),\nCambridge: Cambridge University Press, 1981.",
                "<em>Wissenschaft als Kunst</em>, Frankfurt am Main: Suhrkamp\nVerlag, 1984.",
                "<em>Farewell to Reason</em>, London: Verso/New Left Books,\n1987.",
                "<em>Against Method</em>, London: 1975; Revised edition, London:\nVerso, 1988.",
                "<em>Three Dialogues on Knowledge</em>, Oxford: Basil Blackwell,\n1991.",
                "<em>Killing Time: The Autobiography of Paul Feyerabend</em>,\nChicago: University of Chicago Press, 1995.",
                "<em>Conquest of Abundance: A Tale of Abstraction Versus the\nRichness of Being</em>, B. Terpstra (ed.), Chicago: University of\nChicago Press, 1999.",
                "<em>Knowledge, Science and Relativism</em> (Philosophical Papers,\nVolume 3), J. Preston (ed.), Cambridge: Cambridge University Press,\n1999.",
                "<em>Naturphilosophie</em>, eds. H. Heit &amp; E. Oberheim,\nFrankfurt am Main: Suhrkamp Verlag, 2009.",
                "<em>The Tyranny of Science</em>, E. Oberheim (ed.), Cambridge:\nPolity Press, 2011.",
                "<em>Physics and Philosophy</em> (Philosophical Papers, Volume 4),\nS. Gattei &amp; J. Agassi (eds.), Cambridge: Cambridge University\nPress, 2016.",
                "<em>Philosophy of Nature</em>, New Jersey: Wiley-Blackwell,\n2016.\n</ul>\n<h3 id=\"AudiReco\">"
            ],
            "Audio Recordings": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Paul Feyerabend: Wissenschaftstheoretische Plaudiereien\n(Originaltonaufnahmen 1971-1992)</em>, Klaus Sander (ed.), Köln:\nSupposé, 2000.",
                "<em>Paul Feyerabend: Stories from Paulino’s Tapes (Private\nRecordings 1984-1993)</em>, Grazia Borrini-Feyerabend &amp; Klaus\nSander (eds.), Köln: Supposé, 2001.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Achinstein, P., 1964, “On the Meaning of Scientific\nTerms”, <em>Journal of Philosophy</em>, 61: 497–509.",
                "–––, 1968, <em>Concepts of Science</em>,\nBaltimore: Johns Hopkins University Press.",
                "Agassi, J., 1976, Review of <em>Against Method</em>,\n<em>Philosophia</em>, 6: 165–177.",
                "–––, 2002, “A Touch of Malice”\n(Review of Feyerabend &amp; Lakatos 1999),<em>Philosophy of the Social\nSciences</em>, 32: 107–119.",
                "Alford, C.F., 1985, “Yates on Feyerabend’s Democratic\nRelativism”, <em>Inquiry</em>, 28: 113–118.",
                "Andersson, G., 1994, <em>Criticism and the History of Science:\nKuhn’s, Lakatos’s and Feyerabend’s Criticisms of\nCritical Rationalism</em>, Leiden: Brill.",
                "Athanasopoulos, C., 1994, “Pyrrhonism and Paul Feyerabend: A\nStudy of Ancient and Modern Scepticism”, in <em>Hellenistic\nPhilosophy</em> (Volume 2), K. Boudouris (ed.), Athens: International\nCenter for Greek Philosophy and Culture, pp. 11–29.",
                "Baertschi, B., 1986, “Le Réalisme Scientifique de\nFeyerabend”, <em>Dialogue</em>, 25: 267–289.",
                "Bearn, G.C.F., 1986, “Nietzsche, Feyerabend, and the Voices\nof Relativism”, <em>Metaphilosophy</em>, 17: 135–152.",
                "Ben-Israel, I., 1986, “Philosophy and Methodology of\nMilitary Intelligence: Correspondence with Paul Feyerabend”,\n<em>Philosophia</em>, 28: 71–101.",
                "Bernstein, R.J., 1983, <em>Beyond Objectivism and Relativism</em>,\nOxford: Basil Blackwell.",
                "Bhaskar, R., 1975, “Feyerabend and Bachelard: Two\nPhilosophies of Science”, <em>New Left Review</em>, 94:\n31–55.",
                "Brown, H.I., 1976, “Reduction and Scientific\nRevolutions”, <em>Erkenntnis</em>, 10: 81–385.",
                "–––, 1983, “Incommensurability”,\n<em>Inquiry</em>, 26: 3–29.",
                "Brown, M.J., 2009, “Models and Perspectives on Stage:\nRemarks on Giere’s Scientific Perspectivism”, <em>Studies\nin History and Philosophy of Science, Part A</em>, 40:\n213–220.",
                "–––, 2016, “The Abundant World: Paul\nFeyerabend’s Metaphysics of Science”, <em>Studies in\nHistory and Philosophy of Science</em> (Part A), 57:\n142–154.",
                "Brown, M.J. &amp; Kidd, I.J., 2016, “Introduction:\nReappraising Paul Feyerabend”, <em>Studies in History and\nPhilosophy of Science</em> (Part A), 57: 1–8.",
                "Bschir, K., 2015, “Feyerabend and Popper on Proliferation\nand Anomaly Import: On the Compatibility of Theoretical Pluralism and\nCritical Rationalism”, <em>HOPOS</em> – <em>The Journal of\nthe International Society for the History of Philosophy of\nScience</em>, 5: 24–55.",
                "Burian, R.M., 1984, “Scientific Realism and\nIncommensurability: Some Criticisms of Kuhn and Feyerabend”, in\n<em>Methodology, Metaphysics and the History of Science</em>,\nR.S.Cohen and M.W.Wartofsky (eds.), Dordrecht: D.Reidel, pp.\n1–31.",
                "Butts, R.E., 1966, “Feyerabend and the Pragmatic Theory of\nObservation”, <em>Philosophy of Science</em>, 33:\n383–93.",
                "Casamonti, M., 2002, “Mach e Feyerabend”, <em>Rivista\ndi Estetica</em>, 42: 86–117.",
                "Chalmers, A., 1986, “The Galileo that Feyerabend Missed: An\nImproved Case Against Method”, in J.A.Schuster &amp; R.R.Yeo\n(eds.), <em>The Politics and Rhetoric of Scientific Method</em>,\nDordrecht: D. Reidel, pp. 1–31.",
                "–––, 1978, <em>What is This Thing Called\nScience</em>, Milton Keynes: Open University Press.",
                "Churchland, P.M., 1979, <em>Scientific Realism and the Plasticity\nof Mind</em>, Cambridge: Cambridge University Press.",
                "–––, 1981, “Eliminative Materialism and\nthe Propositional Attitudes”, <em>Journal of Philosophy</em>,\n78: 67–90.",
                "Churchland, P.S., 1986, <em>Neurophilosophy: Toward a Unified\nScience of the Mind/Brain</em>, Cambridgem, Mass.: MIT Press.",
                "Coffa, J.A., 1967, “Feyerabend on Explanation and\nReduction”, <em>Journal of Philosophy</em>, 64:\n500–508.",
                "Collier, J., 1984, “Pragmatic Incommensurability”, in\nP.D.Asquith &amp; P.Kitcher (eds.), <em>PSA 1984, Volume 1</em>, East\nLansing, MI: Philosophy of Science Association, pp.\n146–153.",
                "Collodel, M., 2016, “Was Feyerabend a Popperian?”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n27–56.",
                "Corvi, R., 1992, <em>I Fraintendimenti della Ragione: Saggio su\nP.K.Feyerabend</em>, Milan: Vita e Pensiero.",
                "Couvalis, S.G., 1986, “Should Philosophers Become\nPlaywrights?”, <em>Inquiry</em>, 29: 451–457.",
                "–––, 1987, “Feyerabend’s\nEpistemology and Brecht’s Theory of the Drama”,\n<em>Philosophy and Literature</em>, 11: 117–123.",
                "–––, 1988a, “Feyerabend, Ionesco, and the\nPhilosophy of the Drama”, <em>Critical Philosophy</em>, 4:\n51–68.",
                "–––, 1988b, “Feyerabend and Laymon on\nBrownian Motion”, <em>Philosophy of Science</em>, 55:\n415–421.",
                "–––, 1989, <em>Feyerabend’s Critique of\nFoundationalism</em>, Aldershot: Avebury Press.",
                "–––, 2001, “Recent Feyerabendiana”,\n<em>Metascience</em>, 10: 39–49.",
                "Davidson, D., 1973, “On the Very Idea of a Conceptual\nScheme”, <em>Proceedings of the American Philosophical\nAssociation</em>, 47: 5–20. (Reprinted in Krausz and Meiland\n1982).",
                "Devitt, M., 1979, “Against Incommensurability”,\n<em>Australasian Journal of Philosophy</em>, 57: 29–50.",
                "Dürr, H-P., ed., 1980, <em>Versuchungen: Aufsätze zur\nPhilosophie Paul Feyerabend’s</em>, Erster Band, Frankfurt:\nSuhrkamp.",
                "––– (ed.), 1981, <em>Versuchungen: Aufsätze\nzur Philosophie Paul Feyerabend’s</em>, Zweiter Band, Frankfurt:\nSuhrkamp.",
                "Dusek, V., 1998, “Brecht and Lukács as Teachers of\nFeyerabend and Lakatos: The Feyerabend-Lakatos Debate as Scientific\nRecapitulation of the Brecht-Lukács Debate”, <em>History\nof the Human Sciences</em>, 11: 25–44.",
                "Everitt, N., 1981, “A Problem for the Eliminative\nMaterialist”, <em>Mind</em>, 90: 428–434.",
                "Farrell, R.P., 2000, “Rival Theories and Empirical Content\nRevisited”, <em>Studies in History and Philosophy of\nScience</em>, 31: 137–149.",
                "–––, 2000, “Will the Popperian Feyerabend\nplease step forward: pluralistic, Popperian themes in the Philosophy\nof Paul Feyerabend”, <em>International Studies in the Philosophy\nof Science</em>, 14: 257–266.",
                "–––, 2001, “Feyerabend’s\nMetaphysics: Process-Realism or Voluntarist-Idealism?”,\n<em>Journal for General Philosophy of Science</em>, 32: 351–369.",
                "–––, 2003, <em>Feyerabend and Scientific Values:\nTightrope-Walking Rationality</em>, Dordrecht: Kluwer.",
                "–––, 2005, “Feyerabend and Scientific\nValues: Tightrope-Walking Rationality”, <em>Philosophy of\nScience</em>, 72(3): 514–517.",
                "Finocchiaro, M.A., 1978, “Rhetoric and Scientific\nRationality”, in P.D.Asquith &amp; I.Hacking (eds.), <em>PSA\n1978, Volume 1</em>, East Lansing, MI: Philosophy of Science\nAssociation, pp. 235–246.",
                "Floyd, J., 2005, “Homage to Vienna: Feyerabend on\nWittgenstein (and Austin and Quine)”, in K.R.Fischer &amp;\nF.Stadler (eds.), <em>Paul Feyerabend (1924–1994)—Ein\nPhilosoph aus Wien</em>, Berlin: Springer Verlag,\npp.465–470.",
                "Foss, J., 2018, “Feyerabendian Pragmatism”,\n<em>Spontaneous Generations</em>, 9: 26–30.",
                "Fuller, S., 1995, “Paul Feyerabend: An Appreciation”,\n<em>Vest</em>, 8: 7–15.",
                "Gattei, S., 2016, “Feyerabend, Truth, And Relativisms:\nFootnotes To The Italian Debate”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 87–95.",
                "Gellner, E., 1975, “Beyond Truth and Falsehood (Review of\n<em>Against Method</em>)”, <em>British Journal for the\nPhilosophy of Science</em>, 26: 331–342.",
                "Giedymin, J., 1970, “The Paradox of Meaning Variance”,\n<em>British Journal for the Philosophy of Science</em>, 21:\n257–268.",
                "–––, 1971, “Consolations for the\nIrrationalist?”, <em>British Journal for the Philosophy of\nScience</em>, 22: 39–53.",
                "–––, 1976, “Instrumentalism and its\nCritique: A Reappraisal”, in R.S.Cohen, P.K.Feyerabend &amp;\nM.Wartofsky (eds.), <em>Essays in Memory of Imre Lakatos</em>,\nDordrecht: D. Reidel, pp. 179–207.",
                "Giere, R.N., 2016, “Feyerabend’s Perspectivism”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n137–141.",
                "Goldman, M., 1980, “The Material Basis for Progress in\nScience”, in P.T.Durbin (ed.), <em>Research in Philosophy &amp;\nTechnology</em>, Greenwich, CT: JAI Press, pp. 23–29.",
                "–––, 1982, “Science and Play”, in\nP.D.Asquith &amp; T.Nickles (eds.), <em>PSA 1982, Volume 1</em>, East\nLansing, MI: Philosophy of Science Association, pp.\n406–414.",
                "Grebowicz, G., 2005, “Feyerabend’s\nPostmodernism”, <em>Studies in Practical Philosophy</em>, 5:\n112–133.",
                "Gunaratne, R.D., 1980, <em>Science, Understanding and Truth</em>,\nSri Lanka: Ministry of Higher Education Publications.",
                "Hacking, I., 1975, <em>Why Does Language Matter to\nPhilosophy?</em>, Cambridge: Cambridge University Press.",
                "–––, 1983, <em>Representing and Intervening:\nIntroductory Topics in the Philosophy of Natural Science</em>,\nCambridge: Cambridge University Press.",
                "–––, 1991, “Review of P.K.Feyerabend,\n<em>Against Method</em>, and <em>Farewell to Reason</em>,”\n<em>Journal of Philosophy</em>, 88: 219–223.",
                "Hannay, A., 1989, “Politics and Feyerabend’s\nAnarchist”, in M.Dascal &amp; O.Gruengard (eds.), <em>Knowledge\nand Politics</em>, Colorado: Westview Press, pp. 241–263.",
                "Hanson, N.R., 1959, “Five Cautions for the Copenhagen\nInterpretation’s Critics”, <em>Philosophy of Science</em>,\n26: 325–337.",
                "Harding, S., 2003, <em>Science and Other Cultures: Issues in\nPhilosophies of Science and Technology</em>, London: Routledge.",
                "–––, 2006, <em>Science and Social Inequality:\nFeminist and Postcolonial Issues</em>, Champaign: University of\nIllinois Press.",
                "Harré, R., 1977, Review of P.K.Feyerabend’s\n<em>Against Method</em>, <em>Mind</em>, 86: 294–298.",
                "–––, 1985, “For Method: A Response to\nFeyerabend”, <em>New Ideas in Psychology</em>, 3:\n13–17.",
                "Heit, H., 2016, “Reasons for Relativism: Feyerabend on the\n”Rise of Rationalism“ in Ancient Greece”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n70–78.",
                "Heller, L., 2016, “Between Relativism and Pluralism:\nPhilosophical and Political Relativism in Feyerabend’s Late\nWork”, <em>Studies in History and Philosophy of Science</em>,\n57: 96–105.",
                "Hentschel, K., 1985, “On Feyerabend’s Version of\nMach’s Theory of Research and its Relation to Einstein”,\n<em>Studies in History and Philosophy of Science</em>, 16:\n387–394.",
                "Hesse, M.B., 1974, <em>The Structure of Scientific Inference</em>,\nLondon: MacMillan.",
                "–––, 1980, <em>Revolutions and Reconstructions\nin the Philosophy of Science</em>, Sussex: Harvester Press.",
                "Hollis, M. &amp; Lukes, S. (eds.), 1982, <em>Rationality and\nRelativism</em>, Oxford: Basil Blackwell.",
                "Hooker, C., 1972a, Critical Notice of M.Radner &amp; S.Winokur,\n<em>Analyses of Theories and Methods of Physics and Psychology</em>\n(Minnesota Studies in the Philosophy of Science, Volume 4),\n<em>Canadian Journal of Philosophy</em>, 1: 489–507.",
                "Horgan, J., 1993, “Profile: Paul Karl Feyerabend: The Worst\nEnemy of Science”, <em>Scientific American</em>, May: pp.\n16–17.",
                "Hoyningen-Huene, P., 1994, “Obituary of Paul K.Feyerabend\n(1924–1994)”, <em>Erkenntnis</em>, 40: 289–292.",
                "–––, 1997, “Paul K. Feyerabend”,\n<em>Journal for General Philosophy of Science</em> 28 (1):\n1–18.",
                "–––, 1999, “Paul K. Feyerabend”, in:\nJ. Nida-Rümelin (ed.), <em>Philosophie der Gegenwart in\nEinzeldarstellungen</em>, Stuttgart: Kröner, pp. 155–160.",
                "–––, 1999, “Feyerabends Kritik an Kuhns\nnormaler Wissenschaft”, in J.Nida-Rümelin (ed.),\n<em>Rationality, Realism, Revision: Proceedings of the 3rd\ninternational congress of the Society for Analytical Philosophy</em>,\nBerlin: de Gruyter.",
                "–––, 2002, “Paul Feyerabend — ein\nPostmoderner Philosoph? Ein Portrait”, <em>Information\nPhilosophie</em>, März: 30–37.",
                "–––, 2006, “More Letters by Paul\nFeyerabend to Thomas S. Kuhn on Proto-Structure”, <em>Studies in\nHistory and Philosophy of Science</em>, 37(4): 610–632.",
                "Hull, R.T., 1972, “Feyerabend’s Attack on Observation\nSentences”, <em>Synthese</em>, 23: 374–399.",
                "Hung, H-C.E., 1987, “Incommensurability and Inconsistency of\nLanguages”, <em>Erkenntnis</em>, 27: 323–352.",
                "Jacobs, S., 2003, “Misunderstanding John Stuart Mill on\nScience: Paul Feyerabend’s Bad Influence”, <em>The Social\nScience Journal</em>, 40: 201–212.",
                "Jones, W.B., 1978, “Theory-Ladenness and Theory\nComparison”, in P.D.Asquith &amp; I.Hacking (eds.), <em>PSA\n1978</em> (Volume 1, East Lansing, MI: Philosophy of Science\nAssociation, pp. 83–92.",
                "Kadvany, J., 1996, “Reason in History: Paul\nFeyerabend’s Autobiography”, <em>Inquiry</em>, 39:\n141–146.",
                "Kidd, I.J., 2008, “Method in the Madness: Feyerabend’s\nPhilosophical Pluralism (Review of Oberheim 2006)”,\n<em>Metascience</em>, 17: 469–473.",
                "–––, 2011, “Objectivity, Abstraction and\nthe Individual: The Influence of Soren Kierkegaard on Paul\nFeyerabend”, <em>Studies in History and Philosophy of\nScience</em>, 42: 125–134.",
                "–––, 2012, “Feyerabend, Pseudo-Dionysius,\nand the Ineffability of Reality”, <em>Philosophia</em>, 40:\n365–377.",
                "–––, 2013a, “Feyerabend on the\nIneffability of Reality”, in <em>Models of God and Other\nUltimate Realities</em> (Volume 2), A.Kasher &amp; J.Diller (eds.),\nDordrecht: Kluwer, pp. 849–860.",
                "–––, 2013b, “A Pluralist Challenge to\n”Integrative Medicine“: Feyerabend and Popper on the\nCognitive Value of Alternative Medicine”, <em>Studies in History\nand Philosophy of Biological and Biomedical Sciences</em>, 44:\n392–400.",
                "–––, 2013c, “Feyerabend on Science and\nEducation”, <em>Journal of Philosophy of Education</em>, 47:\n407–422.",
                "–––, 2015, “ What’s So Great About\nFeyerabend? ”Against Method“, Forty Years On”,\n<em>Metascience</em>, 24: 343–349.",
                "–––, 2016a, “ What’s So Great About\nScience?: Feyerabend on Science, Ideology, and the Cold War”, E.\nAronova &amp; S. Turchetti (eds.) <em>Science Studies during the Cold\nWar and Beyond </em>, Basingstoke: Palgrave Macmillan.",
                "–––, 2016b, “Feyerabend on Politics,\nEducation, and Scientific Culture”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 121–128.",
                "–––, 2016c, “Why did Feyerabend Defend\nAstrology? Integrity, Virtue, and the Authority of Science”,\n<em>Social Epistemology</em>, 30: 464–482.",
                "–––, 2016d, “Was Feyerabend a\nPostmodernist?”, <em>International Studies in the Philosophy of\nScience</em>, 30: 55–68.",
                "–––, 2017, “Reawakening to Wonder:\nWittgenstein, Feyerabend, and Scientism”, in J.Beale &amp;\nI.J.Kidd (eds.), <em>Wittgenstein and Scientism</em>, London:\nRoutledge, pp. 101–115.",
                "Kidd, I. &amp; Brown, M. (eds.), 2016, <em>Reappraising\nFeyerabend</em>: Special Issue of <em>Studies in History and\nPhilosophy of Science</em> (Part A), volume 57.",
                "Kleiner, S.A., 1979, “Feyerabend, Galileo and Darwin: How to\nMake the Best out of what you have—or think you can get”,\n<em>Studies in History and Philosophy of Science</em>, 10:\n285–309.",
                "Koertge, N., 1972, “For and Against Method” (Review of\nRadner &amp; Winokur), <em>British Journal for the Philosophy of\nScience</em>, 23: 274–285.",
                "–––, 1980, Review of P.K. Feyerabend’s\n<em>Science in a Free Society</em>, <em>British Journal for the\nPhilosophy of Science</em>, 31: 385–390.",
                "–––, 2013, “Feyerabend, Feminism, and\nPhilosophy”, <em>HOPOS</em> – <em>The Journal of the\nInternational Society for the History of Philosophy of Science</em>,\n3: 139–141.",
                "Kresge, S., 1996, “Feyerabend Unbound”, (Review of\n<em>Killing Time</em>), <em>Philosophy of the Social Sciences</em>,\n26: 293–303.",
                "Krige, J., 1980, <em>Science, Revolution and Discontinuity</em>,\nSussex: Harvester Press.",
                "Kuby, D., 2016, “Feyerabend’s ”The Concept of\nIntelligibility in Modern Physics“ (1948)”, <em>Studies in\nHistory and Philosophy of Science</em>, 57: 57–63.",
                "–––, 2018, “Carnap, Feyerabend, and the\nPragmatic Theory of Observation”, <em>HOPOS: The Journal of the\nInternational Society for the History of Philosophy of Science</em>,\n8: 432–470.",
                "Kulka, T., 1977, “How Far does Anything Go? Comments on\nFeyerabend’s Epistemological Anarchism”, <em>Philosophy of the\nSocial Sciences</em>, 7: 277–287.",
                "Kusch, M., 2016, “Relativism in Feyerabend’s Later\nWritings”, <em>Studies in History and Philosophy of\nScience</em>, 57: 106–113.",
                "Lakatos, I., 1978, <em>The Methodology of Scientific Research\nProgrammes</em> (Philosophical Papers, Volume 1), Cambridge: Cambridge\nUniversity Press.",
                "Lamb, D, Munévar, G. &amp; Preston, J.M. (eds.), 2000,\n<em>The Worst Enemy of Science</em> (Essays on the Philosophy of Paul\nFeyerabend), Oxford: Oxford University Press.",
                "Laudan, L., 1989, “For Method: or, Against\nFeyerabend”, in J.R.Brown &amp; J.Mittelstrass (eds.), <em>An\nIntimate Relation</em>, Dordrecht: Kluwer, pp. 299–317.",
                "Laymon, R., 1977, “Feyerabend, Brownian Motion, and the\nHiddenness of Refuting Facts”, <em>Philosophy of Science</em>,\n44: 225–247.",
                "Leplin, J., 1969, “Meaning Variance and the Comparability of\nTheories”, <em>British Journal for the Philosophy of\nScience</em>, 20: 69–75.",
                "Lloyd, E.A., 1987, “Feyerabend, Mill, and Pluralism”,\n<em>Philosophy of Science, Supplement</em>, 64: 396–407.",
                "–––, 1996, “The Anachronist\nAnarchist”, <em>Philosophical Studies</em>, 81:\n247–261.",
                "Machamer, P.K., 1973, “Feyerabend and Galileo: the\nInteraction of Theories, and the Reinterpretation of\nExperience”, <em>Studies in History and Philosophy of\nScience</em>, 4: 1–46.",
                "Maia Neto, J.R., 1991, “Feyerabend’s\nScepticism”, <em>Studies in History and Philosophy of\nScience</em>, 22: 543–55.",
                "Malolo Dissakè, E., 2001, <em>Feyerabend:\nÉpistémologie, anarchisme, et société\nlibre</em>, Paris: Presses Universitaires de France.",
                "Margolis, J., 1970a, “Notes on Feyerabend and Hanson”,\nin M.Radner &amp; S.Winokur (eds.), <em>Analyses of Theories and\nMethods in Physics and Psychology</em> (Minnesota Studies in the\nPhilosophy of Science, Volume 4), Minneapolis: University of Minnesota\nPress, pp. 193–195.",
                "Martin, E.C., 2016, “Late Feyerabend on materialism,\nmysticism, and religion”, <em>Studies in History and Philosophy\nof Science</em>, 57: 129–136.",
                "–––, 2019, ““The Battle is on”:\nLakatos, Feyerabend, and the Student Protests”, <em>European\nJournal for Philosophy of Science</em>, 9: 1–33.",
                "Martin, M., 1984, “How to be a Good Philosopher of Science:\nA Plea for Empiricism in Matters Methodological”, in R.S.Cohen\n&amp; M.Wartofsky (eds.), <em>Methodology, Metaphysics and the History\nof Science: in Memory of Benjamin Nelson</em>, Dordrecht: Reidel, pp.\n33–42.",
                "McEvoy, J.G., 1975, “A ”Revolutionary“\nPhilosophy of Science: Feyerabend and the Degeneration of Critical\nRationalism into Sceptical Fallibilism”, <em>Philosophy of\nScience</em>, 42: 49–66.",
                "Mellor, D.H., 1969, “Physics and Furniture”, in\nN.Rescher (ed.), <em>Studies in the Philosophy of Science</em>\n(American Philosophical Quarterly Monograph Series, No. 3), Oxford:\nBasil Blackwell, pp. 171–187.",
                "Moberg, D.W., 1979, “Are there Rival, Incommensurable\nTheories?”, <em>Philosophy of Science</em>, 46:\n244–262.",
                "Motterlini, M. (ed.), 1999, <em>For and Against Method, including\nLakatos’s Lectures on Scientific Method, and the\nLakatos-Feyerabend Correspondence</em>, Chicago: University of Chicago\nPress.",
                "Munévar, G. (ed.), 1991, <em>Beyond Reason: Essays on the\nPhilosophy of Paul Feyerabend</em>, Dordrecht: Kluwer.",
                "–––, 1998, <em>Evolution and the Naked Truth: A\nDarwinian Approach to Philosophy</em>, Aldershot: Avebury.",
                "–––, 2002, “Conquering Feyerabend’s\nConquest of Abundance?”, <em>Philosophy of Science</em>, 69:\n519–535.",
                "–––, 2016, “Historical Antecedents to the\nPhilosophy of Paul Feyerabend”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 9–16.",
                "Musgrave, A., 1976, “Method or Madness? Can the Methodology\nof Research Programmes be Rescued from Epistemological\nAnarchism?”, in R.S. Cohen, P.K. Feyerabend &amp; M. Wartofsky\n(eds.), <em>Essays in Memory of Imre Lakatos</em>, Dordrecht: D.\nReidel, pp. 457–491.",
                "–––, 1978, “How to Avoid\nIncommensurability”, in I. Niiniluoto &amp; R. Tuomela [1979],\npp. 337–346.",
                "Nagel, E., 1979, <em>Teleology Revisited, and Other Essays in the\nPhilosophy and History of Science</em>, New York: Columbia University\nPress.",
                "Newton-Smith, W.H., 1981, <em>The Rationality of Science</em>,\nLondon: Routledge and Kegan Paul.",
                "Niaz, M., 2020, <em>Feyerabend’s Epistemological Anarchism: How\nScience Works and its Importance for Science Education</em>, Cham:\nSpringer.",
                "Nordmann, A., 1990, “Goodbye and Farewell: Siegel vs.\nFeyerabend”, <em>Inquiry</em>, 33: 317–331.",
                "Oberdan, T., 1990, “Positivism and the Pragmatic Theory of\nObservation”, in A. Fine, M. Forbes &amp; L. Wessels (eds.),\n<em>PSA 1990, Volume 1</em>, East Lansing, MI: Philosophy of Science\nAssociation, pp. 25–37.",
                "Oberheim, E., 2005, “On the Historical Origins of the\nContemporary Notion of Incommensurability: Paul Feyerabend’s\nAssault on Conceptual Conservatism”, <em>Studies in History and\nPhilosophy of Science</em>, 36(2): 363–390.",
                "–––, 2006, <em>Feyerabend’s\nPhilosophy</em>, New York: De Gruyter.",
                "–––, 2016, “Rediscovering Einstein’s\nLegacy: How Einstein anticipates Kuhn and Feyerabend on the nature of\nscience”, <em>Studies in History and Philosophy of Science</em>,\n57: 17–26.",
                "Oberheim, E., &amp; Hoyningen-Huene, P., 2000,\n“Feyerabend’s Early Philosophy” (Review of\nJ.Preston, <em>Feyerabend: Philosophy, Science and Society</em>),\n<em>Studies in History and Philosophy of Science</em>, 31:\n363–375.",
                "O’Gorman, F., 1989, <em>Rationality and Relativity: The\nQuest for Objective Knowledge</em>, Aldershot: Avebury Press, Ch.\n3.",
                "Papineau, D., 1979, <em>Theory and Meaning</em>, Oxford: Clarendon\nPress.",
                "Pera, M., 1994, <em>The Discourses of Science</em>, Chicago:\nUniversity of Chicago Press.",
                "Phillips, D.L., 1973, <em>Abandoning Method</em>, San Francisco:\nJossey-Bass.",
                "Post, H., 1971, “Correspondence, Invariance and\nHeuristics”, <em>Studies in History and Philosophy of\nScience</em>, 2: 213–255.",
                "Preston, J.M., 1995a, “Frictionless Philosophy: Paul\nFeyerabend and Relativism” <em>History of European Ideas</em>,\n20: 963–968.",
                "–––, 1997a, <em>Feyerabend: Philosophy, Science\nand Society</em>, Cambridge: Polity Press.",
                "–––, 1997b, “Feyerabend’s Retreat\nfrom Realism”, <em>Philosophy of Science</em>, 64:\n421–431.",
                "–––, 1997c, “Feyerabend’s Final\nRelativism” <em>The European Legacy</em>, 2: 615–620.",
                "–––, 1998, “Science as Supermarket:\n”Post-Modern“ Themes in Paul Feyerabend’s Later\nPhilosophy of Science”, <em>Studies in History and Philosophy of\nScience</em>, 29: 425–447.",
                "–––, 2016, “The Rise of Western\nRationalism: Paul Feyerabend’s Story”, <em>Studies in\nHistory and Philosophy of Science</em>, 57: 79–86.",
                "Preston, J., Munévar, G. &amp; Lamb, D. (eds.), 2000,\n<em>The Worst Enemy of Science? Essays in Memory of Paul\nFeyerabend</em>, New York: Oxford University Press.",
                "Putnam, H., 1965, “How Not to Talk about Meaning”, in\nR.Cohen &amp; M.W.Wartofsky (eds.) <em>Boston Studies in the\nPhilosophy of Science, Volume 2</em> (In Honor of Philipp Frank), New\nYork: Humanities Press, pp. 117–131.",
                "–––, 1978, <em>Meaning and the Moral\nSciences</em>, London: Routledge and Kegan Paul.",
                "–––, 1981, <em>Reason, Truth, and History</em>,\nCambridge: Cambridge University Press.",
                "Roe, S.M., 2009, “The Attenuated Ramblings of a Madman:\nFeyerabend’s Anarchy Examined”, <em>Polish Journal of\nPhilosophy</em>, 3: 67–85.",
                "Sankey, H., 1994, <em>The Incommensurability Thesis</em>,\nAldershot: Avebury Press.",
                "Scheffler, I., 1966, <em>Science and Subjectivity</em>,\nIndianapolis: Hackett Publishing Co.",
                "Scheibe, E., 1988, “Paul Feyerabend un die rationalen\nRekonstruktionen”, in P.Hoyningen-Huene &amp; G.Hirsch (eds.),\n<em>Wozu Wissenschaftsphilosophie? Positionen und Fragen zur heutigen\nWissenschaftsphilosophie</em>, Berlin: De Gruyter.",
                "Shapere, D., 1966, “Meaning and Scientific Change”, in\nR.G.Colodny (ed.), <em>Mind and Cosmos: Essays in Contemporary Science\nand Philosophy</em>, Pittsburgh: University of Pittsburgh Press, pp.\n41–85.",
                "Shaw, J., 2017, “Was Feyerabend an Anarchist? The\nStructure(s) of ‘Anything Goes’”, <em>Studies in\nHistory and Philosophy of Science</em>, 64: 11–21.",
                "––– , 2018, “A Pluralism worth Having:\nFeyerabend’s Well–Ordered Science”, Ph.D. Dissertation,\nPhilosophy Department, Western University,\n <a href=\"https://ir.lib.uwo.ca/etd/5599\" target=\"other\">Electronic Thesis and Dissertation Repository: 5599</a>.",
                "––– , 2017, “Feyerabend and the Cranks: On\nDemarcation, Epistemic Virtues, and Astrology”, <em>Social\nEpistemology Review and Reply Collective</em>, 6: 74–88.",
                "Siegel, H., 1989, “Farewell to Feyerabend”,\n<em>Inquiry</em>, 32: 343–369.",
                "Solomon, M., 2008, “Norms of Dissent”, in D.Fennell\n(ed.), <em>Contingency and Dissent in Science Project Discussion Paper\nSeries</em>, London School of Economics CPNSS Discussion Paper,\nTechnical Report 0908.",
                "Sorgner, H., 2016, “Challenging Expertise: Paul Feyerabend\nvs. Harry Collins &amp; Robert Evans on democracy, public\nparticipation and scientific authority”, <em>Studies in History\nand Philosophy of Science</em>, 57: 114–120.",
                "Stadler, F., 2008, “Paul Feyerabend and the Forgotten Third\nVienna Circle”, in R. Scazzieri and R. Simili (eds.), <em>The\nMigration of Ideas</em>, Cambridge, Mass.: Watson, pp. 203–244.",
                "Stadler, F., and Fischer, K. R. (eds.), 2006, <em>Paul Feyerabend:\nEin Philosoph aus Wien</em>, Vienna: Springer.",
                "Staley, K., 1999, “Logic, Liberty, and Anarchy: Mill and\nFeyerabend on Scientific Method”, <em>The Social Science\nJournal</em>, 36: 603–614.",
                "Suppe, F. (ed.), 1977, <em>The Structure of Scientific\nTheories</em>, Urbana: University of Illinois Press.",
                "–––, 1989, <em>The Semantic Conception of\nTheories and Scientific Realism</em>, Urbana: University of Illinois\nPress.",
                "Szumilewicz, I., 1977, “Incommensurability and the\nRationality of the Development of Science”, <em>British Journal\nfor the Philosophy of Science</em>, 28: 345–350.",
                "Tambolo, L., 2014, “Pliability and Resistance: Feyerabendian\nInsights into Sophisticated Realism”, <em>European Journal for\nPhilosophy of Science</em>, 4: 197–213.",
                "–––, 2015, “A Tale of Three Theories:\nFeyerabend and Popper on Progress and the Aim of Science”,\n<em>Studies in History and Philosophy of Science</em>, 51:\n33–41.",
                "Theocharis, T. &amp; Psimopoulos, M., 1987, “Where Science\nHas Gone Wrong”, <em>Nature</em>, 329: 595–598.",
                "Thomason, N., 1994, “The Power of ARCHED Hypotheses:\nFeyerabend’s Galileo as a Closet Rationalist”, <em>British\nJournal for the Philosophy of Science</em>, 45: 255–264.",
                "Tibbetts, P., 1976, “Feyerabend on Ideology, Human\nHappiness, and the Good Life”, <em>Man and World</em>, 9:\n362–371.",
                "Townsend, B., 1971, “Feyerabend’s Pragmatic Theory of\nObservation and the Comparability of Alternative Theories”, in\nR.C.Buck &amp; R.S.Cohen (eds.), <em>PSA 1970</em> (Boston Studies in\nthe Philosophy of Science, Volume 8), Dordrecht: D. Reidel, pp.\n202–211.",
                "Trigg, R., 1973, <em>Reason and Commitment</em>, Cambridge:\nCambridge University Press.",
                "Tsou, J.Y., 2003, “Reconsidering Feyerabend’s\nAnarchism”, <em>Perspectives on Science: Historical,\nPhilosophical, Social</em>, 11(2): 208–235.",
                "Van Fraassen, B.C., 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.",
                "Van Strien, M., 2020, “Pluralism and Anarchism in Quantum\nPhysics: Paul Feyerabend’s Writings on Quantum Physics in relation\nto his General Philosophy of Science”, <em>Studies in History\nand Philosophy of Science</em>, 80: 72–81.",
                "Watkins, J.W.N., 1984, <em>Science and Scepticism</em>, New\nJersey: Princeton University Press.",
                "Weckert, J., 1986, “The Theory-Ladenness of\nObservations”, <em>Studies in History and Philosophy of\nScience</em>, 17: 115–127.",
                "Weimer, W.B., 1980, “For and Against Method: Reflections on\nFeyerabend and the Foibles of Philosophy”, <em>Pre/Text</em>,\n1–2: 161–203.",
                "Werth, R., 1980, “On the Theory-Dependence of\nObservations”, <em>Studies in History and Philosophy of\nScience</em>, 11: 137–143.",
                "Wisdom, J.O., 1974, “The Incommensurability Thesis”,\n<em>Philosophical Studies</em>, 25: 299–301.",
                "Worrall, J., 1978a, “Against Too Much Method”,\n<em>Erkenntnis</em>, 13: 279–295.",
                "–––, 1978b, “Is the Empirical Content of a\nTheory Dependent On Its Rivals?” in I.Niiniluoto and R.Tuomela\n(eds.), <em>The Logic and Epistemology of Scientific Change</em>\n(<em>Acta Philosophica Fennica</em>, Volume 30), 298–310.",
                "–––, 1991, “Feyerabend and the\nFacts”, in Munévar (ed.), [1991], pp. 329–353.",
                "Yates, S., 1984, “Feyerabend’s Democratic\nRelativism”, <em>Inquiry</em>, 27: 137–142.",
                "–––, 1985, “More on Democratic Relativism:\nA Response to Alford”, <em>Inquiry</em>, 28: 450–453.",
                "Yuann, J. J., 2007, “A Naturalistic Approach to Scientific\nMethodology: A Comparative Study of O. Neurath and P.\nFeyerabend”, in Chienkuo Michael Mi &amp;R.L.Chen (eds.),\n<em>Naturalized Epistemology and Philosophy of Science</em>, Amsterdam\n&amp; New York: Rodopi, pp. 171–196.",
                "Zahar, E., 1977, “Mach, Einstein, and the Rise of Modern\nScience”, <em>British Journal for the Philosophy of\nScience</em>, 28: 195–213.",
                "–––, 1978, “Theorienkonflikt und die\nSteurerung der Erkenntnis”, in O.Molden, (ed.), <em>Konflikt und\nOrdnung: Europäisches Forum Alpbach</em>, Vienna: Molden Verlag,\n1977, pp. 234–239.",
                "–––, 1981, “Second Thoughts About Machian\nPositivism: A Reply to Feyerabend”, <em>British Journal for the\nPhilosophy of Science</em>, 32: 267–276.",
                "–––, 1982, “Feyerabend on Observation and\nEmpirical Content”, <em>British Journal for the Philosophy of\nScience</em>, 33: 397–409.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"FeyeMajoWrit\">Feyerabend’s Major Writings</h3>\n<ul class=\"hanging\">\n<li>“Problems of Empiricism”, <em>Beyond the Edge of\nCertainty: Essays in Contemporary Science and Philosophy</em>, R.G.\nColodny (ed.), New Jersey: Prentice-Hall, 1965, pp.\n145–260.</li>\n<li><em>Against Method</em>, London: Verso, 1975.</li>\n<li><em>Science in a Free Society</em>, London: New Left Books,\n1978.</li>\n<li><em>Der wissenschaftstheoretische Realismus und die Autorität\nder Wissenschaften</em>, Braunschweig: Vieweg, 1978.</li>\n<li><em>Erkenntnis für freie Menschen</em>, Frankfurt am Main:\nSuhrkamp Verlag, 1980.</li>\n<li><em>Realism, Rationalism, and Scientific Method</em>\n(Philosophical Papers, Volume 1), Cambridge: Cambridge University\nPress, 1981.</li>\n<li><em>Problems of Empiricism</em> (Philosophical Papers, Volume 2),\nCambridge: Cambridge University Press, 1981.</li>\n<li><em>Wissenschaft als Kunst</em>, Frankfurt am Main: Suhrkamp\nVerlag, 1984.</li>\n<li><em>Farewell to Reason</em>, London: Verso/New Left Books,\n1987.</li>\n<li><em>Against Method</em>, London: 1975; Revised edition, London:\nVerso, 1988.</li>\n<li><em>Three Dialogues on Knowledge</em>, Oxford: Basil Blackwell,\n1991.</li>\n<li><em>Killing Time: The Autobiography of Paul Feyerabend</em>,\nChicago: University of Chicago Press, 1995.</li>\n<li><em>Conquest of Abundance: A Tale of Abstraction Versus the\nRichness of Being</em>, B. Terpstra (ed.), Chicago: University of\nChicago Press, 1999.</li>\n<li><em>Knowledge, Science and Relativism</em> (Philosophical Papers,\nVolume 3), J. Preston (ed.), Cambridge: Cambridge University Press,\n1999.</li>\n<li><em>Naturphilosophie</em>, eds. H. Heit &amp; E. Oberheim,\nFrankfurt am Main: Suhrkamp Verlag, 2009.</li>\n<li><em>The Tyranny of Science</em>, E. Oberheim (ed.), Cambridge:\nPolity Press, 2011.</li>\n<li><em>Physics and Philosophy</em> (Philosophical Papers, Volume 4),\nS. Gattei &amp; J. Agassi (eds.), Cambridge: Cambridge University\nPress, 2016.</li>\n<li><em>Philosophy of Nature</em>, New Jersey: Wiley-Blackwell,\n2016.</li>\n</ul>\n<h3 id=\"AudiReco\">Audio Recordings</h3>\n<ul class=\"hanging\">\n<li><em>Paul Feyerabend: Wissenschaftstheoretische Plaudiereien\n(Originaltonaufnahmen 1971-1992)</em>, Klaus Sander (ed.), Köln:\nSupposé, 2000.</li>\n<li><em>Paul Feyerabend: Stories from Paulino’s Tapes (Private\nRecordings 1984-1993)</em>, Grazia Borrini-Feyerabend &amp; Klaus\nSander (eds.), Köln: Supposé, 2001.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Achinstein, P., 1964, “On the Meaning of Scientific\nTerms”, <em>Journal of Philosophy</em>, 61: 497–509.</li>\n<li>–––, 1968, <em>Concepts of Science</em>,\nBaltimore: Johns Hopkins University Press.</li>\n<li>Agassi, J., 1976, Review of <em>Against Method</em>,\n<em>Philosophia</em>, 6: 165–177.</li>\n<li>–––, 2002, “A Touch of Malice”\n(Review of Feyerabend &amp; Lakatos 1999),<em>Philosophy of the Social\nSciences</em>, 32: 107–119.</li>\n<li>Alford, C.F., 1985, “Yates on Feyerabend’s Democratic\nRelativism”, <em>Inquiry</em>, 28: 113–118.</li>\n<li>Andersson, G., 1994, <em>Criticism and the History of Science:\nKuhn’s, Lakatos’s and Feyerabend’s Criticisms of\nCritical Rationalism</em>, Leiden: Brill.</li>\n<li>Athanasopoulos, C., 1994, “Pyrrhonism and Paul Feyerabend: A\nStudy of Ancient and Modern Scepticism”, in <em>Hellenistic\nPhilosophy</em> (Volume 2), K. Boudouris (ed.), Athens: International\nCenter for Greek Philosophy and Culture, pp. 11–29.</li>\n<li>Baertschi, B., 1986, “Le Réalisme Scientifique de\nFeyerabend”, <em>Dialogue</em>, 25: 267–289.</li>\n<li>Bearn, G.C.F., 1986, “Nietzsche, Feyerabend, and the Voices\nof Relativism”, <em>Metaphilosophy</em>, 17: 135–152.</li>\n<li>Ben-Israel, I., 1986, “Philosophy and Methodology of\nMilitary Intelligence: Correspondence with Paul Feyerabend”,\n<em>Philosophia</em>, 28: 71–101.</li>\n<li>Bernstein, R.J., 1983, <em>Beyond Objectivism and Relativism</em>,\nOxford: Basil Blackwell.</li>\n<li>Bhaskar, R., 1975, “Feyerabend and Bachelard: Two\nPhilosophies of Science”, <em>New Left Review</em>, 94:\n31–55.</li>\n<li>Brown, H.I., 1976, “Reduction and Scientific\nRevolutions”, <em>Erkenntnis</em>, 10: 81–385.</li>\n<li>–––, 1983, “Incommensurability”,\n<em>Inquiry</em>, 26: 3–29.</li>\n<li>Brown, M.J., 2009, “Models and Perspectives on Stage:\nRemarks on Giere’s Scientific Perspectivism”, <em>Studies\nin History and Philosophy of Science, Part A</em>, 40:\n213–220.</li>\n<li>–––, 2016, “The Abundant World: Paul\nFeyerabend’s Metaphysics of Science”, <em>Studies in\nHistory and Philosophy of Science</em> (Part A), 57:\n142–154.</li>\n<li>Brown, M.J. &amp; Kidd, I.J., 2016, “Introduction:\nReappraising Paul Feyerabend”, <em>Studies in History and\nPhilosophy of Science</em> (Part A), 57: 1–8.</li>\n<li>Bschir, K., 2015, “Feyerabend and Popper on Proliferation\nand Anomaly Import: On the Compatibility of Theoretical Pluralism and\nCritical Rationalism”, <em>HOPOS</em> – <em>The Journal of\nthe International Society for the History of Philosophy of\nScience</em>, 5: 24–55.</li>\n<li>Burian, R.M., 1984, “Scientific Realism and\nIncommensurability: Some Criticisms of Kuhn and Feyerabend”, in\n<em>Methodology, Metaphysics and the History of Science</em>,\nR.S.Cohen and M.W.Wartofsky (eds.), Dordrecht: D.Reidel, pp.\n1–31.</li>\n<li>Butts, R.E., 1966, “Feyerabend and the Pragmatic Theory of\nObservation”, <em>Philosophy of Science</em>, 33:\n383–93.</li>\n<li>Casamonti, M., 2002, “Mach e Feyerabend”, <em>Rivista\ndi Estetica</em>, 42: 86–117.</li>\n<li>Chalmers, A., 1986, “The Galileo that Feyerabend Missed: An\nImproved Case Against Method”, in J.A.Schuster &amp; R.R.Yeo\n(eds.), <em>The Politics and Rhetoric of Scientific Method</em>,\nDordrecht: D. Reidel, pp. 1–31.</li>\n<li>–––, 1978, <em>What is This Thing Called\nScience</em>, Milton Keynes: Open University Press.</li>\n<li>Churchland, P.M., 1979, <em>Scientific Realism and the Plasticity\nof Mind</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1981, “Eliminative Materialism and\nthe Propositional Attitudes”, <em>Journal of Philosophy</em>,\n78: 67–90.</li>\n<li>Churchland, P.S., 1986, <em>Neurophilosophy: Toward a Unified\nScience of the Mind/Brain</em>, Cambridgem, Mass.: MIT Press.</li>\n<li>Coffa, J.A., 1967, “Feyerabend on Explanation and\nReduction”, <em>Journal of Philosophy</em>, 64:\n500–508.</li>\n<li>Collier, J., 1984, “Pragmatic Incommensurability”, in\nP.D.Asquith &amp; P.Kitcher (eds.), <em>PSA 1984, Volume 1</em>, East\nLansing, MI: Philosophy of Science Association, pp.\n146–153.</li>\n<li>Collodel, M., 2016, “Was Feyerabend a Popperian?”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n27–56.</li>\n<li>Corvi, R., 1992, <em>I Fraintendimenti della Ragione: Saggio su\nP.K.Feyerabend</em>, Milan: Vita e Pensiero.</li>\n<li>Couvalis, S.G., 1986, “Should Philosophers Become\nPlaywrights?”, <em>Inquiry</em>, 29: 451–457.</li>\n<li>–––, 1987, “Feyerabend’s\nEpistemology and Brecht’s Theory of the Drama”,\n<em>Philosophy and Literature</em>, 11: 117–123.</li>\n<li>–––, 1988a, “Feyerabend, Ionesco, and the\nPhilosophy of the Drama”, <em>Critical Philosophy</em>, 4:\n51–68.</li>\n<li>–––, 1988b, “Feyerabend and Laymon on\nBrownian Motion”, <em>Philosophy of Science</em>, 55:\n415–421.</li>\n<li>–––, 1989, <em>Feyerabend’s Critique of\nFoundationalism</em>, Aldershot: Avebury Press.</li>\n<li>–––, 2001, “Recent Feyerabendiana”,\n<em>Metascience</em>, 10: 39–49. </li>\n<li>Davidson, D., 1973, “On the Very Idea of a Conceptual\nScheme”, <em>Proceedings of the American Philosophical\nAssociation</em>, 47: 5–20. (Reprinted in Krausz and Meiland\n1982).</li>\n<li>Devitt, M., 1979, “Against Incommensurability”,\n<em>Australasian Journal of Philosophy</em>, 57: 29–50.</li>\n<li>Dürr, H-P., ed., 1980, <em>Versuchungen: Aufsätze zur\nPhilosophie Paul Feyerabend’s</em>, Erster Band, Frankfurt:\nSuhrkamp.</li>\n<li>––– (ed.), 1981, <em>Versuchungen: Aufsätze\nzur Philosophie Paul Feyerabend’s</em>, Zweiter Band, Frankfurt:\nSuhrkamp.</li>\n<li>Dusek, V., 1998, “Brecht and Lukács as Teachers of\nFeyerabend and Lakatos: The Feyerabend-Lakatos Debate as Scientific\nRecapitulation of the Brecht-Lukács Debate”, <em>History\nof the Human Sciences</em>, 11: 25–44.</li>\n<li>Everitt, N., 1981, “A Problem for the Eliminative\nMaterialist”, <em>Mind</em>, 90: 428–434.</li>\n<li>Farrell, R.P., 2000, “Rival Theories and Empirical Content\nRevisited”, <em>Studies in History and Philosophy of\nScience</em>, 31: 137–149. </li>\n<li>–––, 2000, “Will the Popperian Feyerabend\nplease step forward: pluralistic, Popperian themes in the Philosophy\nof Paul Feyerabend”, <em>International Studies in the Philosophy\nof Science</em>, 14: 257–266. </li>\n<li>–––, 2001, “Feyerabend’s\nMetaphysics: Process-Realism or Voluntarist-Idealism?”,\n<em>Journal for General Philosophy of Science</em>, 32: 351–369.\n</li>\n<li>–––, 2003, <em>Feyerabend and Scientific Values:\nTightrope-Walking Rationality</em>, Dordrecht: Kluwer. </li>\n<li>–––, 2005, “Feyerabend and Scientific\nValues: Tightrope-Walking Rationality”, <em>Philosophy of\nScience</em>, 72(3): 514–517. </li>\n<li>Finocchiaro, M.A., 1978, “Rhetoric and Scientific\nRationality”, in P.D.Asquith &amp; I.Hacking (eds.), <em>PSA\n1978, Volume 1</em>, East Lansing, MI: Philosophy of Science\nAssociation, pp. 235–246.</li>\n<li>Floyd, J., 2005, “Homage to Vienna: Feyerabend on\nWittgenstein (and Austin and Quine)”, in K.R.Fischer &amp;\nF.Stadler (eds.), <em>Paul Feyerabend (1924–1994)—Ein\nPhilosoph aus Wien</em>, Berlin: Springer Verlag,\npp.465–470.</li>\n<li>Foss, J., 2018, “Feyerabendian Pragmatism”,\n<em>Spontaneous Generations</em>, 9: 26–30. </li>\n<li>Fuller, S., 1995, “Paul Feyerabend: An Appreciation”,\n<em>Vest</em>, 8: 7–15.</li>\n<li>Gattei, S., 2016, “Feyerabend, Truth, And Relativisms:\nFootnotes To The Italian Debate”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 87–95.</li>\n<li>Gellner, E., 1975, “Beyond Truth and Falsehood (Review of\n<em>Against Method</em>)”, <em>British Journal for the\nPhilosophy of Science</em>, 26: 331–342.</li>\n<li>Giedymin, J., 1970, “The Paradox of Meaning Variance”,\n<em>British Journal for the Philosophy of Science</em>, 21:\n257–268.</li>\n<li>–––, 1971, “Consolations for the\nIrrationalist?”, <em>British Journal for the Philosophy of\nScience</em>, 22: 39–53.</li>\n<li>–––, 1976, “Instrumentalism and its\nCritique: A Reappraisal”, in R.S.Cohen, P.K.Feyerabend &amp;\nM.Wartofsky (eds.), <em>Essays in Memory of Imre Lakatos</em>,\nDordrecht: D. Reidel, pp. 179–207.</li>\n<li>Giere, R.N., 2016, “Feyerabend’s Perspectivism”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n137–141.</li>\n<li>Goldman, M., 1980, “The Material Basis for Progress in\nScience”, in P.T.Durbin (ed.), <em>Research in Philosophy &amp;\nTechnology</em>, Greenwich, CT: JAI Press, pp. 23–29.</li>\n<li>–––, 1982, “Science and Play”, in\nP.D.Asquith &amp; T.Nickles (eds.), <em>PSA 1982, Volume 1</em>, East\nLansing, MI: Philosophy of Science Association, pp.\n406–414.</li>\n<li>Grebowicz, G., 2005, “Feyerabend’s\nPostmodernism”, <em>Studies in Practical Philosophy</em>, 5:\n112–133.</li>\n<li>Gunaratne, R.D., 1980, <em>Science, Understanding and Truth</em>,\nSri Lanka: Ministry of Higher Education Publications.</li>\n<li>Hacking, I., 1975, <em>Why Does Language Matter to\nPhilosophy?</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1983, <em>Representing and Intervening:\nIntroductory Topics in the Philosophy of Natural Science</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1991, “Review of P.K.Feyerabend,\n<em>Against Method</em>, and <em>Farewell to Reason</em>,”\n<em>Journal of Philosophy</em>, 88: 219–223.</li>\n<li>Hannay, A., 1989, “Politics and Feyerabend’s\nAnarchist”, in M.Dascal &amp; O.Gruengard (eds.), <em>Knowledge\nand Politics</em>, Colorado: Westview Press, pp. 241–263.</li>\n<li>Hanson, N.R., 1959, “Five Cautions for the Copenhagen\nInterpretation’s Critics”, <em>Philosophy of Science</em>,\n26: 325–337.</li>\n<li>Harding, S., 2003, <em>Science and Other Cultures: Issues in\nPhilosophies of Science and Technology</em>, London: Routledge.</li>\n<li>–––, 2006, <em>Science and Social Inequality:\nFeminist and Postcolonial Issues</em>, Champaign: University of\nIllinois Press.</li>\n<li>Harré, R., 1977, Review of P.K.Feyerabend’s\n<em>Against Method</em>, <em>Mind</em>, 86: 294–298.</li>\n<li>–––, 1985, “For Method: A Response to\nFeyerabend”, <em>New Ideas in Psychology</em>, 3:\n13–17.</li>\n<li>Heit, H., 2016, “Reasons for Relativism: Feyerabend on the\n”Rise of Rationalism“ in Ancient Greece”,\n<em>Studies in History and Philosophy of Science</em>, 57:\n70–78.</li>\n<li>Heller, L., 2016, “Between Relativism and Pluralism:\nPhilosophical and Political Relativism in Feyerabend’s Late\nWork”, <em>Studies in History and Philosophy of Science</em>,\n57: 96–105.</li>\n<li>Hentschel, K., 1985, “On Feyerabend’s Version of\nMach’s Theory of Research and its Relation to Einstein”,\n<em>Studies in History and Philosophy of Science</em>, 16:\n387–394. </li>\n<li>Hesse, M.B., 1974, <em>The Structure of Scientific Inference</em>,\nLondon: MacMillan.</li>\n<li>–––, 1980, <em>Revolutions and Reconstructions\nin the Philosophy of Science</em>, Sussex: Harvester Press.</li>\n<li>Hollis, M. &amp; Lukes, S. (eds.), 1982, <em>Rationality and\nRelativism</em>, Oxford: Basil Blackwell.</li>\n<li>Hooker, C., 1972a, Critical Notice of M.Radner &amp; S.Winokur,\n<em>Analyses of Theories and Methods of Physics and Psychology</em>\n(Minnesota Studies in the Philosophy of Science, Volume 4),\n<em>Canadian Journal of Philosophy</em>, 1: 489–507.</li>\n<li>Horgan, J., 1993, “Profile: Paul Karl Feyerabend: The Worst\nEnemy of Science”, <em>Scientific American</em>, May: pp.\n16–17.</li>\n<li>Hoyningen-Huene, P., 1994, “Obituary of Paul K.Feyerabend\n(1924–1994)”, <em>Erkenntnis</em>, 40: 289–292.</li>\n<li>–––, 1997, “Paul K. Feyerabend”,\n<em>Journal for General Philosophy of Science</em> 28 (1):\n1–18.</li>\n<li>–––, 1999, “Paul K. Feyerabend”, in:\nJ. Nida-Rümelin (ed.), <em>Philosophie der Gegenwart in\nEinzeldarstellungen</em>, Stuttgart: Kröner, pp. 155–160.\n</li>\n<li>–––, 1999, “Feyerabends Kritik an Kuhns\nnormaler Wissenschaft”, in J.Nida-Rümelin (ed.),\n<em>Rationality, Realism, Revision: Proceedings of the 3rd\ninternational congress of the Society for Analytical Philosophy</em>,\nBerlin: de Gruyter. </li>\n<li>–––, 2002, “Paul Feyerabend — ein\nPostmoderner Philosoph? Ein Portrait”, <em>Information\nPhilosophie</em>, März: 30–37. </li>\n<li>–––, 2006, “More Letters by Paul\nFeyerabend to Thomas S. Kuhn on Proto-Structure”, <em>Studies in\nHistory and Philosophy of Science</em>, 37(4): 610–632.</li>\n<li>Hull, R.T., 1972, “Feyerabend’s Attack on Observation\nSentences”, <em>Synthese</em>, 23: 374–399.</li>\n<li>Hung, H-C.E., 1987, “Incommensurability and Inconsistency of\nLanguages”, <em>Erkenntnis</em>, 27: 323–352.</li>\n<li>Jacobs, S., 2003, “Misunderstanding John Stuart Mill on\nScience: Paul Feyerabend’s Bad Influence”, <em>The Social\nScience Journal</em>, 40: 201–212.</li>\n<li>Jones, W.B., 1978, “Theory-Ladenness and Theory\nComparison”, in P.D.Asquith &amp; I.Hacking (eds.), <em>PSA\n1978</em> (Volume 1, East Lansing, MI: Philosophy of Science\nAssociation, pp. 83–92.</li>\n<li>Kadvany, J., 1996, “Reason in History: Paul\nFeyerabend’s Autobiography”, <em>Inquiry</em>, 39:\n141–146.</li>\n<li>Kidd, I.J., 2008, “Method in the Madness: Feyerabend’s\nPhilosophical Pluralism (Review of Oberheim 2006)”,\n<em>Metascience</em>, 17: 469–473.</li>\n<li>–––, 2011, “Objectivity, Abstraction and\nthe Individual: The Influence of Soren Kierkegaard on Paul\nFeyerabend”, <em>Studies in History and Philosophy of\nScience</em>, 42: 125–134. </li>\n<li>–––, 2012, “Feyerabend, Pseudo-Dionysius,\nand the Ineffability of Reality”, <em>Philosophia</em>, 40:\n365–377. </li>\n<li>–––, 2013a, “Feyerabend on the\nIneffability of Reality”, in <em>Models of God and Other\nUltimate Realities</em> (Volume 2), A.Kasher &amp; J.Diller (eds.),\nDordrecht: Kluwer, pp. 849–860.</li>\n<li>–––, 2013b, “A Pluralist Challenge to\n”Integrative Medicine“: Feyerabend and Popper on the\nCognitive Value of Alternative Medicine”, <em>Studies in History\nand Philosophy of Biological and Biomedical Sciences</em>, 44:\n392–400. </li>\n<li>–––, 2013c, “Feyerabend on Science and\nEducation”, <em>Journal of Philosophy of Education</em>, 47:\n407–422.</li>\n<li>–––, 2015, “ What’s So Great About\nFeyerabend? ”Against Method“, Forty Years On”,\n<em>Metascience</em>, 24: 343–349.</li>\n<li>–––, 2016a, “ What’s So Great About\nScience?: Feyerabend on Science, Ideology, and the Cold War”, E.\nAronova &amp; S. Turchetti (eds.) <em>Science Studies during the Cold\nWar and Beyond </em>, Basingstoke: Palgrave Macmillan.</li>\n<li>–––, 2016b, “Feyerabend on Politics,\nEducation, and Scientific Culture”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 121–128.</li>\n<li>–––, 2016c, “Why did Feyerabend Defend\nAstrology? Integrity, Virtue, and the Authority of Science”,\n<em>Social Epistemology</em>, 30: 464–482. </li>\n<li>–––, 2016d, “Was Feyerabend a\nPostmodernist?”, <em>International Studies in the Philosophy of\nScience</em>, 30: 55–68. </li>\n<li>–––, 2017, “Reawakening to Wonder:\nWittgenstein, Feyerabend, and Scientism”, in J.Beale &amp;\nI.J.Kidd (eds.), <em>Wittgenstein and Scientism</em>, London:\nRoutledge, pp. 101–115. </li>\n<li>Kidd, I. &amp; Brown, M. (eds.), 2016, <em>Reappraising\nFeyerabend</em>: Special Issue of <em>Studies in History and\nPhilosophy of Science</em> (Part A), volume 57.</li>\n<li>Kleiner, S.A., 1979, “Feyerabend, Galileo and Darwin: How to\nMake the Best out of what you have—or think you can get”,\n<em>Studies in History and Philosophy of Science</em>, 10:\n285–309.</li>\n<li>Koertge, N., 1972, “For and Against Method” (Review of\nRadner &amp; Winokur), <em>British Journal for the Philosophy of\nScience</em>, 23: 274–285.</li>\n<li>–––, 1980, Review of P.K. Feyerabend’s\n<em>Science in a Free Society</em>, <em>British Journal for the\nPhilosophy of Science</em>, 31: 385–390.</li>\n<li>–––, 2013, “Feyerabend, Feminism, and\nPhilosophy”, <em>HOPOS</em> – <em>The Journal of the\nInternational Society for the History of Philosophy of Science</em>,\n3: 139–141.</li>\n<li>Kresge, S., 1996, “Feyerabend Unbound”, (Review of\n<em>Killing Time</em>), <em>Philosophy of the Social Sciences</em>,\n26: 293–303.</li>\n<li>Krige, J., 1980, <em>Science, Revolution and Discontinuity</em>,\nSussex: Harvester Press.</li>\n<li>Kuby, D., 2016, “Feyerabend’s ”The Concept of\nIntelligibility in Modern Physics“ (1948)”, <em>Studies in\nHistory and Philosophy of Science</em>, 57: 57–63.</li>\n<li>–––, 2018, “Carnap, Feyerabend, and the\nPragmatic Theory of Observation”, <em>HOPOS: The Journal of the\nInternational Society for the History of Philosophy of Science</em>,\n8: 432–470. </li>\n<li>Kulka, T., 1977, “How Far does Anything Go? Comments on\nFeyerabend’s Epistemological Anarchism”, <em>Philosophy of the\nSocial Sciences</em>, 7: 277–287. </li>\n<li>Kusch, M., 2016, “Relativism in Feyerabend’s Later\nWritings”, <em>Studies in History and Philosophy of\nScience</em>, 57: 106–113.</li>\n<li>Lakatos, I., 1978, <em>The Methodology of Scientific Research\nProgrammes</em> (Philosophical Papers, Volume 1), Cambridge: Cambridge\nUniversity Press.</li>\n<li>Lamb, D, Munévar, G. &amp; Preston, J.M. (eds.), 2000,\n<em>The Worst Enemy of Science</em> (Essays on the Philosophy of Paul\nFeyerabend), Oxford: Oxford University Press.</li>\n<li>Laudan, L., 1989, “For Method: or, Against\nFeyerabend”, in J.R.Brown &amp; J.Mittelstrass (eds.), <em>An\nIntimate Relation</em>, Dordrecht: Kluwer, pp. 299–317.</li>\n<li>Laymon, R., 1977, “Feyerabend, Brownian Motion, and the\nHiddenness of Refuting Facts”, <em>Philosophy of Science</em>,\n44: 225–247.</li>\n<li>Leplin, J., 1969, “Meaning Variance and the Comparability of\nTheories”, <em>British Journal for the Philosophy of\nScience</em>, 20: 69–75.</li>\n<li>Lloyd, E.A., 1987, “Feyerabend, Mill, and Pluralism”,\n<em>Philosophy of Science, Supplement</em>, 64: 396–407. </li>\n<li>–––, 1996, “The Anachronist\nAnarchist”, <em>Philosophical Studies</em>, 81:\n247–261.</li>\n<li>Machamer, P.K., 1973, “Feyerabend and Galileo: the\nInteraction of Theories, and the Reinterpretation of\nExperience”, <em>Studies in History and Philosophy of\nScience</em>, 4: 1–46.</li>\n<li>Maia Neto, J.R., 1991, “Feyerabend’s\nScepticism”, <em>Studies in History and Philosophy of\nScience</em>, 22: 543–55. </li>\n<li>Malolo Dissakè, E., 2001, <em>Feyerabend:\nÉpistémologie, anarchisme, et société\nlibre</em>, Paris: Presses Universitaires de France.</li>\n<li>Margolis, J., 1970a, “Notes on Feyerabend and Hanson”,\nin M.Radner &amp; S.Winokur (eds.), <em>Analyses of Theories and\nMethods in Physics and Psychology</em> (Minnesota Studies in the\nPhilosophy of Science, Volume 4), Minneapolis: University of Minnesota\nPress, pp. 193–195.</li>\n<li>Martin, E.C., 2016, “Late Feyerabend on materialism,\nmysticism, and religion”, <em>Studies in History and Philosophy\nof Science</em>, 57: 129–136.</li>\n<li>–––, 2019, ““The Battle is on”:\nLakatos, Feyerabend, and the Student Protests”, <em>European\nJournal for Philosophy of Science</em>, 9: 1–33. </li>\n<li>Martin, M., 1984, “How to be a Good Philosopher of Science:\nA Plea for Empiricism in Matters Methodological”, in R.S.Cohen\n&amp; M.Wartofsky (eds.), <em>Methodology, Metaphysics and the History\nof Science: in Memory of Benjamin Nelson</em>, Dordrecht: Reidel, pp.\n33–42.</li>\n<li>McEvoy, J.G., 1975, “A ”Revolutionary“\nPhilosophy of Science: Feyerabend and the Degeneration of Critical\nRationalism into Sceptical Fallibilism”, <em>Philosophy of\nScience</em>, 42: 49–66.</li>\n<li>Mellor, D.H., 1969, “Physics and Furniture”, in\nN.Rescher (ed.), <em>Studies in the Philosophy of Science</em>\n(American Philosophical Quarterly Monograph Series, No. 3), Oxford:\nBasil Blackwell, pp. 171–187.</li>\n<li>Moberg, D.W., 1979, “Are there Rival, Incommensurable\nTheories?”, <em>Philosophy of Science</em>, 46:\n244–262.</li>\n<li>Motterlini, M. (ed.), 1999, <em>For and Against Method, including\nLakatos’s Lectures on Scientific Method, and the\nLakatos-Feyerabend Correspondence</em>, Chicago: University of Chicago\nPress. </li>\n<li>Munévar, G. (ed.), 1991, <em>Beyond Reason: Essays on the\nPhilosophy of Paul Feyerabend</em>, Dordrecht: Kluwer.</li>\n<li>–––, 1998, <em>Evolution and the Naked Truth: A\nDarwinian Approach to Philosophy</em>, Aldershot: Avebury. </li>\n<li>–––, 2002, “Conquering Feyerabend’s\nConquest of Abundance?”, <em>Philosophy of Science</em>, 69:\n519–535. </li>\n<li>–––, 2016, “Historical Antecedents to the\nPhilosophy of Paul Feyerabend”, <em>Studies in History and\nPhilosophy of Science</em>, 57: 9–16.</li>\n<li>Musgrave, A., 1976, “Method or Madness? Can the Methodology\nof Research Programmes be Rescued from Epistemological\nAnarchism?”, in R.S. Cohen, P.K. Feyerabend &amp; M. Wartofsky\n(eds.), <em>Essays in Memory of Imre Lakatos</em>, Dordrecht: D.\nReidel, pp. 457–491.</li>\n<li>–––, 1978, “How to Avoid\nIncommensurability”, in I. Niiniluoto &amp; R. Tuomela [1979],\npp. 337–346.</li>\n<li>Nagel, E., 1979, <em>Teleology Revisited, and Other Essays in the\nPhilosophy and History of Science</em>, New York: Columbia University\nPress.</li>\n<li>Newton-Smith, W.H., 1981, <em>The Rationality of Science</em>,\nLondon: Routledge and Kegan Paul.</li>\n<li>Niaz, M., 2020, <em>Feyerabend’s Epistemological Anarchism: How\nScience Works and its Importance for Science Education</em>, Cham:\nSpringer. </li>\n<li>Nordmann, A., 1990, “Goodbye and Farewell: Siegel vs.\nFeyerabend”, <em>Inquiry</em>, 33: 317–331.</li>\n<li>Oberdan, T., 1990, “Positivism and the Pragmatic Theory of\nObservation”, in A. Fine, M. Forbes &amp; L. Wessels (eds.),\n<em>PSA 1990, Volume 1</em>, East Lansing, MI: Philosophy of Science\nAssociation, pp. 25–37. </li>\n<li>Oberheim, E., 2005, “On the Historical Origins of the\nContemporary Notion of Incommensurability: Paul Feyerabend’s\nAssault on Conceptual Conservatism”, <em>Studies in History and\nPhilosophy of Science</em>, 36(2): 363–390. </li>\n<li>–––, 2006, <em>Feyerabend’s\nPhilosophy</em>, New York: De Gruyter. </li>\n<li>–––, 2016, “Rediscovering Einstein’s\nLegacy: How Einstein anticipates Kuhn and Feyerabend on the nature of\nscience”, <em>Studies in History and Philosophy of Science</em>,\n57: 17–26.</li>\n<li>Oberheim, E., &amp; Hoyningen-Huene, P., 2000,\n“Feyerabend’s Early Philosophy” (Review of\nJ.Preston, <em>Feyerabend: Philosophy, Science and Society</em>),\n<em>Studies in History and Philosophy of Science</em>, 31:\n363–375. </li>\n<li>O’Gorman, F., 1989, <em>Rationality and Relativity: The\nQuest for Objective Knowledge</em>, Aldershot: Avebury Press, Ch.\n3.</li>\n<li>Papineau, D., 1979, <em>Theory and Meaning</em>, Oxford: Clarendon\nPress.</li>\n<li>Pera, M., 1994, <em>The Discourses of Science</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Phillips, D.L., 1973, <em>Abandoning Method</em>, San Francisco:\nJossey-Bass.</li>\n<li>Post, H., 1971, “Correspondence, Invariance and\nHeuristics”, <em>Studies in History and Philosophy of\nScience</em>, 2: 213–255. </li>\n<li>Preston, J.M., 1995a, “Frictionless Philosophy: Paul\nFeyerabend and Relativism” <em>History of European Ideas</em>,\n20: 963–968.</li>\n<li>–––, 1997a, <em>Feyerabend: Philosophy, Science\nand Society</em>, Cambridge: Polity Press.</li>\n<li>–––, 1997b, “Feyerabend’s Retreat\nfrom Realism”, <em>Philosophy of Science</em>, 64:\n421–431.</li>\n<li>–––, 1997c, “Feyerabend’s Final\nRelativism” <em>The European Legacy</em>, 2: 615–620.</li>\n<li>–––, 1998, “Science as Supermarket:\n”Post-Modern“ Themes in Paul Feyerabend’s Later\nPhilosophy of Science”, <em>Studies in History and Philosophy of\nScience</em>, 29: 425–447. </li>\n<li>–––, 2016, “The Rise of Western\nRationalism: Paul Feyerabend’s Story”, <em>Studies in\nHistory and Philosophy of Science</em>, 57: 79–86.</li>\n<li>Preston, J., Munévar, G. &amp; Lamb, D. (eds.), 2000,\n<em>The Worst Enemy of Science? Essays in Memory of Paul\nFeyerabend</em>, New York: Oxford University Press.</li>\n<li>Putnam, H., 1965, “How Not to Talk about Meaning”, in\nR.Cohen &amp; M.W.Wartofsky (eds.) <em>Boston Studies in the\nPhilosophy of Science, Volume 2</em> (In Honor of Philipp Frank), New\nYork: Humanities Press, pp. 117–131.</li>\n<li>–––, 1978, <em>Meaning and the Moral\nSciences</em>, London: Routledge and Kegan Paul.</li>\n<li>–––, 1981, <em>Reason, Truth, and History</em>,\nCambridge: Cambridge University Press.</li>\n<li>Roe, S.M., 2009, “The Attenuated Ramblings of a Madman:\nFeyerabend’s Anarchy Examined”, <em>Polish Journal of\nPhilosophy</em>, 3: 67–85.</li>\n<li>Sankey, H., 1994, <em>The Incommensurability Thesis</em>,\nAldershot: Avebury Press.</li>\n<li>Scheffler, I., 1966, <em>Science and Subjectivity</em>,\nIndianapolis: Hackett Publishing Co.</li>\n<li>Scheibe, E., 1988, “Paul Feyerabend un die rationalen\nRekonstruktionen”, in P.Hoyningen-Huene &amp; G.Hirsch (eds.),\n<em>Wozu Wissenschaftsphilosophie? Positionen und Fragen zur heutigen\nWissenschaftsphilosophie</em>, Berlin: De Gruyter.</li>\n<li>Shapere, D., 1966, “Meaning and Scientific Change”, in\nR.G.Colodny (ed.), <em>Mind and Cosmos: Essays in Contemporary Science\nand Philosophy</em>, Pittsburgh: University of Pittsburgh Press, pp.\n41–85.</li>\n<li>Shaw, J., 2017, “Was Feyerabend an Anarchist? The\nStructure(s) of ‘Anything Goes’”, <em>Studies in\nHistory and Philosophy of Science</em>, 64: 11–21. </li>\n<li>––– , 2018, “A Pluralism worth Having:\nFeyerabend’s Well–Ordered Science”, Ph.D. Dissertation,\nPhilosophy Department, Western University,\n <a href=\"https://ir.lib.uwo.ca/etd/5599\" target=\"other\">Electronic Thesis and Dissertation Repository: 5599</a>.</li>\n<li>––– , 2017, “Feyerabend and the Cranks: On\nDemarcation, Epistemic Virtues, and Astrology”, <em>Social\nEpistemology Review and Reply Collective</em>, 6: 74–88. </li>\n<li>Siegel, H., 1989, “Farewell to Feyerabend”,\n<em>Inquiry</em>, 32: 343–369.</li>\n<li>Solomon, M., 2008, “Norms of Dissent”, in D.Fennell\n(ed.), <em>Contingency and Dissent in Science Project Discussion Paper\nSeries</em>, London School of Economics CPNSS Discussion Paper,\nTechnical Report 0908.</li>\n<li>Sorgner, H., 2016, “Challenging Expertise: Paul Feyerabend\nvs. Harry Collins &amp; Robert Evans on democracy, public\nparticipation and scientific authority”, <em>Studies in History\nand Philosophy of Science</em>, 57: 114–120.</li>\n<li>Stadler, F., 2008, “Paul Feyerabend and the Forgotten Third\nVienna Circle”, in R. Scazzieri and R. Simili (eds.), <em>The\nMigration of Ideas</em>, Cambridge, Mass.: Watson, pp. 203–244.\n</li>\n<li>Stadler, F., and Fischer, K. R. (eds.), 2006, <em>Paul Feyerabend:\nEin Philosoph aus Wien</em>, Vienna: Springer.</li>\n<li>Staley, K., 1999, “Logic, Liberty, and Anarchy: Mill and\nFeyerabend on Scientific Method”, <em>The Social Science\nJournal</em>, 36: 603–614. </li>\n<li>Suppe, F. (ed.), 1977, <em>The Structure of Scientific\nTheories</em>, Urbana: University of Illinois Press.</li>\n<li>–––, 1989, <em>The Semantic Conception of\nTheories and Scientific Realism</em>, Urbana: University of Illinois\nPress.</li>\n<li>Szumilewicz, I., 1977, “Incommensurability and the\nRationality of the Development of Science”, <em>British Journal\nfor the Philosophy of Science</em>, 28: 345–350.</li>\n<li>Tambolo, L., 2014, “Pliability and Resistance: Feyerabendian\nInsights into Sophisticated Realism”, <em>European Journal for\nPhilosophy of Science</em>, 4: 197–213.</li>\n<li>–––, 2015, “A Tale of Three Theories:\nFeyerabend and Popper on Progress and the Aim of Science”,\n<em>Studies in History and Philosophy of Science</em>, 51:\n33–41.</li>\n<li>Theocharis, T. &amp; Psimopoulos, M., 1987, “Where Science\nHas Gone Wrong”, <em>Nature</em>, 329: 595–598.</li>\n<li>Thomason, N., 1994, “The Power of ARCHED Hypotheses:\nFeyerabend’s Galileo as a Closet Rationalist”, <em>British\nJournal for the Philosophy of Science</em>, 45: 255–264.</li>\n<li>Tibbetts, P., 1976, “Feyerabend on Ideology, Human\nHappiness, and the Good Life”, <em>Man and World</em>, 9:\n362–371.</li>\n<li>Townsend, B., 1971, “Feyerabend’s Pragmatic Theory of\nObservation and the Comparability of Alternative Theories”, in\nR.C.Buck &amp; R.S.Cohen (eds.), <em>PSA 1970</em> (Boston Studies in\nthe Philosophy of Science, Volume 8), Dordrecht: D. Reidel, pp.\n202–211.</li>\n<li>Trigg, R., 1973, <em>Reason and Commitment</em>, Cambridge:\nCambridge University Press.</li>\n<li>Tsou, J.Y., 2003, “Reconsidering Feyerabend’s\nAnarchism”, <em>Perspectives on Science: Historical,\nPhilosophical, Social</em>, 11(2): 208–235.</li>\n<li>Van Fraassen, B.C., 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.</li>\n<li>Van Strien, M., 2020, “Pluralism and Anarchism in Quantum\nPhysics: Paul Feyerabend’s Writings on Quantum Physics in relation\nto his General Philosophy of Science”, <em>Studies in History\nand Philosophy of Science</em>, 80: 72–81. </li>\n<li>Watkins, J.W.N., 1984, <em>Science and Scepticism</em>, New\nJersey: Princeton University Press.</li>\n<li>Weckert, J., 1986, “The Theory-Ladenness of\nObservations”, <em>Studies in History and Philosophy of\nScience</em>, 17: 115–127.</li>\n<li>Weimer, W.B., 1980, “For and Against Method: Reflections on\nFeyerabend and the Foibles of Philosophy”, <em>Pre/Text</em>,\n1–2: 161–203.</li>\n<li>Werth, R., 1980, “On the Theory-Dependence of\nObservations”, <em>Studies in History and Philosophy of\nScience</em>, 11: 137–143.</li>\n<li>Wisdom, J.O., 1974, “The Incommensurability Thesis”,\n<em>Philosophical Studies</em>, 25: 299–301.</li>\n<li>Worrall, J., 1978a, “Against Too Much Method”,\n<em>Erkenntnis</em>, 13: 279–295.</li>\n<li>–––, 1978b, “Is the Empirical Content of a\nTheory Dependent On Its Rivals?” in I.Niiniluoto and R.Tuomela\n(eds.), <em>The Logic and Epistemology of Scientific Change</em>\n(<em>Acta Philosophica Fennica</em>, Volume 30), 298–310.</li>\n<li>–––, 1991, “Feyerabend and the\nFacts”, in Munévar (ed.), [1991], pp. 329–353.</li>\n<li>Yates, S., 1984, “Feyerabend’s Democratic\nRelativism”, <em>Inquiry</em>, 27: 137–142.</li>\n<li>–––, 1985, “More on Democratic Relativism:\nA Response to Alford”, <em>Inquiry</em>, 28: 450–453.</li>\n<li>Yuann, J. J., 2007, “A Naturalistic Approach to Scientific\nMethodology: A Comparative Study of O. Neurath and P.\nFeyerabend”, in Chienkuo Michael Mi &amp;R.L.Chen (eds.),\n<em>Naturalized Epistemology and Philosophy of Science</em>, Amsterdam\n&amp; New York: Rodopi, pp. 171–196.</li>\n<li>Zahar, E., 1977, “Mach, Einstein, and the Rise of Modern\nScience”, <em>British Journal for the Philosophy of\nScience</em>, 28: 195–213.</li>\n<li>–––, 1978, “Theorienkonflikt und die\nSteurerung der Erkenntnis”, in O.Molden, (ed.), <em>Konflikt und\nOrdnung: Europäisches Forum Alpbach</em>, Vienna: Molden Verlag,\n1977, pp. 234–239.</li>\n<li>–––, 1981, “Second Thoughts About Machian\nPositivism: A Reply to Feyerabend”, <em>British Journal for the\nPhilosophy of Science</em>, 32: 267–276.</li>\n<li>–––, 1982, “Feyerabend on Observation and\nEmpirical Content”, <em>British Journal for the Philosophy of\nScience</em>, 33: 397–409.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "anarchism",
            "essential vs. accidental properties",
            "Frege, Gottlob",
            "Galileo Galilei",
            "Kuhn, Thomas",
            "Lakatos, Imre",
            "liberalism",
            "logic: inductive",
            "logical positivism",
            "Mach, Ernst",
            "Marxism, analytical",
            "meaning, theories of",
            "Mill, John Stuart",
            "Nietzsche, Friedrich",
            "Popper, Karl",
            "postmodernism",
            "Principia Mathematica",
            "quantum mechanics",
            "rationalism vs. empiricism",
            "realism",
            "relativism",
            "scientific method",
            "scientific realism",
            "social democracy",
            "Vienna Circle",
            "Wittgenstein, Ludwig"
        ],
        "entry_link": [
            {
                "../anarchism/": "anarchism"
            },
            {
                "../essential-accidental/": "essential vs. accidental properties"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../galileo/": "Galileo Galilei"
            },
            {
                "../thomas-kuhn/": "Kuhn, Thomas"
            },
            {
                "../lakatos/": "Lakatos, Imre"
            },
            {
                "../liberalism/": "liberalism"
            },
            {
                "../logic-inductive/": "logic: inductive"
            },
            {
                "../ernst-mach/": "Mach, Ernst"
            },
            {
                "../marxism-analytical/": "Marxism, analytical"
            },
            {
                "../meaning/": "meaning, theories of"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../nietzsche/": "Nietzsche, Friedrich"
            },
            {
                "../popper/": "Popper, Karl"
            },
            {
                "../postmodernism/": "postmodernism"
            },
            {
                "../principia-mathematica/": "Principia Mathematica"
            },
            {
                "../qm/": "quantum mechanics"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            },
            {
                "../realism/": "realism"
            },
            {
                "../relativism/": "relativism"
            },
            {
                "../scientific-method/": "scientific method"
            },
            {
                "../scientific-realism/": "scientific realism"
            },
            {
                "../vienna-circle/": "Vienna Circle"
            },
            {
                "../wittgenstein/": "Wittgenstein, Ludwig"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feyerabend\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feyerabend/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feyerabend&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feyerabend/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feyerabend": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feyerabend/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feyerabend&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feyerabend/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.collodel.org/feyerabend/\" target=\"other\">The Works of Paul Feyerabend</a>,\n a complete and regularly updated bibliography of Feyerabend’s\nworks, by Matteo Collodel."
        ],
        "listed_links": [
            {
                "http://www.collodel.org/feyerabend/": "The Works of Paul Feyerabend"
            }
        ]
    }
}