{
    "url": "grice",
    "title": "Paul Grice",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Richard E. Grandy\n<rgrandy@rice.edu>\nRichard Warner\n<rwarner@kentlaw.iit.edu>",
        "author_links": [
            {
                "http://www.ruf.rice.edu/~rgrandy/": "Richard E. Grandy"
            },
            {
                "mailto:rgrandy%40rice%2eedu": "rgrandy@rice.edu"
            },
            {
                "https://www.kentlaw.iit.edu/faculty/richard-warner": "Richard Warner"
            },
            {
                "mailto:rwarner%40kentlaw%2eiit%2eedu": "rwarner@kentlaw.iit.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.ruf.rice.edu/~rgrandy/\" target=\"other\">Richard E. Grandy</a>\n&lt;<a href=\"mailto:rgrandy%40rice%2eedu\"><em>rgrandy<abbr title=\" at \">@</abbr>rice<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://www.kentlaw.iit.edu/faculty/richard-warner\" target=\"other\">Richard Warner</a>\n&lt;<a href=\"mailto:rwarner%40kentlaw%2eiit%2eedu\"><em>rwarner<abbr title=\" at \">@</abbr>kentlaw<abbr title=\" dot \">.</abbr>iit<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Dec 13, 2005",
        "substantive revision Wed Dec 8, 2021"
    ],
    "preamble": "\n\nHerbert Paul Grice, universally known as Paul, was born on March 13,\n1913 in Birmingham, England and died on August 28, 1988 in Berkeley\nCA. Grice received firsts in classical honours moderation (1933) and\nliterae humaniores (1935) from Corpus Christi College,\nOxford. After a year teaching in a public school, he returned to\nOxford where, with a nearly five year interruption for service in the\nRoyal Navy, he taught in various positions until 1967 when he moved to\nthe University of California-Berkeley. He taught there past his\nofficial 1979 retirement until his death in 1988. He was\nphilosophically active until his death—holding discussions at\nhis home, giving lectures and editing a collection of his work that\nwas posthumously published as Studies in the Way of Words. He\nis best known for his innovative work in philosophy of language, but\nalso made important contributions to metaphysics, ethics and to the\nstudy of Aristotle and Kant. His work continues to be influential (and\ncontroversial) outside of philosophy in linguistics and artificial\nintelligence. Although relatively little work was published during his\nlife, he had a very wide influence via lectures and unpublished\nmanuscripts. The best known of these were the William James Lectures\nwhich he gave at Harvard in early 1967 and which circulated widely in\nunauthorized manuscript form until they were published as part of\nStudies in the Way of Words. He also played cricket, chess\nand piano, each at a very high level of accomplishment. A useful\nbiography including both Grice’s personal and professional life\nis Chapman 2005; the review by Potts provides more perspective on some\nof the points.\n",
    "toc": [
        {
            "#Over": "1. Overview"
        },
        {
            "#DefeDogm": "2. Defending a dogma"
        },
        {
            "#ConvImpl": "3. Conversational implicature"
        },
        {
            "#Mean": "4. Meaning"
        },
        {
            "#Reas": "5. Reasoning"
        },
        {
            "#EverPsycExpl": "6. Everyday Psychological Explanation"
        },
        {
            "#Onto": "7. Ontology"
        },
        {
            "#OrdiLangPhil": "8. Ordinary Language Philosophy"
        },
        {
            "#Ethi": "9. Ethics"
        },
        {
            "#Conc": "10. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Overview\n\nThe best known of the works published during Grice’s lifetime\nwas his joint paper with Peter Strawson, “In Defense Of A\nDogma”, a widely reprinted defense of the analytic/synthetic\ndistinction against Quine’s attack in “Two Dogmas Of\nEmpiricism”. The best known of his ideas, that of a\nconversational implicature, first appeared in a 1961 paper “The\nCausal Theory Of Perception”, but was a focus of the James\nLectures. In contrast to the slogan, “meaning is use”,\noften associated (though perhaps inaccurately) with Wittgenstein,\nGrice distinguished those elements of language use which were due to\nmeaning from those which are due to other aspects. To illustrate, the\nsentence “He has not been convicted of a crime yet” means\nthat the person being referred to has not yet been convicted of a\ncrime. But in many contexts, the speaker would be taken to imply that\nthe person had committed at least one crime and was likely to be\nconvicted in the future. In “The Causal Theory of\nPerception,” Grice deploys the distinction against J. L.\nAustin’s claim in Sense and Sensibilia that a sentence\nlike ‘It looks to me as if I see something red’ is only\ncorrectly used when someone (possibly the speaker) has reason to doubt\nor deny that the speaker actually sees something red. Austin’s\ntarget is sense-datum theorists who attempt to introduce sense-data by\nappeal to such sentences. Grice argues convincingly that, while\nusing the sentence may typically imply the doubt-or-denial\ncondition, that implication is not part of the meaning of the\nsentence since the speaker can cancel the implication by adding\n‘I do not mean to imply that there is any reason to doubt or\ndeny that I see something red.’ What the speaker means on such a\noccasion can be true even if the speaker is using the sentence in an\nusual way, and there is no reason to doubt or deny the speaker sees\nsomething red. \n\nThis distinction between meaning and use has found many applications\nin philosophy, linguistics and artificial intelligence. Both the\nanalytic/synthetic distinction, which relies on a conception of truth\nby virtue of meaning, and the idea of a conversational implicature\nrequire for their full philosophical development a theory of meaning.\nGrice provided the beginning of a theory of meaning starting with his\n1957 paper “Meaning” and elaborated in later papers (Grice\n1968, 1969, 1982). The basic idea was to distinguish two notions of\nmeaning: what a sentence means in general apart from any use of it,\nand what a specific speaker means by using the sentence on a\nparticular occasion. Grice sees the latter notion as entirely a matter\nof what the speaker intends. Grice’s idea was to show that the\nabstract notion of sentence meaning was to be understood in terms of\nwhat specific speakers intend on specific occasions.The following\nsections will outline the Grice-Strawson arguments for an\nanalytic-synthetic distinction (Section 2), notions of conversational\nimplicature (3), and then delve into his theories about meaning (4),\nreasoning (5), psychology (6), ontology (7), and value (8).\n2. Defending a dogma\n\nGrice and Strawson begin their article with a dissection of the\nvarious ways one can reject a dichotomy and conclude that\nQuine’s rejection of the analytic/synthetic distinction is one\nof the more extreme cases: “He declares, or seems to declare,\nnot merely that the distinction is useless or inadequately clarified,\nbut that it is altogether illusory, that the belief in its existence\nis a philosophical mistake” (Grice & Strawson, 142).\n\nGrice and Strawson deploy a number of arguments against Quine’s\nposition, but the two main ones involve the distinction between an\nutterance meaning something and not meaning anything, and between the\nkind of revision of belief that merely recognize a previous belief as\nfalse and the kind which involves a change of concept, and hence a\nchange in the meaning of a word. These can both be illustrated with\ntheir pair of example sentences:\n\nMy neighbor’s three year old child understands\nRussell’s theory of types.\nMy neighbor’s three year old child is an adult.\n\n\nThey claim that it is not difficult to understand what someone would\nmean by uttering (1), and it is fairly clear what it would take to\npersuade someone that (1) is not false, as seems initially evident.\nBut in the case of (2), they argue, in effect, that with further\ninvestigation one would either conclude that the speaker was using\nfamiliar words to express new concepts, or else would conclude that\nnothing at all was being said. No attempt will be made here to\nadjudicate the dispute with Quine, who would reject both of these\ndichotomies (new concepts/old concepts, something said/nothing said)\nas well. But the reader should note that the crucial claims are that\nsomeone who asserts (2) is either asserting it with a meaning other\nthan the standard conventional one, or with no meaning at all. A\nfurther elaboration of their claims depends therefore on elucidating\nthe notion of the meaning of an utterance, and Section 4 will explore\nGrice’s account of this notion further.\n3. Conversational implicature\n\nConversational implicatures are, roughly, things that a hearer can\nwork out from the way something was said rather than\nwhat was said. People process conversational implicatures all\nof the time and are mostly unaware of it. For example, if someone asks\n“Could you close the door?” the hearer does not usually\nanswer “Yes”, instead they perform the non-linguistic act\nof closing the door. In this case, although the speaker used a form of\nwords that is conventionally a question, the hearer can infer that the\nspeaker is making a request.\n\nGrice was the first to note this ubiquitous feature of language use\nand also the first to present a philosophical analysis. He begins by\nnoting that conversations are usually to some degree cooperative\nenterprises. He then formulates the Cooperative Principle: “Make\nyour conversational contribution such as is required, at the stage at\nwhich it occurs, by the accepted purpose or direction of the talk\nexchange in which you are engaged” (1989, 26).\n\nAt a more detailed level, he distinguishes four categories with more\nspecific maxims. The category of Quantity includes two injunctions,\none to make your contribution as informative as is required, and the\nsecond to make it no more informative than is required. The category\nof Quality is governed by a supermaxim: “Try to make your\ncontribution one that is true”. The category of Relation has a\nsingle maxim, “Be relevant”, while the final category of\nManner has a short “super” maxim “Be\nperspicuous” which has various submaxims (1989, 27).\n\nPerhaps the first thing to note is that conversational maxims often\ncome into conflict. One party to the conversation may be caught\nbetween saying something less informative than is desired (violating\nQuantity) and saying something for which there is insufficient\nevidence (violating Quality). One example of the application of these\nprinciples given by Grice is the following exchange:\n\nI’m low on gas.\nThere is a station around the corner on Main St.\n\n\nIn this situation the sentence B uttered does not logically imply that\nthe station is open. However, the remark is irrelevant unless the\nstation is open, so A can infer from the combination of Manner and\nQuality that B believes he has good evidence that the station is open.\nThus B’s utterance conversationally implicates that the station\nis open. One characteristic of conversational implicatures is that\nthey can be cancelled. Thus if B adds to his remark above, “but\nI don’t know whether it is open” then there is no\nconversational implicature that the station is open. This contrasts\nwith logical or semantic implications which cannot be cancelled\nwithout contradiction.\n\nThe most famous application of Grice’s ideas is to the debate\nabout whether the truth conditions of declarative conditional\nstatements, such as “If George is driving, he will be\nlate” are accurately captured by the material conditional.\nRepresenting the sample sentences as ‘George is driving\n\\(\\rightarrow\\) he will be late’ would make the sentence true if\nit is false that George is driving or true that he will be late (or\nboth). Many writers argued that it would be inappropriate for someone\nto make the assertion if they knew that George was not driving.\nGrice’s response is that to argue that in most circumstances it\nis conversationally inappropriate to make that assertion, not\nbecause it is false, but because it violates conversational\nprinciples.\n\nSymbolically, \\(A \\rightarrow B\\) should not be asserted in\ncircumstances where the speaker knows that \\(A\\) is false because the\nstatement not-\\(A\\) is true and simpler; similarly, if the speakers\nknows \\(B\\) is true, \\(B\\) is a shorter simpler statement; and if the\nspeaker knows both of those facts, then not-\\(A\\) and \\(B\\), is more\ninformative. Thus the only circumstances in which the conditional is\nappropriate is where the speaker is ignorant of the truth values of\n\\(A\\) and \\(B\\), but has some good reason to think that if \\(A\\) does\nprove to be true, \\(B\\) will as well. On this account, the truth\nconditions of the conditional are those of the material implication,\nbut the appropriate assertibility of a conditional tracks the\nconditional probability of \\(B\\) given \\(A\\).\n It should be noted that while this explanation of the\ncircumstances in which a conditional is asserted seems very plausible,\nthe account does not readily extend to apparent discrepancies between\nordinary language conditionals and the material conditional when the\nconditional is embedded in a larger context, e.g., “Mary\nbelieves that if George is driving, he will be\nlate”. Mary’s believing that George will be late allows\nMary to immediately form the material conditional belief George is\ndriving \\(\\rightarrow\\)\nGeorge will be late. But this is clearly not enough for a\nspeaker reporting on Mary’s beliefs to assert that Mary\ntherefore believes that if George is driving then George will be\nlate. Grice’s explanation cannot say why.\n\nIn the last two decades, there has been a burgeoning number of\nresearchers investigating conversational implicature and Grice’s\nprinciples. Criticisms have come from two opposing directions. Some\ncritics argue that Grice’s maxims are not sufficiently worked\nout to explain many of the phenomena related to implicature. For\nexample, in the sentence, “Joan believes that some of her\nstudents will fail,” there seems to be an implicature that not\nall of her students will fail, even though the contained sentence is\nnot asserted. In another direction, Wilson and Sperber, and separately\nBardzokas, argue that Grice’s principles can be derived from\nmore general principles and should be understood in the context of\nsome version of relevance theory.\n\nAnother continuing topic generated by Grice’s ideas is the\nrelation between semantics and pragmatics\n (see the entry on pragmatics).\n The nature of the distinction is controversial, as argued by Bach\n1997 and Horn 2006. Korta & Perry 2011 (Ch. 11) points out that there are\nvarious theoretical meanings to “proposition” and that the\nextent to which pragmatic principles are needed to determine the\nproposition expressed by an utterance depends on which understanding\nof proposition is in play. Two examples of the ongoing debate are\nLePore and Stone 2015 which argues that most, or perhaps all, of what Grice\nthought as pragmatic is in fact governed by linguistic rules, and\nRecanati 2010 which argues the contrary, that pragmatics plays a\nlarger role than is generally recognized.\n4. Meaning\n\nGrice contends sentence and word meaning can be analyzed in terms of\nwhat speakers (utterers, for Grice) mean. Utterers’ meaning, in\nturn, can be analyzed without semantic remainder in terms of utterers\nhaving certain intentions. To see the idea as initially outlined in\nGrice’s 1957 article, “Meaning,” imagine you are\nstopped at night at an intersection, when the driver in an oncoming\ncar flashes her lights. You reason as follows: “Why is she doing\nthat? Oh, she must intend me to believe that my lights are not on. If\nshe has that intention, it must be that my lights are not on. So, they\nare not.” To summarize:\n\nThe driver flashes her lights intending\n\n\nthat you believe that your lights are not on;\nthat you recognize her intention (1);\nthat this recognition be part of your reason for believing that\nyour lights are not on.\n\n\n\nCall such an intention an M-intention. Grice’s idea is that an\nutterer \\(U\\) means that \\(p\\) by uttering \\(x\\) if and only if \\(U\\)\nM-intends that \\(p\\) by uttering \\(x\\). We will use\n‘M-intends’ in this way in what follows. Utterances may\ninclude, not just sounds and marks but also gesture, grunts, and\ngroans—anything that can signal an M-intention. The example\nillustrates an indicative M-intention; such intentions may also be\nimperative. In such a case, the utterer intends to get the audience to\nperform an action.\n\nIn the case of sentence meaning, Grice’s idea is to explicate it\nin terms of M-intentions. He suggests that the claim that a sentence\n\\(x\\) means that \\(p\\) “might as a first shot be equated with\nsome statement or disjunction of statements about what\n‘people’ (vague) intend (with qualifications about\n‘recognition’) to effect by \\(x\\)” (1957, 66). The\nunderlying idea is the same as in the flashing lights example. When\nyou utter, “She brandished her clarinet like a tomahawk,”\nI—as a Gricean audience—reason as follows. “The\nstandard use of that sentence is to utter it intending (1) that the\naudience believe she brandished her clarinet like a tomahawk; (2) that\nthe audience recognize the intention (1); and (3) that this\nrecognition be part of the audience’s reason for believing that\nshe brandished her clarinet like a tomahawk. This is a standard,\nnon-deceptive use; hence I should believe that she brandished her\nclarinet like a tomahawk.”\n\nGrice’s post-1957 work on meaning divides along two lines.\nFirst, he refines the analyses of utterer’s meaning and sentence\nmeaning, primarily in the 1968 article, “Utterer’s\nMeaning, Sentence Meaning, and Word Meaning,” and the 1969\narticle, “Utterer’s Meaning and Intentions.” Second,\nhe addresses the fact that utterers and audiences rarely, if ever,\nreason in the way suggested. As you read these words, for example, you\nare not reasoning in that way. You read and you understand\nstraightaway without any intervening reasoning. So how can\nGrice’s suggested explanation be anything but illusory? These\npoints will be considered in turn.\n\nIn “Utterer’s Meaning, Sentence Meaning, and Word\nMeaning,” Grice offers a revised version of his 1957 account of\nutterers meaning. Grice remarks that in\n\nthe earlier (1957) account I took the view that the M-intended effect\nis, in the case of indicatives-type utterance, that the hearer should\nbelieve something, and, in the case of imperative-type\nutterances, that the hearer should do something. I wish for\npresent purposes to make two changes here.\n\n\nI wish to represent the M-intended effect of imperative-type\nutterances as being that the hearer should intend to do\nsomething (with, of course, the ulterior intention on the part of the\nutter that the hearer go on to do the act in question).\nI wish to regard the M-intended effect common to indicative-type\nutterances as being, not that the hearer should believe something\n(though there will frequently be an ulterior intention to that\neffect), but the hearer should think that the utterer\nbelieves something.\n\n\n(1968, 230).\n\n\nBy way of illustration, suppose \\(U\\), who wants the audience \\(A\\) to\nclose the door, utters ‘Close the door.’ \\(U\\) M-intends\nthat \\(A\\) should intend to close the door, and note: we specify what\n\\(U\\) means using the subjunctive mood. \\(U\\) means that \\(A\\)\nshould close the door. For the indicative case, suppose \\(U\\)\nutters ‘The door is closed,’ M-intending that \\(A\\)\nbelieve \\(U\\) believes the door is closed. We specify what \\(U\\) means\nusing the indicative mood—thus: \\(U\\) means that the door is\nclosed.\n\nGrice captures the role of moods in specifying meaning by introducing\na special notation. He represents the indicative case this way: \\(U\\)\nmeans that \\(\\vdash\\)(the door is closed); the imperative: \\(U\\) means\nthat !(the door is closed). Here ‘the door is closed’\nrepresents a moodless, underlying syntactical element Grice calls a\nsentence radical; it designates the moodless proposition that the door\nis closed. Grice calls ‘\\(\\vdash\\)’ and ‘!’\nmood operators, and he explains them contextually as\nfollows:\n\n\\(U\\) means that \\(\\vdash(p)\\) by uttering \\(x\\) if and only if,\nfor some \\(A\\), \\(U\\) utters \\(x\\) M-intending \\(A\\) to think \\(U\\)\nthinks that \\(p\\);\n\\(U\\) means that \\(!(p)\\) by uttering x if and only, for some\n\\(A\\), if \\(U\\) utters \\(x\\) M-intending (a) \\(A\\) to think \\(U\\)\nintends (to bring it about) that \\(p\\); and (b) \\(A\\) to\nintend that \\(p\\)—having, as part of his reason\n\\(U\\)’s intention (a).\n\n\nMore than two operators are required to handle the full range of\nthings utterers mean, but a complete list is not necessary to\nformulate the revised account of meaning. The account can be stated as\nfollows. Given a function from psychological states onto mood\noperators, if \\(\\psi\\) is a psychological state and \\(*_{\\psi}\\) the\nassociated mood operator,\n\n\n\\(U\\) means that \\(*_{\\psi}(p)\\) by uttering \\(x\\) if and only if, for\nsome \\(A\\), \\(U\\) utters \\(x\\) M-intending\n\nthat \\(A\\) should think \\(U\\) to \\(\\psi\\) that \\(p\\); and (in some\ncases only), depending on \\(*_{\\psi}\\),\nthat \\(A\\) should via fulfillment of (i), himself \\(\\psi\\) that\n\\(p\\).\n\n\n\nGrice uses his revised treatment of utterer’s meaning to refine\nthe very rough and preliminary account of sentence meaning (structured\nutterance type meaning, in his terminology) he gave in\n“Meaning.” His account thereof uses the notion of\nhaving a procedure in one’s repertoire. He says,\n\nThis idea seems to me to be intuitively fairly intelligible and to\nhave application outside the realm of linguistic, or otherwise\ncommunicative, performances, though it could hardly be denied that it\nrequires further explication. A faintly eccentric lecturer might have\nin his repertoire the following procedure: if he sees an attractive\ngirl in his audience to pause for half a minute and then take a\nsedative. His having in his repertoire this procedure would not be\nincompatible with his also having two further procedures: (a) if he\nsees an attractive girl, to put on a pair of dark spectacles (instead\nof pausing to take a sedative); (b) to pause to take a sedative when\nhe sees in his audience not an attractive girl, but a particularly\ndistinguished colleague (1969, 233).\n\n\nTurning to sentence meaning, the idea is that users of a natural\nlanguage like English have standard procedures for using sentences,\nand that—very roughly—a sentence means \\(p\\) among a group\nof utterers when and only when that group has the procedure of using\nit to M-intend that \\(p\\).\n\nThis is a promising start. It is undeniable that English speakers have\nthe procedure of using ‘The door is closed’ to mean that\nthe door is closed. That is (one of the many) things we do with that\nsentence. So, assuming we accept the explication of utterer’s\nmeaning in terms of M-intentions, it undeniable that English speakers\nhave the procedure of using that sentence to M-intend with regard to\nthe proposition that the door is closed. This yields the explanatory\npayoff described earlier. We can see communication as a rational\nactivity in which an utterer intends to produce certain results and\naudiences reason their way to those results via their recognition of\nthe utterer’s intention to produce that very result.\n\nThis preliminary account must be complicated, however, as it is\nunacceptable on three grounds. First, there are infinitely many\nsentences. How does an utterer associate a procedure with each\nsentence of his language? If they must be acquired one by one, it will\ntake an infinite amount of time. Second, sentences are structured\nutterance-types, where meaning of the whole is consequent (in ways\ndetermined by syntactic structure) on the meaning of the parts. The\naccount does not capture this aspect of sentence meaning at all.\nThird, the account fails to represent the complexity introduced into\nthe account of utterer’s meaning; there is no mention of\nmoods.\n\nThese considerations lead Grice to posit that the procedures\nassociated with sentences are resultant procedures arising recursively\nout of basic procedures associated with words. Grice explains that\n\nAs a first approximation, one might say that a procedure for an\nutterance-type \\(X\\) will be a resultant procedure if it is determined\nby (its existence is inferable from) a knowledge of procedures (a) for\nparticular utterance-types which are elements in \\(X\\), and (b) for\nany sequence of utterance-types which exemplifies a particular\nordering of syntactic categories (a particular syntactic form) (SWW,\np. 136–7).\n\n\nGrice introduces a canonical form for specifying resultant procedures.\nHe does so by generalizing the special notation he has already used in\nspecifying meaning. Recall that he represented the indicative case by:\n\\(U\\) means that \\(\\vdash\\)(the door is closed);the imperative: \\(U\\)\nmeans that !(the door is closed). The indicative sentence\n‘\\(\\vdash\\)(the door is closed)’ is associated with the\npsychological state of belief: speakers can and do utter that sentence\nwith the intention that audiences respond by believing the door is\nclosed. The imperative ‘! (the door is closed)’ is\nsimilarly associated with an audience response of action: speakers can\nand do utter that sentence with intention that that audiences respond\nby closing the door. ‘\\(\\vdash\\)’ and ‘!’ are\nexamples of a type of syntactic item Grice calls a mood operator. He\nassumes that the syntactic structure of sentences divides into a mood\noperator and the rest of the structure. Grice uses\n‘\\(*+\\mathrm{R}\\)’ to represent this division. Now let\n\\(\\mathrm{P}_{*+R}\\) be the set of propositions associated with\n\\(*+\\mathrm{R}\\), and \\(\\psi\\) the psychological state or action\nassociated with \\(*\\). Then a resultant procedure for \\(*+\\mathrm{R}\\)\ntakes one of two forms. \\(U\\) has the resultant procedure of:\n\nuttering \\(*+\\mathrm{R}\\) if, for some \\(A\\), \\(U\\) wants \\(A\\) to\n\\(\\psi\\) that \\(p\\); or\nuttering \\(*+\\mathrm{R}\\) if, for some \\(A\\), \\(U\\) wants \\(A\\) to\nthink \\(U\\) to \\(\\psi\\) that \\(p\\).\n\n\nCall these type 1 and type 2 resultant procedures. As a definition of\nsentence meaning we can say that, where \\(p \\in\n\\mathrm{P}_{*+\\mathrm{R}}\\), \\(*+\\mathrm{R}\\) means \\(p\\) in a group\n\\(G\\) if and only if members of \\(G\\) have, with respect to\n\\(*+\\mathrm{R}\\), a type 1 or type 2 resultant procedure, the type\nbeing determined by the type of the mood operator \\(*_{\\psi}\\).\n(Qualifications will, of course, be necessary to handle\n‘audienceless’ cases.)\n\nSo far, perhaps, so good. There are pleasant quibbles over details,\nbut in broad outline, the account is a very plausible description of\nmeaning. In fact, at least three authors, Bennett, Loar and Schiffer,\nhave developed their own more detailed accounts along Gricean lines.\nHowever, when we turn from description to explanation, plausibility\nappears to decline. The explanatory idea is to see communication as a\nrational activity where audiences reason their way to beliefs or\nintentions via their recognition of the utterer’s intention to\nproduce such results. What about the problem that utterers and\naudiences rarely if ever engage in such reasoning? Grice’s work\non reasoning contains the answer.\n\nDoes this approach define sentence meaning in terms of speaker’s\nintentions without any semantic remainder? That depends on how one\ninterprets\n\nA procedure for an utterance-type \\(X\\) will be a resultant procedure\nif it is determined by (its existence is inferable from) a knowledge\nof the procedures (a) for particular utterance-types which are\nelements in \\(X\\), and (b) for any sequence of utterance-types which\nexemplifies a particular ordering of syntactic categories (a\nparticular syntactic form). (1968, 235)\n\n\nOne possibility is to explain at least some basic procedures in terms\nof the concept of reference, where reference is analyzed in terms of\nspeakers’ intentions. The basic procedure for\n‘tiger’ for example would be to utter ‘tiger’\nto refer to tigers. But there is another possibility: the knowledge in\n(a) and (b) includes the knowledge of the semantic properties of\nwords, and the semantic properties of combinations of word, where\nthose properties cannot be fully analyzed in terms of speakers’\nintentions. Noting that the notion of a procedure is quite unclear,\nGrice observes that \n\nWe can, if we are lucky, identify “linguistic rules,” so\ncalled, which are such that our linguistic practice is as if we\naccepted these rules and consciously followed them. But we want to say\nthat this is not just an interesting fact about our linguistic\npractice but also an explanation of it; and this leads us on to\nsuppose that “in some sense,” “implicitly,” we\ndo accept these rules.Now the proper interpretation of the idea that\nwe do accept these rules becomes something of a mystery, if the\n“acceptance” of the rules is to be distinguished from the\nexistence of the related practices]but it seems like a mystery which,\nfor the time being at least, we have to swallow, while recognizing\nthat it involves us in an as yet unsolved problem.\n\n\nThe appeal to implicitly followed linguistic rules casts a revealing\nlight on Grice as a champion of the view that communication is an\nexercise in rational coordination through acts of speaker meaning.\nSince Grice, a central question has been “[h]ow much of this\ncoordination derives from interlocutors’ specific knowledge of\none another as people? How much exploits their knowledge of language\nitself?” (Lepore and Stone 2015, 1). With the appeal to\nimplicitly followed rules, Grice has one foot squarely on\n“knowledge of language itself” side of that divide.\n5. Reasoning\n\nIn Aspects of Reason, Grice begins by considering the\nsuggestion that reasoning consists in “the entertainment (and\noften acceptance) in thought or in speech of a set of initial ideas\n(propositions), together with a sequence of ideas each of which is\nderivable by an acceptable principle of inference from its\npredecessors in the set” (2001, 5). He shows that it is scarcely\nplausible to suppose that reasoning always involves the entertainment\nor acceptance of a sequence of ideas—the steps in the\nreasoning—each of which is derivable (or taken by the reasoner\nto be derivable) from its predecessors.\n\nHe points out that reasoning is often, indeed typically, enthymematic\nin the following way. Jill reasons: “Jack broke his crown, but\nhe is an Englishman; therefore, he will be brave.” She does not\nemploy any suppressed premise. She merely thinks: ‘but\nhe is an Englishman; therefore, he will be brave’. The thought\noccurs to her in a way that carries conviction with it, and she thinks\nit intending the inference signaled by\n‘therefore’ to be valid. Grice suggests that it is a\nnecessary condition of reasoning from \\(A\\) to \\(B\\) that one\nintend that there be a formally valid (and non-trivial)\nargument from \\(A\\) to \\(B\\). Grice devotes a good deal of attention\nto the question of what to add to this necessary condition in order to\nobtain a sufficient condition. He emphasizes that we typically reason\nwith the intention of producing reasons relevant to some end, and he\nsees this intentional activity as involving the exercise of the\nability to make reason-preserving transitions between sets of thoughts\nor beliefs (or intentions or whatever). A transition is\nreason-preserving if and only if necessarily, if one has reasons for\nthe initial set, then one also does for the subsequent set. Like any\nability, the ability to make reason-preserving transitions may be\nimpaired. Good reasoning consists in an unimpaired exercise of the\nability to make reason-preserving transitions; reasoning--good or\nbad--is an exercise that is not too impaired. As Grice says,\n“[T]o explain what reasoning is (and maybe what the term\n‘reasoning’ means), it is necessary in the first instance\nto specify what good reasoning is, and then to stipulate that\n‘reasoning’ applies to good reasoning and also to\nsequences which approximate, to a given degree, to good reasoning; the\nidea of good reasoning is, in a certain sense, prior to the idea of\nreasoning.” \n\nThere is an important corollary: when we articulate our reasoning\nexplicitly, we are typically not making previously suppressed premises\nexplicit; rather, we are constructing the steps as we supply them.\nSuppose, for example, we were to ask Jill, “Why do you think\nthat follows?” She could answer by saying she thinks that all\nthe English are brave; or that the English are brave when they break\ntheir crowns; or that people of Jack’s age and description are\nbrave provided that they are also English; and so on. In proposing one\nof these alternatives, Jill is not reporting her suppressed\npremise; she is advancing a premise she is willing to put forward now\nas what she would—or, perhaps, should—have thought or said\nthen if the question of formal validity had been raised.\n\nReturning to meaning, why not view utterers and their audiences as\nsimilar to Jill? You say “Jack brandished his clarinet like a\ntomahawk,” and in response I straightaway believe that he did\nbrandish his clarinet in that way. Like Jill, I do not\nentertain—even in a suppressed way—any intervening\npremises. My comprehension is immediate and automatic—unmediated\nby any reasoning at all. But this does not mean that we cannot see me\nas intending there to be a formally valid inference from your words to\nmy belief. Moreover, like Jill, I could construct the missing steps.\nThus: “The utterer has the resultant procedure of uttering\n”He brandished his clarinet like a tomahawk“ intending (1)\nthat the audience believe that the utter believes he brandished his\nclarinet like a tomahawk; (2) that the audience recognize that\nintention (1); and (3) that this recognition be part of the\naudience’s reason for believing that the utterer believes that\nhe brandished his clarinet like a tomahawk. The utterer is following\nthat procedure in a non-deceptive way; hence I should believe, not\nonly that the utterer believes that he brandished his clarinet like a\ntomahawk; but also, to the extent that I have confidence in the\nutterer, I should believe that myself.”\n\nSimilar remarks hold for you as the utterer of “Jack brandished\nhis clarinet like a tomahawk.” You reason: “I recognize\nhim as an English speaker; hence he knows I have the procedure of\nuttering ”Jack brandished his clarinet like a tomahawk“\nintending: (1) that my audience believe he brandished his clarinet\nlike a tomahawk; (2) that the audience recognize that intention (1);\nand (3) that this recognition be part of the audience’s reason\nfor believing that I believe that he brandished his clarinet like a\ntomahawk. He will believe that I am following that procedure here in a\nnon-deceptive way; hence he will believe that I believe that he\nbrandished his clarinet like a tomahawk; and, to the extent that he\nhas confidence in me, he will believe that too.”\n\nThere is no denying that we can describe utterers and audiences in\nthis way. But should we really embrace this description as an\nexplanation of meaning? To see the worry, imagine we are demigods. For\nour amusement, we create a race of creatures. We program language use\ninto their brains. We ensure, for example, that, when an utterer\nproduces the sounds “She brandished her clarinet like a\ntomahawk,” audiences believe that she did. To handle deceptive\ncontexts, figurative language use, language instruction situations,\ntelling jokes, and so on, we also build in heuristics that more or\nless reliably produce a different appropriate belief in such\nsituations. When a creature utters a sentence and the audience forms\nthe appropriate belief, the explanation is our programming,\nprogramming that operates entirely at a physiological level that is\nentirely inaccessible to consciousness. So, even if an audience\nreasons to a belief based on a recognition of relevant utterer’s\nintentions, surely that reasoning is an epiphenomenon of limited\nexplanatory interest. The worry is that we may be like the creatures\nwe have imagined. There is extensive physiological and psychological\nevidence that our use of natural language is to be explained along the\nlines similar to the explanation in the case of our creatures.\n\nGrice’s ‘Meaning Revisited’ contains an answer to\nthis worry. The key idea is that the account of utterers meaning\nspecifies an optimal state that actual utterers rarely if\never realize. We explain this idea then return to our worry. Grice\nsays that,\n\nThe general idea that I want to explore, and which seems to me to have\nsome plausibility, is that something has been left out, by me and\nperhaps by others too, in the analyses, definitions, expansions and so\non, of semantic notions, and particularly various notions of meaning.\nWhat has been left out … [is] the notion of value.\n\n\nThough I think that in general we want to keep value notions out of\nour philosophical and scientific enquiries—and some would say\nout of everything else—we might consider what would happen if we\nrelaxed this prohibition to some extent. If we did, there is a whole\nrange of different kinds of value predicates or expressions which\nmight be admitted in different types of case. To avoid having to\nchoose between them, I am just going to use as a predicate the word\n‘optimal’ the meaning of which could of course be more\nprecisely characterized later (1982, 237).\n\n\nThe analysis of utterers’ meaning illustrates what Grice has in\nmind. He suggests that, “[a]s a first approximation, what we\nmean by saying that a speaker, by something he says, on a particular\noccasion, means that \\(p\\), is that he is in the optimal state with\nrespect to communicating, or if you like, to communicating that\n\\(p\\)” (1982, 242). The optimal state is what the analysis of\nutterers’ meaning specifies.\n\nThe point is that there is no need to insist that real utterers\ntypically have all the intentions the analysis requires. We\nnonetheless, for purposes of psychological explanation, often regard\nthem to have the requisite intentions. For Grice, audiences do so when\nthey need to justify the actions and beliefs that result from\nutterances in their presence. For example, as a result of reading the\nlast sentence, you believe that we believe that audiences regard\nutterers as having the intentions specified in the account of\nutterers’ meaning when audiences are called upon to justify the\nbeliefs and actions they form in response to utterances. Why are you\njustified in believing this? Because you recognized that we uttered\nthe sentence intending, by means of recognition of that very\nintention, to produce that belief. Similar remarks hold for us as\nutterers. Why are we justified in thinking that you will form a\njustified belief in response to our utterance? Because we\nknow that you can supply the justification in terms of your knowledge\nof our intentions.\n\nThis pattern of justifications also yields an explanation. The\njustifications explain by showing that meaning and response are\ninstances of people’s capacity to act rationally. Such instances\ninclude actions one engaged in without prior reasoning, and which one\nwould have also engaged in if one had reasoned about whether to do so\nprior to acting. The appeal to such counterfactuals is explanatory to\nthe extent that speakers and audiences meet this condition: for a wide\nrange of cases of speaker meaning, speakers reliably make utterances\nand audiences reliably respond without reasoning in (more or less)\nways they would have if they had reasoned with sufficient time,\ninsight, and attention. Thus, the Gricean theory of meaning does\nexplain meaning as a rational activity. Grice’s treatment of\nconversational implicature also illustrates the breadth and power of\nthis approach. Our demi-god example ignored this connection between\nexplanation and justification.\n\nA further objection to Grice’s account of meaning is that young\nchildren understand the meaning of utterances but are not capable of\nprocessing the complexities apparently required by Gricean theory.\nThompson (2007, 2008) provides one approach to defend a (neo)Gricean\naccount against these arguments.\n\nGrice’s treatment of conversational implicature illustrates the\nbreadth and power of this approach. Indeed, one of the motivations\nGrice had in giving an account of meaning was to distinguish between\nwhat is meant—M-intended—and what is not\nM-intended but implied. Grice’s conversational maxims\nare principles of rational communication that audiences use to\nconstruct an inferential bridge from what is meant to what is\nimplied.\n\nThe continuing lively debates (e.g., Petrus 2010) about conversational\nimplicatures and meaning, which are present in linguistics and\nartificial intelligence as well as philosophy, are testimony to the\ncontinuing importance of Grice’s seminal ideas.\n6. Everyday Psychological Explanation\n\nGrice’s views on everyday psychological explanation are\nintertwined with his views on rationality. Grice contends that the\nright picture of rationality is the picture, given us by Plato and\nAristotle and others, as something which essentially functions to\nregulate, direct, and control pre-rational impulses, inclinations, and\ndispositions. Both everyday psychological explanation and assessments\nof rationality employ commonsense psychological principles. By such\nprinciples we mean a relatively stable body of generally-accepted\nprinciples, of which the following are examples:\n\nIf a person desires \\(p\\), and believes if \\(p\\) then \\(q\\),\nthen—other things being equal—the person will desire\n\\(q\\).\nIf a person desires \\(p\\) and desires \\(q\\), then—other\nthings being equal—the person will act on the stronger of the\ntwo desires if the person acts on either.\nIf a person stares at a colored surface and subsequently stares at\na white surface, then—other things being equal—the person\nwill have an after-image.\n\n\nThese examples express relations among complexes consisting of\npsychological states and behavior, and, as such they serve a\ndescriptive and explanatory function. Other principles play a more\nevaluative role. Consider for example:\n\nIf a person believes \\(p\\) and that \\(p\\) entails \\(q\\), and the\nperson believes not-\\(q\\), then, other things being equal, the person\nshould stop believing \\(p\\) or stop believing \\(q\\).\n\n\nConformity to this principle is a criterion of rationality. The\ndescriptive-explanatory and evaluative principles collectively give us\nis a specification of how “pre-rational, impulses, inclinations,\nand dispositions” operate as well as a basis for evaluating that\noperation.\n\nThe essential point for our purposes is that everyday psychology has\nspecial status for Grice. He argues:\n\nThe psychological theory which I envisage would be deficient as a\ntheory to explain behaviour if it did not contain provision for\ninterests in the ascription of psychological states otherwise than as\ntools for explaining and predicting behaviour, interests (for example)\non the part of one creature to be able to ascribe these rather than\nthose psychological states to another creature because of a concern\nfor the other creature. Within such a theory it should be possible to\nderive strong motivations on the part of the creatures subject to the\ntheory against the abandonment of the central concepts of the theory\n(and so of the theory itself), motivations which the creatures would\n(or should) regard as justified. Indeed, only from within the\nframework of such a theory, I think, can matters of evaluation, and\nso, of the evaluation of modes of explanation, be raised at all. If I\nconjecture aright, then, the entrenched system contains the materials\nneeded to justify its own entrenchment; whereas no rival system\ncontains a basis for the justification of anything at all (1975b, 52).\n\n\nThus, while everyday psychology (or some preferred part of it) may not\nentirely accurately specify how in fact we think and act, it does\nspecify how we ought to think and act.\n\nAssume everyday psychology is uniquely self-justifying in the way\nGrice suggests; then we must reject the suggestion that everyday\npsychology is just a rough and ready theory that we will (or could)\neventually abandon without loss in favor of a more accurate and\ncomplete scientific theory of behavior. Grice objects on this ground\nto theories that regard only scientific knowledge as truly descriptive\nand explanatory and that relegate commonsense psychological\nexplanation to a second-class role as a theory, useful in daily life,\nbut not a theory we should endorse as a description or explanation of\nreality. Grice remarks:\n\nWe must be ever watchful against the Devil of scientism, who would\nlead us into myopic overconcentration on the nature and importance of\nknowledge, and of scientific knowledge in particular; the Devil who is\neven so audacious as to tempt us to call in question the very system\nof ideas require to make intelligible the idea of calling in question\nanything at all; and who would even prompt us, in effect, to suggest\nthat since we do not really think but only think that we think, we had\nbetter change our minds without undue delay (1975b, 53).\n\n\nThus, to return briefly to the theory of meaning, the picture that\ntheory offers of ourselves as rational communicators producing\njustified psychological attitudes in each other is no mere accident,\nno explanatory way station to be abandoned as science progresses. It\nis an ineliminable feature of the way in which we understand ourselves\nand others. In addition to this result, Grice’s view of\npsychological explanation also yield consequences both for ontology\nand for ethics.\n7. Ontology\n\nGrice’s ontological views are liberal. As Grice says when\ncommenting on the mind—body problem in ‘Method in\nPhilosophical Psychology’,\n\nI am not greatly enamoured of some of the motivations which prompt the\nadvocacy of psychophysical identifications; I have in mind a concern\nto exclude such ‘queer’ or ‘mysterious’\nentities as souls, purely mental events, purely mental properties and\nso forth. My taste is for keeping open house for all sorts of\nconditions of entities, just so long as when they come in they help\nwith the housework. Provided that I can see them work, and provided\nthat they are not detected in illicit logical behaviour (within which\nI do not include a certain degree of indeterminacy, not even of\nnumerical indeterminacy), I do not find them queer or mysterious at\nall…. To fangle a new ontological Marxism, they work\ntherefore they exist, even though only some, perhaps those who\ncome on the recommendation of some form of transcendental argument,\nmay qualify for the specially favoured status of entia\nrealissima. To exclude honest working entities seems to me like\nmetaphysical snobbery, a reluctance to be seen in the company of any\nbut the best objects (1975, 30–31).\n\n\nOur discussion of psychological explanation shows what Grice had in\nmind in his reference to entities that “come on the\nrecommendation of some form of transcendental argument, [and hence]\nmay qualify for the specially favoured status of entia\nrealissima.” Suppose—as Grice thinks—certain\nway of thinking, certain categories, are part of what is\nentrenched. Then there are certain concepts or categories that we\ncannot avoid applying to reality.\n\nThis theme will not be pursued further here; rather, we turn to the\nmore “Marxist” side of Grice’s ontology: the claim\nthat if entities work, they exist. We illustrate this point with the\nconcept of a proposition. The critical role of that notion in\nGrice’s theory of meaning motivates our focus on it. Quinean\ncriticisms of the notion have placed under it under a cloud of\nsuspicion, a cloud many see as hanging ominously over Grice’s\ntheory.\n\nOne of Quine’s arguments is that synonymy is not a well-defined\nequivalence relation, the identity conditions for propositions are\nunclear and there is ‘no entity without identity’. On this\nissue, Grice is not committed to an equivalence relation of synonymy\n(thus his remark above about indeterminacy), and he parts company with\nQuine over whether clear identity conditions are required. Grice, as\nnoted earlier, argues for such conditions. But the acceptability of\nhis theory of meaning does not depend on the success of that defense.\nWithin the theory of meaning, propositions are theoretical entities to\nbe understood by the role in the theory, and that role, according to\nGrice, does not demand a strict criterion of identity. Rather: if they\nwork they exist. It is worth noting in this regard that there are many\nrespectable entities for which we do not have criteria or identity.\nSuppose my favorite restaurant moves. Is it a new restaurant with the\nsame name? Or suppose it changes owners and names but nothing else? Or\nthat it changes menu entirely? Or that it changes chefs? It would be\nfoolish to look for a single criterion to answer these\nquestions—the answers go different ways in different contexts.\nBut surely the concept of a restaurant is a useful one and restaurants\ndo exists. Quine and Grice differ on the theoretical usefulness of\npropositions. The main reason for disagreement is due to Quine’s\nattitude that concepts such as belief and desire are of, at most,\nsecondary importance in the unified canonical science that is his\nstandard for ontology. Grice, as we have already noted, thinks that\neveryday psychological theory is of first importance.\n8. Ordinary Language Philosophy\n\nGrice was constantly concerned with philosophical methodology, and the\ndiscussion so far omits one important methodological focus: ordinary\nlanguage philosophy. Although it was by no means Grice’s sole\nphilosophical commitment, it was a central one. \n\nGrice is a well-known critic of ordinary language philosophy,\nand one of his main targets was J. L. Austin and a style of reasoning\nhe popularized. Austin thought there was a relatively clear notion of\nwhat it is inappropriate to say, and that we could delineate\ntruth-conditions by identifying instances of inappropriateness\n(Warner, 2012). For example, he inferred from (1) “Typically,\nwhen one acts, it would be inappropriate to say either that one acted\nvoluntarily or that one acted involuntarily” to (2)\n“Typically, when one acts, one acts neither voluntarily nor\ninvoluntarily.” As Grice convincingly argues, the inference\nfails because being untrue is not the only form of inappropriateness.\nSomething may be true but inappropriate to say for other reasons\n(Grice 1960, 1975, 1981, 1989). \n\nGrice was, however, also a life-long practitioner of ordinary language\nphilosophy. He begins the “Prolegomena” to Studies in\nthe Way of Words by noting that “some may regard [ordinary\nlanguage philosophy] as an outdated style of philosophy,” but he\nurges us “not to be too quick to write off such a style.”\nInstead, he urges us to build “a theory which will enable one to\ndistinguish between the case in which an utterance is false or fails\nto be true, or more generally fails to correspond to the world in some\nfavored way, and the case in which it is inappropriate for reasons of\na different kind” (Grice 1989, 4). Much of Studies in the\nWay of Words addresses this task. \n\nWhy bother to build such a theory? There are many possible answers,\nand Grice would no doubt have given more than one, but we focus on\njust one answer, which is implicit in this work. Recall that, on his\nview, commonsense psychology consists, at least in part, of a body of\nself-justifying descriptive, explanatory, and evaluative principles.\nThe principles are ‘self-justifying’ in the sense\nexplained earlier in section 6. An illuminating description of these\nprinciples would be an illuminating description of how we think, and\nsuch a description would certainly be of interest. How do we get one?\nBy carefully examining what we say. Two tenets of ordinary language\nphilosophy were that a clear view of what we mean in the\nlanguage we use is a clear view of what we think, and that a\nnecessary step in getting clear view of what we mean is close\nattention to the details of what we say. But the detailed\nexamination will only reveal what we mean if we can reliably\ndistinguish between “the case in which an utterance is false or\nfails to be true, or more generally fails to correspond to the world\nin some favored way, and the case in which it is inappropriate for\nreasons of a different kind.” \n9. Ethics\n\nGrice uses this general account of reasoning to investigate moral\nreasoning and moral reasons. He emphasizes the connections between\nreasons, actions, and freedom. It is convenient to divide\nGrice’s approach into two stages (although he himself does not\ndo so). The first stage argues that one must regard the exercise of\nrationality in the free adoption and pursuit of ends as an\nunrelativized good at which all persons should aim. The second stage\nexamines the concepts of happiness and freedom to discover principles\nwhich persons—conceived of as rationally adopting and pursuing\nends—must adopt insofar as they are to qualify as rational.\n\nThe first stage. Why think that one must regard the exercise\nof rationality in the free adoption and pursuit of ends as an\nunrelativized good at which all persons should aim? To begin with,\nwhat does Grice mean by an “unrelativized good”? Grice\ngrants that the concept of unrelativized value requires defense; after\nall, things have value only relative to ends and beneficiaries. So how\nis unrelativized value to be understood? Grice defines unrelativized\nvalue “in Aristotelian style [as] whatever would seem to possess\nsuch value in the eyes of a duly accredited judge; and a duly\naccredited judge might be identifiable as a good person operating in\nconditions of freedom.” (Of course, this is still to talk about\nwhat is of value for and to persons; the point is to avoid\nrelativization to this or that kind of person or\nkind of end.) So, why would a duly accredited judge see value\nin the free rational adoption and pursuit of ends, where such value is\nnot ascribed because of the contribution that activity makes\nto some other end?\n\nGrice’s views on commonsense psychology provide the answer. As\nnoted earlier, Grice thinks that commonsense psychology exhibits two\nfeatures: parts of it are self-justifying; and, it contains principles\nfor evaluating thought and action, where some of those principles are\nself-justifying. When he turns to ethics, Grice adds that commonsense\npsychology represents us as exercising rationality in freely adopting\nand pursuing ends; moreover, this view of ourselves is self-justifying\nin the sense that we cannot coherently conceive of ourselves in any\nother way. Grice’s—very plausible—claim is that a\n“duly accredited judge” operating from within the theory\nof commonsense psychology would take the rational, free adoption and\npursuit of ends as having unrelativized value. Hence, it does have\nsuch value.\n\nThe second stage: What principles must a free adopter and\npursuer of ends embrace in order to qualify as rational? Grice\naddresses this question most fully in Aspects of Reason and\nThe Conception of Value. The idea is that the combined\nrequirements of rationality (outside ethics), freedom, and happiness\nimpose substantive constraints on all persons. Grice develops this\ntheme with great insight and subtlety; however, he did not complete\nthe project, and the intricacies of his views are best left to the\ndetail of his own works.\n10. Conclusion\n\nThe sophistication and inventiveness of Grice’s work is\nwell-known. What is less well-known is its ambitious and systematic\nnature. Emphasizing this latter aspect has been one goal of this brief\npresentation of Grice’s work, work which weaves meaning,\nreasoning, psychology, ontology, and value into a complex, unified\nwhole.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<h4>Books By Grice</h4>\n<ul class=\"hanging\">",
                "1989, <em>Studies in the Way of Words</em> (<strong>SWW</strong>),\nCambridge MA: Harvard University Press; a collection including most of\nthe important works published during his lifetime.",
                "1991, <em>The Conception of Value</em>, New York: Oxford\nUniversity Press; a posthumous publication of the John Locke Lectures,\ndelivered in 1979.",
                "2001, <em>Aspects of Reason</em> (ed. Richard Warner), Oxford:\nOxford University Press; a posthumously published book exploring the\nnature of reasons and reasoning.\n</ul>\n<h4>Selected Articles By Grice</h4>\n<ul class=\"hanging\">",
                "1957, (with P F Strawson), ‘In Defence Of A Dogma’,\n<em>Philosophical Review</em>, 65: 141–58; reprinted in\nSWW.",
                "1957, ‘Meaning’, <em>The Philosophical Review</em>,\n66: 377–88; reprinted in SWW.",
                "1961, ‘The Causal Theory of Perception’,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 35: 121–52; reprinted in SWW.",
                "1968, ‘Utterer’s Meaning, Sentence Meaning, and\nWord-Meaning’, <em>Foundations of Language</em>, 4: 225-42;\nreprinted in SWW.",
                "1969, ‘Utterer’s Meaning and Intentions’, The\nPhilosophical Review, 68: 147–77; reprinted in SWW.",
                "1971, ‘Intention and Uncertainty’, <em>Proceedings of\nthe British Academy</em>, 57: 263–79.",
                "1975, ‘Logic and Conversation’, in <em>The Logic of\nGrammar</em>, D. Davidson and G. Harman (eds.), Encino, CA: Dickenson,\n64–75; reprinted in SWW.",
                "1975b, ‘Method in Philosophical psychology (From the Banal\nto the Bizarre)’, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 48: 23–53.",
                "1978, ‘Further Notes on Logic and Conversation’, in\n<em>Syntax and Semantics: Pragmatics</em>, v 9, P. Cole (ed.), New\nYork: Academic Press, 183–97; reprinted in SWW.",
                "1981, ‘Presupposition and Conversational Implicature’,\nin <em>Radical Pragmatics</em>, P. Cole (ed.), New York: Academic\nPress, 183–97.",
                "1982, ‘Meaning Revisited’, in <em>Mutual\nKnowledge</em>, N.V. Smith (ed.), New York: Academic Press,\n223–43; reprinted in SWW.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<h4>Books On Grice</h4>\n<ul class=\"hanging\">",
                "Atlas, J. D., 2005, <em>Logic, Logic, Meaning and Conversation:\nSemantical Underdeterminancy, Implicature, and their Interface</em>,\nOxford: Oxford University Press.",
                "Avramides, A., 1989, <em>Meaning and Mind: An Examination of a\nGricean Account of Language</em>, Cambridge, MA: MIT Press.",
                "Bardzokas, V., 2010, <em>Causality and Connectives: From Grice to\nRelevance</em>, Amsterdam: Benjamins Publishing Co.",
                "Chapman, S., 2007, <em>Paul Grice, Philosopher and Linguist</em>,\nLondon: Palgrave Macmillan.",
                "Cosenza, G. (ed.), 2001, <em>Paul Grice’s Heritage</em>,\nTurnhout: Brepols.",
                "Davis, W. 1998, <em>Implicature: Intention, Convention, and\nPrinciple in the Failure of Gricean Theory</em>, Cambridge: Cambridge\nUniversity Press.",
                "Grandy, R., and R. Warner, 1986, <em>Philosophical Grounds of\nRationality: Intentions, Categories, Ends</em>, Oxford: Oxford\nUniversity Press. (A festschrift celebrating Grice’s work, with\na lengthy editorial introduction and a response by Grice.)",
                "Korta, K., and J. Perry, 2011, <em>Critical Pragmatics: An\ninquiry into Reference and Communication</em>, Cambridge University\nPress, Cambridge",
                "Lepore, E., and M. Stone, 2015, <em>Imagination and Convention:\nDistinguishing Grammar and Inference in Language </em>, Oxford\nUniversity Press.",
                "Petrus, K, (ed.), 2010, <em>Meaning and Analysis: New Essays on\nGrice</em>, Hampshire, England: Palgrave Studies in Pragmatics,\nLanguage, and Cognition.",
                "Recanati, F., 2010, <em>Truth-conditional Pragmatics</em>,\nOxford University Press, Oxford.\n</ul>\n<h4>Articles On Grice</h4>\n<ul class=\"hanging\">",
                "Bach, K., 1997 “The Semantics Pragmatics Distinction: What\nit is and Why it Matters”, in K. Turner (ed.), <em>The\nSemantics-Pragmatics Interface From Different Points of View</em>.\nAmsterdam: Elsevier, 65–84.",
                "Baker, J., 1989, “The metaphysical construction of\nvalue”, <em>Journal of Philosophy</em>, 10: 505–13.",
                "Davis, W. 2007, “Grice’s Meaning Project”,\n<em>Journal of Pragmatics</em>, 26: 41–58.",
                "Davies, M., 1996, “The Philosophy of Language”, in\n<em>The Blackwells Companion to Philosophy</em>, N. Bunin\nand E. Tsui-James (eds.), Oxford: Blackwell.",
                "Grandy, R. E., 1989, “On Grice on language”,\n<em>Journal of Philosophy</em>, 10: 514–25.",
                "Grim, P., 2011, “Simulating Grice: emergent pragmatics in\nspatialized game theory”, in <em>Language, Games, and\nEvolution</em>, edited by A. Benz, C. Ebert, G, Jager, and R. van\nRooij, Berlin, Heidelberg: Springer Verlag.",
                "Hazlett, A., 2007, “Grice’s razor”,\n<em>Metaphilosophy</em>, 38: 669–690.",
                "Horn, L., 2006, “The Border Wars–A Neo-Gricean\nPerspective”, von Heusinger, K. and K. Turner (editors),\n<em>Where Semantics Meets Pragmatics</em> (Current Research in the\nSemantics/Pragmatics Interface: Volume 16), Amsterdam: Elsevier,\n21–48.",
                "Luhti, D., 2006, “How implicatures make Grice an unordinary\nordinary language philosopher”, <em>Pragmatics</em>, 16:\n247–274.",
                "Neale, S, 1992, “Paul Grice and the philosophy of\nlanguage”, <em>Linguistics and Philosophy</em>, 15:\n509–559.",
                "Potts, C., 2006, “Review: <em>Paul Grice: Philosopher and\nLinguist</em>”, <em>Mind</em>, 115: 743–747.",
                "Searle, J., 2007, “Grice on meaning: 50 years later”,\n<em>Teorema</em>, 26: 9–18.",
                "Soames, S., 2003, “Language use and the logic of\nconversation”, (Ch. 9 of <em>Philosophical Analysis in the\nTwentieth Century</em> (Volume 2: <em>The Age of Meaning</em>), Princeton:\nPrinceton University Press 197–218.",
                "Stalnaker, R., 1989, “On Grandy on Grice”, <em>Journal\nof Philosophy</em>, 10: 525–8.",
                "Strawson, P. F., 1964, “Intention and convention in speech\nacts”, <em>Philosophical Review</em>, 73: 439–60.",
                "Thompson, R., 2007, “Still relevant: H. P. Grice’s\nlegacy” in “Psycholinguists and the philosophy of\nlanguage”, <em>Teorema</em>, 26: 77–109.",
                "–––, 2007, “Grades of Meaning,”\n<em>Synthese</em>, 161: 283–308.",
                "Warner, R., 1989, “Reply to Baker and Grandy”,\n<em>Journal of Philosophy</em>, 10: 528–9",
                "–––, 2013, “Austin, J. L.”,\n<em>International Encyclopedia of Ethics</em>, H.\nLaFollette (ed.), Malden, MA: Wiley-Blackwell.",
                "Ziff, P., 1967, “On H. P. Grice’s Account of\nMeaning”, <em>Analysis</em>, 28: 1–8.\n</ul>\n<h4>Books Developing a (more or less) Gricean account of meaning</h4>\n<ul class=\"hanging\">",
                "Bennett, J., 1976, <em>Linguistic Behaviour</em>, Cambridge:\nCambridge University Press.",
                "Loar, B., 1981, <em>Mind and Meaning</em>, Cambridge: Cambridge\nUniversity Press.",
                "Schiffer, S., 1972, <em>Meaning</em>, Oxford: Oxford University\nPress.",
                "Wilson, D., and Sperber, D., 2012, <em>Meaning and Relevance</em>,\nNew York: Cambridge University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<h4>Books By Grice</h4>\n<ul class=\"hanging\">\n<li>1989, <em>Studies in the Way of Words</em> (<strong>SWW</strong>),\nCambridge MA: Harvard University Press; a collection including most of\nthe important works published during his lifetime.</li>\n<li>1991, <em>The Conception of Value</em>, New York: Oxford\nUniversity Press; a posthumous publication of the John Locke Lectures,\ndelivered in 1979.</li>\n<li>2001, <em>Aspects of Reason</em> (ed. Richard Warner), Oxford:\nOxford University Press; a posthumously published book exploring the\nnature of reasons and reasoning.</li>\n</ul>\n<h4>Selected Articles By Grice</h4>\n<ul class=\"hanging\">\n<li>1957, (with P F Strawson), ‘In Defence Of A Dogma’,\n<em>Philosophical Review</em>, 65: 141–58; reprinted in\nSWW.</li>\n<li>1957, ‘Meaning’, <em>The Philosophical Review</em>,\n66: 377–88; reprinted in SWW.</li>\n<li>1961, ‘The Causal Theory of Perception’,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 35: 121–52; reprinted in SWW.</li>\n<li>1968, ‘Utterer’s Meaning, Sentence Meaning, and\nWord-Meaning’, <em>Foundations of Language</em>, 4: 225-42;\nreprinted in SWW.</li>\n<li>1969, ‘Utterer’s Meaning and Intentions’, The\nPhilosophical Review, 68: 147–77; reprinted in SWW.</li>\n<li>1971, ‘Intention and Uncertainty’, <em>Proceedings of\nthe British Academy</em>, 57: 263–79.</li>\n<li>1975, ‘Logic and Conversation’, in <em>The Logic of\nGrammar</em>, D. Davidson and G. Harman (eds.), Encino, CA: Dickenson,\n64–75; reprinted in SWW.</li>\n<li>1975b, ‘Method in Philosophical psychology (From the Banal\nto the Bizarre)’, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 48: 23–53.</li>\n<li>1978, ‘Further Notes on Logic and Conversation’, in\n<em>Syntax and Semantics: Pragmatics</em>, v 9, P. Cole (ed.), New\nYork: Academic Press, 183–97; reprinted in SWW.</li>\n<li>1981, ‘Presupposition and Conversational Implicature’,\nin <em>Radical Pragmatics</em>, P. Cole (ed.), New York: Academic\nPress, 183–97.</li>\n<li>1982, ‘Meaning Revisited’, in <em>Mutual\nKnowledge</em>, N.V. Smith (ed.), New York: Academic Press,\n223–43; reprinted in SWW.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<h4>Books On Grice</h4>\n<ul class=\"hanging\">\n<li>Atlas, J. D., 2005, <em>Logic, Logic, Meaning and Conversation:\nSemantical Underdeterminancy, Implicature, and their Interface</em>,\nOxford: Oxford University Press.</li>\n<li>Avramides, A., 1989, <em>Meaning and Mind: An Examination of a\nGricean Account of Language</em>, Cambridge, MA: MIT Press.</li>\n<li>Bardzokas, V., 2010, <em>Causality and Connectives: From Grice to\nRelevance</em>, Amsterdam: Benjamins Publishing Co.</li>\n<li>Chapman, S., 2007, <em>Paul Grice, Philosopher and Linguist</em>,\nLondon: Palgrave Macmillan.</li>\n<li>Cosenza, G. (ed.), 2001, <em>Paul Grice’s Heritage</em>,\nTurnhout: Brepols.</li>\n<li>Davis, W. 1998, <em>Implicature: Intention, Convention, and\nPrinciple in the Failure of Gricean Theory</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Grandy, R., and R. Warner, 1986, <em>Philosophical Grounds of\nRationality: Intentions, Categories, Ends</em>, Oxford: Oxford\nUniversity Press. (A festschrift celebrating Grice’s work, with\na lengthy editorial introduction and a response by Grice.)</li>\n<li>Korta, K., and J. Perry, 2011, <em>Critical Pragmatics: An\ninquiry into Reference and Communication</em>, Cambridge University\nPress, Cambridge</li>\n<li>Lepore, E., and M. Stone, 2015, <em>Imagination and Convention:\nDistinguishing Grammar and Inference in Language </em>, Oxford\nUniversity Press.</li>\n<li>Petrus, K, (ed.), 2010, <em>Meaning and Analysis: New Essays on\nGrice</em>, Hampshire, England: Palgrave Studies in Pragmatics,\nLanguage, and Cognition.</li>\n<li>Recanati, F., 2010, <em>Truth-conditional Pragmatics</em>,\nOxford University Press, Oxford.</li>\n</ul>\n<h4>Articles On Grice</h4>\n<ul class=\"hanging\">\n<li>Bach, K., 1997 “The Semantics Pragmatics Distinction: What\nit is and Why it Matters”, in K. Turner (ed.), <em>The\nSemantics-Pragmatics Interface From Different Points of View</em>.\nAmsterdam: Elsevier, 65–84. </li>\n<li>Baker, J., 1989, “The metaphysical construction of\nvalue”, <em>Journal of Philosophy</em>, 10: 505–13.</li>\n<li>Davis, W. 2007, “Grice’s Meaning Project”,\n<em>Journal of Pragmatics</em>, 26: 41–58.</li>\n<li>Davies, M., 1996, “The Philosophy of Language”, in\n<em>The Blackwells Companion to Philosophy</em>, N. Bunin\nand E. Tsui-James (eds.), Oxford: Blackwell.</li>\n<li>Grandy, R. E., 1989, “On Grice on language”,\n<em>Journal of Philosophy</em>, 10: 514–25.</li>\n<li>Grim, P., 2011, “Simulating Grice: emergent pragmatics in\nspatialized game theory”, in <em>Language, Games, and\nEvolution</em>, edited by A. Benz, C. Ebert, G, Jager, and R. van\nRooij, Berlin, Heidelberg: Springer Verlag.</li>\n<li>Hazlett, A., 2007, “Grice’s razor”,\n<em>Metaphilosophy</em>, 38: 669–690.</li>\n<li>Horn, L., 2006, “The Border Wars–A Neo-Gricean\nPerspective”, von Heusinger, K. and K. Turner (editors),\n<em>Where Semantics Meets Pragmatics</em> (Current Research in the\nSemantics/Pragmatics Interface: Volume 16), Amsterdam: Elsevier,\n21–48.</li>\n<li>Luhti, D., 2006, “How implicatures make Grice an unordinary\nordinary language philosopher”, <em>Pragmatics</em>, 16:\n247–274.</li>\n<li>Neale, S, 1992, “Paul Grice and the philosophy of\nlanguage”, <em>Linguistics and Philosophy</em>, 15:\n509–559.</li>\n<li>Potts, C., 2006, “Review: <em>Paul Grice: Philosopher and\nLinguist</em>”, <em>Mind</em>, 115: 743–747.</li>\n<li>Searle, J., 2007, “Grice on meaning: 50 years later”,\n<em>Teorema</em>, 26: 9–18.</li>\n<li>Soames, S., 2003, “Language use and the logic of\nconversation”, (Ch. 9 of <em>Philosophical Analysis in the\nTwentieth Century</em> (Volume 2: <em>The Age of Meaning</em>), Princeton:\nPrinceton University Press 197–218.</li>\n<li>Stalnaker, R., 1989, “On Grandy on Grice”, <em>Journal\nof Philosophy</em>, 10: 525–8.</li>\n<li>Strawson, P. F., 1964, “Intention and convention in speech\nacts”, <em>Philosophical Review</em>, 73: 439–60.</li>\n<li>Thompson, R., 2007, “Still relevant: H. P. Grice’s\nlegacy” in “Psycholinguists and the philosophy of\nlanguage”, <em>Teorema</em>, 26: 77–109.</li>\n<li>–––, 2007, “Grades of Meaning,”\n<em>Synthese</em>, 161: 283–308.</li>\n<li>Warner, R., 1989, “Reply to Baker and Grandy”,\n<em>Journal of Philosophy</em>, 10: 528–9</li>\n<li>–––, 2013, “Austin, J. L.”,\n<em>International Encyclopedia of Ethics</em>, H.\nLaFollette (ed.), Malden, MA: Wiley-Blackwell.</li>\n<li>Ziff, P., 1967, “On H. P. Grice’s Account of\nMeaning”, <em>Analysis</em>, 28: 1–8.</li>\n</ul>\n<h4>Books Developing a (more or less) Gricean account of meaning</h4>\n<ul class=\"hanging\">\n<li>Bennett, J., 1976, <em>Linguistic Behaviour</em>, Cambridge:\nCambridge University Press.</li>\n<li>Loar, B., 1981, <em>Mind and Meaning</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Schiffer, S., 1972, <em>Meaning</em>, Oxford: Oxford University\nPress.</li>\n<li>Wilson, D., and Sperber, D., 2012, <em>Meaning and Relevance</em>,\nNew York: Cambridge University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "analytic/synthetic distinction",
            "assertion",
            "conditionals",
            "descriptions",
            "disjunction",
            "implicature",
            "meaning, theories of",
            "pragmatics"
        ],
        "entry_link": [
            {
                "../analytic-synthetic/": "analytic/synthetic distinction"
            },
            {
                "../assertion/": "assertion"
            },
            {
                "../conditionals/": "conditionals"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../disjunction/": "disjunction"
            },
            {
                "../implicature/": "implicature"
            },
            {
                "../meaning/": "meaning, theories of"
            },
            {
                "../pragmatics/": "pragmatics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grice\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/grice/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=grice&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/grice/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grice": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/grice/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=grice&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/grice/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}