{
    "url": "hempel",
    "title": "Carl Hempel",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "James Fetzer\n<jfetzer@d.umn.edu>",
        "author_links": [
            {
                "http://www.d.umn.edu/~jfetzer/": "James Fetzer"
            },
            {
                "mailto:jfetzer%40d%2eumn%2eedu": "jfetzer@d.umn.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.d.umn.edu/~jfetzer/\" target=\"other\">James Fetzer</a>\n&lt;<a href=\"mailto:jfetzer%40d%2eumn%2eedu\"><em>jfetzer<abbr title=\" at \">@</abbr>d<abbr title=\" dot \">.</abbr>umn<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Sep 10, 2010",
        "substantive revision Thu Jul 7, 2022"
    ],
    "preamble": "\n\nCarl G. Hempel (1905–1997) was the principal proponent of the\n“covering law” theory of explanation and the paradoxes of\nconfirmation as basic elements of the theory of science. A master of\nphilosophical methodology, Hempel pursued explications of initially\nvague and ambiguous concepts, which were required to satisfy very\nspecific criteria of adequacy. With Rudolf Carnap and Hans\nReichenbach, he was instrumental in the transformation of the dominant\nphilosophical movement of the 1930s and 40s, which was known as\n“logical positivism”, into the more nuanced position known\nas “logical empiricism”. His studies of induction,\nexplanation, and rationality in science exerted a profound influence\nupon more than a generation of philosophers of science, many of whom\nbecame leaders of the discipline in their own right.\n",
    "toc": [
        {
            "#BiogSket": "1. Biographical Sketch"
        },
        {
            "#CritLogiPosi": "2. The Critique of Logical Positivism"
        },
        {
            "#AnalDist": "2.1 The Analytic/Synthetic Distinction"
        },
        {
            "#QuinComp": "2.1.1 Quine’s Complaints"
        },
        {
            "#HempConc": "2.1.2 Hempel’s Concerns"
        },
        {
            "#InteMeth": "2.1.3 Intensional Methodology"
        },
        {
            "#ObseDist": "2.2 The Observational/Theoretical Distinction"
        },
        {
            "#VeriCritCognSign": "2.3 The Verifiability Criterion of Cognitive Significance"
        },
        {
            "#ScieReas": "3. Scientific Reasoning"
        },
        {
            "#ParaConf": "3.1 The Paradox of Confirmation"
        },
        {
            "#EquiCond": "3.2 The Equivalence Condition"
        },
        {
            "#LimiExte": "3.3 The Limits of Extensionality"
        },
        {
            "#ScieExpl": "4. Scientific Explanations "
        },
        {
            "#SemiFormExpl": "4.1 The Semi-Formal Explication"
        },
        {
            "#OntiVsEpisConc": "4.2 Ontic vs. Epistemic Conceptions"
        },
        {
            "#ProbLawl": "4.3 The Problem of Lawlikeness"
        },
        {
            "#ExplPredRetr": "5. Explanation, Prediction, Retrodiction"
        },
        {
            "#SymmThes": "5.1 The Symmetry Thesis"
        },
        {
            "#ParaExpl": "5.2 The Paradoxes of Explanation"
        },
        {
            "#InduStatExpl": "6. Inductive-Statistical Explanation"
        },
        {
            "#RequMaxiSpec": "6.1 The Requirement of Maximal Specificity"
        },
        {
            "#StatReleVsCausRele": "6.2 Statistical Relevance vs. Causal Relevance"
        },
        {
            "#ReviHempCritAdeq": "6.3 Revising Hempel’s Criteria of Adequacy"
        },
        {
            "#ProbProv": "7. The Problem of Provisos"
        },
        {
            "#ReflRati": "8. Reflections on Rationality"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSourWorkHemp": "Primary Sources: Works by Hempel"
        },
        {
            "#PrimSourCoauWork": "Primary Sources: Coauthored Works"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Biographical Sketch\n\nCarl G(ustav) Hempel (1905–97), known as “Peter” to\nhis friends, was born near Berlin, Germany, on January 8, 1905. He\nstudied philosophy, physics and mathematics at the Universities of\nGöttingen and Heidelberg before coming to the University of\nBerlin in 1925, where he studied with Hans Reichenbach. Impressed by\nthe work of David Hilbert and Paul Bernays on the foundations of\nmathematics and introduced to the studies of Rudolf Carnap by\nReichenbach, Hempel came to believe that the application of symbolic\nlogic held the key to resolving a broad range of problems in\nphilosophy, including that of separating genuine problems from merely\napparent ones. Hempel’s commitment to rigorous explications of\nthe nature of cognitive significance, of scientific explanation, and\nof scientific rationality would become the hallmark of his research,\nwhich exerted great influence on professional philosophers, especially\nduring the middle decades of the 20th Century.\n\nIn 1929, at Reichenbach’s suggestion, Hempel spent the fall\nsemester at the University of Vienna, where he studied with Carnap,\nMoritz Schlick, and Frederick Waismann, who were advocates of logical\npositivism and members of (what came to be known as) “the Vienna\nCircle”. It would fall to Hempel to become perhaps the most\nastute critic of that movement and to contribute to its refinement as\nlogical empiricism. As Hitler increased his power in Germany, Hempel,\nwho was not Jewish but did not support the Nazi regime, moved to\nBrussels and began collaborating with Paul Oppenheim, which would\nresult in several classic papers, including “Studies in the\nLogic of Explanation”, which appeared in 1948 (Rescher 2005:\nChs. 8 and 9). Hempel would also visit the United States\ntwice—the University of Chicago in 1937–38 and then the\nCity College of New York in 1939–40, where he held his first\nacademic position—and eventually became a naturalized\ncitizen.\n\nHe was productive throughout his career, publishing such important\npapers as “The Function of General Laws in History” (1942)\nand “Studies in the Logic of Confirmation”,\n“Geometry and Empirical Science”, and “The Nature of\nMathematical Truth” (all in 1945), before leaving City College\nfor Yale. While there, Hempel would publish “Problems and\nChanges in the Empiricist Criterion of Meaning” (1950) and\n“The Concept of Cognitive Significance: A Reconsideration”\n(1951), as well as his first book, a volume in the International\nEncyclopedia of Unified Science, Fundamentals of Concept Formation\nin Empirical Science (1952). Hempel moved to Princeton in 1955,\nwhere his research program flourished and his influence upon\nprofessional philosophers became immense.\n\nDuring his two decades at Princeton, Hempel’s approach dominated\nthe philosophy of science. His major articles during this interval\nincluded “The Theoretician’s Dilemma” (1958),\n“Inductive Inconsistencies” (1960), “Rational\nAction” (1961), and “Deductive-Nomological vs. Statistical\nExplanation” and “Explanation in Science and in\nHistory” and (both in 1962). A classic collection of his\nstudies, Aspects of Scientific Explanation (1965c), became a\nscholar’s bible for generations of graduate students. His\nintroductory text, Philosophy of Natural Science (1966a),\nwould be translated into ten languages. Other articles he published\nthereafter included “Recent Problems of Induction” (1966b)\nand “Maximal Specificity and Lawlikeness in Probabilistic\nExplanation” (1968) as well as a series of studies that included\n“On the ‘Standard Conception’ of Scientific\nTheories” (1970).\n\nAt the University of Pittsburgh following his mandatory retirement\nfrom Princeton in 1973, he continued to publish significant articles,\nincluding studies of the nature of scientific rationality,\n“Scientific Rationality: Analytic vs. Pragmatic\nPerspectives” (1979), and “Turns in the Evolution of the\nProblem of Induction” (1981), and on the structure of scientific\ntheories, including, most importantly, “Limits of a Deductive\nConstrual of the Function of Scientific Theories” (1988a) as\nwell as “Provisos: A Problem Concerning the Inferential Function\nof Scientific Theories” (1988b), further enhancing his\nreputation by his willingness to reconsider earlier positions. After\nhis death in 1997, new collections of his papers appeared (Jeffrey\n2000; Fetzer 2001), which complemented studies of his research\n(Rescher 1969; Esler et al. 1985; Kitcher & Salmon 1989; Fetzer\n2000b).\n2. The Critique of Logical Positivism\n\nHowever surprising it may initially seem, contemporary developments in\nthe philosophy of science can only be properly appreciated in relation\nto the historical background of logical positivism. Hempel himself\nattained a certain degree of prominence as a critic of this movement.\nLanguage, Truth and Logic (1936; 2nd edition,\n1946), authored by A.J. Ayer, offers a lucid exposition of the\nmovement, which was—with certain variations—based upon the\nanalytic/synthetic distinction, the observational/theoretical\ndistinction, and the verifiability criterion of meaningfulness. A\nfundamental desideratum motivating its members was to establish\nstandards for separating genuine questions for which answers might be\nfound from pseudo-questions for which no answers could be found.\n\nAccording to the first principle, sentences are analytic\nrelative to a language framework \\(\\mathbf{L}\\) when their truth\nfollows from its grammar and vocabulary alone. In English,\n“Bachelors are unmarried” cannot be false, since\n“bachelor \\(=_{\\df}\\) unmarried, adult male”. Sentences of\nthis kind make no claims about the world, but instead reflect features\nof the linguistic framework as syntactical or semantic truths in\n\\(\\mathbf{L}\\). And sentences are synthetic when they make\nclaims about the world. Their truth in \\(\\mathbf{L}\\) does not follow\nfrom its grammar and vocabulary alone but hinges upon properties of\nthe world and its history. According to logical positivism, all such\nclaims about the world have to be evaluated on the basis of\nexperience, which means the kind of knowledge they display is a\nposteriori. But kinds of knowledge whose truth can be established\nindependently of experience are a priori.\n\nLogical positivism affirmed that, given a language \\(\\mathbf{L}\\), all\na priori knowledge is analytic and all synthetic knowledge is\na posteriori, thus denying the existence of knowledge that is\nboth synthetic and a priori. Indeed, the denial of the\nexistence of synthetic a priori knowledge is commonly assumed\nto define the position known as “Empiricism”, while the\naffirmation of its existence defines “Rationalism”. Figure\n1 thus reflects the intersection of kinds of sentences and kinds of\nknowledge on the Empiricist approach:\n\n\n\n\n \nA Priori Knowledge\nA Posteriori Knowledge \n\nSynthetic Sentences\nNo\nYes \n\nAnalytic Sentences\nYes\n?  \n\n\nFigure 1. The Empiricist Position\n\n\nThe category for sentences that are analytic and yet represent a\nposteriori knowledge deserves discussion. The empirical study of\nthe use of language within language-using communities by field\nlinguists involves establishing the grammar and the vocabulary\nemployed within each such community. Their empirical research yields\ntheories of the languages, \\(\\mathbf{L}\\), used in those communities\nand affords a basis for distinguishing between which sentences are\nanalytic-in-\\(\\mathbf{L}\\) and which are synthetic-in-\\(\\mathbf{L}\\).\nThe kind of knowledge they acquire about specific sentences based on\nempirical procedures thus assumes the form, “Sentence \\(S\\)\nis analytic-in-\\(\\mathbf{L}\\)”, when that is\ntrue of sentence \\(S\\), which is a\nposteriori.\n\nOne of Hempel’s early influential articles was a defense of\nlogicism, according to which mathematics—with the notable\nexception of geometry, which he addressed separately—can be\nreduced to logic (for Hempel, including set theory) as its foundation\n(Hempel 1945c). Mathematics thus becomes an exemplar of analytic a\npriori knowledge. Two subtheses should be distinguished: (i) that\nall mathematical concepts can be defined by means of basic\nlogical concepts; and (ii) that all mathematical theorems can\nbe deduced from basic logical truths. In order to distinguish logicism\nfrom formalism, however, the former maintains that there is one\nsystem of logic that is fundamental to all inquiries, where all\nmathematical terms are reducible to logical terms, and all\nmathematical axioms are derivable from logical ones, which formalism\ndenies (Rech 2004).\n\nThe tenability of logicism has been disputed on multiple grounds, the\nmost prominent of which is that the notion of membership\nfundamental to the theory of sets is not a logical notion but rather a\nsymbol that must be added to first-order logic to formalize what is\nproperly understood as a non-logical theory. Nor would\nphilosophers today accept the conception of the axioms of set theory\nas logical axioms, since there exist alternatives. So even if\nmathematics were reducible to set theory, these considerations\nundermine Hempel’s claim that mathematics is thereby reducible\nto logic (cf. Benacerraf 1981 and Linsky & Zalta 2006, which\nprovides an extensive bibliography). Hempel’s views about\ngeometry, in retrospect, thus appear to have been the better\nfounded.\n2.1 The Analytic/Synthetic Distinction\n\nThe analytic/synthetic distinction and the observational/theoretical\ndistinction were tied together by the verifiability criterion of\nmeaningfulness, according to which, in relation to a given\nlanguage, \\(\\mathbf{L}\\), a sentence \\(S\\) is\nmeaningful if and only if it is either analytic-in-\\(\\mathbf{L}\\) or\nsynthetic-in-\\(\\mathbf{L}\\) as an observation sentence or a sentence\nwhose truth follows from a finite set of observation sentences. By\nthis standard, sentences that are non-analytic but also\nnon-verifiable, including various theological or metaphysical\nassertions concerning God or The Absolute, qualify as cognitively\nmeaningless. This was viewed as a desirable result. But, as Hempel\nwould demonstrate, its scope was far too sweeping, since it also\nrendered meaningless the distinctively scientific assertions made by\nlaws and theories.\n\nFrom an historical perspective, logical positivism represents a\nlinguistic version of the empiricist epistemology of David Hume\n(1711–76). It refines his crucial distinctions of\n“relations between ideas” and “matters of\nfact” by redefining them relative to a language \\(\\mathbf{L}\\)\nas sentences that are analytic-in-\\(\\mathbf{L}\\) and\nsynthetic-in-\\(\\mathbf{L}\\), respectively. His condition that\nsignificant ideas are those which can be traced back to impressions in\nexperience that gave rise to them now became the claim that synthetic\nsentences have to be justified by derivability from finite classes of\nobservation sentences. Hume applied this criterion to exclude the idea\nof necessary connections, which are not observable, from\nsignificant causal claims, which were thereby reduced to relations of\nregular association, spatial contiguity, and temporal succession. And\nlogical positivism followed Hume’s lead.\n\nEmpiricism historically stands in opposition to Rationalism, which is\nrepresented most prominently by Immanuel Kant, who argued that the\nmind, in processing experiences, imposes certain properties on\nwhatever we experience, including what he called Forms of Intuition\nand Categories of Understanding. The Forms of Intuition impose\nEuclidean spatial relations and Newtonian temporal relations; the\nCategories of Understanding require objects to be interpreted as\nsubstances and causes as inherently deterministic. Several\ndevelopments in the history of science, such as the emergence of the\ntheory of relativity and of quantum mechanics, undermine Kant’s\nposition by introducing the role of frames of reference and of\nprobabilistic causation. Newer versions are associated with Noam\nChomsky and with Jerry Fodor, who have championed the ideas of an\ninnate syntax and innate semantics, respectively (Chomsky 1957; Fodor\n1975; Chomsky 1986)\n\nIndeed, according to the computational theory of the mind, human\nminds, like computing machines, are special kinds of formal systems.\nSince deviations from formal systems of language in practice can be\nconsiderable, Chomsky introduced a distinction between\ncompetence and performance, where the former models\nthe formal system and various explanations are advanced for deviations\nfrom that model in practice, similar to differences between the fall\nof bodies in a vacuum and in air, which raises questions about\ntestability that parallel those for scientific theories, in general.\nIf languages are not best understood as formal systems, however, or if\nsyntax and semantics are not innate, then Chomsky and Fodor’s\nviews are as vulnerable as those of Kant. If syntax is an emergent\nproperty of semantic complexity, for example, then grammar is not\ninnate; and if mentality has and continues to evolve, Chomsky and\nFodor are wrong (Schoenemann 1999; Fetzer 2005).\n\nIn his study of formal systems for geometry (Hempel 1945b), Hempel\ndiscusses the existence of alternatives based upon different axioms,\nwhich differentiate Euclidean geometry from its non-Euclidean rivals.\nAccording to Euclid, for example, the sum of the interior angles of a\ntriangle must equal 180° and, in relation to a point separate from\na given line, one and only one parallel line passes through it. The\nalternatives advanced by Lobachevsky (hyperbolic) and by Riemann\n(elliptical), however, which represent the surface of a sphere and of\na saddle, respectively, violate both of those conditions, albeit in\ndifferent ways. Hempel emphasized that all three, as formal systems,\nare on a par, where the most appropriate choice to describe the\ngeometry of space depends on the outcome of empirical studies. As it\nhappened, Einstein would adopt a generalized form of Riemannian\ngeometry in his general theory of relativity.\n\nHempel accordingly drew a distinction of fundamental importance\nbetween pure and applied mathematics, which he\nemphasized by using a quotation from Einstein, who had observed,\n“As far as the laws of mathematics refer to reality, they are\nnot certain; and as far as they are certain, they do not refer to\nreality” (1921). The existence of alternative and incompatible\nformal systems, moreover, appears to affect Hempel’s defense of\nlogicism from another direction. If mathematics is supposed to be\nreducible to logic and logic is supposed to be consistent, then how\ncan alternative geometries be consistently reducible to logic? No one\nwould dispute that they exist as distinct formal systems with their\nown axioms and primitives, but if these geometries are jointly\nreducible to logic only if logic is inconsistent, their existence\nsuggests that, perhaps, as formalism claims, it is not the case there\nis one system of logic that is fundamental to all inquiries.\n2.1.1 Quine’s Complaints\n\nThe analytic/synthetic distinction took a decided hit when the noted\nlogician, Willard van Orman Quine, published “Two Dogmas of\nEmpiricism” (1953), challenging its adequacy. Quine argued that\nthe notion of analyticity presupposes the notion of synonymy-in-use,\nwhich in turn presupposes understanding\ninter-substitutability-while-preserving-truth. He claimed none of the\nnotions can be understood without the other, creating a circular\nrelation between them. Thus, matching up a definiens with a\ndefiniendum could only be done if we already understood that\nthe definiens specifies the meaning of the word that is being\ndefined—a variation of “the paradox of analysis”,\naccording to which we either already know the meaning of words (in\nwhich case analysis is unnecessary) or we do not (in which case it is\nimpossible). The idea of analyticity appeared to have been\ndeposed.\n\nThe paper created a sensation and has been the most influential\nphilosophical article of the past 100 years. But Quine explicitly\nallowed for the existence of the class of logical truths (such as\n“No unmarried man is married”) as narrowly\nanalytic sentences and their relationship to broadly analytic\nsentences (such as “No bachelor is married”), when the\ndefinitional relationship between them has been suitably stipulated\n(as in “bachelor \\(=_{\\df}\\) unmarried, adult male” in a\nlanguage framework \\(\\mathbf{L})\\). In cases of this kind, he\nconceded, inter-substitutability, synonymy, and analyticity are\nrelated in an unproblematic way. It would have been odd for a logician\nto deny the existence of logical truths or the role of stipulations,\nwhich are basic to the construction of formal systems, which suggests\nthat he may not have actually defeated the idea of analyticity, after\nall (Fetzer 1993).\n\nIndeed, Carnap (1939) had explained that the process of constructing a\nvocabulary and a grammar for a language-in-use involves several\nstages, including observation of the use of language by members of the\ncommunity, formulating hypotheses regarding the meaning of its phrases\nand expressions, and drawing inferences about the underlying grammar.\nThese are pragmatic, semantic, and syntactical procedures,\nrespectively, and decisions have to be made in arriving at a theory\nabout the language as the outcome of empirical research. The\nconstruction of formal systems thus provides an illustration of the\nelements of artificial languages, where accounts of natural language\ncounterparts can be subject to further testing and refinement. The\nlinguistic practices of a specific community can thus be modeled and\nthereby overcome Quine’s professed objections.\n2.1.2 Hempel’s Concerns\n\nMoreover, in Fundamentals of Concept Formation in Empirical\nScience (1952), Hempel had endorsed explication as a\nmethod of definition analogous to theory construction by taking words\nand phrases that are somewhat vague and ambiguous and subjecting them\nto a process of clarification and disambiguation. Adequate\nexplications are required to satisfy criteria of syntactical\ndeterminacy, semantic relevance, and pragmatic benefit (by clarifying\nand illuminating the meaning of those words and phrases in specific\ncontexts). The word “probability” is vague and ambiguous,\nfor example, but various contexts of its usage can be distinguished\nand theories of evidential support, relative frequency, and causal\npropensity can be advanced. Hempel, following Carnap (1950), had\naccordingly advanced a methodology that dealt with the paradox of\nanalysis before “Two Dogmas”.\n\nAbout the same time, however, Hempel found reasons of his own for\ndoubting that the analytic/synthetic distinction was tenable, which\nsurfaced in his study of dispositional predicates, such as\n“malleable”, “soluble” and\n“magnetic”. They designate, not directly observable\nproperties, but (in the case of “magnetic”) tendencies on\nthe part of some kinds of things to display specific reactions (such\nas attracting small iron objects) under suitable conditions (such as\nthe presence of small iron objects in the vicinity). It is very\ntempting to define them using the material conditional,\n“___ \\(\\supset \\ldots\\)” by definitions like,\n\n(D1)\n\\(x\\) is magnetic at \\(t =_{\\df}\\) if, at \\(t\\), a small iron\nobject is close to \\(x\\), then it moves toward \\(x\\)\n\n\nwhich could then be formalized by means of the horseshoe and suitable\nabbreviations, \n\n\\[\\tag{D2} Mxt =_{\\df} Sxt \\supset Txt* \\]\n\n\nwhere “\\(t^*\\)” is equal to or later than “\\(t\\)”\nand reflects that effects brought about by\ncauses entail changes across time. Since the material “if ___\nthen …” is equivalent to “either not-___ or\n…”, however, the meaning of (D2) turns out to be\nlogically equivalent to, \n\n\\[\\tag{D3} Mxt =_{\\df} \\neg Sxt \\vee Txt* \\]\n\n\nwhich means that anything not subject to the test, such as a brown\ncow, is magnetic. Hempel acknowledged that the use of the\nsubjunctive conditional, say, “___ \\(\\rightarrow\n\\ldots\\)”, formalizing what would be the case … if\nsomething ___ were the case, in this case, \n\n\\[\\tag{D4} Mxt =_{\\df} Sxt \\rightarrow Txt* \\]\n\n\n“if, at \\(t\\), as small iron object were close to\n\\(x\\), then it would move toward \\(x\\)\nat \\(t^*\\)” (which assumes the satisfaction of the test\ncondition) would avoid the problem, because these conditionals take\nfor granted their antecedents are satisfied (that\n“Sxt” is true). But while acknowledging the\nimportance of subjunctive conditionals for an understanding of both\ncounterfactual conditionals and lawlike sentences, Hempel regarded\ntheir explication as not fully satisfactory and their use as “a\nprogram, rather than a solution” (Hempel 1952: 25).\n\nHe therefore adopted a method from Carnap to overcome this difficulty,\nwhere, instead of attributing the property in question to anything not\nsubject to the test, the predicate is partially defined by means of a\nreduction sentence, such as “if, at \\(t\\),\na small iron object is close to \\(x\\),\nthen \\(x\\) is magnetic at \\(t\\)\nif and only if it moves toward \\(x\\)\nat \\(t\\)” or symbolically, \n\n\\[\\tag{D5} Sxt \\supset (Mxt \\equiv Txt*)\\]\n\n\nwhere a biconditional, “___ \\(\\equiv \\ldots\\)”, is true\nwhen “___” and “…” have the same truth\nvalue and otherwise is false. This solved one problem by abandoning\nthe goal of defining the predicate for a partial specification of\nmeaning. But it created another, insofar as, if there should be more\nthan one test/response for a property—such as that, “if\n\\(x\\) moves through a closed wire loop at \\(t\\),\nthen \\(x\\) is magnetic at \\(t\\)\nif and only if an electric current flows in the loop\nat \\(t^*\\)”—in conjunction they jointly imply that any\nobject \\(x\\) that is near small iron objects and moves\nthrough a closed wire loop will generate a current in the loop if and\nonly if it attracts those iron objects. But this no longer has the\ncharacter of even a partial definition but instead that of an\nempirical law. The prospect that analytic sentences might have\nsynthetic consequences was not a welcome result (Hempel 1952).\n2.1.3 Intensional Methodology\n\nCarnap (1963) was receptive to the adoption of an intensional\nmethodology that went beyond the constraints of extensional logic,\nwhich Hempel (1965b) would consider but leave for others to pursue\n(Fetzer 1981, 1993). The distinction can be elaborated with respect to\nthe difference between the actual world and alternative possible\nworlds as sequences of events that diverge from those that define the\nhistory of the actual world. If specific conditions that obtained at a\nspecific time had been different, for example, the course of ensuing\nevents would have changed. These intensional methods can be applied to\nthe problems of defining dispositions and the nature of laws by\nemploying descriptions of possible worlds as variations on the actual,\nnot as alternatives that are “as real as” the\nactual—as David Lewis (2001a,b) has proposed—but as a\nmeans for formally specifying the semantic content of subjunctives and\ncounterfactuals (where counterfactuals are subjunctives with false\nantecedents), using an alternative calculus.\n\nThere appear to be two broad kinds of justification for subjunctive\nconditionals, which are logical and ontological, where logical\njustifications are derived from the grammar and vocabulary of a\nspecific language, such as English. The subjunctive, “If John\nwere a bachelor, then John would be unmarried”, for example,\nfollows from the definition of “bachelor” as\n“unmarried, adult male”. Analogously, the subjunctive,\n“If this were gold, then it would be malleable”, could be\njustified on ontological grounds if being malleable were (let us call\nit) a permanent attribute of being gold as a reference\nproperty, where attributes are “permanent” when there is\nno process or procedure, natural or contrived, by means of which\nthings having those reference properties could lose those attributes\nexcept by no longer possessing those reference properties, even though\nthat is not a logical consequence of their respective definitions\n(Fetzer 1977). The approach appeals to necessary connections, which\nare unobservable and therefore unacceptable to Hume. As we shall\ndiscover, that they are unobservable doesn’t mean they are\nempirically untestable.\n\nThe elaboration of a possible-worlds formal semantics that might be\nsuitable for this purpose, however, requires differentiating between\nfamiliar minimal-change semantics, where the world remains\nthe same except for specified changes, and a maximal-change\nsemantics, in which everything can change except for specified\nproperties, which is the ingredient that seems to be required to\nsatisfy the constraints of scientific inquiries as opposed to\nconversational discourse (Fetzer & Nute 1979, 1980). In the 1950s\nand 60s, however, Nelson Goodman (1955) and Karl Popper (1965) were\nattempting to sort out the linkage between dispositions, subjunctives,\nand laws from distinctive points of view. Hempel’s commitments\nto extensional logic and to Humean constraints would lead him to\nendorse an account of laws that was strongly influenced by Goodman and\nto embrace a pragmatic account that was both epistemically and\ncontextually-dependent.\n2.2 The Observational/Theoretical Distinction\n\nWhile the analytic/synthetic distinction appears to be justifiable in\nmodeling important properties of languages, the\nobservational/theoretical distinction does not fare equally well.\nWithin logical positivism, observation language was assumed\nto consist of names and predicates whose applicability or not can be\nascertained, under suitable conditions, by means of direct observation\n(such as using names and predicates for colors, shapes, sounds) or\nrelatively simple measurement (names and predicates for heights,\nweights, and sizes, for example). This was an epistemic position, of\ncourse, since it was sorting them out based upon their accessibility\nby means of experience. Both theoretical and dispositional predicates,\nwhich refer to non-observables, posed serious problems for the\npositivist position, since the verifiability criterion implies they\nmust be reducible to observables or are empirically meaningless. Karl\nPopper (1965, 1968), however, would carry the argument in a different\ndirection by looking at the ontic nature of properties.\n\nPopper has emphasized that we are theorizing all the time. Consider\nthe observation of a glass full of clear liquid. Suppose it’s\nwater. Then it quenches thirst and extinguishes fires and nourishes\nplants. But what if it’s alcohol instead? Just describing it as\n“water” entails innumerable subjunctives about the kinds\nof responses it would display under a wide variety of test conditions.\nThey are the would be’s of things of that kind.\nConsider the differences between basket balls, billiard balls, and\ntennis balls. Things of different kinds can do different things. Even\nthe seemingly simplest observation of a rabbit in the backyard, for\nexample, implies that it is going to display rabbit-like behavior,\nincluding eating carrots when my wife puts them out. It is going to\nhop around and create more rabbits. If it’s a rabbit, it is\ngoing to have rabbit DNA. It will not turn out to be stuffed. And this\nsuggested that observational properties and predicates are\ndispositional, too.\n\nFrom the Humean epistemic perspective, observational, dispositional,\nand theoretical predicates are successively more and more\nproblematical in relation to their accessibility via experience. The\nobservational describe observable properties of observable\nentities; the dispositional, unobservable properties of\nobservable entities; and the theoretical, unobservable\nproperties of unobservable entities. Popper suggested that\nobservational and theoretical properties (gravitational strengths\nelectromagnet fields, and such) are ontologically dispositional, too\n(Popper 1965: 425). But if universals as properties that can\nbe attributed to any member of any possible world are dispositions and\nthe kind of property dispositions are does not depend upon the ease\nwith which their presence or absence can be ascertained, then\nnomological subjunctives and counterfactuals—taken as\ninstantiations of lawlike generalizations for specific\nindividuals, places, and times—might be explicable as displays\nof dispositions and of natural necessities (Fetzer 1981).\n2.3 The Verifiability Criterion of Cognitive Significance\n\nHempel (1950, 1951), meanwhile, demonstrated that the verifiability\ncriterion could not be sustained. Since it restricts empirical\nknowledge to observation sentences and their deductive consequences,\nscientific theories are reduced to logical constructions from\nobservables. In a series of studies about cognitive significance and\nempirical testability, he demonstrated that the verifiability\ncriterion implies that existential generalizations are meaningful, but\nthat universal generalizations are not, even though they include\ngeneral laws, the principal objects of scientific discovery.\nHypotheses about relative frequencies in finite sequences are\nmeaningful, but hypotheses concerning limits in infinite sequences are\nnot. The verifiability criterion thus imposed a standard that was too\nstrong to accommodate the characteristic claims of science and was not\njustifiable.\n\nIndeed, on the assumption that a sentence \\(S\\) is\nmeaningful if and only if its negation is meaningful, Hempel\ndemonstrated that the criterion produced consequences that were\ncounterintuitive if not logically inconsistent. The sentence,\n“At least one stork is red-legged”, for example, is\nmeaningful because it can be verified by observing one red-legged\nstork; yet its negation, “It is not the case that even one stork\nis red-legged”, cannot be shown to be true by observing any\nfinite number of red-legged storks and is therefore not meaningful.\nAssertions about God or The Absolute were meaningless by this\ncriterion, since they are not observation statements or deducible from\nthem. They concern entities that are non-observable. That was a\ndesirable result. But by the same standard, claims that were made by\nscientific laws and theories were also meaningless.\n\nIndeed, scientific theories affirming the existence of gravitational\nattractions and of electromagnetic fields were thus rendered\ncomparable to beliefs about transcendent entities such as an\nomnipotent, omniscient, and omni-benevolent God, for example, because\nno finite sets of observation sentences are sufficient to deduce the\nexistence of entities of those kinds. These considerations suggested\nthat the logical relationship between scientific theories and\nempirical evidence cannot be exhausted by means of observation\nsentences and their deductive consequences alone, but needs\nto include observation sentences and their inductive\nconsequences as well (Hempel 1958). More attention would now be\ndevoted to the notions of testability and of confirmation and\ndisconfirmation as forms of partial verification and partial\nfalsification, where Hempel would recommend an alternative to the\nstandard conception of scientific theories to overcome otherwise\nintractable problems with the observational/theoretical\ndistinction.\n3. Scientific Reasoning\n\nThe need to dismantle the verifiability criterion of meaningfulness\ntogether with the demise of the observational/theoretical distinction\nmeant that logical positivism no longer represented a rationally\ndefensible position. At least two of its defining tenets had been\nshown to be without merit. Since most philosophers believed that Quine\nhad shown the analytic/synthetic distinction was also untenable,\nmoreover, many concluded that the enterprise had been a total failure.\nAmong the important benefits of Hempel’s critique, however, was\nthe production of more general and flexible criteria of cognitive\nsignificance in Hempel (1965b), included in a famous collection of his\nstudies, Aspects of Scientific Explanation (1965d). There he\nproposed that cognitive significance could not be adequately captured\nby means of principles of verification or falsification, whose defects\nwere parallel, but instead required a far more subtle and nuanced\napproach.\n\nHempel suggested multiple criteria for assessing the cognitive\nsignificance of different theoretical systems, where significance is\nnot categorical but rather a matter of degree:\n\nSignificant systems range from those whose entire extralogical\nvocabulary consists of observation terms, through theories whose\nformulation relies heavily on theoretical constructs, on to systems\nwith hardly any bearing on potential empirical findings. (Hempel\n1965b: 117, italics added)\n\n\nThe criteria Hempel offered for evaluating the “degrees of\nsignificance” of theoretical systems (as conjunctions of\nhypotheses, definitions, and auxiliary claims) were (a) the clarity\nand precision with which they are formulated, including explicit\nconnections to observational language; (b) the\nsystematic—explanatory and predictive—power of such a\nsystem, in relation to observable phenomena; (c) the formal simplicity\nof the systems with which a certain degree of systematic power is\nattained; and (d) the extent to which those systems have been\nconfirmed by experimental evidence (Hempel 1965b). The elegance of\nHempel’s study laid to rest any lingering aspirations for simple\ncriteria of cognitive significance and signaled the demise of logical\npositivism as a philosophical movement.\n\nPrecisely what remained, however, was in doubt. Presumably, anyone who\nrejected one or more of the three principles defining\npositivism—the analytic/synthetic distinction, the\nobservational/theoretical distinction, and the verifiability criterion\nof significance—was not a logical positivist. The precise\noutlines of its philosophical successor, which would be known as\n“logical empiricism”, were not entirely evident. Perhaps\nthis study came the closest to defining its intellectual core. Those\nwho accepted Hempel’s four criteria and viewed cognitive\nsignificance as a matter of degree were members, at least in spirit.\nBut some new problems were beginning to surface with respect to\nHempel’s covering-law explication of explanation and old\nproblems remained from his studies of induction, the most remarkable\nof which was known as “the paradox of confirmation”.\n3.1 The Paradox of Confirmation\n\nHempel’s most controversial argument appeared in an article\nabout induction entitled “Studies in the Logic of\nConfirmation” (1945a), where he evaluates the conditions under\nwhich an empirical generalization would be confirmed or disconfirmed\nby instances or non-instances of its antecedent and consequent. He\nfocused on universally quantified material conditionals, exemplified\nby sentences of the form, “\\((x)(Rx \\supset Bx)\\)”. With\n“\\(Rx\\)” interpreted as “\\(x\\) is a\nraven” and “\\(Bx\\)” as “\\(x\\)\nis black”, this schema represents, in first-order symbolic\nlogic, the claim, “All ravens are black”. He also\nconsidered sentences of more complex logical structures, but nothing\nhinges upon their use that cannot be addressed relative to an example\nof the simplest possible kind. And, indeed, Hempel took sentences of\nthis kind as exemplars of “lawlike sentences”, which\ncombine purely universal form with what he called purely\nqualitative predicates. So lawlike sentences that are true as\nextensional generalizations are “laws” (Hempel &\nOppenheim 1948).\n\nHempel applied “Nicod’s criterion” to this example,\nwhere Nicod had proposed that, in relation to conditional hypotheses,\ninstances of their antecedents that are also instances of their\nconsequents confirm them; instances of their antecedents that are not\ninstances of their consequents disconfirm them; and non-instantiations\nof their antecedents are neutral, neither confirming nor\ndisconfirming. Applied to the raven hypothesis, this means that, given\na thing named “\\(c\\)”, the truth of\n“\\(Rc\\)” and “\\(Bc\\)” confirms it; the truth\nof “\\(Rc\\)” and “\\(\\neg Bc\\)” disconfirms it;\nand the truth of “\\(\\neg Rc\\)” neither confirms nor\ndisconfirms it, but remains evidentially neutral, regardless of the\ntruth value of “\\(Bc\\)”. To these highly intuitive\nconditions, Hempel added that, since logically equivalent hypotheses\nhave the same empirical content, whatever confirms one member of a set\nof logically equivalent hypotheses must also confirm the others, which\nhe called “the equivalence condition”.\n\nNo matter how intuitive, Hempel proceeded to demonstrate that this\ncreates a paradox. By Nicod’s criterion, “\\((x)(Rx \\supset\nBx)\\)” is confirmed by ravens that are black. But, by that same\nstandard, “\\((x)(\\neg Bx \\supset \\neg Rx)\\)” is confirmed\nby non-black non-ravens, such as white shoes! Since these are\nlogically equivalent and have the same empirical content, they must be\nconfirmed or disconfirmed by all and only the same instances. This\nmeans that—no matter how counter-intuitive—the lawlike\nhypothesis, “All ravens are black”, is confirmed by\nobservations of white shoes! Since these hypotheses are also\nequivalent to “\\((x)(\\neg Rx \\vee Bx)\\)”, which asserts\nthat everything either is not a raven or is black, it is also the case\nthat observations of non-ravens confirms the hypothesis, regardless of\ntheir color. Observations of non-ravens, however, unlike those of\nblack ravens, confirm alternative hypotheses, like “All ravens\nare blue” and “All ravens are green”. Hempel’s\npoint was that the application of Nicod’s criterion means that,\nsince even observations of non-ravens are confirmatory, the class of\nneutral instances in fact has no members.\n3.2 The Equivalence Condition\n\nFew papers in the philosophy of science have produced such a\nvoluminous literature. In a “Postscript”, Hempel addressed\na few of the suggestions that have been advanced to analyze the\nparadoxical quality of the argument (Hempel 1965a). Several were\nintent upon explaining them quantitatively on the ground that, for\nexample, there are many more non-black things than black things or\nthat the probability of being non-black is much great than the\nprobability of being a raven, whereas others appealed to Bayesian\nprinciples and suggested that the prior probability for ravens being\nblack makes testing non-ravens of considerably less relative risk.\nHempel replied that even the existence of a quantitative measure of\nevidential support poses no challenge to his conclusion that the\nparadoxical cases—non-black non-ravens, such as white\nshoes—are confirmatory.\n\nHempel acknowledges that an explanation for why the paradoxical cases\nappear to be non-confirmatory may have something to do with fashioning\nhypotheses about classes that are affected by their relative size.\nSince the class of non-ravens is so much larger than the class of\nravens, where what we are interested in, by hypothesis, is the color\nof ravens, instances of non-black non-ravens might count as\nconfirmatory but to a lesser degree than instances of black ravens. He\nallows the possibility that perhaps the theory of confirmation should\nproceed quantitatively, which might provide a less perplexing basis\nfor assessments of this kind. But he steadfastly maintains that the\nconsequences he identified following from the application of the\nprinciples he employed are logically impeccable, no matter how\npsychologically surprising they may seem (Hempel 1960).\n\nThe most important claim of Hempel (1965a) is that confirmation cannot\nbe adequately defined by linguistic means alone. Here he cites Goodman\n(1955) to demonstrate that some hypotheses of the form,\n“\\((x)(Fx \\supset Gx)\\)”, are not confirmable even by\ninstances of the kind “\\(Fc\\)” and “\\(Gc\\)”.\nIf “\\(Rx\\)” stands for “\\(x\\) is a\nraven” and “\\(Bx\\)” for “\\(x\\)\nis blite” (where \\(x\\) is blite when it has been\nexamined before time \\(t\\) and is black or has not been\nexamined before \\(t\\) and is white), then any raven\nobserved before \\(t\\) and found to be black confirms\nthe hypothesis, “\\((x)(Rx \\supset Bx)\\)”; yet this\nhypothesis implies that all ravens not examined before \\(t\\)\nare white, a consequence that, in Hempel’s\nlanguage, “must surely count as disconfirmed rather than as\nconfirmed”. And he endorses Goodman’s suggestion that\nwhether a universal conditional is capable of being confirmed by its\npositive instances turns out to depend upon the character of its\nconstituent predicates and their past use.\n3.3 The Limits of Extensionality\n\nGoodman (1955) draws a distinction between universal conditional\ngeneralizations that can be confirmed by their instances and those\nthat cannot, where the former are said to be\n“projectible”. Those that can be projected from examined\ncases to unexamined ones are those that have a history of past\nprojections. Thus, the predicate “black” has many past\nprojections, but the predicate “blite” does not. Since a\nhistory of past projections enhances the projectibility of predicates\nonly when they are successful, the measure of a predicate’s\ndegree of projectibility, which Goodman calls its degree of\nentrenchment, is the relative frequency of its successful use in\npast predictions. Hume observed that, no matter how consistently a\nregularity has held in the past, that provides no guarantee it will\ncontinue to hold in the future. Goodman nevertheless adopted the past\nas a guide, which qualifies as his solution to the linguistic version\nof Hume’s problem of induction.\n\nSince Goodman is offering a pragmatic solution for (what most would\nassume to be) a syntactical and semantical problem, it may be useful\nto consider whether or not there might be a more promising approach.\nIn embracing Goodman’s approach, Hempel was modifying his\nconception of lawlike sentences as extensional\ngeneralizations which are restricted to purely qualitative predicates\nwhich make no mention of specific individuals, specific places or\nspecific times, but which might, in special cases, reference samples\nor exemplars, such as the standard meter or the atomic clock (Hempel\n1965d: 269, where he also mentions Popper’s notion of universal\npredicates). Goodman’s account does not actually capture the\nconcept of laws but the rather restricted notion of hypotheses that\nhave been projected and are supposed to be laws. Laws themselves,\nafter all, exist even when they have not yet been discovered, as in\nthe case of Archimedes’ principle before Archimedes,\nSnell’s law before Snell, and Newton’s before Newton. A\nmore promising approach lay in the direction of universals in\nPopper’s sense, which are dispositions with subjunctive force,\nwhere laws can be characterized as unrestricted intensional\nconditionals.\n\nPopper (1965, 1968) championed falsifiability as a criterion of\ndemarcation that is more appropriate than verifiability as a criterion\nof meaningfulness, on the ground that what we need is a basis for\ndistinguishing scientific from nonscientific statements, where the\nlatter can still be meaningful, even when they are not scientific. He\nsuggested that laws should be understood as having the force of\nprohibitions, which are empirically testable by attempts to\nfalsify them. And he observed there are no “paradoxes of\nfalsification” to parallel the “paradoxes of\nconfirmation”. Even in the case of material conditionals, the\nonly falsifying instances are those that combine the truth of their\nantecedents with the falsity of their consequents. Relative to\n“\\((x)(Rx \\supset Bx)\\)”, for example, the only potential\nfalsifiers are instances of “\\(Rx\\)” that are instances of\n“\\(\\neg Bx\\)”, and similarly for “\\((x)(\\neg Bx\n\\supset \\neg Rx)\\)” and for “\\((x)(\\neg Rx \\vee\nBx)\\)”, not to mention its subjunctive counterpart,\n“\\((x)(Rx \\rightarrow Bx)\\)”. The absence of paradox\nsuggested that Popper’s approach to problems of demarcation and\nof cognitive significance might possess substantial advantages over\nthe alternatives.\n4. Scientific Explanations\n\nHempel’s most important contributions to the theory of science\nhave been a series of explications of the structure of scientific\nexplanations. His methodology was such that, following the preliminary\nexamination of the linguistic and physical phenomena under\nconsideration, he would advance a semi-formal characterization, one\nwhich he would subsequently subject to formal characterization using\nthe resources of symbolic logic. The overarching theme of his work was\nthe conception of explanation by subsumption, where specific events\nare subsumed by corresponding laws (of physics, of chemistry, of\nbiology, and so forth). The conception of explanation by subsumption\nis rather ancient in its lineage, but Hempel advanced explicit\nformulations that drew distinctions between explanations of different\nkinds, especially those that invoke universal (or deterministic) laws,\nstatistical (or probabilistic) laws, and the explanation of laws by\nmeans of theories.\n\nHempel implemented the conception of subsumption by presuming that\nexplanations explain the occurrence of singular events by deriving\ntheir descriptions from premises that include at least one lawlike\nsentence, which thereby displays (what he called) their nomic\nexpectability. In the simplest cases, explanations assume the\nfollowing form:\n\n\n\n\nPremises:\n\\(L_1, L_2,\\ldots L_k\\) \n\n\\(C_1,\nC_2,\\ldots C_r\\) \n\nConclusion:\n\\(E\\) \n\n\n\nFigure 2. An Explanation Schema\n\n\nThus, in relation to Figure 2, \\(C_1\\), \\(C_2\\),…, \\(C_r\\)\ndescribe specific conditions (referred to as “initial” or\n“antecedent”) and \\(L_1\\), \\(L_2\\),…, \\(L_k\\)\ngeneral laws, where “\\(E\\)” describes the\nevent to be explained. The explanation takes the form of an inductive\nor deductive argument, where the premises are called the\n“explanans” and the conclusion the\n“explanandum”.\n\nRichard Jeffrey (1969) noted that Hempel’s conception harmonizes\nwell with Aristotle’s definition of (what he called)\nunqualified scientific knowledge,\n\n\n[where] the premisses of demonstrated knowledge must be true, primary,\nimmediate, better known than and prior to the conclusion, which is\nfurther related to them as effect to cause. (Posterior\nAnalytics 1.71–2, as quoted in Jeffrey 1969: 104)\n\n\nA potentially even more illuminating comparison emerges from the\nperspective of Aristotle’s theory of the four causes, where the\nlaws are the material cause, the antecedent conditions the efficient\ncause, the logical relation between the explanans and the explanandum\nthe formal cause and the explanandum the final cause (Fetzer 2000a:\n113–114). There were important differences in their conceptions\nof law. Aristotle’s general premises were definitional,\nnecessarily, whereas Hempel’s were not. The following figure\nshows the parallel.\n\n\n\n\nThe Material Cause:\nThe Covering Law(s)\n  \n\nThe Efficient Cause:\nThe Initial Conditions\n  \n\n \n··································\n \nThe Formal Cause \n\nThe Final Cause:\nThe Explanandum  \n\n\n\nFigure 3. Hempelian Explanation in\nAristotelian Perspective\n\n\nIn the above figure, the use of the dotted line is meant to convey\nthat the analogy applies equally to deductive arguments (which would\nbe represented by a solid line) and inductive arguments (which would\nbe represented by a double line with a probability value\nattached).\n4.1 The Semi-Formal Explication\n\nFor Aristotle, the general premises of scientific explanations are\ngeneralizations that describe commensurately universal\nproperties of things of a subject kind, \\(K\\). Merely\nuniversal properties are ones that everything of kind \\(K\\)\nhas but could be without and remain a thing of that\nkind, just as every Honda might have Michelin tires. Aristotle\nreferred to such properties as “accidental”.\nCommensurately universal properties are ones that belong to everything\nof the kind as necessary attributes that they cannot be without. A\ntriangle, for example, has three lines and angles. Aristotle referred\nto them as “essential”. Because generalizations about the\nessential properties of things of a kind are “proper\ndefinitions”, they provide the basis for explanations that\nqualify as analytic. Hempel encompassed analytic generalizations\nwithin the scope of “fundamental laws” as defined in\nHempel and Oppenheim (1948), but he focused on those that were\nsynthetic.\n\nAnalytic explanations are common in the currents of daily life,\nespecially in the context of explaining how you “know\nthat” something is the case. A mother might explain to her\nsingle daughter that she knows that John must be unmarried, because a\nfriend told her that John is a bachelor. Similar cases of analytic\nexplanations can occur in scientific contexts, such as knowing that\nthe element they are dealing with is gold because it has atomic number\n79, when gold is defined by its atomic number. Knowing why John is a\nbachelor, however, is another matter. Indeed, in Hempel (1965c), he\nwould distinguish between reason-seeking why-questions and\nexplanation-seeking why-questions, where the former seek\nreasons that justify believing that something is the case, as opposed\nto the latter, which are usually motivated by knowledge that a\nspecific event has occurred.\n\nIn his semi-formal explication of the requirements for adequate\nscientific explanations, Hempel specified four conditions of adequacy\n(CA) that have to be satisfied, namely:\n\n(CA-1)\nThe explanandum must be a deductive consequence of the explanans;\n\n(CA-2)\nThe explanans must contain general laws, which are required to\nsatisfy (CA-1);\n(CA-3)\nThe explanans must have empirical content and must be capable of\ntest; and, \n(CA-4)\nThe sentences of the explanans must be true. (Hempel &\nOppenheim 1948)\n\n\nThese conditions are intended to serve as requirements whose\nsatisfaction guarantees that a proposed explanation is adequate.\nHempel drew several distinctions over time between potential\nscientific explanations (which satisfy the first three conditions, but\npossibly not the fourth) and confirmed scientific\nexplanations (which are believed to be true but might turn out to be\nfalse). Hempel recognized that (CA-3) was a redundant condition, since\nit would have to be satisfied by any explanation that satisfied (CA-1)\nand (CA-2). Insofar as the explanandum describes an event that\noccurred during the history of the world, its derivation thereby\nimplies the explanans has empirical content.\n4.2 Ontic vs. Epistemic Conceptions\n\nHempel’s conditions had many virtues, not least of which was\nthat they appeared to fit many familiar examples of scientific\nexplanations, such as explaining why a coin expanded when it was\nheated by invoking the law that copper expands when heated and noting\nthat the coin was copper. Hempel doesn’t specify the form laws\nmay take, which could be simple or complex. Most of his examples were\nsimple, such as “All ravens are black”, “All gold is\nmalleable”, and so on. Others were quantitative, such as\nArchimedes’ principle (A body totally immersed in a\nfluid—a liquid or a gas—experiences an apparent loss in\nweight equal to the weight of the fluid it displaces), Snell’s\nlaw (During refraction of light, the ratio of the sines of the angles\nof incidence and of refraction is a constant equal to the refractive\nindex of the medium), and Newton’s law of gravitation (Any two\nbodies attract each other with a force proportional to the product of\ntheir masses and inversely proportional to the square of the distance\nbetween them), which he discussed.\n\nMore complicated examples can be found in standard sources, such as\nThe Feynman Lectures on Physics (Feynman et al.\n1963–65), the first volume of which is devoted to mechanics,\nradiation, and heat; the second, to electromagnetism and matter; and\nthe third, to quantum mechanics. Hempel explored the implications of\n (CA-4)\n for laws:\n\n\nThe requirement of truth for laws has the consequence that a given\nempirical statement \\(S\\) can never be definitely\nknown to be a law; for the sentence affirming the truth of \\(S\\)\nis tantamount to \\(S\\) and is\ntherefore capable only of acquiring a more or less high probability,\nor degree of confirmation, relative to the experimental evidence\navailable at any given time (Hempel and Oppenheim 1948: note 22,\nitalics added).\n\n\nHempel considered weakening condition\n (CA-4)\n to one of high confirmation instead of truth, but concluded that it\nwould be awkward to have “adequate explanations” that are\nlater superseded by different “adequate\nexplanations” with the acquisition of additional evidence and\nalternative hypotheses across time. He therefore retained the\ncondition of truth. Whether or not the conditions of explanatory\nadequacy should be relative to an epistemic context of confirmation\nrather than to an ontic context of truth would become an important\nquestion in coping with the requirements for probabilistic\nexplanations.\n\nNo aspect of Hempel’s position generated more controversy than\nthe symmetry thesis, which holds that, for any adequate\nexplanation, had its premises—its initial conditions and\ncovering laws—been taken into account at a suitable prior time,\nthen a deductive prediction of the occurrence of the explanandum event\nwould have been possible, and conversely (Hempel & Oppenheim\n1948). Inferences from adequate explanations to potential predictions\nwere generally accepted, but not the converse. Critics, such as\nMichael Scriven (1962), advanced counter-examples that were based on\ncorrelations or “common causes”: the occurrence of a storm\nmight be predicted when cows lie down in their fields, for example,\nyet their behavior does not explain why the storm occurs. Sylvain\nBromberger offered the example of the length of the shadow cast by a\nflagpole, which is sufficient to deduce the height of the flagpole and\nthus satisfies Hempel’s conditions but does not explain why the\nflagpole has that height (Bromberger 1966). Since logical relations\nare non-temporal, Hempel may have taken the symmetry thesis to be a\ntrivial consequence of his account, but deeper issues are involved\nhere.\n4.3 The Problem of Lawlikeness\n\nHempel observed that universal generalizations of the form,\n“\\((x)(Fx \\supset\\) Gx)”, are true if and only if\nlogically equivalent generalizations of the form, “\\((x)(\\neg Fx\n\\vee Gx)\\)”, are true. But if “\\(Fx\\)” stands for\nan uninstantiated property, such as being a vampire, then,\nsince “\\(\\neg Fx\\)” is satisfied by everything, regardless\nof the attribute “\\(Gx\\)”, “\\(\\neg Gx\\)”,\netc., that hypothesis—and its logical equivalents—are not\nonly universally confirmed but even qualify as “laws”.\nThis is not surprising, from a logical point of view, since\nextensional logic is purely truth functional, where the truth value of\nmolecular sentences is a function of the truth values of its atomic\nconstituents. But it implies that an empirical generalization that\nmight be true of the world’s history may or may not be\n“lawful”, since it could be the case that its truth was\nmerely “accidental”. Hempel’s endorsement of\nGoodman’s approach to select generalizations that support\nsubjunctive conditionals, therefore, was not only consistent with the\ntradition of Hume—who believed that attributions of natural\nnecessity in causal relations are merely “habits of mind”,\npsychologically irresistible, perhaps, but logically\nunwarranted—but circumvented a disconcerting consequence of his\nexplication.\n\nThere is a fundamental difference between sentences that\n“support subjunctives” and those that “entail\nsubjunctives”, when the selection of those that support\nsubjunctives is made on pragmatic grounds. Popper captured the crucial\ndifference between material (extensional) generalizations and\nsubjunctive (intensional) generalizations as follows:\n\n\nA statement may be said to be naturally or physically\nnecessary if, and only if, it is deducible from a statement\nfunction which is satisfied in all worlds that differ from our own, if\nat all, only with respect to initial conditions. (Popper 1965:\n433)\n\n\nIndeed, the existence of irreducibly ontic probabilistic phenomena,\nwhere more than one outcome is possible under the same initial\nconditions, would mean that the history of an indeterministic world\nmight be identical with the history of a deterministic one, where\ntheir differences were concealed “by chance”. Even a\ncomplete description of the history of the actual world might not\nsuffice to distinguish between them, where fundamental aspects of\ntheir causal structure would remain beyond empirical detection.\n\nThe difference between Popper’s universal predicates and\nGoodman’s paradoxical ones may derive from the consideration\nthat incorporating specific times into his definitions entails\nreference to specific moments of time \\(t\\), such as\nmidnight tonight, during the history of the actual world, a\npoint to which we are going to return. It follows that they cannot be\n“universal” in Popper’s sense and do not even\nqualify as “purely qualitative” in Hempel’s, either.\nReliance upon material conditionals within first-order symbolic logic,\nmoreover, forfeits the benefits of synthetic subjunctives. If the\nhypothesis, “All ravens are black”, is more adequately\nformalized as a subjunctive of the form, “\\((x)(Rx \\rightarrow\nBx)\\)”, where the truth of a subjunctive hypothetically assumes\nthat its antecedent condition is satisfied, that obviates the paradox:\nwhite shoes are not ravens, and Nicod’s criteria apply Instances\nof “\\(Rx\\)” and “\\(Bx\\)” thereby confirm the\nhypothesis; instances of “\\(Rx\\)” and “\\(\\neg\nBx\\)” disconfirm it; and instances of “\\(\\neg Rx\\)”\nare epistemically neutral, precisely as Nicod said.\n5. Explanation, Prediction, Retrodiction\n\nHempel’s critics—both early and late—have not always\nshown an appreciation for the full dimensions of his explication.\nMichael Scriven (1959), for example, once objected to “the\ndeductive model, with its syllogistic form, where no student of\nelementary logic could fail to complete the inference, given the\npremise” (1959: 462), when no restriction is placed on the\ncomplexity of the relevant laws or the intricacy of these deductions\n(Hempel 1965c: 339). Similar objections have been lodged more recently\nby William Bechtel and Adele Abrahamsen (2005), for example, who\nclaim, in defense of “the mechanist alternative”, that,\namong its many benefits,\n\n\ninvestigators are not limited to linguistic representations and\nlogical inference in presenting explanations but frequently employ\ndiagrams and reasoning about mechanisms by simulating them. (2005:\n421)\n\n\nHempel’s conditions of adequacy, however, are capable of\nsatisfaction without their presentation as formal arguments.\n\nHempel remarks that his model of explanation does not directly apply\nto the wordless gesticulations of a Yugoslavian automobile mechanic or\nguarantee that explanations that are adequate are invariably\nsubjectively satisfying. His purpose was to formalize the conditions\nthat must be satisfied when an explanation is adequate without denying\nthat background knowledge and prior beliefs frequently make a\ndifference in ordinary conversational contexts. Jan might not know\nsome of the antecedent conditions, Jim might have misunderstood the\ngeneral laws, or features of the explanandum event may have been\nmissed by them both. Even when information is conveyed using diagrams\nand simulations, for example, as long as it satisfies conditions\n (CA-1)\n through\n (CA-4)—no\n matter whether those conditions are satisfied implicitly or\nexplicitly—an adequate scientific explanation is at hand. But it\nhas to satisfy all four of those requirements.\n\nDemonstrating that an adequate scientific explanation is at hand,\nhowever, imposes demands beyond the acquisition of information about\ninitial conditions and laws. In the examiner’s sense of\nknowledge Ian Hacking identified (Hacking 1967: 319), to prove an\nadequate scientific explanation is available, it would be necessary to\nshow that each of Hempel’s adequacy conditions has been\nsatisfied. It would not be enough to show, say, that one person is\nknowledgeable about the initial conditions, another about the covering\nlaws, and a third about the explanandum. It would be necessary to show\nthat the explanandum can be derived from the explanans, that those\nlaws were required for the derivation, and that the initial conditions\nwere those present on that occasion.\n (CA-1)–(CA-4)\n qualifies as a “check list” to insure that a scientific\nexplanation is adequate.\n5.1 The Symmetry Thesis\n\nStudents of Hempel have found it very difficult to avoid the\nimpression that Hempel was not only defending the position that every\nadequate scientific explanation is potentially predictive but also the\nposition that every adequate scientific prediction is potentially\nexplanatory. This impression is powerfully reinforced in “The\nTheoretician’s Dilemma” (Hempel 1958), where, in the\ncourse of demonstrating that the function of theories goes beyond\nmerely establishing connections between observables, he offers this\npassage:\n\n\nScientific explanations, predictions, and postdictions all have the\nsame logical character: they show that the fact under consideration\ncan be inferred from certain other facts by means of specified general\nlaws. In the simplest case, the type of argument may be schematized as\na deductive inference of the following form [here substituting the\n“simplest case” for the abstract schemata presented in the\noriginal]:\n\n\n\n\n\\((x)(Rx \\supset Bx)\\)\nExplanans \n\n\\(Rc\\)\n\n\n\\(Bc\\)\nExplanandum  \n\n\nFigure 4. A Covering-Law Explanation\n\n\n… While explanation, prediction, and postdiction are alike in\ntheir logical structure, they differ in certain other respects. For\nexample, an argument [like Figure 4 above] will qualify as a\nprediction only if [its explanandum] refers to an occurrence at a time\nlater than that at which the argument is offered; in the case of\npostdiction, the event must occur before the presentation of the\nargument. These differences, however, require no further study here,\nfor the purpose of the preceding discussion was simply to point out\nthe role of general laws in scientific explanation, prediction, and\npostdiction (Hempel 1958: 37–38).\n\n\nWhat is crucial about this passage is Hempel’s emphasis on the\npragmatic consideration of the time at which the argument is\npresented in relation to the time of occurrence of the\nexplanandum event itself. Let us take this to be the observation\nthat \\(c\\) is black and assume that occurs at a\nspecific time \\(t_1\\). If the argument is presented prior to time\n\\(t_1\\) (before observing that \\(c\\) is black), then it\nis a prediction. If the argument is presented after time \\(t_1\\)\n(after observing that \\(c\\) is black), then it is a\npostdiction. Since explanations are usually advanced after the time of\nthe occurrence of the event to be explained, they usually occur as\npostdictions. But there is nothing about their form that requires\nthat.\n\nAs Hempel uses the term, reasoning is “scientific” when it\ninvolves inferences with laws. Indeed, this appears to be the\nprincipal ground upon which he wants to maintain that explanations,\npredictions, and postdictions share the same logical form. His\nposition here makes it logically impossible for explanations,\npredictions and postdictions to not have the same logical form. If\nthere are modes of prediction that are non-explanatory, such as might\nbe the case when they are based upon accidental generalizations, then\nthey would not thereby demonstrate that the symmetry thesis does not\nhold for the kinds of distinctively “scientific”\nexplanations that are the focus of his work. Scriven’s cow\nexample, for example, does not show that the symmetry thesis does not\nhold for scientific explanations and scientific\npredictions, even if it shows that some ordinary predictions\nare not also ordinary explanations. But other\ncounter-examples posed greater threats.\n5.2 The Paradoxes of Explanation\n\nIndeed, in the process of drawing the distinction between\nexplanation-seeking and reason-seeking why-questions, Hempel (1965c)\nproposed a different kind of symmetry thesis, where adequate answers\nto explanation-seeking why-questions also provide adequate answers to\nreason-seeking why-questions, but not conversely. That was very\nappropriate, since the purpose of reason-seeking why-questions is to\nestablish grounds for believing that the event described by the\nexplanandum sentence has taken (or will take) place, while\nexplanation-seeking why-questions typically take for granted that we\nknow their explanandum events have already occurred. It follows that,\nwhile Hempel’s conditions are meant to specify when we know\nwhy, they also entail how we know that.\n\nInsofar as Hempel focused on logically equivalent formulations of\nlawlike sentences in addressing the paradoxes of confirmation, some\nmay find it remarkable that he does not explore the consequences of\nlogically equivalent formulations in relation to explanations. We tend\nto assume we can explain why a specific thing \\(c\\) is\nblack on the grounds that it is a raven and all ravens are black. Yet\nwe would hesitate to explain why a specific thing is not a raven on\nthe ground that it is not black. We may refer to this as the\nparadox of transposition. Notice, the contention that one member\nof a class of logically equivalent hypotheses is explanatory but\nothers are not generates “paradoxes of explanation” that\nparallel the “paradoxes of confirmation” (Fetzer 2000a).\nFigure 5 offers an illustration:\n\\[ \\frac{\\begin{gathered} (x)(\\neg Bx \\supset \\neg Rx)\\\\ \\neg Bc\\end{gathered}}{\\neg Rc} \\]\n\n\nFigure 5. The Transposition Paradox\n\n\nEven if we accept the transposed form of “\\((x)(Rx \\supset\nBx)\\)” as the basis for an answer to a reason-seeking\nwhy-question—in this case, how we know that\n\\(c\\) is no raven—Figure 5 surely does not\nexplain why that is the case, which presumably has to do with\nthe genes of entity \\(c\\) and its developmental history\nas a living thing. If logically equivalent forms equally qualify as\nlawlike—there’s no basis in extensional logic to deny\nit—then Hempel confronts a dilemma. In fact, by his own\nconditions of adequacy, this argument is not only explanatory but also\npredictive. It is not a “postdiction” as he has\ndefined it above, but it appears to qualify as a\n“retrodiction” that does not explain its explanandum\nevent.\n\nSuppose Hempel were to resort to Goodman’s approach and deny\nthat the negation of a purely qualitative predicates is also a purely\nqualitative predicate. That would mean that sentences logically\nequivalent to lawlike sentences—which have the same\ncontent—are not therefore also lawlike by invoking pragmatic\ndifferences in their degree of entrenchment and projectibility of\ntheir constituent predicates. An appeal to pragmatic considerations\nwithin this context has a decidedly ad hoc quality about it,\nwhich appears to contravene the spirit of the paradoxes of\nconfirmation, where Hempel insists that the counterintuitive cases are\nconfirmatory and their paradoxical character is merely psychological.\nEven if Hempel were to adopt this position and take for granted that\none member of a class of logically equivalent sentences can be lawlike\nwhile the others are not, another difficulty arises from the use of\nmodus tollens in lieu of modus ponens, as Figure 6\nexemplifies:\n\\[\\frac{\\begin{gathered} (x)(Rx \\supset Bx)\\\\ \\neg Bc \\end{gathered}} {\\neg Rc} \\]\n\n\nFigure 6. The Modus Tollens Paradox\n\n\nHere we have a more threatening problem, since there is no apparent\nbasis for denying that an argument having this form satisfies\nHempel’s criteria and therefore ought to be both explanatory\nand predictive. Similarly for temporally quantified arguments,\nwhere the fact that a match of kind \\(K\\) has not\nlighted at \\(t^*\\) would certainly not be adequate to explain why\nit was not struck at t, even though every match of kind \\(K\\)\nwill light when it is struck, under suitable\nconditions! Something serious thus appears to be wrong (Fetzer\n2000a).\n6. Inductive-Statistical Explanation\n\nIn his studies of inductive reasoning, Hempel (1960, 1962a, 1966b)\ndiscusses the ambiguity of induction, which arises because\nincompatible conclusions can appear to be equally-well supported by\ninductive arguments, where all the premises of both arguments are\ntrue. This problem has no analogue for deductive arguments:\ninconsistent conclusions cannot be validly derived from consistent\npremises, even if they are false. Inconsistent conclusions can receive\ninductive support from consistent premises, however, even when they\nare all true. Consider Hempel’s illustration of conflicting\npredictions for a patient’s recovery:\n\n(e1)\nJones, a patient with a sound heart, has just had an appendectomy,\nand of all persons with sound hearts who underwent appendectomy in the\npast decade, 93% had an uneventfully recovery.\n\n\nThis information, taken by itself, would surely lend strong support to\nthe hypothesis,\n\n(h1)\nJones will have an uneventful recovery. \n\n\nBut suppose that we also have the information:\n\n(e2)\nJones is an octogenarian with serious kidney failure; he just had\nan appendectomy after his appendix had ruptured; and in the past\ndecade, of all cases of appendectomy after rupture of the appendix\namong octogenarians with serious kidney failure, only 8% had an\nuneventful recovery.\n\n\nThis information by itself would lend strong support to the\ncontradictory of (h1):\n\n\\((\\neg\\)h1)\nJones will not have an uneventful recovery. (Hempel\n1966b) \n\n\nThus, Hempel observed, (e1) and (e2) are logically compatible and\ncould all be part of the evidence available when Jones’\nprognosis is being considered. The solution Hempel endorsed was\nthe requirement of total evidence, according to which, in\nreasoning about the world, arguments must be based upon all the\navailable evidence, though he noted that evidence can be omitted when\nit is irrelevant and its omission does not affect the level of\nsupport. Here, when (e1) is combined with (e2), \\((\\neg\\)h1) is better\nsupported than (h1).\n6.1 The Requirement of Maximal Specificity\n\nHempel referred to statistical explanations as\n“inductive-statistical” in contrast with his prior\ndiscussion of “deductive-nomological” explanations (Hempel\n1958). Because generalizations of both kinds are supposed to be\nlawlike, however, more appropriate names for them might have been\n“universal-deductive” and\n“statistical-inductive” (or, perhaps,\n“statistical-probabilistic”, respectively (Fetzer 1974).\nIn formalizing these arguments, Hempel symbolized statistical premises\nattributing a certain probability to outcome \\(G\\),\nunder conditions \\(F\\), by “\\(P(G, F) =\nr\\)”, where these explanations then assume this form:\n\n\n\n\n\\(P(G,F) = r\\) \n\n\\(Fc\\)\n\\([r]\\) \n\n\\(Gc\\)  \n\n\nFigure 7. An I-S Explanation Schema\n\n\nWhile Hempel initially interpreted the bracketed variable [\\(r\\)]\nas the measure of inductive support which the\nexplanans confers upon the explanandum, \\(Gi\\), (in conformity with\nthe requirement of total evidence)—where the value of [\\(r\\)]\nequals that of \\(r\\)—it\noccurred to him that, since inductive and deductive explanations are\ntypically offered on the basis of the knowledge that their explanandum\nevents have already occurred, viewing statistical explanations as\ninductive arguments whose purpose is to establish how we know that\nthey have occurred (or that they will occur) is not the correct\nperspective for understanding them:\n\n\nthe point of an explanation is not to provide evidence for the\noccurrence of the explanandum, but to exhibit it as nomically\nexpectable. And the probability attached to an I-S explanation is\nthe probability of the conclusion relative to the explanatory\npremises, not relative to the total class \\(\\mathbf{K}\\) [representing\nour total knowledge at that time]. (Hempel 1968, original\nemphasis)\n\n\nIn order to formalize this conception, he advanced the concept of\na maximally specific predicate related to “Gi” in\n\\(\\mathbf{K},\\) where, when “\\(P(G, F) = r\\)”, then, if\nthe premises include a predicate stronger than “\\(F\\)”,\nsay, “\\(M\\)”, which implies the presence of more\nproperties than does “\\(F\\)”, then \\(P(G, M) = r,\\) where,\nas before, \\(r = P(G,F).\\) Thus additional predicates could be\nincluded in the explanans of an adequate scientific explanation,\nprovided that they made no difference to the nomic expectability of\nthe explanandum. Including the position of the moon or the day of the\nweek a match is struck, for example, might be irrelevant, but his\ncondition did not exclude them.  Wesley C. Salmon (1970), however,\nwould pursue this issue by arguing that Hempel had embraced the wrong\nstandard upon which to base explanatory relevance relations, where\nexplanations, in Salmon’s view, strictly speaking, do not even\nqualify as arguments.\n6.2 Statistical Relevance vs. Causal Relevance\n\nSalmon offered a series of counterexamples to Hempel’s approach.\nIn the case of I-S explanations, Hempel required that the nomic\nexpectability of the explanandum must be equal to or greater than .5,\nwhich preserved the symmetry thesis for explanations of this kind.\nThis implied that events with low probability could not be explained.\nThere were persuasive illustrations, moreover, demonstrating that\nexplanations could satisfy Hempel’s criteria, yet not explain\nwhy their explanandum events occur. For example,\n\n(CE-1)\nJohn Jones was almost certain to recover from his cold within a\nweek, because he took vitamin C, and almost all colds clear up within\na week after administration of vitamin C. \n(CE-2)\nJohn Jones experienced significant remission of his neurotic\nsymptoms, for he underwent extensive psychoanalytic treatment and a\nsubstantial percentage of those who undergo psychoanalytic treatment\nexperience significant remission of neurotic symptoms. \n\n\nMost colds clear up within a week, with or without vitamin C, and\nsimilarly for neurotic symptoms. Salmon thought that this problem was\npeculiar to statistical explanations, but was corrected by Henry\nKyburg (1965), who offered examples of the following kind:\n\n(CE-3)\nThis sample of table salt dissolves in water, for it has had a\ndissolving spell cast upon it, and all samples of table salt that have\nhad dissolving spells cast upon them dissolve in water. \n(CE-4)\nJohn Jones avoided becoming pregnant during the past year, for he\nhas taken his wife’s birth control pills regularly, and every\nman who regularly takes birth control pills avoids\npregnancy. \n\n\nFor Hempel, a property \\(F\\) is explanatorily\nrelevant to the occurrence of an outcome \\(G\\) if\nthere is a lawful relationship that relates \\(F\\) to\n\\(G\\). If table salt dissolves in water, so does\nMorton’s table salt, Morton’s finest table salt,\nMorton’s finest table salt bought on sale, and so on. Salmon\nconcluded that Hempel’s conception of I-S explanation was\nwrong.\n\nA student of Reichenbach (1938, 1949), Salmon had adopted and defended\nthe limiting frequency interpretation of physical probability, where\n“\\(P(G/F) = r\\)” means that \\(G\\) occurs\nwith a limiting frequency \\(r\\) in a reference class of\ninstances of \\(F\\), which has to be infinite for limits\nto exist (Salmon 1967, 1971). On this approach, a property \\(H\\)\nis explanatorily relevant to the occurrence\nof an attribute \\(G\\) within a reference class \\(F\\)\njust in case (SR):\n\n(SR)\n\\(P(G/F \\amp H) = m\\) and \\(P(G/F \\amp \\neg H) = n\\), where \\(m\n\\ne n\\);\n\n\nthat is, the limiting frequency for \\(G\\) in \\(F\\)-and-\\(H\\)\ndiffers from the limiting\nfrequency for \\(G\\) in \\(F\\)-and-not-\\(H\\).\nProperties whose presence does not make a difference\nto the limiting frequency for the occurrence of \\(G\\)\nin \\(F\\) would therefore qualify as statistically\nirrelevant. Relative frequencies were typically relied upon in\npractice, but in principle they had to be limiting.\n\nSalmon also rejected Hempel’s requirement that the nomic\nexpectability of a statistical explanation must be equal to or greater\nthan .5, which led him to abandon the notion of explanations as\narguments. Even events of low probability were explainable within the\ncontext of Salmon’s approach, which he compared with\nHempel’s approach as follows:\n\n\nI-S model (Hempel): an explanation is an argument that\nrenders the explanandum highly probable;\n\nS-R model (Salmon): an explanation is an assembly of facts\nstatistically relevant to the explanandum regardless of the\ndegree of probability that results. (Salmon 1971, original\nemphasis)\n\n\nSalmon’s work created a sensation, since Hempel’s\ndominance of the philosophy of science, especially in relation to the\ntheory of explanation, now had a significant rival. The students of\nexplanation who recognized that probabilities as properties of\ninfinite classes posed substantial problems were few, and those who\nrealized that Salmon’s position confronted difficulties of its\nown fewer still.\n\nSalmon was ingenious in devising “screening off” criteria\nto insure that the properties cited in an S-R explanation were\nrestricted to those that were statistically relevant. He may have\nappreciated that the available evidence was restricted to relative\nfrequencies in finite sequences, but that could be discounted as\ntypical of the distinction between a context \\(\\mathbf{K}\\)\nrepresenting our total knowledge at that time and the truth condition,\nsince scientific knowledge is always tentative and fallible. A deeper\nproblem arose from the existence of properties that were statistically\nrelevant but not explanatorily relevant, however. If women whose\nmiddle initials began with vowels, for example, experienced\nmiscarriages with a different frequency than women whose middle\ninitials began with consonants—even after other properties were\ntaken into account—then that property would have to qualify as\nstatistically relevant and therefore explanatorily relevant\n(Fetzer 1974, 1981). This result implied that statistical relevance\ncannot adequately define explanatory relevance, and Salmon would\ngradually move toward the propensity approach in Salmon (1980,\n1989).\n6.3 Revising Hempel’s Criteria of Adequacy\n\nThe advantage of propensities over frequencies are considerable,\nsince, on the propensity account, a probabilistic law no longer simply\naffirms that a certain percentage of the reference class belongs to\nthe attribute class. What it asserts instead is that every member of\nthe reference class possesses a certain disposition, which in the case\nof statistical laws is of probabilistic strength and in the case of\nuniversal laws of universal strength. On its single-case formulation,\nmoreover, short runs and long runs are simply finite and infinite\nsequences of single cases, where each trial has propensities that are\nequal and independent from trial to trial and classic theorems of\nstatistical inference apply.\n\nEven this intensional explication would still be vulnerable to the\nproblems of irrelevant properties and the modus tollens\nparadox but for the adoption of a condition to exclude the occurrence\nof predicates that are not nomically relevant to the explanandum event\nfrom the explanans of an adequate scientific explanation. This\ncriterion, known as the requirement of strict maximal\nspecificity, permits the reformulation of Hempel’s four\nconditions of adequacy by replacing the redundant empirical content\ncondition with this new requirement (Fetzer 1981; Salmon 1989).\nExplanations not only display the nomic expectability of\ntheir explanandum events—which, in the case of those that occur\nwith high probability, would enable them to have been predicted, as\nHempel proposed but—more importantly—explain them by\nspecifying all and only those properties nomically\nresponsible for their occurrence, even when they occur with low\nprobability (Fetzer 1992).\n\nBromberger’s flagpole counterexample provides a severe test of\nthis requirement. The reason why the inference from the length of the\nshadow to the height of the flagpole is non-explanatory is because the\nlength of the shadow is not nomically responsible for the\nflagpole’s height. Hempel’s original conditions could not\ncope with situations of this kind, where inferences using laws support\npredictions and retrodictions that are not also explanations, even\nthough they satisfy all four. This alternative condition thus requires\nthat the properties cited in the antecedent of the lawlike premise(s)\nmust be nomically relevant to the explanandum or may not be included\nthere (Fetzer 1981, 1992). The height of the flagpole, but not the\nlength of the shadow, qualifies as nomically relevant, which resolves\nthe quandary—at the expense of acknowledging classes of\narguments that are predictive or retrodictive but not\nexplanatory, even when they involve inferences from law(s) that\nsatisfy Hempel’s original criteria. The reformulated conditions\nare:\n\n(CA-1*)\nThe explanandum must be a suitable logical consequence of the\nexplanans; \n(CA-2)\nThe explanans must contain general laws, which are required to\nsatisfy (CA-1*);\n(CA-3*)\nThe explanans must satisfy the requirement of strict maximal\nspecificity; and,\n(CA-4*)\nThe sentences—both of the explanans and of the\nexplanandum—must be true.\n\n\nBy formulating (CA-1*) in this way, the covering law conception of the\nsubsumption of singular events by general laws is preserved; but\nabandonment of the high-probability requirement led both Salmon (1971)\nand Alberto Coffa (1973) to question whether or not explanations still\nproperly qualify as “arguments”. At the least, however,\nthey would appear to be special kinds of “explanatory\narguments”, even when they involve low probabilities.\n\nThese revised conditions implicitly require abandoning Hempel’s\ncommitment to extensional methodology to capture the notion of nomic\nresponsibility, but the benefits of an intensional approach appear to\nbe profound. As Salmon has observed,\n\n\n[on such an explication] the distinction between description and\nprediction, on the one hand, and explanation, on the\nother, is that the former can proceed in an extensional language\nframework, while the latter demands an intensional language framework.\nIt remains to be seen whether the intensional logic can be\nsatisfactorily formulated (Salmon 1989: 172, original emphasis).\n\n\nThis approach to explanation incorporates the causal relevance\ncriterion, according to which a property \\(H\\) is\ncausally relevant to the occurrence of an attribute \\(G\\)\nrelative to a reference property \\(F\\)—within\nthe context of a causal\nexplanation—just in case (CR):\n\n(CR)\n\\((Fxt \\amp Hxt) =m \\Rightarrow Gxt*\\) and \\((Fxt \\amp \\neg Hxt) =n\n\\Rightarrow Gxt*\\), where \\(m \\ne n\\);\n\n\nthat is, the propensity for \\(G\\), given \\(F \\amp H\\), differs from\nthe propensity for \\(G\\), given \\(F \\amp \\neg H\\), where the presence\nor absence of \\(H\\) affects the single-case causal tendency for\n\\(G\\). The universal generalization of sentential functions like these\nthus produces lawlike sentences, while their instantiation to\nindividual constants or to ambiguous names produces (what are known\nas) nomological conditionals (Fetzer 1981: 49–54). The\nintroduction of the probabilistic causal calculus \\(C\\), moreover,\nresponds to Salmon’s concerns by providing a formalization\nwithin intensional logic that resolves them (Fetzer & Nute 1979,\n1980). Paul Humphreys (1985, 1989) has argued that “propensities\ncannot be probabilities” because their causal\ndirectedness precludes satisfying symmetry conditions requiring\nprobabilities from effects to causes as well as from causes to effects\n(on the plausible assumption that there are no propensities for\neffects to bring about their causes). A more linguistically precise\ncharacterization would be that propensities cannot be ‘standard\nprobabilities’, which has no effect on their role in explanatory\ncontexts.\n7. The Problem of Provisos\n\nWhat may come as some surprise is that Hempel exposed yet another\nsignificant problem confronting the theory of scientific explanation.\nOne of the most remarkable features of his career is that he continued\nto publish original and innovative studies well into his eightieth\ndecade. Rather surprisingly, he authored a series of articles that\nmoved away from the influential conception of scientific theories as\nformal calculi combined with empirical\ninterpretations that had been characteristic of logical\nempiricism. In Hempel (1966a), at the time, the most widely adopted\nintroduction to the philosophy of science (which has been translated\ninto ten other languages), he advanced the novel explication of\nscientific theories as consisting of internal principles and\nbridge principles, where the lawlike hypotheses that\ndistinguish theories are linked to observation, measurement, and\nexperiment by principles expressed in various mixtures of ordinary and\nof technical language. Now antecedent understanding replaces explicit\ndefinability, which seems to have been, in part, a response to the\ndemise of the observational/theoretical distinction.\n\nEven more strikingly, Hempel (1988a,b) observed that the application\nof scientific theories presupposes the absence of factors that might\naffect the internal principles of the theory, which goes beyond the\ncontent of the theory itself. Deriving predictions and explanations\nfrom classical mechanics presupposes that bodies are being acted upon\nexclusively by gravitational forces, for example, where the presence\nof electromagnetic forces would invalidate those derivations. This is\nnot simply a matter of conducting tests “under suitable\nconditions”, where the malleability of gold differs when struck\nby a hammer when at extremely cold temperatures (where the\ncombustibility of paper differs when the paper is wet, and so on),\nwhich are familiar examples of the various specific conditions that\nmust be identified in complete definitions of dispositional\npredicates. What Hempel noticed is that these properties may not only\nbe affected by conditions covered by the theory being applied but\ninvolve entirely different theories. He took this to mean that the\napplication of theories has to be accompanied by\n“provisos” affirming that no properties beyond those\nspecified by the theory are present in a specific case.\n\nThe function of these provisos means that instrumentalist\nconstructions of scientific theories as mere calculating devices and\nprograms for the elimination of theoretical language by reduction to\nobservational language alone are misguided and cannot be sustained.\nAnd this is because, if other theoretical properties make a difference\nto the application of a particular theory, then the observational\nconsequences of that theory cannot be assumed to obtain in any\ninstance without provisos about other theoretical properties beyond\nthose specified by the theory, which requires separate investigation\non the basis of observation, measurement, and experiment. The\nconditions for testing, confirming or falsifying alternative\nhypotheses and theories is thereby rendered vastly more complex than\nhad previously been supposed. Strikingly, as an essential element of\nan adequate explanation, Coffa (1973) had advanced “extremal\nclauses” that assert that no factors other than those specified\nby the initial conditions of the explanans are relevant to the\noccurrence of the explanandum event. Indeed, Salmon points out that,\nsince the application of every law involves a tacit extremal (or\n“ceteris paribus”) clause, any law can be protected from\nrefutation by discounting disconfirming evidence on the expedient of\nclaiming that, because the clause was not satisfied, the law is still\ncorrect, which is another way to accent the source of Hempel’s\nconcern (Salmon 1989: 84–85).\n\nThese observations are related to the claim that “the laws of\nphysics lie”, which has been suggested by Nancy Cartwright\n(1983). She has claimed that there are theoretical laws, which are\nsupposed to be “simple” but rarely if ever instantiated,\nand phenomenological laws, which are frequently instantiated but\ntypically if not always complex. Armstrong (1983: 137–140) draws\na distinction between laws that are “iron” and have no\nexceptions and those that are “oaken” and have no\nexceptions as long as no interfering conditions are present.\nIn his language, unless Cartwright has overlooked the possibility that\nsome laws might be both complex and true, she seems to be saying that\ntheoretical laws are “oaken” laws for which there are no\n“iron” counterparts. If that is right, then she has failed\nto appreciate the distinction between counterfactual conditionals\n(which may be true in spite of having no instances) and mere\nindicative conditionals (which may be true because they have\nno instances). The “provisos” problem implies that\nsatisfying the requirement of maximal specificity may be more\ndemanding than has been generally understood in the past. Either way,\nCartwright’s theses appear to trade on an equivocation between\nthe non-existence of “iron” counterparts and their\nnon-availability: even if the “iron” laws within a domain\nare not yet known, it does not follow that those laws do not\nexist.\n8. Reflections on Rationality\n\nThe publication of Thomas S. Kuhn’s The Structure of\nScientific Revolutions (1962), ironically, was among the\nhistorical developments that contributed to a loss of confidence in\nscience. Kuhn’s work, which turned “paradigm” into a\nhousehold word, was widely regarded as assimilating revolutions in\nscience to revolutions in politics, where one theory succeeds another\nonly upon the death of its adherents. It was interpreted as having\ndestroyed the myth that philosophers possess some special kind of\nwisdom or insight in relation to the nature of science or the thought\nprocesses of scientists with respect to their rationality, almost as\nthough every opinion were on a par with every other. A close reading\nof Kuhn’s work shows that these were not his own conclusions,\nbut they were enormously influential. And among the public at large\nand many social scientists, the tendency to no longer hold science in\nhigh esteem or to be affected by its findings has induced political\nramifications that are inimical to the general good. When our beliefs\nare not well founded, actions we base upon them are unlikely to\nsucceed, often with unforeseen effects that are harmful. Rational\nactions ought to be based upon rational beliefs, where science has\nproven to be the most reliable method for acquiring knowledge about\nourselves and the world around us.\n\nThis study supports the conclusion that Hempel’s conception of\nscientific explanations as involving the subsumption of singular\nevents by means of covering laws was well-founded, even though his\ncommitment to an extensional methodology inhibited him from embracing\na more adequate account of natural laws. The symmetry thesis turns out\nto require qualification, not only with respect to predictions for\nevents that occur only with low probability, but also for\nretrodictions derived by modus tollens. The link that most\naccurately embodies the relationship between Hempel’s work on\nexplanation and decision-and-inference, as we have seen, appears to be\nreflected by the Principal Principle, which formalizes the\nrecognition that subjective (or personal) probabilities, as degrees of\nbelief, should have the same values as corresponding objective\nprobabilities, when they are known. The values of propensities as\nproperties of laws, no doubt, should be given precedence over the\nvalues of frequencies, insofar as laws, unlike frequencies, cannot be\nviolated and cannot be changed and thus provide the more reliable\nguide.\n\nA recent trend presumes that the philosophy of science has been\nmisconceived and requires “a naturalistic turn” as a kind\nof science of science more akin to history or to sociology than to\nphilosophy. In studies published in the twilight of his career, Hempel\ndemonstrated that, without standards to separate science from\npseudo-science, it would be impossible to distinguish frauds,\ncharlatans, and quacks from the real thing (Hempel 1979, 1983).\nWithout knowing “the standards of science”, we would not\nknow which of those who call themselves “scientists” are\nscientists and which methods are “scientific”, where the\nplace of explanation remains central within the context of inference\nto the best explanation (Fetzer 2002). The philosophy of science,\ntherefore, cannot be displaced by history or by sociology. Not least\namong the important lessons of Hempel’s enduring legacy is the\nrealization that the standards of science cannot be derived from mere\ndescriptions of its practice alone but require rational justification\nin the form of explications satisfying the highest standards of\nphilosophical rigor.\n",
    "bibliography": {
        "categories": [
            "Primary Sources: Works by Hempel",
            "Primary Sources: Coauthored Works"
        ],
        "cat_ref_text": {
            "Primary Sources: Works by Hempel": [
                "</h3>\n<ul class=\"hanging\">",
                "1942, “The Function of General Laws in History”,\n<em>Journal of Philosophy</em>, 39(2): 35–48.\ndoi:10.2307/2017635",
                "1945a, “Studies in the Logic of Confirmation”,\n<em>Mind</em>, 54(213): 1–26 and 54(214):97–121.\ndoi:10.1093/mind/LIV.213.1 doi:10.1093/mind/LIV.214.97",
                "1945b, “Geometry and Empirical Science”, <em>American\nMathematical Monthly</em>, 52(1): 7–17. doi:10.2307/2304830",
                "1945c, “On the Nature of Mathematical Truth”,\n<em>American Mathematical Monthly</em>, 52(10): 543–556.\ndoi:10.2307/2306103",
                "1950, “Problems and Changes in the Empiricist Criterion of\nMeaning” <em>Revue Internationale de Philosophie</em>, 41(11):\n41–63.",
                "1951, “The Concept of Cognitive Significance: A\nReconsideration”, <em>Proceedings of the American Academy of\nArts and Sciences</em>, 80(1): 61–77. doi:10.2307/20023635",
                "1952, <em>Fundamentals of Concept Formation in Empirical\nScience</em>, Chicago: University of Chicago Press.",
                "1958, “The Theoretician’s Dilemma”, in\n<em>Concepts, Theories, and the Mind-Body Problem</em>, (Minnesota\nStudies in the Philosophy of Science, vol. II), Herbert Feigl, Michael\nScriven, and Grover Maxwell (eds.), Minneapolis: University of\nMinnesota Press, pp. 37–98.\n [<a href=\"http://mcps.umn.edu/assets/pdf/2.2_Hempel.pdf\" target=\"other\">Hempel 1958 available online</a>]",
                "1960, “Inductive Inconsistencies”, <em>Synthese</em>,\n12(4): 439–469. doi:10.1007/BF00485428",
                "1961, “Rational Action”, <em>Proceedings and Addresses\nof the American Philosophical Association</em>, 35: 5–23.\ndoi:10.2307/3129344",
                "1962a, “Deductive-Nomological vs. Statistical\nExplanation”, in <em>Scientific Explanation, Space &amp;\nTime</em>, (Minnesota Studies in the Philosophy of Science, vol. III),\nHerbert Feigl and Gordon Maxwell (eds.), Minneapolis: University of\nMinnesota Press, pp. 98–169.\n [<a href=\"http://mcps.umn.edu/assets/pdf/3.3.1_Hempel.pdf\" target=\"other\">Hempel 1962a available online</a>]",
                "1962b, “Explanation in Science and in History”, in\n<em>Frontiers of Science and Philosophy</em>, Robert Garland Colodney\n(ed.), Pittsburgh, PA: University of Pittsburgh Press, pp.\n9–33.",
                "1965a, “Postscript (1964)”, in Hempel 1965d:\n47–51.",
                "1965b, “Empiricist Criteria of Cognitive Significance:\nProblems and Changes”, in Hempel 1965d: 101–119.",
                "1965c, “Aspects of Scientific Explanation”, in Hempel\n1965d: 331–496.",
                "1965d, <em>Aspects of Scientific Explanation</em>, New York, NY:\nFree Press.",
                "1966a, <em>Philosophy of Natural Science</em>, Englewood Cliffs,\nNJ: Prentice-Hall.",
                "1966b, “Recent Problems of Induction”, in Colodny\n1966: 112–134.",
                "1968, “Maximal Specificity and Lawlikeness in Probabilistic\nExplanation”, <em>Philosophy of Science</em>, 35(2):\n116–133. doi:10.1086/288197",
                "1970, “On the ‘Standard Conception’ of\nScientific Theories”, in <em>Theories &amp; Methods of Physics\nand Psychology</em>, (Minnesota Studies in the Philosophy of Science,\nvol. IV), Michael Radner and Stephen Winokur (eds.), Minneapolis, MN:\nUniversity of Minnesota Press, 142–163.\n [<a href=\"http://mcps.umn.edu/assets/pdf/4.4_Hempel.pdf\" target=\"other\">Hempel 1970 available online</a>]",
                "1979, “Scientific Rationality: Analytic vs. Pragmatic\nPerspectives”, in Théodore F. Geraets (ed.),\n<em>Rationality To-Day</em>, Ottawa, Canada: The University of Ottowa\nPress, 46–58.",
                "1981, “Turns in the Evolution of the Problem of\nInduction”, <em>Synthese</em>, 46(3): 193–404.\ndoi:10.1007/BF01130050",
                "1983, “Valuation and Objectivity in Science”, in\n<em>Physics, Philosophy, and Psychoanalysis: Essays in Honor of Adolf\nGrunbaum</em>, Robert S. Cohen and Larry Laudan (eds.), Dordrecht, The\nNetherlands: Kluwer, 73–100.",
                "1988a, “Limits of a Deductive Construal of the Function of\nScientific Theories”, in E. Ullmann-Margalit (ed.), <em>Science\nin Reflection. The Israeli Colloquium</em>, (Volume 3), Dordrecht, The\nNetherlands: Kluwer, 1–15.",
                "1988b, “Provisos: A Problem Concerning the Inferential\nFunction of Scientific Theories”, <em>Erkenntnis</em>, 28(2):\n147–164. doi:10.1007/BF00166441\n</ul>\n<h3 id=\"PrimSourCoauWork\">"
            ],
            "Primary Sources: Coauthored Works": [
                "</h3>\n<ul class=\"hanging\">",
                "Hempel, Carl G. and Paul Oppenheim, 1945, “A Definition of\n‘Degree of Confirmation’”, <em>Philosophy of\nScience</em>, 12(2): 98–115. doi:10.1086/286852",
                "–––, 1948, “Studies in the Logic of\nExplanation”, <em>Philosophy of Science</em>, 15(2):\n135–175. doi:10.1086/286983\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSourWorkHemp\">Primary Sources: Works by Hempel</h3>\n<ul class=\"hanging\">\n<li>1942, “The Function of General Laws in History”,\n<em>Journal of Philosophy</em>, 39(2): 35–48.\ndoi:10.2307/2017635</li>\n<li>1945a, “Studies in the Logic of Confirmation”,\n<em>Mind</em>, 54(213): 1–26 and 54(214):97–121.\ndoi:10.1093/mind/LIV.213.1 doi:10.1093/mind/LIV.214.97</li>\n<li>1945b, “Geometry and Empirical Science”, <em>American\nMathematical Monthly</em>, 52(1): 7–17. doi:10.2307/2304830</li>\n<li>1945c, “On the Nature of Mathematical Truth”,\n<em>American Mathematical Monthly</em>, 52(10): 543–556.\ndoi:10.2307/2306103</li>\n<li>1950, “Problems and Changes in the Empiricist Criterion of\nMeaning” <em>Revue Internationale de Philosophie</em>, 41(11):\n41–63.</li>\n<li>1951, “The Concept of Cognitive Significance: A\nReconsideration”, <em>Proceedings of the American Academy of\nArts and Sciences</em>, 80(1): 61–77. doi:10.2307/20023635</li>\n<li>1952, <em>Fundamentals of Concept Formation in Empirical\nScience</em>, Chicago: University of Chicago Press.</li>\n<li>1958, “The Theoretician’s Dilemma”, in\n<em>Concepts, Theories, and the Mind-Body Problem</em>, (Minnesota\nStudies in the Philosophy of Science, vol. II), Herbert Feigl, Michael\nScriven, and Grover Maxwell (eds.), Minneapolis: University of\nMinnesota Press, pp. 37–98.\n [<a href=\"http://mcps.umn.edu/assets/pdf/2.2_Hempel.pdf\" target=\"other\">Hempel 1958 available online</a>]</li>\n<li>1960, “Inductive Inconsistencies”, <em>Synthese</em>,\n12(4): 439–469. doi:10.1007/BF00485428</li>\n<li>1961, “Rational Action”, <em>Proceedings and Addresses\nof the American Philosophical Association</em>, 35: 5–23.\ndoi:10.2307/3129344</li>\n<li>1962a, “Deductive-Nomological vs. Statistical\nExplanation”, in <em>Scientific Explanation, Space &amp;\nTime</em>, (Minnesota Studies in the Philosophy of Science, vol. III),\nHerbert Feigl and Gordon Maxwell (eds.), Minneapolis: University of\nMinnesota Press, pp. 98–169.\n [<a href=\"http://mcps.umn.edu/assets/pdf/3.3.1_Hempel.pdf\" target=\"other\">Hempel 1962a available online</a>]</li>\n<li>1962b, “Explanation in Science and in History”, in\n<em>Frontiers of Science and Philosophy</em>, Robert Garland Colodney\n(ed.), Pittsburgh, PA: University of Pittsburgh Press, pp.\n9–33.</li>\n<li>1965a, “Postscript (1964)”, in Hempel 1965d:\n47–51.</li>\n<li>1965b, “Empiricist Criteria of Cognitive Significance:\nProblems and Changes”, in Hempel 1965d: 101–119.</li>\n<li>1965c, “Aspects of Scientific Explanation”, in Hempel\n1965d: 331–496.</li>\n<li>1965d, <em>Aspects of Scientific Explanation</em>, New York, NY:\nFree Press.</li>\n<li>1966a, <em>Philosophy of Natural Science</em>, Englewood Cliffs,\nNJ: Prentice-Hall.</li>\n<li>1966b, “Recent Problems of Induction”, in Colodny\n1966: 112–134.</li>\n<li>1968, “Maximal Specificity and Lawlikeness in Probabilistic\nExplanation”, <em>Philosophy of Science</em>, 35(2):\n116–133. doi:10.1086/288197</li>\n<li>1970, “On the ‘Standard Conception’ of\nScientific Theories”, in <em>Theories &amp; Methods of Physics\nand Psychology</em>, (Minnesota Studies in the Philosophy of Science,\nvol. IV), Michael Radner and Stephen Winokur (eds.), Minneapolis, MN:\nUniversity of Minnesota Press, 142–163.\n [<a href=\"http://mcps.umn.edu/assets/pdf/4.4_Hempel.pdf\" target=\"other\">Hempel 1970 available online</a>]</li>\n<li>1979, “Scientific Rationality: Analytic vs. Pragmatic\nPerspectives”, in Théodore F. Geraets (ed.),\n<em>Rationality To-Day</em>, Ottawa, Canada: The University of Ottowa\nPress, 46–58.</li>\n<li>1981, “Turns in the Evolution of the Problem of\nInduction”, <em>Synthese</em>, 46(3): 193–404.\ndoi:10.1007/BF01130050</li>\n<li>1983, “Valuation and Objectivity in Science”, in\n<em>Physics, Philosophy, and Psychoanalysis: Essays in Honor of Adolf\nGrunbaum</em>, Robert S. Cohen and Larry Laudan (eds.), Dordrecht, The\nNetherlands: Kluwer, 73–100.</li>\n<li>1988a, “Limits of a Deductive Construal of the Function of\nScientific Theories”, in E. Ullmann-Margalit (ed.), <em>Science\nin Reflection. The Israeli Colloquium</em>, (Volume 3), Dordrecht, The\nNetherlands: Kluwer, 1–15.</li>\n<li>1988b, “Provisos: A Problem Concerning the Inferential\nFunction of Scientific Theories”, <em>Erkenntnis</em>, 28(2):\n147–164. doi:10.1007/BF00166441</li>\n</ul>\n<h3 id=\"PrimSourCoauWork\">Primary Sources: Coauthored Works</h3>\n<ul class=\"hanging\">\n<li>Hempel, Carl G. and Paul Oppenheim, 1945, “A Definition of\n‘Degree of Confirmation’”, <em>Philosophy of\nScience</em>, 12(2): 98–115. doi:10.1086/286852</li>\n<li>–––, 1948, “Studies in the Logic of\nExplanation”, <em>Philosophy of Science</em>, 15(2):\n135–175. doi:10.1086/286983</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abduction",
            "Carnap, Rudolf",
            "conditionals",
            "confirmation",
            "creationism",
            "dispositions",
            "essential vs. accidental properties",
            "Goodman, Nelson",
            "Kuhn, Thomas",
            "laws of nature",
            "Popper, Karl",
            "probability, interpretations of",
            "Quine, Willard Van Orman",
            "Reichenbach, Hans",
            "science: theory and observation in",
            "scientific explanation"
        ],
        "entry_link": [
            {
                "../abduction/": "abduction"
            },
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../conditionals/": "conditionals"
            },
            {
                "../confirmation/": "confirmation"
            },
            {
                "../creationism/": "creationism"
            },
            {
                "../dispositions/": "dispositions"
            },
            {
                "../essential-accidental/": "essential vs. accidental properties"
            },
            {
                "../goodman/": "Goodman, Nelson"
            },
            {
                "../thomas-kuhn/": "Kuhn, Thomas"
            },
            {
                "../laws-of-nature/": "laws of nature"
            },
            {
                "../popper/": "Popper, Karl"
            },
            {
                "../probability-interpret/": "probability, interpretations of"
            },
            {
                "../quine/": "Quine, Willard Van Orman"
            },
            {
                "../reichenbach/": "Reichenbach, Hans"
            },
            {
                "../science-theory-observation/": "science: theory and observation in"
            },
            {
                "../scientific-explanation/": "scientific explanation"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=hempel\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/hempel/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=hempel&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/hempel/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=hempel": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/hempel/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=hempel&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/hempel/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Burkhart, Ford,\n “<a href=\"http://www.nytimes.com/1997/11/23/us/carl-g-hempel-dies-at-92-applied-science-to-philosophy.html\" target=\"other\">Carl G. Hempel Dies at 92; Applied Science to Philosophy</a>”,\n <em>The New York Times</em> (November 23, 1997).",
            "“<a href=\"http://digital.library.pitt.edu/cgi-bin/f/findaid/findaid-idx?c=ascead&amp;rgn=main&amp;view=text&amp;didno=US-PPiU-asp199901\" target=\"other\">Carl Gustav Hempel Papers</a>”,\n <em>University of Pittsburgh, University Library System</em>.",
            "“<a href=\"http://www.newworldencyclopedia.org/entry/Carl_Hempel\" target=\"other\">Hempel, Carl Gustav</a>”,\n <em>New World Encyclopedia</em>.",
            "Murzi, Mauro,\n “<a href=\"http://www.iep.utm.edu/hempel/\" target=\"other\">Carl Gustav Hempel (1905–1997)</a>”,\n <em>Internet Encyclopedia of Philosophy</em>"
        ],
        "listed_links": [
            {
                "http://www.nytimes.com/1997/11/23/us/carl-g-hempel-dies-at-92-applied-science-to-philosophy.html": "Carl G. Hempel Dies at 92; Applied Science to Philosophy"
            },
            {
                "http://digital.library.pitt.edu/cgi-bin/f/findaid/findaid-idx?c=ascead&rgn=main&view=text&didno=US-PPiU-asp199901": "Carl Gustav Hempel Papers"
            },
            {
                "http://www.newworldencyclopedia.org/entry/Carl_Hempel": "Hempel, Carl Gustav"
            },
            {
                "http://www.iep.utm.edu/hempel/": "Carl Gustav Hempel (1905–1997)"
            }
        ]
    }
}