{
    "url": "heredity",
    "title": "Heritability",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Stephen M. Downes\n<s.downes@utah.edu>\nLucas Matthews\n<lucasjohnmatthews@gmail.com>",
        "author_links": [
            {
                "http://www.hum.utah.edu/philosophy/faculty/downes/": "Stephen M. Downes"
            },
            {
                "mailto:s%2edownes%40utah%2eedu": "s.downes@utah.edu"
            },
            {
                "mailto:lucasjohnmatthews%40gmail%2ecom": "lucasjohnmatthews@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"http://www.hum.utah.edu/philosophy/faculty/downes/\" target=\"other\">Stephen M. Downes</a>\n&lt;<a href=\"mailto:s%2edownes%40utah%2eedu\"><em>s<abbr title=\" dot \">.</abbr>downes<abbr title=\" at \">@</abbr>utah<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nLucas Matthews\n&lt;<a href=\"mailto:lucasjohnmatthews%40gmail%2ecom\"><em>lucasjohnmatthews<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jul 15, 2004",
        "substantive revision Wed Dec 18, 2019"
    ],
    "preamble": "\n\nA heritable trait is most simply an offspring’s trait that\nresembles the parents’ corresponding trait more than it\nresembles the same trait in a random individual in the\npopulation. Inheritance or heredity was a focus of systematic research\nbefore its inclusion as a key concept within evolutionary theory. An\ninfluential 18th and early 19th century theory\nof heredity was preformationism. This view took several forms, each\nmaintaining that organisms were passed on from one generation to the\nnext, miniature and yet fully formed, and development was simply the\ngrowth of the miniature organism. Subsequent accounts of heredity\nincluded the theory that organisms inherited traits that their parents\nhad developed through response to various environmental\npressures. This view was widely held during the 19th\ncentury and usually attributed to Lamarck. Although Darwin also at\ntimes defended aspects of Lamarck’s view, he also clearly\narticulates and defends the view that evolutionary change results from\nnatural selection acting upon inherited traits under\nvariation. Weismann’s experimental refutation of the inheritance\nof acquired traits paved the way for the combination of Darwin and\nMendel’s views of the nature of heredity. The systematic study\nof heredity in the 20th century focused on the gene as the\nunit of heredity. (There is a vast amount of helpful work on the\nhistory of heredity including Keller (2002), Griesemer (1994), Morange\n(1998), Moss (2003), Sapp (2003), Sarkar (1998), Wade (1992), Winther\n(2000; 2001) and contributors to Buerton et al. (eds.) (2000).) Two\ntraditions now dominate the study of heredity: population genetics and\nmolecular biology. The notion of a quantitative measure of the\nheritability of any given trait comes from population genetics and\nheritability measures are commonly used in behavioral genetics (Plomin\net al. 1990 and Plomin et al. 1997 and see Panofsky 2014, Tabery 2014\nand Taylor 2014 for critical reflection on behavioral genetics and\nheritability analysis). The idea that what is inherited is a stock of\nDNA, or the information contained in the DNA sequence, comes from\nmolecular biology.\n\nPhilosophical discussions of heredity have predominantly focused on\nthe sustainability of heritability analyses. Here we introduce the\nconcept of heritability, alternate approaches to determining the\nheritability of traits and the philosophical problems associated with\nthese alternate approaches.\n",
    "toc": [
        {
            "#TermIssu": "1. Terminological issues"
        },
        {
            "#HeriPopuGene": "2. Heritability and Population Genetics"
        },
        {
            "#MeasHeriGaltGWAS": "3. Measuring heritability: From Galton to GWAS"
        },
        {
            "#PhilIssuArisTwinStudHeriAnal": "4. Philosophical issues arising from twin studies and heritability analysis"
        },
        {
            "#MissHeriRelaPhilIssuArisGWAS": "5. Missing Heritability and related philosophical issues arising from GWAS"
        },
        {
            "#LookForw": "6. Looking forward"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Terminological issues\n\nThe term “heritable” applies to traits that vary in the\npopulation and are more similar in parents and offspring than they are\nin randomly selected individuals in the population. We inherit\nnumerous attributes from our parents including their religious beliefs\nand, if we are lucky, their vast fortunes. The kinds of hereditary\ntraits that biologists are interested in are those that are reliably\ntransmitted from one generation to the next as a matter of\nbiology. Darwin (1859 [1968]), working without the advantages that\ngenetics would later bring, discussed hereditary traits at the level\nof phenotypes. Darwin demonstrated that natural selection sorts among\nhereditary variations, for example, the height of an organism, its\nweight, the color of its coat and so on. Most contemporary discussions\nof heredity constrain hereditary traits to those that can be\ndemonstrated to be passed on genetically. The concept of\n“heritability” was introduced “to quantify the level\nof predictability of passage of a biologically interesting phenotype\nfrom parent to offspring” (Feldman, 151). Heritability is\nusually assessed by complex statistical analysis, careful\nexperimentation or both.\n\nDiscussions of heredity invite confusions between mechanisms\nresponsible for individual development and mechanisms responsible for\nthe transmission of traits from one generation to the next. Genes are\nthe standard units of inheritance discussed in biology. Genes are also\ntaken to be the most important causal component in the development of\nan organism’s traits. Methods derived from population genetics\nto assess heritability provide no information about the causal\nmechanisms contributing to the development of an individual’s\ntraits. Population geneticists study the patterns of transmission of\ntraits in populations from one generation to the next. Molecular\nbiologists identify coding sequences of DNA and hence the proteins\nthat these sequences produce in the developing organism. Working\ntogether, molecular biologists and population geneticists can produce\na convergent account of a particular gene, providing both its pattern\nof transmission and an account of its role in development. For\nexample, medical geneticists may discover a pattern of inheritance for\na disease in a family that leads them to hypothesize that there is a\ngene (or a number of genes) responsible for the development of the\ntrait in individual humans. Molecular analysis may then lead to the\ndiscovery of a sequence of DNA that codes for an unusual protein that\nis in part responsible for the development of the symptoms of the\ndisease. Finally, population genetics techniques, such as heritability\nanalysis, may then be applied to mechanisms discovered by molecular\nbiologists.\n2. Heritability and Population Genetics\n\nMendelian genetics provides laws that govern the passing on of\ndiscrete traits from one generation to the next. For example, Mendel\nexperimentally demonstrated particular patterns of inheritance for\nsmooth and wrinkled peas in a population of pea plants. Discrete or\ndiscontinuous traits contrast with continuous or quantitative traits.\nHeight in humans and leaf number in trees are continuous traits.\nContinuous traits vary on a continuum that can be represented as a\nnormal distribution, graphed as a bell curve. Most philosophical\ndiscussion about heredity and heritability arises from the study of\ncontinuous traits.\n\nThe study of quantitative or continuous traits can be carried out by\nlooking simply at phenotypes. For example, if a population of plants\nvaries in height we can ask how much of this variation is due to\ngenes. Assessing the proportion of the variation of a trait in a\npopulation that is due to genes is achieved by a statistical method\ncalled the analysis of variance. Once this analysis has been carried\nout a simple formula provides a number between 0 and 1 that is the\nheritability measure for the trait in question. We use a few simple\nexamples to illustrate the important concepts involved in producing\nheritability measures.\n\nBefore we consider the analysis of variance and its contribution to\nheritability measures, it is helpful to understand the general concept\nof heritability. Heritability is a measure of genetic influence on\nvariation. If a trait has high heritability, its varying from\nindividual to individual in a population can be explained genetically.\nAn imaginary example illustrates one way of assessing heritability.\nSay we have two students from a class and student a is\n6′2″ and student b is 4′2″. To discover\nthe influence of genes on height, we could clone both students and\nthen swap the clones’ environments and see what happens. In the\nfigure below, the environments that a and b grew up in\nare \\(\\rE a\\) and \\(\\rE b\\). Clones of a and b are \\(\\rC\na\\) and \\(\\rC b\\). \n\n\\[\n\\begin{array}{cccl} \n& \\rE a & \\rE b & \\text{Height results} \\ldots \\\\\\hline \n1 & \\rC b=4^{\\prime}2^{\\prime\\prime} & \\rC a=6^{\\prime}2^{\\prime\\prime} & \\text{from genes} \\\\\\hline \n2 & \\rC b=5^{\\prime}8^{\\prime\\prime} & \\rC a=5^{\\prime}8^{\\prime\\prime} & \\text{from genes and environment} \\\\\\hline \n3 & \\rC b=6^{\\prime}2^{\\prime\\prime} & \\rC a=4^{\\prime}2^{\\prime\\prime}  & \\text{entirely from environment} \\\\\\hline \n\\end{array}\n\\]\n\n\nA scenario like 2 is the most likely outcome. Of course we can’t\nclone humans (or faithfully replicate the environments they grow up\nin). We can, however, do this with plants and other kinds of\nexperimental organisms and as a result we can get a good sense of the\ncontribution of genes to variation in a phenotypic trait.\n\nHeritability can be estimated in humans by comparing resemblance in\nthe phenotypic traits of twins (See Section 4. For a more detailed\ndiscussion of twin studies.). Twin studies make the following\nassumptions: Monozygotic, (identical), twins share all their genes and\ntheir environment but dizygotic, (fraternal), twins share half their\ngenes and their environment. For any given trait, say height, we get\nthe following results:\n\nIf heritability is high and variation is due mostly to genes, then\nmonozygotic twins will be closer in height than fraternal twins.\n\n\nIf heritability is low and variation in height is due mostly to the\nenvironment, then monozygotic twins will be as different in height\nfrom one another as dizygotic twins.\n\nFinally, we can get a sense of the heritability of a trait by finding\nthe slope of the regression line on the plots of offspring value for a\ntrait graphed with parental value. If the slope is 1, the trait is\nentirely genetic and if the slope is 0, then the trait is not genetic\nat all. If the variation among individuals is due to variation in\ntheir genes, then offspring ought to resemble their parents.\nHeritability is always a value between 1 and 0. In the graph below\nvalues for mid-parent height and mid-offspring height are plotted for\na small sample population (mid-parent height is the average of the\nheight of both parents). The slope of the regression line is .75,\nwhich indicates high heritability. (It should be stressed that this is\na very informal presentation of this kind of estimation of\nheritability and for this approach to provide any useful results\nimportant constraints on the nature of the population and the relevant\nenvironment would have to be satisfied.)\n\n\n\nFigure 1.\n\n\nSo far we have introduced methods of measuring or calculating\nheritability that are somewhat intuitive. The problem is that these\nmethods do not acknowledge all that is involved in the production of\nvariation in the quantitative traits of organisms in a population. If\nwe stick to the example of variation in height in a sample population\nof humans, we will discover that in most representative samples,\nheights are distributed more or less normally. The variance in height\nis defined as the average of the squared difference between each\nmeasured height and the mean height for the population. Variance in\nphenotype or phenotypic variance is symbolized as \\(V_P\\). (From here\nuntil the end of this section we adopt a specific strategy for\npresenting the equations used in spelling out heritability relations.\nWe start out, with equation (1) below, by presenting the simplest\nversion of the relevant equations. Simple equations such as (1) below\nare rarely ever satisfied but are routinely presented as adequate in\nelementary introductions to behavioral genetics. Subsequent equations\nin the sequence below render the relevant situation more accurately.\nPopulation geneticists endorse variants of (1′) below and do not\nendorse (1).) \n\n\\[\\tag{1} V_P = V_G + V_E \\]\n\n\nEquation (1) simply says that the phenotypic variance is the variance\ndue to genes plus the variance due to the organisms’\nenvironment. Behavioral geneticists and psychologists introduce\nheritability in the following way: Heritability is the proportion of\nphenotypic variance that is attributable to genotypic variance:\nheritability \\(= \\bfrac{V_G}{V_P}\\) (Biologists will also sometimes\ntalk of “environmentability”, which is\n\\(\\bfrac{V_E}{V_P}\\).)\n\nThis notion of heritability is called broad sense heritability,\n\\(h_b^2\\) , and is “the proportion of phenotypic differences due\nto all sources of genetic variance” (Plomin 1990, 234). Narrow\nsense heritability, \\(h^2\\), is “the proportion of phenotypic\nvariance due solely to additive genetic variance” (Plomin 1990,\n234). \n\n\\[\\tag{2} h_b^2 = \\frac{V_G}{V_P} \\] \\[\\tag{3} h^2 = \\frac{V_A}{V_P} \\]\n\n\n“Additive genetic variation \\((V_{A})\\) is variation among\nindividuals due to the additive effects of genes” (Freeman and\nHeron, 206). For example, variation in height of organisms could\nresult from the contribution of several alleles at a locus where each\nallele contributes more height to the organism. More precisely, allele\nA could contribute .5 units to an organism’s height,\nallele a another .5 units and so on. A contrast with additive\ngenetic variance is dominance variance \\((V_{D})\\). In this case, say\ntwo alleles (A and a) are responsible for the\norganism’s height. An organism with aa is 1.0 units high,\nan organism with AA is 2.0 units high but an organism with\nAa is also 2.0 units high. Total genetic variance,\n\\(V_G\\), is actually the sum of all the genetic variance. In the\nsimplified case presented here this is \n\n\\[\\tag{4} V_G = V_A + V_D \\]\n\n\nThe implied equation for \\(V_P\\) from the discussion so far is\n\n\\[\\tag{\\(1^{\\prime}\\)} V_P = V_A + V_D + V_E \\]\n\n\nBut this equation still oversimplifies the situation and requires more\nrefining to deal with quantitative traits. Variance in phenotype can\nresult from gene interaction effects, or epistatic variance,\n\\(V_{I}\\). This occurs when alleles at one locus have an effect on the\nphenotype that is dependent upon alleles at one or more other loci.\nFurther, there may be a contribution to phenotypic variance from\ngene/environment interaction, \\(V_{G\\times E}\\) (See Tabery 2014 for a\ndetailed discussion of gene/environment interaction.). This occurs\nwhen the effect of the environment on the phenotype differs between\ngenotypes. Finally, \\(V_P\\) can be affected by non-random correlations\nbetween genotypes and environments referred to as gene-environment\ncovariation, \\(\\COV(G,E)\\). For example, if plants with a genotype\nthat tends to produce large plants also select nutrient- rich\nenvironments, by root growth or seed dispersal, and plants with a\ngenotype that tends to produce small plants also select nutrient- poor\nenvironments, the variance in height would be increased. If the\nrelation were switched the variance would decrease (Futuyma\n1998). Factoring all the above in we now have the following:\n\n\\[\\tag{\\(1^{\\prime}\\)} V_P = V_A + V_D + V_I + V_E + V_{G\\times E} + \\COV(G,E) \\]\n\n\nAnd \n\n\\[\\tag{\\(4^{\\prime}\\)} V_G = V_A + V_D + V_I \\]\n\n\nThe assumption made by many evolutionary biologists is that \\(V_I,\nV_{G\\times E}\\) and \\(\\COV(G,E)\\) are generally small and the most\nimportant component of variance from an evolutionary standpoint is\n\\(V_A\\). As a result, evolutionary biologists are usually interested\nin \\(h^2 (= \\bfrac{V_A}{V_P})\\). In contrast, psychologists and\nbehavioral geneticists are more interested in \\(h_b^2 (=\n\\bfrac{V_G}{V_P})\\). Psychologists are interested in the contribution\nof genes to human psychological traits whereas evolutionary biologists\nuse heritability measures to predict and measure the response of a\ntrait to selection. The relevant equation here is \n\n\\[\\tag{5} h^2 = \\frac{R}{S} \\]\n\n\nwhere, R is response to selection and S is the selection\ndifferential. Heritability in this context is referred to as realized\nheritability.\n\nPhilosophical discussion over measuring heritability has arisen mostly\nfrom the use of \\(h_b^2\\) measures in behavioral genetics and\npsychology. Much of this discussion takes off from a paper by Lewontin\n(1974) in which he argues that the analysis of variance cannot provide\nus with answers to questions about how much genes contribute to\nvariance in a given trait. Before we turn to this and related\ndiscussions, we provide more detail on how heritability is measured in\nhumans.\n3. Measuring heritability: From Galton to GWAS\n\nFrancis Galton promoted a version of Darwin’s account of\ninheritance that clearly identified an internal, material contribution\nto hereditary traits. He proposed the distinction between nature and\nnurture, arguing that traits due to nature were the products of\ninherited biological material. He also was the first to propose the\nstudy of human twins as a way of understanding the contribution of\nnature, as opposed to nurture, to human traits (Burbridge 2001; see\nalso Kronfeldner 2018). Galton’s early work set the basis for a\nparadigm in behavior genetics: twin and family studies. In studies of\nplants and other organisms, genetic makeup and environment can be\nsystematically varied to assess the relative impact of genes and\nenvironment on phenotypic traits. Twin studies are human behavioral\ngeneticists’ analogue to such experiments (See, e.g.,\nShaffner 2016). By tracking similarities and differences between\ngroups of genetically related individuals reared in similar\nenvironments, twin and family studies permit some scientific\ninvestigation into sources of variance attributable to genetics and\nenvironment. The predominant tool for practitioners in the field is\nthe statistical ‘ACE model’ (figure X)\n\n\n\n\nThe ACE model is a factor analytic model that partitions phenotypic\nvariance (represented with boxes) into three latent components\n(represented with circles). The first latent factor, ‘A’\nrepresents ‘additive’ genetic variance and captures\ngenetic similarities and dissimilarities between twin pairs, as\nmonozygotic (MZ) ‘identical’ twins share roughly 100% of\ntheir DNA while dizygotic (DZ) ‘fraternal’ twins share\nroughly 50% of their DNA, just like normal siblings. The component\n‘C’ represents ‘common’ environment,\nsignifying environmental variance that is shared by twin pairs reared\ntogether. For example, because both MZ and DZ twin pairs live in the\nsame home, the correlation between their shared environment equals 1.\nFinally, ‘E’ represents ‘unique’ or\nnon-shared environmental variance, capturing environmental variables\nthat vary between twin pairs. In effect, it is the environmental\nvariation that is not shared by twins outside the home which ends up\ngetting couched as ‘E’, as is the case when twins\nattend different institutions or undergo different life events. \n\nThe ACE model is effectively a visual representation—in the form\nof a path analysis—of the underlying mathematics of heritability\nestimation, known as ‘Falconer’s formula’ (Falconer\nand McKay 1998). The formula is derived from an observed population\nstatistic: the phenotypic correlation between pairs of MZ and DZ\ntwins. For any phenotype the MZ correlation or\n‘\\(r_{\\MZ}\\)’ is typically higher than the DZ correlation\nor ‘\\(r_{\\DZ}\\)’. Perhaps unsurprisingly, genetically\nidentical twins are more similar than fraternal twins. The implication\nis that the greater the genetic similarity, the greater the phenotypic\nsimilarity. Thus, narrow-sense, quantitative genetic heritability is\nintuitively defined as the difference between MZ and DZ\ncorrelations: the greater the difference, the higher the heritability.\nOn the flip side, if there is minimal difference between MZ and DZ\ncorrelations, it would imply that genetics have little to do with\nvariance in the trait in question, and result in a low heritability\nestimate.\n\nFalconer’s formula starts from the simple observation that MZ\ntwin pairs share two of the three components in common: 100% of their\ngenes and 100% of their common environment. Thus, MZ correlation are\ntreated as the sum of A and C: \n\n\\[ r_{\\MZ} = A + C\\]\n\n\nSimilarly, DZ twin pares share 100% of their common environment, but\nonly half their genetic relatedness. Thus, the DZ correlation is the\nsum of half additive genetic variance and common environment:\n\n\\[r_{\\DZ} = \\frac{A}{2} + C\\]\n\n\nWith these definitions in place, Falconer’s formula permits\nheritability estimation by calculating the difference between MZ and\nDZ correlations: \n\n\\[\n\\begin{align}\nr_{\\MZ} - r _{\\DZ} & =  A - \\frac{A}{2} + C - C\\\\\nr_{\\MZ} - r _{\\DZ} & =  A - \\frac{A}{2}\\\\\n\\therefore A & = 2\\left (r_{\\MZ} - r_{\\DZ}\\right)\n\\end{align}\n\\]\n\n\nWith narrow-sense heritability defined, one may deduce the formulas\nfor estimating shared (C): \n\n\\[\n\\begin{align}\nr_{\\DZ} & = \\frac{A}{2} +C \\\\\nr_{\\DZ} &= \\frac{r_{\\MZ} -C}{2} + C\\\\\n2 r_{\\DZ} & = r_{\\MZ} - C + 2C\\\\\n2 r_{\\DZ} & = r_{\\MZ}  + C\\\\\n\\therefore C&= 2 r_{\\DZ} - r_{\\MZ}\\\\\n\\end{align}\n\\]\n\n\nFinally, non-shared environment may be derived from the assumption\nthat genetic similarity, shared environment, and non-shared\nenvironment comprise the total variance in an observed trait:\n\n\\[\n\\begin{align}\nA + C + E & =1 \\\\\n[ 2(r_{\\MZ} - r_{\\DZ})] + [2(r_{\\MZ} - r_{\\DZ})] + E & = 1\\\\\nr_{\\MZ} + E & = 1\\\\\n\\therefore E & =  1- r_{\\MZ}\\\\\n\\end{align}\n\\]\n\n\nConsider the following example. In a twin study, one conducts a study\nof height, revealing that \\(r_{\\MZ} = .95\\) and \\(r_{\\DZ} = .55.\\)\nWith this information, the basic techniques of quantitative genetics\nmay be used to partition said variance into sources attributable to\nshared genetics or environments. Starting with heritability:\n\n\\[\n\\begin{align}\nA & = 2(r_{\\MZ} - r_{\\DZ})\\\\\nA & = 2(.95-.55)\\\\\nA & = 2(.4) \\\\\nA & = .8 \\\\\n\\end{align}\n\\]\n\n\nAlthough philosophically contentious (for reasons discussed elsewhere\nin this entry), the outcome above suggests that 80% of the variance in\nheight in the studied population of twins reared together is\nattributable to genetic differences. To estimate non-shared\nenvironment (C), recall the formula derived earlier:\n\n\\[\n\\begin{align}\nC & = 2r_{\\DZ} - r_{\\MZ}\\\\\nC & = 2(.55) - .95\\\\\nC  & = .15\\\\\n\\end{align}\n\\]\n\n\nFinally, total variance in height attributable to non-shared\nenvironment: \n\n\\[\n\\begin{align}\nE & = 1 - r_{\\MZ}\\\\\nE & = 1 - .95 \\\\\nE & = .05\\\\\n\\end{align}\n\\]\n\n\nIn this example, 80% of the variance in height is attributable to\nadditive genetics (A = .8), 15% to shared environment (C\n= .15), and 5% to non-shared environment (E = .05).\n\nResearch on heritability is currently undergoing a major transition.\nFor nearly a century, heritability has been estimated in the\n‘traditional’ sense, through twin and family studies,\nwhich are silent with respect to the underlying biological units of\ngenetic transmission. Twin and family studies and the ACE model, that\nis, proceed from coarse-grained assumptions about genetic relatedness:\nMZ twin share roughly 100% of their genetic material, DZ just half. It\nwasn’t until Watson and Crick’s co-discovery of the double\nhelical model of DNA that geneticists could refine heritability\nestimation with attention to biological details. Too much has happened\nsince the discovery of DNA to detail here, such as linkage analysis\nand candidate gene studies, but a few key developments are integral to\nunderstanding the most recent approaches to estimating\nheritability.\n\nFirst, all modern approaches to heritability estimation are\nconstructed from empirical data on Single Nucleotide Polymorphisms\n(SNPs). In effect, SNPs are the fundamental units of genetic\ndifferences that occur between individuals. While genetic sequences\nbetween humans are greater than 99% identical, SNPs are the points that\ndiffer. From a blood or saliva sample, ‘SNP chips’ allow\nresearchers to acquire a large set of SNPs for an individual. Early\nSNP chips tracked 500,000 variants across the genome; recent\ntechnology allows SNP detection in the excess of millions. With the\ndevelopment of fast and cheap SNP chips within the past ten years, one\nnow has the ability to assess large populations of minute DNA-based\ndifferences between individuals, which confers a new approach to\nestimating heritability. Through a large family of approaches, Genome\nWide Association Studies (GWAS) identify statistical associations\nbetween SNPs and thousands of phenotypes, from physical traits (e.g.,\nheight, weight, BMI, etc.) to behavioral and psychiatric traits (e.g.,\nIQ, schizophrenia, depression, etc.). Historically, GWAS are conducted\nas case-control studies: SNP profiles are collected from one\npopulation of individuals who share a trait (such as high ADHD or\nmacular degeneration) and are compared to SNP profiles of a control\npopulation lacking in the trait under investigation. If it turns out\nthat populations, on average, with the trait of interest also share\ngenetic similarities, then GWAS will flag the relevant SNPs as\nstatistically significant.\n\nGWAS identify SNPs that are statistically correlated with phenotypes\nof interest. After nearly a century of twin and family studies\nconsistently demonstrating relatively high heritability of traits,\nthere was some expectation that early GWAS would find a few genes of\nlarge effect. GWAS results in this respect have been disappointing.\nWhile twin studies indicate that roughly 50% of the total variance in\ncognitive ability is explained by genetic differences, individual SNPs\nassociated with cognitive ability typically explain less than .04%\ntotal variance.\n\nOne simple method of increasing the amount of phenotypic variance\naccounted for by GWAS (sometimes referred to as\n‘h2GWAS’) is to sum the total\neffects of genome-wide significant SNP hits. The first efforts to do\nthis were met with disappointing results as well. Weedon et al. (2008)\nconducted a GWAS of height which identified 20 SNPs with a combined\neffect of 3%. These meager results inspired an impetus in the GWAS\ncommunity to conduct bigger and better studies that would be required\nto power the small effect sizes of individual SNPs. Bigger data meant\nmore SNPs, which meant more variance explained and, consequently,\nincreased h2GWAS. Even when summing the small\neffects of hundreds of genome-wide significant SNPs, variance\nexplained by GWAS results are still quite small. For example, the\ntraditional heritability of IQ is 50%, while the largest GWAS of IQ to\ndate explains less than 5% total variance (Plomin and von Stumm\n2018).\n\nIn an effort to increase the amount of phenotypic variance accounted\nfor by GWAS results, Yang et al. (2015) developed genome complex trait\nanalysis (GCTA), now referred to as ‘SNP heritability’ (or\nh2SNP). While traditional heritability is\nestimated from coarse-grain genetic similarity of related individuals,\nSNP heritability is estimated from fine-grain genetic similarity of\nunrelated individuals. SNP heritability now comprises a family of\nhighly sophisticated statistical techniques that seek to maximize\nproportions of phenotypic variance attributable to observed or imputed\nSNP variants. SNP heritability exhibits a few features worth\nattention. First, instead of limiting analysis to SNPs who meet the\nstrict p-value GWAS significance threshold, SNP heritability is\nderived by analyzing the complete set of SNPs for each participant\nsample—even those that are not associated with the trait of\ninterest. To this end, SNP heritability is biologically non-obvious.\nSecond, SNP heritability assumes linear additivity of SNP effects.\nThird, SNP heritability represents the current limit on the total\nvariance that could be explained by SNPs, for any given phenotype. So,\nfor example, if a polygenic score were maximally predictive, it would\nbe equivalent to SNP heritability. Fourth, SNP heritability is\nconsistently lower than twin heritability, for any behavioral trait.\nThis gap between twin heritability and SNP heritability is sometimes\nreferred to as the missing heritability problem, which we discuss in\nSection 5.\n4. Philosophical issues arising from twin studies and heritability analysis\n\nDiscussions of the viability of heritability measures were most heated\nin the 1970s and 1980s. In the 1970s discussions about IQ and race\ncame to a head (this issue was revisited in the 1990s with the\npublication of Herrnstein and Murray (1994)), and in the late 1970s\nand early 1980s sociobiology came under critical scrutiny. Both\nproponents of the hereditary nature of IQ and sociobiologists made a\nconnection between human behavioral traits and genes. Hereditarians in\nthe IQ debates explicitly relied upon twin heritability analyses such\nas those introduced above. Critics of sociobiology and hereditarianism\nover IQ included biologists, philosophers and many social scientists\nas well as many left-leaning political and social activists (See Gould\n(1981), Paul (1998) and Segerstråle (2000) for some of the\nrelevant history here).\n\nThe point of departure for many philosophers criticizing heritability\nanalysis is Lewontin’s (1974) paper on the analysis of variance.\n(It is worth noting that Lewontin’s paper is somewhat informal\nand should perhaps be best viewed as Lewontin’s attempt to pass\non the received wisdom among population geneticists at the time to a\nwider audience. The formal arguments Lewontin alludes to are presented\nin a number of places including Layzer (1974) (and later Kempthorne\n(1978)) and precursors to these arguments can be found in Hogben\n(1933) and can also be found in R.A. Fisher’s work.) Lewontin\nclaims that equation \\((1’)\\) above presents the most accurate\npicture of the contributions to phenotypic variance. He goes on to\nargue that \\(V_{I}, V_{G\\times E}\\) and \\(\\COV(G,E)\\) are not\nnegligible. In fact, he argues that these are always part and parcel\nof the variance in traits. As a result, apportioning the phenotypic\nvariance between genes and environment is no easy matter and standard\nanalyses of variance simply cannot come up with useful and informative\nvalues for \\(h_b^2\\) and \\(h^2\\). Lewontin also points out that many\nproponents of heritability measures mistakenly attribute the\nheritability values to individuals rather than populations. Further,\nhe argues that norms of reaction gave a more accurate picture of the\nrelations between genes, environment and phenotypic traits. A norm of\nreaction is a graph of a quantitative phenotype plotted as a function\nof environment for different genotypes. Many philosophers and\nbiologists have extended and refined Lewontin’s criticism of the\nanalysis of variance (e.g. Block 1995, Kitcher 1985, Sarkar 1998,\nSober 1988, Northcott 2006) and most share his conclusions that\nheritability measures are hard to come by and that norms of reaction\nare a superior way to examine gene/environment interactions.\n Lewontin (2006) later adds “The point of the (1974) paper\nwas to explain why the statistical partitioning of observed variation\nin phenotype into variance associated with variation in genetic\nrelationship as opposed to variance assigned to environmental\ndissimilarities does not, in fact, separate genetic and environmental\ncauses in development” (2006, 536). He adds that advances in\nmolecular genetics now make it “possible to provide a detailed\nmolecular analysis of the chain of causation between nucleotide\nsubstitution and cell development and function” (Lewontin, 2006,\n536). (Sober (1988) also emphasizes this aspect of Lewontin’s\ncriticism of the analysis of variance.) Lewontin makes clear what he\ntakes genetic causation to be: the causal chain from a DNA sequence to\na protein product taking place within cells of organisms. His point is\nthat statistical methods of population genetics and behavioral\ngenetics alone are not appropriate to the task of revealing genetic\ncauses construed this way. We revisit this issue in Section 5. recast\nin light of GWAS and other “molecular” techniques of\nmeasuring heritability.\n\nOne response to these kinds of criticisms is to emphasize caution in\nthe use of heritability measures and to re-emphasize Lewontin’s\npoint that such measures do not provide information about the traits\nof individuals (See e.g. Plomin et al. 1990; 1997, Hamer and Copeland\n1998). Kitcher (1985) pointed out in response to this line of defense\nthat words of caution do not seem to be enough and many behavioral\ngeneticists and psychologists still talk as if they can discover the\ngenetic components of human behavioral traits by using heritability\nanalyses. A second line of response is to argue that norms of reaction\nare almost impossible to generate for complex human traits and, as a\nresult, are not a serious contender in the business of ascertaining\nthe genetic causes of human traits. Lewontin himself introduced this\nproblem for norms of reaction. In organisms whose genotypes and\nenvironments can be exhaustively manipulated, a norm of reaction for a\nparticular trait can be produced. Lewontin cites early work on\nDrosophila larvae’s responses to temperature as\npioneering work of this kind. The problem for most human traits,\nparticularly human behavioral traits, is that we have no clear sense\nof either what the relevant genes to examine are or what the range of\nrelevant environments is. This response need not necessarily blunt\nLewontin’s critical attack on heritability measures, as in cases\nwhere a norm of reaction can be reliably produced, we do have more\ninformation about the relations between genes and environment than can\nbe provided by a standard analysis of variance. Further, attempts to\nexperimentally partition the contribution of genetic variance to\nphenotypic variance run into problems for human traits similar to the\nproblems presented by attempts to generate norms of reaction. The\nexamples in Section 2. above are artificial for a reason: it is hard\nto establish the relevant genotypes and environments that lead to\nvariance in human traits. The current consensus among philosophers of\nbiology is that heritability analyses are misleading about the genetic\ncauses of human traits but Pearson (2007) provides a cautious defense\nof the explanatory usefulness of heritability analyses. Omri Tal also\npresents modest defenses of heritability via his application of\nprobability to heritability analysis. He does this both in cases in\nwhich there is assumed to be no gene-environment interaction (2009)\nand in cases in which there is gene-environment interaction (2011).\nSesardic’s (1993 and 2005) work stands in stark contrast both\nthe anti-heritability consensus and the moderate and carefully\nmeasured support for heritability provided by Pearson and Tal.\nSesardic strongly supports heritability analyses and vehemently\ncriticizes critics of heritability analysis. Finally, work on norms of\nreaction (see e.g. Pigliucci 2001) since Lewontin’s invoking of\nthe measure reinforces his point about the information that can be\ngained from such analyses.\n\nThere is something of a consensus in most fields (e.g. philosophy of\nbiology, evolutionary biology, psychology and behavioral genetics)\nthat heritability measures (particularly \\(h_b^2\\) measures) only have\na very limited use. The consensus among philosophers of biology is\nthat broad heritability measures are uninformative but there are a few\ndissenting voices (e.g. Sesardic 1993 and 2005, Pearson 2007 and Tal\n2009 and 2011). (The notion of consensus used here is informal,\ntechniques in science studies and experimental philosophy of science\ncould be used to test claims of consensus.) Kaplan (2000) provides an\nintroduction to heritability and its use in behavioral genetics.\nSarkar (1998) presents a sophisticated (and technically quite\ndifficult) treatment of arguments against heritability. Freeman and\nHeron (1998) present a clear analysis of the problems with the use of\nheritability measures by proponents of the connection between IQ and\nrace (understanding this analysis requires some knowledge of\nstatistics). Block (1995) presents an overview of arguments against\nthe use of heritability measures in the IQ and race literature. This\noverview is helpful and specifically designed for a non-technical\naudience. Sober (1988) presents a defense of Lewontin’s (1974)\ncriticism of the use of the analysis of variance in assessing the role\nof genes in the formation of traits of individuals and Northcott\n(2006) provides further helpful analysis of Lewontin’s and\nSober’s work. Both Tabery (2014 and Taylor (2014 ) provide\nsustained criticism of heritability analysis via their alternate\nreflections on the nature/nurture debates.\n\nSesardic’s recent work is a criticism of those who invoke\nLewontin-style arguments against heritability analyses. He argues in\nfavor of hereditarianism by attacking its critics. He summarizes his\ncomplaint as follows: “For some reason in [the heritability]\ndebate philosophers have displayed a surprising lack of intellectual\ncuriosity and analytical acuity” (2005, 9). This is because\n“they hastily accepted anti-hereditarian arguments that\npossessed only superficial plausibility” and “are often\npoorly informed about basic scientific facts in the very domain of\ntheir explorations” (2005, 9). Sesardic’s criticism is\npolemical and does not introduce any new techniques in heritability\nanalysis to the philosophical audience. Rather, he relies on a\nrecapitulation of earlier views, such as those of Jensen, one of the\noriginal targets of Lewontin’s critique. There are several\nspirited responses to Sesardic’s book (Tabery’s 2006 and\n2009b reviews are examples) and Gri Oftedal (2005) presents a\nclarification of the issues at stake between Sesardic and\nLewontin.\n Part of what is at stake between followers of Lewontin and\nSesardic is whether or not \\(V_{GxE}\\) and other components of\nvariance are negligible or significant. This issue is not purely\nphilosophical and can and has been tackled experimentally. Tabery\n(2009a and 2014) draws attention to a longitudinal study by\npsychologists Caspi and Moffitt, who show GxE effects in a\nlongitudinal study of human anti-social behavior disorders, in support\nof a view in line with Lewontin’s. Douglas Wahlsten also pursues\nthis issue in much of his experimental work (Wahlsten 1990 summarizes\nhis theoretical views and Wahlsten and Gottfried 1997 is a good survey\nof some of the relevant experimental work on animals).  Further,\nunderstanding gene-environment covariance, \\(\\COV(G,E)\\), as part of\nheritability has led some to incorrectly attribute environmental\neffects on phenotype to genes.  Dickens and Flynn (2001) use an\nexample of basketball playing ability, which they label BP, to make\nthis point.  They argue that if we assume that BP is highly heritable,\nthere still appears to be a large environmental component to BP.  On\ntheir account, this makes sense is we take gene/environment covariance\nseriously.  Just as our tall plants, in Section 2. above, can end up\nin nutrient rich environments that shorter plants do not, tall,\nathletic individuals are often placed in environments that enhance\ntheir BP. As Dickens and Flynn point out, identical twins who are tall\nand athletic, including those separated at birth, could have parents\nwho play basketball with them or could be placed in basketball\ntraining regimens in school or college.  In these situations each\nindividual's BP would increase but it is wrong to attribute this\nincrease in BP to genes for height and athleticism, since the relevant\nenvironment has a significant influence on the phenotype. \n\nThere is some irony in the fact that philosophers of biology, who\nfocus their attention almost exclusively on evolutionary biology, are\ncritics of heritability. Heredity is a central component to\nevolutionary change and heritability analysis, particularly via the\nnotion of realized heritability (see equation 5 above), is an\nimportant component of theoretical evolutionary biology. The critical\nattack on heritability arises against the background of nature/nurture\ndebates (see e.g. Tabery 2014) and concerns over genetic determinism\nand is best understood as a critical appraisal of behavioral\ngeneticists in psychology. There is growing interest among\nphilosophers in critically assessing the notion of heritability in its\nevolutionary context. The notion of realized heritability is briefly\ndiscussed by Samir Okasha (2006) (See also Downes 2010) and by Sober\n(2008). Until recently, thorough discussion of the relations between\nheritability and other central concepts of evolutionary theory was\npursued exclusively by evolutionary biologists (e.g. Lynch and Walsh\n1998 and Rice 2004). Peter Visscher et al.’s (2008)\nreview article is a nice introduction to much of the work in this\narea. Philosophers have now presented and defended some radical claims\nabout heritability and heredity including the claim that evolution can\noccur without heredity (see e.g. Earnshaw-Whyte 2012 and Bourrat\n2013). Focusing on heritability in the context of evolutionary theory\nis a productive area for philosophical research as evidenced by\nBourrat’s (2014) examination of the role of heritability in the\nrecipe approach to evolution by natural selection.\n5. Missing Heritability and related philosophical issues arising from GWAS\n\nThe development of alternative methods of estimating heritability\n(e.g., GWAS and SNP heritability) has given rise to what is commonly\nreferred to as the ‘missing heritability problem’, which\nhas seen ample attention by behavioral geneticists and some attention\nby philosophers of science and biology. At face value, the missing\nheritability arises out of a numerical gap between traditional\nheritability estimates and SNP-based heritability estimates of the\nsame trait. For example, traditional heritability estimates for IQ\nobtained using twin and family studies range between .5 and .7 while\nSNP-based heritability estimates of IQ are currently no greater than\n.25 (Plomin and von stumm 2018). Missing heritability is greatest\namong complex, behavioral traits.\n\nSince Maher (2008) first coined the term “missing\nheritability,” statisticians and geneticists have written\nextensively about the issue. In nearly all cases, contributors speak\nto possible explanations for why there is missing heritability and\nemphasize technological and methodological solutions that should close\nthe numerical gap between traditional and SNP heritability estimates.\nExplanations for missing heritability typically focus on various\nmanners in which standard format GWAS are unable to track genetic\neffects that are unavoidably part and parcel of twin and family\nstudies. Notably, contributors appeal to non-linear interactions\nbetween genetic variants (‘GxG interaction’, or\nepistasis). Epistatic interactions between SNPs entail that the effect\nof a given SNP will be modified (enhanced or diminished, for example)\nin the presence of another SNP, which violates the additivity\nassumption of SNP heritability. Similarly, gene-environment\ninteraction and epigenesis have been proposed as explanations for\nmissing heritability (Zuk et al. 2012). Specific variants or groups of\nvariants may have effects that are enhanced, diminished, or even muted\nwith different environments, again violating the additivity assumption\nof SNP heritability. Some missing heritability may be attributable to\nthe presenence of low-frequency, high-penetrance variants, which\nrequire massive samples to detect (Zuk et al. 2014). (See Eric\nTurkheimer (2011, 2012) and Matthews & Turkheimer (forthcoming) for a\nmore thorough review of explanations of and solutions to missing\nheritability.)\n\nThe missing heritability problem is an example of a conflict between\ntwo seemingly compatible scientific methods that give conflicting\nresults and thus has rich implications for philosophy of science. One\nof these implications is pursued by Bourrat and Lu (2017), who argue\nthat the missing heritability problem is largely\n‘dissolved’ in two complementary steps. On the one hand,\nBourrat and Lu indicate that the numerical gap between alternative\nmethods of estimating heritability may be partially narrowed by\ndecreasing traditional estimates, which have historically been charged\nas being overestimated. On the other hand, Bourrat and Lu argue that\nthe numerical gap may be closed even more by altering SNP heritability\ntechniques so as to include non-linear and epigenetic factors that\nthey claim are currently untracked by GWAS.\n\nTo the contrary, Matthews & Turkheimer (forthcoming) argue that the\nmissing heritability problem is much more severe and prospective\ndissolutions are out of sight. Their analysis tracks the historical\nintroduction of missing heritability by Maher, who commented on a\nbroader challenge facing behavioral geneticists in the ongoing effort\nto explain, understand, and accurately predict the overwhelming\ncomplex relationships between genetic differences and complex\nbehavioral differences, such as schizophrenia, depression, and\nintelligence. Matthews & Turkheimer offer a tripartite\ncharacterization of the problem, which treats the numerical gap\nbetween traditional and SNP heritability as just one quantitative and\nindependent leg of a multi-faceted problem. On their view, the\nremaining two legs of the problem regard prediction (the challenge of\naccurately predicting complex behavioral phenotype from molecular\ngenotype) and mechanism (the challenge of elucidating meaningful\ncausal-mechanical stories that link molecular genetic differences to\ncomplex behavioral differences). Although most behavioral geneticists,\nas well as Bourrat and Liu, focus their efforts on the numerical gap\nbetween alternative methods of estimating heritability, Matthews and\nTurkheimer emphasize the fact that resolving the statistical problem\nwill not advance prediction nor explanation of the heritability of\nhuman behavior.\n\nThe development of GWAS and SNP heritability raises anew old\nphilosophical questions regarding causal relationships. Researchers in\nthe field are well aware of a handful of conceptual issues that\nprovoke skepticism regarding the question of whether or not SNPs\nidentified by GWAS are causal or not. John Dupré identifies\nGWAS as one among several approaches in the increasingly large effort\nto correlate genetic differences with phenotypic differences. He says\nthat GWAS “uses the large amount of genetic data we now have\nabout human populations to find correlations with medical\noutcomes—physiological and psychological disease” (2013,\n285). Dupre goes on to say “as everyone involved in such\nresearch is aware, this is hardly a search for sufficient causes. GWAS\nwill at best provide clues to the detailed causal processes involved\nin pathology” (2013, 286). Some GWAS researchers are more\nbullish on causation that Dupré indicates (See e.g. Plomin\n2018). A well-known issue in population genetics, linkage\ndisequilibrium, occurs when there is non-random association of alleles\nat different loci. GWAS researchers acknowledge that many of the SNPs\nof interest today are in linkage with many other SNPs in the genome.\nThe implication is that it remains underdetermined whether SNPs are\ncausal variants, or merely in linkage with causal variants (perhaps\nthrough evolutionary drift).\n\nThere is also strong evidence that current GWAS are susceptible to\npopulation stratification. Because human populations exhibit ethnic or\ncultural subgroups with distinct allele frequencies, population\nstratification increases the likelihood that GWAS identify false\npositive SNPs. Not only is there evidence of population stratification\namong large groups of individuals of different biogeographic\nancestries (Europeans, Asians, Africans), but populations are\nstratified within groups as well. For example, individuals of European\ndescent would include both Parisians as well as English immigrants.\n\nWhat may be the greatest impediment to causal interpretations of SNP\nheritability is that it is biologically vacuous. SNP heritability is\nconstructed using all genetic variants included in any given SNP chip,\na significant portion of which are statistically insignificant.\nMoreover, although SNP heritability represents another figure of\nphenotypic variance ‘explained’ by genetic differences,\nSNP heritability has not led to the discovery of meaningful\nbiological stories or etiologies that would causally link patterns of\nnucleotides to patterns of complex human behaviors. Judea Pearl and\nDana MacKenzie refer to GWAS as a “prototypical ‘big\ndata’ method that allows researchers to comb through the whole\ngenome statistically, looking for genes that happen to show up more in\npeople with a certain disease” (2018, 339–340). They go on to\nsay “It is important to notice the word\n‘association’ in the term GWAS. This method does not prove\ncausality; it only identifies genes associated with a certain disease\nin the given sample” (340). They echo our point here, in saying\nthat the methods used in GWAS hamper efforts at making causal\ninferences.\n6. Looking forward\n\nThe study of heritability has a long and rich history. Many scientific\ndevelopments have led to refined techniques for estimating\nheritability and each of these scientific developments has been the\nfocus of philosophical analysis. In recent\nyears, empirical approaches toward the investigation and construction\nof heritability estimates have undergone great changes, especially\nwith the introduction of GWAS, SNP chips, and SNP heritability. These\nrecent developments are beginning to see more attention from\nphilosophers. At the forefront of debates about SNP heritability is\nthe issue of causation we raised above: are SNPs causal? Bourrat\n(forthcoming) addresses the question of whether SNPs are causal under\nan interventionist framework, but there is more work to be done here.\nMethodologically, twin and heritability and SNP heritability are\nestimated very differently. There is need for more philosophical\nanalysis regarding the nature of heritability and a fine-grained\nperspective of the differences between twin and SNP heritability. In\naddition to philosophical arguments for or against causal\ninterpretations of SNPs and heritability, scientists present their own\ncases, often appealing to sophisticated statistical techniques as\nsufficing for the identification of causal relationships in human\ngenetics. Philosophers could profitably address such\ntechniques—notably Mendelian randomization—with an eye for\nhow they align with broader philosophical frameworks such as alternate\naccounts of causation.\n\nAs mentioned previously, the advent of SNP heritability gives rise to\na new and interesting issue: the missing heritability problem.\nAlthough Matthews and Turkheimer (forthcoming) have considered the\nimplications of the missing heritability problem for debates about\nscientific pluralism, we expect that the implications are broader.\nMore philosophical work here should prove to be productive.\n\nFinally, heritability is unequivocally tethered to bioethics. To the\nextent that twin heritability estimates played a central role in\ndebates about race science from the 70s through the 90s, the advent of\nSNP heritability warrants a renewed assessment. Just as it was for\ntwin heritability, SNP heritability is now being used to assess old,\ncontroversial questions about the genetic basis of racial differences\nin intelligence and cognitive ability. Presumably because twin\nheritability and SNP heritability are conceptually and\nmethodologically distinct, there is demand for philosophers and\nscientists to re-assess the legitimacy of group-difference\ninvestigations that appeal to SNP heritability.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Beurton, P. J., R. Falk, <em>et al</em>. (eds.), 2000. <em>The\nConcept of the Gene in Development and Evolution</em>, Cambridge:\nCambridge University Press.",
                "Block, N., 1995. “How heritability misleads about\nrace,” <em>Cognition</em>, 56: 99–128.",
                "Bourrat, P., 2013. “From survivors to replicators: Evolution\nby natural selection revisited,” <em>Biology and\nPhilosophy</em>, 29: 517–538.",
                "–––, 2014. “How to read heritability in\nthe recipe approach to natural selection,” <em>British Journal\nfor the Philosophy of Science</em>, 66: 883–903",
                "–––, forthcoming. “Causation and SNP\nHeritability,” <em>Philosophy of Science</em>.",
                "Bourrat, P. and Lu, Q., 2017. “Dissolving the Missing\nHeritability Problem,”<em> Philosophy of Science</em>, 84:\n1055–1067.",
                "Burbridge, D., 2001. “Francis Galton on Twins, Heredity and\nSocial Class,” The British Journal for the History of Science,\n34: 323–340.",
                "Darwin, C., 1859 [1968]. <em>The Origin of Species</em>, London:\nPenguin Books.",
                "Dickens, W.T. and Flynn, J.R., 2001. “Heritability Estimates\nVersus Large Environmental Effects: The IQ Paradox\nResolved,” <em>Psychological Review</em>, 108:\n346–369.",
                "Downes, S.M., 2010. “Moving past the levels of selection\ndebates: Review of Samir Okasha, <em>Evolution and the Levels of\nSelection</em>, Oxford, Oxford University Press (2006),”\n<em>Biology and Philosophy</em>, 25: 417–423.",
                "Dupré, J., 2013. <em>Processes of Life</em>, Oxford: Oxford\nUniversity Press.",
                "Earnshaw-White, E., 2012. “Increasingly Radical Claims about\nHeredity and Fitness,” <em>Philosophy of Science</em>, 79:\n396–412.",
                "Feldman, M. W., 1992. “Heritability: Some Theoretical\nAmbiguities,” <em>Keywords in Evolutionary Biology</em>, E. A.\nLloyd and E. Fox Keller (eds.), Cambridge, Harvard University Press,\n151–157.",
                "Freeman, S. and J. C. Herron, 1998. <em>Evolutionary\nAnalysis</em>, Upper Saddle River, NJ: Prentice Hall.",
                "Futuyma, D., 1998. <em>Evolutionary Biology</em>, Sunderland, MA:\nSinauer.",
                "Gould, S. J., 1996 [1981]. <em>The Mismeasure of Man</em>, New\nYork: W.W. Norton.",
                "Griesemer, J. R., 1994. “Tools for Talking: Human nature,\nWeismannism, and the interpretation of genetic information,”\n<em>Are Genes Us? The Social Consequences of the New Genetics</em>, C.\nF. Cranor (ed.), New Brunswick: Rutgers University Press.",
                "Hamer, D. and P. Copeland, 1998. <em>Living with Our Genes</em>,\nNew York: Doubleday.",
                "Herrnstein, R. J. and C. Murray, 1994. <em>The Bell Curve</em>,\nNew York: Free Press.",
                "Hitchcock, C. (ed.), 2004. <em>Contemporary Debates in the\nPhilosophy of Science</em>, Oxford: Blackwell.",
                "Hogben, L., 1933. <em>Nature and Nurture</em>, New York:\nW.W. Norton.",
                "Hull, D.L., 1981. “Units of Evolution: A metaphysical\nessay,” <em>The Philosophy of Evolution</em>, R.Jensen and\nR.Harre (eds.), Brighton: Harvester.",
                "Kaplan, J., 2000. <em>The Limits and Lies of Human Genetic\nResearch</em>, London: Routledge.",
                "Keller, E.F., 2000. “Decoding the Genetic Program: Or, some\ncircular logic in the logic of circularity,” <em>The Concept of\nthe Gene in Development and Evolution</em>, P. J. Beurton, R. Falk and\nH. Rheinberger (eds.), Cambridge: Cambridge University Press:\n159–177.",
                "–––, 2002. <em>The Century of the Gene</em>,\nCambridge, MA: Harvard University Press.",
                "Kempthorne, O., 1978. “Logical, Epistemological and\nStatistical Aspects of Nature Nurture Data Interpretation,”\n<em>Biometrics</em>, 34: 1–23.",
                "Kitcher, P., 1985. <em>Vaulting Ambition: Sociobiology and the\nQuest for Human Nature</em>, Cambridge, MA: MIT Press.",
                "Kronfeldner, M., 2018. <em>What’s Left of Human Nature</em>,\nCambridge, MA: MIT Press.",
                "Layzer, D., 1974. “Heritability\nAnalyses of IQ Scores: Science or Numerology?” <em>Science</em>,\n183: 1259–1266.",
                "Lewontin, R., 1974. “The analysis of variance and the\nanalysis of causes,” <em>American Journal of Human\nGenetics</em>, 26: 400–411.",
                "Lewontin, R. C., 2006. “Commentary: Statistical Analysis or\nBiological Analysis as Tools for Understanding Biological\nCauses.” <em>International Journal of Epidemiology</em>, 35:\n536–37.",
                "Lynch, M. and B. Walsh, 1998. <em>Genetics and Analysis of\nQuantitative Traits</em>, Sunderland, MA: Sinauer.",
                "Maher, B., 2008. “The case of the missing\nheritability,” <em>Nature</em>, 456: 18–21.",
                "Matthews, L. and Turkheimer, E., forthcoming. “Across the\ngreat divide: pluralism and the hunt for missing heritability,”\n<em>Synthese</em>, first online 10 December 2019; doi:\n10.1007/s11229-019-02205-w",
                "Moss, L., 2003. <em>What Genes Can’t Do</em>, Cambridge, MA:\nMIT Press.",
                "Northcott, R., 2006. “Causal efficacy and the analysis of\nvariance,” <em>Biology and Philosophy</em>, 21:\n253–276.",
                "Odling-Smee, F. J., K. N. Laland, <em>et al</em>., 2003. <em>Niche\nConstruction: The neglected process in evolution</em>, Princeton:\nPrinceton University Press.",
                "Oftedal, G., 2005. “Heritability and Genetic\nCausation,” <em>Philosophy of Science</em>, 72:\n699–709.",
                "Okasha, S., 2006. <em>Evolution and the Levels of Selection</em>,\nOxford: Oxford University Press.",
                "Panofsky, A., 2014. <em>Misbehaving Science: Controversy and the\ndevelopment of behavior genetics</em>, Chicago: University of Chicago\nPress.",
                "Paul, D. B., 1998. <em>The Politics of Heredity</em>, Albany: SUNY\nPress.",
                "Pearl, J. and MacKenzie, D., 2018. <em>The Book of Why</em>, New\nYork, NY: Basic Books.",
                "Pearson, C., 2007. “Is heritability explanatorily\nuseful?” <em>Studies in History and Philosophy of Biological and\nBiomedical Sciences</em>, 38: 270–288.",
                "Pigliucci, M., 2001. <em>Phenotypic Plasticity: Beyond Nature and\nNurture</em>, Baltimore: Johns Hopkins University Press.",
                "Plomin, R.,2018. <em>Blueprint: How DNA makes us who we are</em>,\nCambridge, MA: MIT Press.",
                "Plomin, R., J. C. DeFries, et al., 1990. <em>Behavioral Genetics:\nA Primer</em>, New York: W.H.Freeman.",
                "Plomin, R., J. C. DeFries, et al., 1997. <em>Behavioral\nGenetics</em>, New York: W.H. Freeman.",
                "Plomin, R. and von Stumm, 2018. “The new genetics of\nintelligence,” <em>Nature Reviews. Genetics</em>, 19:\n148–159.",
                "Rice, S., 2004. <em>Evolutionary Theory: Mathematical and\nConceptual Foundations</em>, Sunderland, MA: Sinauer.",
                "Robinson, M. R., Wray, N. R., Visscher, P. M., 2014.\n“Explaining additional genetic variation in complex\ntraits,” <em>Trends in Genetics</em>, 30: 124–132.",
                "Sarkar, S., 1996. “Biological Information: A skeptical look\nat some central dogmas of molecular biology,” <em>The Philosophy\nand History of Molecular Biology: New Perspectives</em>, S.Sarkar\n(ed.), Dordrecht: Kluwer, 187–231.",
                "–––, 1998. <em>Genetics and Reductionism</em>, Cambridge:\nCambridge University Press.",
                "Segerstråle, U., 2000. <em>Defenders of the Truth: The\nBattle for Science in the Sociology Debate and Beyond</em>, Oxford:\nOxford University Press.",
                "Sesardic, N., 1993. “Heritability and Causation,”\n<em>Philosophy of Science</em>, 60: 396–418.",
                "–––, 2005. <em>Making Sense of\nHeritability</em>, Cambridge: Cambridge University Press.",
                "Shaffner, K., 2016. <em>Behaving: What’s genetic,\nwhat’s not, and why should we care?</em>, New York, NY: Oxford\nUniversity Press.",
                "Sober, E., 1988. “Apportioning Causal Responsibility,”\n<em>Journal of Philosophy</em>, 85: 303–318.",
                "–––, 2008. <em>Evidence and Evolution: The logic\nbehind the science</em>, Cambridge: Cambridge University Press.",
                "Tabery, J., 2006, “Fueling the (In)Famous Fire,” (A\nReview of <em>Making Sense of Heritability</em>, by Neven Sesardic,\n2005), <em>Metascience</em>, 15(3): 605–609.",
                "–––, 2009a, “Interactive\nPredispositions,” <em>Philosophy of Science</em>, 76:\n876–888.",
                "–––, 2009b, “Making Sense of the\nNature-Nurture Debate” (Review of Neven Sesardic, <em>Making\nSense of Heritability</em>), <em>Biology and Philosophy</em>, 24:\n711–723.",
                "–––, 2014. <em>Beyond Versus: The Struggle to\nUnderstand the Interaction of Nature and Nurture</em>, Cambridge, MA:\nMIT Press.",
                "Tal, O., 2009, “From Heritability to Probability,”\n<em>Biology and Philosophy</em>, 24: 81–105.",
                "–––, 2011, “The impact of gene-environment\ninteraction and correlation on the interpretation of\nheritability,” <em>Acta Biotheoretica</em>, 60:\n225–237.",
                "Taylor, P., 2014, <em>Nature-Nurture? No: Moving the Sciences of\nVariation and Heredity Beyond the Gaps</em>, Arlington, MA: The\nPumping Station.",
                "Turkheimer, E., 2011, “Still Missing,” <em>Research in\nHuman Development</em>, 8: 227–241.",
                "–––, 2012, “Genome Wide Association\nStudies of Behavior are Social Science,” <em>Philosophy of\nBehavioral Biology</em> (Boston Studies in the Philosophy of Science:\n282), K. Plaisance and T. Reydon (eds.), Dordrect: Springer,\n43–63.",
                "Visscher, P.M., Hill, W.G. and Wray, Naomi. R., 2008.\n“Heritability in the genomics era: concepts and\nmisconceptions,” <em>Nature Reviews Genetics</em>, 9:\n255–266.",
                "Wade, M. J., 1992. “Heritability: Historical\nPerspectives,” <em>Keywords in Evolutionary Biology</em>, E. A.\nLloyd and E. Fox Keller (eds.), Cambridge, MA: Harvard University\nPress, 149–150.",
                "Wahlsten, D., 1990. “Insensitivity of the analysis of\nvariance to heredity-environment interaction,” <em>Behavioral\nand Brain Sciences</em>, 13: 109–120.",
                "Wahlsten, D., and Gottlieb, G., 1997. “The invalid\nseparation of effects of nature and nurture: Lessons from animal\nexperimentation,” in R. J. Sternberg and E. L. Grigorenko\n(eds.), <em>Intelligence, Heredity and Environment</em>, Cambridge:\nCambridge University Press, 163–192.",
                "Weedon M.N. and Frayling, T.N., 2008. “Reaching new heights:\ninsights into the genetics of human stature,” <em>Trends in\nGenetics</em>, 24: 595–603.",
                "West-Eberhard, M. J., 2003. <em>Developmental Plasticity and\nEvolution</em>, Oxford: Oxford University Press.",
                "Williams, G. C., 1966. <em>Adaptation and Natural Selection</em>,\nPrinceton: Princeton University Press.",
                "–––, 1992. <em>Natural Selection: Domains,\nLevels and Challenges</em>, New York: Oxford University Press.",
                "Winther, R., 2000. “Darwin on Variation and Heredity,”\n<em>Journal of the History of Biology</em>, 33: 425–455.",
                "–––, 2001. “August Weismann on Germ-Plasm\nVariation,” <em>Journal of the History of Biology</em>, 34:\n517–555.",
                "Yang, J. et al., 2015. “Genetic variance estimation with imputed\nvariants finds negligible missing heritability for human height and\nbody mass index,” <em>Nature Genetics</em>, 47: 1114–1120.",
                "Yang, J., Visscher, P.M. et al., 2010. “Common SNPs explain\na large proportion of the heritability for human height,”\n<em>Nature Genetics</em>, 42: 565–569."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Beurton, P. J., R. Falk, <em>et al</em>. (eds.), 2000. <em>The\nConcept of the Gene in Development and Evolution</em>, Cambridge:\nCambridge University Press.</li>\n<li>Block, N., 1995. “How heritability misleads about\nrace,” <em>Cognition</em>, 56: 99–128.</li>\n<li>Bourrat, P., 2013. “From survivors to replicators: Evolution\nby natural selection revisited,” <em>Biology and\nPhilosophy</em>, 29: 517–538.</li>\n<li>–––, 2014. “How to read heritability in\nthe recipe approach to natural selection,” <em>British Journal\nfor the Philosophy of Science</em>, 66: 883–903</li>\n<li>–––, forthcoming. “Causation and SNP\nHeritability,” <em>Philosophy of Science</em>.</li>\n<li>Bourrat, P. and Lu, Q., 2017. “Dissolving the Missing\nHeritability Problem,”<em> Philosophy of Science</em>, 84:\n1055–1067.</li>\n<li>Burbridge, D., 2001. “Francis Galton on Twins, Heredity and\nSocial Class,” The British Journal for the History of Science,\n34: 323–340.</li>\n<li>Darwin, C., 1859 [1968]. <em>The Origin of Species</em>, London:\nPenguin Books.</li>\n<li>Dickens, W.T. and Flynn, J.R., 2001. “Heritability Estimates\nVersus Large Environmental Effects: The IQ Paradox\nResolved,” <em>Psychological Review</em>, 108:\n346–369.</li>\n<li>Downes, S.M., 2010. “Moving past the levels of selection\ndebates: Review of Samir Okasha, <em>Evolution and the Levels of\nSelection</em>, Oxford, Oxford University Press (2006),”\n<em>Biology and Philosophy</em>, 25: 417–423.</li>\n<li>Dupré, J., 2013. <em>Processes of Life</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Earnshaw-White, E., 2012. “Increasingly Radical Claims about\nHeredity and Fitness,” <em>Philosophy of Science</em>, 79:\n396–412.</li>\n<li>Feldman, M. W., 1992. “Heritability: Some Theoretical\nAmbiguities,” <em>Keywords in Evolutionary Biology</em>, E. A.\nLloyd and E. Fox Keller (eds.), Cambridge, Harvard University Press,\n151–157.</li>\n<li>Freeman, S. and J. C. Herron, 1998. <em>Evolutionary\nAnalysis</em>, Upper Saddle River, NJ: Prentice Hall.</li>\n<li>Futuyma, D., 1998. <em>Evolutionary Biology</em>, Sunderland, MA:\nSinauer.</li>\n<li>Gould, S. J., 1996 [1981]. <em>The Mismeasure of Man</em>, New\nYork: W.W. Norton.</li>\n<li>Griesemer, J. R., 1994. “Tools for Talking: Human nature,\nWeismannism, and the interpretation of genetic information,”\n<em>Are Genes Us? The Social Consequences of the New Genetics</em>, C.\nF. Cranor (ed.), New Brunswick: Rutgers University Press.</li>\n<li>Hamer, D. and P. Copeland, 1998. <em>Living with Our Genes</em>,\nNew York: Doubleday.</li>\n<li>Herrnstein, R. J. and C. Murray, 1994. <em>The Bell Curve</em>,\nNew York: Free Press.</li>\n<li>Hitchcock, C. (ed.), 2004. <em>Contemporary Debates in the\nPhilosophy of Science</em>, Oxford: Blackwell.</li>\n<li>Hogben, L., 1933. <em>Nature and Nurture</em>, New York:\nW.W. Norton.</li>\n<li>Hull, D.L., 1981. “Units of Evolution: A metaphysical\nessay,” <em>The Philosophy of Evolution</em>, R.Jensen and\nR.Harre (eds.), Brighton: Harvester.</li>\n<li>Kaplan, J., 2000. <em>The Limits and Lies of Human Genetic\nResearch</em>, London: Routledge.</li>\n<li>Keller, E.F., 2000. “Decoding the Genetic Program: Or, some\ncircular logic in the logic of circularity,” <em>The Concept of\nthe Gene in Development and Evolution</em>, P. J. Beurton, R. Falk and\nH. Rheinberger (eds.), Cambridge: Cambridge University Press:\n159–177.</li>\n<li>–––, 2002. <em>The Century of the Gene</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Kempthorne, O., 1978. “Logical, Epistemological and\nStatistical Aspects of Nature Nurture Data Interpretation,”\n<em>Biometrics</em>, 34: 1–23.</li>\n<li>Kitcher, P., 1985. <em>Vaulting Ambition: Sociobiology and the\nQuest for Human Nature</em>, Cambridge, MA: MIT Press.</li>\n<li>Kronfeldner, M., 2018. <em>What’s Left of Human Nature</em>,\nCambridge, MA: MIT Press.</li>\n<li>Layzer, D., 1974. “Heritability\nAnalyses of IQ Scores: Science or Numerology?” <em>Science</em>,\n183: 1259–1266.</li>\n<li>Lewontin, R., 1974. “The analysis of variance and the\nanalysis of causes,” <em>American Journal of Human\nGenetics</em>, 26: 400–411.</li>\n<li>Lewontin, R. C., 2006. “Commentary: Statistical Analysis or\nBiological Analysis as Tools for Understanding Biological\nCauses.” <em>International Journal of Epidemiology</em>, 35:\n536–37.</li>\n<li>Lynch, M. and B. Walsh, 1998. <em>Genetics and Analysis of\nQuantitative Traits</em>, Sunderland, MA: Sinauer.</li>\n<li>Maher, B., 2008. “The case of the missing\nheritability,” <em>Nature</em>, 456: 18–21.</li>\n<li>Matthews, L. and Turkheimer, E., forthcoming. “Across the\ngreat divide: pluralism and the hunt for missing heritability,”\n<em>Synthese</em>, first online 10 December 2019; doi:\n10.1007/s11229-019-02205-w</li>\n<li>Moss, L., 2003. <em>What Genes Can’t Do</em>, Cambridge, MA:\nMIT Press.</li>\n<li>Northcott, R., 2006. “Causal efficacy and the analysis of\nvariance,” <em>Biology and Philosophy</em>, 21:\n253–276.</li>\n<li>Odling-Smee, F. J., K. N. Laland, <em>et al</em>., 2003. <em>Niche\nConstruction: The neglected process in evolution</em>, Princeton:\nPrinceton University Press.</li>\n<li>Oftedal, G., 2005. “Heritability and Genetic\nCausation,” <em>Philosophy of Science</em>, 72:\n699–709.</li>\n<li>Okasha, S., 2006. <em>Evolution and the Levels of Selection</em>,\nOxford: Oxford University Press.</li>\n<li>Panofsky, A., 2014. <em>Misbehaving Science: Controversy and the\ndevelopment of behavior genetics</em>, Chicago: University of Chicago\nPress.</li>\n<li>Paul, D. B., 1998. <em>The Politics of Heredity</em>, Albany: SUNY\nPress.</li>\n<li>Pearl, J. and MacKenzie, D., 2018. <em>The Book of Why</em>, New\nYork, NY: Basic Books.</li>\n<li>Pearson, C., 2007. “Is heritability explanatorily\nuseful?” <em>Studies in History and Philosophy of Biological and\nBiomedical Sciences</em>, 38: 270–288.</li>\n<li>Pigliucci, M., 2001. <em>Phenotypic Plasticity: Beyond Nature and\nNurture</em>, Baltimore: Johns Hopkins University Press.</li>\n<li>Plomin, R.,2018. <em>Blueprint: How DNA makes us who we are</em>,\nCambridge, MA: MIT Press.</li>\n<li>Plomin, R., J. C. DeFries, et al., 1990. <em>Behavioral Genetics:\nA Primer</em>, New York: W.H.Freeman.</li>\n<li>Plomin, R., J. C. DeFries, et al., 1997. <em>Behavioral\nGenetics</em>, New York: W.H. Freeman.</li>\n<li>Plomin, R. and von Stumm, 2018. “The new genetics of\nintelligence,” <em>Nature Reviews. Genetics</em>, 19:\n148–159.</li>\n<li>Rice, S., 2004. <em>Evolutionary Theory: Mathematical and\nConceptual Foundations</em>, Sunderland, MA: Sinauer.</li>\n<li>Robinson, M. R., Wray, N. R., Visscher, P. M., 2014.\n“Explaining additional genetic variation in complex\ntraits,” <em>Trends in Genetics</em>, 30: 124–132.</li>\n<li>Sarkar, S., 1996. “Biological Information: A skeptical look\nat some central dogmas of molecular biology,” <em>The Philosophy\nand History of Molecular Biology: New Perspectives</em>, S.Sarkar\n(ed.), Dordrecht: Kluwer, 187–231.</li>\n<li>–––, 1998. <em>Genetics and Reductionism</em>, Cambridge:\nCambridge University Press.</li>\n<li>Segerstråle, U., 2000. <em>Defenders of the Truth: The\nBattle for Science in the Sociology Debate and Beyond</em>, Oxford:\nOxford University Press.</li>\n<li>Sesardic, N., 1993. “Heritability and Causation,”\n<em>Philosophy of Science</em>, 60: 396–418.</li>\n<li>–––, 2005. <em>Making Sense of\nHeritability</em>, Cambridge: Cambridge University Press.</li>\n<li>Shaffner, K., 2016. <em>Behaving: What’s genetic,\nwhat’s not, and why should we care?</em>, New York, NY: Oxford\nUniversity Press.</li>\n<li>Sober, E., 1988. “Apportioning Causal Responsibility,”\n<em>Journal of Philosophy</em>, 85: 303–318.</li>\n<li>–––, 2008. <em>Evidence and Evolution: The logic\nbehind the science</em>, Cambridge: Cambridge University Press.</li>\n<li>Tabery, J., 2006, “Fueling the (In)Famous Fire,” (A\nReview of <em>Making Sense of Heritability</em>, by Neven Sesardic,\n2005), <em>Metascience</em>, 15(3): 605–609.</li>\n<li>–––, 2009a, “Interactive\nPredispositions,” <em>Philosophy of Science</em>, 76:\n876–888.</li>\n<li>–––, 2009b, “Making Sense of the\nNature-Nurture Debate” (Review of Neven Sesardic, <em>Making\nSense of Heritability</em>), <em>Biology and Philosophy</em>, 24:\n711–723.</li>\n<li>–––, 2014. <em>Beyond Versus: The Struggle to\nUnderstand the Interaction of Nature and Nurture</em>, Cambridge, MA:\nMIT Press.</li>\n<li>Tal, O., 2009, “From Heritability to Probability,”\n<em>Biology and Philosophy</em>, 24: 81–105.</li>\n<li>–––, 2011, “The impact of gene-environment\ninteraction and correlation on the interpretation of\nheritability,” <em>Acta Biotheoretica</em>, 60:\n225–237.</li>\n<li>Taylor, P., 2014, <em>Nature-Nurture? No: Moving the Sciences of\nVariation and Heredity Beyond the Gaps</em>, Arlington, MA: The\nPumping Station.</li>\n<li>Turkheimer, E., 2011, “Still Missing,” <em>Research in\nHuman Development</em>, 8: 227–241.</li>\n<li>–––, 2012, “Genome Wide Association\nStudies of Behavior are Social Science,” <em>Philosophy of\nBehavioral Biology</em> (Boston Studies in the Philosophy of Science:\n282), K. Plaisance and T. Reydon (eds.), Dordrect: Springer,\n43–63.</li>\n<li>Visscher, P.M., Hill, W.G. and Wray, Naomi. R., 2008.\n“Heritability in the genomics era: concepts and\nmisconceptions,” <em>Nature Reviews Genetics</em>, 9:\n255–266.</li>\n<li>Wade, M. J., 1992. “Heritability: Historical\nPerspectives,” <em>Keywords in Evolutionary Biology</em>, E. A.\nLloyd and E. Fox Keller (eds.), Cambridge, MA: Harvard University\nPress, 149–150.</li>\n<li>Wahlsten, D., 1990. “Insensitivity of the analysis of\nvariance to heredity-environment interaction,” <em>Behavioral\nand Brain Sciences</em>, 13: 109–120.</li>\n<li>Wahlsten, D., and Gottlieb, G., 1997. “The invalid\nseparation of effects of nature and nurture: Lessons from animal\nexperimentation,” in R. J. Sternberg and E. L. Grigorenko\n(eds.), <em>Intelligence, Heredity and Environment</em>, Cambridge:\nCambridge University Press, 163–192.</li>\n<li>Weedon M.N. and Frayling, T.N., 2008. “Reaching new heights:\ninsights into the genetics of human stature,” <em>Trends in\nGenetics</em>, 24: 595–603.</li>\n<li>West-Eberhard, M. J., 2003. <em>Developmental Plasticity and\nEvolution</em>, Oxford: Oxford University Press.</li>\n<li>Williams, G. C., 1966. <em>Adaptation and Natural Selection</em>,\nPrinceton: Princeton University Press.</li>\n<li>–––, 1992. <em>Natural Selection: Domains,\nLevels and Challenges</em>, New York: Oxford University Press.</li>\n<li>Winther, R., 2000. “Darwin on Variation and Heredity,”\n<em>Journal of the History of Biology</em>, 33: 425–455.</li>\n<li>–––, 2001. “August Weismann on Germ-Plasm\nVariation,” <em>Journal of the History of Biology</em>, 34:\n517–555.</li>\n<li>Yang, J. et al., 2015. “Genetic variance estimation with imputed\nvariants finds negligible missing heritability for human height and\nbody mass index,” <em>Nature Genetics</em>, 47: 1114–1120.</li>\n<li>Yang, J., Visscher, P.M. et al., 2010. “Common SNPs explain\na large proportion of the heritability for human height,”\n<em>Nature Genetics</em>, 42: 565–569.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "adaptationism",
            "altruism: biological",
            "Aristotle, General Topics: biology",
            "biology: philosophy of",
            "evolution",
            "gene",
            "human genome project",
            "information: biological",
            "innate/acquired distinction",
            "molecular biology",
            "parenthood and procreation"
        ],
        "entry_link": [
            {
                "../adaptationism/": "adaptationism"
            },
            {
                "../altruism-biological/": "altruism: biological"
            },
            {
                "../aristotle-biology/": "Aristotle, General Topics: biology"
            },
            {
                "../biology-philosophy/": "biology: philosophy of"
            },
            {
                "../evolution/": "evolution"
            },
            {
                "../gene/": "gene"
            },
            {
                "../human-genome/": "human genome project"
            },
            {
                "../information-biological/": "information: biological"
            },
            {
                "../innate-acquired/": "innate/acquired distinction"
            },
            {
                "../molecular-biology/": "molecular biology"
            },
            {
                "../parenthood/": "parenthood and procreation"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=heredity\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/heredity/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=heredity&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/heredity/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=heredity": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/heredity/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=heredity&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/heredity/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://hrst.mit.edu/\" target=\"other\">History of Recent Science and Technology</a>,\n includes a Bioinformatics site and a Molecular Evolution site.",
            "<a href=\"http://www.pitt.edu/~hpsdept/news/talks_archive/genes/genes.html\" target=\"other\">Representing Genes Project</a>,\n hosted by HPS at Pittsburgh.",
            "<a href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?db=OMIM\" target=\"other\">Online Mendelian Inheritance in Man</a>."
        ],
        "listed_links": [
            {
                "http://hrst.mit.edu/": "History of Recent Science and Technology"
            },
            {
                "http://www.pitt.edu/~hpsdept/news/talks_archive/genes/genes.html": "Representing Genes Project"
            },
            {
                "http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?db=OMIM": "Online Mendelian Inheritance in Man"
            }
        ]
    }
}