{
    "url": "ibn-sina-natural",
    "title": "Ibn Sina’s Natural Philosophy",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Jon McGinnis\n<mcginnis@umsl.edu>",
        "author_links": [
            {
                "https://www.umsl.edu/~philo/People/Faculty/index.html": "Jon McGinnis"
            },
            {
                "mailto:mcginnis%40umsl%2eedu": "mcginnis@umsl.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://www.umsl.edu/~philo/People/Faculty/index.html\" target=\"other\">Jon McGinnis</a>\n&lt;<a href=\"mailto:mcginnis%40umsl%2eedu\"><em>mcginnis<abbr title=\" at \">@</abbr>umsl<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Jul 29, 2016",
        "substantive revision Mon Oct 12, 2020"
    ],
    "preamble": "\n\nIbn Sīnā (980–1037)—the Avicenna of Latin\nfame—is arguably the most important representative of\nfalsafa, the Graeco-Arabic philosophical tradition beginning\nwith Plato and Aristotle, extending through the Neoplatonic commentary\ntradition and continuing among philosophers and scientists in the\nmedieval Arabic world. Avicenna’s fame in many ways is a result\nof his ability to synthesize and to extend the many intellectual\ntrends of his time. These trends included not only the aforementioned\nGreek traditions, but also the Islamic theological tradition,\nKalām, which was emerging at the same time that the Greek\nscientific and philosophical texts were being translated into Arabic.\nAvicenna’s own unique system survives in no fewer than three\nphilosophical encyclopedias—Cure (or The\nHealing), The Salvation and Pointers and\nReminders. Each provides a comprehensive worldview ranging from\nlogic to psychology, from metaphysics to ethics (although admittedly,\nethics is treated only scantly). At the middle of this Avicennan\nworldview is natural philosophy or physics (ʿilm\nṭabīʿī). The significance of natural\nphilosophy, and Avicenna’s physics in particular, is twofold.\nFirst, it represents Avicenna’s best attempt to explain the\nsensible world in which we live and to provide the principles for many\nof the other special sciences. Second, Avicenna’s natural\nphilosophy lays the foundations for a full understanding of his\nadvancements in other fields. Examples of this second point include,\nbut are certainly not limited to, the ramifications of logical\ndistinctions for the sciences, the physical basis of psychology (as\nwell as the limitation of physicalism for a philosophy of mind) and\nthe introduction of key problems that would become the focal points of\nmetaphysical inquiry. In all cases, Avicenna assumes his readers know\ntheir physics.\n\nAs others before him, Avicenna understands natural philosophy as the\nstudy of body insofar as it is subject to motion. Thus the present\nentry, after an overview of medieval physics generally, turns to\nAvicenna’s account of the nature of body followed by his account\nof motion. Central to an account of bodies is whether they are\ncontinuous or atomic, and so one must consider Avicenna’s\ncritique of atomism and his defense and analysis of continuous\nmagnitudes. The discussion of motion follows in two steps: one, his\naccount of motion and, two, his account of the conditions for motion.\nThe section on motion concentrates on Avicenna’s unique\nunderstanding of the Aristotelian definition of motion as the first\nactuality of potential as potential, while the conditions for motion\ninvolve his understanding of time and place.\n",
    "toc": [
        {
            "#MediPhys": "1. Medieval Physics"
        },
        {
            "#PhysCausPrinNatu": "1.1 Physical Causes and the Principles of Nature"
        },
        {
            "#Natu": "1.2 Nature"
        },
        {
            "#BodiMagn": "2. Bodies and Magnitudes"
        },
        {
            "#GeneBack": "2.1 General Background"
        },
        {
            "#AvicAtomMagn": "2.2 Avicenna on Atomic/Discrete Magnitudes"
        },
        {
            "#KalaAtom": "2.2.1 Kalām Atomism"
        },
        {
            "#AvicCritAtom": "2.2.2 Avicenna’s Criticisms of Atomism"
        },
        {
            "#Cont": "2.3 Continuity"
        },
        {
            "#InfiShapCosm": "2.4 Infinity and the Shape of the Cosmos"
        },
        {
            "#SimpBodiElem": "2.5 Simple Bodies and the Elements"
        },
        {
            "#MotiQualPoweElem": "2.5.1 The Motions and Qualitative Powers of the Elements"
        },
        {
            "#NatuMini": "2.5.2 Natural Minimums"
        },
        {
            "#Moti": "3. Motion"
        },
        {
            "#MotiFirsActu": "3.1 Motion as First Actuality"
        },
        {
            "#TwoSensMotiTravMediMoti": "3.2 Two Senses of Motion: Traversal and Medial Motion"
        },
        {
            "#MotiCate": "3.3 Motion and the Categories"
        },
        {
            "#GenuSpecMoti": "3.3.1 The Genus and Species of Motion"
        },
        {
            "#AnalPosiMoti": "3.3.2 An Analysis of Positional Motion"
        },
        {
            "#CondForMoti": "4. Conditions for Motion"
        },
        {
            "#PlacVoid": "4.1 Place and Void"
        },
        {
            "#TimeAgeUniv": "4.2 Time and the Age of the Universe"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#Aqui": "Aquinas"
        },
        {
            "#Aris": "Aristotle"
        },
        {
            "#Avic": "Avicenna"
        },
        {
            "#AlKind": "al-Kindī"
        },
        {
            "#Phil": "Philoponus"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Medieval Physics\n\nFor Avicenna, the proper subject of natural philosophy, in its\nbroadest or most general sense, is body insofar as it is subject to\nmotion. Beyond general physics (al-samāʿ\nal-ṭabīʿī), the physical sciences are\nfurther divided into various special sciences distinguished according\nto either the kind of motion investigated or the kind of body treated.\nWhile Avicenna himself does not explicitly identify his decision\nprocedure for dividing the special natural sciences, it is evidenced\nin the way that he divides up the books of his monumental encyclopedia\nof philosophy and the sciences, The Cure\n(al-Shifāʾ). For example, his book On the Heavens\nand Earth (Fī l-Samāʾ wa-l-ʿālam) from\nThe Cure generally treats rectilinear and circular motion;\nOn Generation and Corruption (Fī l-Kawn wa-l-fasād)\ndeals with change as it occurs in the Aristotelian category of\nsubstance, whereas On Actions and Passions (Fī\nl-Afʿāl wa-l-infiʿālāt) concerns how\nbodies are affected and affect one another with respect to, for\nexample, the primary qualities of hot-cold and wet-dry, which they\npossess. Avicenna distinguishes additional special natural sciences\naccording to the specific sort of body being considered, namely,\nwhether the body is inanimate—generally the subject matter of\nMeteorology (al-Maʿādin wa-l-āthār\nal-ʿulwiyya)—or the body is animate—the subject\nof psychology (literally, the science of the soul or animating\nprinciple). Avicenna further divides the study of living bodies into\ngeneral psychology (ʿilm al-nafs), botany\n(al-nabāt) and zoology (ṭabāʾiʿ\nal-hayawān). The focus of the present study is limited\nprimarily to Avicenna’s general natural philosophy, although at\ntimes the discussion is supplemented with developments in the special\nphysical sciences.\n1.1 Physical Causes and the Principles of Nature\n\nThe hallmark of natural philosophy and indeed of any science (sing.\nGk. epistēmē, Ar. ʿilm) for Avicenna\nand the entire Aristotelian tradition is to uncover and to grasp the\nbasic causes (sing. ʿilla) of the phenomenon under\nconsideration. Like Aristotle before him, Avicenna identifies four\nsorts of causes: the matter, form, agent (or efficient cause) and end\n(or final cause) (Avicenna, [Ph], 1.10 and Avicenna, [MPh], bk. 6).\nFor Avicenna the material cause is a wholly inert substratum for form.\nThe matter explains any passivity or potentiality to be acted upon\nthat a body might have. The form (ṣūra) is the\ncause, primarily, of a body’s being the actual kind or species\nthat it is and performing the various actions associated with that\nspecies; secondarily, a form might be the cause of the accidental\nfeatures and determinations that belong to that body (Avicenna\noccasionally uses hayʾa for this second sense of form).\nIn general then, the form is the cause of any actuality, that is\npositive features or actions, that the body has or does. The efficient\ncause accounts for a body’s undergoing motion and change (or\neven for its existence), while the final cause is that for the sake of\nwhich the form occurs in the matter.\n\nUnlike Aristotle, Avicenna also recognizes a broader division of\ncauses into physical causes and metaphysical causes (Avicenna, [Ph],\n1.10 [3]). The distinction is best approached by considering the\nAristotelian division between substances and accidents as found in the\nten categories. (Within the Aristotelian tradition, including\nAvicenna, the ten categories purport to provide the broadest\nclassification of ways things are found (mawjūd) in the\nworld; Avicenna, [Cat], 1.1 and [MPh], 3.1.) The primary category is\nthat of substance, which for Avicenna is the existence that belongs to\na thing through itself, for example, the existence that belong to a\nhuman as human or a dog as dog (Avicenna, [MPh], 2.1 [1–2]).\nAccidents are what exist in another, namely, in a substance, and\ninclude a substance’s quantity, quality, relation, where, when,\nposition, possession, activity and passivity. Metaphysical causes\ninvolve what accounts for the existence and continual conservation of\na substance, or, more exactly, of a concrete particular. Physical\ncauses in contrast involve those factors that bring about changes in\nthe accidental features of bodies, primarily changes of quality,\nquantity, location and position. For example, a father is responsible\nfor seeing that his semen becomes located within the mother, and the\nmother ensures that the right womb temperature for the fetus is\nmaintained and that the fetus is fed. Location, temperature,\npossession of nutriment and the like belong to categories of\naccidents, not to that of substance. Consequently, for Avicenna the\nfather and mother are most properly physical agents, that is, the\ncause of accidental changes that prepare the matter for the form. As\nsuch the parents are not the cause of the existence of the\noffspring’s species form by which it is the specific substance\nit is. Instead, the metaphysical agent—the one who imparts the\nspecies form to the matter such that there comes to be a substance of\nthe same kind as the parents—is a separate (immaterial) agent,\nwhich Avicenna calls the Giver of Forms (Avicenna, [Ph], 1.10 [3];\n[AP], 2.1; [MPh], 6.2 [5] & 9.5\n [3–4]).[1]\n\nRegardless of whether one is considering physical or metaphysical\ncauses, any motion or change (whether of some specific existence\nitself or just of some new accident), Avicenna explains, requires\nthree things: (1) the form that comes to be as a result of the change,\n(2) the matter in which that form comes to be and (3) the\nmatter’s initial privation of that form (Avicenna, [Ph], 1.2\n[12–13]). These three—the form, matter and\nprivation—are frequently referred to, following Aristotle, as\n“principles of nature” (cf. Aristotle, Physics,\n1.7). While Avicenna happily agrees that these three factors are\npresent in every instance of something’s coming to be after not\nhaving been, he is not as happy as to whether all three of these\nfeatures are equally “principles” (sing.\nmabdaʾ). His concern is that, strictly speaking, causes\nand principles exist simultaneous with their effects, whereas\nprivation is only ever prior to the change and passes away\nwith the change (Avicenna, [Ph], 1.3 [14]; McGinnis 2012, Lammer 2018,\n§3.3). More properly speaking, Avicenna contends, privation is a\nprecondition for change rather than a principle. Still, he concedes\nthat if one is lax in one’s use of “principle” so as\nto understand a principle as “whatever must exist, however it\nmight exist, in order that something else exists, but not\nconversely” (ibid) privation would count as a principle\nof change. Avicenna reasons thusly: The elimination of the privation\nfrom something as changeable renders that thing no longer changeable,\nwhereas the elimination of that changeable thing itself does not\neliminate the privation. In other words, insofar as something is\nchangeable, it depends on or requires that there be some privation.\nConversely, privation does not depend on and does not require that\nthere be anything changeable. For example, for Avicenna, the celestial\nIntellects—think Angelic host—are not subject to change;\nnonetheless, they all possess some privation of existence and\nperfection, which is found in God. Thus privation has a certain\nontological priority to the changeable. There can be privation without\nthe changeable, but there cannot be the changeable without\nprivation.\n1.2 Nature\n\nClosely related to causes and principles is the notion of a nature\n(Gk. phusis, Ar. ṭabīʿa), for\nAristotle defined a nature as “a principle of being moved and\nbeing at rest in that to which it belongs primarily, not accidentally\nbut essentially” (Aristotle, Physics, 2.1,\n192b21–3). Before commenting Aristotle’s definition of\nnature, Avicenna begins his chapter “On Defining Nature”\nfrom The Cure (Avicenna, [Ph], 1.5) by distinguishing between\nthe motions and actions that proceed from a substance owing to\nexternal causes and those that proceed from a substance owing to the\nsubstance itself. For instance, water becomes hot as a result of some\nexternal heat sources, whereas it becomes cool of itself. Avicenna\nnext identifies two sets of parameters for describing those motions\nand actions that proceed from a substance owing to that substance\nitself. They may either proceed from the substance as a result of\nvolition or without volition. Additionally they may proceed either\nuniformly without deviation or non-uniformly with deviation. Thus\nthere are four very general ways for dividing and describing all the\nmotions and actions that are found in the cosmos.\n\n\n\n \nvolitional\nnon-volitional \n\nnon-uniform\nanimal soul\nplant soul \n\nuniform\ncelestial soul\nnature  \n\n\n(1) Motions and actions may proceed as a result of volition and do so\nin a uniform and unvarying way, such as the motion of the heavenly\nbodies. The internal cause in these cases, Avicenna tells us, is a\ncelestial\n soul.[2]\n (2) Other motions and actions may proceed as a result of volition but\ndo so in a non-uniform and varying way, like the motions and actions\nof animals; the internal cause in these cases is an animal soul. (3)\nAgain, other motions and actions may not proceed as a result of\nvolition and are non-uniform and varying, like plant growth; the\ninternal cause in these cases is a plant soul. Finally (4) some\nmotions and actions may proceed without volition while doing so in a\nuniform and unvarying way, like the downward motion of a clod of earth\nand the heating of fire; the internal cause in these cases is a\nnature.\n\nNext, he turns to Aristotle’s own account of nature and begins\nby chiding Aristotle for his cavalier assertion that trying to prove\nthat natures exist is a fool’s errand, since it is self-evident\nthat things have such (internal) causes. While we are immediately\naware of motions and actions that seemingly proceed from substances of\nthemselves, that there truly exist internal causes of these\nactions and motions is certainly in need of demonstration. Indeed, one\nwho first encounters the motion of a magnet, Avicenna gives as an\nexample, might imagine that its motion is a result solely of itself\nrather than of iron in the vicinity. Moreover, during Avicenna’s\ntime the question of whether natures existed at all was a hotly\ndebated topic between philosophers in the Graeco-Arabic tradition,\nlike Avicenna, and thinkers in the Kalām tradition, the tradition\nof Islamic speculative theology and cosmology.\n\nProponents of the Kalām tradition, such as\nal-Bāqillānī (950–1013) and\n al-Ghazālī\n (1058–1111), had a two-stage critique. First, anticipating Hume\nby at least 700 years, these thinkers noted that observation alone\ncould not distinguish between causal connections and mere constant\nconjunctions. (A contemporary example often found in statistic classes\nis that the summer sun’s heat seems to be causally connected\nwith ice cream’s melting, whereas eating ice cream is only\nconstantly conjoined, at least in the US, with an increase in violent\ncrimes.) Observation alone, these thinkers warn us, cannot determine,\nfor example, whether the cotton’s burning, which follows upon\nplacing fire in the cotton, or intoxication, which follows upon\nimbibing alcohol, is causally connected with the natures of fire and\nalcohol respectively, or whether these sets of events are merely\nconstantly conjoined. Indeed the concurrence of two events may be a\nresult of God’s habit or custom (ʿāda or\nsunna) of causing the one event together with the other.\nWhile one might think that appealing to God to explain the various\nmundane events that we constantly observe around us is extravagant,\nKalām thinkers countered that it was in fact the philosophers who\nare ontologically profligate, for the theologians assume only one\nclass of causes, namely, willful agent(s), whereas the philosophers\nare committed to two ontologically distinct classes of causes, if not\nmore. This point leads to the second stage of the Kalām critique\nof natures. God’s (omnipotent) causal power extends to every\nactual or even possible event. God’s causal power is either\nsufficient to produce these effects or it is not. If God’s power\nis not sufficient, then either the deity needs the added\n“boost” of natural powers, or it needs natures as a tool\nor instrument, etc. This later position flirts with impiety. If,\nhowever, God’s causal power is sufficient to produce every\neffect and there are also natures, functioning as internal causes,\nevery event is over-determined. Indeed it is not clear at all what\ncausal role natures have to play. A principle of parsimony, so the\nKalām critique concludes, suggests that natures be jettisoned and\none reserve all causal power to God alone. While Avicenna addresses\nthe issue of the existence of natures and offers up a demonstration\nfor their existence in the Metaphysics (4.2, 9.2 & 9.5;\nalso see Dadikhuda 2019), he also notes that the science of physics is\nnot the proper place to undertake such an enterprise. That is because\nthe existence of a science’s subject matter, Avicenna notes\nfollowing Aristotle, is never demonstrated within that very science\nitself but only in a higher science.\n\nHaving set aside the issue of whether natures exist and for present\npurposes posits that they do, Avicenna now unpacks Aristotle’s\ndefinition. Before considering his analysis, however, it should be\nnoted that there is a certain ambiguity in Aristotle’s overall\ntreatment of nature. The ambiguity involves whether nature should be\ntaken in a passive sense: is nature a cause of a substance’s\nbeing moved? Or, alternatively, should nature be taken in an\nactive sense: is a nature a cause of a substance’s (self)\nmotion? In Physics, 2.1, the text where Aristotle defines\nnature, he suggests, although does not explicitly claim, that nature\ncan be understood in both senses: a passive nature, which corresponds\nwith a substance’s matter, and an active nature, which\ncorresponds with the form of that substance, and so is a cause of its\nmotion. In contrast, later in the Physics, he argues that\nnatures should be understood exclusively as passive (Aristotle,\nPhysics, 8.4, 225b29–256a3). This conclusion follows\nupon Aristotle’s principle that everything that is moved must be\nmoved by something, which he established at Physics, 7. The\nprinciple is significant for a key element in Aristotle’s his\nnatural philosophy, namely, his proof for an unmoved mover. (The\nunmoved mover is intended to explain why there is motion at all.) The\naforementioned principle is significant because if all natural\nsubstances were capable of self motion, it is no longer clear that\nthere is a need for an unmoved mover to account for the motion of the\ncosmos. This ambiguity in Aristotle account of nature, namely, whether\nnature is an active source of moving or a passive factor of being\nmoved, was the source of much discussion among Aristotle’s\nsubsequent Greek commentators, who included\n Alexander of Aphrodisias\n (ca. 200 CE) and the late Christian, Neoplatonic Philosopher\n John Philoponus\n (ca. 490–570). (For more detailed studies of this tradition see\nMacierowski & Hassing 1988, Lang 1992, 97–124 and Lammer\n2015, 2018, ch. 4).\n\nAristotle’s definition of nature as it came down to Avicenna in\nArabic literally translates into English as “the primary\nprinciple of motion and rest in that to which it belongs essentially\nrather than accidentally” (quoted in Avicenna, [Ph], 1.5\n [4]).[3]\n A “principle of motion,” Avicenna tells us, means\n“an efficient cause from which proceeds the production of motion\nin another, namely, the moved body” (ibid). Immediately we\nrecognize that a nature for Avicenna can be understood as an active\ncause that produces motion. Such a position is to be contrasted with\nAristotle’s claim at Physics 8.4 that a nature is not\nan internal cause of a thing’s motion, but of its being\n moved.[4]\n Next we learn that “primary” in the definition means that\nthe nature causes the motion in the body without some further\nintermediary cause. As for “essentially,” (Gk. kath\nhauto, Ar. bi-dhātihi) it is an equivocal notion\nwith two senses, Avicenna tells us. In one sense,\n“essentially” is predicated relative to the mover, while\nin another sense it is predicated relative to what is subject to\nmotion, namely, the body. Thus, on the one hand, when\n“essentially” is said relative to the mover, a\nsubstance’s nature, as efficient cause, essentially produces\nthose motions and actions that typify the substance as the kind that\nit is. On the other hand, when “essentially” is said\nrelative to the body, it refers to the body’s essentially being\nsubject to those naturally characteristic motions and actions. In\neffect, by distinguishing the two relative senses of\n“essentially,” Avicenna has made room for\nAristotle’s definition to include nature as an active and as\npassive principle. To sum up, for Avicenna, a substance’s nature\nis the immediate efficient cause for all of the naturally\ncharacteristic actions and motions it produces (active nature) as well\nas explaining why the body is subject to those characteristic actions\nand motions (passive nature).\n2. Bodies and Magnitudes\n2.1 General Background\n\nWith the distinction between nature as active and nature as passive in\nplace, it becomes clear why Avicenna identifies the proper subject\nmatter of natural philosophy with body insofar as it is subject to\nmotion, for the science of physics studies nature in both of its\nactive and passive senses. Nature as passive refers to that which is\nsubject to motion, namely, bodies, while nature as active refers to\nthe causes and conditions of the motions and actions that bodies\nnaturally undergo. In this section, I begin with Avicenna’s\ngeneral introduction to bodies. I then take up his critique of\natomism, specifically as that theory was developed within Kalām.\nThereafter, I turn to Avicenna’s theory of the continuity of\nmagnitudes and his conception of infinity, concluding with a brief\nsurvey of his theory of the elements.\n\nSensible body (jism or occasionally jirm), one can\nassume, is an aggregation of parts. Starting from this assumption,\nAvicenna next says of the body that it either (1) has actual\nparts or (2) has no actual parts. Avicenna effectively\ndivides the logical space for a discussion of the aggregation of body\ninto two categorical propositions: either “Some parts in a body\nare actual” or “No parts in a body are actual.”\nThese are logically contradictory propositions, and so along one\ndimension they exhaust all logically possible options. In the case of\n“some parts,” the obvious question is, “How\nmany?” where “finite” and “infinite”\nexhaust the possible options. Of course, the question, “How\nmany?” is irrelevant when applied to no or 0 parts. Thus, there\nare three possible positions: body is an aggregate of (1) a finite\nnumber of actual parts, a position identified with that of the\natomists; (2) an infinite number of actual parts, a position\nidentified with that of Ibrāhīm al-Naẓẓām\n(c. 775–c. 845); (3) no actual parts, a position associated with\nthe Aristotelian tradition and the contention that bodies are\ncontinuous and so not an aggregate of actual parts, even if\npotentially divisible ad inifinitum.\n\nAvicenna makes short work of (2), al-Naẓẓām’s\nposition (Avicenna, [PR], namaṭ 1, ch. 2; and [Ph], 3.4\n[1]). The parts are units of the whole, which must have either no\nmagnitude or some magnitude. If the units have no magnitude, then\nwhile multiplying them may increase the number of units present in a\nbody, it will not increase the size of the body. Consequently, bodies\nwould not have any magnitude, an obviously false conclusion. If the\nunits have some magnitude, be it ever so small, and the body is\ncomposed of an actual infinity of these units, then complains\nAvicenna, “the relation of the finite units to the infinite\nunits would be the relation of a finite to a finite, which is an\nabsurd contradiction” (Avicenna, [PR], namaṭ 1,\nch. 2, p. 162). For instance, assume that\nal-Naẓẓām’s unit measures some extremely small\nyet positive amount of distance, for example, 1.5 x 10-35\nof a meter, then:\n\n∞ al-Naẓẓām’s-units : 1 m :: 1.5 x\n10-35 al-Naẓẓām’s-units : 1 m.\n\n\nThus ∞ : 1.5 x 10-35, that is, an infinite is\nproportional to a finite, which, as Avicenna notes, is absurd.\n\nAvicenna’s more important target was Kalām atomism, which\nis significantly different from the Democritean atomism, which\nAristotle had criticized. Thus, let us consider it quickly before\nturning to Avicenna’s critique of atomism.\n2.2 Avicenna on Atomic/Discrete Magnitudes\n2.2.1 Kalām Atomism\n\nAristotle had in his physical writings addressed and critiqued atomism\n(e.g., Aristotle, Physics, 6.1 and On Generation and\nCorruption, 1.2). In the time between Aristotle and Avicenna,\nhowever, there were a number of developments in atomic theory both by\nEpicurus, one generation after Aristotle, and by Muslim theologians,\nthat is, proponents of Kalām, most of whom were atomists (Dhanani\n1994, 2015). As a result, Avicenna’s critique of atomism needed\nto address new innovations and challenges. One such innovation, which\ncan be traced back to the Greek world, is a distinction between\nphysical divisibility and conceptual divisibility. Thus, for example,\nthe atoms of\n Democritus\n (d. 370 BCE) have as one of their properties shapes. If atoms have a\nshape and to have a shape is to have definite limits, then one might\nreason that Democritean atoms have distinct limits into which they can\nat least be conceptually divided, even if not physically divided.\nAristotle in fact exploited this point in his critique of Democritus.\nIn contrast, the minimal parts of\n Epicurus\n (d. 270 BCE) had no shape, and so were not subject to the same\ncriticism. Indeed, Epicurean minimal parts are purportedly not merely\nphysically indivisible but also conceptually indivisible. To provide a\nrough and ready image of an Epicurean minimal part, one might think of\nthe surface thickness of a plank, and the plank itself as the\naggregation of such surfaces. For example, then, when the surfaces of\ntwo planks are brought together tightly, intuitively one may think\nthat the two surfaces remain two distinct physical things; the bottom\nof the top plank, for instance, is distinct from the top of the bottom\nplank. When some enormous number of these surfaces is aggregated, a\nplank with a definite thickness, one might imagine, results. So how\nthick are these surfaces? One cannot fathom, but again being so thin\nthat dividing it further is inconceivable is the very point of\nEpicurus’ minimal parts. Whatever the chain of transmission, it\nwas something much like Epicurus’ minimal parts that Muslim\natomists identified with their atoms, or more precisely, indivisible\nparts (sing. al-juzʾ alladhī lā\nyatajazzaʾu)—a spatial magnitude that was not merely\nphysically indivisible but also conceptually indivisible.\n\nAnother difference between the theory of atomism that Aristotle\naddressed and the one that Avicenna does is the very nature of the\natoms themselves. Democritus’ atoms with their differences in\nshapes as well as differences in possible arrangement and positions\nare best considered as corpuscles, that is, small bodies. Thus when\nspeaking of Democritus, we can speak of “corpuscular\natomism.” Such is not necessarily the case with Epicurean\nminimal parts or Kalām atoms, which, while making up the parts of\nbodies, were not themselves considered bodies. While there is some\ndispute about this point concerning Epicurus, Kalām atomists are\nfairly consistent in saying that the sole property of their atoms is\nthat they occupy space (mutaḥayyiz) but otherwise lack\nany other determinations. In fact, Kalām atoms might best be\nthought of as a matrix making up all space, with the individual atom\nrepresenting the smallest spatial magnitude necessary for the\noccurrence of some co-incidental event, determination or accident,\nlike being red or hot or wet or even possessing power. In this\nrespect, Kalām atoms are comparable to the pixels on a modern-day\nTV or computer screen. The two are comparable in that both are the\nsmallest relevant units in which a sensible effect occurs, whether\nsome color for modern pixels or any accident more generally for\nKalām atomists. Consequently, this variety of atomism might be\ncalled “pixelated atomism” to contrast it with the\ncorpuscular atomism that had been the target of Aristotle’s\ncriticisms. The significant point is that Avicenna could not simply\nappeal to Aristotle and his attack on corpuscular atomism when\ncritiquing atomism as he found it.\n\nRegardless of what form of atomism one endorsed, a common argument in\natomism’s favor appeals to the notion of a sensible body’s\nbeing an aggregation of parts. The argument is directed against the\nidea that a continuous magnitude, which for the philosophers included\nthe natural sensible bodies that make up the world, can be potentially\ndivisible ad infinitum (cf. Aristotle, Physics 3.7, 207b16).\nThe most general form of the argument rests on two principles: (1) the\nimpossibility of an actual infinity, a premise that even most\nAristotelians accepted; and (2) an analysis of potentiality in terms\nof an agent’s power, namely, to say that some action φ is\npotential is to say that there exists an agent who has the power\nactually to do φ. As part of a reductio-style argument, one is\nasked to assume (3), bodies are potentially divisible infinitely. In\nthat case, from (2), there must exist some agent (e.g., God) that can\nactually bring about the division. So let the agent enact the\npotential division. Either the result is an actually infinite number\nof parts or a finite number of parts. From (1), recall, an actual\ninfinity is impossible. Therefore, the totality of potential parts\nthat actually can be produced from the division is finite, but it was\nassumed that they were infinite, a contradiction. Since (1), (2) and\n(3) are mutually incompatible, one of these assumptions must be false.\nThe atomists point to the assumption of infinite divisibility and a\npotentially infinite number of parts. Thus, the argument concludes,\nthe parts from which sensible bodies are aggregated must be finite,\nwhether actually or potentially.\n2.2.2 Avicenna’s Criticisms of Atomism\n\nAvicenna’s response to this argument against the potentially\ninfinite divisibility of bodies is considered when discussing his\ntheory of\n continuity.\n Prior to that, his reasons for rejecting atomism must be examined. To\nstart, Avicenna accepts that division with respect to body is of two\nsorts: physical division and conceptual division. In physical\ndivision, there is the actual fragmentation of a body, with the parts\nof the body becoming physically separated and at a distance from one\nanother. An example would be when one takes a single quantity of water\nand places part of it in one vessel and the other part in another\nvessel. Avicenna concedes that it well may be the case that bodies\nhave some physical limit beyond which they no longer can be physically\ndivided and still remain the same sort of body. To provide an example\nof Avicenna’s point, our quantity of water can be divided as\nwater until one reaches a single water molecule; division beyond that\npoint, while producing hydrogen and oxygen atoms, does not produce\nsmaller particles of water. A single water molecule, then, is\nphysically indivisible as water; it no longer remains as water after\nany further division. Still, inasmuch as a single water molecule\noccupies some space, however small, one can conceive of half of that\nwater molecule, and so it is conceptually divisible qua magnitude.\nWhether there actually are such physically indivisible units, Avicenna\ninsists, requires proof, which I consider when looking at\n Avicenna’s elemental theory.\n\nThe form of atomism that Avicenna rejects is that there exist minimal\nparts that cannot even be conceptually divided further. These are the\nminimal parts of Epicurus and the atoms of Kalām.\nAvicenna’s arguments against this conception of atomism takes\ntwo forms: one, arguments showing that there is a physical absurdity\nwith such atoms and, two, arguments showing that this form of atomism\nis incompatible with our best mathematics, namely, that of Euclidean\ngeometry. The following two examples give one a sense of how\nAvicenna’s physical-style and mathematical-style criticisms work\n(Avicenna, [PR], namaṭ 1, ch. 1 and [Ph], 3.4; Lettinck\n1988). While all the arguments considered are specifically directed\ntoward a theory of pixilated atomism, they apply equally well to\ncorpuscular atomism. Additionally, Avicenna has a series of arguments,\nnot considered here, showing the absurdities that would follow on the\npurported motion of corpuscular atoms.\n\nWhile some of Avicenna’s physical-style arguments are quite\ncomplex and sophisticated, showing that the aggregation of bodies\nwould simply be impossible on the Kalām atomists’ view (an\nexample can be found in Section 2.3 of the entry on\n Arabic and Islamic natural philosophy and natural science),\n the following thought experiment is perhaps more intuitively obvious.\nPosit a sheet of conceptually indivisible atoms between yourself and\nthe sun. Certainly the side facing the sun is distinct from the side\nfacing you, for if the side that the sun is illuminating is the very\nsame side upon which you are gazing, there is no sense in which the\nsheet of atoms is between you and the sun. Thus on the\nassumption that it is physically possible for this sheet to exist\nbetween you and the sun, all the atoms composing the sheet have a\nsun-side and a you-side, and these two sides are distinct.\nPurportedly, conceptually indivisible atoms have been divided, a\ncontradiction.\n\nAvicenna’s mathematical-style critique of Kalām atomism\nfrequently appeal to issues associated with incommensurability. In\nthis vein he argues that such geometrical commonplaces as diagonals\nand circles would be impossible on the assumption of conceptually\nindivisible atoms. For example, in the pixilated atomism of the\nKalām, the atoms might be thought to form a three-dimensional\nCartesian coordinate system with each atom corresponding to some\nordered triplet on this space. A two-dimensional plane, then, would\nlook something like a chessboard. Avicenna now has us describe a right\nisosceles triangle on this chessboard, setting the two equal sides,\nfor instance, at 3 units. Given the Pythagorean Theorem, A2\n+ B2 = C2, we should be able to solve for the\nlength of the hypotenuse, which is √18 ≈ 4.25. Avicenna,\nnext observes that assuming Kalām atomism, the hypotenuse of our\ntriangle must fall either well below the solution given by the\nPythagorean theorem—namely, it would be 3 units if one just\ncounts the 3 squares along the diagonal of a 3x3 chessboard—or\nsignificantly exceed it—for instance 6 units, if the atoms can\nsomehow be stair stepped. Alternatively, one might consider units\nsmaller than the atoms, but such a move is to give up atomism.\nKalām atomism, then, cannot even approximate the answer of the\nPythagorean Theorem, and yet the Pythagorean Theorem is arguably the\nmost well-proven theorem in the history of mathematics. Given the\nchoice between a dubious physical theory and our best mathematics,\nAvicenna sides with Euclidean geometry and its assumption of\ncontinuous\n magnitudes.[5]\n2.3 Continuity\n\nHaving rejected atomism, with its central claim that sensible bodies\nmust be aggregates of a finite number of conceptually indivisible\nparts, Avicenna must explain and defend his preferred account of\nbodies. Avicenna adopts a modified form of Aristotle’s theory of\nthe continuity of bodies. Aristotle himself had provided no fewer than\nthree different accounts of continuity (Gk. sunecheia, Ar.\nittiṣāl):\n\nAB is continuous iff AB can be divided into things always capable\nof further division (Physics, 3.7 & De Caelo,\n1.1)\nA is continuous with B iff the extremities of A and B are one and\nthe same (Physics, 6.1)\nA is continuous with B iff there is a common boundary at which\nthey join together (Categories, 6)\n\n\nPrecisely because these three accounts are different, Avicenna starts\nhis own discussion of continuity, claiming that “being\ncontinuous is an equivocal expression that is said in three\nways” (Avicenna, [Ph], 3.2 [8]). Two of these senses, he\ncontinues, are relative notions, while only one, i.e., (3) above,\nidentifies the true essence of what it is to be continuous. In fact,\nhe even goes as far as to say that account (1) is not truly a\ndefinition of being continuous at all; rather, it is a necessary\naccident of the continuous that must be demonstrated, a point to which\nI return when I look at what Avicenna considers to be the proper\naccount of continuity.\n\nAs for the relative notions of continuity, the explanations can be\nquick. First, discrete objects might be said to constitute a\ncontinuous whole relative to a motion. For example, all the connected\ncars on a moving locomotive are clearly distinct and separate things,\nand yet they move together as a continuous whole. Second, discrete\nobjects might be said to be continuous according to Aristotle’s\ndefinition (2) relative to some shared extremity. For example, for any\nangle ∠ABC greater than or less than 180°, the lines AB and BC\nshare one and the same extremity, B, and yet are distinct and jointed.\nNeither of these senses is strictly speaking the target of the\natomist’s critique nor the thesis concerning the continuity of\nbodies and magnitudes that Avicenna (or other Aristotelians) is keen\nto defend. Thus for Avicenna only (3), that two things are continuous\nif and only if there is a common boundary at which they join together,\ncaptures the proper definition of continuity.\n\nA continuous sensible body (or any magnitude), Avicenna insists, must\nultimately lack any parts and instead must be considered entirely as a\nunified whole. Admittedly, one can posit parts in this unified whole,\nlike the left-part and the right-part, but such accidental parts are\nwholly the result of one’s positing and they vanish, claims\nAvicenna, with the cessation of the positing.\n\n[Such parts are] like what happens when our estimative faculty\nimagines or we posit two parts for a line that is actually one, where\nwe distinguish one [part] from the other by positing. In that way, a\nlimit is distinguished for [the line] that is the same as the limit of\nthe other division. In that case, both are said to be continuous with\neach other. Each one, however, exists individually only as long as\nthere is the positing, and so, when the positing ceases, there is no\nlonger this and that [part]; rather, there is the\nunified whole that actually has no division within it. Now, if what\noccurs through positing were to be something existing in the thing\nitself and not [merely] by positing, then it would be possible for an\nactually infinite number of parts to exist within the body (as we\nshall explain), but this is absurd (Avicenna, [Ph], 3.2 [8]).\n\n\nTo press Avicenna’s point a bit further, a continuous body has\nno parts in it, not even potential parts, if by “potential\nparts” one means points or the like latent within the body\nwaiting for some power to actualize them or divide the body at them.\nTo appreciate Avicenna’s point here fully, a few words must be\nsaid about his conception of the form-matter constitution of bodies\nand the relation of his view of continuity to psychological\nprocesses.\n\nLike Aristotle and other Aristotelians both before and after him,\nAvicenna is convinced that bodies are constituted of matter and form.\nIf one considers just body as such, that is, disregarding any specific\nkind of body it might be, then this absolute body, Avicenna tells us,\nis a composite of matter (hayūlā) and the form of\ncorporeality (ṣūra jismiyya). Avicenna conceives\nmatter as wholly passive, having no active qualities or features. (For\ndiscussion’s of Avicenna theory of matter see Hyman 1965;\nBuschmann 1979; Stone 2001; McGinnis 2012; but also see Lammer 2018,\n§3.2 for corrections of some of these earlier views.) In fact,\nAvicennan matter has no positive characterizations of its own at all\nby which it can be defined; rather, for Avicenna, matter is best\nunderstood solely in relation to the forms by which it is actualized\nand informed. Avicenna’s matter, then, is intimately linked with\nrelative privation (ʿadam), that is, some lack, which\nunder the right conditions can be realized. Given matter’s\nessentially privative character, it, then, cannot be the explanation\nfor a sensible body’s having the positive characteristics of\nbeing unified and one, nor the cause of that body’s being\nextended so as to be subject to division. Instead, according to\nAvicenna, what makes a body a unified whole and subject to division is\nits form of corporeality.\n\nFor a determinate body to exist at all, Avicenna believes, it must\nhave a determinate shape, and so be three dimensional, and so be\nlocalized in space. Both of these features are the result of its\ncorporeal form (For a fuller discussion see Hyman 1965; Shihadeh 2014;\nLammer 2018, §3.1). When the form of corporeality comes to inform\nmatter, there comes to be a single unified body, existing on account\nof its particular and individual form of corporeality. Should the body\nbe physically divided, the particular and individual form of\ncorporeality is not so much divided as destroyed and replaced with two\nnew particular and individual forms of corporeality corresponding with\ntwo new bodies. It is essentially the form of corporeality that\nunifies and makes a body numerically and actually one. Additionally,\nwhile the form of corporeality makes the body actually one,\nit also makes the body potentially many. That is to say, the\nform of corporeality is the cause of a body’s being\nthree-dimensional such that one can posit such divisions as right-side\nand left-side in it.\n\nWe are now led to the role of psychological processes in\nAvicenna’s account of a continuous body’s infinite\ndivisibility. While it is true for Avicenna that continuous bodies can\nconceptually be divided without end, such a feature is not the result\nof any positive attribute within the body. This potentiality for\ndivision does not correspond with any positive features latent within\nthe body. Instead the potentiality for infinite division refers to a\nprivation in the matter of the body. The matter, extended and\npossessing quantity as a result of the form of corporeality, does not\npreclude or prevent one from positing imagined divisions within the\nbody as small as one wants. Indeed, this psychological process of\nimaging or positing divisions in principle has no end. Thus, looking\nat, for example, a meter stick, one can posit a halfway point, then\nthe halfway point of one side and then a further halfway point and so\non as long as one likes; however, as soon as one stops the process of\nimagining halfway points, the imagined points (regardless of how many\none has imagined) do not magically remain but altogether cease with\nthe cessation of their being posited. The body remains as it always\nwas, a unified whole, whose unity is only ever lost by actual physical\ndivision, not conceptual division.\n\nWith this conception of continuity in place, the Kalām argument\nagainst potential divisibility ad infinitum dissolves. Again that\nargument assumed two principles: (1) the impossibility of an\nactual infinity; and (2) an analysis of potentiality in terms\nof an agent’s power, namely, the view that some action φ is\npotential if and only if there is an agent who has the power actually\nto do φ. In point of fact, Avicenna rejects both principles (his\nconception of infinity is discussed at\n 2.4);\n for now he simply questions the theologians’ inference from\nsomething’s being potential to the possibility of its being\nrealized all at once at some moment or other. The original Kalām\nargument assumed that a potential infinity of divisions existed in a\ncontinuous body. In that case, the argument continued, let God\nactualize that potential, and one is confronted with an actual\ninfinity. Avicenna in contrast understands the potential infinite\ndivisibility of bodies in terms of an ongoing process of positing\nsuccessive divisions within the magnitude, a process that by\ndefinition has no end. Of course, there is a contradiction here in\nassuming that some agent, even God, can get to the end of some process\nthat has no end, but such a contradiction does not tell against\nAvicenna’s theory of continuous bodies. In fact,\nAvicenna’s conception of potential infinite divisibility is\ncompatible with (2), since there is no immediate contradiction in\nsaying that God eternally and without ceasing posits ever-decreasing\nhalfway points in some magnitude. Still even in this case, there never\nis an actual infinity of such halfway points, as the proponents of\nKalām atomism maintain.\n2.4 Infinity and the Shape of the Cosmos\n\nWith the introduction of continuity and its corresponding notion of\ninfinite divisibility one is also obliquely introduced to the notion\nof infinity (lā nihāya). Avicenna, following\nAristotle’s account of the infinite (apeiron) at\nPhysics, 3.6, defines it as “that which whatever you\ntake from it—and any of the things equal to that thing you took\nfrom it—you [always] find something outside of it”\n(Avicenna, [Ph], 3.7 [2]). In natural philosophy, the immediate issue\nis whether an infinity exists either in quantities that posses some\nposition or in numbers in an ordered series (Avicenna, [Ph], 3.7 [1]).\nThe mutakallimūn, that is, the proponents of Kalām, were for\nthe most part opposed to predicating the infinite of anything other\nthan God. This opposition included both actual infinity and potential\ninfinity, as we have seen. While it is notoriously difficult to give a\nprecise account of the difference between the actual as opposed to the\npotential infinite, a rough characterization is this: In the case of\nan actually infinite magnitude, all the parts of that magnitude are\nsomehow simultaneously and fully present, whereas in the case of the\npotentially infinite there is an going process or succession in which\nthe units come to be, never wholly existing as actual at some given\npoint or moment. While Avicenna happily accepts the reality of\npotential infinities, he denies that there are material instances of\neither actually infinite qualities, like infinitely large bodies, or\nnumbers, like infinitely large sets of bodies, all of which exist\n simultaneously.[6]\n\nAvicenna has a number of arguments attempting to show that an actual\ninfinity in nature is impossible (for a presentation and assessment of\nsome of these arguments see Zarepour 2020). These arguments can be\ndivided into those that appeal to motion as part of the proof, and\nthose that do not appeal to motion. Here I merely consider one of\nAvicenna’s non-motion proofs against an actual (spatial)\ninfinity. The argument, which I present, is not the preferred proof in\neither The Cure or The Salvation, although he had\ntoyed with it in The Cure (Avicenna, [Ph], 3.8 [5–7]).\nStill it is his preferred and indeed only argument against an actual\ninfinity in his shorter and last philosophical encyclopedia,\nPointers and Reminders (Avicenna, [PR], namaṭ\n1, ch. 11, p.\n 183–90).[7]\n Moreover, the proof is a uniquely Avicennan one.\n\nThe argument asks one to posit some actually infinite ray, AB and then\nanother actually infinite ray, AC, so as to form an acute angle\n∠BAC. Next Avicenna asks one to consider the gap, BC, between the\ntwo rays. The farther from A that BC is, the larger BC becomes. Since\nthe two rays are actually infinitely extended, BC should, in\nprinciple, also be actually infinite; however, BC always lies between\nAB and AC and of necessity terminates at them, so BC is finite. Thus,\nthere is a contradiction: BC is both finite and infinite and, claims\nAvicenna, what produced the contradiction is the assumption that there\nis actually infinite space. Whether Avicenna’s new argument is\nsuccessful became a matter of intense debate in post-classical Islamic\nnatural philosophy, with such notables as Abū l-Barakāt\nal-Baghdādī (1080–1165) and Najm al-Dīn\nal-Kātibī al-Qazwīnī (ca. 1203–1277) finding\nit wanting, whereas Naṣīr al-Dīn\nal-Ṭūsī (1201–1274) and Mullā\nṢadrā (1571–1636) considered it defensible (McGinnis\n2018).\n\nAvicenna’s arguments against an actual infinity in nature are in\ngeneral all directed against the possibility of infinite spatial\nmagnitude. Consequently, since space must be finite (i.e., limited),\nall bodies must be limited, and in being limited they have shape. This\nconclusion holds for the cosmos as a whole as well. As for the shape\nof the cosmos, while such a topic takes us slightly afield from a\ndiscussion of infinity, it does round out Avicenna’s abstract\ndiscussion of body. For a number of reasons, Avicenna thinks that the\nshape of the cosmos must be spherical. While in some ways Avicenna\ntakes this claim to be a matter of empirical observation, he also\nargues that since the nature of the heavenly bodies is completely\nhomogeneous and unvarying, there cannot be dissimilarities in a\nheavenly body such that a part of it would be angular and another part\nrectilinear or such that part of it has one sort of curve and another\npart a different sort (Avicenna, [DC], 3; also Avicenna, [Ph], 1.8 [2]\nprovides the general argument, albeit there it is applied to showing\nthe sphericity of the Earth). Inasmuch as the cosmos is spherical, it\nmust have some center, which, at least from the point of physics,\nAvicenna identifies with the Earth. (Strictly speaking the Earth is a\nbit off center in accordance with the demands of the Ptolemaic\nastronomy, which Avicenna adopts.)\n\nWe thus now have a general picture of Avicenna’s conception of\nbody in the abstract. Body is not composed of conceptually indivisible\natoms but must be continuous and finite. In the next section I briefly\nconsider body not in the abstract, but particular kinds of bodies,\nnamely, the so-called elements.\n2.5 Simple Bodies and the Elements\n\nWhen Avicenna speaks of elements (sing. usṭuquss) and\n(elemental) components (sing. ʿunṣur), he means\nsimple bodies, that is, bodies that are not composed of other sorts of\nbodies in the way that flesh, blood and bones, for example, are\ncomposed of more basics elements. Despite being simple, the elements\nare form-matter composites (Avicenna, [DC], 1). On account of their\nform and matter, elements have two powers: an active power following\nupon the element’s form and a passive power following upon its\nmatter.\n2.5.1 The Motions and Qualitative Powers of the Elements\n\nAdditionally, Avicenna specifies different kinds of elements based\nupon three kinds of natural motions. The three kinds of natural motion\nare (1) motion around the center, (2) motion toward the center and (3)\nmotion away from the center (Avicenna, [DC], 2). Celestial bodies are\nin turn identified with those bodies whose natural motion is around\nthe center. Terrestrial bodies are identified with those undergoing\nrectilinear motion either toward or away from the center. By\nconvention, what moves away from the center moves upward, while what\nmoves toward the center moves downward. Avicenna believes that moving\naround the center, circular motion, is generically simple inasmuch as\nhe thinks that there is no contrary to circular motion (Avicenna,\n[Ph], 4.6 [7–11] & [DC],\n 2).[8]\n Consequently, the very nature of a celestial body is to move\ncircularly (Avicenna, [PR], namaṭ 2, ch. 12). As for\nthe terrestrial bodies, moving upward and downward are also generic\ndescriptions; however, Avicenna continues, each of these genera also\nhas two species, corresponding with the different termini of the\nmotion. Thus, for example, those bodies that move downward are\ngenerically alike in that they move away from the surrounding\ncelestial sphere; however, they can differ in that some have the\ncenter as their proper place or terminus for their motion, whereas the\nterminus of other downward-moving bodies falls short of the center.\nAny body that has the center as its proper place has absolute downward\nmotion, while a downward-moving body whose terminus falls short of the\ncenter has relative downward motion. The same holds mutatis\nmutandis for bodies that move upward. Those that have the limit\nof the surrounding celestial spheres as their terminus have absolute\nupward motion, while those whose terminus falls short of that limit\nhave relative upward motion.\n\nIn order to explain the specific differences of the terrestrial\nelements, Avicenna, following a long tradition, which can be traced\nback at least as far as Hippocrates (460–370 BCE), appeals to\ncertain basic qualitative powers. These qualitative powers are\nhot/cold, which are seen as active powers following upon the form, and\nwet/dry, which are seen as passive powers, following upon the matter\n(Avicenna, [DC], 1). Additionally, Avicenna claims, the downward\nmotion of those elements so naturally inclined, namely, earth and\nwater, is the result of their being qualitatively cold and being\ndirected to their natural places, that is, toward the center.\nAnalogously, the upward motion of those elements so naturally\ninclined, namely, fire and air, is the result of their being\nqualitatively hot and being directed to their natural places, that is,\naway from center. The elements, earth and water’s natural\ninclination (mayl) downward is referred to as their\nheaviness, while fire and air’s natural inclination upward\nreferences their lightness (Avicenna, [DC], 2). As for the qualities,\nwet and dry, these passive powers refer to a body’s\nsusceptibility or lack thereof to the impressions and actions of some\nform. For example, what is wet or fluid more easily receives the\nimpression of a form (just think of wet clay). In contrast, what is\ndry, while more readily retaining any impressions made in it, does not\neasily yield to being impressed (now think of kiln-dried clay). Given\nthese differences in motions and qualitative powers, Avicenna, again\nfollowing in this tradition, identifies four terrestrial elements: (1)\nfire, which is hot and dry with an absolute upward motion, (2) air,\nwhich is hot and wet with a relative upward motion, (3) water, which\nis cool and wet with a relative downward motion and (4) earth, which\nis cool and dry with an absolute downward motion. Finally, and for\ncompleteness, (5) celestial bodies are neither hot nor cold (and so\nneither heavy nor light) nor wet nor dry, but instead are solely\nidentified in term of their natural circular motion.\n2.5.2 Natural Minimums\n\nIn section\n 2.2.2,\n it was noted that while Avicenna denied the possibility of\nconceptually indivisible atoms, he allowed for the possibility of\nphysically indivisible natural minimums. In other words, there might\nbe limits beyond which some specific kind of natural body cannot be\ndivided further and remain that same kind of body. It was further\nnoted that a proof was required whether there actually were such\nnatural minimums. We are now in a position to consider\nAvicenna’s proof for this thesis (Avicenna, [Ph], 3.12). Recall\nthat for Avicenna there are two forms of division. One involves merely\npositing imagined divisions within a magnitude, so as never actually\nto destroy the continuity of the body. The second involves actually\nfragmenting and separating parts of the body such that the parts are\nat a distance from one another. Avicenna’s proof for natural\nminimums involves this second form of division, namely, bringing about\na separation of the parts. It additionally presupposes the theory of\nelements just presented and particularly the qualitative powers that\nare the necessary concomitants of the terrestrial elements.\n\nWhile the details and argumentation of Avicenna’s theory are\ncomplex, the heart of the theory can be grasped through the following\nexample. (For a discussion of the history and details of\nAvicenna’s account of natural minimums see McGinnis 2015.)\nAvicenna first observes that the smaller something is compared with\nits surrounding environment, the faster and more easily that\nenvironment acts on what is surrounded. For example, a blast furnace\nmelts a kilogram of ore more readily than it does a metric ton of ore.\nNow, the example continues, isolate some relatively small quantity of\nwater, e.g., a milliliter, in a beaker. The water qua the element\nwater has the essential qualities of being cold and wet. Additionally,\ninasmuch as the water is isolated, and so not part of a lake or the\nlike, it is surrounded by ambient air, which, according to the\nelemental theory that Avicenna adopts, is hot and wet. Provided that\nthe quantity of water is sufficiently large, it can counteract the\nheating influences of the surrounding air; however, as one physically\nseparates off smaller and smaller quantities of the water, the natural\nheat of the surrounding air more readily and effectively acts on the\ndiminishing quantity of water. At some point, the heat of the\nsurrounding air fully overcomes the coolness of the small quantity of\nwater such that the coolness is replaced with the same degree of heat\nas the surrounding air. In that case, there is no longer a cold-wet\nelement but a hot-wet element, and so there comes to be air. What the\nexample indicates is that there are natural limits of smallness beyond\nwhich the qualitative concomitants of a given element can no longer be\nsustained in isolation, and instead a new set of concomitants, now\nassociated with dominant ambient element, come to be. These limits\nbeyond which a particular kind of body cannot be physically divided\nand remain the same kind of body are the natural minimums.\n3. Motion\n\nAgain the proper subject matter of physics is body inasmuch as it is\nmovable. We have just looked at Avicenna’s conception of body\nand associated issues. I now turn to his theory of motion, followed by\ndiscussions of some of the conditions necessary for motion, like time\nand place. Avicenna’s theory of motion is best understood\nagainst the background of Aristotle’s account of motion and\ndevelopments surrounding that account that emerged in the later Greek\nworld. (For detailed discussions of Avicenna’s theory of motion\nsee Hasnawi 2001; McGinnis 2006a; and Ahmed 2016).\n3.1 Motion as First Actuality\n\nIn Physics, 3.1, Aristotle defines motion (Gk.\nkinēsis, Ar. ḥaraka) as the\nentelecheia of potential as potential. Aristotle himself\napparently coined the term entelecheia, which might mean\neither “actualization,” as in a process, or\n“actuality,” as in the completion of a process. Given the\nambiguity of this term, it was a matter of some concern among later\nGreek commentators to understand Aristotle’s precise meaning.\nThe details of the Greek debate need not concern us unduly, since the\nissue for philosophers in the medieval Islamic world was all but\nsettled by the choice of the Arabic translator of Aristotle’s\nPhysics, who rendered entelecheia as\n“perfection” or “completion”\n(kamāl). Consequently, for philosophers such as\nAvicenna, motion was understood as a sort of actuality or perfection,\nas opposed to an actualization or a process.\n\nGreek commentators provided additional glosses on the term\nentelecheia, which proved significant in Avicenna’s own\naccount of motion. Drawing upon other Aristotelian texts (e.g., De\nanima, 2.5), these commentators identified both a first actuality\nand second actuality. A first actuality is like the student who\nactually knows a particular language but is not speaking it at that\nmoment, whereas the second actuality is like that student when\nactually speaking that language. Avicenna follows suit and formally\ndefines motion as “a first perfection of what is in potential\ninsofar as it is in potential” (Avicenna, [Ph], 2.1 [3]). To\nclarify, Avicenna notes that in every category there are those things\nthat are actual and other things that, while actual in one respect,\nare potential in another. In the case of motion with respect to\nx (where x is some possible location or quantitative\nor qualitative feature of a body), the body before the motion is in\npotentiality to x—as well as any number of other places\nor states, y, z, etc. After the motion, the body is\nin a state of second actuality with respect to x, that is,\nx has been fully and completely reached or actualized. During\nthe motion, then, the body is in a state of first actuality with\nrespect to x. Avicenna understands this first actuality as a\ntype of “being directed toward” x\n(mutawajjih) as opposed to being directed toward y\nor z. There is motion as long as the body is directed toward\nx and there still remains some potentiality with respect to\nx, that is, the place or state of x has not been\nfully reached or actualized. For example, as long as I sit in my home,\nthere are any number of places that I might visit; however, once I get\nup and begin going to the pub, as long as I remain directed toward the\npub but have not yet reached it, there is the motion that is my\nwalking to the pub.\n3.2 Two Senses of Motion: Traversal and Medial Motion\n\nThus far, Avicenna’s discussion of motion is little more than a\nsophisticated commentary on Aristotle’s definition of motion.\nAvicenna’s analysis goes beyond Aristotle’s inasmuch as\nAvicenna recognizes that “motion” is an equivocal term\nwith two senses. He identifies these two senses of motion, namely,\ntraversal-motion and medial-motion. As for motion qua traversal, we\nsometimes speak of motion as the whole continuous magnitude stretching\nfrom the initial potential state to the final actual state, such as my\ncomplete walk from my home to the pub. Now at no point does the whole\nof my walk exist in the way that the whole of the spatial distance\ncovered between my house and the pub exists. Indeed, no sooner do I\nstep outside the door of my home on my way to the pub than the initial\npotential state (being in my house) ceases to be and is replaced with\nsome new medial potential state (being on my porch). The same is true\nfor each subsequent state of the walk. Instead, observes Avicenna, the\nwhole and complete walk only ever exists as whole and complete in the\nmind, namely, I remember my being at home and then relate that mental\nimpression with my being in the pub. In other words, motion qua\ntraversal has no extra-mental existence but only ever has a mental\n existence.[9]\n\nIn contrast, medial-motion corresponds with motion inasmuch as it\nexists extra-mentally in the moving body itself. In other words,\nmedial-motion refers to the form that every moving body must have at\nany moment it is in motion in order to explain its being in motion.\nAvicenna describes this form thus:\n\n\nThis is the form of motion existing in the moved thing—namely,\nan intermediacy between the posited starting and end points inasmuch\nas at any limiting point at which it is posited, it did not previously\nexist there nor will it exist there afterwards, unlike [its state at]\nthe points of the two extreme limits (Avicenna, [Ph], 2.1 [6]).\n\n\nWhile Avicenna is careful to avoid using any overtly temporal\nlanguage, like “time,” “instant” or\n“now,” what he has described is motion at an instant as\nopposed to the extended conception of motion captured in\ntraversal-motion. In other words, motion as it exists extra-mentally\noccurs just in case a body exists at some point or in some state for\nonly an instant. For if a body is at some point or in some state for\nonly an instant, then at any subsequent instant it must be at some new\npoint or in some new state, and consequently must have changed or\nundergone motion. Such a position is not to concede that spatial,\nkinematic or temporal magnitudes are composed of points. They are not,\nfor again natural magnitudes are continuous according to Avicenna.\nInstead, Avicenna means that as one can considers a smaller and\nsmaller uniform motion over a smaller and smaller spatial magnitude,\nthe elapsed time of the motion becomes proportionally smaller too. At\nthe limit (ṭaraf) of this process of considering\nsmaller and smaller increments of motion, there is motion at an\ninstant, or, more in keeping with Avicenna’s description, at any\npoint you posit the body in the continuum, it was not there before nor\nwill it be there after. “This,” Avicenna concludes,\n“is, in fact, the first perfection,” which is motion\n(Avicenna, [Ph], 2.1 [6]).\n3.3 Motion and the Categories\n3.3.1 The Genus and Species of Motion\n\nAvicenna dedicates two chapters of the Physics of The\nCure (2.2 & 2.3) to motion’s relation to the\ncategories: one to motion’s genus and the other to the species\nof motion. As for the first issue, Avicenna attempts to identify to\nwhich category motion generically belongs inasmuch as the categories\nsupposedly provided the most generic ways that (material) things might\nexist. While in the end he concedes that given the canonical ten\ncategories, motion seems most aptly to fall under passion (Gk.\npaskhein; Ar. infiʿāl), he is also\nuncertain whether Aristotle’s ten categories are truly\nexhaustive and at least suggests that motion might be sui\ngeneris (Avicenna, [Ph], 2.2 [8]; Hasnawi 2004; and McGinnis\n2006a).\n\nAs for the species of motion (Avicenna, [Ph], 2.3), Aristotle and the\ntradition up to Avicenna had recognized only three specific kinds of\nmotion. These include motion with respect to the categories of\nquantity, quality and place. Motion with respect to quantity involves\naugmentation and diminution, while motion with respect to quality\nincludes such changes as alterations in color, temperature and the\nlike. Finally, on the traditional categorization, there is change of\nplace, that is, locomotion, which for a number of reasons was believed\nto be the most significant or even primary species of motion. Avicenna\naccepts all three kinds of motion identified by the tradition. He\nadditionally adds to these three, motion with respect to the category\nof position, that is, the rotation of an object that remains in the\nsame place, like a spinning orb. The reason for his addition is\nobvious on consideration; for clearly an orb spinning in place is not\nchanging its quantity or quality and by supposition it is remaining in\nthe same place, yet clearly it is moving. Thus what kind of change is\nit undergoing? Only the relative position of its parts, claims\nAvicenna, is changing, and thus he concludes rotating objects must be\nchanging with respect to the category of position.\n3.3.2 An Analysis of Positional Motion\n\nThe introduction of positional motion, however, brings with it a new\nchallenge. According to Avicenna, motion always involves a\nterminus a quo, that is, a “from which,”\n(mā minhu) and a terminus ad quem, that is, a\n“to which” (mā ilayhi) (Avicenna, [Ph], 2.1\n[12 & 20–22]). His reason for insisting on this point is\nthat motion, as noted, is the actuality of potential as potential,\nwhere the initial state of potentiality corresponds with the\nterminus a quo and the final state of actuality corresponds\nwith the terminus ad quem. The difficulty is that there need\nbe no starting and ending point for rotation, particularly if, as\nAvicenna believes, the rotation of the heavens has neither beginning\nnor end. Avicenna’s response to this challenge involves a\nsophisticated analysis of the various ways of understanding actuality\nand potentiality (including an appeal to the first and second\nactuality already noted but also introducing a notion of remote and\nproximate potentiality). Without going into the details, the general\nintuition of his response is simple enough (for a detailed account see\nMcGinnis 2006b). As a matter of supposition, one can posit within the\ncontinuous rotational motion of, say, a celestial sphere some point,\nfor example, the sun’s position when it is directly overhead. In\npositing that point, one by supposition indicates an initial\nterminus a quo of the motion, but that same point also\nindicates a terminus ad quem for that motion (although the\ntwo termini are in a sense also different since there is a difference\nin time between the two instances of being at that point). Thus, for\nexample in our case, a complete sidereal day is actualized when the\nsun moves from a position directly overhead—the terminus a\nquo—and then returns to that position—the\nterminus ad quem. Of course, nothing about this analysis\nrequires that the rotation must cease once this sort of terminus\nad quem, which is a proximate potency, has been actualized.\nIndeed it can be posited as a new terminus a quo for a new\nrotation. In short, rotational motion still has a terminus a\nquo and a terminus ad quem corresponding with a\npotentiality and actuality, even though such motion need have no\nabsolute beginning or ending point.\n\nAn added benefit of Avicenna’s introduction of this new species\nof motion is that it provides him an easy answer to what has been\ncalled “la grande question” of ancient celestial physics\n(Hasnawi 1984). As a bit of background to the problem, Aristotle\ndefined a thing’s “where,” or place, with the\noutermost containing limit of the surrounding body (Aristotle,\nPhysics, 4.4, 212a20) and Avicenna followed Aristotle\nfaithfully on this point (Avicenna, [Ph], 2.9 [1–3]; Lammer\n2018, §§5.1–2). Thus, only a body that has a body\noutside of it and containing it can have a place. Consequently the\noutermost celestial sphere “beyond” which there is\nabsolutely nothing, by definition cannot have a place. The problem,\nthen, is this: We observe the outermost celestial sphere apparently\nmaking a complete rotation once approximately every twenty-four hours,\nbut what specific sort of motion is the outermost celestial sphere\nundergoing? Aristotle and the earlier tradition had identified only\nthree species of motion: motion with respect to quantity, quality and\nplace. Clearly the motion of the heavens is neither a change in\nquantity nor a change in quality, but it is also not a change of\nplace, since, as we have seen, the outermost celestial sphere has no\nplace. Avicenna’s introduction of positional motion provides an\nobvious solution: the outermost celestial sphere is moving with\nrespect to the category of position. Moreover, Avicenna’s\nsolution is not ad hoc, since he has integrated his account of\npositional motion into his general analysis of motion and\nmotion’s relation to the categories.\n4. Conditions for Motion\n\nAgain physics is the study of bodies insofar as they are subject to\nmotion. We have just seen Avicenna’s account of motion and\nbefore that considered his views about bodies and magnitude more\ngenerally. A discussion of Avicenna’s treatment of certain\nnecessary conditions associated with motion and moving bodies is now\nin order. These necessary conditions are, one, how to identify the\nplace of a body and, two, the time required for motion.\n4.1 Place and Void\n\nAn account of place is particularly significant given that motion with\nrespect to place was frequently viewed as the primary species of\nmotion (although Avicenna would rank positional motion along side\nlocal motion, if not above it). The reason for giving priority to\nplace or position is that change in quantity involves the increase or\ndecrease of the place that a body occupies; and change in\nquality involves a body’s coming into proximity with some cause\nthat brings about the alteration, where “coming into\nproximity” refers to a change of place either in the\nbody or in the cause (Avicenna, [Ph], 4.9).\n\nAs noted when discussing positional motion, Avicenna follows the\nAristotelian tradition and identifies the technical definition of\nplace (Gk. topos, Ar. makān) with “the\nsurface that is the extremity of the containing body” (Avicenna,\n[Ph], 2.9 [1]). The general structure of his argumentation for this\nthesis involves showing that all other candidates for what place might\nbe are wanting in some way. To this end, Avicenna provides us with, as\nit were, the logical space for an account of place (Avicenna, [Ph],\n2.6 [2]). Place can be either intrinsic or extrinsic to body, that is,\nessential or accidental to it. If place is intrinsic to a body, then\nit is either (1) the matter or (2) the form of the body, whereas if it\nis extrinsic, then the place is either (3) what the body exactly\nencompasses, that is, an interval (buʿd) or (4) what\nexactly encompasses the body, that is, the surface that is the\nextremity of the containing\n body.[10]\n Avicenna quickly eliminates (1) and (2). That is because a body can\nchange with respect to place, that is, depart from one place to\nanother, whereas a body cannot depart from either its matter or form\nwithout undergoing generation and corruption. Hence only (3) and (4)\nare truly live options. Account (4) is just the Aristotelian one,\nwhich Avicenna himself prefers. As for (3), namely that a body’s\nplace is the interval it occupies, Avicenna believes that it\nultimately stands or falls with whether a void\n(khalāʾ), an empty interval, is possible. Avicenna\ndedicates a long chapter (Avicenna, [Ph], 2.8) to showing that a void\nis impossible. If his argument there is successful, then (4), namely,\nplace is the innermost limit of the containing body, remains the only\nviable definition of place.\n\nAristotle before Avicenna had also dedicated a long section of his\nPhysics (4.6–9) to a refutation of the void.\nAristotle’s arguments might all best be described as physical\nones inasmuch as they all appeal to physical concerns associated with\nthe void. More specifically, Aristotle’s arguments attempt to\nshow that motion would be impossible on the assumption of a void.\nAvicenna reproduces many of Aristotle’s physical arguments,\noften giving them his own unique twist. Additionally, however,\nAvicenna develops what might be called a conceptual critique of the\nnotion of void. In this critique, Avicenna attempts to show that the\nvery idea of a void is conceptually vacuous or a vain intelligible.\nThe criticism begins with a logical/physical principle: Anything that\nactually exists within the natural order can be defined in terms of a\ngenus and difference. (The general idea is that the things that make\nup the physical world must be of some kind or species if they exist at\nall, and it is the genus and difference that identify the kind or\nspecies.) He then adds one further qualification: Inasmuch as these\nactual existents positively make up the world around us, their genus\nand difference must refer to positive (as opposed to negative)\nnotions; a species properly understood answers the question\n“what is it?” and a genus or difference given in\nnegative terms simply would not tell us what something is,\nbut what it is not. (For a discussion of Avicenna’s\ntheory of genus and difference and how it relates to his criticism of\nthe void see McGinnis 2007b.)\n\nWith these preliminaries in place, Avicenna’s conceptual\ncritique begins (Avicenna, [Ph], 2.8 [1–4]; also see McGinnis\n2007a, 2007b; and Lammer 2018, §5.3). He first asks whether the\nvoid actually exists or is absolutely nothing. If one says that the\nvoid is absolutely nothing, Avicenna happily agrees; for if it is\nabsolutely nothing, then it does not actually exist. Those who affirm\nthat the void actually exists, then, cannot simply say that it is\nnothing, but must provide some positive features about it. Avicenna\nnext notes that void space is frequently described as being of either\na greater or lesser extent, for the void space between two cities on\nEarth, for example, is less than the void space between the Earth and\nthe heavens. This property of being more or less is none other than\nthat of quantity. Thus if a void should exist, it would possess some\nquantity either essentially or accidentally. If quantity belongs to\nvoid accidentally, and every accident must belong to a substance, then\nvoid is joined to a substance possessing quantity. The quantity in\nquestion is necessarily three-dimensional, but as noted when\ndiscussing continuity, three-dimensionality follows upon the form of\ncorporeality. The form of corporeality, however, causes the existence\nof a body. Thus void would belong to a body as an accidental feature\nof it, a seeming contradiction.\n\nIn contrast, if the quantity is not accidental to the void but is\nessential to it, then void would be a species of quantity. Avicenna\nnow challenges the defenders of void to provide some positive\ndifference that would make up void’s species. It cannot be that\nvoid is a material quantity, since again a material quantity is body.\nIf one claims that void is immaterial quantity, Avicenna demands some\nnon-negative difference, for while there are immaterial substances,\nlike angels, one can provide a positive characterization of them as\nintellectual substances. Avicenna offers a number of\nsuggestions, but finds every attempt wanting or ultimately telling us\nwhat void is not rather than what it is. Since no definition of void\ncan be given in terms of a positive genus and difference, Avicenna\nconcludes that our idea of void is nothing but empty imaginings.\n\nAgain, place had to be either (1) the matter or (2) the form of the\nbody, or either (3) what the body exactly encompasses or (4) what\nexactly encompasses the body (i.e., the surface that is the innermost\nextremity of the containing body). As noted (1) and (2) are\nnon-starters, and as just argued, (3) involves a conceptual confusion.\nConsequently, Avicenna concludes place must be the innermost surface\nof the surrounding body.\n4.2 Time and the Age of the Universe\n\nAmong the conditions associated with motion, time (Gk.\nchronos, Ar. zamān) is at least as important as\nthat of place and void, for it is a necessary concomitant of motion.\n(A number of studies on various aspects of Avicenna’s temporal\ntheory exist and include Shayegan 1986; McGinnis 1999; Mayer 2007; and\nLammer 2018, ch. 6.) In order to appreciate time’s relation to\nmotion, there is a more basic question that must be answered first:\nDoes time exist? An affirmative answer will seem obvious to many, but\nAristotle at Physics, 4.10 had offered a series of\nobjections, four in all, that cast doubt on the reality of time.\nMoreover, in his own positive account of what time is, Aristotle does\nnot address all of the objections or even provide a general proof that\ntime must exist in light of the objections. One may then criticize\nAristotle’s account of time in light of his own theory of\nscience: Aristotle has proceeded to a theory of what time is\nbefore providing us with a proof that time\n is.[11]\n\nAfter presenting the objections to and opinions about time, Avicenna\nbegins his own account of time (Avicenna, [Ph], 2.10–13) by\nfilling this lacuna in Aristotle’s presentation.\nAvicenna’s general strategy is to take as empirically obvious\ncertain facts about motion and then show that these facts cannot be\nexplained unless there is associated with motion a certain magnitude,\nwhich we commonly identify with time. Only having shown that time\nexists does Avicenna then provide a scientifically adequate\nexplanation of what time essentially is.\n\nAvicenna’s\n proof that time exists assumes these initial facts about moving\nbodies:\n\nIf two moving bodies, which have the same speed, start and stop on\nthe same mark (say a blast of a horn), then they traverse the same\ndistance;\nIf two moving bodies, which again have the same speed, both stop\non the same mark, but start on two different marks, the body that\nstarted on the second mark traverses less distance than the body that\nstarted on the first mark;\nIf two moving bodies, which now have different speeds, start and\nstop on the same mark, then the slower moving body traverses less\ndistance than the faster moving body.\n\n\nOn the basis of these facts, Avicenna observes that associated with\nmoving bodies there is a certain possibility or capacity\n(imkān) to traverse some spatial magnitude. Moreover,\nthis capacity corresponds with the starting and stopping of the motion\n(that is, a kinematic magnitude). When the body is moving slower, a\ngreater amount of this possibility is required to cover the same\nspatial magnitude as that of a faster moving body. Given this\npossibility’s relation and correspondence with both spatial and\nkinematic magnitudes, Avicenna concludes that this capacity must be\nsome magnitude that stands in some relation to the distance and speed.\nThis magnitude is neither the magnitude of the body, whether the\nbody’s bulk or weight, nor the magnitude of the motion, whether\nthe speed or motivity, nor the magnitude of the distance traversed.\nInstead, this magnitude—again, the possibility belonging to a\nmoving body to cover more or less distance at a fixed\nspeed—concludes Avicenna, is what we call time\n(zamān).\n\nWhile identifying time with a certain possibility to traverse some\nspatial magnitude, provides one with a criterion for recognizing time,\nit does not provide a proper scientific definition of what time\nessentially is, that is, a definition in terms of genus and\ndifference. Thus, having shown that time exists, Avicenna next turns\nto defining time and showing what time essentially is. In general,\nAvicenna follows Aristotle and defines time as a “number of\nmotion when it is differentiated into prior and posterior parts”\n(cf. Aristotle, Physics 4.1, 219b1–2). Time’s\ngenus, then, is a certain number, that is, some measurable aspect or\nmagnitude, belonging to motion. Its difference is having essentially\nprior and posterior elements. Here is it important to note that for\nAvicenna, priority and posterity (taqaddum and\ntaʾakhkhur) are generic notions, with a number of\ndifferent species, like priority in eminence or location or time. For\nAvicenna, the prior and posterior in Aristotle’s definition\nrefers to what is prior and posterior in the distance traversed as\ndetermined by the directedness of the motion over that distance. Thus,\nthe charges of some, particularly Galen, that Aristotle’s\ndefinition of time is circular, since it appeals to purportedly\ntemporal notions of before and after, is avoided. (See Lammer 2018,\nch. 6.2).\n\nIn all three of Avicenna’s philosophical\nencyclopedias—The Cure, The Salvation and Pointers\nand Reminders—he notes that, more precisely, time is a\nmagnitude of circular motion with respect to the prior and\nposterior. His insistence on circular motion rather than just motion\nin general is that only circular motion can potentially have neither\nbeginning nor end. In other words, only circular motion can be\ninfinitely extended into the past and future.\n\nWhile Avicenna has any number of arguments for the eternity of time\nand the world, his proof for the existence of time in terms of a\npossibility to traverse greater or lesser spatial magnitudes at a\nfixed velocity provides the basis for one of his central physical\narguments for that thesis. The argument, which is a reductio ad\nabsurdum has one assume that God created time, and so motion and\nmoving bodies, at some first moment, x, in the finite past,\nfor example, 10,000 years ago. Prior to x nothing but God\nexisted, not even time. (Here let years be measured in solar rotations\nas measured by the apparent motion of our sun. Also allow that the\npresent moment marks the completion of the 10,000 solar rotations, so\nthat right now is the second terminal point for this motion.) Avicenna\nnext observes that it is certainly possible that God could have made a\ntime, and so motion and moving bodies, 20,000 solar rotations in\nduration, where this possible duration again reaches to the present\nmoment as its second terminal point. In this second scenario, 10,000\nyears of the full 20,000 year duration would exactly correspond with\nthe 10,000 years in the first scenario, namely, the period extending\nfrom the present moment back to x. The remaining duration of\nthis possible 20,000-year motion would correspond with the possibility\nfor 10,000 solar rotations, which now would terminate at x\nrather than beginning at x. (We can intuitively say that this\nremaining possibility is prior to or earlier than x, although\nAvicenna is careful not to beg any questions.) Now to say that there\nis a possibility for 10,000 solar rotations (prior to x) is\njust to say that (prior to x) there exist a possibility for a\nsun (or other body) to traverse a certain distance (that is, number of\nrotations) at a fixed speed. From Avicenna’s earlier proof for\nthe existence of time, however, recall that the possibility for a\nmoving body to traverse a given distance at a fixed speed refers to\ntime. Consequently, since this possibility exists, time must exist.\nYet in order for time to exist, as Avicenna argued, motion and moving\nbodies must exist. Therefore, concludes Avicenna, when nothing but God\nexisted, time, motion and a moving body also would have necessarily\nexisted, a blatant contradiction. It is the assumption that time is\nfinite, claims Avicenna, that gives rise to the contradiction. Since\nthis same argument applies to any finite duration of time, during\nwhich one may suppose the world to exist, Avicenna concludes that\ntime, and so motion and moving bodies, must have existed infinitely\ninto the past. (For the same reason mutatis mutandis time,\nand so motion and moving bodies, also must exist infinitely into the\nfuture.)\n\nWhile I have only scratched the surface of the riches of\nAvicenna’s natural philosophy, the above discussions provide a\nnumber of the most basic points of his thought.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<h4 id=\"Aqui\">Aquinas</h4>\n<ul class=\"hanging\">",
                "<em>De Potentia</em>, in <em>In Quaestiones Disputatae</em>,\nSpiazzi, Pession, Calcaterra, Centi, Bazzi, Odetto (eds.), 2 vols.,\nTurin: Marietti, 1949, vol. 2.\n</ul>\n<h4 id=\"Aris\">Aristotle</h4>\n<dl class=\"hang\">\n<dt>[AP]</dt>\n<dd><em>al-Ṭabīʿa</em>, ʿA. Badawī (ed.), 2\nvolumes, Cairo: The General Egyptian Book Organization, 1964/65; 2nd\nedition, 1984.</dd>\n</dl>\n<h4 id=\"Avic\">Avicenna</h4>\n<dl class=\"hang\">\n<dt>[Int]</dt>\n<dd><em>al-Manṭiq, al-Madkhal</em>, M. al-Khudayrī, F.\nal-Ahwānī, G. Anawatī (eds.), Cairo: General Egyptian\nBook Organization, 1952.</dd>\n<dt>[Dem]</dt>\n<dd><em>Shifāʾ, al-Burhān</em>, A. E. Affifi (ed.),\nCairo: The General Egyptian Book Organization, 1956.</dd>\n<dt>[PR]</dt>\n<dd><em>Kitāb al-Ishārāt wa-l-tanbīhāt\nmaʿa sharḥ Naṣīr al-Dīn\nal-Ṭūsī</em>, S. Dunyā (ed.), 4 volumes, Cairo:\nDār al-Maʿārif, 1957–60; reprints 1985, 1994;\ntranslation of physics section in <em>Ibn Sina’s Remarks and\nAdmonitions: Physics &amp; Metaphysics</em>, S. C. Inati (trans.), New\nYork: Columbia University Press, 2014.</dd>\n<dt>[Cat]</dt>\n<dd><em>Shifāʾ, al-Maqūlāt</em>, I. Madkur (ed.),\nCairo: The General Egyptian Book Organization, 1959.</dd>\n<dt>[DC]</dt>\n<dd><em>Shifāʾ, al-Samāʾ\nwa-l-ʿālam</em>, M. Qāsim (ed.), Cairo: The General\nEgyptian Book Organization, 1969.</dd>\n<dt>[GC]</dt>\n<dd><em>Shifāʾ, Kawn wa-l-fasād</em>, M. Qāsim\n(ed.), Cairo: The General Egyptian Book Organization, 1969.</dd>\n<dt>[AP]</dt>\n<dd><em>Shifāʾ, al-Afʿāl\nwa-l-infiʿālāt</em>, M. Qāsim (ed.), Cairo: The\nGeneral Egyptian Book Organization, 1969.</dd>\n<dt>[Sal]</dt>\n<dd><em>al-Najāt</em>, M. Danishpaẓūh (ed.), Tehran:\nDānishgāh-yi Tihrān, 1985.</dd>\n<dt>[MPh]</dt>\n<dd><em>The Metaphysics of</em> The Healing, M. E. Marmura (ed. and\ntrans.), Provo, UT: Brigham Young University Press, 2005.</dd>\n<dt>[Ph]</dt>\n<dd><em>The Physics of</em> The Healing, J. McGinnis (ed. and trans.),\n2 volumes, Provo, UT: Brigham Young University Press, 2009.</dd>\n</dl>\n<h4 id=\"AlKind\">al-Kindī</h4>\n<dl class=\"hang\">\n<dt>[OPS]</dt>\n<dd><em>Oeuvres philosophiques &amp; scientifiques\nd’al-Kindī: Métaphysique et Cosmologie</em>, R.\nRashed and J. Jolivet (eds.), Leiden: Brill, 1998.</dd>\n<dt>[PWK]</dt>\n<dd><em>The Philosophical Works of al-Kindī</em>, P. Adamson and\nP. E. Pormann (trans.), Oxford: Oxford University Press, 2012.</dd>\n</dl>\n<h4 id=\"Phil\">Philoponus</h4>\n<ul class=\"hanging\">",
                "<em>In Aristotelis Physicorum Libros Quinque Posteriores\nCommentaria</em> (Commentaria in Aristotelem Graeca: Volume 16), H.\nVitelli (ed.), Berlin: George Reimer, 1887.",
                "<em>In Aristotelis Physicorum Libros Tres Priores Commentaria</em>\n(Commentaria in Aristotelem Graeca: Volume 17), H. Vitelli (ed.),\nBerlin: George Reimer, 1888.",
                "–––, Commentary on Aristotle’s\n<em>Physics</em> (Arabic), in Aristotle,\n<em>al-Ṭabīʿa</em>, ʿA. Badawī (ed.), 2\nvolumes, Cairo: The General Egyptian Book Organization, 1964/65\nAristotle, 1964/65.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Ahmed, Asad Q., 2016, “The Reception of Avicenna’s\nTheory of motion in the Twelfth Century,” <em>Arabic Science and\nPhilosophy</em>, 26(2): 215–243.",
                "Buschmann, E., 1979, <em>Untersuchungen zum Problem der Materie\nbei Avicenna</em>, Frankfurt am Main: Peter Lang.",
                "Dadikhuda, Davlat, 2019, “‘Not So Ridiculous’:\nAvicenna on the Existence of Nature (<em>ṭabīʿa</em>)\ncontra Aristotle and the Ashʿarites,” <em>Oxford Studies in\nMedieval Philosophy</em>, 7: 1–43.",
                "Davidson, H., 1992, <em>Alfarabi, Avicenna, and Averroes on\nIntellect: Their Cosmologies, Theories of the Active Intellect, and\nTheories of Human Intellect</em>, New York &amp; Oxford: Oxford\nUniversity Press.",
                "Dhanani, A., 1994, <em>The Physical Theory of Kalam: Atoms, Space,\nand Void in Basrian Mu‘tazili Cosmology</em>, Leiden: E.J.\nBrill.",
                "–––, 2015, “The impact of Ibn\nSīnā’s critique of atomism on subsequent kalām\ndiscussions of atomism,” <em>Arabic Sciences and\nPhilosophy</em>, 25: 79–104.",
                "Hasnawi, A., 1984, “La Dynamique d’Ibn Sina (la notion\nd’‘inclination’: <em>mayl</em>),” in J.\nJolivet et R. Rashed (eds.), <em>Études sur Avicenne</em>,\nParis: Les Belles Lettres, Paris, 103–123.",
                "–––, 2001, “La définition du\nmouvement dans la Physique du Šifāʾ\nd’Avicenne,” <em>Arabic Sciences and Philosophy</em>, 11:\n219–255.",
                "–––, 2002, “La <em>Physique du\nŠifāʾ</em>: aperçus sur sa structure et son\ncontenu,” in J. Janssens and D. De Smet (eds.), <em>Avicenna and\nhis Heritage</em>, Leuven: Leuven University Press, 67–80.",
                "–––, 2004, “Le status catégorical\ndu mouvement chez Avicenna: context grec et posterité\nmédiévale latine,” in R. Morelon et A. Hasnawi\n(eds.) <em>De Zénon d’Elée à\nPoincaré: Receuil d’études en homage à\nRoshdi Rashed</em>, Leuven: Peeters, 607–622.",
                "Hasse, Dag Nikolaus &amp; Bertolacci, Amos (eds.), 2018, <em>The\nArabic, Hebrew and Latin Reception of Avicenna’s Physics and\nCosmology</em> (Scientia graeco-arabica 23), Berlin: De Gruyter.",
                "Hyman, A., 1965, “Aristotle’s ‘first\nmatter’ and Avicenna’s and Averroes’\n‘corporeal form’,” in S. Lieberman et al. (eds.)\n<em>Harry Austryn Wolfson Jubilee Volume</em>, Jerusalem: American\nAcademy for Jewish Research, 384–406; reprint in A. Hyman (ed.),\n<em>Essays in Medieval Jewish and Islamic Philosophy</em>, New York:\nKtav, 1977, 335–356.",
                "Janssens, J., 2006, “The Notion of <em>Wāhib\nal-ṣuwar</em> (Giver of Forms) and <em>Wāhib\nal-ʿaql</em> (Giver of Intelligence) In Ibn Sina,” in M.\nCândida Pacheco and J. Francisco Meirinhos (eds.) <em>Intellect\net imagination dans la philosophie médiévale</em>,\nTurnhout: Brepols, 551–562.",
                "–––, 2010, “The Reception of Ibn\nSīnā’s Physics in later Islamic Thought,”\n<em>Ilahiyat Studies</em>, 1: 15–36.",
                "Lammer, A., 2015, “Defining Nature: From Aristotle to\nPhiloponus to Avicenna,” in A. Alwishah and J. Hayes (eds.)\n<em>Aristotle and the Arabic Tradition</em>, Cambridge: Cambridge\nUniversity Press, 121–142.",
                "–––, 2018, <em>The Elements of Avicenna’s\nPhysics: Greek Sources and Arabic Innovations</em> (Scientia\nGraeco-Arabica 20), Berlin: De Gruyter.",
                "Lang, H., 1992, <em>Aristotle’s</em> Physics <em>and Its\nMedieval Varieties</em>, Albany, NY: State University of New\nYork.",
                "Langermann, T., 2009, “<em>Quies media</em>: A Lively\nProblem on the Agenda of Post-Avicennian Physics,” in N. Bayhan,\nM. Mazak &amp; A. Süleyman (eds.) <em>Uluslararasi Ibn\nSînâ Sempozyumu Bildiriler 22–24 May 2008, Istabul.\nInernational Ibn Sina Symposium Papers</em>, 2 volumes, Istanbul:\nKültür A.Ş, vol. II, 53–68.",
                "–––, 2012, “Naṣīr al-Dīn\nal-Ṭūsī’s Exposition of <em>mayl</em>,” in\nR. Hansberger, M. Afifi al-Akiti and C. Burnett (eds.), <em>Medieval\nArabic Thought: Essays in Honour of Fritz Zimmermann</em>,\nLondon/Turin: Warburg Institute/Nino Aragno Editore, 87–97.",
                "Lettinck, P., 1988, “Ibn Sīnā on Atomism:\nTranslation of Ibn Sīnā’s <em>Kitāb\nal-Shifāʾ, al-Ṭabīʿiyyāt 1:\nal-Samāʿ al-ṭabīʿī</em> Third Treatise,\nChapters 3–5,” <em>Al-Shajarrah</em>, 4(1):\n1–51.",
                "Macierowski E. M. &amp; Hassing R. F., 1988, “John\nPhiloponus on Aristotle’s Definition of Nature,”\n<em>Ancient Philosophy</em>, 8(1): 73–100.",
                "Marmura, M. E., 1960, “Avicenna and the Problem of Infinite\nNumber of Souls,” <em>Mediaeval Studies</em>, 22: 232–239;\nreprint in M. E. Marmura, <em>Probing in Islamic Philosophy: Studies\nin the Philosophies of Ibn Sīnā, al-Ghazālī and\nother Major Muslim Thinkers</em>, Binghamton, NY: Global Academic\nPublishing, 2005.",
                "–––, 1980, “Avicenna’s Division of\nthe Sciences in the <em>Isagoge</em> of his\n<em>Shifāʾ</em>,” <em>Journal of the History of Arabic\nScience</em>, 4: 239–251; reprinted in M. E. Marmura,\n<em>Probing in Islamic Philosophy: Studies in the Philosophies of Ibn\nSīnā, al-Ghazālī and other Major Muslim\nThinkers</em>, Binghamton, NY: Global Academic Publishing, 2005.",
                "Mayer, T., 2007, “Avicenna against Time Beginning: The\nDebate between the Commentators on the\n<em>Ishārāt</em>,” in P. Adamson (ed.), <em>Classical\nArabic Philosophy: Sources and Reception</em>, London – Turin:\nThe Warburg Institute – Nino Aragno Editore, 125–149.",
                "McGinnis, J., 1999, “Ibn Sīnā on the Now,”\n<em>American Catholic Philosophical Quarterly</em>, 73(1):\n73–106.",
                "–––, 2006a, “A medieval Arabic analysis of\nmotion at an instant: the Avicennan sources to the <em>forma\nfluens/fluxus formae</em> debate,” <em>British Journal for the\nHistory of Science</em>, 39(2): 189–205.",
                "–––, 2006b, “Positioning Heaven: The\nInfidelity of a Faithful Aristotelian,” <em>Phronesis</em>,\n51(2): 140–161.",
                "–––, 2007a, “Avoiding the Void: Avicenna\non the Impossibility of Circular Motion in a Void,” in P.\nAdamson (ed.), <em>Classical Arabic Philosophy: Sources and\nReception</em>, London – Turin: The Warburg Institute –\nNino Aragno Editore, 74–89.",
                "–––, 2007b, “Logic and Science: The Role\nof Genus and Difference in Avicenna’s Logic, Science and Natural\nPhilosophy,” <em>Documenti e Studi sulla Tradizione Filosofica\nMedievale</em>, 18: 165–187.",
                "–––, 2010, “Avicennan Infinity: A Select\nHistory of the Infinite through Avicenna,” <em>Documenti e Studi\nsulla Tradizione Filosofica Medievale</em>, 21: 199–222.",
                "–––, 2012, “Making Something of Nothing:\nPrivation, Possibility and Potentiality in Avicenna and\nAquinas,” <em>The Thomist</em>, 76(4): 551–575.",
                "–––, 2015, “A Small Discovery:\nAvicenna’s Theory of <em>Minima Naturalia</em>,”\n<em>Journal of the History of Philosophy</em>, 53(1): 1–24.",
                "–––, 2018, “Mind the Gap: The Reception of\nAvicenna’s New Argument against Actually Infinite Space,”\nin Ali Gheissari, John Walbridge, Ahmed Alwishah (eds.), <em>Writing\nin Light: Illuminationist Texts and Textual Studies in Honor of the\nLate Hossein Ziai</em>, Leiden: Brill, 272–305.",
                "Rashed, Roshdi, 1999, “Al-Qūhī vs. Aristotle: On\nMotion,” <em>Arabic Sciences and Philosophy</em>, 9(1):\n3–24.",
                "Richardson, K., 2012, “Avicenna and Aquinas on Form and\nGeneration,” in D. Hasse and A. Bertolacci (eds.) <em>The\nArabic, Hebrew and Latin Reception of Avicenna’s\nMetaphysics</em>, Berlin &amp; Boston: De Gruyter, 251–274.",
                "Sabra, Abdelhamid I., 2006, “<em>Kalām</em> Atomism as\nan Alternative Philosophy to Hellenizing <em>Falsafa</em>”, in\nJames E. Montgomery (ed.), <em>Arabic Theology, Arabic Philosophy,\nFrom the Many to the One: Essays in Celebration of Richard M.\nFrank</em>, Orientalia Lovaniensia Analecta, 152, Leuven/Paris/Dudley,\nMA: Peeters Publishers &amp; Department of Oriental Studies,\n199–272.",
                "Shayegan, Y., 1986, <em>Avicenna on Time</em>, Ph.D.\nDissertation, Harvard University.",
                "Shihadeh, A., 2014, “Avicenna’s Corporeal Form and\nProof of Prime Matter in Twelfth-Century Critical Philosophy: Abū\nl-Barakāt, al-Masʿūdī and\nal-Rāzī,” <em>Oriens</em>, 42(3–4):\n364–396.",
                "Stone, A.D., 2001, “Simplicius and Avicenna on the essential\ncorporeity of material substance,” in Robert Wisnovsky (ed.),\n<em>Aspects of Avicenna</em>, Princeton, N.J.: Princeton University\nPress, 73–130.",
                "–––, 2008, “Avicenna’s Theory of\nPrimary Mixture,” <em>Arabic Sciences and Philosophy</em>,\n18(1): 99–119.",
                "Wolfson, H. A., 1976, <em>The Philosophy of Kalam</em>, Cambridge:\nHarvard University Press.",
                "Zarepour, M. S., 2020, “Avicenna on Mathematical\nInfinity,” <em>Archiv für Geschichte der Philosophie</em>,\n102(3);\n <a href=\"https://www.degruyter.com/view/journals/agph/ahead-of-print/article-10.1515-agph-2017-0032/article-10.1515-agph-2017-0032.xml?language=en\" target=\"other\">Zarepour 2020 available online</a>.\n doi:10.1515/agph-2017-0032.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<h4 id=\"Aqui\">Aquinas</h4>\n<ul class=\"hanging\">\n<li><em>De Potentia</em>, in <em>In Quaestiones Disputatae</em>,\nSpiazzi, Pession, Calcaterra, Centi, Bazzi, Odetto (eds.), 2 vols.,\nTurin: Marietti, 1949, vol. 2.</li>\n</ul>\n<h4 id=\"Aris\">Aristotle</h4>\n<dl class=\"hang\">\n<dt>[AP]</dt>\n<dd><em>al-Ṭabīʿa</em>, ʿA. Badawī (ed.), 2\nvolumes, Cairo: The General Egyptian Book Organization, 1964/65; 2nd\nedition, 1984.</dd>\n</dl>\n<h4 id=\"Avic\">Avicenna</h4>\n<dl class=\"hang\">\n<dt>[Int]</dt>\n<dd><em>al-Manṭiq, al-Madkhal</em>, M. al-Khudayrī, F.\nal-Ahwānī, G. Anawatī (eds.), Cairo: General Egyptian\nBook Organization, 1952.</dd>\n<dt>[Dem]</dt>\n<dd><em>Shifāʾ, al-Burhān</em>, A. E. Affifi (ed.),\nCairo: The General Egyptian Book Organization, 1956.</dd>\n<dt>[PR]</dt>\n<dd><em>Kitāb al-Ishārāt wa-l-tanbīhāt\nmaʿa sharḥ Naṣīr al-Dīn\nal-Ṭūsī</em>, S. Dunyā (ed.), 4 volumes, Cairo:\nDār al-Maʿārif, 1957–60; reprints 1985, 1994;\ntranslation of physics section in <em>Ibn Sina’s Remarks and\nAdmonitions: Physics &amp; Metaphysics</em>, S. C. Inati (trans.), New\nYork: Columbia University Press, 2014.</dd>\n<dt>[Cat]</dt>\n<dd><em>Shifāʾ, al-Maqūlāt</em>, I. Madkur (ed.),\nCairo: The General Egyptian Book Organization, 1959.</dd>\n<dt>[DC]</dt>\n<dd><em>Shifāʾ, al-Samāʾ\nwa-l-ʿālam</em>, M. Qāsim (ed.), Cairo: The General\nEgyptian Book Organization, 1969.</dd>\n<dt>[GC]</dt>\n<dd><em>Shifāʾ, Kawn wa-l-fasād</em>, M. Qāsim\n(ed.), Cairo: The General Egyptian Book Organization, 1969.</dd>\n<dt>[AP]</dt>\n<dd><em>Shifāʾ, al-Afʿāl\nwa-l-infiʿālāt</em>, M. Qāsim (ed.), Cairo: The\nGeneral Egyptian Book Organization, 1969.</dd>\n<dt>[Sal]</dt>\n<dd><em>al-Najāt</em>, M. Danishpaẓūh (ed.), Tehran:\nDānishgāh-yi Tihrān, 1985.</dd>\n<dt>[MPh]</dt>\n<dd><em>The Metaphysics of</em> The Healing, M. E. Marmura (ed. and\ntrans.), Provo, UT: Brigham Young University Press, 2005.</dd>\n<dt>[Ph]</dt>\n<dd><em>The Physics of</em> The Healing, J. McGinnis (ed. and trans.),\n2 volumes, Provo, UT: Brigham Young University Press, 2009.</dd>\n</dl>\n<h4 id=\"AlKind\">al-Kindī</h4>\n<dl class=\"hang\">\n<dt>[OPS]</dt>\n<dd><em>Oeuvres philosophiques &amp; scientifiques\nd’al-Kindī: Métaphysique et Cosmologie</em>, R.\nRashed and J. Jolivet (eds.), Leiden: Brill, 1998.</dd>\n<dt>[PWK]</dt>\n<dd><em>The Philosophical Works of al-Kindī</em>, P. Adamson and\nP. E. Pormann (trans.), Oxford: Oxford University Press, 2012.</dd>\n</dl>\n<h4 id=\"Phil\">Philoponus</h4>\n<ul class=\"hanging\">\n<li><em>In Aristotelis Physicorum Libros Quinque Posteriores\nCommentaria</em> (Commentaria in Aristotelem Graeca: Volume 16), H.\nVitelli (ed.), Berlin: George Reimer, 1887.</li>\n<li><em>In Aristotelis Physicorum Libros Tres Priores Commentaria</em>\n(Commentaria in Aristotelem Graeca: Volume 17), H. Vitelli (ed.),\nBerlin: George Reimer, 1888.</li>\n<li>–––, Commentary on Aristotle’s\n<em>Physics</em> (Arabic), in Aristotle,\n<em>al-Ṭabīʿa</em>, ʿA. Badawī (ed.), 2\nvolumes, Cairo: The General Egyptian Book Organization, 1964/65\nAristotle, 1964/65.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Ahmed, Asad Q., 2016, “The Reception of Avicenna’s\nTheory of motion in the Twelfth Century,” <em>Arabic Science and\nPhilosophy</em>, 26(2): 215–243.</li>\n<li>Buschmann, E., 1979, <em>Untersuchungen zum Problem der Materie\nbei Avicenna</em>, Frankfurt am Main: Peter Lang.</li>\n<li>Dadikhuda, Davlat, 2019, “‘Not So Ridiculous’:\nAvicenna on the Existence of Nature (<em>ṭabīʿa</em>)\ncontra Aristotle and the Ashʿarites,” <em>Oxford Studies in\nMedieval Philosophy</em>, 7: 1–43.</li>\n<li>Davidson, H., 1992, <em>Alfarabi, Avicenna, and Averroes on\nIntellect: Their Cosmologies, Theories of the Active Intellect, and\nTheories of Human Intellect</em>, New York &amp; Oxford: Oxford\nUniversity Press.</li>\n<li>Dhanani, A., 1994, <em>The Physical Theory of Kalam: Atoms, Space,\nand Void in Basrian Mu‘tazili Cosmology</em>, Leiden: E.J.\nBrill.</li>\n<li>–––, 2015, “The impact of Ibn\nSīnā’s critique of atomism on subsequent kalām\ndiscussions of atomism,” <em>Arabic Sciences and\nPhilosophy</em>, 25: 79–104.</li>\n<li>Hasnawi, A., 1984, “La Dynamique d’Ibn Sina (la notion\nd’‘inclination’: <em>mayl</em>),” in J.\nJolivet et R. Rashed (eds.), <em>Études sur Avicenne</em>,\nParis: Les Belles Lettres, Paris, 103–123.</li>\n<li>–––, 2001, “La définition du\nmouvement dans la Physique du Šifāʾ\nd’Avicenne,” <em>Arabic Sciences and Philosophy</em>, 11:\n219–255.</li>\n<li>–––, 2002, “La <em>Physique du\nŠifāʾ</em>: aperçus sur sa structure et son\ncontenu,” in J. Janssens and D. De Smet (eds.), <em>Avicenna and\nhis Heritage</em>, Leuven: Leuven University Press, 67–80.</li>\n<li>–––, 2004, “Le status catégorical\ndu mouvement chez Avicenna: context grec et posterité\nmédiévale latine,” in R. Morelon et A. Hasnawi\n(eds.) <em>De Zénon d’Elée à\nPoincaré: Receuil d’études en homage à\nRoshdi Rashed</em>, Leuven: Peeters, 607–622.</li>\n<li>Hasse, Dag Nikolaus &amp; Bertolacci, Amos (eds.), 2018, <em>The\nArabic, Hebrew and Latin Reception of Avicenna’s Physics and\nCosmology</em> (Scientia graeco-arabica 23), Berlin: De Gruyter.</li>\n<li>Hyman, A., 1965, “Aristotle’s ‘first\nmatter’ and Avicenna’s and Averroes’\n‘corporeal form’,” in S. Lieberman et al. (eds.)\n<em>Harry Austryn Wolfson Jubilee Volume</em>, Jerusalem: American\nAcademy for Jewish Research, 384–406; reprint in A. Hyman (ed.),\n<em>Essays in Medieval Jewish and Islamic Philosophy</em>, New York:\nKtav, 1977, 335–356.</li>\n<li>Janssens, J., 2006, “The Notion of <em>Wāhib\nal-ṣuwar</em> (Giver of Forms) and <em>Wāhib\nal-ʿaql</em> (Giver of Intelligence) In Ibn Sina,” in M.\nCândida Pacheco and J. Francisco Meirinhos (eds.) <em>Intellect\net imagination dans la philosophie médiévale</em>,\nTurnhout: Brepols, 551–562.</li>\n<li>–––, 2010, “The Reception of Ibn\nSīnā’s Physics in later Islamic Thought,”\n<em>Ilahiyat Studies</em>, 1: 15–36.</li>\n<li>Lammer, A., 2015, “Defining Nature: From Aristotle to\nPhiloponus to Avicenna,” in A. Alwishah and J. Hayes (eds.)\n<em>Aristotle and the Arabic Tradition</em>, Cambridge: Cambridge\nUniversity Press, 121–142.</li>\n<li>–––, 2018, <em>The Elements of Avicenna’s\nPhysics: Greek Sources and Arabic Innovations</em> (Scientia\nGraeco-Arabica 20), Berlin: De Gruyter.</li>\n<li>Lang, H., 1992, <em>Aristotle’s</em> Physics <em>and Its\nMedieval Varieties</em>, Albany, NY: State University of New\nYork.</li>\n<li>Langermann, T., 2009, “<em>Quies media</em>: A Lively\nProblem on the Agenda of Post-Avicennian Physics,” in N. Bayhan,\nM. Mazak &amp; A. Süleyman (eds.) <em>Uluslararasi Ibn\nSînâ Sempozyumu Bildiriler 22–24 May 2008, Istabul.\nInernational Ibn Sina Symposium Papers</em>, 2 volumes, Istanbul:\nKültür A.Ş, vol. II, 53–68.</li>\n<li>–––, 2012, “Naṣīr al-Dīn\nal-Ṭūsī’s Exposition of <em>mayl</em>,” in\nR. Hansberger, M. Afifi al-Akiti and C. Burnett (eds.), <em>Medieval\nArabic Thought: Essays in Honour of Fritz Zimmermann</em>,\nLondon/Turin: Warburg Institute/Nino Aragno Editore, 87–97.</li>\n<li>Lettinck, P., 1988, “Ibn Sīnā on Atomism:\nTranslation of Ibn Sīnā’s <em>Kitāb\nal-Shifāʾ, al-Ṭabīʿiyyāt 1:\nal-Samāʿ al-ṭabīʿī</em> Third Treatise,\nChapters 3–5,” <em>Al-Shajarrah</em>, 4(1):\n1–51.</li>\n<li>Macierowski E. M. &amp; Hassing R. F., 1988, “John\nPhiloponus on Aristotle’s Definition of Nature,”\n<em>Ancient Philosophy</em>, 8(1): 73–100.</li>\n<li>Marmura, M. E., 1960, “Avicenna and the Problem of Infinite\nNumber of Souls,” <em>Mediaeval Studies</em>, 22: 232–239;\nreprint in M. E. Marmura, <em>Probing in Islamic Philosophy: Studies\nin the Philosophies of Ibn Sīnā, al-Ghazālī and\nother Major Muslim Thinkers</em>, Binghamton, NY: Global Academic\nPublishing, 2005.</li>\n<li>–––, 1980, “Avicenna’s Division of\nthe Sciences in the <em>Isagoge</em> of his\n<em>Shifāʾ</em>,” <em>Journal of the History of Arabic\nScience</em>, 4: 239–251; reprinted in M. E. Marmura,\n<em>Probing in Islamic Philosophy: Studies in the Philosophies of Ibn\nSīnā, al-Ghazālī and other Major Muslim\nThinkers</em>, Binghamton, NY: Global Academic Publishing, 2005.</li>\n<li>Mayer, T., 2007, “Avicenna against Time Beginning: The\nDebate between the Commentators on the\n<em>Ishārāt</em>,” in P. Adamson (ed.), <em>Classical\nArabic Philosophy: Sources and Reception</em>, London – Turin:\nThe Warburg Institute – Nino Aragno Editore, 125–149.</li>\n<li>McGinnis, J., 1999, “Ibn Sīnā on the Now,”\n<em>American Catholic Philosophical Quarterly</em>, 73(1):\n73–106.</li>\n<li>–––, 2006a, “A medieval Arabic analysis of\nmotion at an instant: the Avicennan sources to the <em>forma\nfluens/fluxus formae</em> debate,” <em>British Journal for the\nHistory of Science</em>, 39(2): 189–205.</li>\n<li>–––, 2006b, “Positioning Heaven: The\nInfidelity of a Faithful Aristotelian,” <em>Phronesis</em>,\n51(2): 140–161.</li>\n<li>–––, 2007a, “Avoiding the Void: Avicenna\non the Impossibility of Circular Motion in a Void,” in P.\nAdamson (ed.), <em>Classical Arabic Philosophy: Sources and\nReception</em>, London – Turin: The Warburg Institute –\nNino Aragno Editore, 74–89.</li>\n<li>–––, 2007b, “Logic and Science: The Role\nof Genus and Difference in Avicenna’s Logic, Science and Natural\nPhilosophy,” <em>Documenti e Studi sulla Tradizione Filosofica\nMedievale</em>, 18: 165–187.</li>\n<li>–––, 2010, “Avicennan Infinity: A Select\nHistory of the Infinite through Avicenna,” <em>Documenti e Studi\nsulla Tradizione Filosofica Medievale</em>, 21: 199–222.</li>\n<li>–––, 2012, “Making Something of Nothing:\nPrivation, Possibility and Potentiality in Avicenna and\nAquinas,” <em>The Thomist</em>, 76(4): 551–575.</li>\n<li>–––, 2015, “A Small Discovery:\nAvicenna’s Theory of <em>Minima Naturalia</em>,”\n<em>Journal of the History of Philosophy</em>, 53(1): 1–24.</li>\n<li>–––, 2018, “Mind the Gap: The Reception of\nAvicenna’s New Argument against Actually Infinite Space,”\nin Ali Gheissari, John Walbridge, Ahmed Alwishah (eds.), <em>Writing\nin Light: Illuminationist Texts and Textual Studies in Honor of the\nLate Hossein Ziai</em>, Leiden: Brill, 272–305.</li>\n<li>Rashed, Roshdi, 1999, “Al-Qūhī vs. Aristotle: On\nMotion,” <em>Arabic Sciences and Philosophy</em>, 9(1):\n3–24.</li>\n<li>Richardson, K., 2012, “Avicenna and Aquinas on Form and\nGeneration,” in D. Hasse and A. Bertolacci (eds.) <em>The\nArabic, Hebrew and Latin Reception of Avicenna’s\nMetaphysics</em>, Berlin &amp; Boston: De Gruyter, 251–274.</li>\n<li>Sabra, Abdelhamid I., 2006, “<em>Kalām</em> Atomism as\nan Alternative Philosophy to Hellenizing <em>Falsafa</em>”, in\nJames E. Montgomery (ed.), <em>Arabic Theology, Arabic Philosophy,\nFrom the Many to the One: Essays in Celebration of Richard M.\nFrank</em>, Orientalia Lovaniensia Analecta, 152, Leuven/Paris/Dudley,\nMA: Peeters Publishers &amp; Department of Oriental Studies,\n199–272.</li>\n<li>Shayegan, Y., 1986, <em>Avicenna on Time</em>, Ph.D.\nDissertation, Harvard University.</li>\n<li>Shihadeh, A., 2014, “Avicenna’s Corporeal Form and\nProof of Prime Matter in Twelfth-Century Critical Philosophy: Abū\nl-Barakāt, al-Masʿūdī and\nal-Rāzī,” <em>Oriens</em>, 42(3–4):\n364–396.</li>\n<li>Stone, A.D., 2001, “Simplicius and Avicenna on the essential\ncorporeity of material substance,” in Robert Wisnovsky (ed.),\n<em>Aspects of Avicenna</em>, Princeton, N.J.: Princeton University\nPress, 73–130.</li>\n<li>–––, 2008, “Avicenna’s Theory of\nPrimary Mixture,” <em>Arabic Sciences and Philosophy</em>,\n18(1): 99–119.</li>\n<li>Wolfson, H. A., 1976, <em>The Philosophy of Kalam</em>, Cambridge:\nHarvard University Press.</li>\n<li>Zarepour, M. S., 2020, “Avicenna on Mathematical\nInfinity,” <em>Archiv für Geschichte der Philosophie</em>,\n102(3);\n <a href=\"https://www.degruyter.com/view/journals/agph/ahead-of-print/article-10.1515-agph-2017-0032/article-10.1515-agph-2017-0032.xml?language=en\" target=\"other\">Zarepour 2020 available online</a>.\n doi:10.1515/agph-2017-0032.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Ghazali",
            "Alexander of Aphrodisias",
            "Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science",
            "Aristotle, Special Topics: natural philosophy",
            "Democritus",
            "Epicurus",
            "Ibn Sina [Avicenna]",
            "Ibn Sina [Avicenna]: metaphysics",
            "Philoponus"
        ],
        "entry_link": [
            {
                "../al-ghazali/": "al-Ghazali"
            },
            {
                "../alexander-aphrodisias/": "Alexander of Aphrodisias"
            },
            {
                "../arabic-islamic-natural/": "Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science"
            },
            {
                "../aristotle-natphil/": "Aristotle, Special Topics: natural philosophy"
            },
            {
                "../democritus/": "Democritus"
            },
            {
                "../epicurus/": "Epicurus"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            },
            {
                "../ibn-sina-metaphysics/": "Ibn Sina [Avicenna]: metaphysics"
            },
            {
                "../philoponus/": "Philoponus"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-sina-natural\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ibn-sina-natural/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ibn-sina-natural&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/ibn-sina-natural/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-sina-natural": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ibn-sina-natural/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ibn-sina-natural&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/ibn-sina-natural/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}