{
    "url": "ibn-rushd-natural",
    "title": "Ibn Rushd’s Natural Philosophy",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Josep Puig Montada\n<puigmont@ucm.es>",
        "author_links": [
            {
                "http://www.ucm.es/directorio?id=3237": "Josep Puig Montada"
            },
            {
                "mailto:puigmont%40ucm%2ees": "puigmont@ucm.es"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://www.ucm.es/directorio?id=3237\" target=\"other\">Josep Puig Montada</a>\n&lt;<a href=\"mailto:puigmont%40ucm%2ees\"><em>puigmont<abbr title=\" at \">@</abbr>ucm<abbr title=\" dot \">.</abbr>es</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 17, 2018",
        "substantive revision Tue Jan 24, 2023"
    ],
    "preamble": "\n\nPhilosophy has been divided into theoretical and practical since the\ntime of Aristotle’s distinction of the sciences, and within\ntheoretical philosophy, the enquire on nature was of major import in\nAncient and Medieval times. Most of its contents later developed into\nmodern natural science as the seeds of physics or chemistry, but its\nfounding concepts are still worth reflecting upon. Concepts such as\nthose of body and extension, motion and change, time and place,\nfiniteness and infiniteness, and of nature itself have kept their\nphilosophical gist.\n\nThe Iranian philosopher Ibn Sina [Avicenna] (d. 1037 CE) organized his\nphilosophical encyclopedia “The Healing” in four sections:\nLogic, mathematical, and natural sciences, and sciences of the Divine;\nthe doctrine on the human soul was part of the natural sciences. The\nAndalusian Ibn Rushd [Averroes] (d. 1198 CE) was a faithful disciple\nof Aristotle and he stuck to the organization of the Aristotelian\ncorpus implemented by Andronicus of Rhodes (fl. 1st century BCE), a\nscholar of the Peripatetic school who gave the science of the soul a\nplace of its own, as would Averroes. On the Soul belongs to\nthe physical works, but it is devoted to living natural beings with\nconsiderable focus on humans and their capacities for sensation and\nthought, and Andronicus placed it after the first four physical\ntreatises and before metaphysics. The mentioned treatises are the\nPhysics, On the Heavens, On Generation and\nCorruption, and the Meteorology.\n\nWe may say that the Physics, which is the first and the\nlongest treatise on natural philosophy (184a–267b in\nBekker’s numbering) contains a number of Aristotelian books that\ndeal with key issues of this science, but Averroes was not aware of\nthis fact that modern research has brought to light. His work was\nbased on the belief in the unity of the treatise, so that he always\nstrove for a coherent, unified reading and interpretation of\nAristotle.\n\nAverroes composed Long, Middle, and Short commentaries on\nAristotle’s Physics and some essays,\nmasā’il, quaestiones, on physical\nmatters. The Middle and Short commentaries were revised by Averroes\nhimself, and the Long Commentary shows traces of revision, but in\ngeneral, the Long Commentary represents the last stage of his thought.\nThe Middle Commentaries were favored by later Jewish philosophers,\nbut, as S. Harvey has shown, the Long Commentary on the\nPhysics was soon translated into Hebrew and also drew their\ninterest (Harvey 1985). The Long Commentary was the most influential\nof the three in the Latin West and a recent collective publication\nhighlights its influence in the field of natural philosophy (Bakker\n2015). For this reason the research for this article will rely mainly\non the Long Commentary, but additionally on his Middle Commentary on\nComing-to-be and Passing-away (De generatione et\ncorruptione). The Physics focuses on one kind of change,\nnamely, local motion, while the latter deals with three othe kinds:\nchanges in substance, quality and quantity. Occasional references to\nthe other commentaries, or to other works, will be made.\n",
    "toc": [
        {
            "#PlacDiviNatuPhil": "1. Place and Division of Natural Philosophy"
        },
        {
            "#FourCausThrePrin": "2. Four Causes and Three Principles"
        },
        {
            "#NatuHumaForm": "3. Nature and Human Form"
        },
        {
            "#NatuAgaiFort": "4. Nature against Fortune"
        },
        {
            "#AbsoCondNeceNatu": "5. Absolute or Conditional Necessity in Nature"
        },
        {
            "#ChanMoti": "6. Change or Motion"
        },
        {
            "#Infi": "7. Infiniteness"
        },
        {
            "#Plac": "8. Place"
        },
        {
            "#VoidMotiVoid": "9. Void, Motion in the Void"
        },
        {
            "#Time": "10. Time"
        },
        {
            "#NCon": "11. Continuum"
        },
        {
            "#ChanSubs": "12. Change in Substance"
        },
        {
            "#SubsChanComi": "13. Substantial change as coming-to-be"
        },
        {
            "#AlteGrowNutr": "14. Alteration, Growth, Nutrition"
        },
        {
            "#MovaMove": "15. Movable and Mover"
        },
        {
            "#QuwaForc": "16. Qûwa as Force"
        },
        {
            "#FirsMovaFirsMoveEterMoti": "17. First Movable, First Mover, Eternal Motion"
        },
        {
            "#IncoFirsMove": "18. The Incorporeal First Mover"
        },
        {
            "#FinaRema": "Final Remarks"
        },
        {
            "#Abbr": "Abbreviations"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Place and Division of Natural Philosophy\n\nNatural philosophy, according to Averroes (following Aristotle),\nembraces the study of all sensible beings that undergo change and\npossess the principle of motion and rest in themselves (LC 1G\nProemium). The philosophy of natural beings divides into various\nbranches, for instance, psychology or astronomy. Physics is the first\nand most important branch and since it is scientific knowledge physics\nhas to inquire about causes, and its distinctive causes are “the\ncauses common to all natural entities” (LC 1G). Averroes follows\nAristotle and distinguishes four causes—matter, form, purpose\nand agent—in all natural beings. Physics extends the inquiry on\nmatter and agent to their outmost limits, that is, Prime Matter and\nthe First Mover. Another part of philosophy deals with primary form\nand first purpose, and this is metaphysics. Averroes adds other\naspects to the subject matter of physics, he calls them\n“accessories”, “necessary concomitants”\n(lawāḥiq, consequentes) or properties\ncommon to all natural beings, namely place, time and the like (LC 1GH;\nMC 434AE).\n\nHowever, an important distinction between Aristotle and Averroes is\nfound in the latter’s approach to the value of natural\nphilosophy. Averroes follows the arrangement that Andronicus made of\nAristotle’s writings and, therefore, after the propaedeutic\nstudy of logic, the study of philosophy begins with the physics in the\nproper sense of the term. In addition, he remarks that physics belongs\nto the theoretical dimension of philosophy and that philosophy has a\npractical dimension too, namely ethics. The practical sciences have\ntaught that “the perfect acquisition of the theoretical sciences\nbrings man to his ultimate perfection and entire essence” (LC\n 1H)[1].\n It is the only way man can attain true happiness.\n\nThe natural order requires man to cultivate the ethical virtues,\njustice, temperance, courage, etc., after he really possesses the\nspeculative virtues. Averroes adduces Alexander of Aphrodisias’s\npreface to his commentary of the Physics to support his\nstatement. Alexander’s commentary is lost and, although Marwan\nRashed has published the extant scholia of it, they are limited to\nexplaining Books IV–VIII (Rashed 2011) and no hint concerning\nthe content of the preface is given. Our only source is therefore\nAverroes’ account:\n\nAlexander explained there the reason why the natural order requires\nman to be morally virtuous in order that he becomes intellectually\nperfect. Once the sage is aware of the infinity of time and his\nindividual finiteness, he has no fear, and moreover, once he knows\nthat death afflicts him because of his bodily component, “ex\nnecessitate materiae” (LC 2A) and that he is not going to\nbe deprived of the intellectual perfection he has acquired, he has no\nfear of death, and some sages, like Socrates, have even preferred\ndeath to life because his country did not allow him to go the way of\nperfection.\n\n\nThe sage wants to be morally virtuous because he knows that both\nvirtues, moral and theoretical, are inseparable. He knows the nature\nof justice existing in the substance of [created] beings and he\naspires “to be similar to this nature and to acquire its\nform”. (LC 2C; cf. Harvey 1985: 66: 21–23)\n\n\nSimilar views are expressed in Averroes’ Short Commentary:\nNatural philosophy has a twofold dimension: it is knowledge of the\nmaterial world and a speculative science but it is also essential in\ncontributing to the happiness of those who possess this knowledge. (SC\nVariant reading to 7:8–8:12), although he later replaced the\ntext with another of technical character.\n2. Four Causes and Three Principles\n\nAristotle stated the four causes—form, agent, purpose, and\nmatter—but he also added three principles, form, matter and\nprivation in Phys. I.7–9. In 190a13–21 Aristotle\nstressed that in all cases of coming-to-be there must be something\nthat underlies change, Averroes extensively comments on the need for a\nsubstrate and observes:\n\n\nAristotle and all the Ancients agree that nothing comes to be out of\nnothing, and I have seen some colleagues (socii) doubting on\nthis question, but I entered into this in the treatise On the\nSubstance of the Universe to some extent (LC 36E TC60).\n\n\nThe treatise On the Substance of the Universe is not extant\nin Arabic, but the Latin and the Hebrew translations are, as A. Hyman\nexplains (Hyman 1986, 13–15). Averroes reminds that\n“modern thinkers”, i.e., Muslim theologians, have been\ninsisting that coming-to-be does take place out of nothing because of\nthe ‘custom’ of saying it again and again, and bad\n‘custom’ has destructive effects. These theologians\ncontend that one who first learns philosophy is then not capable of\nlearning the religious law and that the other sciences are hidden to\none who has learned the Sharīʻa (LC 36F TC60). Since\nAverroes’ colleagues hesitate, he wants to clear up their doubts\nand wants to comment on Aristotle’s arguments. Phys.\n190b5–10 describes the various ways of generation and concludes\nthat all need a substratum, an underlying matter. Averroes who\nexplains that the logical procedure followed here by Aristotle is\ninduction—reasoning from the particular to the\ngeneral—concludes: “It is clear that coming-to-be\nnecessarily requires a subject not only in natural but also in\nartificial things” (LC 37L TC63). This subject is numerically\none and does not have any substantial characteristic\n(dispositio) but can receive all kinds of substantial\ncharacteristics:\n\n\nIt is called first matter, and first hyle, and it is evident\nthat this matter is\n <not>[2]\n deprived of corporeity because if it was, it would have a substantial\nnature, a name, and a definition. From this it appears that he who\naffirms that this nature (sic, natura) is a body, is wrong,\nand he is likewise wrong who establishes that which has dimensions as\na subject possessing form in actuality, as Avicenna believes (LC 38D\nTC63).\n\n\nNo doubt Averroes is referring to the “corporeal form” of\nAvicenna. Since Prime Matter is a metaphysical notion and as such\nnothing empirically verifiable, questions arose about its kind of\nexistence. The Greek commentators developed the concept of corporeal\nform, which Avicenna maintains mainly in his physics. The corporeal\nform, ṣūra jismīya, invests Prime Matter with\ncorporeality and dimensions. Averroes, however, considers corporeality\nan attribute, not a form (SC 14: 10–11) and here in the LC he\nrejects the doctrine of the corporeal form.\n\nThe LC is concerned with the distinction between Prime Matter and\nprivation. The bronze, matter, can become the statue, form, because it\nis not the statue and this negation is a third principle. Aristotle\ndistinguished between absolute non-being and accidental not-being, and\nso matter is non-being accidentally, while privation is not-being\nper se (Phys. I.9, 191b34–192a5). In his\ninterpretation of the Aristotelian passage, Averroes points to the\nprivation of form as the nature of matter. Prime Matter is\n“almost composed of being and not-being” (LC 45C TC80).\nBecause of the presence of not-being in material beings, coming-to-be\nand passing-away is possible in them but not in heavenly bodies which\ndo not have matter, “as was explained in the treatise On the\nsubstance of the universe” (LC 45CD).\n\nThe Middle Commentary also deals with privation (MC 439K–440I;\nMC Kalonymos L 13vº–15rº) and insists on privation\nbeing a principle. Averroes indicates that the nature of Prime Matter\nis different from that of privation\n\n\nfor privation does not belong to the nature of coming-to-be in such a\nway that it becomes part of the generated thing but it is only some\naccident to the subject which is a [constituent] part of the generated\nthing. But it is necessary for coming-to-be and therefore, it is\naccidentally called principle. (MC 440E; MC Kalonymos L\n14vº7–9)\n\n\nIncidentally, it should be observed that in the SC Prime Matter is\nseen as containing all forms “in potentiality and\npossibility” (SC 15:7). The distinction between\nqūwa and imkān is not explicitly present\nin Aristotle, where we only read kata dynamin in the related\ntext (Phys. 192a26), although he sketches the distinction in\nsome passages of Metaphysics IX. However, the distinction is\nwell known to Avicenna. In his Shifā’,\nMetaphysics IV.2 (Avicenna, Metaphysics, IV.2,\n130–143), Avicenna explains the notions of potentiality and\npossibility in detail; Avempace also makes the distinction in his\ncommentary on the Physics (Avempace [SST], 28: 21–30,\n10). The LC and the MC do not refer to the distinction, and the\nabsence may be explained because Avempace’s influence loses\nweight in Averroes’ later \n  stages.[3]\n3. Nature and Human Form\n\nAt the end of his Long Commentary on Book I, Averroes distances\nhimself from Avicenna in so far as the latter maintains that\nMetaphysics has to prove the composition of matter and form in any\nbody. Averroes claims that only the observation of changes in the\nsubstance can explain the existence of these two principles (LC 47H\nTC83). He is not quoting Avicenna in an exact way, so he may not have\nhad Avicenna’s books of the Shifā’,\n“The Healing”, at hand. However, he is right in the\ninterpretation, since Avicenna states that the subject matter of\nnatural philosophy is the body as such, not the condition that it is\ncomposed of matter and form (Avicenna, Metaphysics, I.2,\n7).\n\nAvicenna affirms also that the natural philosopher is not allowed to\naddress the question of Nature as a principle but has to receive it\nfrom the metaphysician (Avicenna, Physics, I.5, 39–40).\nAverroes, at the beginning of his commentary on Book II follows his\nMaster Aristotle and defines Nature as “principle and cause by reason\nof which that in which it is changes [primarily and per se]\nand by reason of which that in which it is rests primarily and by\nitself” (LC 49B TC3). Aristotle’s definition in Phys.\n192b21–23, reads perhaps more clearly: “Nature is the principle\nand cause of motion and rest in that in which [Nature] inheres\nprimarily and by itself, and not accidentally.”\n\nAccording to Averroes the existence of Nature is self-evident as well\nas its definition; the metaphysician does not have to prove it. He\ndisagrees with Avicenna who seemingly contended that Nature belongs to\nthe class of things that are not self-evident and that the definition\nabove is not known by itself; for this reason the metaphysician should\nhave to explain what Nature is. Averroes is not sure about what\nAvicenna said and he admits that the metaphysician is qualified to\nrefute those views denying the existence of Nature as a principle. He\nguesses that Avicenna was moved to this view “because [Aristotle] had\nexplained in Books VII and VIII that every movable has a mover, and\nthere is no doubt about it except for the four elements” (LC 49B).\n\nThey move by themselves but mover and movable are different in them\n(see below § 12), and Avicenna would falsely understand that\nAristotle had not explained it in physics so held that the\nmetaphysician had to do it.\n\nIs Nature a material or formal cause? Aristotle said that some of his\npredecessors, and he names Antiphon among them, held that Nature was\nsolely a material cause, and not a formal cause; they would say that\nNature is fire, earth, air or water (Phys. II.1,\n193a12–26). Alexander of Aphrodisias, according to Averroes,\nadded that they also did not know that Nature “was different\nfrom the other accidents” (LC 51G TC8) and Averroes joins his\nview. Nature is not only matter but form too, and it better deserves\nto be form because form is in actuality as Nature is (LC 52G\nTC12).\n\nWithin the context of Nature as form and “inasmuch as privation\nis a kind of form” (Phys. II.1, 193b18–21),\nAverroes insists on a twofold division of form: there are perfect and\nimperfect forms. Perfect forms are free from privation, while\nimperfect, diminutae, forms contain some kind of privation\n(LC 53G TC15). In the example of blackness becoming whiteness,\nwhiteness is perfect form since there is no privation inherent it, but\nblackness is not, since the privation of whiteness inheres it. Form\nhas these double aspects in all contraries existing in qualitative\nchanges. In the case of substantial changes—the generation of\nwater out of air would be one example—doubts arise since\ncontraries are apparently not existent.\n\nAverroes recalls that privation exists in Prime Matter and thinks that\nAristotle “perhaps wanted to say that form is predicated in both\naspects of the disposition and privation existing in Prime\nMatter” (LC 53H TC15). Privation existing in Prime Matter is not\nabsolute privation and Averroes adds a gradation: quodammodo,\n“in a certain way” because this kind of privation is\n“like the form of matter” (LC 53I) that never deserts\nmatter. Averroes tells us that Aristotle will inquire later about the\nissue in the Book De generatione et corruptione, and Book II\nof the Aristotelian Coming-to-be and Passing-away explains\nthe composition of the four elements, the forms of which are the\nprimary contraries, i.e., the four primary qualities (Averroes [SC\nGC]: 27). Averroes anticipates his own conclusion: The kind of\nprivation existing in Prime Matter is such that it is never\ndispossessed of the primary contraries (LC 53K TC15).\n\nNature is form, and perfect form, but “inasmuch as privation is\na kind of form” Nature is affected by the kind of privation\nexisting in Prime Matter, in such a way that Nature can be considered\nan imperfect form. This seems to be Averroes’ interpretation of\nPhys. I.1, 193b18–21 concerning the two kinds of\nperfection.\n\nAverroes follows Aristotle who asserts that the philosopher of Nature\nalso has to inquire about the purpose and the means needed for this\npurpose (LC 57EH TC23; Phys. 194a29–30) and\nreformulates Aristotle’s reasoning in a syllogistic way: “Nature\nis the last of the motions of coming-to-be, but it is nobler than the\nforegoing ones; Everything in this manner is purpose, ergo\nNature is purpose,”and he distinguishes it from death that is solely\nend.\n\nWe had read that the philosopher of Nature is concerned with Prime\nMatter, but “since matter belongs to the genus of\nrelation”, i.e., it depends on its relation to form (LC 58K\nTC26; Phys. II.2, 194b9), its study also involves the study\nof form. Averroes mentions that matter exists on account of form,\npropter formam, and that the philosopher of Nature\ninvestigates both. He investigates form per se, and matter\nbecause of form (LC 58L), but the issue of how far his research can go\narises. The philosopher of Nature searches for form and\n quiddity[4]\n and goes as far as to the last, or highest form on the account of\nwhich matter exists, and this is man’s form, forma\nhominis (LC 59A TC26). Averroes is very assertive and once again\nhe disagrees with Avicenna when he claims that only the metaphysician\ndeals with these forms. For Averroes, the metaphysician studies the\nabstract forms, i.e., existing without matter, while the philosopher\nof Nature, the material forms but also the human form which is an\nintermediate between them and the purely abstract forms (LC 59D).\n4. Nature against Fortune\n\nChapter 3 of Aristotle’s Physics II is a treatise on\nthe subject of the four causes and it corresponds almost entirely to\nMetaphysics V.2. Then chapters 4 and 5 examine the question\nof chance and incidental causation, i.e., spontaneity. The question is\nrelated to whether Nature acts with purpose and Averroes sees its\ngreat significance. Commenting on 196b10–17, Averroes enters\ninto a discussion with Avicenna on the status of two irregular kinds\nof causation, fortuna and casus, chance (LC f.\n66D–67D TC48). In the Arabic translation of the Physics\nthey were bakht and min tilqā’ al-nafs\n(Aristotle, Ṭabīʻa [1964: 111: 4–5]),\nand in Averroes’ short commentary, bakht and\nittifāq, respectively (SC 26: 19). Averroes formulates\nthe Aristotelian argument in the form of a conditional syllogism the\nconclusion of which is that spontaneous causation happens in things\nthat are possible only in a few cases, in minori parte.\nAvicenna argues that the same action can be necessarily caused in some\nbeings and accidentally in some others and that, in a similar way, the\naction can be possible for some beings in most cases and for some\nothers in the least cases. Averroes gives an example of walking and\nresting. According to Avicenna, walking is accidental from the point\nof view of the moving power, but it is necessary from that of the\ndesire.\n\nIn Avicenna’s metaphysics necessity pervades everything, so that\nwe should agree with Averroes’ view that for him “all\n[actions] are necessary by\n nature”,[5]\n (LC 66M). Averroes affirms contingency and points out that Prime\nMatter is prepared to receive two contraries in the same way but that\nefficient causes act differently. Any contingent action does not\ncorrespond with two efficient causes “contrary in the same way\nand at all the time”. Averroes objects that if any efficient\ncause would equally act or not act, then the whole of Nature would act\nwithout any rule, that is, in vain, ociose, a result that\nneither Aristotle nor Averroes accept. The following quotation\nillustrates Averroes’ thought:\n\n\nWhen we say that in Prime Matter the potentiality (potentia)\nfor being is the same as the potentiality for not being, we mean that\ntwo contraries exist in it at the same opposite times, as for example\nrain can be and not be, but here in the winter, and here in the\nsummer, and that the causes equally producing these two contingent\n[facts] must be alternating at equal times, [but] the action of those\n[causes] takes place generally, and [the causes] are the celestial\nbodies, and consequently they are causes of that which exists just as\nof that which does not exist. (LC 67BC TC48)\n\n\nAverroes solves the conflict in an original way, he ranges Prime\nMatter and passive potencies against efficient causes and active\npotencies. Passive potencies are in principle indifferent to a certain\naction and they are the reason why contingent actions may take place\nor not likewise. Active potencies, on the contrary, follow rules so\nthat their actions are not equally contingent but usually happen. A\nfurther distinction between essential and accidental causality helps\nhim to explain generally and rarely occurring actions (LC 67GK TC49).\nUnder another aspect, the agent, or efficient cause, necessarily\nproduces the effect in the case of eternal beings and generally does\nit in the beings that come-to-be (LC 75D TC74).\n\nThe philosopher of Nature enquires about Nature and about the four\ncauses, and we have known the material, formal and efficient causes,\nbut does Nature act for a purpose? Aristotle starts Phys.\nII.8 saying that he is going to prove that Nature belongs to the final\ncauses (198b10–15) and Averroes observes that this tenet is a\nbasic principle in Physics and Metaphysics (LC 75L TC75). If the\nphilosopher of Nature would deny the existence of purposiveness in it,\nthe other causes would be annulled. Matter exists on the account of\nform, we have read. Form exists because an agent impresses it on\nmatter, and the agent acts because it wants to achieve an end. And “if\nthe metaphysician would not admit [the principle of purposiveness] he\nwould be unable to prove that God has solicitousness for those\n[beings] that are here.” (LC 75L)\n\nAristotle mentioned Zeus in Phys. II.8, 198b10–32 but\nto deny that he produced rain in order that crops grow; rain happens\nout of necessity. Since Averroes read God instead of Zeus in the\nArabic translation available to him (Ṭabīʻa\n[1964: 144:\n 3])[6],\n and he also used the word in his comment on the first passage (LC\n76H–77B TC76), it is remarkable that he did not see divine\nprovidence assailed by that claim. Averroes saw no difficulty in\nNature acting here with purpose, and he placed God in a rank higher\nthan just making rain fall. For him God acts as final cause and the\norder of Nature reveals the presence of His intelligence.\n\nAristotle argued that there is purposiveness in the natural as well as\nthe artificial realm concluding that “it is obvious that Nature\nis a cause, and one directed towards an end” (Phys.\nII.8, 199b32–33). Averroes agreed and opposed those who claim\nthat purposiveness exists only in deliberative actions because arts\nact externally while Nature acts internally. He notes that not all\narts are deliberative and that the physician is capable of using the\nart of medicine to heal himself, he is not external to the action (LC\n81I–82A TC86).\n5. Absolute or Conditional Necessity in Nature\n\nPurposiveness and necessity are interrelated and Aristotle analyses\nthe matter in Phys. II.9, introducing the distinction between\nabsolute and conditional necessity. Conditional necessity is always\nsubject to achieving an end. A well-known instance is given by\nAristotle in 200a10–15: a saw must necessarily be made of iron\nto do its work. The material, iron, is necessary but does not lead to\nthe production of a saw. Purpose precedes deliberative actions and\nimposes necessity upon the materials. As for natural events, Aristotle\nonly says: “necessity in the natural [events] is limited to what\nis called their matter and their motions” (Phys. II.9,\n200a30–32), not to the results, and the question arises whether\nnecessity is absolute or conditional.\n\nAverroes pays attention to the division between that which results\nfrom an intended action and that which results from having a certain\nmatter. He quotes Alexander of Aphrodisias, whose commentary on the\nPhysics, as already noted, is not extant: “Those [causes]\nthat are before the purpose in something (in re) are not said\nto be cause of the purpose except in the way that matter is cause of\nthe purpose” (LC 82M TC88).\n\nWe know that Alexander had to defend the Aristotelian position against\nthe Stoics in such an important matter as destiny or fate. In his book\nOn Destiny Alexander admits fate in Nature but not as\ngoverning human acts. While the final cause appears in planned changes\nas external to them, “the creations of Nature have the principle\nand cause of such generation within themselves” (De\nfato 168). Alexander’s treatise On Providence was\nwell known to Averroes who paraphrased part of it in his “Short\nCommentary on the Metaphysics”, as R. Arnzen has proved (Arnzen\n2010: 331–335). This is the context within which we may\ninterpret the short quotation Averroes makes of Alexander and Averroes\nends it adding “purpose is indeed the main cause” (LC 83A\nTC88).\n\nAverroes also reflects upon necessity of that which follows matter.\nOne example is death which is necessary for animals as a consequence\nof their matter. Is this an absolute necessity? Averroes denies it,\npointing out that these instances of necessity are caused by the\nsubstantial form or essential definition of the beings, here the\nanimals. Averroes claims that both cases of necessity—according\nto matter or according to purpose—have conditional characters\nsince “they are because of the form and essence\n(definitio) and they are not unconditionally necessary”\n(LC 83C TC88).\n\nAverroes finally reflects on absolutely necessary, which seemed to be\nexcluded by Aristotle in the passage. Whenever we ask for the reason\nof products of Nature or of the arts, the answer we get is their final\ncause, for instance, why does a saw have sharp teeth? To cut wood. The\nanswer however is completely different in the case of the eternal\nbeings. An eternal being acts because of its essence, its activity is\nbecause of itself, propter ipsum, and necessity is\nunconditional (LC 83F TC88).\n6. Change or Motion\n\nIn Book III Aristotle defines motion once as “the perfection of\nthat which is in potentiality under the aspect that it is in\npotentiality” (201a10–11) and another as “the\nperfection of that which is movable under the aspect that it is\nmovable” (202a7–8). Before reaching the first passage,\nAverroes distinguishes four premises in Aristotle’s approach to\ndefining motion (LC 86H TC3; Phys. III.1,\n200b25–32):\n\nBeing divides into actual and potential being\nAll beings belong to [at least] one of the ten Aristotelian\ncategories, praedicamenta.\nThe category of relation embraces the relation between more and\nless, as well as the relation between agent and patient.\nMotion occurs in more than one category (LC 87A TC4).\n\n\nBased on the evidence of four propositions, Averroes realizes that\nmotion does not have a univocal definition. Motion belongs to the\ngenus of the perfection toward which it intends, thus motion in\nsubstance belongs to the genus of substance, motions in quantity,\nplace and quality to the respective genera. But insofar as transition\ntowards a perfection is different from the perfection itself, motion\nis something different from its goal and Averroes affirms that,\nconsidered in this way, “Motion must be a genus per se, for the\nway toward something is different from it [the end]”,\nnecesse est ut sit genus per se, via enim ad rem est\naliud ab ipsa re (LC 87D TC4). For this reason he believes,\nAristotle classified motion in own category in his book on the\nCategories, and as we will see below, the category is being\naffected, passio.\n\nAverroes remarks that the definition of motion as belonging to the\ngenus of its perfection, is more adequate, verior, although\nthe definition of motion as a genus in itself, is better known,\nfamosior. In the Physics Aristotle deals accordingly\nwith the first definition, Averroes points out (LC 87E TC4). Medieval\nLatin philosophy would call this view of motion as genus in itself\n“a flow of form” fluxus formae, and the contrary\nview, “a flowing form”, forma fluens (Maier 1958:\n62–64).\n\nAverroes comments on the definition of Physics\n201a10–11: “motion is the perfection of that which is in\npotentiality under the aspect that it is in potentiality” (LC\n87D, secundum quod) and says that the movable has two kinds\nof perfection, a perfection in actuality, and a perfection in\npotentiality, under the aspect of which it is called motion.\nThemistius elaborated on the distinction (CAG 5.2: 69:9–70:31 )\nand Philoponus emphasized it in his commentary (Philoponus, CAG 16:\n342:10–344:7). Averroes could have received it either from\nPhiloponus (Lettinck 1994: 213) or Themistius (see above). He observes\nthat the definition is valid for both eternal and non-eternal classes\nof motion and he anticipates that the continuity of motion results\nfrom the definition itself (LC 88A TC6).\n\nAs for the definition of motion in Phys. 202a7–8,\n“perfection of that which is movable”, Averroes finds that\nit is more evident but that of Phys. 201a10–11,\n“perfection of that which is in potentiality” effectively\ntargets the substance of motion, demonstrat magis substantiam\nmotus (LC92A TC16).\n\nIn the Middle Commentary the premises for defining motion are\nthree:\n\nNatural beings are sometimes in potentiality, sometimes in\nactuality and “that is common to all ten categories”;\nMotion belongs to the category of relation\n(hiṣṭarphut);\nMotion is said by analogy (MC 449G–I; MC Kalonymos L\n28rº19–28vº8).\n\n\nThe definition of motion presented there is the verior one,\ni.e., motion belongs to the genus of its perfection, and it is not a\ncategory in itself.\n\nSince any change or motion requires two elements, the agent or mover\nand the patient or movable, Aristotle raises the question whether\nmotion is in the mover or the movable (Phys. III.3). Averroes\ngives following explanation: the mover acts in so far as it is form,\nthat is to say, in so far as it is in actuality, and the movable is\nmoved in so far as it is in potentiality, therefore the motion\n“becomes the same perfection of both of them” (LC 92H\nTC18). Nevertheless, they are two kinds of perfection and Aristotle\nsaw here a dialectical difficulty (aporía logikē,\nPhys. III.3, 202a21) with which Averroes deals at length (LC\n93F–94B TC19) but for Averroes the double character is no\ndifficulty: motion is one and the same according to the subject,\ndifferent according to the definition (LC 94K TC21).\n\nMotion in place is one kind of change but it is prior to the other\nkinds, to change in quality or alteration, to change in quantity or\ngrowth and decrease, and to change in substance, or coming-to-be and\npassing-away. Within local motion circular motion is the most perfect\nform and we will see how the universe is moved by circular motion.\n7. Infiniteness\n\nAt the beginning of Book III, Aristotle had linked the issue of motion\nto that of the continuous but also to that of the infinite\n(Phys. 200b16–18) because the continuous can be divided\nwithout limit. Averroes commented there that the advocates of atoms,\ni.e., the thesis that bodies are composed of a limited quantity of\nindivisible parts, would not agree with the definition that\n“continuous is that which divides into infinite”. He\nadded:\n\n\nMaybe [Aristotle] said so because continuous can have another\ndefinition, like as that saying that “the continuous is that in\nthe middle of which a common bound to two parts can be\nestablished”. (LC 86A TC1; cf. Categories\n5a14–15)\n\n\nThe infinite can be seen under various aspects including intellects\nand geometrical extensions, but the philosopher of Nature has to\nenquire only about the infinite “which concerns the extensions\nthat are in matter” (LC 102K TC39). He realizes that there is\nneither continuous nor discrete infinite actually existent. The\ninfinite can only exist in potentiality.\n\nFurther Averroes agrees with Aristotle that spatial extension can be\ndivided in infinitum which does not mean that it actually\nhappens. For the possibility of an infinite by addition, Averroes\nechoes al-Fārābī’s and Avempace’s\ncommentaries while explaining the passage 206b16–26 (LC\n113H–114G T60).\n\n\nIf we would affirm an endless decrease (diminutio), it would\nbe not impossible because decrease is going towards nothing (ad\nnihil), the cause of which is matter; addition is going towards\nbeing, the cause of which is form, infinity exists because of matter,\nas finiteness does because of form. (LC 114B).\n\n\nAverroes disagrees with al-Fārābī and Avempace who held\nthe view that just as the geometer can always draw a longer line\nin infinitum, so a magnitude can always grow larger. For him\nthere is a major difference between the geometer and the philosopher\nof Nature who can conceive infinity in addition only by means of\naddition of finite quantities, and so interprets Aristotle.\nImagination is responsible for the misunderstanding (LC 120IK\nTC75).\n\nAdding and deducting finite magnitudes is true in potentiality, but an\nincreasing or decreasing of a whole is not possible, neither\npotentially nor actually. And Averroes does not comment on\nAristotle’s words that time, motion, and thought must be\nconsidered infinite (208a20–21), and he only remarks “the\ninfinity which is found in them is not stable, i.e., existing in\nactuality, and that is impossible, but it is successive” (LC\n121A TC75).\n8. Place\n\nAristotle holds that place is something but it is neither form nor\nmatter. He gives several reasons against place being either of the two\nand argues, for instance, “If a thing’s place is in the\nthing (as it must be if it is either its form or its matter), place\nwill be in place” (Phys. IV.2, 210a5–6) and the\nresult is absurd. The passage causes Averroes to depart from the\nsubject and he first considers the following propositions concerning\nplace:\n\n\nFirst, form and matter move by means of the body composed of them\nboth. Second, in so far as they move, they need to be in place. Third\nif one of them is place, place must be in place. The second and third\npropositions are true, the first is not. (LC 129B TC20)\n\n\nAverroes reminds us that in Book VII, Aristotle says that the proper\nsubject of change and motion is body, not its matter or its form.\nMatter and form are in place accidentally and “it is not\nimpossible that place is in place accidentally, per\naccidens” (LC 129C). What is accidental divides into two\ncategories, always accidental or rarely so. Matter and form always\nmove together with the body, therefore place belongs to the category\nof always accident, and if it is constant, place is in place all the\ntime, but it is obvious that place is not always in place, either\nessentially or accidentally. The argument makes an exception: the\nplace of the outermost body, the place embracing the last body,\nbecause it moves together with the outermost body, and in this case it\nis in place accidentally and raro, rarely (LC 129E).\n\nAlexander of Aphrodisias objected because place is related to\nquantity: Place is equal to the thing that it contains. If a body\nmoves, it moves into a place that is equal to it, and for this reason\nform or matter are in place essentially. Alexander’s commentary\non the Physics has not reached us, and we have to rely on\nAverroes’ account. He admits: “that which Alexander said\nis not free of doubt” (LC 129F).\n\nLater on (LC 133H TC30) Averroes refers again to Alexander; he\ncomments on Phys. IV 210b31–211a6, and makes five\nstatements concerning ‘place’ that he considers to be\nAristotelian:\n\nPlace contains what is in place and is different from it;\nPlace is equal to what is in place;\nPlace is separate from what is in place, and Averroes quotes\nAristotle: “it is also devoid of any kind of particulars and is\nseparated from them”, extra quodcunque singularium, et\nseparatur ab eis;\nAbove and below are the directions of place;\nPlace is that toward which what is in place naturally moves.\n\n\nAccording to Averroes, Alexander read in statement 3: “It\n[place] is not devoid of any particulars and is\nseparated”, instead of the affirmative sentence “It is\nalso devoid of any particulars and is separated from them” (LC\n133H). Averroes should have read Isḥāq Ibn\nḤunayn’s translation. The Arabic translation of\nIsḥāq reads here “[Place] is devoid of any aspects\nand it is separable” (Aristotle, Ṭabīʻa\n[1964: 302: 9–10]), and it coincides with Ross’ edition\n(apoleipesthai ekastou, 211a2; [Ross 1936]). Averroes thinks\nthat Alexander’s reading is “more true, but it is not\nknown per se”, and that Alexander would choose this\nreading to oppose those who pretend the place to be the void.\n\nSince place is neither matter nor form nor extension,\ndimensio, i.e., an extension that is always independent from\nthat of the movable, Aristotle concludes that place has to be the\nlimit of the surrounding body (peras tou periekhontos\nsōmatos, Phys. IV.4, 212a2–6). Place does not\nmove essentially, and Averroes says that Aristotle gave a renowned\nargument, rationemfamosam, to support his tenet (LC 140F\nTC42; Phys. 212a21–30). The surface surrounding the\nlast sphere of universe is the absolute above, and the center of the\nuniverse, i.e., the earth, the absolute below and just as the center\nis stable, the outmost surface is too; they cannot move at all.\nAverroes adds that the air is above and the water below “but not\nabsolutely”, since Aristotle could mention fire also, as being\nlight. The argument can be organized as a syllogism of the second\nfigure, and two affirmative propositions: “The highest [body] has to\nbe stable, fixum; the outermost circulating [body] is stable;\nergo, the highest [body] is the outermost circulating” (LC\n140G).\n\n1) Averroes now faces a great question, magna quaestio, in\nrelation to Phys. IV.5, 212a31–b3, a passage where\nAristotle mentions the circular motion in the universe (his\ncommentary, TC43, occupies LC 141C through LC 143C). We know that the\noutermost sphere moves with the daily rotation but “as a whole\nit does not simultaneously change its place, though it moves in a\ncircle: for this place is the place of its parts”. Only their\nparts, the four elements, change place (Phys. 212b1). For\nthis accidental reason, Aristotle grants it some kind of place. The\nAristotelian passage remained obscure and discussions about the place\nof the universe arose.\n\nAverroes expresses the dilemma: “We have the choice between either of\ntwo options: either we affirm that something moving is not in place,\nor we affirm that place is the void, and it is extension” (LC 141F\nTC43). Averroes mentions the views of John Philoponus (d. 570 CE) and\nThemistius (d. 387 CE). For Philoponus, the solution to the dilemma\nconsisted in taking place as extension, dimensio, and\naccepting the existence of the void. Averroes seems to have had access\nto Philoponus’ Corollary on Place, the Greek original\nof which is extant (Philoponus CAG 17: 557–585) and has been\ntranslated into English (1991). We will see below that Averroes\nrejects the existence of the void.\n\n2) For Themistius, the celestial body is in a place “not in\naccordance with the whole but with the parts” (secundum\npartes, LC 141F TC43), and Averroes explains that “It means\nin accordance with the spheres that the largest sphere\ncontains”, and we should understand that Themistius skipped the\nfive elements. Averroes interprets that the latter is the sphere of\nthe fixed stars, which is not surrounded by anything else and the\nconcavity of which surrounds everything. Moreover he refers to the\n“natural science” of his time that proved that there is a\nninth sphere, the one of the daily motion, and if so, we can affirm\nthat the motion of the latter is “the essential motion of the\nwhole universe, orbis” (essentialiter, LC 141H\nT43).\n\n3) The magna quaestio is many-sided. Averroes recalls a\npassage in Physics VI, 240a29–b7, where Aristotle\nrefuted Zeno’s fourth argument against motion and asserted that\nthe sphere moves in accordance with the whole as well as with the\nparts. Therefore, if Themistius claimed that the sphere is in place\nnot in accordance with the whole but only with the parts, because he\nthought that only its parts change place, he would contradict\nAristotle’s views (LC 141I).\n\nAverroes says that Themistius could argue that Aristotle in\nPhysics VI meant the same as here in Physics IV,\ni.e., that the sphere does not change its place as a whole\n(Phys. 212a35). Averroes restricts the assertion to the\nspherical body of the universe. Other spheres move because of their\nparts, which change their places, and the parts are all the celestial\nbodies:\n\n\nWhen he said “but it can move in a circle” (alio modo\nmovetur circulariter 212a35–b1) he meant that the circular\nmotion is predicated of the whole because of certain of its parts,\ni.e., the celestial bodies, in the same manner as rectilinear motion\nis predicated of them because of the motion of the elements, which are\nalso some parts of them. (LC 141K TC43)\n\n\nThemistius interpreted that since Aristotle said that the heavenly\nbody (coelum) is in place per accidens, he assumed\nanother heavenly body to be in place (I add, per se) and\nAverroes explains “another heavenly body” as all celestial\nspheres, orbium. According to Themistius, per\naccidens is such a wide category that the commentators before him\ndid not find the term adequate and they said the heavenly body to be\nin a place because of its parts. Themistius and Averroes share the\nview that Aristotle here was using the term per accidens\nfreely (LC 141M). Themistius is a highly regarded authority but\nAverroes will formulate his own solution.\n\nAccording to Aristotle—so he understands him—the\nrectilinearly moving bodies are in place per se, essentially,\nthe rotating bodies, accidentally, per accidens, and the\nwhole universe is in place because of its parts, and parts mean the\nfive elementary bodies (LC 142CD TC43). But before reaching his\nconclusion Averroes has to clear the way refuting Avempace’s\ndoctrine:\n\n4) Avempace (d. 1138) had his own view on the issue. The sphere is not\nin place because nothing encloses it from outside. “The place of\nthe sphere that is envisioned by this, in so far as it is sphere, is\nthe convexity of the center, around which it rotates” (LC 142A\nT43). Avempace would take Aristotle’s definition of place as\nthat which surrounds the body and apply it to the external surface of\nthe bodies moving rectilinearly and to the internal surface of the\nbodies rotating. Averroes conjectures that Avempace borrowed his view\nfrom al-Fārābī (d. c. 950) who refuted the opinions of\nJoannes Philoponus on place but al-Fārābī’s book\n“did not fall into our hands”, he says.\n\nAverroes expounded Avempace’s view in the Short (SC\n53:10–56:10; Lettinck 1994: 316), and the Middle Commentary at\nlength (MC Kalonymos L 45vº22–47rº23) but he also\nrefers to it in the LC where he rejects it because Avempace\n“abandoned Aristotle’s discourse and erred heavily”\n(LC 142K TC43). Avempace and al-Fārābī should maintain\nthat the sphere is in place essentially, and Averroes’\nsummarizing words in the MC may be worth of being translated:\n\n\nWhat we told about place of the sphere is that which Abū Bakr Ibn\nal-Ṣā’igh and Abū Naṣr\n[al-Fārābī] before him, considered, i.e., that its\nparts are in place essentially, i.e., by means of its center. Place is\nsaid by equivocity with regard to the place of the spherical body and\nto the place of the body [moving] in straight lines. Indeed, it\nappears [to me] that it is most reasonable to say that the sphere is\nin place accidentally by means of its center which [the sphere]\nsurrounds because what is in place essentially is surrounded, not\nsurrounding. But that which surrounds matches (maqbil) to\nthat which is surrounded. It may be said that which surrounds is\nin that which is surrounded. Since the body of the\nheavens does not have anything surrounding it, it is not in place\nessentially, but it is in place by means of that surrounded by it, and\nthis is accidentally. (MC Kalonymos L 47rº2–10; O\n37vº–38rº)\n\n\n5) Averroes disagrees with Avempace and he still has some reflections\non the magna quaestio. He explains that the rectilinearly\nmoving bodies are in place essentially, the rotating bodies,\naccidentally, and that the whole universe is in place because of its\nparts, as said before (LC 142CD).\n\nHe states: “That which is in place is equal to the place”\n(LC 142D TC43; cf. Phys. IV.4, 212a29–30). This means,\nin its proper sense, that the contents of both have to be equal, but\nthe surface of the concave sphere is not equal to the surfaces of the\nembraced spheres. Averroes refers to their content, and says\n“that equality is impossible, unless place were the void”\n(ista aequalitas non est vera de loco, nisi inane esset, LC\n142E TC43). Averroes looks for an answer. The universe is at rest as a\nwhole. The earth is the center of the universe and the center is at\nrest, and it is in place essentially. The heavenly body\n(coelum) is not at rest in so far as its parts, i.e., the\nvarious spheres, move but it does not translocate, non\ntransmutatur, and for this reason it is in place accidentally (LC\n142G T43). His reference is Aristotle, but Bekker’s edition of\nthe passage 212b7–13 simply reads that “some things [are]\nin place accidentally like the soul and the heavenly\n body”.[7]\n\nIf the heavenly body is in place accidentally, per accidens,\nthe following objection could be raised: Is its motion also\naccidental? (LC 142K TC43). And if its motion is accidental, since the\nmotion of the heavenly body precedes all other motions, an accidental\nmotion will precede any essential motion. Averroes answers the\nobjection saying that all “that move by themselves need something at\nrest, around which they move, as Aristotle says in the Book about the\nlocal motions of the animals,” (De motu animalium, LC 142L\nTC43) but it does not matter whether a body is at rest essentially or\naccidentally.\n\nAverroes believes this to be the solution and does understand why\nAlexander of Aphrodisias held the view that the sphere of the fixed\nstars is not in a place. Besides he thinks that Alexander influenced\nAvicenna to deny that the heavenly body is in place and to affirm that\nits motion is only “positional”, it changes only its\nposition (situale, LC 144H–I TC47). Averroes final\nposition is read at the beginning of TC44 that comments on\nPhysics IV.4, 212b3–6:\n\n\nSome bodies are in place essentially, and they are those outside of\nwhich there is some surrounding body, and some are in place because\ntheir parts are in place, and this is the condition of the body of the\nAll, and some are in place accidentally, like that which moves\ncircularly. (LC 143E)\n\n9. Void, Motion in the Void\n\nAristotle stated the arguments of his predecessors for and against the\nexistence of the void, then he defined its exact meaning\n(Phys. IV.6, 213a12–214a16). Afterwards he would refute\nthe existence of the void by proving that change and locomotion do not\ninvolve the existence of the void (214a16–b11) and that void is\nincompatible with motion (214b12–216b26).\n\nThe second set of arguments includes his explanation about velocity\nand the motion of bodies in the medium (Phys. IV.8,\n215a29–216a21). Velocity depends on the heaviness or lightness\nof a falling body, but also on the density of the medium, water or\nair, for instance. The same body will fall at different velocities in\naccordance with the ratio of the various media. The role of the medium\nis to oppose resistance to any natural or violent motion, but\nAristotle does not see it as a hindrance but as necessarily\ncomplementing the action of the moving agent. The void has no density\nand since there is no ratio in which it stands to a body, motion would\nhappen within any imaginable time.\n\nPhiloponus disagreed with Aristotle and affirmed the existence of the\nvoid and the possibility of motion in it (CAG 17: 675–695).\nCenturies later, Avempace denied the role of the medium as being\nnecessary for motion, and maintained that bodies can move in the void,\nbut a direct influence of Philoponus upon him has not been proved.\nAverroes ignored the issue in the Short Commentary but not in the\nMiddle Commentary. Averroes organizes the arguments against the\nexistence of the void in proofs, and the third proof as stated in MC\nBook IV, section 2, chapter 5 maintains that if there is no medium\n(emṣaՙi), motion will happen in no time, and that\nthis is not possible. He opposes Avempace’s view that the stone\ncan naturally move in time in the void and that the medium only makes\nits natural motion slower; the medium water slows down its fall less\nthan the medium air does (MC Kalonymos L\n52vº20–53rº23). Natural motion has its own velocity\nand the medium deducts from it, so that\n\n\nIf the movable would move in the void (requt), the movable\nwould be within time because [Avempace] thought that the local delay\nwould be removed from it and that its original motion would remain,\nand all this is false illusion. (MC Kalonymos L\n53rº1–3)\n\n\nAverroes does not accept the possibility of motion as addable or\ndeductible and insists in the oneness. In the Long Commentary he\ndevelops the principle. The issue of motion in the void occupies LC\n158L–162C T71, and there Averroes expounds Avempace’s\ncommentary making it known to the Latin philosophers, and Thomas of\nAquinas adopted the latter’s view. Averroes knows that Avempace\nobjected that if motion needed a medium so that it happens in time,\nthe celestial spheres would rotate in no time (LC 160D TC71; Avempace\n[SST] 1974, 116: 6–18]).\n\nAverroes blames Avempace for misunderstanding the essence of velocity.\nVelocity is not a motion added to or subtracted from another motion,\nin this case, natural motion, “like a line added or subtracted\nfrom a line” (LC 161A). For Averroes, there is a ratio between\nthe power of mover and the resistance of the movable, and a ratio\nbetween the hindering and the hindered, and velocity depends on both\nfactors. Velocity in the celestial spheres results from the first kind\nof ratio, since there is no medium, and Averroes agrees with Avempace\nin considering the degree of nobleness (sharf) of the various\nspheres as the factor explaining their different velocities.\nSharf is the surplus of “energy” between the\npower of motor and the resistance opposed by the movable.\n\nAverroes disagrees with Avempace concerning the movements of the four\nelements. He maintains that mover and movable among them are not\nreally different (distincta per se) because “the\nmovable thing is in potentiality, and the mover in actuality”\n(LC 161K; MC Wolfson\n 673–674).[8]\n The four elements are composed each of prime matter and a simple\nform, for instance, the elementary form of earth is coldness and\ndryness. Averroes affirms that the form is their mover, and matter,\ntheir movable thing (see below c. 12). Under this conception the\nmovable cannot oppose resistance to the mover, and motion without\nmedium would be impossible, because it would be in no time. The medium\nmakes motion possible because it introduces time (LC 161H; MC Wolfson\n403–408). Averroes wanted to defend Aristotle and found this\nexplanation. Its weakness is obvious but the denial of motion in a\nvoid prevailed in medieval science (Maier 1952: 221–223, 1958:\n244–274).\n10. Time\n\nAccording to Aristotle, motion and time are not the same but time\ncannot be isolated from motion, and. if we are not conscious of any\nchange, we are not aware of time. He tells of the men in the fable who\nslept with the heroes in Sardinia; when they awoke, to them no time\nseemed to have elapsed (Phys. IV.11, 218b21–25).\nAverroes read the story in the Arabic translation but he adapted it to\nthe Islamic context, and those men became the “People of the\nCave” mentioned in the Qur’an 18:9–26 (LC 178B T97).\nHowever, the SC keeps the Aristotelian example (SC 58:\n10–11).\n\nMore significant is Averroes’ interpretation of time as an\naccident of motion (Trifogli 2001, 62). Since motions are many, he\nwants to identify that motion the accident of which time is (LC 178G\nT98). If we assume that time is the accident of the celestial motion,\nthose who do not perceive this motion, “like those of whom Plato\nsays that they have been incarcerated underground since their\nchildhood” (Republic 7, 514a–517a) will not\nperceive time at all. And if time is an accident of any motion, there\nwill be as many times as kinds of motion. Averroes solves the dilemma\nmaking a double interpretation of time. Our perception of time in so\nfar as we are beings undergoing change is the primary perception of\ntime, and\n\n\nit is evident that we only perceive that we are in a changing being\n(transmutabili, LC 179B) because of the change of the\nheavenly body.\n\n\nAnd he adds that if the heavenly body would be at rest, we would have\nthe nature of an unchanging being, in esse non transmutabili.\nThis perception follows time essentially, while our perception of time\nin relation to any motion otherwise is only accidental. Averroes\nadmits to have arrived at this opinion after long enquiry, post\nmagnum tempus, since in earlier times he followed the\ncommentators (LC 179G).\n\nTime is defined by Aristotle as the number of motion in respect of\nbefore and after (Phys. IV.11, 219b1–2). Averroes\nexpounds that ‘number’ is like the logical genus and\n‘before and after’ the specific difference (LC 181F\nTC101). The definition was subject to discussion among Greek and Arab\ncommentators, and Averroes refers to Alexander of Aphrodisias and\nThemistius, and to al-Fārābī. For Averroes the\ndefinition of time about which there is no doubt is that “time\nis the numerable one of the before and after existing in motion”\n(numeratum prioris et posterioris) (LC 181H TC101), that is,\nbefore and after is a condition existing in motion, and its\nnumerability is time. Averroes has the same explanation in his Short\nCommentary: “When Aristotle says that time is the number of the\npreceding and the following he means that time is the numerable one\n(maՙdūd) of preceding and following that exists in\nmotion” (SC 61: 12).\n\nBecause time numbers and measures, it is similar to the numbers we use\nin counting (assimilatur, LC 182B TC102). When Aristotle\nlater says that motion and time number and measure each other\n(Phys. IV.12, 220b14–32), Averroes gives his view: time\nnumbers and measures motion essentially (per se) and it is\nnumbered and measured by motion accidentally “because the\nsubstance of time is number of motion” (LC 188D TC112). By\nemploying the term substantia to time several times Averroes\nshows that he sees time as a certain entity in itself.\n\nTime measures also things that are at rest because they exist in time\n(221b8–9). The Arabic translation does not insert\n“incidentally” to restrict “measures”\n(Ṭabīʻa [1964: 456: 4–5]). In his\ncommentary (LC 192F TC118; MC Wolfson 647), Averroes shows first his\nconcern for things that are eternally in motion like the universe and\nthings that are eternally at rest like the earth: he says that they\ncannot be measured by time (LC 192L). Therefore, time measures motion\nand rest; it measures motion essentially and primarily, and it\nmeasures rest incidentally and secondarily, i.e., “as it is\ndeprivation of motion” (LC 193L); the solution fits in with\nAverroes’ way of thinking.\n\nShould we look at the processes of coming-to-be and passing-away we\nmeet with similar interpretation. The elements change one into\nanother; water exists for a while and then turns into air, for\ninstance. In particular, individual living beings have a limited life\nspan; thus a linear dimension extends to them while the whole\nundergoes a continuous cycle of coming-to-be and passing-away, and its\ndimension is circular. Time measures the limited duration of sublunary\nbeings, and the eternal motion of the spheres makes cycles eternal. To\nlink both dimensions, Averroes introduces the motion of the sun along\nthe ecliptic, the inclined circle that marks the sun’s\n path.[9]\n\n\nFor this circle, as Aristotle says, in addition to the continuity and\nperpetuity of the motion in it, has the added feature of possessing a\nduality of movements, one of approach and one of retreat. (Averroes\n[MC GC En]: 101)\n\n11. Continuum\n\nIn Physics V.3, 226b18, Aristotle begins to talk about the\nnotions of ‘together’, ‘apart’, ‘in\ntouch’, ‘between’, ‘next in succession’,\n‘contiguous’ and ‘continuous’.\nPhysics 226b23–27 is a sentence out of place and\nIsḥāq translation does not contain it. His translation goes\non:\n\n\nWhat moves continuously is that which has no gap at all, or a minimal,\nin that thing (pragma: maʻnà) in which\nits motion happens, nor [a gap] in time. A gap [in time] does not\nprevent the [highest] musical note Zīr (neatē) from\ncoming after the [lowest] musical note Bam (hypatē) in\nplace. I mean only the thing in which motion happens, and this is\nevident in movements that happen in place as well as in all others.\n(Ṭabīʻa [1964: 540–541]; cf.\nPhys. V.3, 226b27–32)\n\n\nBessarion almost skipped the musical example, but Scotus had\ntranslated Isḥāq’s text together with Averroes’\ncommentary (LC 223 HI T23). Aristotle admits minimal breaks in his\ndefinition of continuum, and his musical instance refers to the\npossibility of omitting a few notes, and that nevertheless, the\ntransition to be continuous (Ross 1936: 628).\n\nThis definition of continuum looks contradictory in itself, but\nAverroes remains faithful to Aristotle and widens the range of\npossible breaks in a continuous change and motion. Many movements are\ncontinuous although they have small breaks in the thing\n(maʻnà: intentio) like animals when they\nwalk, “but those that fly or swim do not have a break at\nall” (LC 223L T23).\n\nAverroes explicitly backs Alexander’s account that Book VI\nfollows Book V because the beginning of the former makes use of the\n“descriptions” of the continuous, contiguous and next in\nsuccession objects that were set up in Book V (LC 246L T1). Aristotle\nstrives to prove that a continuum cannot be composed of indivisibles,\nand he gives the example of the line, because a line cannot be\ncomposed of points. The cause for the continuum in magnitude, spatial\nextension (megethos) is pleaded with various arguments, and\nit is shown that time and motion are continuous too (Phys.\nVI.1, 231a21–233b32). They are always divisible.\n\nThe same seems to apply for the subject of change: “Anything\nthat changes must be divisible” (Phys. VI.4, 234b10),\nbut Averroes has read the commentators and knows their doubts (LC 265I\nT32). First, does Aristotle mean only motion in the three categories,\nquantity, quality, and place, or does he also mean change in\nsubstance? Second, if there are changes in no time, how can the\nmovable be partially there where it starts and there where it\nends?\n\nAlexander denied the existence of changes in no time, but “all\nthe Peripatetics admit changes that take place in no time, as this is\nevident in lights and similar actions” (LC 265L). Themistius\nbelieved that Aristotle did not intend here any change in no time.\nAvempace claimed that the divisibility that Aristotle means here is\nnot the divisibility according to the last point, secundum\nultima, but according to the circumstance that in the movable\nthere are two contraries, during the interval, and Averroes adds\n“I sustained this view long time ago” (LC 266C; cf. SC\n99:13–100:2), and he had actually affirmed that Avempace had\nsolved the issue (MC Wolfson 544–545; MC Kalonymos L 81vº\n& O 64vº).\n\nAverroes admits changes in no time but he restricts them to accidental\nchanges, and they are those which are the aim of another change and he\ngives the instance of lighting the room thanks to the motion of the\ncandle. Since they result from another change, they are divisible in\nso far as the main movables are (LC 266F). As Cerami remarks, this is\nhow Averroes wants to solve the aporia of the instantaneous changes\n(Cerami 2015: 406).\n\nFor the changes that Averroes calls “essential”, Aristotle\nstresses that during the process of change the movable must be partly\nunder one condition and partly under the other. He explains: when\nwhite changes into black, it is partially white and partially grey, as\ngrey is the first degree of change (Phys. VI.4,\n234b17–18).\n\nAverroes verifies the fact in changes in quality—color,\ntemperature, place, and substance. In all we find a first changed\nthing that is partially in that from which it changed and partially in\nthat into which has primarily changed (LC 266I). Let us quote his\nwords describing substantial change:\n\n\nHowever the first [thing] in coming-to-be and passing-away is the\nminimal part of the generated [substance] being able to exist;\n“minimum” there is a [minimal] complete quantity in any\ngenerated [substance], for instance, the minimal part of fire is\ncomplete, i.e., the minimal part that is capable to be fire,\nminima pars, quae potest esse ignis. (LC 267D\nTC32)\n\n\nAbove we read that “animals that walk” have minimal breaks\nin their local motion and now we face an even more serious challenge\nto the continuum theory. It should be noted that Ruth Glasner has\nargued that Averroes in this passage develops a new doctrine of\nchange, namely, change as “a contiguous chain of intermediate\nchanges” (Glasner 2009: 122–127). Moreover, she has shown\nthat Averroes’ breakdown extends to the composition of the\nbodies that are generated and perish, so that actual minimal units\nexist, “units having mater, form, and specific natura\nmotion” (Glasner 2009, 159). Glasner has adduced evidence to\nsupport Averroes’ originality and the significance of his\ninnovative doctrine for the history of modern \nscience.[10]\n\nAverroes had to go back to the issue in his interpretation of Book\nVIII.3, 253b6–31, where Aristotle denies the processes of\nincrease and decrease and of qualitative change to be always\n occurring[11].\n His commentary is unusually long (LC 358D–360F TC23) and\nAverroes asks himself why Aristotle had to refute something apparently\nobvious. He conjectures that the reason is because continuity is\nhidden in quantitative and qualitative motions (in motibus\naugmentationis et alterationis, LC 359H). He gives the\nAristotelian example of the stone being worn away by the drop of water\nand then discusses how the process takes place. The stone loses each\ntime a certain part, and not whatever part but the first actually\ncreated one (prima pars facta in actu, LC 359G), and the same\nrule applies to the falling drops of water. They are complete parts.\nAverroes recalls that Aristotle had said in Book VI (234b10–20)\nthat what changes does not have a first part, and he sees there a\ndifficulty but he explains:\n\n\nLet us say that the first part that is generated from the motion is in\nsome way in actuality and in some way in potentiality because it is\ndeterminate as that which will be in actuality, and under this aspect\nit is not divisible, and it is divisible in so far as motion is\ncontinuous. (LC 359KL; LC Schmieja8 79: 9–12)\n\n12. Change in Substance\n\nAt the beginning of Book V of the Physics, Aristotle makes a\ndistinction between change (metabolē) and motion\n(kinēsis). Aristotle classifies the changes per\nse from two angles: the terms whence and\nwhither of any change and motion and from the angle of the\ncategories. From the first angle (Phys. V.1,\n224b35–b5), change can take place through four ways:\n\nfrom positive A (hypokeimenon, Arabic\nmawḍūʻ) to positive B,\nfrom positive A to negative A,\nfrom negative A to positive A,\nfrom negative A to negative B.\n\n\n(4) is not a change at all, because not-A and not-B\nare neither contrary nor contradictory. (2) is passing-away and (3) is\ncoming-to-be, and these two changes are not motion. The only change\nthat is a motion is (1) from positive A to positive\nB. Averroes interprets A (the Latin translation\nreads subjectum) as ‘being’ (esse), and\nnon subjectum becomes ‘non-being’ (non\nesse), but immediately he adds:\n\n\nI understand under not being not being in actuality, that is being in\npotentiality, and [that is] not being in general\n(universaliter), that which is characteristic of Prime\nMatter, and not absolute non-being. (LC 211E TC7; MC Wolfson\n514–516)\n\n\nFrom the angle of the ten Aristotelian categories (225b5–b10),\nthere are three kinds of motion: qualitative (how), quantitative (how\nmuch), and local (where). Averroes observes:\n\n\nThe commentators ask here in what manner [Aristotle] places motion\nunder three different genera, although he placed it as a genus in\nitself, namely under the category of being affected. (LC 214K TC9)\n\n\nSome of the commentators voiced the opinion that the category of\nbeing-affected is a genus for motion under the consideration of\n“receiving the motion”, others, that quality, quantity and\nplace are partially moving, partially at rest, and others disagree,\nand do not accept quality, quantity and place as genera for motion.\nAverroes considers it wrong to enter motion into the category of\nbeing-affected because motion is something the movable receives.\nAverroes’ view is summarized in his own words:\n\n\nMotion has a twofold consideration because according to its matter, it\nbelongs to the genus of that toward which it moves, but according to\nits form, namely, according to its being change\n(transmutatio) linked with time, it belongs to the category\nof being-affected. (LC 215B\n TC9)[12]\n\n\nMotion does not take place in substantial change, that is,\ncoming-to-be or passing-away because there is nothing contrary to\nsubstance (Phys. 225b10–11). Averroes comments on\n“contrary” and explains that the contraries here involved\nhave “intermediate” states (mediata), no matter\ntheir form or condition (LC 215F TC10). Averroes refers to the\ncommentaries of Alexander on De generatione et corruptione\nand Themistius (without identifying the work which the latter\ncomments) and their arguments. He develops his point of view:\nAristotle’s doctrine that changes in substance are not motion\nbecause substance has no contrary is well known (famosa) but\nit seems to him more adequate to say: “coming-to-be and passing-away\nare not motion because they are in something which is potentiality,\nnot in actuality, and motion is in actuality” (216A TC10; MC Wolfson\n518). If there is motion in substantial change, it is only\naccidentally (LC 216C), but motion plays its role in necessitating\nit.\n13. Substantial change as coming-to-be\n\nChange in substance is the main subject of Aristotle’s De\ngeneratione et corruptione although the other two kinds are\nexamined too, namely, growth and alteration. Substantial change\nimplies absolute coming-to-be and perishing, and first matter is\nassumed as their ground; it takes place in an absolute, unqualified\nway (haplōs) (GC 317a 32–34); absolute coming-to-be and\nperishing divide again into simple (haplous) and composite\n(synthetos) forms. The Arabic uses ʻalá\nal-iṭlāq for ‘absolutely,’ and\nbasīṭ for ‘simple’.\n\nAverroes wrote a Middle and a Short Commentary on Aristotle’s\ntreatise and his approach is somewhat different in each one. The Short\nCommentary or Epitome places the treatise in the context of\nAristotle’s works. We are told that the book belongs after the\nDe Caelo and that “in an earlier work,” i.e., the\nPhysics change in place was examined. Growth was \nexamined in the books On the Soul and On Animals,\nand coming-to-be was also studied in the Meteorologica (Averroes,\nSC GC En, 113), but its treatment is now different: \n\n\nWith regard to simple generation, he explains it here completely , but\nwith regard to the generation of composite [bodies], he does it, in\nthis book, at the level of the genus of the topic (amr),\ngiving account of its principles and elements\n(usṭuqusāt) (Averroes, SC GC Ar, 3: 11–4: 2\nArabic).\n\n\nAverroes divides the genus of coming-to-be and perishing into two\nkinds simple and composite. Simple generation is found in the\nso-called elements (usṭuqusāt) and chapters 1–8 of\nBook II of De generatione identify them as Earth, Air, Fire,\nand Water and justify why they are only these four and how they change\ninto each other. The issue of the ether, the fifth element, is left\naside in this treatise. No need saying that his argumentation is based\non the preeminence of the sense of touch, something which is obviously\nquestionable, but the classification was successful for many\ncenturies.\n\nFor a modern reader, more important than the reality of the four\nelements seems to be Aristotle’s doctrine of the contrarieties\nas well as the double dimension active and passive of their potencies\n(in particular, c. 2, 329b 7 – 330a 29). Joachim considers that\nthe contrarieties (enantiōseis) in Aristotle are merely\n“couples of contrasted qualities” (Aristotle, GC Joachim\n1926, 200–201) but Averroes was more specific and wrote\nal-mutaḍḍaḍāt al-ūlá /\nal-uwwal, the primary contrarieties (contrarietates\nprimae, haphakhim re’shonim) so that we should\nlook for the reasons of his precision.\n\nSince Philoponos’ commentary is extant, we may turn to it for\nhis interpretation of the passage (Philoponus GC Gr 1897, 213: 1–223: 27). For him Aristotle’s doctrine of the contrarieties\nconsiders them as principles, arkhai. There are three\nprinciples according to Philoponus: matter is the first principle,\nform “which is the contrariety” is the second, and the\nthird is the simple body. (Philoponus, 123) The translation by\nWilliams reads that :“the principles are three, first matter, second\nthe enmattered form which is the same as the contrarieties, and third\nthe simple bodies which he says come to be out of matter when it takes\non the contrarieties” (Philoponus 2013, 123).\n\nAverroes knew the commentary and therefore, that they were principles\nand that they were on the same level as first matter. One should not\ndismiss the possible reading “primary contrarieties” in\nthe Arabic translation used by Averroes. The Aristotelian tradition\ntaught him that hotness/coldness and dryness/moistness are principles.\nFurthermore, the capacity of acting was related to one of the members\nof the couple of primary contrarieties, and that of being affected to\nthe second. Their dual combination was substantial form, and Averroes\nstressed it: “The proximate matter of the simple bodies is the\nprime matter, as has already been shown, and their forms are the\nprimary contrarieties existing in them” (Averroes, SC GC, 27:\n6–8). The Middle Commentary expresses the very conclusion in similar\nterms (MC GC En, 70)\n\nAs for the question whether the “primary contrarieties”\n--as enmattered form-- are active or passive powers, Philoponus\ncommented on GC 329b 24 – 26 and observed that the elementary\nqualities, or contrarieties, have a power to act and a capacity to be\naffected, and that “in the case of their coming-to-be from one\nanother they are all alike capable both of acting and of being\naffected” (Philoponus 2013, 128). Avempace was very sensitive to\nthe issue and extended in an excursus when writing his own commentary\nand was clear in accepting an active and a passive power in each\nelement, for instance, in the element water (Avempace 1994,\n65).Averroes, in the Epitome, summarized Aristotle’s views that\nonly hotness/coldness and dryness/moistness can be the primary\ncontrarieties because they are powers, quwá, while\nheaviness and lightness, in spite of their being tangible qualities,\nare not. Averroes insisted:.\n\n\nAs for heavy and light, however, although they are present in the\nsimple bodies, they do not belong to them insofar as they are elements\nsince they are neither active nor passive forces [powers], whereas the\nforms by reason of which the simple bodies are elements must\nnecessarily be active and passive (Averroes, SC GC En, 124) (SC GC Ar,\n30: 2–5). \n\n\nWhen it comes to the Middle Commentary, and to the words of Aristotle\ndescribing “hot and cold” and “dry and moist”\n(GC 329b 24–26), Averroes reflects on the sense of the terms and\nexpresses his doubts about their right meaning. Their description does\nnot match the meaning that the term has in the colloquial language,\nnor the various meanings collected by lexicologists, and maybe those\nwho theorize about them, understand them differently, he doubts.\nFinally, Averroes writes that “hot and cold” and\n“dry and moist” are\n\n\nThings whose existence in these qualities is evident in itself, i.e.,\nthese actions described by them [are evident]; the descriptions are\ntaken from their properties. However in that [the Greek] language they\n[the descriptions] happen to be generally accepted and intellectually\napprehended which prove the names given to them. For us they are only\nintellectually apprehended (maʻqūl), not generally\naccepted (mashhūr) (Averroes, MC GC Ar, 92: \n  5–8).[13]\n\n\n\nTherefore, Averroes will use “hot and cold” and “dry\nand moist” only as intellectually apprehended concepts, namely,\nprimary contrarieties and consider them “the specific\ndifferences (fuṣūl) of the elements”\n(Averroes, MC GC Ar 2005, 92: 9). Averroes does not deny the primary\ncontrarieties to be powers, but in the Middle Commentary, he\nunderlines the genus/species classification. The Short Commentary\nfollows the line of the primary contrarieties and produces following\nsyllogism:\n\n\n[Minor premise] These four bodies are those bodies in which the\nprimary contrarieties exist and their number is equal to the number of\nthe possible compositions of the primary contrarieties.\n\n\n\n[Major premise] The bodies in which are existing those primary\ncontrarieties and whose number is equal to the number of the\ncontrarieties are the elements.\n\n\n\n[Conclusion] Therefore, the elements are those bodies and their number\nis equal to the number of those bodies (Averroes, SC GC Ar, 35) (SC GC\nEn, 127).\n\n\nThe Middle Commentary does not make recourse to the syllogism but both\ncommentaries agree on the conclusion “that all bodies are\ncomposed out of all of the four bodies which are called\nelements” (Averroes, MC GC En, 96). Quantities of fire, air,\nwater, and earth – even minimal parts-- are the ultimate\ncomponents of tissues and limbs, or organs.\n\nSince Averroes was very aware that any philosophical enquiry is about\ncauses, this was also the case in the investigation concerning the\ngenerated and corruptible beings. The elements are composed of matter\nand form but they cannot be generated out of one another, nor can they\ncombine with each other and generate composite bodies unless the third\nprinciple intervenes, and this principle is the efficient cause\n(fāʻil) . The efficient cause is present in all\nchanges, and requires a previous local motion. There is a local motion\nwhich is inherent, natural to each kind of element, and another which\nis external. The latter brings two elements in contact, one acts and\nthe other reacts, so that a mixture is produced. The mixture is the\nlast condition for the coming-to-be or perishing of the elements.\nAristotle and his disciple, Averroes, were convinced that the\nexplanation should be true.\n14. Alteration, Growth, Nutrition\n\nThe Middle Commentary on De generatione et corruptione is\nsystematic in organizing Aristotle’s original. As in the case of\nthe Middle Commentary on the Physics, Averroes draws a\nsynopsis, where he divides the content into the 2 books,\nmaqāla, each one into sections, jumla, and some\nof the jumla into chapters, faṣl, following\nthe method of the divisio textus. Averroes paraphrases GC\n314a 1–4 in I.1 and writes that Aristotle’s purpose was\n“to explain the causes that are common to all naturally\n(bi-l-ṭabʻ) generable and corruptible\nthings to explain as well the causes of growth and alteration”,\n(Averroes, MC GC Ar, 2: 3–4) (MC GC En, \n 4).[14]\nNatural here opposes artificial.\n\nTherefore, Averroes and Aristotle agree in separating change in place\nfrom the three other kinds, and they want to look into the common\ncauses of the three. Coming-to-be has been analyzed above, alteration\nand growth remain to be. Alteration (istiḥālah) is\nchange in quality, in which the underlying subject, or substratum\n(mawḍūʻ) remains one and the same throughout\nthe process. The mawḍūʻ is “a definite\nthing existing in actuality” and there are plenty of examples\n(Averroes, MC GC En, 24) (MC GC Ar , 30: 6). There is not much\ndiscussion about alteration.\n\nGrowth and its opposite, diminution, come to the fore and are easy to\nunderstand, because they affect the animated beings\n(emphsykha) and these changes are at the very essence of life\nand death. Aristotle treated the subject in other places, De\nanima, Generation of the Animals, Parts of the Animals,\nbut in GC I.5, 320a 5 – 322a 33, he discussed growth in contrast\nto coming-to-be and alteration. The passage was commented by\nAlexander, whose text was known to Averroes but not to us; we have to\nrely on Philoponus who also discusses the issue of growth at length in\nhis own commentary on GC (Philoponus GC Gr 1897, 69: 27–123: 26), as\nan indirect source.\n\nAny explanation has to look for the material, formal and efficient\ncause of the investigated object. Aristotle observed that\n“Matter in the chief and strictest sense of the word is the\nsubstratum which admits of coming-to-be and passing-away; but the\nsubstratum of the other kinds of change is also in a sense\nmatter” (GC 320a 2–4) (GC Forster 1955, 203), but as for\n“in which sense” he left the question open. Maybe this was\nthe reason why Averroes introduced the notion of corporeality in\nanswering it:\n\nThe corporeality (jismīya) which is common to all that\nis generated in substance, is one in number in potentiality, not in\nactuality, while the corporeality which is the substratum for\nalteration is one in number in actuality (Averroes, MC GC Ar, 32: 2–4)\n(MC GC En, 26).\n\n\nThe editor, Eichner, as well as the translator, Kurland, draw the\nattention of the reader to the fact that the whole paragraph\n(Averroes, MC GC Ar 2005, 32: 1–12) is missing in the Hebrew and Latin\ntranslations, and in the Arabic manuscript (Oxford Bodleian 34) and\nthat it appears in the body of one Arabic manuscript (Paris 1009) and\nin the margin of another (Modena 13), so that one doubts whether\nAverroes is the real author but, in any case, the explanation is\nhalf-finished.\n\nPhiloponus had said “The matter of corporeal substance is one\nthing, that of growth another (Philoponus GC En 2013, 116)”, but\nhe saw that the distinction was purely “in definition”\n(tōi logōi) following Aristotle GC 320b 24.\nAverroes knew it and sets forth that growth takes place “out of\na body existent in act” (MC GC Ar 2005, 38: 6). He then\nconsiders the difficulties already raised by Aristotle because of this\nstatement. The solution to the problem is obtained by means of\nexamining how growth occurs. Aristotle discerns three characteristics:\n\n\n(a) Every part of the growing magnitude is larger—for instance,\nif flesh grows, every part of flesh grows; (b) it grows by the\naccession of something; and (c) that it grows because that which grows\nis preserved (sōzomenon) and remains (Aristotle, GC\nForster 1955, 213).\n\nIn Averroes’ paraphrase of the passage, (a) reads more specific\n“every drop and every perceptible part grows in the same manner,\nand likewise, when it diminishes, it does in every perceptible\npart”. Characteristic (c) reads also differently: “the\nthing which is characterized by growth and diminution must be definite\n(mushār ilayhi) and remain identical” (Averroes, MC GC Ar\n2005, 39). Averroes makes clear that growth is not an increase in\nvolume, and that the homoeomerous bodies play the key role.\n\nThe Aristotelian tradition consider the organic tissues, like blood,\nflesh, or bones, but also, minerals, like gold or silver, homoeomerous\nbodies. They are composed of the four elements and the composition is\nin accordance with a blend specific to each body. The living being\ngrows when their tissues, i.e., their homoeomerous bodies, increase\ntheir size. Certainly, the existence of principles or causes is known\nin the case of growth as it was made clear in the case of the four\nelements: they were the material, formal and efficient cause. \n\nAverroes understands that growth occurs primarily (awwalan)\nin the homoeomerous bodies, which are matter for the organic\n(āliyah) bodies, while these organs, or limbs, grow\nthrough growth occurring in the homoeomerous tissues (Averroes, MC GC\nEn, 33) (MC GC Ar, 41: 9–10). And so, Aristotle saw that the\nhomoeomerous bodies interact as material and formal causes, “for\nthe form as well as the matter is called flesh or bone” (GC 321b\n20–22).\n\nMatter is fluid (sā’il) and form, persistent\n(thābit) and so, form is determinant; the form of flesh\nor bone determines the homoeomerous body. As the magnitude is not\nunchanging, growth needs food to be brought in from the outside, and\nfood must give up its specific form and become flesh or bone\n“through a process of mixture” (Averroes, MC GC En,\n39).\n\nAverroes faces an objection by Alexander of Aphrodisias concerning the\nassimilation of the food; the passage has been thoroughly studied by\nEichner (Averroes, MC GC Ar 2005) who translated all the relevant\ntexts. Alexander was awfully admired by Averroes but was criticized by\nthe latter in his Middle Commentary. Alexander—according to\nAverroes—sustained that there is a moisture, or humidity\ndispersed (mabthūtha) throughout all of the limbs, that\nthe incoming food mixes with it and that as a result, food is\ntransformed into the “nature of this\nmoisture” (ṭabīʽa tilka\nl-ruṭūba) (MC GC Ar 2005, 44: 2). Its increase is\ngrowth and its decrease, diminution, but the shape of the limbs is\nstable. If this account—such as it is given in the Middle\nCommentary—were Alexander’s, then Averroes’ critique\nwould be permissible from his point of view, because the doctrine\nwould be valid only for things undergoing mixture (MC GC Ar, 48: 16).\nIt seems more adequate to regard Alexander’s physiological\nexplanation as insufficient.\n\nPhysiology set apart from the discussion, philosophy is that which\nmust give a comprehensive explanation using the instruments available\nto the philosopher, i.e., the distinction between matter and form,\nbetween being itself, per se and qua,  min\njihatin mā, and between quality and quantity. Form per\nse does not grow but insofar as it is quantity endowed with form,\nit does (MC GC Ar, 45: 2). Matter qua matter, i.e., per\nse cannot grow but in so far as any perceptible part possesses\nmatter, it is needed and present. Averroes concludes:\n\nThe Master indeed did not mean to say that growth takes place in the\nform to the exclusion of the matter, nor in the matter to the\nexclusion of the form, but he did mean to say that growth takes place\nin all parts of the growing thing due to their form, not due to their\nmatter by virtue of which they are parts (Averroes, MC GC Ar 2005, 46\n18 – 47 2) (MC GC En 1958, 37).\n\n\nSince the participation of the material and formal principle has been\nclarified, we should proceed with analyzing the efficient cause with\nrespect to growth, that Aristotle considered in GC 320b 17–22 and\nagain in GC 322a 28–33. Let us not forget that Aristotle placed the\nprinciple of motion, (arkhē tēs kinēseōs,\nmabda’ al-taḥrīk ) i.e., the efficient cause\nof alteration and of growth in the thing which undergoes alteration or\ngrowth (321b 6–10). \n\nGrowth and nutrition are intrinsically linked to life, and require the\nvegetative soul investigated by Aristotle in De anima II 4\n(416b 18–31). The vegetative soul is also generative\n(psykhē genetikē), producing the power to grow\n(dynamis auxētikē). Joachim identified the form of\nthe growing thing with this power in his commentary on GC 322a 28–33\n(GC Joachim 1926, 135–136) and so did Averroes. He says that the\ngrowing thing has a power due to which it has a form. It is\n“endowed with form” (dhū ṣūra),\nso that “Were it not for the presence of that force in the\ngrowing thing, growth in all the sensible parts of the growing thing\nwould be impossible” (Averroes, MC GC En 1958, 38) (Averroes, MC\nGC Ar 2005, 48 13–15) .\n\nOn the other side, Aristotle mentioned the efficient cause of\ncoming-to-be in 320b 17–22, although in a generic way. Philoponus\ninterpretated it as something applicable to growth too (Philoponus\n2013, 114–115) and introduced the strict term, poiētikon\naition (Philoponus CAG 1897, 83: 25–26).\nAverroes follows him and compares coming-to-be and growth with respect\nto the efficient cause (sabab fā‛il) (MC GC Ar,\n37: 9–15) arriving at the conclusion that the efficient cause is not\nonly in the growing thing but also of the same species as its parts.\nAverroes has set forth the material, formal and efficient causes in\nthe processes of growth, and diminution, as close as possible to\nAristotle, which was his purpose. The preeminence of form has shown in\nmany aspects, that of principle of life being indisputable.\n15. Movable and Mover\n\nBook VII begins with the statement “Whatever is moving must be\nmoved by something” (Phys. 241b24), and Averroes\ncomments on it: “In this treatise [Aristotle] searched whether\nevery movable has a mover”, and he points out that Aristotle has\nin mind those movables in which the mover is not clearly distinguished\nfrom the movable, “as in the four elements” (ut\nin, LC Schmieja7 1:20–2:1; absque, “except\nfor”, LC 306B\n T1).[15]\n\nLater, in Book VIII, Averroes considers that Book VII did not deal\nwith motion because of ‘leaning’ in particular, and that\nBook VIII finishes the task. In this book he classifies essential\nmotions in two kinds: violent and natural, and he divides the latter\nin ‘motion because of the soul’ and ‘motion because\nof leaning’ (declinatio: Arabic mail), which\nincludes gravity and levity, that is, the motion of the elements to\ntheir natural place (LC 366D TC28). Since natural motion of the four\nelements seems to happen by itself, Aristotle put forward several\narguments to prove that they are not moved by themselves\n(Phys. VIII, 255a1–b30) but the chapter ends\nacknowledging that “[the element] possesses a principle of\nmotion in itself, although not of setting in motion nor of acting but\nof being affected”.\n\nAverroes examines the sentence and interprets it in a sense that he\nconsiders to be Aristotelian. The simple element has two movers, an\nessential and an accidental one (LC 370B TC32). What moves essentially\nis\n\n\nthat which is external, that is, the generating [cause;\ngenerans : mukawwin] and the generating\n[cause] is that which gives its form and all the accidents resultant\nfrom the form—one of which is the local motion—to the\ngenerated simple body. (LC 370G\n TC32)[16]\n\n\nGenerating acts upon matter and in this manner, Averroes places the\nprinciple of motion in it, because matter is “that in which the\ntrue potentiality for motion is, that is, the potentiality for\nreceiving motion” (LC 370H). The issue was of import in Arabic\nand Jewish natural philosophy (MC Wolfson 669–675), while the\nLatin thinkers were most interested in the question how the four\nelements remain in the mixture, a question that Averroes also wanted\nto answer (Maier 1952: 28–31).\n\nAverroes discusses two points related to the mentioned issue of how\nthe four elements are moved. First, Galen maintained that the\narguments brought to support the thesis “Whatever is moving must\nbe moved by something” are false. Second, other commentators\nconsidered Book VII redundant, because VIII deals with the same\nsubject in a more comprehensive way (LC 306C; LC Schmieja7\n2:1–4), and actually, Book VII pleads that there is a first\nmover which is not moved by anything else. Averroes’ discussion\ngoes as follows:\n\n1) To prove that “Whatever is moving must be moved by\nsomething”, Aristotle chose a body “A_B which is moving\nper se, and not by virtue of some part”\n(241b37–38). Averroes carefully distinguishes movable\nessentially, per se or accidentally, per accidens\nand movable as a whole or by virtue of some part (LC 306F; LC\nSchmieja7 2:19–3:1). He gives us an instance of that which moves\nby itself but not as a whole:\n\n\nThus the first essentially movable (primum motum) in animals\nis the heart which does not move as a whole, because one part of it\nmoves itself, and moves the whole. (LC 306F; LC Schmieja7\n3:1–3)\n\n\nThe whole does not move itself, only one part moves essentially, but\nthe whole here is a composite the parts of which are continuous.\n\nAristotle argued that if a body moves as a whole, primarily and\nessentially, it need not stop moving because something else has\nstopped moving. And if something is at rest because something else has\nstopped moving, that thing must be moved by something (Phys.\nVII.1, 241b44 [Ross 1936: 419).\n\nFor Averroes, Galen and others misinterpreted Aristotle. They\nidentified that which is only contrary to that which moves\naccidentally with that which moves essentially (LC 307H; LC Schmieja7\n6:3–6). Indeed that which moves essentially (and as a whole) is\nopposed to that which is moved by virtue of one part of it. In\nGalen’s view, if one part of a movable would come to rest, the\nwhole should not. In the case of the heart of the animals, Galen\ncontested the doctrine that it is the first movable because when the\nheart is removed, the animal is still capable of walking two steps.\nGalen claimed that the head is the source of motion, but Averroes\nobjects “I saw a ram walking after the head was cut off”\n(LC 309C TC4; LC Schmieja7 11:21–22). But there are primary\nmovables that fulfill these conditions and it is worth quoting\nAverroes’ words:\n\n\nThere must be here first movables because natural bodies do not divide\ninfinitely into that for which they are natural bodies, e.g., because\nthe first movable in fire is the minimal part that is capable of being\nfire in actuality. (LC 307I TC2; LC Schmieja7, 6:10–13)\n\n\nAristotle’s arguments were not very satisfying and the question\nwhich are the bodies moving per se and as a whole was not\nanswered. Galen considered that the arguments were flawed, but\nAverroes would never accept that Aristotle was wrong and made an\ninterpretation, that we cannot guess whatever the Master would agree\nupon.\n\nRuth Glasner has shown evidence that Averroes borrowed the notion of\nminimal parts from Alexander; she stresses the import of the new\ndoctrine that “bridges the gap between the two opposing systems,\nthe Aristotelian and the atomistic” (Glasner 2009:\n146–159). Whether the smallest part actually exists or it is the\nlimit of divisibility is something that Averroes does not answer. The\ncontext, however, hints at the second direction.\n\nTherefore, Averroes sees the Book VII essential in order to prove that\n“Whatever is moving must be moved by something” and the\nLatin medieval philosophers will make of the statement Omne quod\nmovetur necesse est ab aliquo moveri a basic principle of\nmedieval physics.\n\n2) At the beginning, Averroes complained that some commentators\nconsidered Book VII superfluous, and in LC 312C TC9 (LC Schmieja7\n20:15–18), he refers to Themistius as the main one. The final\narguments of Phys. VII.1 establish the impossibility of an\nendless succession of movables and movers and, by reductio ad\nabsurdum, the necessity of a first mover. Consider the\nfollowing version of Isḥāq’s passage 243a3–4\n(textus alter): “The first mover is not such because it is\nthat for the sake of which [motion happens] but because it is that\nfrom which the source of motion is” (LC 311H;\nṬabīʻa [1964: 746: 3–6]). However M.\nScot translates the passage differently: “The first movable is not\nsuch because it is that for the sake of which [motion happens] but\nbecause it is that from which the source of motion is” (LC 311K; LC\nSchmieja7 18:18–20). Averroes’s copy of the\nPhysics was wrong and he hesitates: “Maybe there is an\nerror by the copyist, who should have placed the term\n‘mover’ instead of this term ‘movable’”\n(LC 312 AB; LC Schmieja7 20:3–4 [more precise to my view]).\n\nIn spite of the hesitation caused by the wrong term, Averroes\ninterpreted that Aristotle distinguished here between a mover setting\nin motion as a final cause or as an efficient cause (quasi\nagens), and that Book VIII would clarify the matter concerning\nthe first mover. He was even more certain in asserting that Book VIII\nwould inquire about first motion, whether it is eternal or generated,\nand he rejected Themistius’ view that Book VII was superfluous\nfor this reason.\n16. Qûwa as Force\n\nPhysics VII.5 (249b27–250b10) discusses some problems\nof simple mechanics (Lettinck 1994: 559–561). The moving-agent\nis always moving something in a certain time and a certain distance,\nand Aristotle presumes here that motion here is at a constant\nvelocity. There is a relationship between the four factors, for\ninstance if A sets B in motion over a distance\nC in time D, A will move half B\nover the distance C in half the time D, because\nthere is a proportion between the force of A and the load of\nB. Aristotle sees limits to the interchange because “it\nmay well happen that it [a fraction of A] cannot move\nB at all” (250a15–16). Thirty men can tow a ship\nover a distance and in a time, but one man cannot tow it either over\nany distance or in any time. He also faces Zeno’s contention\nthat every grain of millet must make a sound when it falls as the\nwhole measure does stirring the air and answers that the grain is part\nof a whole and that the whole is the moving-agent.\n\nThe wording was not clear and the commentators made their contribution\nto explain it. Averroes, in his turn, insisted that Zeno’s\ndiscourse is fallacious because “one part does not set in motion\nin actuality, but it does in potentiality within the whole” (LC\n336F TC37; LC Schmieja7 79:7–8). Moreover, he set two\nconditions, the movable has to be “prepared”\n(præparatum) and the power of the mover has to be\n“complete” (terminatum).\n\n\nOne man out of the thirty does not set the ship in motion on his own,\n[but] when his moving action (motio) joins the preparation\nand the\n power[17]\n coming from the 29 men, [he] will necessarily set in motion the whole\nship; therefore each of the 29 gives to the ship a preparation to move\n(moveri) that it did not have before. (LC 336G; LC Schmieja7\n79:8–12)\n\n\nAverroes sees the same process in the falling grain of\n millet.[18]\n Each grain cannot move the air on its own and make a sound. But each\ngrain gives the necessary preparation to the air. When the last added\ngrain passes the threshold and power is complete, the air is stirred\nand a sound is made. This last part is not stronger than the others,\nbut it definitely causes motion “because of the preparation made\nin the movable” (LC 336H; LC Schmieja7 79:8). Although he does\nnot explain what “preparation” is, we can gather that it\nis a kind of potential energy. And as for the notion of\n“complete power”, Averroes seems to intend kinetic\nenergy.\n17. First Movable, First Mover, Eternal Motion\n\n1) Aristotle begins his Book VIII of the Physics raising the\nquestion whether motion has come into being and will cease to be, or\nis eternal “belonging to all beings as their immortal and never\nfailing property” (250b13–14). In order to answer it, he\ndevelops various arguments the main one being based on the definition\nof motion as the actualization of the movable in so far as movable\n(251a10). If there was a first motion, and since any movable requires\na mover, there must have pre-existed a mover and a movable, something\ncapable of setting fire and something capable of burning, for\ninstance. If these have come into being, there must have been a change\nbefore the supposed first change that brought them into existence. If\nthey pre-existed without change occurring, a previous change must have\noccurred that set them into the condition of moving and being moved.\nBy reductio ad absurdum, it is proved that motion has always\nexisted.\n\nAristotle ends up by identifying eternal motion with a specific motion\nthat of the heavenly sphere, but in doing this he jumps from a\nphilosophical to a scientific explanation, and the leap is scarcely\njustifiable. He can only assume that a single eternal motion exists\n(Ross 1936: 91). Glasner describes it as Aristotle’s failure to\novercome the so called succession argument (Glasner 2009: 76).\n\nThe Greek commentators concentrated on whether potentiality has to\nprecede motion or is simultaneous with it, and Philoponus adduced\nheavy arguments against potentiality preceding motion (Puig Montada\n1999). Averroes followed the tradition of those commentators for a\nlong time, he knew well the contributions by al-Fārābī\nand Avempace to the discussion and he sided with them. The beginning\nof the Long Commentary hints at it:\n\n\nSince [Aristotle’s] purpose is to inquire about the first mover,\nhe begins by inquiring about motion, whether it is eternal or\ninnovated, that is, according to the genus, and that which precedes\nthis treatise, either is necessary to this section, or is for the sake\nof better. And when he said “Whether motion”, he did not\nmean any specific (proprium) motion, but he wanted to know\nwhether those motions existent in the parts of the universe came to\nbe, after no part of the universe moved at all, etc. (LC 338FG TC1;\nSchmieja8, 2: 2–7 MC Glasner 94–95)\n\n\nIn the same chapter, however, Averroes gives up this interpretation\nthat he considered to be what he calls “at first glance”\n(in primo aspectu, LC 339A). After long investigation he\ngained the deeper and true meaning of Aristotle’s words: The\ninquiry about motion concerns that motion embracing the universe, or\nmaybe several motions (if it is proven that the heavenly spheres have\nseveral movers), that is, it concerns one species of motion, and wants\nto know if it is eternal or innovated (LC 339C).\n\nOf course, Averroes was wrong with his new interpretation of Aristotle\nbut the new interpretation helped him to design his vision of the\nuniverse, and to counter the attacks of the Ashʻarite theologians\nagainst the eternity of creation. If a particular motion precedes\nanother one, the resulting succession, or\n continuity,[19]\n is purely accidental for Averroes and it is no basis for the\nargumentation conducted by al-Fārābī, Avempace, etc. On\nthe contrary the eternal motion of the heavenly spheres possesses\ncontinuity per se, while the rest of motions possess\naccidentally.\n\nAn objection could be raised against the new interpretation, and\nindeed it had been raised by al-Ghazālī (d. 1111 CE) in his\npolemical writing The Incoherence of the Philosophers\n(Ghazālī [2002]). Potentiality has to precede motion, as\npotentiality precedes the act; Averroes agrees with the tenet but\nrestricts it to the sublunary world, to innovated motions. The rule of\ntemporal priority does not apply to “motion as motion, but to\nsomething innovated as innovated” (novo facto, LC\n341IK).\n\n2) Aristotle argues for eternity also from the angle of time,\nendorsing the common belief that “there is always time”\nand in Physics VIII.1 he concludes that it has been\ndemonstrated that there never was nor will be a time when motion was\nnot or will not be (252b5–6). Aristotle rejects the views of\nAnaxagoras and Empedocles (252a5–b5). For Anaxagoras there is a\nsingle principle of motion, Mind; for Empedocles Love and Strife\nalternately prevail and cause motion. Averroes points out two\ninconsistencies of their views. First, the laws of Nature do not\nadmit, “something to be possible for an endless time in the\npast, and then to be brought into existence” (LC 349H TC15) and\nsecond, its laws rebut that the mover and the movable are at rest for\nan endless time and that then, at a given moment, motion starts.\n\nAverroes compares Anaxagoras and Empedocles with the Ashʻarite\ntheologians, who introduce the Divine will instead of Nature as the\nmoving agent, “they establish a voluntary mover” (LC\n349I). The discussion goes at length (LC 349I–350L) and\nparallels that of the First Question in the Incoherence of the\nIncoherence. Averroes denies that an eternal will can originate a\ntemporally initiated action (actio nova). If the will is\neternal, the willed object has to be eternal, and vice\nversa.\n\n\nThe will does not postpone what it intends except because some cause\n(intentio) exists in the willed thing that did not exist at\nthe time of [the action of] willing and if [that cause] was not there,\nthat which is willed must be together with the will. If we would\nassume that there is a will in which the delay of the willed is\npossible, this would occur because something exists that did not exist\nbefore, i.e., because some cause, or disposition, was absent. There\nwould be neither time nor anything because we affirmed that this will\nis the first motion, and it is obvious that this willed object must be\ntogether with the will. Therefore if we would affirm that the will is\neternal, the willed would be eternal. (LC 349LM; Schmieja8, 43: 21–44: 6)\n\n\nThe world of coming-to-be and passing-away shows however that there is\nrest and that motions start and end. We see innovated events. Averroes\nmakes an exception to explain the apparent contradiction: The will can\nprecede the willed object through an infinite time although in an\naccidental way and this is “clear to those who know the\ndifference between essentially and accidentally” (LC 350C). An\nintermediate motion is the key solution and the motion he considered\nwas that which Aristotle searched for in Book VIII, i.e., the specific\nmotion of the heavenly spheres.\n\nThe theologians argued that an endless chain of motions was impossible\nand that a first motion had to be created anew (ex novo).\nAristotle argued that motion is generically eternal since no beginning\ncan be determined. The former had a linear image of eternity and the\nlatter, a circular one. Averroes stepped in with an original proposal:\nthe succession of motions is accidental, not per se. But any\naccident presupposes a propriety to which is related. The heavenly\nmotion is eternal per se and it is the reference to the\naccidental eternity. Averroes answers the Ashʻarites:\n\n\nWe say that it [succession of motions] is essentially impossible, not\naccidentally, that is, if there was an agent whose being has no\nbeginning, it resulted that his actions have no beginning. (LC 350D;\nSchmieja8, 40: 14–17; MC Glasner 82; MC Wolfson 495)\n\n\nand this kind of eternity is essential.\n18. The Incorporeal First Mover\n\nAristotle reduced all kinds of change to local motion, and then to\ncircular motion, up to the eternal motion of the universe the mover of\nwhich could not be movable at all.\n\nChapter 10 of Book VIII (266a10–267b26) accomplishes the\nidentification of this unmovable mover: It has no parts nor magnitude\n(megethos), it is not material, it exerts an infinite force.\nWe face Aristotle’s statement that “nothing finite can\nproduce motion for an infinite time” (266a12–13) and\nIsḥāq translated it faithfully: “nothing finite can\nmove anything for an infinite time” (Aristotle,\nṬabīʻa [1964: 924]). Nevertheless M. Scot\nmade a translation where he clarified the term “finite”:\n“a finite mover cannot produce motion for an infinite\ntime” (LC 423C). The principle is followed by two statements: no\nfinite magnitude can have infinite force, and no infinite magnitude\ncan have finite force (Ross 1936: 721). The statements fostered an\nintense discussion in Averroes’ Long Commentary. Averroes,\nfollowing Aristotle (266a15–23), shows the inconsistencies of\nsupposing a finite mover causing motion for an infinite time (LC 426BG\nTC79). As for the second statement (266a26–b6), Averroes again\nfollows Aristotle and says that a body or a corporeal power does not\nhave an infinite action, therefore the mover with an infinite power is\nnot a body (LC 426G).\n\nHowever, doubts can arise whether the proposition that all body has\nonly finite power applies to the celestial body or not (LC 426H). If\nit applies, the celestial body has a finite power, and it is\ndestructible. If it does not, the resulting motion will be\ninstantaneous. The issue is very difficult and very exhaustive\n(multum scrupulosa, LC 426K). Averroes knows the opinions of\nAlexander of Aphrodisias, Johannes Philoponus and Avicenna. Alexander\naffirmed that the celestial body acquires eternity from its mover;\nPhiloponus denied it and sustained that it is corruptible because its\npotentiality, power, is finite. Avicenna would follow Alexander and\nclaim that the heavens are necessary because of another but its movers\nare necessary because of themselves, and we understand: they are\neternal (LC 426LM). Then Averroes expresses his view on the celestial\nbody and its potentiality:\n\n\nBut we say that from the meaning (ex vi) of Aristotle’s\nwords in this demonstration it appears that its passive—that is,\naccepting motion—potentiality is\n infinite[20];\n like an infinite action is not infinite because of a form in a body,\nan infinite affection is also not because of a form in a\nbody—that is, a composite of matter and form. (LC 426M;\nSchmieja8, 301: 22–302: 4)\n\n\nForm always has a finite potentiality because it is divisible, and it\nis divisible because the body of which it is the form, is divisible,\nand the body is divisible because it is finite yet. The celestial body\nis finite but its motion is eternal. Averroes finds a way-out of the\nconflict: the celestial body is not composed of matter and form, it is\nsimple, and no material form exists in it (LC 427BC; MC Wolfson 594)\nwhile form in material substances subsists because it is part of the\ncomposite. By exclusion we can conclude: the celestial body is an\nimmaterial form.\n\nAverroes recalls that in De caelo (in particular I.5–7)\nAristotle had stated that the potentiality of the heavenly body was\nfinite. An active, moving potentiality can be said to be infinite in\ntwo aspects: because its activity never ceases or because it produces\nmotion at an infinite velocity, so that there cannot be any higher\nvelocity. The heavenly spheres rotate at different velocities,\ntherefore their motions are finite in the second aspect, i.e., in\nintensity, and they are not caused by an infinite potentiality.\nAverroes infers that Aristotle intended this meaning of\n‘finite’ when he spoke of finite potentiality in the\nheavens (LC 427BD; Davidson 1987: 321–331).\n\nNo doubt, Aristotle did not make it easy for Averroes who complains\nhow long he took great pains to find the explanation (cum grande\nlabore et in tempore vitae meæ non modico LC 427D;\nSchmieja8, 303: 13–14). But once proven that the first mover is not a\nbody, it becomes easier: the First Mover does not need to be affected\nby the mentioned restrictions of corporeal movers, and it can produce\nmotion for an infinite time. And the First Mover becomes a\nmetaphysical principle like Prime Matter.\nFinal Remarks\n\nThe natural philosophy of Averroes goes far beyond paraphrasing\nAristotle’s texts; it echoes the discussions of the Greek\ncommentators, and the Arab philosophers on key issues. Furthermore,\nAverroes faced in his lifetime the challenge of Islamic jurists and\nAshʻarite theologians. First of all, Averroes had to legitimate\nthe study of philosophy and the consistency of its doctrines. His\nprologue should be understood not only as an outline of his doctrine\nof natural science but also as a defense of philosophy: Philosophy\ngrants man his intellectual perfection, and true happiness.\n\nAverroes’ views often respond to a dialectical treatment of the\nsubject. Aristotle’s natural philosophy deals with Prime or\nfirst Matter as one of its two main subjects, the First Mover being\nthe other. The existence of Prime Matter is in the root of a conflict\nwith the Ashʻarite theologians who affirm changes out of a\nnon-existent subject, and Averroes can rely on Aristotle to rebuke\nthem.\n\nAvicenna did not see himself in Aristotle’s debt and his science\nof the Divine Matters, what may be translated as metaphysics,\ncontained an original doctrine of being. Avicenna allocated a role to\nthe metaphysician in proving the existence of Nature or the\ncomposition of matter and form in bodies and Averroes did not admit\nsuch a role. Averroes’ tense relationship with Avicenna shows up\nalso in their disagreement upon the existence of corporeal form, or on\nthe extent of necessity in Nature.\n\nThe definition of motion or change is no doubt one of the key issues\ndiscussed by Averroes. Averroes decides on motion as an incomplete\nstate of each of the categories of substance, quality, quantity and\nplace, not as a category in itself and he paves the way for a medieval\ntheory of motion.\n\nAverroes followed Aristotle in the rejection of atomism and the\ndefense of the continuum in motion, place and time. However,\ncontinuity cannot explain all aspects of change and Averroes\nformulates an original doctrine of minimal breaks. Moreover, the so\ncalled “perceptible parts” are essential to growth, and\neven to coming-to-be. C. Cerami pointed out that growth, for Averroes,\nrequires “minimal parts endowed with a finite quantity”\n(Cerami 2012, 160) and then she discussed the issue of their\nontological status. Averroes did not go into the insoluble problem of\ncontinuity versus atomism, but he focused on the efficient cause of\ngrowth and nutrition: There is a power in the growing thing because of\nits form.\n\nThe main conflict with the Islamic theological tradition concerns the\neternity of creation. Averroes interpreted Aristotle’s argument\nof Physics VIII.1 in such a way that the continuity of the\nfirst motion was intended instead of motion in generic terms. This\nallowed him to disable the argument for a limit in the succession of\nmotions and to maintain that the chain of motions is only an\naccidental manifestation of the eternal motion of the heavenly body.\nFurthermore, proving the incorporeality of the First Mover is the\nfinal contribution to the theological view of the universe, from which\nnatural philosophy cannot be isolated.\nAbbreviations\nPhysics\n\nLong commentary: Latin translation by Michael\nScott\n\n[LC] Aristotelis opera cum Averrois commentariis: Quartum\nvolumen, Venice: Apud Junctas, 1562–1574, R Frankfurt am Main:\nMinerva, 1962, ff. 1–433vº. Citations consist first of an\nnumber and a letter, for instance 36A. The number indicates the folio\nand the letter, its division, from A to M; the second part of the\ncitation, for instance TC60, refers to the commented paragraph.\n[LC Schmieja7] Commentarium Magnum in Aristotelis Physicorum\nLibrum Septimum (Vindobonensis, lat. 2334), (Averrois Opera,\nSeries B), edited by Horst Schmieja, Paderborn: Schöningh,\n2007.\n[LC Schmieja8] Commentarium Magnum in Aristotelis Physicorum\nLibrum Octavum. In der lateinischen Übersetzung des Michael\nScotus, mit einer Einleitung herausgegeben von Horst Schmieja,\nFrankfurt am Main: Institute for the History of Arabic-Islamic\nScience, 2020.\n\n\nMiddle Commentary: In Arabic only the summary\n\nHebrew, 2 translators, only in manuscript form: Zeraḥya ben\nYiṣḥaq ben She’altiel, (Rome 1284) and Kalonymos ben\nKalonymos, (Arles 1317). Kalonymos’s version is used with the\nabbreviations:\n\n[MC Kalonymos L] Be᾿ur emṣa῾i ῾al Sefer\nha-shema῾ ha-ṭev῾i shel Arisṭo. The\nintermediate commentary on the Physics of Aristotle (by Averroees, and\n1 other text). British Library, Add MS 25879, copied 5241/1481.\n[MC Kalonymos O] Be᾿ur ha-shema῾ le-Aben Roshd,\nOxford, Bodleian Library, Neubauer 1380, ff. 1–99rº\n(Huntington 79; Uri 393), copied 5177/1417.\n\n\nLatin, 3 translations, but all from Hebrew:\n\n[MC] Jacob Mantino, only the first three books: Aristotelis\nopera cum Averrois commentariis: Quartum volumen, Venice: Apud\nJunctas, 1562–1574, R Frankfurt am Main: Minerva, 1962, ff.\n434rº–464rº.\n[MC Balmes] Abraham de Balmes. Vatican City, Bibliotheca\nApostolica, Vat. Lat. 4548.\n[MC Dactylomelos] Vitalis Dactylomelos, Paris, Bibliothèque\nNationale de France, lat. 6507.\n\n\nEnglish translation, fragments:\n\n[MC Glasner], Ruth Glasner, Averroes’\n“Physics” A Turning Point in Medieval Natural\nPhilosophy, Oxford University Press, 2009.\ndoi:10.1093/acprof:oso/9780199567737.001.0001\n[MC Wolfson], Harry Austryn Wolfson, Crescas’ Critique\nof Aristotle; Problems of Aristotle’s “Physics” in\nJewish and Arabic Philosophy, (Harvard Semitic series, 6),\nCambridge, MA: Harvard University Press, 1929.\n\n\nShort Commentary:\n\nArabic\n\n[SC] Averrois: Epitome in Physicorum libros. Madrid:\nI.H.A.C.-C.S.I.C. Corpus Commentariorum Averrois in\nAristotelem, A XX. Citations take the form ‘page:\nline’.\n\nComing-to-be and Passing-away\n\nMiddle Commentary: \n\nEnglish\n\n[MC GC En] 1958, On Aristotle’s De Generatione et\nCorruptione. Middle Commentary and Epitome, (Averroes’\nAristotle, Corpus Philosophorum Medii Aevi, Corpus Commentariorum\nAverrois in Aristotelem series), translated by Samuel Kurland,\nCambridge MA: The Mediaeval Academy of America.\n [Averroes [MC GC] available online].\n\n\nArabic\n\n[MC GC Ar] 2005, Mittlerer Kommentar zu Aristoteles’ De\ngeneratione et corruptione mit einer einleitenden Studie versehen\n[...]. Edited by Gudrun Eichner. Paderborn; München; Wien;\nZürich: F. Schöningh.\n\n\nShort Commentary:\n\nEnglish\n\n[SC GC En] 1958, On Aristotle’s De generatione et\ncorrvptione Middle Commentary and Epitome. Translated by Samuel\nKurland. Cambridge, MA: The Medieval Academy of America.\n\n\nArabic\n\n[SC GC Ar] 1992, Epítome del Libro sobre la\nGeneración y la Corrupción, 1, edited and\ntranslated by Josep Puig Montada, Madrid: CSIC.\n\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alawī, Jamāl al-Dīn, 1984, “Min\ntalkhīṣ al-samāՙ\nal-ṭabīՙī. Taqsīm al-samāՙ\nal-ṭabīՙī li-Bn Rushd”, <em>Majallat\nKullīyat al-Âdāb wa-l-ʻulūm\nal-insānīya bi-Fās</em>, 8: 205–245.",
                "Aphrodisias, Alexander of (c. 200 CE), [<em>De fato</em>] 1892,\n“Supplementum Aristotelicum, II.2”, in <em>Perì\nHeimarmenês</em> (De fato), by Alexander of Aphrodisias, edited\nby Ivo Bruns, 164–212. Berlin.",
                "Aristotle (d. 322 BCE), [<em>Categories, De coelo, Physics, De\ngeneratione et corruptione</em>], the numbers of I. Bekker’s\nedition (Berlin 1831–36) are used.",
                "–––, 1955, <em>On Coming-to-be and\nPassing-away</em>, translated by E.S. Forster, Cambridge, MA; London:\nHarvard University Press; William Heinemann, 1955.",
                "–––, 1964, <em>Al-Ṭabīʻa</em>\n[<em>Physics</em>], 2 volumes, edited by Abderrahman Badawi [ʿAbd\nal-Raḥmān Badawī], Cairo: Al-Dār al-Qawmīya\nli-l-ṭibāʻa wa-li-l-nashr.",
                "–––, 2021, <em>Aristotle’s</em> Physics\nVIII, translated into Arabic by Isḥāq ibn Ḥunayn\n(9th c.), edited with Introduction and Glossaries by Rüdiger\nArnzen, Berlin; Boston: De Gruyter.",
                "Arisṭāṭālīs, Arisṭū, see\nAristotle (in Arabic).",
                "Arnzen, Rüdiger (ed.), 2010, <em>On Aristotle’s\n“Metaphysics”: An Annotated Translation of the So-Called\n“Epitome”</em>, (Scientia Graeco-Arabica, 5), Berlin: De\nGruyter.",
                "–––, see Aristotle, Physics VIII.",
                "Avempace (Ibn Bâjja, d. 1138 CE), [SST] 1974,\n<em>Sharḥ al-samāʻ al-ṭabīʻī\nli-Arisṭūṭālīs</em>, edited by Majid\nFakhry, Beirut: Dār al-Nahār lil-Nashr. Pages and lines are\nindicated.",
                "Averroes (Ibn Rushd, d. 1198 CE), [DSO] 1986, <em>Averroes’\nDe substantia orbis: Critical Edition of the Hebrew Text with English\nTranslation and Commentary</em> (Averroes’ Aristotle, Corpus\nPhilosophorum Medii Aevi, Corpus Commentariorum Averrois in\nAristotelem series—versio Hebreica), edited and translated by\nArthur Hyman, Cambridge, MA; Jerusalem: Medieval Academy of America.\n [<a href=\"https://cdn.ymaws.com/www.medievalacademy.org/resource/resmgr/maa_books_online/hyman_0096_bkmrkdpdf.pdf\" target=\"other\">Averroes [DSO] available online</a>]",
                "–––, 1983, <em>Maqālāt fī\nl-manṭiq wa-l-ʻilm al-ṭabīʻī</em>,\nedited by Jamāl al-Dīn ʻAlawī. Casablanca:\nDār al-Nashr al-Maghribīya.",
                "Avicenna (Ibn Sina, d. 1037 CE), [Metaphysics] 2005, The\nMetaphysics of “The Healing”: A Parallel English-Arabic\nText, (Islamic translation series), edited by Michael E. Marmura.\nTranslated by Michael E. Marmura. Provo UT: Brigham Young University\nPress.",
                "–––, [Physics] 2009, The Physics of the\n“The Healing”: A Parallel English-Arabic Text, (Islamic\ntranslation series), 2 volumes, edited and translated by Jon McGinnis,\nProvo UT: Brigham Young University Press, volume 1.",
                "Bakker, Paul J.J.M. (ed.), 2015, <em>Averroes’ Natural\nPhilosophy and its Reception in the Latin West</em>, Leuven: Leuven\nUniversity Press.",
                "Cerami, Cristina, 2012, “Mélange, minima naturalia et\ncroissance animale dans le Commentaire Moyen d’Averroès\nau <em>De generatione et corruptione</em> I.5”, in <em>La\nNature et le Vide dans la physique médiévale</em>, by\nJoël Biard and Sabine Rommevaux, Turnhout: Brepols, 137–164.",
                "–––, 2015, <em>Génération et\nsubstance. Aristote et Averroès entre Physique et\nMétaphysique</em>, (Scientia Graeco-Arabica 18), Berlin: De\nGruyter.",
                "–––, 2018, “A Map of Averroes’ Criticism\nAgainst Avicenna. Physics, De Caelo, De Generatione et Corruptione,\nMeteorology”, in <em>The Arabic, Hebrew and Latin Reception of\nAvicenna’s Natural Philosophy</em>, A. Bertolacci and D.N.\nHasse, Berlin: De Gruyter, pp. 163–240.",
                "Davidson, Herbert A., 1987, <em>Proofs for Eternity, Creation and\nthe Existence of God in Medieval Islamic and Jewish Philosophy</em>,\nOxford: Oxford University Press.",
                "Eichner, Heidrun (ed.), 2005, <em>Averroes (Ibn Rushd, Abū\nl-Walīd Muḥammad) Mittlerer Kommentar zu\nAristoteles’</em> De Generatione et Corruptione, <em>mit einer\neinleitender Studie versehen, herausgegebenn un kommentiert</em>,\nPaderborn: F. Schöningh.",
                "Freudenthal, Gad, 2010, “A Response to Trifogli on Glasner,\nAverroes’s Physics”, <em>Aestimatio</em>, 7: 229–231.",
                "Ghazālī, Abū Ḥāmid Muḥammad al-\n(d. 1111 CE), 2002, <em>The Incoherence of the Philosophers</em>\n(Islamic translation series), second edition, translated by Michael E.\nMarmura, Provo, UT: Brigham Young University.",
                "Glasner, Ruth, 2009, <em>Averroes’ “Physics”. A\nTurning Point in Medieval Natural Philosophy</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199567737.001.0001",
                "Harvey, Steven, 1985, “The Hebrew Translation of\nAverroes’ Prooemium to his ‘Long Commentary on\nAristotle’s Physics’”, <em>Proceedings of the\nAmerican Academy for Jewish Research</em>, 52: 55–84.\ndoi:10.2307/3622702",
                "Hyman, Arther (trans., ed.), 1986, “Introduction” to\nAverroes’ <em>De substantia orbis</em>: Critical Edition of the\nHebrew Text with English Translation and Commentary, Cambridge, MA;\nJerusalem: Medieval Academy of America, pp. 13–35.\n [<a href=\"https://cdn.ymaws.com/www.medievalacademy.org/resource/resmgr/maa_books_online/hyman_0096_bkmrkdpdf.pdf\" target=\"other\">Hyman (trans., ed.) 1936 available online</a>]",
                "Joachim, Harold H., 1926, <em>Aristotle</em>: <em>On Coming-to-be\nand Passing-away</em>, edited and with an introduction, Oxford: at the\nClarendon Press.",
                "Lettinck, Paul, 1994, <em>Aristotle’s “Physics”\nand Its Reception in the Arabic World: With an Edition of the\nUnpublished Parts of Ibn Bājja’s “Commentary on the\nPhysics”</em>, Leiden: Brill.",
                "Maier, Anneliese, 1952, <em>An der Grenze von Scholastik und\nNaturwissenschaft. Die Struktur der materiellen Substanz, das Problem\nder Gravitation, die Mathematik der Formlatituden</em> \n(Storia e letteratura, 41), 2 volumes, Rome: Edizioni di Storia e\nletteratura.",
                "–––, 1958, <em>Zwischen Philosophie und Mechanik\n: Studien zur Naturphilosophie der Spätscholastik. Studien zur\nNaturphilosophie der Spätscholastik; 5</em> (Storia e\nletteratura, 69), Rome: Edizione di Storia e Litteratura.",
                "Philoponus, Johannes (Ioannis Philoponi, d. 570 CE), [CAG 16]\n1887, <em>In Aristotelis physicorum libros tres priores\ncommentaria</em> (<em>Commentary on Aristotle’s Physics\n1–3</em>), (Commentaria in Aristotelem Graeca, 16), edited by\nHieronymus Vitelli, Berlin: Reimer.\n [<a href=\"https://archive.org/details/commentariaina16akaduoft\" target=\"other\">Philoponus CAG 16 available online</a>]",
                "–––, [CAG 17] 1888, <em>In Aristotelis\nphysicorum libros quinque posteriores (4–8) commentaria</em>\n(<em>Commentary on Aristotle’s Physics 4–8</em>),\n(Commentaria in Aristotelem Graeca, 17), edited by Hieronymus Vitelli,\nBerlin: Reimer.\n [<a href=\"https://archive.org/details/commentariaina17akaduoft\" target=\"other\">Philoponus CAG 17 available online</a>]",
                "–––, [CAG 14] 1897, <em>In Aristotelis libros De\ngeneratione et corruptione commentaria</em>, edited by Hyeronimus\nVitelli, Volume 14.2, Berlin: Reimer.",
                "–––, 1888, “Corollary on Place”, in\nCAG 17: 557–585, Berlin: Reimer.",
                "–––, 1991, <em>Philoponus: Corollaries on Place\nand Void. with, Simplicius: Against Philoponus on the Eternity of the\nWorld</em>, translated by David Furley (Philoponus) and Christian\nWildberg (Simplicius), London: Duckworth.",
                "–––, 2013, <em>On Aristotle On Coming-to-be and\nPerishing 1.6–2.4.</em> Translated by C.J.F. Williams. London; New\nDelhi; New York; Sidney: Bloomsbury.",
                "Plato, <em>Republic</em>, Stephanus pagination (Genève,\n1578) is used.",
                "Puig Montada, Josep, 1999, “Zur Bewegungsdefinition im VIII.\nBuch der Physik”, in <em>Averroes and the Aristotelian\nTradition: Sources, Constitution and Reception of the Philosophy of\nIbn Rushd (1126–1198), Proceedings of the Fourth Symposium\nAverroicum, Cologne, 1996</em>, by Gerhard Endress and Jan A. Aertsen,\nLeiden: Brill, 145–160.",
                "<em>Qur’an</em> [al-Qur’ān], The edition\npatronized by King Fu’ād I (Cairo: Al-Maṭba’a\nal-Amīrīya, 1924) is used.",
                "Rashed, Marwan, 2011, <em>Alexandre d’Aphrodise, commentaire\nperdu à la “Physique” d’Aristote (livres\nIV–VIII): les scholies byzantines : édition, traduction\net commentaire, Books 4–8</em>, Paris: Walter de Gruyter.",
                "Ross, William David (trans., ed.), 1936, <em>Aristotle. Physics: A\nrevised text with introduction and commentary</em>, Oxford: Oxford\nUniversity Press.",
                "Themistius (d. 387 CE), [CAG 5.2] 1900, <em>In Aristotelis Physica\nparaphrasis</em>, (Commentaria in Aristotelem Graeca, 5.2) edited by\nHeinrich Schenkl. Berlin: Reimer.\n [<a href=\"http://archive.org/details/p2inaristotelisp05them\" target=\"other\">Themistius CAG 5.2 available online</a>]",
                "–––, 2012, <em>On Aristotle: Physics\n1–3</em>, translated by Robert B. Todd, London: Bloomsbury.\nTranslation of CAG 5.2.",
                "Trifogli, Cecilia, 2001, “Averroes’ Doctrine of Time\nand its Reception in the Scholastic Debate in <em>The Medieval Concept\nof Time</em>”, <em>Studies on the Scholastic Debate and its\nReception in Early Medieval Philosophy</em>, edited by Pasquale Porro,\nLeiden: Brill, 57–82.",
                "–––, 2010, “Review of <em>Averroes’\nPhysics: A Turning Point in Medieval Natural Philosophy</em>, by Ruth\nGlasner”, <em>Aestimatio</em> 7 (2010): 78–88."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alawī, Jamāl al-Dīn, 1984, “Min\ntalkhīṣ al-samāՙ\nal-ṭabīՙī. Taqsīm al-samāՙ\nal-ṭabīՙī li-Bn Rushd”, <em>Majallat\nKullīyat al-Âdāb wa-l-ʻulūm\nal-insānīya bi-Fās</em>, 8: 205–245.</li>\n<li>Aphrodisias, Alexander of (c. 200 CE), [<em>De fato</em>] 1892,\n“Supplementum Aristotelicum, II.2”, in <em>Perì\nHeimarmenês</em> (De fato), by Alexander of Aphrodisias, edited\nby Ivo Bruns, 164–212. Berlin.</li>\n<li>Aristotle (d. 322 BCE), [<em>Categories, De coelo, Physics, De\ngeneratione et corruptione</em>], the numbers of I. Bekker’s\nedition (Berlin 1831–36) are used.</li>\n<li>–––, 1955, <em>On Coming-to-be and\nPassing-away</em>, translated by E.S. Forster, Cambridge, MA; London:\nHarvard University Press; William Heinemann, 1955.</li>\n<li>–––, 1964, <em>Al-Ṭabīʻa</em>\n[<em>Physics</em>], 2 volumes, edited by Abderrahman Badawi [ʿAbd\nal-Raḥmān Badawī], Cairo: Al-Dār al-Qawmīya\nli-l-ṭibāʻa wa-li-l-nashr.</li>\n<li>–––, 2021, <em>Aristotle’s</em> Physics\nVIII, translated into Arabic by Isḥāq ibn Ḥunayn\n(9th c.), edited with Introduction and Glossaries by Rüdiger\nArnzen, Berlin; Boston: De Gruyter.</li>\n<li>Arisṭāṭālīs, Arisṭū, see\nAristotle (in Arabic).</li>\n<li>Arnzen, Rüdiger (ed.), 2010, <em>On Aristotle’s\n“Metaphysics”: An Annotated Translation of the So-Called\n“Epitome”</em>, (Scientia Graeco-Arabica, 5), Berlin: De\nGruyter.</li>\n<li>–––, see Aristotle, Physics VIII.</li>\n<li>Avempace (Ibn Bâjja, d. 1138 CE), [SST] 1974,\n<em>Sharḥ al-samāʻ al-ṭabīʻī\nli-Arisṭūṭālīs</em>, edited by Majid\nFakhry, Beirut: Dār al-Nahār lil-Nashr. Pages and lines are\nindicated.</li>\n<li>Averroes (Ibn Rushd, d. 1198 CE), [DSO] 1986, <em>Averroes’\nDe substantia orbis: Critical Edition of the Hebrew Text with English\nTranslation and Commentary</em> (Averroes’ Aristotle, Corpus\nPhilosophorum Medii Aevi, Corpus Commentariorum Averrois in\nAristotelem series—versio Hebreica), edited and translated by\nArthur Hyman, Cambridge, MA; Jerusalem: Medieval Academy of America.\n [<a href=\"https://cdn.ymaws.com/www.medievalacademy.org/resource/resmgr/maa_books_online/hyman_0096_bkmrkdpdf.pdf\" target=\"other\">Averroes [DSO] available online</a>]</li>\n<li>–––, 1983, <em>Maqālāt fī\nl-manṭiq wa-l-ʻilm al-ṭabīʻī</em>,\nedited by Jamāl al-Dīn ʻAlawī. Casablanca:\nDār al-Nashr al-Maghribīya.</li>\n<li>Avicenna (Ibn Sina, d. 1037 CE), [Metaphysics] 2005, The\nMetaphysics of “The Healing”: A Parallel English-Arabic\nText, (Islamic translation series), edited by Michael E. Marmura.\nTranslated by Michael E. Marmura. Provo UT: Brigham Young University\nPress.</li>\n<li>–––, [Physics] 2009, The Physics of the\n“The Healing”: A Parallel English-Arabic Text, (Islamic\ntranslation series), 2 volumes, edited and translated by Jon McGinnis,\nProvo UT: Brigham Young University Press, volume 1.</li>\n<li>Bakker, Paul J.J.M. (ed.), 2015, <em>Averroes’ Natural\nPhilosophy and its Reception in the Latin West</em>, Leuven: Leuven\nUniversity Press.</li>\n<li>Cerami, Cristina, 2012, “Mélange, minima naturalia et\ncroissance animale dans le Commentaire Moyen d’Averroès\nau <em>De generatione et corruptione</em> I.5”, in <em>La\nNature et le Vide dans la physique médiévale</em>, by\nJoël Biard and Sabine Rommevaux, Turnhout: Brepols, 137–164.</li>\n<li>–––, 2015, <em>Génération et\nsubstance. Aristote et Averroès entre Physique et\nMétaphysique</em>, (Scientia Graeco-Arabica 18), Berlin: De\nGruyter.</li>\n<li>–––, 2018, “A Map of Averroes’ Criticism\nAgainst Avicenna. Physics, De Caelo, De Generatione et Corruptione,\nMeteorology”, in <em>The Arabic, Hebrew and Latin Reception of\nAvicenna’s Natural Philosophy</em>, A. Bertolacci and D.N.\nHasse, Berlin: De Gruyter, pp. 163–240.</li>\n<li>Davidson, Herbert A., 1987, <em>Proofs for Eternity, Creation and\nthe Existence of God in Medieval Islamic and Jewish Philosophy</em>,\nOxford: Oxford University Press.</li>\n<li>Eichner, Heidrun (ed.), 2005, <em>Averroes (Ibn Rushd, Abū\nl-Walīd Muḥammad) Mittlerer Kommentar zu\nAristoteles’</em> De Generatione et Corruptione, <em>mit einer\neinleitender Studie versehen, herausgegebenn un kommentiert</em>,\nPaderborn: F. Schöningh.</li>\n<li>Freudenthal, Gad, 2010, “A Response to Trifogli on Glasner,\nAverroes’s Physics”, <em>Aestimatio</em>, 7: 229–231.</li>\n<li>Ghazālī, Abū Ḥāmid Muḥammad al-\n(d. 1111 CE), 2002, <em>The Incoherence of the Philosophers</em>\n(Islamic translation series), second edition, translated by Michael E.\nMarmura, Provo, UT: Brigham Young University.</li>\n<li>Glasner, Ruth, 2009, <em>Averroes’ “Physics”. A\nTurning Point in Medieval Natural Philosophy</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199567737.001.0001</li>\n<li>Harvey, Steven, 1985, “The Hebrew Translation of\nAverroes’ Prooemium to his ‘Long Commentary on\nAristotle’s Physics’”, <em>Proceedings of the\nAmerican Academy for Jewish Research</em>, 52: 55–84.\ndoi:10.2307/3622702</li>\n<li>Hyman, Arther (trans., ed.), 1986, “Introduction” to\nAverroes’ <em>De substantia orbis</em>: Critical Edition of the\nHebrew Text with English Translation and Commentary, Cambridge, MA;\nJerusalem: Medieval Academy of America, pp. 13–35.\n [<a href=\"https://cdn.ymaws.com/www.medievalacademy.org/resource/resmgr/maa_books_online/hyman_0096_bkmrkdpdf.pdf\" target=\"other\">Hyman (trans., ed.) 1936 available online</a>]</li>\n<li>Joachim, Harold H., 1926, <em>Aristotle</em>: <em>On Coming-to-be\nand Passing-away</em>, edited and with an introduction, Oxford: at the\nClarendon Press.</li>\n<li>Lettinck, Paul, 1994, <em>Aristotle’s “Physics”\nand Its Reception in the Arabic World: With an Edition of the\nUnpublished Parts of Ibn Bājja’s “Commentary on the\nPhysics”</em>, Leiden: Brill.</li>\n<li>Maier, Anneliese, 1952, <em>An der Grenze von Scholastik und\nNaturwissenschaft. Die Struktur der materiellen Substanz, das Problem\nder Gravitation, die Mathematik der Formlatituden</em> \n(Storia e letteratura, 41), 2 volumes, Rome: Edizioni di Storia e\nletteratura.</li>\n<li>–––, 1958, <em>Zwischen Philosophie und Mechanik\n: Studien zur Naturphilosophie der Spätscholastik. Studien zur\nNaturphilosophie der Spätscholastik; 5</em> (Storia e\nletteratura, 69), Rome: Edizione di Storia e Litteratura.</li>\n<li>Philoponus, Johannes (Ioannis Philoponi, d. 570 CE), [CAG 16]\n1887, <em>In Aristotelis physicorum libros tres priores\ncommentaria</em> (<em>Commentary on Aristotle’s Physics\n1–3</em>), (Commentaria in Aristotelem Graeca, 16), edited by\nHieronymus Vitelli, Berlin: Reimer.\n [<a href=\"https://archive.org/details/commentariaina16akaduoft\" target=\"other\">Philoponus CAG 16 available online</a>]</li>\n<li>–––, [CAG 17] 1888, <em>In Aristotelis\nphysicorum libros quinque posteriores (4–8) commentaria</em>\n(<em>Commentary on Aristotle’s Physics 4–8</em>),\n(Commentaria in Aristotelem Graeca, 17), edited by Hieronymus Vitelli,\nBerlin: Reimer.\n [<a href=\"https://archive.org/details/commentariaina17akaduoft\" target=\"other\">Philoponus CAG 17 available online</a>]</li>\n<li>–––, [CAG 14] 1897, <em>In Aristotelis libros De\ngeneratione et corruptione commentaria</em>, edited by Hyeronimus\nVitelli, Volume 14.2, Berlin: Reimer.</li>\n<li>–––, 1888, “Corollary on Place”, in\nCAG 17: 557–585, Berlin: Reimer.</li>\n<li>–––, 1991, <em>Philoponus: Corollaries on Place\nand Void. with, Simplicius: Against Philoponus on the Eternity of the\nWorld</em>, translated by David Furley (Philoponus) and Christian\nWildberg (Simplicius), London: Duckworth.</li>\n<li>–––, 2013, <em>On Aristotle On Coming-to-be and\nPerishing 1.6–2.4.</em> Translated by C.J.F. Williams. London; New\nDelhi; New York; Sidney: Bloomsbury.</li>\n<li>Plato, <em>Republic</em>, Stephanus pagination (Genève,\n1578) is used.</li>\n<li>Puig Montada, Josep, 1999, “Zur Bewegungsdefinition im VIII.\nBuch der Physik”, in <em>Averroes and the Aristotelian\nTradition: Sources, Constitution and Reception of the Philosophy of\nIbn Rushd (1126–1198), Proceedings of the Fourth Symposium\nAverroicum, Cologne, 1996</em>, by Gerhard Endress and Jan A. Aertsen,\nLeiden: Brill, 145–160.</li>\n<li><em>Qur’an</em> [al-Qur’ān], The edition\npatronized by King Fu’ād I (Cairo: Al-Maṭba’a\nal-Amīrīya, 1924) is used.</li>\n<li>Rashed, Marwan, 2011, <em>Alexandre d’Aphrodise, commentaire\nperdu à la “Physique” d’Aristote (livres\nIV–VIII): les scholies byzantines : édition, traduction\net commentaire, Books 4–8</em>, Paris: Walter de Gruyter.</li>\n<li>Ross, William David (trans., ed.), 1936, <em>Aristotle. Physics: A\nrevised text with introduction and commentary</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Themistius (d. 387 CE), [CAG 5.2] 1900, <em>In Aristotelis Physica\nparaphrasis</em>, (Commentaria in Aristotelem Graeca, 5.2) edited by\nHeinrich Schenkl. Berlin: Reimer.\n [<a href=\"http://archive.org/details/p2inaristotelisp05them\" target=\"other\">Themistius CAG 5.2 available online</a>]</li>\n<li>–––, 2012, <em>On Aristotle: Physics\n1–3</em>, translated by Robert B. Todd, London: Bloomsbury.\nTranslation of CAG 5.2.</li>\n<li>Trifogli, Cecilia, 2001, “Averroes’ Doctrine of Time\nand its Reception in the Scholastic Debate in <em>The Medieval Concept\nof Time</em>”, <em>Studies on the Scholastic Debate and its\nReception in Early Medieval Philosophy</em>, edited by Pasquale Porro,\nLeiden: Brill, 57–82.</li>\n<li>–––, 2010, “Review of <em>Averroes’\nPhysics: A Turning Point in Medieval Natural Philosophy</em>, by Ruth\nGlasner”, <em>Aestimatio</em> 7 (2010): 78–88.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Ibn Bâjja [Avempace]",
            "Ibn Sina [Avicenna]"
        ],
        "entry_link": [
            {
                "../ibn-bajja/": "Ibn Bâjja [Avempace]"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-rushd-natural\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ibn-rushd-natural/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ibn-rushd-natural&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/ibn-rushd-natural/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ibn-rushd-natural": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ibn-rushd-natural/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ibn-rushd-natural&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/ibn-rushd-natural/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://dare.uni-koeln.de/\" target=\"other\">Digital Averroes Research Environment</a>,\n (Sources, Works, Bibliography), maintained at the University of\nCologne.",
            "<a href=\"https://www.iep.utm.edu/aris-mot/\" target=\"other\">Aristotle: Motion and Its Place in Nature</a>,\n entry by Joe Sachs in the <em>Internet Encyclopedia of\nPhilosophy.</em>",
            "Belo, Caterina, 2015,\n <a href=\"http://www.scielo.br/scielo.php?script=sci_arttext&amp;pid=S0100-512X2015000100045\" target=\"other\">The concept of ‘Nature’ in Aristotle, Avicenna, and Averroes</a>,\n paper in <em>Kriterion: Revista de Filosofia</em>, 56(131)\n(January/June 2015).",
            "Ramón Guerrero, Rafael, 2008,\n <a href=\"http://revistas.unisinos.br/index.php/filosofia/article/view/5337/2582\" target=\"other\">Averroes: Explicación aristotélica del universo</a>\n paper in <em>Filosofia Unisinos</em>, 9(1): 25–42."
        ],
        "listed_links": [
            {
                "http://dare.uni-koeln.de/": "Digital Averroes Research Environment"
            },
            {
                "https://www.iep.utm.edu/aris-mot/": "Aristotle: Motion and Its Place in Nature"
            },
            {
                "http://www.scielo.br/scielo.php?script=sci_arttext&pid=S0100-512X2015000100045": "The concept of ‘Nature’ in Aristotle, Avicenna, and Averroes"
            },
            {
                "http://revistas.unisinos.br/index.php/filosofia/article/view/5337/2582": "Averroes: Explicación aristotélica del universo"
            }
        ]
    }
}