{
    "url": "intensional-trans-verbs",
    "title": "Intensional Transitive Verbs",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Graeme Forbes\n<graeme.forbes@colorado.edu>",
        "author_links": [
            {
                "http://www.colorado.edu/philosophy/people/graeme-forbes": "Graeme Forbes"
            },
            {
                "mailto:graeme%2eforbes%40colorado%2eedu": "graeme.forbes@colorado.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.colorado.edu/philosophy/people/graeme-forbes\" target=\"other\">Graeme Forbes</a>\n&lt;<a href=\"mailto:graeme%2eforbes%40colorado%2eedu\"><em>graeme<abbr title=\" dot \">.</abbr>forbes<abbr title=\" at \">@</abbr>colorado<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Nov 3, 2004",
        "substantive revision Thu May 7, 2020"
    ],
    "preamble": "\n\nA verb is transitive if and only if it usually occurs with a direct\nobject, and in such occurrences it is said to occur\ntransitively. Thus ‘ate’ occurs transitively in\n‘I ate the meat and left the vegetables’, but not in\n‘I ate then left’ (perhaps it is not the same verb\n‘left’ in these two examples, but it seems to be the same\n‘ate’). A verb is intensional if the verb phrase\n(VP) it forms with its complement is anomalous in at least one of\nthree ways: (i) substituting one expression for another that is\ncoreferential with it in the complement of the verb can change the\ntruth-value of the sentence in which the VP occurs – for\ninstance, you might admire Mark Twain but not Samuel Clemens, not\nrealizing that your pesky neighbor Sam is the famous writer\n(in this case substitution of the coreferential ‘Samuel\nClemens’ for ‘Mark Twain’ in the VP ‘admire\nMark Twain’ will turn a true sentence, ‘you admire Mark\nTwain’ into a false one, ‘you admire Samuel\nClemens’); (ii) the VP admits of a special\n“unspecific” reading if it contains a quantifier, or a\ncertain type of quantifier (Quine’s example (1956:185) is famous: he\nobserves that if we paraphrase ‘I want a sloop’ as\n‘there is a (specific) sloop such that I want it’, this\nwill give the wrong idea if all I want is ‘mere relief from\nslooplessness’, a sloop but no specific one; for more examples,\nsee section 1); and (iii) the normal existential commitments of names\nand existential quantifiers in the complement are suspended even when\nthe embedding sentence is negation-free (again, see section 1).\n\nIntensional phenomena are puzzling, and worth studying, because (a) it\nseems that the only way to account for language-speakers’ capacities\nto produce and understand sentences of their native languages which\nthey have never encountered before is to posit\n compositional structure\n in language and an interpretive capacity in speakers that exploits\nit. But (b) the simplest ideas about what such structure is like\ncannot accommodate intensionality. So we want to know what the\nsmallest complication is which allows for the intensional.\nInvestigation of intensional verbs has focussed mainly on verbs used\nto make\n propositional attitude reports.\n These verbs take clauses rather than direct objects as their\ncomplements. However, as we will see below, intensional transitive\nverbs (henceforth ITVs) do not merely duplicate the problems raised by\npropositional attitude verbs, but introduce special difficulties of\ntheir own.\n",
    "toc": [
        {
            "#SomeGrouITVsTheiBeha": "1. Some groups of ITV’s and their behavior"
        },
        {
            "#HowManyMechForHowManyMark": "2. How many mechanisms for how many marks?"
        },
        {
            "#Prop": "3. Propositionalism"
        },
        {
            "#MontSema": "4. Montague’s semantics"
        },
        {
            "#ReviRefi": "5. Revisions and refinements"
        },
        {
            "#PrioPuzz": "6. Prior’s Puzzle"
        },
        {
            "#LogiInteTran": "7. The logic of intensional transitives"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Some groups of ITV’s and their behavior\n\nSearch verbs and desire verbs manifest all three of the behaviors\nlisted in the prologue as “marks” or effects of\nintensionality. Thus, Lois Lane may be seeking Superman. But it does\nnot seem to follow that she is seeking Clark, even though Superman is\nClark, and so we have an example of the first kind of anomaly\nmentioned in the prologue: substitution of one name with another for\nthe same person leads to a change in truth-value for the embedding\nsentence (here “Lois is seeking Superman”). Similarly, a\nthirsty person who believes that water quenches thirst and that\nH2O is a kind of rat poison may want some water but not\nsome H2O. [According to some, this alleged failure of\nsubstitution to preserve truth-value is an illusion; but for reasons\nof space I do not pursue this theory — its locus\nclassicus is (Salmon 1986).]\n\nSecond, both search verbs and desire verbs create specific-unspecific\nambiguities in their containing VPs when the syntactic object of the\nverb consists in a determiner followed by a nominal (this ambiguity is\nalso known as the relational/notional ambiguity, following Quine 1956,\nwhere it was first studied, at least in the modern period). For\nexample, ‘Oedipus is seeking a member of his family’ could\nbe true because Oedipus is seeking specifically Jocasta, who is a\nmember of his family, though he doesn’t realize it. On such an\noccasion, what is true can be more carefully stated as ‘there is\na member of his family such that Oedipus is seeking that\nperson’. The alternative, unspecific or notional reading, is\nforced by adding ‘but no particular one’: ‘Oedipus\nis seeking a member of his family, but no particular one’. Here\nOedipus is implied just to have a general intention to find some\nmember or other of his family. Contrast the extensional\n‘embrace’: Oedipus cannot embrace a member of his family,\nbut no particular one. \n\nThird, it is obvious that it is possible both to want, and to search\nfor, that which does not exist, for instance, a fountain of eternal\nyouth. But it isn’t possible to, say, stumble across such a thing,\nunless it exists.\n\nDepiction verbs, such as ‘draw’, ‘sculpt’, and\n‘imagine’, resist substitution in their syntactic objects,\nat least if the clausal ‘imagine’ does: if imagining that\nSuperman rescues you is not the same thing as imagining that Clark\nrescues you, it is hard to see why imagining Superman would be the\nsame thing as imagining Clark. A specific/unspecific ambiguity is also\npossible, as is attested by the wall label for Guercino’s The\nAldrovandi Dog (ca. 1625) in the Norton Simon Museum,\nwhich states ‘this must be the portrait of a specific\ndog’, thereby implicating an alternative, that ‘Guercino\ndrew a dog’ could be taken to mean that he drew a dog,\nbut no particular dog — he just made one up. And we can clearly\ndraw or imagine that which does not exist (as opposed to, say,\nphotographing it). Braque’s Little Harbor in Normandy (1909)\nis an example, according to the curators of the Art Institute of\nChicago: ‘it appears this work was painted from imagination,\nsince the landscape depicted cannot be identified.’\n\nHowever, whether or not a notional reading of a depiction VP is\npossible depends on which quantificational determiner occurs in the\nnoun phrase complement. If we say ‘Guercino drew every\ndog’, ‘Guercino drew most dogs’, or ‘Guercino\ndrew the dog’ (non-anaphoric ‘the dog’), we seem to\nadvert to some antecedent domain with respect to which ‘drew\nevery/most/the dog(s)’ are to be evaluated. So specific readings\nare\n required.[1]\n This resistance to unspecific construal is robust across languages\nand is typical of those quantificational determiners which do not\noccur naturally in existential contexts such as ‘there\nis’: contrast ‘there is a dog in the garden’ with\n‘there is every dog in the garden’, ‘there are most\ndogs in the garden’, or ‘there is the dog in the\ngarden’. An account of what is wrong with ‘there is every\ndog in the garden’ (see Keenan 2003) might well contain the\nmaterials for explaining the lack of unspecific readings of depiction\nVPs with determiners like ‘every’, ‘most’ and\n‘the’; see further (Forbes 2006:142–150).\n\nIt should be emphasized that depiction verbs are special in this\nrespect, for there is no problem getting unspecific readings with\n‘every’, ‘most’ and ‘the’ using\ndesire verbs or search verbs. Guercino might be looking for every dog\non Aldrovandi’s estate, though there are no particular dogs he is\nlooking for; the reader might be driving around an unfamiliar airport\nrental car lot, looking for the exit, and in this case there is no\nexit such that it is being sought. (‘look’ isn’t\nreally a transitive verb, but when the following preposition is\n‘for’, a search activity is denoted, so it is customary to\ncount the likes of ‘looking for’ as a “transitive\nverb” in contexts where intensionality is under discussion.)\n\nMixed behavior is also manifested by evaluative verbs, for example\n‘respect’, ‘admire’, ‘disdain’,\n‘worship’, including emotion verbs such as ‘lust\n(after)’ and ‘fear’. Lex Luthor might fear Superman,\nbut not Clark, and Lois might disdain Clark, but not Superman.\nHowever, unspecific readings of VPs with quantified complements are\nharder to hear, at least when the quantifier is existential.\n‘Lois admires an extraterrestrial’ can be heard in two\nways: there is the ‘admires a particular extraterrestrial’\nreading, and there is a generic reading, which means that\namong the kinds of thing she admires are extraterrestrials in general.\nGeneric readings of evaluative VPs attribute dispositions, and are\nnot the same as unspecific or notional readings (see Cohen 1999, 2008,\nand the entry on\n generics).\n There does not seem to be a sensible non-generic construal of\n‘Lois admires an extraterrestrial, but no particular\none’.\n\nThe verb ‘need’ is an interesting case. A sports team\nmight need a better coach, though no specific better coach, and might\nneed a better coach even if there are none to be had. So two out of\nthree marks of intensionality are present. However, ‘need’\ncontrasts with ‘want’ as regards substitution: our\ndehydrated subject who does not want H2O because he\nbelieves it to be a kind of rat poison, nevertheless needs\nH2O. It seems that co-denoting terms may be interchanged in\nthe complement of ‘need’. But merely accidentally\nco-extensive ones cannot be: Larson (2001, 232) gives the example of\nMax the theater impresario, who needs more singers but not more\ndancers, even though all who sing dance, and vice-versa. The property\nsinger and the property dancer are different\nproperties, so expressions for them cannot be exchanged in the\ncomplement of ‘need’. Similar restricted substitutivity is\nobserved with transaction verbs such as ‘wager’,\n‘owe’, ‘buy’, ‘sell’,\n‘reserve’, and perhaps the transaction resultative\n‘own’. One may reserve a table at a restaurant, though\nthere need not be a specific table one has reserved in making the\nreservation, since the restaurant may be expecting a slow night. But\nthese verbs do allow interchange of co-referential expressions (a\npurchase of water-rights is a purchase of H2O-rights)\nthough not (Zimmerman 1993, 151) of accidentally co-extensive ones.\nFor ‘own’ see (Zimmerman 2001, passim).\n\nIndeed, it is even arguable that some marks of intensionality are\npresent with verbs that allow interchange of accidentally\nco-extensive expressions. A case in point is verbs of absence, such as\n‘omit’ and ‘lack’. If it so happens that all\nand only the physicists on the faculty are the faculty’s Nobel prize\nwinners, then a faculty committee that lacks a physicist lacks a Nobel\nprize winner. However, not too much weight can be put on this case,\nsince it may be that at some level, ‘lack’ should be\nanalyzed (possibly in a complicated way) in terms of not\nhaving, in which case it would not really be an intensional verb\nat all; though so far as the author knows, no convincing analysis of\nthis type has been formulated. See (Zimmerman 2001, 516–20) for\nfurther discussion of relationships among the marks of\nintensionality.\n2. How many mechanisms for how many marks?\n\nWe have distinguished three “marks” or effects of\nintensionality: substitution-resistance, the availability of\nunspecific readings, and existence-neutrality. A natural question is\nwhether one and the same semantic mechanism underlies all three\neffects, whether they are entirely independent, or whether two have a\ncommon source distinct from the third’s.\n\nIn the context of a discussion of propositional attitude verbs, that\nis, verbs which take clausal or clause-embedding noun-phrase\ncomplements rather than simple noun-phrase (NP) objects, one\nhypothesis which keeps explanatory apparatus to the minimum is that\nall three effects of intensionality arise from the possibility of the\ncomplement having narrow scope with respect to the attitude\nverb. Thus we might distinguish two readings of\n\n(1)\n\nLex Luthor fears that Superman is nearby,\n\nnamely\n\n(2a)\n\nLex Luthor fears-true the proposition that Superman is\n nearby[2]\n\n\nand\n\n(2b)\n\nSuperman is someone such that Lex Luthor fears(-true the\nproposition) that he is nearby.\n\n\nIn (2a) we make the clause ‘that Superman is nearby’ the\ncomplement of ‘proposition’ to guarantee that\n‘Superman’ is within the scope of ‘fears’ (the\nresulting NP ‘the proposition…’ is a “scope\nisland”). And in (2b) we use a form of words that encourages an\naudience to process ‘Superman’ ahead of\n‘fears’. We can associate substitution-resistance with\n(2a), while allowing substitution in (2b). (2b) ascribes a complex\nproperty to Superman, and therefore also to Clark; namely, being\nan x such that Lex fears x to be nearby. (2a), on the other hand,\nputs Lex in the fearing-true attitude relation to a certain\nproposition, with essentially no implications about what other\npropositions he may fear-true. So, provided the proposition that\nSuperman is nearby is distinct from the proposition that Clark Kent is\nnearby, substitution-failure in (1) construed as (2a) is\nexplicable.\n\nAs for taking these two propositions to be distinct, there are many\nserviceable accounts, mostly involving some variation of the original\nproposal in modern philosophical semantics, found in (Frege 1892,\n1970). According to Frege, every meaningful expression or phrase has\nboth a customary reference that it denotes, and a\ncustomary sense that it expresses. In the case of clauses,\nthe customary reference would be a truth-value which is\ncompositionally derived from the denotations of the words of the\nclause, and the customary sense would be a way of thinking of that\ntruth-value, compositionally derived from the senses of the words of\nthe clause. Therefore, provided that ‘Superman’ and\n‘Clark Kent’ have different though coreferential senses\n(i.e., provided they express different ways of thinking of the same\nindividual) we will get different propositions. (However, it’s highly\nnon-trivial to find an adequate account of the senses of names, given\nthe critique of the most straightforward accounts in (Kripke\n1972).)\n\nHowever, on the face of it, this only has (1), intended in the (2a)\nmanner, expressing a different proposition from\n\n(2c)\n Lex Luthor fears that Clark is nearby.\n\n\nSince truth-value is on the level of reference, and the corresponding\nwords of (2a) and (2c) all have the same referents, the resulting\ntruth-values for (2a) and (2c) will be the same; but they are supposed\nto be different. So Frege makes the ingenious suggestion that it is an\neffect of embedding in intensional contexts (he only considered\nclausal verbs) that expressions in such contexts no longer denote\ntheir customary references, but rather their customary senses. Using\n‘iff’ henceforth to abbreviate ‘if and only\nif’, then (1) intended as (2a) is true iff the reference of\n‘Lex’ stands in the fearing-true relation to\nthe switched reference of ‘Superman is nearby’,\nnamely, its customary sense. Now we have our explanation of why merely\ninterchanging\ncustomarily co-referential expressions in (1) can produce\nfalsehood from a truth: the substitution does not preserve reference,\nsince the names are now denoting their customary senses. However, if\n(1) is intended as (2b), there will be no truth-value switch, since\nthere is no name-reference switch: in (2b) ‘Superman’ is\nnot in the scope of ‘fears’, therefore it denotes its\ncustomary reference, and interchange with any other expression\ndenoting that same referent must of necessity be truth-value\npreserving. (Readers in search of more detailed discussion of Frege’s\nnotion of sense might consult the section on\n Frege’s philosophy of language\n in the entry on Frege. See also the entry on\n propositional attitude reports,\n and for other uses of Frege-style “switcher semantics”,\nGluer and Pagin 2012.)\n\nA view like this has the capacity to explain the other intensionality\neffects. The specific-unspecific ambiguity in ‘Lex fears that an\nextraterrestrial is nearby’ is explained in terms of scope\nambiguity, the notional or unspecific reading corresponding to\n\n(3a)\n Lex Luthor fears-true the proposition that an extraterrestrial is\nnearby\n\n\nand the relational or specific reading to\n\n(3b)\n An extraterrestrial is such that Lex Luthor fears that it is\nnearby.\n\n\nExistence-neutrality is also explained, since the proposition\nthat an extraterrestrial is nearby is available for its truth to be\nfeared, believed, doubted or denied, whether or not there are\nextraterrestrials.\n\nThere are other accounts of substitution failure, but details are\nincidental at this point. For there are real issues about (A) whether\na single mechanism could be responsible for all three\neffects, and (B) whether an account of any effect in terms of a scope\nmechanism is workable for transitive, as opposed to clausal,\nverbs.\n\n(A) The behaviors cited in the previous section suggest that\nsubstitution-resistance and the availability of an unspecific reading\nhave different explanations. For we saw that the verb\n‘need’ contrasts with the verb ‘want’ as\nregards substitution-resistance, but is similar as regards the\navailability of unspecific readings of embedding VPs. So it seems\nthat there is a mechanism that blocks substitution, perhaps the\nFregean reference-switch one, perhaps something else more compatible\nwith what Davidson calls “semantic innocence” (Davidson\n1969, 172—a semantically innocent account of\nsubstitution-failure is one that does not alter the semantics of the\nsubstitution-resisting expressions themselves for the special case in\nwhich they occur in intensional contexts). And this mechanism cannot\noccur with ‘need’, but can with ‘want’\n(‘can’ rather than ‘does’ because it is\noptional; this is to allow for “transparent” or\nsubstitution-permitting readings of the likes of ‘Lex fears\nSuperman’ analogous to (3b)). On the other hand, whatever\naccounts for notional readings is evidently available to both verbs,\nand therefore it is not the same mechanism as underlies the\nsubstitution-resistance of ‘wants’. However, this\nreasoning is not conclusive, since the substitution-resistance\nmechanism may be present with ‘needs’ (and transaction\nverbs) but somehow rendered ineffective (see Parsons 1997, 370). One\nwould need to hear how the ineffectiveness comes about.\n\nEvaluative verbs present the converse challenge:\nsubstitution-resistance but apparently no unspecific readings of\nembedding VPs, certainly not existential ones. It is less clear how a\ndefender of a ‘single explanation’ theory would handle\nthis, at least if the single explanation is a scope mechanism, since\nit appears from the other cases that occurrence within the scope of\nthe intensional verb immediately produces an unspecific reading.\n\nSuspension of existential commitment may group with availability of\nunspecific readings for explanatory purposes. There appear to be no\ncases of intensional transitives which allow notional readings of\nembedded VPs, but where those VPs have the same existential\nconsequences as ones which differ just by the substitution of an\nextensional for the intensional verb.\n\n(B) The scope account is the only real contender for a single\nexplanation of the intensionality effects. But there is a major\nquestion about whether it can be transferred at all from clausal to\ntransitive verbs. For the intensionality effects would all be\nassociated with narrow-scope occurrences of noun phrases (NPs), and\nwith a transitive verb such syntactic configuration is problematic\nwhen the NP is quantified. This is because, in standard first-order\nsyntax, a quantifier must have a sentence within its scope (an open\nsentence with a free variable the NP binds, if redundant\nquantification is ruled out in the syntax). We can provide this for\nrelational or wide-scope readings, for example\n\n(4)\n An extraterrestrial is such that Lois is looking for it\n\n\nin which ‘Lois is looking for it’ is the scope of\n‘an extraterrestrial’. But if ‘an\nextraterrestrial’ is supposed to be within the scope of\n‘looking for’ there is no clause to be its scope;\nit has to be an argument of the relation, which is not allowed in\nfirst-order language. As Kaplan says, ‘without an inner\nsentential context…distinctions of scope disappear’\n(Kaplan 1986, 266). (Though readers who have taught symbolic logic\nwill be very familiar with the student who, having symbolized\n‘Jack hit Bill’ as ‘Hjb’, then offers\nsomething like ‘Hj(∃x)’ as the\nsymbolization of ‘Jack hit someone.’)\n\nThe description of the problem suggests two forms of solution. One is\nto preserve first-order syntax by uncovering hidden material to be the\nscope of a quantified NP even when the latter is within the scope of\nthe intensional verb. The other is to drop first-order syntax in favor\nof a formalism which permits the meanings of quantified NPs to be\narguments of intensional relations such as fearing and seeking. We\nconsider these options in turn in the following two sections.\n3. Propositionalism\n\nThe idea of uncovering hidden material to provide NPs in notional\nreadings of intensional VPs with sentential scope was prominently\nendorsed in (Quine 1956), where the proposal is to paraphrase search\nverbs with ‘endeavor to find’. So for (5a) we would have\n(5b):\n\n(5a)\n Lois is looking for an extraterrestrial\n\n(5b)\n Lois is endeavoring to find an extraterrestrial\n\n\nPartee (1974, 97) objects that this cannot be the whole story, since\nsearch verbs are not all synonyms (‘groping for’ doesn’t\nmean exactly the same as ‘rummaging about for’), but den\nDikken, Larson, & Ludlow (1996) and Parsons (1997, 381) suggest\nthat the search verb itself be used in place of\n‘endeavor’. So we get\n\n(6a)\n Lois is looking to find an extraterrestrial\n\n\nor in somewhat non-Quinean lingo,\n\n(6b)\n Lois is looking in order to make true the proposition that an\nextraterrestrial is such that she herself finds\n it.[3]\n\n\nHere ‘an extraterrestrial’ is within the scope of\n‘looking’ but has the open sentence ‘she herself\nfinds it’ as its own scope.\n\nIt may or may not be meaning-preserving to replace (5a)’s\nprepositional phrase with (6a)’s purpose clause, but even if it\nis meaning-preserving, that is insufficient to show that (6a) or (6b)\narticulates the semantics of (5a); it may merely be a synonym.\nHowever, with ‘need’ and desire verbs, evidence for the\npresence of a hidden clause is strong. For example, in\n\n(7)\n Physics needs some new computers soon\n\n\nit makes little sense to construe ‘soon’ as modifying\n‘needs’; it seems rather to modify a hidden\n‘get’ or ‘have’, as is explicit in\n‘Physics needs to get some new computers soon’, i.e.,\n‘Physics needs it to be the case that, for some new computers,\nit gets them soon’. (For ‘have’ versus\n‘get’, see (Harley 2004).)\n\nSecondly, there is the phenomenon of propositional anaphor (den\nDikken, Larson, & Ludlow 2018, 52–3), illustrated in\n\n(8)\n Physics needs some new computers, but its budget won’t allow it.\n\n\nWhat is not allowed is the truth of the proposition that Physics gets\nsome new computers.\n\nThird, attachment ambiguities suggest there is more than one verb\npresent for modifiers to attach to (Dikken, Larson, & Ludlow 1996,\n332):\n\n(9)\n Physics will need some new computers next year\n\n\ncould mean that a need for new computers will arise in the department\nnext year, but could also mean that next year is when Physics should\nget new computers, if its need (which may arise later this\nyear) is to be met.\n\nFinally, ellipsis generates similar ambiguities:\n\n(10)\n Physics will need some new computers before Chemistry\n\n\ncould mean that the need will arise in Physics before it does in\nChemistry, but could also mean that Physics will need to get some new\ncomputers before Chemistry gets any.\n\nHowever, the strength of the case for a hidden ‘get’ with\n‘need’ or ‘want’ contrasts with the case for\npropositionalism about search verbs. As observed by Partee (1974, 99),\nfor the latter there are no attachment ambiguities like those in (9).\nFor example,\n\n(11)\n Physics will shop for some new computers next year\n\n\ncan only mean that the shopping will occur next year. There is no\nsecond reading, corresponding to the other reading of (9), in which\n‘next year’ attaches to a hidden ‘find/buy’.\nThe phenomena in (8) and (10) also lack parallels with search verbs;\nfor example, ‘Physics will shop for some new computers before\nChemistry’ lacks a reading that has Physics shopping with the\nfollowing goal: to find/buy new computers before Chemistry finds/buys\nany. And although the propositionalist might offer something like\n\n(12)\n Physics will seek more office space by noon\n\n\nas an analog of (7), it is not easy to decide if (12) genuinely has a\nreading of the ‘seek to find more office space by noon’\nsort, or whether the hint of such a reading is just an echo of\n(7).\n\nOther groups of intensional transitives, such as depiction verbs and\nevaluative verbs, raise the problem that there is no evident\npropositional paraphrase in the first place. For psychological\ndepiction verbs such as ‘fantasize’ and\n‘imagine’, Parsons (1997, 376) proposes what he calls\n“Hamlet ellipsis”: for ‘Mary imagined a\nunicorn’ we would have the clausal ‘Mary imagined a\nunicorn to be’. Larson (2001, 233) suggests that the complement\nis a “small” or “verbless” clause, and for\n‘Max visualizes a unicorn’ proposes ‘Max visualizes\na unicorn in front of him’. This is too specific, for we can\nunderstand ‘Max visualizes a unicorn’ without knowing\nwhether he visualizes it in front of him, above him or below him, but\neven if we change the paraphrase to ‘Max visualizes a unicorn\nspatially related to him’, this proposal, as well as Parsons’,\nhave problems with negation: ‘Mary didn’t imagine a\nunicorn’ is not synonymous with either ‘Mary didn’t\nimagine a unicorn to be’ or with ‘Mary didn’t imagine a\nunicorn spatially related to her’, since the first of these\nallows for her to imagine a unicorn but not imagine it to be, the\nsecond, for her to imagine a unicorn but not as spatially related to\nher. There may be philosophical arguments that exclude these\n options,[4]\n but the very fact that a philosophical argument is needed makes the\nproposals unsatisfactory as semantics.\n\nClausal paraphrases for verbs like ‘fear’ are even less\nlikely, since the extra material in the paraphrase can be read as the\nfocus of the fear, making the paraphrase insufficient. For example,\nfearing x is not the same as fearing encountering x,\nsince it may be the encounter that is feared, say if x is an\nunfearsome individual with a dangerous communicable disease. In the\nsame vein, fearing x is not the same as fearing that\nx will hurt you; for instance, you may fear that your\naccident-prone dentist will hurt you, without fearing the dentist.\n\nWe conclude that if any single approach to intensional transitives is\nto cover all the ground, it will have to be non-propositionalist. But\nit is also possible, perhaps likely, that intensional transitives are\nnot a unitary class, and that propositionalism is correct for some of\nthese verbs but not for others (see further Schwarz 2006, Montague\n2007).\n4. Montague’s semantics\n\nThe main non-propositionalist approaches to ITVs begin from the work\nof Richard Montague, especially his paper “The Proper Treatment\nof Quantification in Ordinary English” (Montague 1973), usually\nreferred to as PTQ in the literature (Montague’s condition (9) (1974,\n264) defines ‘seek’ as ‘try to find’, but this\nis optional). Montague developed a systematic semantics of natural\nlanguage based on higher-order intensional type-theory. We\nexplain this term right-to-left.\n\nType theory embodies a specific model of semantic compositionality in\nterms of functional application. According to this model, if\ntwo expressions x and y can concatenate into a\nmeaningful expression xy, then (i), the meaning of one of\nthese expressions is taken to be a function, (ii) the meaning of the\nother is taken to be an item of the kind that the function in question\nis defined for, and (iii) the meaning of xy is the output of\nthe function when applied to the input. The type-theoretic\nrepresentation of this meaning is written x(y) or\ny(x), depending on which expression is taken to be\nthe function and which the input or argument. A functional application\nsuch as x(y) is said to be well-typed iff\nthe input that y denotes is the type of input for\nwhich the function x is defined.\n\nFor example, in the simple theory of types, a common noun\nsuch as ‘sweater’ is assigned a meaning of the following\ntype: a function from individuals to truth-values (a function of type\nib, for short; b for ‘boolean’). For\n‘sweater’ the function in question is the one which maps\nall sweaters to the truth-value TRUE, and all other individuals to the\ntruth-value FALSE. On the other hand, an (“intersective”)\nadjective such as ‘woollen’ would be assigned a meaning of\nthe following type: a function from (functions from individuals to\ntruth-values) to (functions from individuals to truth-values), or a\nfunction of type (ib)(ib) for short. Thus the\nmeaning of ‘woollen’ can take the meaning of\n‘sweater’ (an ib) as input and produce the\nmeaning of ‘woollen sweater’ (another ib) as\noutput; this is why the meaning of ‘woollen’ has the type\n(ib)(ib). woollen(sweater) is the\nspecific function of type ib that maps sweaters made of wool\nto TRUE, and all other individuals to FALSE.\n\nIn this framework, a quantified NP such as ‘every sweater’\nhas a meaning which can take the meaning of an intransitive verb\n(e.g., ‘unravelled’), or more generally, a Verb Phrase\n(VP), as input and produce the meaning (truth-value) of a sentence\n(e.g. ‘every sweater unravelled’) as output. Intransitive\nverbs and VPs are like common nouns in being of type ib. For\nexample, the VP quickly(unravelled) is of type\nib, mapping all and only individuals that unravelled quickly\nto TRUE. So a quantified NP is a function from inputs of type\nib to outputs of type b, and is thus of type\n(ib)b. ‘Every sweater unravelled\nquickly’ would be represented as\n(every(sweater))(quickly(unravelled)), and would\ndenote the truth-value that is the result of applying a meaning of\ntype (ib)b, that of every(sweater),\nto a meaning of type ib, that of\nquickly(unravelled) (the adverb\nquickly itself is of type (ib)(ib),\nlike the adjective woollen). Rules specific to\nevery guarantee that every(sweater)\nmaps quickly(unravelled) to TRUE iff\nquickly(unravelled) maps to TRUE everything that\nsweater maps to TRUE.\n\nSo far, the apparatus is extensional, which, besides providing only\ntwo possible sentence-meanings, TRUE and FALSE, imposes severe\nlimitations on the range of concepts we can express. Suppose that the\nScottish clothing company Pringle has a monopoly on the manufacture of\nwoollen sweaters, and makes sweaters of no other material. Then a\ngarment is a woollen sweater iff it is a Pringle sweater, meaning that\nwoollen(sweater) and\npringle(sweater) are the same function of type\nib, and these two terms for that function are everywhere\ninterchangeable in the type-theoretic language. Then modal operators\nsuch as ‘it is contingent that’ cannot be in the language,\nsince interchanging woollen(sweater) and\npringle(sweater) within their scope should sometimes\nlead to change of truth-value, but cannot if the two expressions\nreceive the same meaning in the semantics. For example, ‘it is\ncontingent that every Pringle sweater is woollen’ is true, but\n‘it is contingent that every woollen sweater is woollen’\nis false. Therefore the concept of contingency has no adequate\nrepresentation in the type-theoretic (boldface) language.\n\nShifting to intensional type theory deals with this\ndifficulty. The intension of any expression X is a function from\npossible worlds to an extension of the type which that expression has\nin the extensional theory just sketched, if it has such an extension,\notherwise to something appropriate for intensional vocabulary such as\n‘it is contingent that’. An intension which is a function\nfrom possible worlds to items of type t is\nsaid to be of type st.\nsweater, for instance, will have as its intension a\nfunction from possible worlds to functions of type ib,\nproviding for each possible world a function that specifies the\nindividuals which are sweaters at that world; so\nsweater‘s intension is of type\ns(ib). However, a modal sentential operator such as\n‘it is contingent that’ will have as its intension a\nfunction that, for each possible world, produces the very same\nfunction, which takes as input functions of type sb and\nproduces truth-values as output. So the extension of ‘it is\ncontingent that’ at each world is the same function, of type\n(sb)b. (The operator is said to be\nintensional because its extension at each world is a\nfunction taking intensions, such as functions of type sb, as\ninput.)\n\nA function of type sb is sometimes called a\npossible-worlds proposition, since it traces the truth-value\nof a sentence across worlds. For example, with appropriate assignments\nto the constituents,\n\n(13)\n\n(every(woollen(sweater)))(woollen)\n\n\nshould be true, that is, refer to TRUE, at every\n world.[5]\n So the intension of (13) is the function f\nof type sb such that for every world w,\nf(w) = TRUE. This is a constant\nintension. On the other hand,\n\n(14)\n\n(every(pringle(sweater)))(woollen)\n\n\nis true at some worlds but false at others, those where Pringle makes\nnon-woollen sweaters; so its intension is non-constant.\n\nWe define the intension of contingent to be the\nfunction which, for each world w as input, produces as output the\nfunction c of type (sb)b\nsuch that for any function p of type\nsb, c(p)\nis true at w iff there are worlds u and v such that\np(u) = TRUE and\np(v) = FALSE (this is the meaning of\n‘contingent that’ in the sense ‘contingent\nwhether’). So the intension of ‘contingent’ is also\nconstant, since the same function c is the\noutput at every world.\n\nSince contingent expects an input of type\nsb, we cannot write\n\n(15)\n\ncontingent((every(woollen(sweater)))(woollen))\n\nsince in evaluating this formula at a world w we would find ourselves\ntrying to apply the reference of contingent at w,\nnamely, the function c just defined, to the\nreference of (every(woollen(sweater)))(woollen) at w,\nnamely, the truth-value TRUE. But c requires\nan input of type sb, not b. So we introduce a new\noperator, written ^, such that if X is an expression\nand t is the type of X’s reference at each\nw, then at each w, the reference of ^X is of type\nst. ^X may be read as\n‘the intension of X’, since the rule for\n^ is that at each world, ^X refers\nto that function which for each world w, outputs the reference of X at\nw.\n\nIf we now evaluate\n\n(16)\n\ncontingent^((every(woollen(sweater)))(woollen))\n\n\nat a world w, the result will be FALSE. This is because the function\np of type sb that is the reference\nof ^((every(woollen(sweater)))(woollen)) at every\nworld, maps every world to TRUE. So there is no u such that\np(u) = FALSE. But there is such a u for\n^((every(pringle(sweater)))(woollen)), and so\n\n(17)\n\ncontingent^((every(pringle(sweater)))(woollen))\n\nis TRUE at w. Note that choice of w doesn’t matter, since the\nintension of contingent produces the same function\nc at every world, and the reference of,\ne.g., ^((every(pringle(sweater)))(woollen)), is the\nsame function of type sb at every world.\n\nFinally, our type-theory, intensional or extensional, is\nhigher-order, because the semantics makes available\nhigher-order domains of quantification and reference.\nsweater refers to a property of individuals, a\nfirst-order property. (every(sweater))\nrefers to a property of properties of individuals, a second-order\nproperty. For just as sweater(my favorite garment)\nattributes the property of being a sweater to a certain individual, so\nwe can think of (every(sweater))(woollen) as\nattributing a property to the property of being woollen. Which\nproperty is attributed to being woollen? The rules governing\nevery ensure that (every(F)) is\ntruly predicated of G iff G is a\nproperty of every F. In that case, G has the\nproperty of being a property of every F. So\n(every(F)) stands for the property of being a\nproperty of every F.\n\nTreating quantified NPs as terms for properties of properties means\nthey can occur as arguments to any expression defined for properties\nof properties. We can even rescue the uncomprehending student’s\nattempt at ‘Jack hit someone’, for provided\n‘hit’ is of the right type — which is easily\narranged — we can have (hit(someone))(jack).\nHere hit accepts the property of being a property of\nat least one person, and produces the first-order property of hitting\nsomeone, which is then attributed to Jack. In extensional type-theory,\nhit has the type\n((ib)b)(ib) if\n(hit(someone))(jack) is well-typed and\njack is of type\n i.[6]\n\nThe significance of this for the semantics of intensional transitives\nis that we now have a way of representing a reading of, say,\n\n(18)\n Jack wants a woollen sweater\n\n\nin which the quantified NP is within the semantic scope of the verb\nwithout having scope over a hidden subsentence with a free variable\nfor the NP to bind: the quantified NP ‘a woollen sweater’\ncan just be the argument to the verb. To allow for the intensionality\nof the transitive verb, Montague adopts the rule that if x\nand y can concatenate into a meaningful expression\nxy, the reference of the functional expression is a function\nwhich operates on the intension of the argument expression.\nSuppressing some irrelevant detail, this means that if\n‘wants’ syntactically combines with ‘a woollen\nsweater’ to produce the VP ‘wants a woollen\nsweater’, then in its semantics, want applies\nto the intension of (a(woollen (sweater))), resulting\nin the following semantics for (18):\n\n(19)\n\nwant(^(a(woollen(sweater))))(jack).[7]\n\n\nIn (19), a(woollen((sweater)) is within the scope of\nwant. So if we take (19) to represent the notional\nreading of (18), the idea that notional readings are readings in which\nthe quantified NP has narrow scope with respect to the intensional\nverb is sustained.\n5. Revisions and refinements\n\nHow does Montague’s account of intensional transitives fare\nvis à vis the three marks of\nintensionality? The existence-neutrality of existential NPs is\nclearly supported by (19), for there is nothing to prevent the\napplication at a world w of want to\n^(a(woollen(sweater))) from producing a function\nmapping Jack to TRUE even if, at the same w,\n(woollen(sweater)) maps every individual to FALSE\n(woollen sweaters don’t exist).\n\nSubstitution-failure is supported for contingently coextensive\nexpressions. For instance, (19) does not entail\nwant(^(a(pringle(sweater))))(jack) even if there are\nworlds where all and only woollen sweaters are Pringle sweaters, so\nlong as there are other worlds where this is not so. Let u be a world\nof the latter sort. Then a(pringle(sweater)) at u and\na(woollen(sweater)) at u are different functions of\ntype (ib)b, making\n^(a(pringle(sweater))) and\n^(a(woollen(sweater))) different at every world.\nTherefore want(^(a(pringle(sweater)))) may map Jack\nto FALSE at worlds where want(^(a(woollen(sweater))))\nmaps Jack to TRUE: since want is applied to different\ninputs here, the outputs may also be different.\n\nBut this result depends on the fact that\n(pringle(sweater)) and\n(woollen(sweater)) are merely contingently\ncoextensive. If ‘water’ and ‘H2O’\nare necessarily co-extensive, then wanting a glass of water\nand wanting a glass of H2O will be indistinguishable in\nhigher-order intensional type theory. This failure to make a\ndistinction, however, traces to the intensionality of the semantics\n— to its being (merely) a possible-worlds semantics — not\nto its being higher-order or type-theoretic. So possible solutions\ninclude (i) augmenting higher-order intensional type theory with extra\napparatus, or (ii) employing a different kind of higher-order type\ntheory. In both cases the aim is to mark distinctions like that\nbetween wanting a glass of water and wanting a glass of\nH2O.\n\nA solution of the first kind, following (Carnap 1947), is proposed in\n(Lewis 1972:182–6); the idea is that the meaning of a complex\nexpression is not its intension, but rather a tree that exhibits the\nexpression’s syntactic construction bottom-up, with each node in the\ntree decorated by an appropriate syntactic category label and semantic\nintension. But as Lewis says (p. 182), for non-compound lexical\nconstituents, sameness of intension implies sameness of meaning. So\nalthough his approach will handle the water/H2O problem if\nwe assume the term ‘H2O’ has structure that the\nterm ‘water’ lacks, it will not without such an\nassumption. For the same reason, it cannot explain\nsubstitution-failure involving unstructured proper names, on the usual\nview (deriving from Kripke 1972) that identity of extension (at any\nworld) for such names implies identity of intension. So we have no\naccount of why admiring Cicero isn’t the same thing as admiring\nTully.\n\nA solution of the second kind, employing a different kind of\nhigher-order type theory, is pursued in (Thomason 1980). In Thomason’s\n“intentional” logic, propositions are taken as a primitive\ncategory, instead of being analyzed as intensions of type sb.\nIn turns out that a somewhat familiar higher-order type theory can be\nbuilt on this basis, in which, roughly, the type of propositions plays\na role analogous to the type of truth-values in extensional type\ntheory. A property such as orator, for example, is a\nfunction of type ip (as opposed to ib), where\np is the type of propositions: given an individual as input,\norator will produce the proposition that that\nindividual is an orator as output. Proper names, however, are not\ntranslated as terms of type i, for then\ncicero and tully would present the\nsame input to orator, resulting in the same\nproposition as output: orator(cicero) =\norator(tully). So there would be no believing Cicero\nis an orator without believing Tully is an orator. Instead, Thomason\nassigns proper names the type (ip)p, functions from\nproperties to propositions. And merely the fact that Cicero and Tully\nare the same individual does not require us to say that\ncicero and tully must produce the\nsame propositional output given the same property input. Instead, we\ncan have cicero(orator) and\ntully(orator) distinct (see Muskens 2005 for further\ndevelopment of Thomason’s approach).\n\nApplying this to intensional transitives is just a matter of assigning\nappropriate types so that the translations of, say, ‘Lucia seeks\nCicero’ and ‘Lucia seeks Tully’, are different\npropositions (potentially with different truth-values). We need to\nkeep the verb as function, and we already have the types of\ncicero and tully set to\n(ip)p. The translations of ‘seeks\nCicero’ and ‘seeks Tully’ should be functions\ncapable of accepting inputs of type (ip)p, such as\nlucia, and producing propositions as output.\nseeks therefore accepts input of type\n(ip)p and produces output that accepts input of type\n(ip)p and produces output of type p. Thus\nseeks is of type\n((ip)p)(((ip)p)p), and we\nget substitution-failure because seeks(cicero) and\nseeks(tully) can be different functions of type\n((ip)p)p so long as cicero\nand tully are different functions of type\n(ip)p (as we already said they should be).\nseeks(cicero) can therefore map\nlucia to one proposition while\nseeks(tully) maps it (not ‘her’) to\nanother; and these propositions can have different\n truth-values.[8]\n\nFinally, there is the question whether (19) shows that Montague’s\nsemantics supports notional readings. One problem is that Montague’s\nsemantics for extensional verbs such as ‘get’ is exactly\nthe same as for intensional verbs, and it takes an extra stipulation,\nor meaning-postulate, for ‘get’, to guarantee\nthat the extension of get(^(a(woollen(sweater)))) at\nw maps Jack to TRUE only if the extension of\n(woollen(sweater)) at w maps some individual to TRUE\n(you can want a golden fleece even if there aren’t any, but you can’t\nget one if there aren’t any). So apparently (19)’s pattern\nembodies something in common to the notional meaning of ‘want a\nwoollen sweater’ and the meaning of ‘gets a woollen\nsweater’, something which is neutral on the existence of woollen\nsweaters. This is unintuitive, but is perhaps not a serious problem,\nsince it can be avoided by a different treatment of extensional\ntransitives.\n\nA more pressing question is what justification we have for thinking\nthat (19) captures the notional, ‘no particular one’,\nreading of\n (18).[9]\n On the face of it, (19) imputes to Jack the wanting attitude towards\nthe property of being a property of a woollen sweater. This is the\nsame attitude as Jack may stand in to a particular woollen sweater,\nsay that one. But it is not at all clear that we have any\ngrasp of what a single attitude with such diverse objects could be,\nand the difficulty seems to lie mainly with the proposed semantics for\nnotional readings. What does it mean to have the attitude of desire\ntowards the property of being a property of a woollen sweater?\n\nTwo ways of dealing with this suggest themselves. First, we might\nsupplement the formal semantics with an elucidation of what it\nis to stand in a common-or-garden attitude to a property of\nproperties. Second, we might revise the analysis to eliminate this\ncounterintuitive aspect of it, but without importing the\npropositionalist’s hidden sentential contexts.\n\nBoth (Moltmann 1997) and (Richard 2001) can be read as providing,\nwithin Montague’s general approach, an account of what it is to stand\nin an attitude relation to a property of properties. Both accounts are\nmodal, having to do with the nature of possible situations in which\nthe attitude is in some sense “matched” by the situation:\nan attitude-state of need or expectation is matched if the need or\nexpectation is met, an attitude-state of desire is matched if the\ndesire is satisfied, an attitude-event of seeking is met if the search\nconcludes successfully, and so on. According to Moltmann’s account\n(1997, 22–3) one stands in the attitude relation of seeking to\n^(a(woollen(sweater))) iff, in every minimal\nsituation σ in which that search concludes successfully,\nyou find a woollen sweater in σ. Richard (2001, p. 116) offers a\nmore complex analysis that is designed to handle negative quantified\nNPs as well (‘no woollen sweater’, ‘few woollen\nsweaters’, etc.). On this account, a search π\ndemands ^(a(P)) iff for every relevant\nsuccess-story m = <w, s> for π, things in s with a\nproperty entailing P are in the extension of\n^(a(P)) at w. Here s is the set of things that are\nfound when the search concludes successfully in w.\n\nBy contrast, (Zimmerman 1993) and (Forbes 2000, 2006) propose\nrevisions in (19) itself and its ilk. Zimmerman (161–2) replaces\nthe quantifier intension with a property intension, since he holds\nthat (i) unspecific readings are restricted to “broadly”\nexistential quantified NPs, and (ii) the property corresponding to\nthe nominal in the existential NP (e.g., ‘woollen\nsweater’) can do duty for the NP itself. Of course, the proposed\nrestriction of unspecific readings to existentials is controversial\n(cf. our earlier example, ‘Guercino is looking for\nevery dog on Aldrovandi’s estate’). It may also be wondered\nwhether there is any less of a need to explain what it is to stand in\nthe seeking relation to a property of objects than to a property of\nproperties (but for a response to this kind of objection, see\nGrzankowski 2018, 146–9).\n\nAccording to (Forbes 2000) the need for such an explanation already\nthreatens the univocality of a verb such as ‘look for’ as\nit occurs in ‘look for that woollen sweater’ and\n‘look for some woollen sweater’. Observing that search\nverbs are action verbs, Forbes applies Davidson’s event semantics to\nthem (Davidson 1967). In this semantics, as developed in (Parsons\n1990), search verbs become predicates of events, and in relational\n(specific) readings, the object searched for is said to be in a\nthematic relation to the event, one denoted by ‘for’; thus\n‘some search e is for that woollen\nsweater’. But in unspecific readings, no thematic relation is\ninvoked; rather, the quantified NP is used to characterize\nthe search. So we would have ‘some search e is\ncharacterized by ^(a(woollen(sweater)))’, i.e.,\ne is an a-woollen-sweater search (Forbes 2000, 174–6;\n2006, 77–84). What it is for a search to be characterized by a\nquantifier, say ^(a(woollen(sweater))), is explained\nin terms of ‘outcome postulates’. For the current example,\nas a first approximation, a search is characterized by\n^(a(woollen(sweater))) iff any course of events in\nwhich that search culminates successfully includes an event of finding\na woollen sweater whose agent is the agent of the search. Similar\npostulates can be given for, e.g., the meeting of expectations and the\nsatisfaction of desires: a state of desire is characterized by\n^(a(woollen(sweater))) iff any course of events in\nwhich that desire is satisfied includes an event of getting a woollen\nsweater whose recipient is the agent of the search (Forbes 2006,\n94–129). \n\nThere is therefore a range of different non-propositionalist\napproaches to intensional transitives. As we already remarked, one\npossibility is that propositionalism is correct for some verbs and\nnon-propositionalism correct for others. However, there is also the\noption that non-propositionalism is correct for all. A\nnon-propositionalist who makes this claim will have to explain the\nphenomena illustrated in (7)–(10), without introducing degrees\nof freedom that make it unintelligible that these phenomena do not\narise for all intensional transitives.\n6. Prior’s Puzzle\n\nIntensional transitive verbs are also involved in another puzzle of\nsubstitution-resistance besides the one already discussed. In the\nliterature on propositional attitude reports, it’s the received view\nthat the complement clauses in such reports refer to propositions. So,\nfor example, in ‘Holmes believes that Moriarty has\nreturned’, the clause ‘that Moriarty has returned’\nis taken to stand for the proposition that Moriarty has returned. The\nwhole ascription is then understood to have the form Rab,\nwhich in terms of the example means that Holmes (a) stands in\nthe relation of belief (R) to the proposition that Moriarty\nhas returned (b). However, as well as being denoted by\nthat-clauses, it seems that propositions are also denoted by\nproposition descriptions, noun phrases that explicitly use ‘the\nproposition’, such as, in the previous sentence, ‘the\nproposition that Moriarty has returned’. So, if the clause and\nthe description co-denote, we have the following truth: \n\n(20)\n that Moriarty has returned is the proposition that Moriarty has\nreturned.\n\n\nBut then we should be able to substitute proposition-description for\nthat-clause, which, indeed, works well enough for\n‘believes’: from ‘Holmes believes that Moriarty has\nreturned’ it does seem to follow that Holmes believes the\nproposition that Moriarty has returned, even though a side-effect of\nthe substitution is to change the clausal ‘believes’ into\nits transitive form. However, ‘believes’ is rather special\nin this respect. Despite (20), examples (21a) and (21b) below\nappear to have very different meanings:\n\n(21a)\n Holmes {fears/suspects} that Moriarty has returned.\n\n\n(21b)\n Holmes {fears/suspects} the proposition that Moriarty has\nreturned.\n\n\n(21a) may well be true, but it is unlikely that Holmes fears a\nproposition, or that some proposition is a thing of which he is\nsuspicious. (This phenomenon seems first to have been noted in print\nby A. N. Prior (1963).) \n\nThat the meaning of the minor premise does not survive substitution is\nthe rule rather than the exception: we get a similar outcome with\n‘announce’, ‘anticipate’, ‘ask’,\n‘boast’, ‘calculate’, ‘caution’,\n‘complain’, ‘conclude’, ‘crow’,\n‘decide’, ‘detect’, ‘discover’,\n‘dream’, ‘estimate’, ‘forget’,\n‘guess’, ‘hope’, ‘insinuate’,\n‘insist’, ‘interrogate’ (literary theory),\n‘judge’, ‘know’, ‘love’,\n‘mention’, ‘notice’, ‘observe’,\n‘prefer’, ‘pretend’,\n‘question’,‘realize’, ‘rejoice’,\n‘require’, ‘see’, ‘suggest’,\n‘surmise’, ‘suspect’, ‘trust’,\n‘understand’, ‘vote’, ‘wish’, and\nvarious cognates of these. In some cases, substitution fails because\nit is meaning-altering, in others because it is meaning-dissolving (a\nselection constraint is violated, or the purported transitive verb\nsimply doesn’t exist in the language). The verbs for which\nsubstitution is acceptable are thinner on the ground: inference verbs\nsuch as ‘conclude’, ‘deduce’,\n‘entail’ and ‘establish’, along with a few\nothers like ‘accept’,‘believe’,\n‘doubt’, ‘state’ and ‘verify’ (but\nfor ‘believe’ see King 2002, 359–60; Forbes 2018,\n118; and Nebel 2019, 97–9). \n\nThe puzzle doesn’t depend on the credentials of (20) as an identity\nsentence. Even if, for whatever reason, it isn’t, it is still hard to\nsee how truth-value can change going from (21a) to (21b), granted\nthat the proposition that Moriarty has returned and that\nMoriarty has returned are co-denoting. There also doesn’t seem to\nbe a useful application of a traditional account of referential\nopacity, such as Frege’s (discussed in connection with (2c) above).\nSubstitution-failure is explained in Fregean terms by co-denoting\nexpressions having different senses, but it’s unclear that adding or\ndeleting ‘the proposition’ is a significant enough\ndifference to change sense. We also expect that examples of\nsubstitution-failure become unrealistic if the subject is attributed\nexplicit belief in the identity premise. However, adding that Holmes\nis absolutely clear about the truth of (20) and has it at the\nforefront of his consciousness doesn’t make it any more likely that\n(21b) is true, even though (21a) is. \n\nConsequently, there is some appeal to solutions of Prior’s Puzzle that\ndiscern an equivocation in the inference, or propose that the crucial\nterms, the proposition that Moriarty has returned and\nthat Moriarty has returned, aren’t really coreferential as\nthey occur in the inference. An approach of the first kind, in (King\n2002), argues that the transitive and clausal forms of the intensional\nverb are polysemous, that is, weakly ambiguous (the two\nsenses are related). This has been criticized on the basis of ellipsis\nexamples, such as ‘Bob didn’t even mention the proposition that\nfirst-order logic is undecidable, let alone that it is provable’\n(Boer 2009, 552), and ‘the Soviet authorities genuinely fear a\nreligious revival, and that the contagion of religion will\nspread’ (after Nebel 2019, 77). Since these examples don’t\nstrike one as amusingly incongruous, in the way that typical examples\nof zeugma do (‘All over Ireland the farmers grew potatoes,\nbarley, and bored’), they are in tension with a postulation of\npolysemy. Consequently, Boer (2009) and Nebel (2019) propose that the\nproblem lies in an equivocation in the terms the proposition that\nMoriarty has returned and that Moriarty has returned. On\nboth their accounts, it is the propositional description ‘the\nproposition that…’ which fails to denote what one might\nexpect. On the other hand, as evidence in favor of polysemy, there is\nthe fact that some cases of ellipsis seem in some way anomalous, such\nas ‘John heard thunder and that a storm was rolling in’.\nHere the anomaly can be explained in terms of how\ndifferent the two senses of ‘heard’ are.\n\nEvent semantics (see section 5 above) provides an alternative which\nmay avoid the need for any kind of equivocation. An initial proposal\nis made in (Pietroski 2000) for ‘explain’, which behaves\nlike ‘fear’ and ‘suspect’, as in\n\n(22a)\n Martin explained that the nothing itself nothings.\n\n\n(22b)\n Martin explained the proposition that the nothing itself\nnothings.\n\n\n(22a) may well be true but (22b) is unlikely. The idea is then that\nthe clausal and transitive forms of ‘explain’ take\ndifferent thematic complements, content versus theme: with the clausal\nverb of (22a), a ‘that’-clause provides a content, while\nwith the transitive verb of (22b), a proposition description provides\na theme, the thing that gets explained. Since, as already\nnoted, a side-effect of the substitution is to change the verb from\nits clausal to its transitive form, a consequent side-effect is to\nchange the role ascribed to the proposition from content to theme.\nThis account is developed in (Pietroski 2005) and also, as an\nextension of the event semantics of (Forbes 2006), in (Forbes\n2018).\n7. The logic of intensional transitives\n\nThere may be no such topic as the logic of propositional\nattitudes: it may be doubted whether ‘Mary wants to meet a man\nwho has read Proust and a man who has read Gide’\nlogically entails ‘Mary wants to meet a man who has\nread Proust’. Even if standing in the wanting-to-be-true\nattitude to I meet a man who has read Proust and a man who has\nread Gide somehow necessitates standing in the wanting-to-be-true\nattitude to I meet a man who has read Proust, the\nnecessitation appears to be more psychological than logical. On the\nother hand, what we might call ‘objectual attitudes’, the\nnon-propositional attitudes ascribed by intensional transitives, seem\nto have a logic (for a compendium of examples, see Richard 2000,\n105–7): ‘Mary seeks a man who has read Proust and a man\nwho has read Gide’ does seem to entail ‘Mary seeks a man\nwho has read Proust’.\n\nYet, as Richard notes (Richard 2001, 107–8), the inferential\nbehavior of quantified complements of intensional transitives is still\nvery different from the extensional case. For example (his\n‘Literary Example’), even if it is true that Mary seeks a\nman who has read Proust and a man who has read Gide, it may be false\nboth that she seeks at most one man and that she seeks at least two\nmen; for she may be indifferent between finding a man who has read\nboth, versus finding two men, one a reader of Proust but not Gide, the\nother of Gide but not Proust. Contrast ‘saw’,\n‘photographed’, or ‘met’: if she met a man who\nhas read Proust and a man who has read Gide, it cannot be false both\nthat she met at most at one man and also that she met at least two\nmen. As Richard insists, it is a constraint on any semantics of\nintensional transitives that they get this type of case right.\n\nBy contrast, in other cases, even very simple ones, it is\ncontroversial exactly what inferences intensional transitives in\nunspecific readings support. If Mary seeks a man who has read Proust,\ndoes it follow that she seeks a man who can read? After all, it is\nunlikely that a comic-book reader will satisfy her tastes in\n men.[10]\n If Perseus seeks a mortal gorgon, does it follow that he seeks a\n gorgon?[11]\n After all, if he finds an immortal gorgon, he is in trouble.\nZimmerman (1993, 173) takes it to be a requirement on accounts of\nnotional readings that they validate these deletion or\n“weakening” inferences. But there are characterizations of\nunspecific readings on which these inferences are in fact invalid, for\ninstance, a characterization in terms of indifference towards\nwhich object of the relevant kind is found (Lewis uses such an\n‘any one would do’ characterization in Lewis 1972, p.\n199). For even if it is true that Mary seeks a man who has read\nProust, and any male Proust-reader would do, it does not follow that\nMary seeks a man who can read, and any man who can read would do. For\nnot every man who can read has read Proust.\n\nIs there anything intrinsic to the indifference characterization of\nunspecificity (‘any one would do’) that we can object to\nwhile leaving the status of weakening inferences open? One objection\nis that the characterization does not work for every verb or\nquantifier: ‘Guercino painted a dog, any dog would do’\nmakes little sense, and ‘the police are looking for everyone who\nwas in the room, any people who were in the room would do’ is\nnot much better. More importantly, the characterization seems to put\nwarranted assertibility out of reach, since the grounds which we\nnormally take to justify ascribing an existentially quantified\nobjectual attitude will rarely give reason to think that the agent has\nabsolutely no further preferences going beyond the characterization of\nthe object-kind given in the ascription (probably Mary would pass on\nmeeting a male psychopathic killer who has read Proust; see further\nGraff Fara 2013 for analogous discussion of desire).\n\nStill, this is not to validate weakening inferences; for that we would\nneed to show that the more usual gloss of the unspecific reading,\nusing a ‘but no particular one’ rider, supports the\ninferences as strongly as the indifference characterization refutes\nthem. And it is unclear how such an argument would proceed (see\nfurther Forbes 2006, 94–6). In addition, making a good case that\nthe inferences are intuitively valid is one thing, getting the\nsemantics to validate them is another. Both the propositionalist and\nthe Montagovian need to add extra principles, since there is nothing\nin their bare semantics to compel these inferences. For even if Jack\nstands in the wanting relation to\n^(a(woollen(sweater))), that by itself is silent on\nwhether he also stands in the wanting relation to\n^(a(sweater)). The accounts of Moltmann and Richard\nboth decide the matter positively, however (e.g., if in every minimal\nsituation in which Jack’s desire is satisfied, he gets a woollen\nsweater, then in every such situation, he gets a sweater; so he wants\na sweater).\n\nThe intuitive validity of weakening can also be directly challenged.\nFor example, via weakening we can infer that if A is looking for a cat\nand B is looking for a dog, then A and B are looking for the same\nthing (an animal). For discussion of this kind of example, see\n(Zimmerman 2006), and for the special use of ‘the same\nthing’, (Moltmann 2008). Asher (1987, 171) proposes an even more\ndirect counterexample. Suppose you enter a competition whose prize is\na free ticket on the Concorde to New York. So presumably you want\na free ticket on the Concorde. But you don’t want a\nticket on the Concorde, since you know that normally these are\nvery expensive, you are poor, and you strictly resist desiring the\nunattainable. Asher is here assimilating notional uses of indefinites\nto generics, which on his account involve quantification over\nnormal worlds. So if for some bizarre reason you want a\nsloop, but one whose hull is riddled with holes, it will not be\nliterally true to say you want a sloop.\n\nUndeniably there is a real phenomenon here, but perhaps it belongs to\npragmatics rather than semantics. If I say ‘I want a sloop’,\nsomeone who offers to buy me any sloop floating in the harbor could\nreasonably complain ‘You should have said that’ if I decline the\noffer on the grounds that none of those sloops meets my unstated\nrequirement of having a hull riddled with holes. But my aspirational\nbenefactor’s complaint might be justified because normality is a\ndefault implicature or presupposition that a co-operative\nspeaker is under some obligation to let her audience know isn’t in\nforce, when it isn’t. It is still literally true, on this view, that\nyou want a sloop, despite the idiosyncrasy of the details of your\ndesire. However, this is far from the end of the story. Those with\ndoubts about weakening will find the discussion in (Sainsbury 2018,\n129–133) congenial.\n\nAnother interesting logical problem concerns the “conjunctive\nforce” of disjoined quantified NPs in objectual ascriptions.\nThere is a large literature on the conjunctive force of disjunction in\nmany other contexts (e.g., Kamp 1973, Loewer 1976, Makinson 1984,\nJennings 1994, Zimmerman 2000, Simons 2005, Fox 2007), for instance as\nexhibited in ‘x is larger than y or\nz’ and ‘John can speak French or Italian to\nyou’. In these cases the conjunctive force is easily captured by\nsimple distribution: ‘x is larger than y and\nlarger than z’, ‘John can speak French to you and\ncan speak Italian to\n you’.[12]\n However, with intensional transitives we find the same conjunctive\nforce, but no distributive articulation. If we say that Jack needs a\nwoollen sweater or a fleece jacket, we say something to the effect\nthat (i) his getting a woollen sweater is one way his need could be\nmet, and (ii) his getting a fleece jacket is another way his\nneed could be met. But ‘Jack needs a woollen sweater or a fleece\njacket’ does not mean that Jack needs a woollen sweater\nand needs a fleece jacket. This last conjunction ascribes two\nneeds, only one of which is met by getting a satisfactory woollen\nsweater. But the latter acquisition by itself meets the disjunctive\nneed for a woollen sweater or a fleece jacket. So there is a challenge\nto explain the semantics of the disjunctive ascription, while at the\nsame time remaining within a framework that can accommodate all cases\nof conjunctive force — comparatives, various senses of\n‘can’, counterfactuals with disjunctive antecedents\n(‘if Jack were to put on a woollen sweater or a fleece jacket\nhe’d be warmer’) and so on; see further (Forbes 2006,\n97–111).\n\nA penultimate type of inference we will mention is one in which\nintensional and extensional verbs both occur, and the inference seems\nvalid even when the intensional VPs are construed unspecifically. An\nexample:\n\n(23a)\n Jack wants a woollen sweater\n\n(23b)\n Whatever Jack wants, he gets\n\n(23c)\n Therefore, Jack will get a woollen sweater\n\n\nObviously, (23a,b) entail (23c) when (23a) is understood specifically.\nBut informants judge that the inference is also valid when (23a) is\nunderstood unspecifically, with ‘but no particular one’\nexplicitly appended. If we seek a validation of the inference that\nhews to surface form, Montague’s uniform treatment of intensional and\nextensional verbs has its appeal: (23b) will say that for whatever\nproperty of properties P Jack stands in the\nwanting relation to, he stands in the getting relation to. So the\ninference is portrayed as the simple modus ponens it seems to\nbe. It would then be the task of other meaning-postulates to carry us\nfrom his standing in the getting relation to\n^(a(woollen(sweater))) to there being a woollen\nsweater such that he gets it. The final example to be considered\nhere involves fictional or mythical names in the scope of intensional\ntransitives. An example (Zalta 1988, 128) of the puzzles these can\nlead to is:\n\n\n(24a)\n The ancient Greeks worshipped Zeus.\n\n(24b)\n Zeus is a mythical character.\n\n(24c)\n Mythical characters do not exist.\n\n(24d)\n Therefore, the ancient Greeks worshipped something that does\n(did) not exist.\n\n\nOr even:\n\n(24e)\n Therefore, there is something that doesn’t exist such that the\nancient Greeks worshipped it.\n\n\nOne thing the example shows is that specific/unspecific is not to be\nconfused with real/fictional. (24a) is a true specific ascription,\njust as ‘the ancient Greeks worshipped Ahura Mazda’ is a\nfalse one. (24b) is also true. So the ancient Greeks, who would not\nhave knowingly worshipped a mythical character, were making a\nrather large mistake, if one of a familiar sort.\n\n(24c) is also true, if we are careful about what ‘do not\nexist’ means in this context. It is contingent that Zeus-myths\nwere ever formulated, and one sense in which we might mean (24c) turns\non the assumption that fictional and mythical characters exist iff\nfictions and myths about them do. In this sense, (24c) is false,\nthough an actual fictional character such as Zeus would not have\nexisted if there had been no Zeus-myths. This also explains why (24a)\nand (24b) can both be true: ‘Zeus’ refers to the mythical\ncharacter, a contingently existing abstract object.\n\nHowever, by far the more likely reading of (24c) is one on which it\nmeans that mythical characters are not real. Zeus is not flesh and\nblood, not even immaterial flesh and blood. With this in mind, (24d)\nand (24e) are both true. The quantifier ‘something’ ranges\nover a domain that includes both real and fictional or mythical\nentities, and there is something in that domain, the mythical\ncharacter, which was worshipped by the ancient Greeks and which is not\nin the subdomain of real items.\n\nThis gets the right truth-values for the statements in (24), but might\nbe thought to run into trouble with the likes of ‘Zeus lives on\nMt. Olympus’: if ‘Zeus’ refers to an abstract\nobject, how can Zeus live anywhere? One way of dealing with this kind\nof case is to suppose, evidently plausibly, that someone who says\n‘Zeus lives on Mt. Olympus’ and knows the facts means\n\n(25)\n According to the myth, Zeus lives on Mt. Olympus.\n\n\nOn the other hand, if an ancient Greek believer says ‘Zeus lives\non Mt. Olympus’, he or she says something false, there being no\nreason to posit a covert ‘according to the myth’ in this\ncase.\n\nHowever, even the covert operator theory might be contested, on the\ngrounds that within its scope we are still unintelligibly predicating\n‘lived on Mt. Olympus’ of an abstract object. Simply\nprefixing ‘according to the myth’ to the unintelligible\ncannot render it intelligible. But there is the evident fact that (25)\nis both intelligible and true. So either prefixing ‘according to\nthe myth’ can render the unintelligible intelligible,\nor what is going on in the embedded sentence is not to be construed as\nstandard predication. For further discussion of these matters, see,\nfor example, van Inwagen 1977, Parsons 1980, Zalta 1988, Thomasson\n1998, and Salmon 2002.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Almog, J., 1998, “The Subject Verb Object Class I”,\n<em>Philosophical Perspectives</em>, 12: 39–76.",
                "Asher, N., 1987, “A Typology for Attitude Verbs”,\n<em>Linguistics and Philosophy</em>, 10: 125–1976.",
                "Carnap, R., 1947, <em>Meaning and Necessity</em>, Chicago:\nUniversity of Chicago Press.",
                "Cohen, A., 1999, <em>Think Generic!</em>, Stanford: CSLI\nPublications.",
                "Crimmins, M., 1992, <em>Talk About Belief</em>, Cambridge, MA: The\nMIT Press.",
                "Davidson, D., 1969, “On Saying That”, in <em>Words and\nObjections: Essays on the Work of W. V. Quine</em>, D. Davidson and J.\nHintikka (ed.), Dordrecht: Reidel: 158–174.",
                "Davidson, D., 1967, “The Logical Form of Action\nSentences”, in <em>The Logic of Decision and Action</em>, N.\nRescher (ed.), Pittsburgh: University of Pittsburgh Press. Reprinted\nin <em>Essays on Actions and Events</em> by Donald Davidson. Oxford:\nOxford University Press 1980, pp. 105–121.",
                "den Dikken, M., R. Larson and P. Ludlow, 1996,\n“Intensional ‘Transitive’ Verbs and Concealed\nComplement Clauses”, <em>Rivista di Linguistica</em>, 8:\n331–348; also (slightly abridged) in <em>Readings in the\nPhilosophy of Language</em> P. Ludlow (ed.), Cambridge, MA: The MIT\nPress 1997, 1041–1053.",
                "–––, 2018,\n“Intensional Transitive Verbs and Abstract Clausal\nComplementation”. In <em>Non-Propositional Intentionality</em>,\nA. Grzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 46–94.",
                "Dowty, D., R. Wall, and S. Peters, 1981, <em>Introduction to\nMontague Semantics</em>, Dordrecht: Kluwer Academic Publishers.",
                "Forbes, G., 2000, “Objectual Attitudes”,\n<em>Linguistics and Philosophy</em>, 23(2): 141–183.",
                "–––, 2006, <em>Attitude Problems</em>, Oxford\nand New York: Oxford University Press.",
                "–––, 2018, “Content and Theme in Attitude\nAscriptions”, in <em>Non-Propositional Intentionality</em>, A.\nGrzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 114–133.",
                "Fox, D., 2007, “Free Choice and the Theory of Scalar\nImplicatures”, in <em>Presupposition and Implicature in\nCompositional Semantics</em>, U. Sauerland and P. Stateva (ed.), New\nYork: Palgrave Macmillan, 537–586.",
                "Gluer, K. and P. Pagin, 2012, “General Terms and Relational\nModality”, <em>Noûs</em>, 46(1): 159–199.",
                "Graff Fara, Delia, 2013, “Specifying Desires”,\n<em>Noûs</em>, 47(2): 250–272.",
                "Grzankowski, A., 2018, “A Theory of Non-Propositional\nAttitudes”, in <em>Non-Propositional Intentionality</em>, A.\nGrzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 134–151.",
                "Harley, H., 2004, “Wanting, Having and Getting: A Note on\nFodor and Lepore 1998”, <em>Linguistic Inquiry</em>, 35(2):\n255–267.",
                "Heim, I. and A. Kratzer, 1998, <em>Semantics in Generative\nGrammar</em>, Oxford and New York: Basil Blackwell.",
                "van Inwagen, Peter, 1977, “Creatures of Fiction”,\n<em>American Philosophical Quarterly</em>, 14: 299–308.",
                "Jennings, R. E., 1994, <em>The Genealogy of Disjunction</em>,\nOxford and New York: Oxford University Press.",
                "Kamp, H., 1973, “Free Choice Permission”,\n<em>Proceedings of the Aristotelian Society</em>, 74:\n57–94.",
                "Kaplan, D., 1986, “Opacity”, in <em>The Philosophy of\nW. V. Quine</em>, L. E. Hahn and P. A. Schilpp (ed.), LaSalle: Open\nCourt, 229–289.",
                "Keenan, E., 2003, “The Definiteness Effect: Semantic or\nPragmatic?” <em>Natural Language Semantics</em>, 11:\n187–216.",
                "King, J., 2002, “Designating Propositions”, <em>The\nPhilosophical Review</em>, 111(3): 341–371.",
                "Kripke, S., 1972, “Naming and Necessity”, in\n<em>Semantics of Natural Language</em>, D. Davidson and G. Harman\n(ed.), Dordrecht: Reidel Publishing Company, 252–355. Reprinted\nas <em>Naming and Necessity</em> by Saul Kripke, Oxford: Basil\nBlackwell, 1980.",
                "Larson, R., 2001, “The Grammar of Intensionality”, in\n<em>Logical Form and Natural Language</em>, G. Preyer and G. Peter\n(ed.), Oxford and New York: Oxford University Press,\n228–262.",
                "Leslie, S-J., 2008, “Generics: Cognition and\nAcquisition”, <em>The Philosophical Review</em>, 117(1):\n1–47.",
                "Lewis, D., 1972, “General Semantics”, in <em>Semantics\nof Natural Language</em>, D. Davidson and G. Harman (ed.), Dordrecht:\nReidel: 169–218.",
                "Loewer, B., 1976, “Counterfactuals with Disjunctive\nAntecedents”, <em>The Journal of Philosophy</em>, 73:\n531–537.",
                "Makinson, D., 1984, “Stenius’ Approach to Disjunctive\nPermission”, <em>Theoria</em>, 50: 138–147.",
                "Moltmann, F., 1997, “Intensional Verbs and\nQuantifiers”, <em>Natural Language Semantics</em>, 5(1):\n1–52.",
                "–––, 2008, “Intensional Verbs and Their\nIntentional Objects”, <em>Natural Language Semantics</em>,\n16(3): 239–270.",
                "Montague, M., 2007, “Against Propositionalism”,\n<em>Noûs</em>, 41: 503–518.",
                "Montague, R., 1973, “The Proper Treatment of Quantification\nin Ordinary English”, in <em>Approaches to Natural\nLanguage</em>, J. Hintikka, J. Moravcsik and P. Suppes(ed.),\nDordrecht: Reidel Publishing Company. Also in Montague 1974:\n242–270.",
                "–––, 1974, <em>Formal Philosophy: Selected\nPapers of Richard Montague</em>, edited by Richmond Thomason, New\nHaven and London: Yale University Press.",
                "Muskens, R., 2005, “Sense and the Computation of\nReference”, <em>Linguistics and Philosophy</em>, 29(4):\n473–504.",
                "Nebel, J., 2019, “Hopes, Fears and Other Grammatical\nScarecrows”, <em>The Philosophical Review</em>, 128(1):\n63–105.",
                "Parsons, T., 1980, <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.",
                "–––, 1990, <em>Events in the Semantics of\nEnglish</em>, Cambridge, MA: The MIT Press.",
                "–––, 1997, “Meaning Sensitivity and\nGrammatical Structure”, in <em>Structures and Norms in\nScience</em>, M. L.  Dalla Chiara, K. Doets, D. Mundici and\nJ. v. Benthem (ed.), Dordrecht: Kluwer Academic Publishers:\n369–383.",
                "Partee, B., 1974, “Opacity and Scope”, in\n<em>Semantics and Philosophy</em>, M. Munitz and P. Unger (ed.), New\nYork: NYU Press, 81–101.",
                "Proust, M., 1998, <em>À La Recherche du Temps Perdu:\nCombray</em>, adaptation and drawings by Stéphane Heuet, colors\nby Véronique Doray, Luçon: Delcourt.",
                "Pietroski, P., 2000, “On Explaining That”, <em>The\nJournal of Philosophy</em>, 97(12): 655–662.",
                "–––, 2005, <em>Events and Semantic\nArchitecture</em>, Oxford and New York: Oxford University Press.",
                "Prior, A. N., 1963, “Oratio Obliqua”, <em>Proceedings\nof the Aristotelian Society, Supplementary Volume</em>, 37:\n115–146.",
                "Quine, W. V., 1956, “Quantifiers and Propositional\nAttitudes”, <em>The Philosophical Review</em>, 53:\n177–187.",
                "Richard, M., 2001, “Seeking a Centaur, Adoring Adonis:\nIntensional Transitives and Empty Terms”, in <em>Figurative\nLanguage</em> (Midwest Studies in Philosophy Volume 25), P. French and\nH. Wettstein (ed.), Oxford and New York: Basil Blackwell,\n103–127.",
                "Sainsbury, M., 2018, <em>Thinking About Things</em>, Oxford and\nNew York: Oxford University Press.",
                "Salmon, N., 1986, <em>Frege’s Puzzle</em>, Cambridge, Mass.: The\nMIT Press.",
                "–––, 2002, “Mythical Objects”, in\nJ. Campbell, M. O’Rourke and D. Shier (ed.), <em>Meaning and\nTruth</em>, New York: Seven Bridges Press, 105–123.",
                "Schwarz, F., 2006, “On <em>needing</em> Propositions and\n<em>looking for</em> Properties”, <em>Proceedings of Semantics\nand Linguistic Theory XVI</em>, M. Gibson, J. Howell (ed.), CLC\nPublications, Ithaca, New York, 259–276.",
                "Simons, M., 2005, “Dividing Things Up: The Semantics of\n‘Or’ and the Modal/‘Or’ Interaction”,\n<em>Natural Language Semantics</em>, 13: 271–316.",
                "Thomason, R., 1980, “A Model Theory for Propositional\nAttitudes”, <em>Linguistics and Philosophy</em>, 4:\n47–70.",
                "Thomasson, A., 1998, <em>Fiction and Metaphysics</em>, Cambridge:\nCambridge University Press.",
                "Zalta, E., 1988, <em>Intensional Logic and the Metaphysics of\nIntentionality</em>, Cambridge, MA: The MIT Press.",
                "Zimmerman, T. E., 1993, “On the Proper Treatment of Opacity\nin Certain Verbs”, <em>Natural Language Semantics</em>, 1:\n149–179.",
                "–––, 2000, “Free Choice Disjunction and\nEpistemic Possibility”, <em>Natural Language Semantics</em>,\n8(4): 255–290.",
                "–––, 2001, “Unspecificity and\nIntensionality”, in <em>Audiatur Vox Sapentiae</em>, C.\nFéry and W. Sternefeld (ed.), Berlin: Akademie Verlag.",
                "–––, 2006, “Monotonicity in Opaque\nVerbs”, <em>Linguistics and Philosophy</em>, 29:\n715–761."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Almog, J., 1998, “The Subject Verb Object Class I”,\n<em>Philosophical Perspectives</em>, 12: 39–76.</li>\n<li>Asher, N., 1987, “A Typology for Attitude Verbs”,\n<em>Linguistics and Philosophy</em>, 10: 125–1976.</li>\n<li>Carnap, R., 1947, <em>Meaning and Necessity</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Cohen, A., 1999, <em>Think Generic!</em>, Stanford: CSLI\nPublications.</li>\n<li>Crimmins, M., 1992, <em>Talk About Belief</em>, Cambridge, MA: The\nMIT Press.</li>\n<li>Davidson, D., 1969, “On Saying That”, in <em>Words and\nObjections: Essays on the Work of W. V. Quine</em>, D. Davidson and J.\nHintikka (ed.), Dordrecht: Reidel: 158–174.</li>\n<li>Davidson, D., 1967, “The Logical Form of Action\nSentences”, in <em>The Logic of Decision and Action</em>, N.\nRescher (ed.), Pittsburgh: University of Pittsburgh Press. Reprinted\nin <em>Essays on Actions and Events</em> by Donald Davidson. Oxford:\nOxford University Press 1980, pp. 105–121.</li>\n<li>den Dikken, M., R. Larson and P. Ludlow, 1996,\n“Intensional ‘Transitive’ Verbs and Concealed\nComplement Clauses”, <em>Rivista di Linguistica</em>, 8:\n331–348; also (slightly abridged) in <em>Readings in the\nPhilosophy of Language</em> P. Ludlow (ed.), Cambridge, MA: The MIT\nPress 1997, 1041–1053.</li>\n<li>–––, 2018,\n“Intensional Transitive Verbs and Abstract Clausal\nComplementation”. In <em>Non-Propositional Intentionality</em>,\nA. Grzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 46–94.</li>\n<li>Dowty, D., R. Wall, and S. Peters, 1981, <em>Introduction to\nMontague Semantics</em>, Dordrecht: Kluwer Academic Publishers.</li>\n<li>Forbes, G., 2000, “Objectual Attitudes”,\n<em>Linguistics and Philosophy</em>, 23(2): 141–183.</li>\n<li>–––, 2006, <em>Attitude Problems</em>, Oxford\nand New York: Oxford University Press.</li>\n<li>–––, 2018, “Content and Theme in Attitude\nAscriptions”, in <em>Non-Propositional Intentionality</em>, A.\nGrzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 114–133.</li>\n<li>Fox, D., 2007, “Free Choice and the Theory of Scalar\nImplicatures”, in <em>Presupposition and Implicature in\nCompositional Semantics</em>, U. Sauerland and P. Stateva (ed.), New\nYork: Palgrave Macmillan, 537–586.</li>\n<li>Gluer, K. and P. Pagin, 2012, “General Terms and Relational\nModality”, <em>Noûs</em>, 46(1): 159–199.</li>\n<li>Graff Fara, Delia, 2013, “Specifying Desires”,\n<em>Noûs</em>, 47(2): 250–272.</li>\n<li>Grzankowski, A., 2018, “A Theory of Non-Propositional\nAttitudes”, in <em>Non-Propositional Intentionality</em>, A.\nGrzankowski and M. Montague (ed.), Oxford and New York: Oxford\nUniversity Press, 134–151.</li>\n<li>Harley, H., 2004, “Wanting, Having and Getting: A Note on\nFodor and Lepore 1998”, <em>Linguistic Inquiry</em>, 35(2):\n255–267.</li>\n<li>Heim, I. and A. Kratzer, 1998, <em>Semantics in Generative\nGrammar</em>, Oxford and New York: Basil Blackwell.</li>\n<li>van Inwagen, Peter, 1977, “Creatures of Fiction”,\n<em>American Philosophical Quarterly</em>, 14: 299–308.</li>\n<li>Jennings, R. E., 1994, <em>The Genealogy of Disjunction</em>,\nOxford and New York: Oxford University Press.</li>\n<li>Kamp, H., 1973, “Free Choice Permission”,\n<em>Proceedings of the Aristotelian Society</em>, 74:\n57–94.</li>\n<li>Kaplan, D., 1986, “Opacity”, in <em>The Philosophy of\nW. V. Quine</em>, L. E. Hahn and P. A. Schilpp (ed.), LaSalle: Open\nCourt, 229–289.</li>\n<li>Keenan, E., 2003, “The Definiteness Effect: Semantic or\nPragmatic?” <em>Natural Language Semantics</em>, 11:\n187–216.</li>\n<li>King, J., 2002, “Designating Propositions”, <em>The\nPhilosophical Review</em>, 111(3): 341–371.</li>\n<li>Kripke, S., 1972, “Naming and Necessity”, in\n<em>Semantics of Natural Language</em>, D. Davidson and G. Harman\n(ed.), Dordrecht: Reidel Publishing Company, 252–355. Reprinted\nas <em>Naming and Necessity</em> by Saul Kripke, Oxford: Basil\nBlackwell, 1980.</li>\n<li>Larson, R., 2001, “The Grammar of Intensionality”, in\n<em>Logical Form and Natural Language</em>, G. Preyer and G. Peter\n(ed.), Oxford and New York: Oxford University Press,\n228–262.</li>\n<li>Leslie, S-J., 2008, “Generics: Cognition and\nAcquisition”, <em>The Philosophical Review</em>, 117(1):\n1–47.</li>\n<li>Lewis, D., 1972, “General Semantics”, in <em>Semantics\nof Natural Language</em>, D. Davidson and G. Harman (ed.), Dordrecht:\nReidel: 169–218.</li>\n<li>Loewer, B., 1976, “Counterfactuals with Disjunctive\nAntecedents”, <em>The Journal of Philosophy</em>, 73:\n531–537.</li>\n<li>Makinson, D., 1984, “Stenius’ Approach to Disjunctive\nPermission”, <em>Theoria</em>, 50: 138–147.</li>\n<li>Moltmann, F., 1997, “Intensional Verbs and\nQuantifiers”, <em>Natural Language Semantics</em>, 5(1):\n1–52.</li>\n<li>–––, 2008, “Intensional Verbs and Their\nIntentional Objects”, <em>Natural Language Semantics</em>,\n16(3): 239–270.</li>\n<li>Montague, M., 2007, “Against Propositionalism”,\n<em>Noûs</em>, 41: 503–518.</li>\n<li>Montague, R., 1973, “The Proper Treatment of Quantification\nin Ordinary English”, in <em>Approaches to Natural\nLanguage</em>, J. Hintikka, J. Moravcsik and P. Suppes(ed.),\nDordrecht: Reidel Publishing Company. Also in Montague 1974:\n242–270.</li>\n<li>–––, 1974, <em>Formal Philosophy: Selected\nPapers of Richard Montague</em>, edited by Richmond Thomason, New\nHaven and London: Yale University Press.</li>\n<li>Muskens, R., 2005, “Sense and the Computation of\nReference”, <em>Linguistics and Philosophy</em>, 29(4):\n473–504.</li>\n<li>Nebel, J., 2019, “Hopes, Fears and Other Grammatical\nScarecrows”, <em>The Philosophical Review</em>, 128(1):\n63–105.</li>\n<li>Parsons, T., 1980, <em>Nonexistent Objects</em>, New Haven: Yale\nUniversity Press.</li>\n<li>–––, 1990, <em>Events in the Semantics of\nEnglish</em>, Cambridge, MA: The MIT Press.</li>\n<li>–––, 1997, “Meaning Sensitivity and\nGrammatical Structure”, in <em>Structures and Norms in\nScience</em>, M. L.  Dalla Chiara, K. Doets, D. Mundici and\nJ. v. Benthem (ed.), Dordrecht: Kluwer Academic Publishers:\n369–383.</li>\n<li>Partee, B., 1974, “Opacity and Scope”, in\n<em>Semantics and Philosophy</em>, M. Munitz and P. Unger (ed.), New\nYork: NYU Press, 81–101.</li>\n<li>Proust, M., 1998, <em>À La Recherche du Temps Perdu:\nCombray</em>, adaptation and drawings by Stéphane Heuet, colors\nby Véronique Doray, Luçon: Delcourt.</li>\n<li>Pietroski, P., 2000, “On Explaining That”, <em>The\nJournal of Philosophy</em>, 97(12): 655–662.</li>\n<li>–––, 2005, <em>Events and Semantic\nArchitecture</em>, Oxford and New York: Oxford University Press.</li>\n<li>Prior, A. N., 1963, “Oratio Obliqua”, <em>Proceedings\nof the Aristotelian Society, Supplementary Volume</em>, 37:\n115–146.</li>\n<li>Quine, W. V., 1956, “Quantifiers and Propositional\nAttitudes”, <em>The Philosophical Review</em>, 53:\n177–187.</li>\n<li>Richard, M., 2001, “Seeking a Centaur, Adoring Adonis:\nIntensional Transitives and Empty Terms”, in <em>Figurative\nLanguage</em> (Midwest Studies in Philosophy Volume 25), P. French and\nH. Wettstein (ed.), Oxford and New York: Basil Blackwell,\n103–127.</li>\n<li>Sainsbury, M., 2018, <em>Thinking About Things</em>, Oxford and\nNew York: Oxford University Press.</li>\n<li>Salmon, N., 1986, <em>Frege’s Puzzle</em>, Cambridge, Mass.: The\nMIT Press.</li>\n<li>–––, 2002, “Mythical Objects”, in\nJ. Campbell, M. O’Rourke and D. Shier (ed.), <em>Meaning and\nTruth</em>, New York: Seven Bridges Press, 105–123.</li>\n<li>Schwarz, F., 2006, “On <em>needing</em> Propositions and\n<em>looking for</em> Properties”, <em>Proceedings of Semantics\nand Linguistic Theory XVI</em>, M. Gibson, J. Howell (ed.), CLC\nPublications, Ithaca, New York, 259–276.</li>\n<li>Simons, M., 2005, “Dividing Things Up: The Semantics of\n‘Or’ and the Modal/‘Or’ Interaction”,\n<em>Natural Language Semantics</em>, 13: 271–316.</li>\n<li>Thomason, R., 1980, “A Model Theory for Propositional\nAttitudes”, <em>Linguistics and Philosophy</em>, 4:\n47–70.</li>\n<li>Thomasson, A., 1998, <em>Fiction and Metaphysics</em>, Cambridge:\nCambridge University Press.</li>\n<li>Zalta, E., 1988, <em>Intensional Logic and the Metaphysics of\nIntentionality</em>, Cambridge, MA: The MIT Press.</li>\n<li>Zimmerman, T. E., 1993, “On the Proper Treatment of Opacity\nin Certain Verbs”, <em>Natural Language Semantics</em>, 1:\n149–179.</li>\n<li>–––, 2000, “Free Choice Disjunction and\nEpistemic Possibility”, <em>Natural Language Semantics</em>,\n8(4): 255–290.</li>\n<li>–––, 2001, “Unspecificity and\nIntensionality”, in <em>Audiatur Vox Sapentiae</em>, C.\nFéry and W. Sternefeld (ed.), Berlin: Akademie Verlag.</li>\n<li>–––, 2006, “Monotonicity in Opaque\nVerbs”, <em>Linguistics and Philosophy</em>, 29:\n715–761.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "compositionality",
            "Frege, Gottlob",
            "generic generalizations",
            "logic: intensional",
            "Prior, Arthur",
            "propositional attitude reports",
            "semantics: Montague"
        ],
        "entry_link": [
            {
                "../compositionality/": "compositionality"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../generics/": "generic generalizations"
            },
            {
                "../logic-intensional/": "logic: intensional"
            },
            {
                "../prior/": "Prior, Arthur"
            },
            {
                "../prop-attitude-reports/": "propositional attitude reports"
            },
            {
                "../montague-semantics/": "semantics: Montague"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=intensional-trans-verbs\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/intensional-trans-verbs/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=intensional-trans-verbs&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/intensional-trans-verbs/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=intensional-trans-verbs": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/intensional-trans-verbs/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=intensional-trans-verbs&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/intensional-trans-verbs/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}