{
    "url": "leibniz-ethics",
    "title": "Leibniz’s Ethics",
    "authorship": {
        "year": "Copyright © 2016",
        "author_text": "Andrew Youpa\n<ayoupa@siu.edu>",
        "author_links": [
            {
                "mailto:ayoupa%40siu%2eedu": "ayoupa@siu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2016</a> by\n\n<br/>\nAndrew Youpa\n&lt;<a href=\"mailto:ayoupa%40siu%2eedu\"><em>ayoupa<abbr title=\" at \">@</abbr>siu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Aug 26, 2004",
        "substantive revision Mon Oct 31, 2016"
    ],
    "preamble": "\n\nAlthough Leibniz never wrote a systematic ethical treatise, in his\nview theology is a type of jurisprudence, a science of law (NE, p.\n526). And Leibniz contributed a systematic work to the field of\ntheology, namely, the Theodicy (1710), the only large-scale\nphilosophical work that he published during his lifetime. Given that\nLeibniz the natural theologian and metaphysician is, at the same time,\na moral philosopher, ethics has a central place in his philosophical\nsystem. No divisions exist among the nominally different fields. Thus\nthe view that he never wrote a systematic ethical treatise is not true\nwithout qualification. Moreover, the fact that he views theology as a\nscience of law provides some insight into the character of his ethics.\nHe offers a natural law theory, and, like other such theories, its\nbasic structure consists of a theory of the good and a theory of law.\nCompliance with the principles spelled out in the latter is necessary\nand sufficient to achieve the good. Since, according to Leibniz, God\nis the measure of the good, the primary directive of his ethics is\nthat one ought to imitate divinity as far as possible.\n",
    "toc": [
        {
            "#1": "1. Theory of the Good"
        },
        {
            "#2": "2. Natural Law Theory"
        },
        {
            "#3": "3. Moral Psychology"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n\n1. Theory of the Good\n\nLeibniz's ethics centers on a composite theory of the good. Three\nlongstanding philosophical doctrines compose the theory: (1) the\nPlatonic view that goodness is coextensive with reality or being, (2)\nthe perfectionist view that the highest good consists in the\ndevelopment and perfection of one's nature, and (3) the hedonist view\nthat the highest good is pleasure. This set of doctrines is disclosed\nin Leibniz's tripartite division of the good into the metaphysical\ngood, the moral good, and the physical good (T §209, p. 258). He\nequates the metaphysical good with reality, moral goodness with\nvirtue, and the physical good with pleasure. Moreover, with each type\nof good exists a correlative type of evil. The metaphysical good of\nreality correlates with the metaphysical evil of privation of reality\nor non-being. Similarly, the moral goodness of virtue relates to the\nmoral evil of sin or vice. Finally, the physical good of pleasure is\ncontrary to the physical evil of pain (T §21, p. 136). The theory\nconstructed out of these divergent doctrines illustrates Leibniz's\neclectic approach to philosophical investigation. As he puts it in a\ncomment on his own system of philosophy, “This system appears to\nunite Plato with Democritus, Aristotle with Descartes, the Scholastics\nwith the moderns, theology and morality with reason. Apparently it\ntakes the best from all systems and then advances further than anyone\nhas yet done” (NE, p. 71).   \n\nBefore looking at the way he attempts to advance moral philosophy and\nthe theory of the good, it will help to have some background\nconcerning what Leibniz calls the metaphysical good and its\ncorrelative metaphysical evil. In uniting goodness with\nreality, Leibniz borrows, not without putting his own stamp on it, a\nview that had currency with certain medieval philosophers (e.g.,\nAugustine, Boethius, and Aquinas). The doctrine nonetheless originated\nin the Neoplatonic philosophy of Plotinus (204–269) and Porphyry\n(234–c.305), though there is clearly suggestion of it in Plato\n(e.g., Republic 518c, Timaeus 28b). In reuniting\ngoodness and reality, or to what he interchangeably refers to as\nperfection, Leibniz thus characteristically recovers and\nattempts to restore a doctrine that had currency among medieval\nthinkers (for a study of the medieval treatment of the doctrine of\nmetaphysical goodness, see the essays in MacDonald (ed.) 1991).\n\nReality (i.e., perfection) in Leibniz's view is not the sort of thing\nthat something either has or does not have. It is not an\nall-or-nothing matter. Rather, perfection is scalar—it comes in\nvarying degrees. God has infinite perfection, the maximum amount,\nbecause He is limitless (PE, “Monadology,” §41).\nEvery existent other than God, including the universe, possesses a\nlimited degree of perfection. “For,” as Leibniz explains,\n“God could not give the creature all without making of it a God;\ntherefore there must needs be different degrees in the perfection of\nthings, and limitations also of every kind” (T §31, p.\n142). Because nothing but God is infinite, everything else exhibits\nmetaphysical perfection in varying, limited degrees.\n\nSince everything but God exhibits a finite level of perfection,\neverything but God also exhibits a degree of imperfection, some\nprivation of reality. Privation of reality necessarily belongs to\ncreation in the sense that it is logically impossible for a created\nthing to be unlimited (PE, “Principles of Nature and Grace,\nBased on Reason,” §9; T §20, p. 135). Only that whose\nexistence is absolutely necessary and therefore depends on nothing\nother than itself has infinite perfection. For Leibniz, metaphysical\nevil is the privation of reality inherent in the natures of created\nthings (T §21, p. 136) (for further reading on Leibniz's\nconception of metaphysical evil, see Latzer 1994 and Antognazza\n2014).\n\nIn a letter in which he replies to an inquiry by the philosopher\nChristian Wolff (1679–1754) about the concept of perfection,\nLeibniz gives the following analysis:\n\nPerfection is the harmony of things, or the state where\neverything is worthy of being observed, that is, the state of\nagreement [consensus] or identity in variety; you can even\nsay that it is the degree of contemplatibility\n[considerabilitas] (PE, 18 May 1715, p. 233–4).\n\n\nThis indicates that there are in a sense two aspects of metaphysical\nperfection. First, metaphysical perfection is constituted by harmony,\nthat is, unity in variety. A situation is harmonious to the extent\nthat a variety of things are ordered in accordance with general laws\nor principles, such as laws of motion governing terrestrial and\ncelestial objects (PE, “Principles of Nature and Grace, Based on\nReason,” §11). Second, that which possesses a degree of\nmetaphysical perfection in the sense of harmony can also be said to be\nworthy of observation to some extent. If there were nothing ordered in\naccordance with general laws, there would be nothing worthy of\nobservation because everything would be submerged in chaos. Thus\nharmony makes something contemplatible, like a painting by the Italian\nRenaissance artist Raphael (PW, “Codex Iuris Gentium,” p.\n171).\n\nLeibniz's ethics is therefore perfectionist in two distinct but\nrelated senses. On the one hand, the metaphysical good consists in the\nreality of a thing, its degree of metaphysical perfection, which is\nidentical to its harmony. This may be called metaphysical\nperfectionism. On the other hand, Leibniz maintains that moral\ngoodness involves the development and perfection of a characteristic\nor set of characteristics fundamental to human nature. Such a\ncharacteristic in a cultivated state is called a virtue. This is\nmoral perfectionism. For Leibniz, metaphysical perfection is\na necessary condition for moral perfection in that intellectual\napprehension of harmony gives rise to moral perfection.\n\nTo see how he arrives at this position, it is necessary to return to\nthe other two types of goodness: the moral good and the physical good.\n“Virtue,” according to Leibniz, “is the habit of\nacting according to wisdom” (PW, “Felicity,”\n§1, p. 83). Yet one virtue in particular reigns supreme and\ncontains all the others, and that virtue is justice, which Leibniz\ndefines as the “charity of the wise man” (PW, “Codex\nIuris Gentium,” p. 171; cf. PW, p. 57 & p. 83). One whose\nlove is guided by wisdom possesses the charity of the wise. Love is\nthe pleasure one takes in the happiness and perfection of others (PW,\n“Felicity,” §5; NE, p. 163). God's wisdom is infinite\nand His love is universal, extending to all beings capable of\nhappiness. God's universal benevolence, Leibniz suggests, is an ideal\nwe ought to do our best to imitate and continuously aspire to (PW,\n“Meditation on the Common Concept of Justice”, pp.\n57–8; cf. PE, “Principles of Nature and Grace, Based on\nReason,” §14, pp. 211–12). The more one's benevolence\nexpands to encompass the happiness of more and more others, the more\none grows in justice and virtue, thereby increasing in moral goodness\n(for further reading on Leibniz's view of justice as the charity of\nthe wise, see Riley 1996 (Chapter 4) and 2003).\n\nThe physical good thus bridges the moral good with the metaphysical\ngood. It links virtue and harmony because, for Leibniz, pleasure is\nthe perception or knowledge of perfection. Pain, on the other hand, is\nthe perception or knowledge of imperfection (NE, p. 194; PW,\n“Felicity,” §4). A sensual pleasure, such as the\npleasure of listening to music or that of viewing a painting, is a\nconfused perception of perfection (i.e., a confused perception of\nharmony). In contrast, an intellectual pleasure, such as the pleasure\nof knowing the fundamental order of reality, is a distinct perception\nof perfection. Sensual pleasures in some cases approximate\nintellectual pleasures, but they inevitably fall short because they\ntend to be deceptive and transitory, whereas intellectual pleasures\nare pure and lasting, and true happiness, according to Leibniz, is\nsimply a lasting state of pleasure (PW, “Felicity,”\n§3; NE, p. 194).\n\nDespite his identification of happiness with lasting pleasure,\nhowever, it is an oversimplification to characterize Leibniz's theory\nof the good as nothing more than a form of hedonism. Given that\npleasure is a confused or distinct apprehension of harmony, knowledge\nserves as the necessary means by which an individual cultivates the\nmoral good, the charity of the wise. Knowledge of the perfection of\nothers, of the perfection of the universe, and of God, the perfect\nbeing, is inherently pleasurable and concomitantly contributes to the\nproper order of one's character by generating love in conformity with\nwisdom.\n\nThe harmony of the universe then is a precondition for virtue and\nhappiness, but harmony alone is not sufficient. Knowledge is also\nnecessary. If there were no minds, or if there were no minds capable\nof knowledge, the universe would be devoid of virtue and happiness.\nThus knowledge unifies Leibniz's composite theory of the good. He\nsays,\n\n§15. One must hold as certain that the more a mind desires to\nknow order, reason, the beauty of things which God has produced, and\nthe more he is moved to imitate this order in the things which God has\nleft to his direction, the happier he will be.\n\n\n§16. It is most true, as a result, that one cannot know God\nwithout loving one's brother, that one cannot have wisdom without\nhaving charity (which is the real touchstone of virtue), and that one\neven advances one's own good in working for that of others….\n(PW, “Felicity,” p. 84)\n\n\nThe intellectualist cast of Leibniz's ethics stands out unmistakably\nin this passage. Knowledge of the order, rationality, and beauty of\ncreation is necessary for happiness. So too is actively imitating that\norder. Together, they are sufficient. Without knowledge, action and\nthe effort to promote the perfection of others do not necessarily meet\nwith success and may even backfire, leading to greater physical evil.\nWithout actively promoting rational order, knowledge alone does not\nlead to happiness. Leibniz's ethics no doubt has an intellectualist\ncharacter, but mere passive contemplation of the rational order of the\nuniverse is not the ideal of moral goodness. Instead, moral goodness\ncombines knowledge of the rational order with the active promotion of\nrational order as far as possible (for a discussion of Leibniz's view\nof the role of divine grace in the attainment of salvation, see\nRutherford 2014).\n2. Natural Law Theory\n\nSo far we have seen that, for Leibniz, the human good consists in the\nlasting state of pleasure that accompanies moral perfection. \nMoral perfection, in turn, is cultivated through the perpetual pursuit\nand acquisition of knowledge of the perfection of others, the\nuniverse, and God. Although all knowledge contributes to moral\nperfection and is therefore practical in a broad sense of the term,\nethics nevertheless is a distinct branch of science, capable of the\nsame level of demonstrative rigor as arithmetic and geometry (NE,\nPreface, p. 50; PW, “Meditation on the Common Concept of\nJustice,” pp. 49–50). Leibniz shares this view of ethics\nwith other important seventeenth-century thinkers, such as Hobbes\n(1588–1679), Spinoza (1632–1677), and Locke\n(1632–1704). And although Leibniz never wrote a comprehensive\nethical treatise in the geometrical style, it is clear from what he\nleft us that, in addition to a naturalistic-metaphysical theory of the\ngood, ethical science also includes a science of natural law. \n\nAs a natural law theorist, Leibniz holds that compliance with the set\nof universal ethical principles that make up the natural law is\nnecessary and sufficient to achieve the good. Also, like the eminent\nmodern natural lawyer Hugo Grotius (1583–1645), whom Leibniz\ngreatly admired—referring to him as the “incomparable\nGrotius” (PW, “Opinion on the Principles of\nPufendorf,” p. 65; T §6, p. 77), he believes that the\nnatural law and the obligation to comply with it are independent of\nGod's will. It is not possible, in other words, for God to have\nlegislated a different set of moral absolutes than those that obtain;\nnor do the moral absolutes derive their obligatory authority from\nhaving been legislated by God. According to Leibniz,\n\nNeither the norm of conduct itself, nor the essence of the just,\ndepends on his [God's] free decision, but rather on eternal truths,\nobjects of the divine intellect, which constitute, so to speak, the\nessence of divinity itself. . . . And, indeed, justice follows certain\nrules of equality and of proportion [which are] no less founded in the\nimmutable nature of things, and in the divine ideas, than are the\nprinciples of arithmetic and of geometry (PW, “Opinion on the\nPrinciples of Pufendorf,” p. 71).\n\n\nThe concept of justice in Leibniz's view is fixed independent of God's\nchoice, and so God has no more power to alter the nature of justice\nthan He does to alter the nature of circularity.\n\nThe idea that justice and moral obligation do not depend on a free\ndecree of God is a significant doctrine in Leibniz's philosophy. In\nthe seventeenth and eighteenth centuries, a focal point of debate in\nmoral philosophy centered on a version of the Euthyphro\nproblem—between those who sided with Grotius and Leibniz in\nholding that moral goodness and obligation do not depend on God's will\nand those who held the opposite view, that moral goodness and\nobligation are as they are as a result of God's free choice. Two of\nthe most important seventeenth-century proponents of the latter,\nvoluntarist position are Thomas Hobbes and Samuel Pufendorf\n(1632–1694). Leibniz's objections to voluntarism became widely\nknown in the early eighteenth century when a letter he wrote attacking\nvoluntarism was appended to a new edition of Pufendorf's The Duty\nof Man and Citizen (1718). This anti-voluntarist tract,\n“Opinion on the Principles of Pufendorf” (written in\n1706), contains one of his fullest discussions of justice. A full\ntreatment of Leibniz's anti-voluntarism would take us too far afield,\nbut a central criticism is that, in regarding moral goodness and\nobligation as dependent on God's free choice, voluntarism undermines\nthe basis for our love of God (PW, “Opinion on the Principles of\nPufendorf,” p. 71–2). If, as the voluntarist holds, moral\ngoodness is an artifact of God, it is not an essential attribute of\nthe divine nature. God therefore cannot be loved for His\ngoodness.  Voluntarism thus subverts morality and religion\nbecause love of God is essential to both (for more in depth\ndiscussions of Leibniz's anti-voluntarism, see Schneewind 1998\n(250–259) and Haakonssen 1996 (46–9)).\n\nFollowing a current in the natural law tradition, Leibniz supplements\nhis account of justice as the charity of the wise with three\nprinciples handed down from Roman law via Justinian's\nInstitutes (533 AD). The three principles are “to hurt\nno one” (neminem laedere), “to give each his\ndue” (suum cuique tribuere), and “to live\nhonorably” (honeste vivere) or, as Leibniz glosses it,\nto live piously. Leibniz suggests that these principles underwrite\nthree distinct degrees of justice (PW, “Codex Iuris\nGentium,” pp. 171–2). The lowest degree is “strict\nright” (ius strictum), which has as its precept that\n“no one is to be injured, so that he will not be given a motive\nfor a legal action within the state, nor outside the state a right of\nwar” (PW, “Codex Iuris Gentium,” p. 172). Strict\nright primarily includes a bare minimum set of negative duties, such\nas the duties not to harm, not to murder, and not to commit theft. The\nfunction of this degree of justice is the “conservation of\npeace.”  The second degree Leibniz calls\n“equity” or “charity” in the narrow sense of\nthe term, which has its basis in the principle “to give each his\ndue.”  This grade of justice includes, for example, duties\nof gratitude and of charitable donation, things we owe to others but\nwhich failure to fulfill is not sanctioned by law. Whereas strict\nright functions merely to avoid misery by fostering peace, the duties\nof equity actively promote the happiness of others as far as possible\nwithin this life.\n\nStrict right and equity, he explains, correspond to Grotius’\ndistinction between perfect and imperfect rights (PW, “Codex\nIuris Gentium,” p. 172). Unlike Grotius, however, Leibniz views\nthis distinction as one of degree rather than as one of kind. Also,\nequity, the second grade of justice, comprehends strict right within\nits scope, and strict right and equity are comprehended under the\nthird and highest grade of justice, namely, piety.\n\nThe principle of piety is “to live honorably.”  An\nimportant difference between strict right and equity, on the one hand,\nand piety, on the other, is that the former pertain to our pursuit of\ngoods and avoidance of evils over the course of our natural lives\nwhile the latter pertains to our pursuit of goods and avoidance of\nevils throughout our entire lives, that is, over the whole course of\nour immortal existence. The third grade of justice thus relies on two\ncentral tenets of Leibniz's metaphysics, for which he believes there\nare demonstrative proofs; indeed, he believes he provides such proofs\n(PE, “Principles of Nature and Grace, Based on Reason,”\n§4, §8; PE, “Monadology,” §4, §38).\nThe tenets on which this account relies are (1) that the soul is\nimmortal and (2) that God is the ruler of the universe. Most relevant\nto our purpose are not the arguments he supplies in support of these\nbut, rather, the work that the theses do in his account of piety.\n\nA person is pious in Leibniz's sense of the term in virtue of being\nperfectly just, which means that the pious person loves others in\nconformity with wisdom. But it is extremely difficult to fully realize\nthis ideal love so long as one's outlook is restricted to the goods\nand evils that may be encountered in one's natural life. If one's\noutlook is limited to this life, one may come to fulfill the first and\nsecond grades of justice without too much difficulty, but rarely does\nanyone achieve the highest level of justice without consideration of\nthe soul's immortality and God's governance (PW, “Codex Iuris\nGentium,” p. 173; PW, “Meditation on the Common Concept of\nJustice,” p. 58). This is because, even though the virtuous\nperson's “interior harmony” is intrinsically pleasing,\nmost are unable to appreciate virtue due to the fact that, from the\nperspective of mortality, virtuous actions often go unrewarded while\nvicious ones go unpunished. Thus most people will not bear tremendous\nhardships for the sake of virtue. Only the most exceptional\nindividuals are willing to be virtuous and do the right thing at any\nmortal cost. And this very willingness, this “spiritual\ndisposition” as Leibniz calls it, constitutes piety (PW,\n“Meditation on the Common Concept of Justice,” p. 58).\n\nIn the opening chapter of his dialogue between himself, represented by\nTheophilus, and a spokesperson for Locke, named\nPhilalethes, Leibniz makes the following autobiographical\nremark:\n\nYou [Philalethes] had more to do with the speculative philosophers,\nwhile I was more inclined towards moral questions. But I have been\nlearning, more and more, how greatly morality can be strengthened by\nthe solid principles of true philosophy; which is why I have\nlately been studying them more intensively, and have started on some\nquite new trains of thought (NE, p. 71, emphasis added).\n\n\nWe are now in a position to see how specifically the solid principles\nof philosophy strengthen morality. True philosophy (i.e., sound\nmetaphysics) aids morality by providing grounds for assurance that in\nthe end happiness is directly proportioned to merit. The more virtuous\none is, the greater the happiness one can expect because one's\nwell-being does not completely depend on the goods of this life and\nbecause it is incompatible with God's universal benevolence and\ninfinite wisdom that even a single virtuous deed should go unrewarded\nand a vicious one unpunished. “After this,” Leibniz\nconcludes, “it must be imprudent not to be just, because no one\nwill fail to derive good or evil from what he will have done,\naccording as it is just or unjust” (PW, “Meditation on the\nCommon Concept of Justice,” pp. 58–9). Even though\nexceptional individuals may be able to remain virtuous at any apparent\nmortal cost, it follows from Leibniz's metaphysics that there is in\nfact no mortal price to pay for being virtuous. On the contrary,\nvirtue is necessary and sufficient for true happiness (for further\nreading on Leibniz's natural law theory, see Brown 1995 and\n2011a).\n3. Moral Psychology\n\nLeibniz believes that enlightened self-interest is in complete\nagreement with the requirements of virtue. The cornerstone of this\nharmony between interest and morality is metaphysics, his doctrines\nconcerning the soul's immortality and God's governance. Still, the\nvirtuous person does not regard right action and the well-being of\nothers as a means to his or her own happiness. According to Leibniz,\n\n\nThus he who acts well, not out of hope or fear, but by an inclination\nof his soul, is so far from not behaving justly that, on the contrary,\nhe acts more justly than all others, imitating, in a certain way, as a\nman, divine justice. Whoever, indeed, does good out of love for God or\nof his neighbor, takes pleasure precisely in the action itself (such\nbeing the nature of love) and does not need any other incitement, or\nthe command of a superior; for that man the saying that the law is not\nmade for the just is valid (PW, “Opinion on the Principles of\nPufendorf,” p. 72).\n\n\nNot self-love but love of others motivates the virtuous person, or\nwhat Leibniz calls “disinterested love” (PW, “Codex\nIuris Gentium,” p. 171). Metaphysics thus strengthens morality\nwithout overhauling it. In revealing that virtue alone ultimately\nsatisfies self-interest, true philosophy guides us steadfastly along\nthe path to virtue. Yet the truly virtuous person performs a morally\nright action for its own sake.\n\nDisinterested love is not completely selfless however. Nor can it\nconsistently be on Leibniz's view since he subscribes to a version of\npsychological egoism; “for we do all for our own good,” he\nmaintains, “and it is impossible for us to have other feelings\nwhatever we may say” (W, “Letter to Nicaise,” p.\n565). In his account of disinterested love, Leibniz in fact seeks to\nreconcile egoism and altruism, and, in doing so, anticipates Bishop\nButler's (1692–1752) landmark attack against psychological\negoism (BM1, Fifteen Sermons (1726), pp. 364–373).\n\nThe key to Leibniz's reconciliation is a distinction between the\npleasure involved in the satisfaction of a desire and the object of a\ndesire. Desires spur all human actions. Some desires emerge distinctly\nin conscious awareness while many do not, or do so only confusedly.\nThe former he calls volitions and the latter\nappetitions (NE, p. 173). Satisfaction of any desire gives\nits subject at least a minimal degree of pleasure, however fleeting.\nAn unfulfilled volition causes at a minimum enough suffering for one\nto be aware of it, but an unfulfilled appetition, by contrast, gives\nrise to “semi-suffering,” or what he calls, following\nLocke, “uneasiness” (NE, p. 188–9). Such\nsemi-suffering, Leibniz explains, “does not amount to\ndiscomfort, but is restricted to the elements or rudiments of\nsuffering, which we cannot be aware of in themselves but which suffice\nto act as spurs and to stimulate the will” (NE, p. 189). No\nfinite being is ever totally free of semi-sufferings and, to a lesser\ndegree, semi-pleasures. Even where we appear to ourselves to be\ncompletely indifferent about our options, unconscious desires move us\ntoward one course of action rather than another (NE, p. 188).\n\nEvery desire inclines one to joy, its immediate satisfaction and the\ntransitory pleasure arising therefrom. Moreover, Leibniz takes it as\naxiomatic that no one pursues anything but what appears to him or her\nto be the greatest good (NE, p. 185; T §45, p. 148). Failure to\nbe virtuous and achieve happiness is therefore a consequence of\nignorance, error, or inattention to what one knows. Inattention\nresults from a lapse in the ability to call to mind the knowledge one\npossesses, and this, according to Leibniz, accounts for the puzzling\npsychological phenomenon known as weakness of will  (NE, pp.\n186–187). Weakness of will, it turns out, is a type of\nforgetfulness. As such, an individual has some control over it, albeit\nindirectly. Upbringing and education certainly affect an individual's\nability to bring specific thoughts to mind, but steps may be taken to\nensure that certain considerations rather than others occur to one in\npractical deliberation (NE, p. 187 & pp. 195–196). For\nexample, Leibniz counsels,\n\nThus when a man is in a good frame of mind he ought to make himself\nlaws and rules for the future, and then carry them out strictly,\ndrawing himself away–abruptly or gradually, depending on the\nnature of the case–from situations which are capable of\ncorrupting him. A lover will be cured by a voyage undertaken just for\nthat purpose; a period of seclusion will stop us from keeping company\nwith people who confirm some bad disposition in us. (NE, p. 187)\n\n\nAdvance preparation is the key to strength of will. An individual\nneeds to equip him- or herself with principles and appropriate habits\nof thought in order to make correct choices in pressure situations.\nOtherwise, he or she is merely an instrument of conscious and\nunconscious inclinations (for a discussion of Leibniz's view of\npractical rationality see Roinila 2008).\n\nRecall that true happiness is a lasting state of pleasure. The most\ndirect route to happiness, as commonsense testifies, is not through\nthe gratification of every desire that happens to occur to one.\nVolitions and appetitions must be moderated by experience and reason\n(NE, p. 189). Experience and reason teach us to neglect or postpone\nfulfillment of some desires so that others may be fulfilled instead,\nthe most valuable among them being those that reason gives us (NE, p.\n194–5). Reason generates inclinations whose strength and objects\nare distinct, as opposed to bodily inclinations whose strength and\nobjects are confused. The confusion inherent in bodily inclinations\nmakes their fulfillment considerably more problematic than that of\nrational inclinations. The bodily desire for nourishment, for example,\nmay be satisfied by eating a piece of fruit, but, as Leibniz points\nout, “a fruit with a good taste and a good odor can conceal a\npoison” (PW, “Felicity,” §6a, p. 83).\nFulfillment of confused bodily inclinations may, and too often does,\nlead to pain and suffering further on. Such however is not the case\nwith rational inclinations. Distinct knowledge, which is a distinct\nperception of harmony, satisfies the distinct inclinations of reason.\nAnd since the universe is maximally harmonious, there is no end to the\npleasure we can derive from the acquisition of distinct knowledge.\n\nAll desires, no matter how confused or distinct, incline one toward\nthe pleasure one takes in their satisfaction. Leibniz then can be\nunderstood as subscribing to psychological egoism where by this is\nmeant that a person does all to satisfy one or more of his or her own\ninclinations. But it does not follow that all inclinations are\nalike—that, say, all of one's desires have one's own pleasure as\ntheir object. This is where the egoist goes wrong and where Leibniz\nfinds room for accommodating both egoism and altruism.  What all\nactions have in common is that they are spurred by an inclination of\nthe agent, the satisfaction of which gives him or her pleasure. But\nthe same type of object does not satisfy all inclinations alike. For\nLeibniz, some inclinations have confused sensible objects, such as the\nsweetness of fruit, the melody of a song, or the beauty of a painting.\nOthers have distinct intellectual objects, such as the perfection of\nGod, of the natural world, or of another human being. A sweet piece of\nfruit cannot satisfy a desire for perfection in the natural world any\nmore than a distinct perception of harmony in the natural world can\nsatisfy a bodily desire for nourishment. Different inclinations\nconcern different objects.\n\nTo be inclined toward the perfection of another rational being is to\nbe disposed to take pleasure in their perfection. Notice however that\nthe object of the inclination, that which one's view is fixed on, is\nnot one's own pleasure. This does not mean that an individual's own\npleasure cannot be the object of one of his or her desires. For most,\nself-love may be their predominant motive. Nevertheless, an individual\ncan have an other-directed desire for the perfection of another\nrational being, which is to have disinterested love. To love\ndisinterestedly, Leibniz explains, is to be “disposed to take\npleasure in the perfection, well-being or happiness of the object of\none's love. And this involves not thinking about or asking for any\npleasure of one's own except what one can get from the happiness or\npleasure of the loved one” (NE, p. 163). Since happiness is the\noutward manifestation of perfection, it makes no real difference\nwhether love is said to have the perfection or the happiness of\nanother rational being as its object. Leibniz thus makes the\ninsightful suggestion that, though we do everything we do out of an\ninclination whose satisfaction gives us pleasure, this is perfectly\ncompatible with desiring the perfection of another without any other\nend in view, which actually occurs whenever the object of our desire\nis another's perfection or happiness. “In truth,” Leibniz\nconcludes, “the happiness of those whose happiness pleases us\nturns into our own happiness, since things which please us are desired\nfor their own sake” (PW, “Codex Iuris Gentium,” p.\n171) (for further reading on Leibniz's conception of disinterested\nlove, see Brown 2011b).\n\nGenuine altruism, then, does not require complete selflessness.\nIndeed, selflessness, even if it were possible, would not be desirable\n(W, “Letter to Nicaise,” p. 566). After all, according to\nLeibniz,\n\nOne cannot envisage in God any other motive than that of perfection,\nor, if you like, of his pleasure; supposing (according to my\ndefinition) that pleasure is nothing but a feeling of perfection, he\nhas nothing to consider outside himself; on the contrary everything\ndepends on him. But his goodness would not be supreme, if he did not\naim at the good and at perfection so far as is possible. But what will\none say, if I show that this same motive has a place in truly virtuous\nand generous men, whose supreme function [degré] is to\nimitate divinity, in so far as human nature is capable of it? (PW,\n“Meditation on the Common Concept of Justice,” pp.\n57–8).\n\n\nImitate divinity—this is the overarching imperative of Leibniz's\nethics, if not the guiding principle of his entire philosophical\nsystem. For him, God, not humanity, is the “measure of all\nthings” (PW, “Opinion on the Principles of\nPufendorf,” p. 69). Our chief task therefore is to make\nperpetual progress toward the ideal of divine nature, for each of us\nis like a little divinity in the City of God (PE,\n“Monadology,” §83 & §85, pp. 223–4; T\n§147, pp. 215–216).\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul class=\"hanging\">\n<li>Butler, Joseph, <em>Fifteen Sermons</em>, in <em>British\nMoralists: 1650–1800</em> (Volume I), edited by D. D. Raphael,\nIndianapolis: Hackett Publishing Company, 1991.</li>\n</ul>\n<p>\nLeibniz, G. W.</p>\n<table>\n<tr>\n<td valign=\"top\">[<b>W</b>]",
                "<em>Leibniz: Selections</em>, edited by Philip P. Wiener, New\nYork: Charles Scribner's Sons, 1951. </tr>\n<tr>\n<td valign=\"top\">[<b>M</b>]",
                "<em>Leibniz: The Monadology and Other Philosophical\nWritings</em>, translated with introduction and notes by Robert Latta,\nOxford: Oxford University Press, 1898. </tr>\n<tr>\n<td valign=\"top\">[<b>NE</b>]",
                "<em>New Essays on Human Understanding</em>, translated and\nedited by Peter Remnant and Jonathan Bennett, Cambridge: Cambridge\nUniversity Press, 1996. </tr>\n<tr>\n<td valign=\"top\">[<b>PE</b>]",
                "<em>G. W. Leibniz: Philosophical Essays</em>, translated by\nRoger Ariew and Daniel Garber, Indianapolis: Hackett Publishing\nCompany, 1989. </tr>\n<tr>\n<td valign=\"top\">[<b>PW</b>]",
                "<em>Leibniz: Political Writings</em> (second edition),\ntranslated and edited by Patrick Riley, Cambridge: Cambridge\nUniversity Press, 1988. </tr>\n<tr>\n<td valign=\"top\">[<b>T</b>]",
                "<em>Theodicy: Essays on the Goodness of God, the Freedom of Man,\nand the Origin of Evil</em>, translated by E. M. Huggard, edited by\nAustin Farrer, Chicago/La Salle: Open Court, 1951 </tr>\n</table>\n<ul class=\"hanging\">\n<li>Plato, <em>The Collected Dialogues of Plato</em>, edited by Edith\nHamilton and Huntington Cairns, Princeton: Princeton University Press,\n1961.</li>\n</ul>\n<h3>"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Antognazza, Maria Rosa, 2013, “Rationalism,” in\n<em>The Oxford Handbook of the History of Ethics</em>, Roger Crisp\n(ed.), Oxford: Oxford University Press.",
                "–––, 2013, “Leibniz's Doctrine of\nToleration,” in <em>Natural Law and Toleration in the Early\nEnlightenment</em>, J. Parkin and T. Stanton (eds.), Oxford: Oxford\nUniversity Press, 139–164.",
                "–––, 2014, “Leibniz's Metaphysical Evil\nRevisited,” in <em>New Essays on Leibniz's</em> Theodicy, Larry\nM. Jorgensen and Samuel Newlands (eds.), Oxford: Oxford University\nPress.",
                "Blank, Andreas, 2004, “Definitions, Sorites Arguments, and\nLeibniz's <em>Méditation sur la notion commune de la\njustice</em>,” <em>The Leibniz Review</em>, 14:\n153–166.",
                "Broad, C. D., 1975, <em>Leibniz: An Introduction</em>, C. Lewy\n(ed.), Cambridge University Press.",
                "Brown, Gregory, 1988, “Leibniz's Theodicy and the Confluence\nof Worldly Goods,” <em>Journal of the History of\nPhilosophy</em>, XXVI (4): 571–592.",
                "–––, 1995, “Leibniz's Moral\nPhilosophy,” in <em>The Cambridge Companion to Leibniz</em>,\nNicholas Jolley (ed.), Cambridge: Cambridge University Press.",
                "–––, 2011a, “Leibniz's Moral\nPhilosophy,” in <em>The Continuum Companion to Leibniz</em>,\nBrandon C. Look (ed.), London: Continuum.",
                "–––, 2011b, “Disinterested Love:\nUnderstanding Leibniz's Reconciliation of Self- and Other-Regarding\nMotives,” <em>British Journal for the History of\nPhilosophy</em>, 19 (2): 265–303.",
                "Ebbersmeyer, Sabrina, 2012, “Leibniz on the Passions and the\nDynamical Dimension of the Human Mind,” in <em>Emotional Minds:\nThe Passions and the Limits of Pure Inquiry in Early Modern\nPhilosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De Gruyter.",
                "Forman, David, 2008, “Free Will and the Freedom of the Sage\nin Leibniz and the Stoics,” <em>History of Philosophy\nQuarterly</em>, 25 (3): 203–219.",
                "Haakonssen, Knud, 1996, <em>Natural Law and Moral Philosophy: From\nGrotius to the Scottish Enlightenment</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1998, “Divine/Natural Law Theories in\nEthics,” in <em>The Cambridge History of Seventeenth-Century\nPhilosophy</em> (Volume II), Daniel Garber and Michael Ayers (eds.),\nCambridge: Cambridge University Press.",
                "Hostler, John, 1975, <em>Leibniz's Moral Philosophy</em>, New\nYork: Harper &amp; Row Publishers, Inc.",
                "Hunter, Ian, 2003, “The Love of a Sage or the Command of a\nSuperior: The Natural Law Doctrines of Leibniz and Pufendorf,”\nin <em>Early Modern Natural Law Theories: Contexts and Strategies in\nthe Early Enlightenment</em>, T. J. Hochstrasser and Peter Schroder\n(eds.), Berlin: Kluwer.",
                "Irwin, Terence, 2008, “Leibniz: Naturalism and\nEudaemonism,” in <em>The Development of Ethics: A Historical and\nCritical Study</em> (Volume II: From Suarez to Rousseau), Oxford:\nOxford University Press.",
                "Johns, Christopher, 2009, “The Grounds of Right and\nObligation in Leibniz and Hobbes,” <em>The Review of\nMetaphysics</em>, LXII (3): 551–574.",
                "–––, 2013, <em>The Science of Right in Leibniz's\nMoral and Political Philosophy</em>, London: Bloomsbury.",
                "–––, 2013, “Leibniz, Pufendorf, and the\nPossibility of Moral Self-Governance,” <em>British Journal for\nthe History of Philosophy</em>, 21 (2): 281–301.",
                "Jolley, Nicholas, 2005, <em>Leibniz</em> (Chapter Seven: Ethics\nand Politics), London: Routledge.",
                "Latzer, Michael, 1994, “Leibniz's Conception of Metaphysical\nEvil,” <em>Journal of the History of Ideas</em>, LV (1):\n1–15.",
                "MacDonald, Scott (ed.), 1991, <em>Being and Goodness: The Concept\nof the Good in Metaphysics and Philosophical Theology</em>, Ithaca:\nCornell University Press.",
                "Mercer, Christia, 2004, “Leibniz, Aristotle, and Ethical\nKnowledge,” in <em>The Impact of Aristotelianism on Modern\nPhilosophy</em>, Riccardo Pozzo (ed.), Washington, D.C.: The Catholic\nUniversity of America Press.",
                "–––, 2012, “Knowledge and Suffering in\nEarly Modern Philosophy: G.W. Leibniz and Anne Conway,” in\n<em>Emotional Minds: The Passions and the Limits of Pure Inquiry in\nEarly Modern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De\nGruyter.",
                "–––, 2015, “Seventeenth-Century Universal\nSympathy: Stoicism, Platonism, Leibniz, and Conway,” in\n<em>Sympathy: A History</em>, Eric Schliesser (ed.), Oxford: Oxford\nUniversity Press.",
                "Mulvaney, Robert J., 1968, “The Early Development of\nLeibniz's Concept of Justice,” <em>Journal of the History of\nIdeas</em>, XXIX (1): 53–72.",
                "Naaman Zauderer, Noa, 2008, “The Place of the Other in\nLeibniz's Rationalism,” in <em>Leibniz: What kind of\nRationalist?</em>, Marcelo Dascal (ed.), Dordrecht: Springer.",
                "Rawls, John, 2000, “Leibniz I: His Metaphysical\nPerfectionism,” in <em>Lectures on the History of Moral\nPhilosophy</em>, Barbara Herman (ed.), Cambridge, MA: Harvard\nUniversity Press.",
                "Rescher, Nicholas, 1967, <em>The Philosophy of Leibniz</em>,\nEnglewood, NJ: Prentice-Hall.",
                "–––, 1979, <em>Leibniz: An Introduction to his\nPhilosophy</em>, Oxford: Basil Blackwell.",
                "Riley, Patrick, 1996, <em>Leibniz’ Universal Jurisprudence:\nJustice as the Charity of the Wise</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "–––, 1999, “Leibniz's Political and Moral\nPhilosophy in the <em>Novissima Sinica</em>, 1699–1999,\n<em>Journal of the History of Ideas</em>, 60 (2), 217–239.",
                "–––, 2003, “Leibniz's\n<em>Méditation sur la notion commune de la justice</em>,\n1703–2003,” <em>The Leibniz Review</em>, 13:\n67–81.",
                "–––, 2006, “Leibniz' <em>Méditation\nsur la notion commune de la justice</em>: A Reply to Andreas\nBlank,” <em>The Leibniz Review</em>, 15: 185–216.",
                "–––, 2008, “Leibniz on Natural Law in the\n<em>Nouveaux essais</em>,” in <em>Leibniz: What Kind of\nRationalist?</em>, Marcelo Dascal (ed.), Dordrecht: Springer.",
                "Roinila, Markku, 2008, “Leibniz's Models of Rational\nDecision,” in <em>Leibniz: What Kind of Rationalist?</em>,\nMarcelo Dascal (ed.), Dordrecht: Springer.",
                "–––, 2012, “Leibniz on Hope,” in\n<em>Emotional Minds: The Passions and the Limits of Pure Inquiry in\nEarly Modern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De\nGruyter.",
                "–––, 2013, “Leibniz and the <em>Amour\nPur</em> Controversy,” <em>Journal of Early Modern Studies</em>,\n2 (2): 35–55.",
                "Russell, Bertrand, 1900, <em>A Critical Exposition of the\nPhilosophy of Leibniz</em>, London: Routledge, 1992.",
                "Rutherford, Donald, 1995, <em>Leibniz and the Rational Order of\nNature</em>, Cambridge: Cambridge University Press.",
                "–––, 2001, “Leibniz and the Stoics: The\nConsolations of Philosophy,” in <em>The Problem of Evil in Early\nModern Philosophy</em>, Elmar J. Kremer and Michael Latzer (eds.),\nToronto: University of Toronto Press.",
                "–––, 2003, “Patience sans\nEspérance: Leibniz's Critique of Stoicism,” in\n<em>Hellenistic and Early Modern Philosophy</em>, Jon Miller and Brad\nInwood (eds.), Cambridge: Cambridge University Press.",
                "–––, 2014, “Justice and Circumstances:\nTheodicy as Universal Religion,” in <em>New Essays on\nLeibniz's</em> Theodicy, Larry M. Jorgensen and Samuel Newlands\n(eds.), Oxford: Oxford University Press.",
                "Schneewind, J. B., 1998, <em>The Invention of Autonomy</em>,\nCambridge: Cambridge University Press.",
                "Youpa, Andrew, 2005, “Rationalist Moral Philosophy,”\nin <em>A Companion to Rationalism</em>, Alan Nelson (ed.), Oxford:\nBlackwell Publishing.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Butler, Joseph, <em>Fifteen Sermons</em>, in <em>British\nMoralists: 1650–1800</em> (Volume I), edited by D. D. Raphael,\nIndianapolis: Hackett Publishing Company, 1991.</li>\n</ul>\n<p>\nLeibniz, G. W.</p>\n<table>\n<tr>\n<td valign=\"top\">[<b>W</b>]</td>\n<td><em>Leibniz: Selections</em>, edited by Philip P. Wiener, New\nYork: Charles Scribner's Sons, 1951.</td> </tr>\n<tr>\n<td valign=\"top\">[<b>M</b>]</td>\n<td><em>Leibniz: The Monadology and Other Philosophical\nWritings</em>, translated with introduction and notes by Robert Latta,\nOxford: Oxford University Press, 1898.</td> </tr>\n<tr>\n<td valign=\"top\">[<b>NE</b>]</td>\n<td><em>New Essays on Human Understanding</em>, translated and\nedited by Peter Remnant and Jonathan Bennett, Cambridge: Cambridge\nUniversity Press, 1996.</td> </tr>\n<tr>\n<td valign=\"top\">[<b>PE</b>]</td>\n<td><em>G. W. Leibniz: Philosophical Essays</em>, translated by\nRoger Ariew and Daniel Garber, Indianapolis: Hackett Publishing\nCompany, 1989.</td> </tr>\n<tr>\n<td valign=\"top\">[<b>PW</b>]</td>\n<td><em>Leibniz: Political Writings</em> (second edition),\ntranslated and edited by Patrick Riley, Cambridge: Cambridge\nUniversity Press, 1988.</td> </tr>\n<tr>\n<td valign=\"top\">[<b>T</b>]</td>\n<td><em>Theodicy: Essays on the Goodness of God, the Freedom of Man,\nand the Origin of Evil</em>, translated by E. M. Huggard, edited by\nAustin Farrer, Chicago/La Salle: Open Court, 1951</td> </tr>\n</table>\n<ul class=\"hanging\">\n<li>Plato, <em>The Collected Dialogues of Plato</em>, edited by Edith\nHamilton and Huntington Cairns, Princeton: Princeton University Press,\n1961.</li>\n</ul>\n<h3>Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Antognazza, Maria Rosa, 2013, “Rationalism,” in\n<em>The Oxford Handbook of the History of Ethics</em>, Roger Crisp\n(ed.), Oxford: Oxford University Press.</li>\n<li>–––, 2013, “Leibniz's Doctrine of\nToleration,” in <em>Natural Law and Toleration in the Early\nEnlightenment</em>, J. Parkin and T. Stanton (eds.), Oxford: Oxford\nUniversity Press, 139–164.</li>\n<li>–––, 2014, “Leibniz's Metaphysical Evil\nRevisited,” in <em>New Essays on Leibniz's</em> Theodicy, Larry\nM. Jorgensen and Samuel Newlands (eds.), Oxford: Oxford University\nPress.</li>\n<li>Blank, Andreas, 2004, “Definitions, Sorites Arguments, and\nLeibniz's <em>Méditation sur la notion commune de la\njustice</em>,” <em>The Leibniz Review</em>, 14:\n153–166.</li>\n<li>Broad, C. D., 1975, <em>Leibniz: An Introduction</em>, C. Lewy\n(ed.), Cambridge University Press.</li>\n<li>Brown, Gregory, 1988, “Leibniz's Theodicy and the Confluence\nof Worldly Goods,” <em>Journal of the History of\nPhilosophy</em>, XXVI (4): 571–592.</li>\n<li>–––, 1995, “Leibniz's Moral\nPhilosophy,” in <em>The Cambridge Companion to Leibniz</em>,\nNicholas Jolley (ed.), Cambridge: Cambridge University Press.</li>\n<li>–––, 2011a, “Leibniz's Moral\nPhilosophy,” in <em>The Continuum Companion to Leibniz</em>,\nBrandon C. Look (ed.), London: Continuum.</li>\n<li>–––, 2011b, “Disinterested Love:\nUnderstanding Leibniz's Reconciliation of Self- and Other-Regarding\nMotives,” <em>British Journal for the History of\nPhilosophy</em>, 19 (2): 265–303.</li>\n<li>Ebbersmeyer, Sabrina, 2012, “Leibniz on the Passions and the\nDynamical Dimension of the Human Mind,” in <em>Emotional Minds:\nThe Passions and the Limits of Pure Inquiry in Early Modern\nPhilosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De Gruyter.</li>\n<li>Forman, David, 2008, “Free Will and the Freedom of the Sage\nin Leibniz and the Stoics,” <em>History of Philosophy\nQuarterly</em>, 25 (3): 203–219.</li>\n<li>Haakonssen, Knud, 1996, <em>Natural Law and Moral Philosophy: From\nGrotius to the Scottish Enlightenment</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1998, “Divine/Natural Law Theories in\nEthics,” in <em>The Cambridge History of Seventeenth-Century\nPhilosophy</em> (Volume II), Daniel Garber and Michael Ayers (eds.),\nCambridge: Cambridge University Press.</li>\n<li>Hostler, John, 1975, <em>Leibniz's Moral Philosophy</em>, New\nYork: Harper &amp; Row Publishers, Inc.</li>\n<li>Hunter, Ian, 2003, “The Love of a Sage or the Command of a\nSuperior: The Natural Law Doctrines of Leibniz and Pufendorf,”\nin <em>Early Modern Natural Law Theories: Contexts and Strategies in\nthe Early Enlightenment</em>, T. J. Hochstrasser and Peter Schroder\n(eds.), Berlin: Kluwer.</li>\n<li>Irwin, Terence, 2008, “Leibniz: Naturalism and\nEudaemonism,” in <em>The Development of Ethics: A Historical and\nCritical Study</em> (Volume II: From Suarez to Rousseau), Oxford:\nOxford University Press.</li>\n<li>Johns, Christopher, 2009, “The Grounds of Right and\nObligation in Leibniz and Hobbes,” <em>The Review of\nMetaphysics</em>, LXII (3): 551–574.</li>\n<li>–––, 2013, <em>The Science of Right in Leibniz's\nMoral and Political Philosophy</em>, London: Bloomsbury.</li>\n<li>–––, 2013, “Leibniz, Pufendorf, and the\nPossibility of Moral Self-Governance,” <em>British Journal for\nthe History of Philosophy</em>, 21 (2): 281–301.</li>\n<li>Jolley, Nicholas, 2005, <em>Leibniz</em> (Chapter Seven: Ethics\nand Politics), London: Routledge.</li>\n<li>Latzer, Michael, 1994, “Leibniz's Conception of Metaphysical\nEvil,” <em>Journal of the History of Ideas</em>, LV (1):\n1–15.</li>\n<li>MacDonald, Scott (ed.), 1991, <em>Being and Goodness: The Concept\nof the Good in Metaphysics and Philosophical Theology</em>, Ithaca:\nCornell University Press.</li>\n<li>Mercer, Christia, 2004, “Leibniz, Aristotle, and Ethical\nKnowledge,” in <em>The Impact of Aristotelianism on Modern\nPhilosophy</em>, Riccardo Pozzo (ed.), Washington, D.C.: The Catholic\nUniversity of America Press.</li>\n<li>–––, 2012, “Knowledge and Suffering in\nEarly Modern Philosophy: G.W. Leibniz and Anne Conway,” in\n<em>Emotional Minds: The Passions and the Limits of Pure Inquiry in\nEarly Modern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De\nGruyter.</li>\n<li>–––, 2015, “Seventeenth-Century Universal\nSympathy: Stoicism, Platonism, Leibniz, and Conway,” in\n<em>Sympathy: A History</em>, Eric Schliesser (ed.), Oxford: Oxford\nUniversity Press.</li>\n<li>Mulvaney, Robert J., 1968, “The Early Development of\nLeibniz's Concept of Justice,” <em>Journal of the History of\nIdeas</em>, XXIX (1): 53–72.</li>\n<li>Naaman Zauderer, Noa, 2008, “The Place of the Other in\nLeibniz's Rationalism,” in <em>Leibniz: What kind of\nRationalist?</em>, Marcelo Dascal (ed.), Dordrecht: Springer.</li>\n<li>Rawls, John, 2000, “Leibniz I: His Metaphysical\nPerfectionism,” in <em>Lectures on the History of Moral\nPhilosophy</em>, Barbara Herman (ed.), Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Rescher, Nicholas, 1967, <em>The Philosophy of Leibniz</em>,\nEnglewood, NJ: Prentice-Hall.</li>\n<li>–––, 1979, <em>Leibniz: An Introduction to his\nPhilosophy</em>, Oxford: Basil Blackwell.</li>\n<li>Riley, Patrick, 1996, <em>Leibniz’ Universal Jurisprudence:\nJustice as the Charity of the Wise</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>–––, 1999, “Leibniz's Political and Moral\nPhilosophy in the <em>Novissima Sinica</em>, 1699–1999,\n<em>Journal of the History of Ideas</em>, 60 (2), 217–239.</li>\n<li>–––, 2003, “Leibniz's\n<em>Méditation sur la notion commune de la justice</em>,\n1703–2003,” <em>The Leibniz Review</em>, 13:\n67–81.</li>\n<li>–––, 2006, “Leibniz' <em>Méditation\nsur la notion commune de la justice</em>: A Reply to Andreas\nBlank,” <em>The Leibniz Review</em>, 15: 185–216.</li>\n<li>–––, 2008, “Leibniz on Natural Law in the\n<em>Nouveaux essais</em>,” in <em>Leibniz: What Kind of\nRationalist?</em>, Marcelo Dascal (ed.), Dordrecht: Springer.</li>\n<li>Roinila, Markku, 2008, “Leibniz's Models of Rational\nDecision,” in <em>Leibniz: What Kind of Rationalist?</em>,\nMarcelo Dascal (ed.), Dordrecht: Springer.</li>\n<li>–––, 2012, “Leibniz on Hope,” in\n<em>Emotional Minds: The Passions and the Limits of Pure Inquiry in\nEarly Modern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Berlin: De\nGruyter.</li>\n<li>–––, 2013, “Leibniz and the <em>Amour\nPur</em> Controversy,” <em>Journal of Early Modern Studies</em>,\n2 (2): 35–55.</li>\n<li>Russell, Bertrand, 1900, <em>A Critical Exposition of the\nPhilosophy of Leibniz</em>, London: Routledge, 1992.</li>\n<li>Rutherford, Donald, 1995, <em>Leibniz and the Rational Order of\nNature</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2001, “Leibniz and the Stoics: The\nConsolations of Philosophy,” in <em>The Problem of Evil in Early\nModern Philosophy</em>, Elmar J. Kremer and Michael Latzer (eds.),\nToronto: University of Toronto Press.</li>\n<li>–––, 2003, “Patience sans\nEspérance: Leibniz's Critique of Stoicism,” in\n<em>Hellenistic and Early Modern Philosophy</em>, Jon Miller and Brad\nInwood (eds.), Cambridge: Cambridge University Press.</li>\n<li>–––, 2014, “Justice and Circumstances:\nTheodicy as Universal Religion,” in <em>New Essays on\nLeibniz's</em> Theodicy, Larry M. Jorgensen and Samuel Newlands\n(eds.), Oxford: Oxford University Press.</li>\n<li>Schneewind, J. B., 1998, <em>The Invention of Autonomy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Youpa, Andrew, 2005, “Rationalist Moral Philosophy,”\nin <em>A Companion to Rationalism</em>, Alan Nelson (ed.), Oxford:\nBlackwell Publishing.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "ethics: natural law tradition",
            "Leibniz, Gottfried Wilhelm",
            "perfectionism, in moral and political philosophy"
        ],
        "entry_link": [
            {
                "../natural-law-ethics/": "ethics: natural law tradition"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../perfectionism-moral/": "perfectionism, in moral and political philosophy"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=leibniz-ethics\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/leibniz-ethics/\" target=\"other\">Preview the PDF version of this entry</a> at the <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=leibniz-ethics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/leibniz-ethics/\" target=\"other\">Enhanced bibliography for this entry</a> at <a href=\"http://philpapers.org\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=leibniz-ethics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/leibniz-ethics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=leibniz-ethics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/leibniz-ethics/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.leibniz-translations.com/\" target=\"other\">Leibniz Translations</a>,\n maintained by Lloyd Strickland (Lancaster University)",
            "<a href=\"http://www.gwleibniz.com/\" target=\"other\">Leibnitiana</a>,\n maintained by Gregory Brown (University of Houston)",
            "<a href=\"http://www.helsinki.fi/~mroinila/leibniz.htm\" target=\"other\">Leibnizian Resources</a>,\n maintained by Markku Roinila (University of Helsinki)",
            "<a href=\"http://philosophyfaculty.ucsd.edu/faculty/rutherford/Leibniz/index.php\" target=\"other\">G. W. Leibniz: Texts and Translations</a>,\n maintained by Donald Rutherford (University of California San\nDiego)"
        ],
        "listed_links": [
            {
                "http://www.leibniz-translations.com/": "Leibniz Translations"
            },
            {
                "http://www.gwleibniz.com/": "Leibnitiana"
            },
            {
                "http://www.helsinki.fi/~mroinila/leibniz.htm": "Leibnizian Resources"
            },
            {
                "http://philosophyfaculty.ucsd.edu/faculty/rutherford/Leibniz/index.php": "G. W. Leibniz: Texts and Translations"
            }
        ]
    }
}