{
    "url": "logical-empiricism",
    "title": "Logical Empiricism",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Richard Creath\n<creath@asu.edu>",
        "author_links": [
            {
                "https://search.asu.edu/profile/44773": "Richard Creath"
            },
            {
                "mailto:creath%40asu%2eedu": "creath@asu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"https://search.asu.edu/profile/44773\" target=\"other\">Richard Creath</a>\n&lt;<a href=\"mailto:creath%40asu%2eedu\"><em>creath<abbr title=\" at \">@</abbr>asu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Apr 4, 2011",
        "substantive revision Wed Sep 21, 2022"
    ],
    "preamble": "\n\nLogical empiricism is a philosophic movement rather than a set of\ndoctrines, and it flourished in the 1920s and 30s in several centers\nin Europe and in the 40s and 50s in the United States. It had several\ndifferent leaders whose views changed considerably over time.\nMoreover, these thinkers differed from one another, often sharply.\nBecause logical empiricism is here construed as a movement rather than\nas doctrine, there is probably no important position that all logical\nempiricists shared—including, surprisingly enough, empiricism.\nAnd while most participants in the movement were empiricists of one\nform or another, they disagreed on what the best form of empiricism\nwas and on the cognitive status of empiricism. What held the group\ntogether was a common concern for scientific methodology and the\nimportant role that science could play in reshaping society. Within\nthat scientific methodology the logical empiricists wanted to find a\nnatural and important role for logic and mathematics and to find an\nunderstanding of philosophy according to which it was part of the\nscientific enterprise.\n\nThe following discussion of logical empiricism is organized under five\nheadings:\n",
    "toc": [
        {
            "#MapMov": "1. Mapping the Movement"
        },
        {
            "#Bac": "2. Background"
        },
        {
            "#SomRepPar": "3. Some Major Participants in the Movement"
        },
        {
            "#Iss": "4. Issues"
        },
        {
            "#EmpVerAntMet": "4.1 Empiricism, Verificationism, and Anti-metaphysics"
        },
        {
            "#Ana": "4.2 Analyticity"
        },
        {
            "#UniSciRed": "4.3 Unity of Science and Reduction"
        },
        {
            "#Pro": "4.4 Probability"
        },
        {
            "#Imp": "5. Impact"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Mapping the Movement\n\nThe term ‘logical empiricism’ has no very precise\nboundaries and still less that distinguishes it from ‘logical\npositivism’. It is therefore hard to map. ‘Logical\nempiricism’ here includes three groups: (1) the Vienna Circle,\nhere taken broadly to include those who were part of various private\ndiscussion groups, especially that around Moritz Schlick, and also the\nmembers of the more public Ernst Mach Society (Verein Ernst Mach), (2)\nthe smaller, but perhaps more influential Berlin Society for Empirical\nPhilosophy (later called the Berlin Society for Scientific\nPhilosophy), and (3) those influenced by or who interacted with\nmembers of the first two groups and shared an intellectual kinship\nwith them. Besides Vienna and Berlin, there were important centers of\nthe movement in England, France, Scandinavia, at several universities\nin the U.S., and even China. This characterization includes thinkers\nwho disagreed with doctrines espoused by members of the original\ngroups and even some who defined themselves in opposition to the\nmovement. This results in a vague boundary, but it suffices to\nidentify a movement in which a large number of able philosophers\nself-consciously participated and to distinguish logical empiricism\nfrom other movements.\n\nIt does not, however, distinguish logical empiricism from logical\npositivism, and it is doubtful that any principled such boundary can\nbe drawn along doctrinal or sociological lines (Uebel 2013). Usually\nwhen distinctions are drawn, ‘logical empiricism’ is the\nwider term. Members of the Berlin group never used the term\n‘positivism’ about themselves, but did use it concerning\nsome unnamed Viennese in stressing their differences from the latter.\nIn any case, these differences, even if real, were smaller than the\ndifferences within the Vienna Circle on one hand or within the Berlin\ngroup on the other. ‘Positivist’ is a term usually applied\nby opponents of various doctrines. It was used by some of the Viennese\nlogical empiricists about themselves but generally with caution and in\nstressing the differences between their own views and those of the\n19th century positivists. The one philosopher who would\nhave unhesitatingly described himself as (having been) a logical\npositivist was A.J. Ayer.\n\nAnother way of mapping the boundaries of logical empiricism is to list\nthe specific philosophers who were centrally or peripherally part of\nit. This included many of the most important philosophers of the\nmid-twentieth century. Hans Hahn, Moritz Schlick, Rudolf Carnap, and\nOtto Neurath were leaders of the Vienna Circle, and Kurt Gödel\nregularly attended its meetings. The list of its members, visitors,\nand interlocutors is staggering, including A.J. Ayer, Herbert Feigl,\nPhilipp Frank, Hans Hahn, Carl Hempel, Karl Menger, Richard von Mises,\nErnest Nagel, Karl Popper, W.V. Quine, Frank Ramsay, Hans Reichenbach,\nAlfred Tarski, Friedrich Waismann, and Ludwig Wittgenstein, among many\nothers. Not all of these would admit to being part of the logical\nempiricist movement, of course, but a case can be made that all\ncontributed to it. The Berlin Society for Empirical (or Scientific)\nPhilosophy was, as stated, smaller but perhaps more influential. Led\nby Hans Reichenbach, it included Kurt Grelling, Walter Dubislav, Kurt\nLewin, Richard von Mises, Paul Oppenheim, and others. Hempel took his\ndoctorate in Berlin, working with Reichenbach until the latter was\nforced to leave in 1933. Hempel also spent time in Vienna and Prague.\nOf course, among the foremost associates of the Berlin Society was\nAlbert Einstein, who was also in Berlin also until 1933.\n\nThere was also an important group of logicians in Warsaw of which\nAlfred Tarski is the best known. Tarski interacted significantly with\nthe logical empiricists in Vienna, Berlin, and the U.S., but it is\nmore reasonable to classify the Polish logicians as an allied group\nrather than include them within the logical empiricist movement.\n\nBecause of the catastrophic dislocations of Europe in the 1930s, the\nmain focus of the logical empiricism moved from central Europe to\nAmerica by the close of that decade. Erkenntnis, the main\njournal of the movement, which had been edited by Reichenbach and\nCarnap, ceased publication by 1940. In 1930 Feigl moved to the U.S.,\nand Carnap moved to Chicago in 1936. Hempel came to Chicago and Menger\nto Notre Dame in 1937. The ensuing years witnessed a massive exodus to\nAmerica from central Europe. Reichenbach arrived in the U.S. in 1938\nafter five years in Turkey. Also in 1938 Gustav Bergmann and Philipp\nFrank emigrated. Edgar Zilsel came in 1939. Alfred Tarski was on a\nvisit to the U.S. when Poland was invaded in 1939, and so he stayed.\nAnd by 1940 Richard von Mises was also in America.\n\nIn the U.S., these exiles were joined by the Americans Nelson Goodman,\nCharles Morris, W.V. Quine, Ernest Nagel, and, after the war, by\nReichenbach’s UCLA students Hilary Putnam and Wesley Salmon.\nAdolf Grünbaum can also be considered as clearly in the\nReichenbach lineage. And Wilfrid Sellars was, in his early years, a\nclose associate of Feigl. The American incarnation of the logical\nempiricist movement enjoyed generally good relations with the American\npragmatists, not only because many of the logical empiricists had a\nstrong pragmatist component to their philosophy, but also because the\npragmatists and logical empiricists shared a common concern for\nempirical methodology in the service of social reform.\nInstitutionally, the movement was represented in most major American\nuniversities, and such journals as Philosophy of Science\n(with Carnap and Feigl on the Editorial Board and Reichenbach and\nSchlick on the Advisory Board) and Philosophical Studies\n(founded and edited for many years by Feigl and Sellars) provided\nample outlet for their publications. In addition, the Inter-Scientific\nDiscussion Group was founded by Philipp Frank at Harvard. That grew\ninto the Institute for the Unity of Science, called by some the Vienna\nCircle in exile. Meanwhile in Chicago the Encyclopedia of Unified\nScience was established with Neurath, Carnap, and Morris as its\neditors.\n\nBut even from late 30s onward the movement was hardly limited to\nAmerica. Ayer remained in England. Wittgenstein returned to Cambridge\nin 1929, but with regular visits to Vienna, including those on which\nhe discussed issues surrounding a strong version of verificationism\nwith Schlick and Waismann. Popper fled to New Zealand in 1937, and in\n1946 moved to the London School of Economics. Neurath fled from Vienna\nto the Hague and then again in 1940 to England, where he remained till\nhis death in 1945. Friedrich Waismann went to England in 1937. In 1939\nRose Rand, a less well-known member of the Vienna Circle, fled to\nEngland and then in 1954 emigrated once more to the U.S. There were\nlike-minded thinkers in Scandinavia (such as Jørgen\nJørgensen, Eino Kaila, and Arne Naess) and as far away as\nArgentina (H.A. Lindemann) and China (Tscha Hung).\n\nIt is impossible to say when logical empiricism ceased to be\nsufficiently cohesive to be identifiable as a continuing movement.\nCertainly by 1960 a great many philosophers, including many who had\nearlier clearly been part of the movement, were identifying themselves\nin opposition to what they took to be logical empiricism. And some\nmembers simply changed their minds or pursued different projects.\nLogical empiricism probably never commanded the assent of the majority\nof philosophers in either Europe or America, and by 1970 the movement\nwas pretty clearly over—though with lasting influence whether\nrecognized or not. In the 1980s there was a resurgence of historical\ninterest in logical empiricism. That historical interest continues to\nclear away many of the caricatures and misconceptions about the\nlogical empiricists. Among the major results of this work is the\nrecognition of the tremendous variety and subtlety of views\nrepresented within the movement and the fact that many of the\narguments later deployed by critics of logical empiricism had been\npioneered by the logical empiricists themselves.\n\nGiven the emphasis on science and its technical apparatus, social\nrenewal, clarity and rationality of belief, functionality, and above\nall the palpable sense of doing philosophy in an importantly new way,\nit is reasonable to associate logical empiricism with other forms of\nEuropean modernism in the 1920s and 30s, such as Neue Sachlichkeit in\nart and the Bauhaus in architecture and design, and with mid-century\nmodernism as well as with political liberalism, from the New Deal to\nthe Great Society in the United States. There have been recognizably\nmodernist developments in various fields including philosophy for\ncenturies.\n2. Background\n\nWith a movement as large and complex as logical empiricism a great\nmany factors went into raising the questions it would address, making\nthem seem urgent, and making it seem as though the intellectual\nresources it would need to address these questions were either at hand\nor could be developed.\n\nOne long-term process with profound implications was the steady\ndeparture of the various sciences from philosophy to form autonomous\ndisciplines. By early in the twentieth century mathematics, physics,\nchemistry, biology, and the social sciences were all pursued\nprofessionally and independently from philosophy. And psychology was\njust separating from philosophy. Yes, there were polymaths who could\nand did pursue a science and philosophy professionally. Those were\nincreasingly rare, though single-discipline scientists did from time\nto time make philosophic-seeming pronouncements. But they did so from\noutside the field. This pattern of steady departures raised the\npressing question: What sort of thing remained behind? Once\nmathematics and the empirical sciences all left, what was left for\nphilosophy?\n\nThe nature of philosophy was always a vexed philosophic question, but\nnow it was particularly insistent. Surely there was no domain of\nempirical facts that philosophy could call its own. All that real\nestate had been parceled out. One answer available at the time that\nlogical empiricism flourished was that the genuinely philosophic\nremainder after the departure of the sciences is somehow deeper than\nthe empirical sciences and gets at matters, perhaps cultural ones,\nthat are more profound and important than anything that empirical\nscience even can address. This is either because on this conception\nphilosophy has a mode of access or “evidence” that the\nempirical sciences do not and cannot have, or because the very idea of\nfidelity to evidence and punctilious argument is somehow\nsmall-minded.\n\nThe logical empiricists found this answer unappealing. Indeed, this\nconception of philosophy is precisely what Carnap means by\n‘metaphysics’. (As a consequence, what Carnap meant by\nthat word is different from what late twentieth and early twenty-first\ncentury philosophers generally mean in describing their own work as\nanalytic metaphysics.) The logical empiricists were eager to conceive\nof their enterprise as scientific and to engage in philosophy only\ninsofar as it was also scientific. This science need not be empirical\nand need not include all that was traditional in philosophy that had\nnot been incorporated into the independent sciences. The decision to\nbe scientific can hardly be the end of the story. It requires rather\nbetter and more detailed answers to questions about what scientific\nmethods are, how the mathematical (and other apparently non-empirical\nsciences) fit together with the empirical ones, and what, more\nprecisely, philosophy’s role was.\n\nA second series of developments that raised questions for logical\nempiricism to address were developments in the sciences themselves,\nespecially the rise of non-Euclidean geometries in mathematics and the\nestablishment of relativity theory in physics. These posed a serious\nchallenge to what would otherwise be an attractive scientific\nphilosophy, namely some version of Kantianism. Kant had recognized\nthat the best of modern science was often mathematical in character\nand had labored to integrate both geometry and arithmetic into our\nempirical picture of the world. He had held that we could not\nrepresent the world except as a Euclidean structure and hence\nEuclidean geometry was, a priori, a permanent feature of any future\nphysics. The demonstration that non-Euclidean pure geometrical\nstructures were as consistent as Euclidean ones and that spaces can\nindeed be represented as a non-Euclidean manifolds was one half of the\nproblem. The other half came when Einstein argued convincingly that\nphysical space was best described as a non-Euclidean manifold of\nnon-constant curvature. Plainly Euclidean geometry could not be\nguaranteed a future physics. Modern mathematical logic also posed a\nproblem for other Kantian claims, but not in the same wrenching\nway.\n\nMany logical empiricists started out as neo-Kantians: Reichenbach,\nCarnap, Schlick, and even Hempel (until he studied with Reichenbach,\nwho by that time had revised his view). The difficulties with geometry\nand relativity certainly do not refute all forms of neo-Kantianism,\nbut the difficulties are quite real nonetheless. The need is to\nunderstand how mathematics can be integrated into what is otherwise an\nempirical enterprise, i.e., physics, chemistry, biology, etc.\nAddressing this need was to be a major part of the logical empiricist\nprogram.\n\nThe background of logical empiricism described so far has been\nconfined to the academic world, but events outside that domain shaped\nthe movement as well. World War I was an unmitigated disaster for\ncentral Europe, followed by economic turmoil in the 20s and political\nupheavals of the 30s. It is hard to exaggerate these changes.\nMonarchies that had stood for centuries disappeared overnight and\ntheir empires disintegrated. This level of political convulsion had\nnot been seen since the French Revolution, and that earlier upheaval\nwas comparatively confined. Cultural changes were equally profound,\nand these were reflected by radical departures in the arts such as\npainting, music, and architecture, and even more importantly in new\nmodes of living.\n\nThe logical empiricists were no mere bystanders. They, or at least the\nmain leaders of the movement, were politically and culturally engaged.\nEven more important, this engagement was accompanied by the conviction\nthat their cultures were incapable of the necessary reform and renewal\nbecause people were in effect enslaved by unscientific, metaphysical\nways of thinking. Such ways of thinking might be exemplified in\ntheology, in the racial hatreds of the day, in conceptions of\nproperty, and in traditional ideas about the “proper”\nroles of men and women in society. So to articulate a\n“scientific world conception” and to defend it against\nmetaphysics was not just to express an academic position in the narrow\nsense. It was a political act as well; it was to strike a blow for the\nliberation of the mind. To articulate scientific methods and a\nscientific conception of philosophy was the essential first step in\nthe reform of society and in the emancipation of humankind (Carnap\n1958/2017, Creath 2009, Uebel 2012.\n\nIf all of this sounds like something out of the 18th\ncentury Enlightenment, the analogy was not lost on the logical\nempiricists themselves. André Carus has argued that this is\nexactly what Carnap had in mind by “explication” (Carus\n2007). Neurath frequently drew parallels between the logical\nempiricists’ anti-metaphysical program and the earlier\nEnlightenment ambitions. Certainly Kant had inveighed against the\nmetaphysics of his time, and the anti-metaphysical tradition remained\nstrong within the scientific community through the 19th\ncentury.\n\nThe point so far was not to ask whether the logical empiricists were\nright in any of this. That question will come up later. So far the\nissue has been only to see the motivations that the logical\nempiricists had—and from their point of view—for\naddressing certain questions and for thinking that answers to those\nquestions were urgently needed. None of this, however, says why the\nlogical empiricists thought they had or could have the means to answer\nthese questions. To that we now turn.\n\nSince Newton the most paradigmatic examples of empirical science were\nthose claims, usually quantitative ones, that were properly inferred\nfrom or appropriately confirmed by experience. Speaking very\ninformally, these are the ones that we have good reason to believe or\nat least better reason to believe than the available alternatives. The\nproblem, of course, is to specify the form of proper inferences, the\nform of an appropriate confirmation relation, and/or the structure of\ngood reasons. The task is daunting, but logic in a suitably broad\nsense seems to be the right tool. Still speaking informally, logic\nseems to give us the structure of (good) reasoning. There are other\nconceptions of logic, of course, but this is a standard one and pretty\nwell describes what the movement needed.\n\nIf logic was the tool that was wanted, it was newly ready for service.\nThe progress of modern mathematical logic from Bolzano through Russell\nand beyond was truly impressive. Arguably, it could now express all\nparts of classical mathematics. Besides the first order predicate\ncalculus one would need either set theory or higher order logic, but\nthese were recent developments as well. Logic, like the empirical\nsciences, was progressive and could be approached cooperatively by\nmore than one investigator. In Our Knowledge of the External\nWorld (1914) Russell had even positioned logic as the\nlocus of scientific method in philosophy. It is small wonder then that\nthose who were looking for something scientific in what was left of\nphilosophy turned to logic. Wittgenstein’s no-content theory of\nlogic in the Tractatus (1921/1922) was tantalizingly\nsuggestive about how mathematics could be integrated into an overall\nempirical theory of the world. Wittgenstein also expressed a radical\nverificationism in the early 1930s in his conversations with Schlick,\nWaismann, and other members of the Vienna Circle. Many of the logical\nempiricists in turn could see in some version of that verificationism\nthe ideal tool with which to carry out their anti-metaphysical\nprogram. There was, naturally, much left to accomplish, but even with\nGödel’s results one could expect that further impressive\nstrides in logic could be made. Indeed, much was accomplished even if\nthe perfect account of scientific reasoning proved elusive. Perfection\nis elusive in all the sciences, but that is no reason for despair.\n3. Some Major Participants in the Movement\n\nThe logical empiricist movement is the sum of the interwoven\ntrajectories of its members, so one way of describing that movement is\nto trace those various trajectories. To do so in detail for all those\ninvolved would take rather longer than the movement lasted. That would\nbe inappropriate for one entry in an encyclopedia, especially one in\nwhich entries for many of the members will appear independently. The\nthumbnail sketches of the work of some representative figures below\nshow the breadth and international character of the movement. While\nthe list is long, it covers only a small fraction of those involved\nand leaves out many important thinkers.\n\nA.J. Ayer (1910–1989)\nAn English philosopher in the tradition of British empiricism,\nAyer visited the Vienna Circle in 1932–33. His book\nLanguage, Truth, and Logic (1936) was a best seller after\nWorld War II and represents logical positivism to many English\nspeakers.\nGustav Bergmann (1906–1987)\nBorn and trained in Vienna, Bergmann spent almost all of his\ncareer at the University of Iowa. He was a philosopher of\nscience, mathematician, and metaphysician, who in his early years\njoined in the Vienna Circle. But as his career progressed, his\nideas increasingly diverged from other members of the logical\nempiricist movement.\nRudolf Carnap (1891–1970)\nGerman by birth, he taught in Vienna, Prague, Chicago, and Los\nAngeles. He was one of the leaders of the Vienna Circle and of logical\nempiricism, especially of those within the movement whose formulations\nwere more liberal, e.g., with respect to the criterion of\nverification. He defended logical and methodological pluralism and\nworked to develop an epistemic approach to probability.\nWalter Dubislav (1895–1937)\nA German logician and philosopher of science, Dubislav was one of\nthe founders, with Reichenbach and Grelling, of the Berlin Society of\nEmpirical (later Scientific) Philosophy.\nHerbert Feigl (1902–1988)\nBorn in what is now the Czech Republic, Feigl studied in Vienna\nwith Schlick and Hahn. He emigrated to the U.S. before most other\nlogical empiricists would do so. He taught at the Universities of Iowa\nand Minnesota and founded both Philosophical Studies, with\nWilfrid Sellars, and the Minnesota Center for the Philosophy of\nScience. He is best known for his work on the mind-body problem.\nPhilipp Frank (1884–1966)\nThis Viennese physicist and philosopher of science taught at\nVienna, Prague, and Harvard. He was part of a discussion group with\nHahn, Neurath, and others that preceded the Vienna Circle. At Harvard\nhe founded the Inter-Scientific Discussion Group that developed into\nthe Institute for the Unity of Science. He was also one of the\nfounders of the Boston Colloquium in the Philosophy of Science.\nKurt Gödel (1906–1978)\nBorn in what is now Slovakia, Gödel took his doctorate under\nHahn in Vienna, studying with Carnap and Schlick as well. He also\nregularly attended Vienna Circle meetings and taught in Vienna. The\nbulk of his career was spent at the Institute for Advanced Study at\nPrinceton. He is best known for his spectacular incompleteness\ntheorems, and his Platonist orientation toward mathematics. Though a\nparticipant in the logical empiricist movement during the Vienna\nyears, Gödel thought that Carnap’s approach to mathematics\ncould be refuted. The alleged proof (Gödel 1995) was not\npublished in Gödel’s lifetime and remains\ncontroversial.\nKurt Grelling (1886–1942)\nGrelling was born in Berlin and took his doctorate in\nGöttingen under Hilbert. With Leonard Nelson he developed a\nfamous semantic paradox that bears their names. He was one of the\nfounders of the Berlin Society for Empirical (later Scientific)\nPhilosophy. Grelling died in the Holocaust because for bureaucratic\nand political reasons news of an academic appointment in the U.S.\nreached him too late.\nAdolf Grünbaum (1923–2018)\nGrünbaum moved from his native Germany as a teenager, studied\nunder Hempel at Yale, and spent the bulk of his career at the\nUniversity of Pittsburgh, where he founded the Center for Philosophy\nof Science. The major themes of his work have been philosophy of space\nand time, rationality, and psychoanalysis.\nHans Hahn (1879–1934)\nHahn, a distinguished mathematician, took his doctorate in his\nnative Vienna in 1902 and began teaching there in 1905. He was part of\na group with Frank, Neurath and others that discussed logical and\nmethodological issues prior to World War I. After teaching at\nCzernowitz (now in Ukraine) and Bonn he was given a chair in\nmathematics at Vienna in 1921. He was instrumental in bringing Schlick\nthere in 1922 and so was called by Frank “the actual founder of\nthe Vienna Circle” (Stadler 1997/2001, 642). His most famous\nstudent was Gödel.\nOlaf Helmer (1910–2011)\nHelmer took a doctorate in his native Berlin under Reichenbach and\na second doctorate under Susan Stebbing in London. He collaborated\nwith other logically minded philosophers. Indeed, the team of Hempel,\nHelmer, and Oppenheim became known as “H2O”.\nThe bulk of his career was spent at the Rand Corporation.\nCarl G. Hempel (1905–1997)\nBorn just north of Berlin, Hempel studied at both Göttingen\nand Berlin. Most of his doctoral work was completed under Reichenbach\nwhen the latter was forced to leave Germany. Hempel taught at a number\nof American universities, most famously at Princeton and the\nUniversity of Pittsburgh. He was the doctor father of many prominent\nphilosophers of science, and his work focused on confirmation,\nexplanation, and concept formation.\nRichard Jeffrey (1926–2002)\nThis American logician and philosopher of science earned an MA\nwith Carnap (with whom he later collaborated) and a PhD with Hempel\n(with whom he was for many years a colleague and close friend at\nPrinceton). He developed Jeffrey conditionalization (see below) and\ndefended probabilism.\nKurt Lewin (1890–1947)\nBorn in what is now Poland, Lewin took his doctorate in Berlin in\n1916. He lectured there in both philosophy and psychology until 1933\nwhen he emigrated to the U.S. via England. Thereafter he taught at a\nnumber of American universities including Cornell, Iowa, MIT, and\nDuke. Credited with founding modern social psychology, he laid the\nfoundations for what is now called sensitivity training as a way to\ncombat religious and racial prejudices.\nRichard von Mises (1883–1953)\nBorn in what is now Ukraine, Richard von Mises is the brother of\nthe economic and political theorist Ludwig von Mises. Richard was a\npolymath who ranged over fields as diverse as mathematics,\naerodynamics, philosophy, and Rilke’s poetry. He finished his\ndoctorate in Vienna. He was simultaneously active in Berlin, where he\nwas one of the developers of the frequency theory of probability along\nwith Reichenbach, and in Vienna, where he participated in various\ndiscussion groups that constituted the Vienna Circle. Eventually it\nwas necessary to escape, first to Turkey, and eventually to MIT and\nHarvard.\nCharles W. Morris (1901–1979)\nMorris was an American pragmatist and philosopher of language at\nthe University of Chicago when Carnap arrived there. These two,\ntogether with Neurath until the latter’s death, were the chief\neditors of the Encyclopedia of Unified Science. After Carnap\nleft Chicago, Morris moved to the University of Florida.\nOtto Neurath (1882–1945)\nThis Austrian philosopher of science and sociologist took his\ndoctorate in political science in Berlin. A member of the First Vienna\nCircle and a leader of the “left” wing of the Vienna\nCircle, he was also politically active. He was a significant museum\ndirector, and as part of this developed the ISOTYPE picture language.\nHis main philosophic themes were physicalism, anti-metaphysics, and\nthe unity of science. He was the Editor-in-Chief of the\nEncyclopedia of Unified Science until his death. Eventually\nhe fled to the Netherlands and from there to England.\nPaul Oppenheim (1885–1977)\nA successful industrialist and heir to a substantial fortune,\nOppenheim was trained in his native Germany in chemistry and\nphilosophy. He was a close friend of Einstein, and helped to initiate\nthe Berlin Society for Empirical Philosophy. Oppenheim collaborated\nwith many important logicians and philosophers of science both in\nEurope and the U.S. He also helped many to escape Nazi oppression, and\ncontinued to help in a variety of ways even after he settled in\nPrinceton in 1939.\nKarl Popper (1902–1994)\nBorn in Vienna and with a doctorate there, Popper was intensely\nengaged in discussions with members of the Vienna Circle. His main\nphilosophical work, The Logic of Scientific Discovery\n(1935/1959), appeared in a series edited by Schlick and P. Frank. He\ndid not however, regularly attend meetings of the Vienna Circle and\ngenerally considered himself an outsider. Later he claimed to have\n“killed” logical positivism. From Austria Popper escaped\nto New Zealand and eventually to the London School of Economics, where\nhe was knighted for his political writings.\nHilary Putnam (1926–2016)\nThis American philosopher of science, mathematics, mind and\nlanguage earned his doctorate under Reichenbach at UCLA and\nsubsequently taught at Princeton, MIT, and Harvard. He was originally\na metaphysical realist, but then argued forcefully against it. He has\ncontinued the pragmatist tradition and been politically active,\nespecially in the 1960s and 70s.\nW.V.O. Quine (1908–2000)\nBorn in the U.S., Quine took his doctorate and spent his entire\ncareer at Harvard. In 1932–33 he visited the Vienna Circle and\nthen Carnap and Warsaw. For the next six years, he said, he was a\ndisciple of Carnap’s and even after they began to disagree,\nCarnap set the agenda. Eventually they clashed over analyticity,\nmodality, and intensional contexts generally. Many similarities of\nview with Neurath are apparent, especially on the issues of holism,\nunderdetermination, and naturalism in epistemology.\nHans Reichenbach (1891–1953)\nReichenbach was born in Hamburg and, after immersing himself in\nmathematics, physics, and philosophy, took his doctorate in Erlangen,\nGermany. He was a founder and the leader for the Berlin Society for\nEmpirical (later Scientific) Philosophy. In 1933 he was forced to\nleave Berlin. He went to Turkey and then in 1938 to UCLA. Among his\nmany students were Hempel, Putnam, and W. Salmon, and so almost all\nphilosophy of science in the U.S. can trace its academic lineage to\nReichenbach. Though interested in social and educational reform, he\nworked primarily in philosophy of physics. He developed and defended a\nfrequency theory of probability, and emphasized both scientific\nrealism and the importance of causality and causal laws.\nWesley Salmon (1925–2001)\nSalmon was born in Detroit and, after an initial interest in\ntheology, earned his PhD under Reichenbach at UCLA. He taught at a\nnumber of universities including Brown, Indiana, Arizona, and\nPittsburgh. His interests centered on causality and explanation, and\nhis statistical relevance model of explanation can be thought of as\naddressing and in large measure resolving the problem of the single\ncase in frequency theories of probability.\nMoritz Schlick (1882–1936)\nSchlick was born in Berlin and eventually took his doctorate there\nin mathematical physics under Max Planck. He taught at a number of\nGerman universities before he was, at the instigation of Hans Hahn,\ncalled to the Chair in the Philosophy of the Inductive Sciences at\nVienna, a chair that was previously held by Boltzmann and Mach.\nSchlick was one of the first philosophers to write about\nEinstein’s relativity theory. He was close to Wittgenstein and\none of the conduits for the latter’s strict verificationism. His\nwork ranges from space and time to general epistemology and ethics. In\n1936 he was assassinated on the steps of the university by a deranged\nstudent.\nWilfrid Sellars (1912–1989)\nWilfrid Sellars was the son of well-known philosopher, Roy Wood\nSellars. Wilfrid studied at Buffalo, Oxford, and Harvard before\nteaching at Iowa, Minnesota, Yale, and Pittsburgh. He was a close\nassociate and collaborator with Feigl at Minnesota. (In 1947 he\ndeclared himself a logical empiricist and much later said that he and\nFeigl were for years discrete parts of a single entity.) He defended\nscientific realism, pragmatism, and naturalism, and his philosophy of\nlanguage drew heavily on Carnap’s Logical Syntax\n(1934/1937).\nAlfred Tarski (1901–1983)\nBorn and educated in Warsaw, Tarski earned his doctorate under\nLesniewski. He happened to be visiting the U.S. when Poland was\ninvaded and so avoided the fate of so many of his colleagues. He\ntaught at the University of California at Berkeley for more than 30\nyears. While it is unclear whether he should be counted as a logical\nempiricist, he visited the Vienna Circle and hosted its members in\nWarsaw, and his “The Concept of Truth in Formalized\nLanguages” (1936/1956) was very influential on Carnap and on the\ndevelopment of semantics among the logical empiricists generally.\nFriedrich Waismann (1896–1959)\nWaismann was born in Vienna and earned his doctorate there under\nthe direction of Schlick in 1936. From 1926 to 1933 he held\ndiscussions with Wittgenstein, generally in the company of Schlick,\nbut also sometimes Carnap or Feigl. Waismann kept detailed minutes of\nthese conversations. At one point he and Wittgenstein contemplated a\njoint book, but Wittgenstein later changed his mind. Besides the\nprinted text of the Tractatus these conversations were the\nmain conduit of Wittgenstein’s ideas into the Vienna Circle. In\n1937 Waismann was able to emigrate to England. After a couple of years\nat Cambridge, where he was shunned by Wittgenstein, he moved to\nOxford, where he taught until his death.\nLudwig Wittgenstein (1889–1951)\nBorn into an immensely wealthy Viennese family, Wittgenstein\nstudied at Cambridge from 1911, where he formed friendships with\nRussell, Keynes, and Moore. His Tractatus\nLogico-Philosophicus (1921/1922), which among other things tries\nto show that logic has no content, was enormously influential on many\nlogical empiricists. Wittgenstein continued to spend much of his time\nin Austria working variously as an elementary school teacher, a\ngardener, and as an architect of a house for his sister in Vienna.\nWhile there he held influential discussions with Schlick, Waismann,\nand others. From 1930 he held teaching posts at Cambridge and\nincreasingly distanced himself from the logical empiricists. His later\nwork focused on ordinary language and inspired many other philosophers\nas well.\n\n4. Issues\n\nIt is not possible in an essay of this scope to trace all the issues\nthat the logical empiricists addressed or even to treat any one of\nthem with completeness. What is possible is to highlight some salient\nissues, clear away some misconceptions about them, and sketch a bit\nhow those issues were developed over time. The first is a related set\nof concerns: empiricism, verificationism, and anti-metaphysics. The\nsecond is the logical empiricists’ treatment of logic and\nmathematics as analytic. Third is the related issues of the unity of\nscience and reduction. And finally, comes the issue of probability.\nGiven what has already been said, the reader should be aware that none\nof the doctrines discussed below was shared by all members of the\nlogical empiricist movement.\n4.1 Empiricism, Verificationism, and Anti-metaphysics\n\nSince antiquity the idea that natural science rests importantly on\nexperience has been non-controversial. The only real questions about\nthe sources of scientific knowledge are: Are there parts of science\nthat do not rest on experience or rest also on something other than\nexperience? If so what account can we give of those parts? And to the\nextent that science does rest on experience how can we know that it\ndoes? There is another question about science related to these, though\nnot strictly about the sources of science, and that is: Why, in making\nclaims about the world, should we be scientific as opposed to, say,\nmystical? The difficulty is that any scientific answer to this last\nquestion would reasonably be thought to beg the very question it\npurports to address.\n\nLong before the twentieth century the prevailing opinion was that\nEuclidean geometry, standard mathematics, and logic did not rest on\nexperience in any obvious way. They were largely presupposed in our\nempirical work, and it was difficult to see what if anything might\ndisconfirm them. Geometry was a special case and might be handled in\ndifferent ways that we shall not discuss here. That leaves logic and\nmathematics.\n\nIf Frege and Russell were right, then mathematics could be thought of\nas expressing no more than logical truths and handled in whatever way\nlogic was to be treated. For Frege both mathematics and logic were\nanalytic, but that, even if true, does not provide the needed answers.\nWittgenstein’s no-content theory of logic suggested that all of\nthe real claims, the ones that had genuine content, could be\nappropriately supported by experience, and the logical and hence\nmathematical claims had no content to support. This seemed to open the\nway for a thoroughgoing empiricism in which the logical and\nmathematical fit in with the ordinary claims of physics and biology in\na harmonious way. The next subsection about analyticity discusses the\nquestion of whether the needed distinctions can be drawn.\n\nIn developing his theory of types Russell said in effect that some\nexpressions that seem to be sentences in fact say nothing at all. This\nis because, despite appearances, they are not grammatically well\nformed. Wittgenstein found this suggestive. In the Tractatus\nhe suggested that much else was nonsense as well including traditional\nmetaphysics and supposed claims about the “higher”. When\nin late 1929 Wittgenstein proposed (Waismann 1967/1979), in\nconversations with Schlick and Waismann, a strict verificationism as a\nbasis for identifying the legitimate parts of discourse, this seemed\nto the logical empiricists to be a very attractive tool for setting\naside the unscientific parts of philosophy.\n\nThis does not mean, however, that all logical empiricists or even all\nmembers of the Vienna Circle accepted the strict verificationist view\nthat in order to be meaningful a claim must be implied by a finite\nnumber of observation sentences. Even though those observation\nsentences need not be true, this view had the drawback that so-called\nlaws of nature would not be meaningful on this criterion. Schlick was\nprepared to bite the bullet and hold that laws were not statements at\nall but principles of inference. Others were not prepared to go so far\nand sought more liberal formulations. This more liberal or\n“left” wing of the Vienna Circle included Carnap, Philipp\nFrank, Hahn, and Neurath. Carnap does not seem to have been a strict\nverificationist even in the Aufbau (1928/1967).\n\nOver the years a great many different formulations of verificationist\nprinciples ensued. Most of them came to a bad end rather quickly, and\nthis is sometimes taken as a convincing argument that any form of\nverificationism is utterly misguided. Perhaps, but we should be\ncautious. There are undoubtedly many different features joined in any\none of the proposals, and even a sequence of failures may not show\nwhere to place the blame. The central idea behind verificationism is\nlinking some sort of meaningfulness with (in principle) confirmation,\nat least for synthetic sentences. The actual formulations embodied not\nonly such a link but various particular accounts of confirmation as\nwell. Now confirmation is a complex matter, and it is unlikely that we\nshall have the final satisfactory account any time soon. This should\nnot persuade us, however, that there are no satisfactory accounts of\nconfirmation any more than our current lack of the final physics\nshould convince us that there are no physical facts of the matter. So\neven a string of failures in formulating verificationist principles\nmay mean no more than that the embedded accounts of confirmation are\ntoo simple but the link between meaningfulness and confirmation is\nnevertheless sound.\n\nEven if we set this caution aside, there may be parts of a\npersistently employed strategy that lead to persistent failure. These\nparts and failures might be avoidable. To see how this may be so we\nwill compare what is perhaps the most famous formulation of the\nverificationist principle, in Ayer 1936, with a later one, in Carnap\n1956. A.J. Ayer had visited the Vienna Circle from late 1932 on into\n1933, returning home for the summer term. While in Vienna he attended\nmeetings of the Circle and overlapped for five weeks with Quine.\nNeither Carnap nor Neurath were there at the time, so the left wing of\nthe Circle was not fully represented. When Ayer returned to England he\npublished Language, Truth, and Logic in 1936. Even\nimmediately it was widely discussed, and after the war sales were\nspectacular. For many in England this book was the epitome of logical\npositivism and remains so.\n\nAyer was careful to restrict his criterion of meaningfulness to\nsynthetic sentences and to demand only in principle confirmation. And\nthe formulation seems very natural: Confirmation is a feature that\napplies to sentences (or groups of them) and not to sub-sentential\nparts, and for an empiricist the content that a synthetic sentence has\nwould be empirical content. So it would seem that to have empirical\ncontent a sentence, A, should either directly imply some\nobservational sentence or add to the observational content of some\nother sentence, B. That is, the conjunction of A and\nB should imply some observational sentence not implied by\nB alone. This formulation may be natural, but it is also\nfatally flawed. It would declare any sentence whatsoever as\nmeaningful: For any sentence A and any observation sentence\nO, A would be meaningful because it could be\nconjoined to A ⊃ O. The latter would not in\ngeneral imply O, but the conjunction would.\n\nOther more elaborate formulations followed along the same lines, and\nother more elaborate counterexamples appeared just as fast. Hempel\nreviewed the situation twice within about a year (Hempel 1950 and\n1951). First he concluded that it was a lively and promising line of\nresearch and later concluded that it was not promising at all. In\nretrospect it may be that the problems arise because we were led by\nthe fact that confirmation is a feature that applies to whole\nsentences into thinking that the level at which to apply the criterion\nwas the level of whole sentences. Now a sentence with meaningless\nparts might well pass some test especially if the test involves its\nbeing combined with other sentences that can have meaningless parts.\nSo one way to avoid this difficulty is to try to find a formulation\nthat applies the test at the level of basic expressions, those that\ncan be thought of as “not having parts” so to speak.\n\nThis is the strategy that Carnap employed in “The Methodological\nCharacter of Theoretical Concepts” (1956). Observational terms\nare assumed to have empirical content. Logical terms are assumed to\nhave none. And all defined terms are assumed to be replaced by their\ndefinitions. If for some basic, non-logical term there is a sentence\nthat contains that term as its only non-logical element and if that\nsentence implies some observation sentence, then that sentence has\nempirical content and so does its only non-logical term. If we have\nestablished that each term from some set, K, is empirically\nsignificant we might test still further terms by seeing whether those\nfurther terms can add to what is sayable with terms from K.\nCarnap’s actual definition is quite complicated, but it does\nseem to avoid the difficulties of its predecessors. It also allows an\naccount of why those predecessors ran into trouble, viz., that they\napplied at the level of whole sentences (naturally enough) rather than\nto elementary terms.\n\nNot long after Carnap’s definition was published David Kaplan\ndevised what seemed to be counterexamples. They became fairly well\nknown, but they were not published until 1975. Shortly thereafter it\nwas shown (Creath 1976) that either Carnap’s definition is not\nopen to the counterexamples as presented or it can be patched in a\nvery natural way so that it avoids them. This does not show that there\nare no counterexamples or that there are no other features of the\ndefinition to which one might object. But it does show that the\nsituation is not as dire as Hempel supposed in 1951.\n\nWe need to address another issue in considering verificationism, the\npersistent criticism that it is self-undercutting. The argument for\nthis claim goes like this: The principle claims that every meaningful\nsentence is either analytic or verifiable. Well, the principle itself\nis surely not analytic; we understand the meanings of the words in it\nperfectly well because we understand our own language. And we still do\nnot think it true, so it cannot be true in virtue of meaning. And it\nis not verifiable either (whatever we choose ‘verifiable’\nto mean).\n\nThis sounds more compelling than it is. Ayer understood the principle\nto be a definition, defining a technical term, ‘meaning’.\nIf so, then the sentence expressing the principle would indeed be\nanalytic. So the self-undercutting charge strictly fails. But so\nconstrued and with nothing else said about it, the principle would not\nhave the same punch as before. Why should a metaphysician care whether\nhis or her utterances lack some technical feature?\n\nCarnap explicitly takes up the “self-undercutting” charge\nagainst verifiability in Philosophy and Logical Syntax\n(1935), and he is not interested in introducing a new technical term,\n‘meaning’, or in denying this new technical property to\nunverifiable sentences. Carnap is careful to distinguish the language\nfor which the verifiability principle is given from the meta-language\nin which we talk about that language. This meta-language would be the\nlanguage in which the principle would be expressed. This may seem to\noffer another strategy against the “self-undercutting”\ncharge because the principle applies to a different language than that\nin which it is expressed. This is not Carnap’s strategy. Carnap\nfully understands that if the general verificationist strategy is\nfollowed, there will also be a verificationist principle expressed in\nthe meta-meta-language governing the meta-language.\n\nCarnap’s real defense of the principle was achieved by changing\nthe nature of the discussion. By 1934 Carnap had introduced an\nimportant new element into his philosophy called the Principle of\nTolerance. Tolerance is a radical idea. There is no uniquely correct\nlogic (1934/1937 xiv–xv). Empiricism is a convention (Carnap,\n1936/1937 33). Perhaps more precisely each of the various versions of\nempiricism (including some sort of verificationism) is best understood\nas a proposal for structuring the language of science. Before\ntolerance, both empiricism and verificationism are announced as if\nthey are simply correct. Correspondingly, what Carnap called\nmetaphysics was then treated as though it were, as a matter of brute\nfact, unintelligible. But what is announced thus dogmatically can be\nrejected equally dogmatically. Once tolerance is in place, alternative\nphilosophic positions, including metaphysical ones, are construed as\nalternative proposals for structuring the language of science. No\ntheoretical argument or evidence can show that one of the proposed\nlanguages is the uniquely correct one. Nor can theoretical arguments\nor evidence show that it is false. Neither proposals nor languages are\nthe sort of thing to be true or false. Instead, proposals call for\npractical decisions and practical arguments rather than for\ntheoretical reasons or evidence. Carnap believes that there are indeed\nvery good practical reasons for adopting the proposal of\nverificationism, for choosing a language of science in which all\nsubstantive (synthetic) claims can, at least in principle, be brought\nbefore the court of public experience. The reason is that if we do not\nrequire this, the result is “wearisome controversies” that\nthere is no hope of resolving. That, he thinks, is the sad history of\nattempts to get beyond science, and it is just too painful.\n\nIf the proposals constituting some version of verificationism are\nadopted, then in the language thus constituted it will be analytically\ntrue that there are no synthetic sentences that are both unverifiable\nand meaningful. The notion of meaning here is not some new technical\ninvention. Rather, ‘meaning’ is used in something like the\nordinary sense. No grammatically well-formed sentence of this new\nlanguage violates the verifiability principle. And the principle\nitself is completely safe. Thought of in this way the verifiability\nprinciple does not describe natural language; it is not intended to.\nIt is intended to reform language to make it a more useful tool for\nthe purposes of science. Carnap is under no illusion that natural\nlanguages are free from what seem to be metaphysical commitments. Nor\nis he under the illusion that defenders of the sort of metaphysics he\ntargets will readily step up to the challenge of presenting precise\nrules of grammar and inference. There is no weakening of his defense\nof empiricism, but it is put on a somewhat different footing.\n\nIt is important to emphasize that Carnap’s Principle of Tolerance\nintroduces a new conception of philosophy with far-ranging\nimplications beyond those just discussed concerning verification. The\nidea that philosophy is concerned with language and its analysis was\nnot new. What is novel is the idea that what had been seen as\nphilosophical claims were better understood as proposals for\nstructuring the language of science. Since these languages and\nthe concepts they contained were to be thought of as tools, none of\nwhich was uniquely correct, the choice among the alternatives was a\npractical decision about usefulness for certain purposes rather than a\ntheoretical question. Philosophy still has important work to do: It\ncan analyze existing concepts. And since many existing concepts are\nvague, it can also make them more precise in a variety of ways through\nexplication. Philosophy can also investigate wholly new concepts. In\nall this, philosophy explores the consequences of structuring the\nlanguage of science in this way or that. It becomes, thus, a kind of\nconceptual engineering. Conceptual analysis, explication,\nconstruction, and engineering continue to be fruitful ideas in\nphilosophy, though it is not always understood how much of this was\ninitiated or shaped by Carnap and other logical empiricists.\n4.2 Analyticity\n\nLogic, mathematics, and mathematical geometry had traditionally seemed\nto be confirmationally “different”. Indeed it is hard to\nindicate any conditions under which any parts of them would be\ndisconfirmed. Leibniz had called them truths of reason. Hume said that\nthey represented relations of ideas. Kant had held that the truths in\nthese areas were a priori. Mathematics and geometry were not analytic\nfor Kant, but logic was. Kant had two criteria of analyticity,\napparently thinking them equivalent. First, in subject-predicate\nsentences, an analytic sentence is one in which the concept of the\npredicate is contained in that of the subject. Second, an analytic\nsentence is one whose denial is self-contradictory. This seems to\ninclude not only the sentences whose surface logical form would be of\nthe required sort but also those that can be got from such logical\ntruths by making substitutions that were conceptually equivalent. The\nmore modern rough analog of this is to say that the analytic sentences\nare those that are true in virtue of logic and definition.\n\nFrege certainly developed logic beyond that which was available to\nKant, but he did not think of himself as changing the analytic status\nof it. Logic is after all the only avenue we have for giving meaning\nto the notion of (logical) contradiction. Of course Frege also\nattempted to reduce mathematics to logic (including both first and\nsecond order logic), and insofar as that reduction was successful it\nwould have implied that mathematics was analytic as well. Frege said\nlittle of geometry, but for him it was synthetic a priori.\n\nCarnap had not only studied with Frege, but like many of the logical\nempiricists he had started out as a neo-Kantian as well. So especially\nin view of Russell’s relatively more successful attempt at\nreducing mathematics to logic, it was perhaps natural that Carnap\nwould consider both mathematics and logic as analytic. Geometry could\nbe handled in several different ways that we will not discuss here.\nBut from fairly early on there was widespread agreement among the\nlogical empiricists that there was no synthetic a priori, and that\nlogic and mathematics and perhaps much else that seemed impervious to\nempirical disconfirmation should be thought of as analytic. The point\nof drawing the analytic-synthetic distinction, then, is not to divide\nthe body of scientific truths or to divide philosophy from science,\nbut to show how to integrate them into a natural scientific whole.\nAlong the way the distinction clarifies which inferences are to be\ntaken as legitimate and which are not. If, as Carnap and Neurath were,\nyou are impressed by Duhemian arguments to the effect that generally\nclaims must be combined in order to test them, the analytic-synthetic\ndistinction allows you to clarify which combinations of claims are\ntestable.\n\nIf analytic, a sentence is true in virtue of the conventions of\nlanguage. In saying that, however, we must pause to confront two\nwidespread confusions. First, Quine alleges (1963, 385f) that the\nnotion of analyticity was developed and purports to explain for both\nKant and Carnap how certainty is possible. In fact certainty has\nlittle or nothing to do with analyticity for the leading logical\nempiricists. In saying that such claims are based on convention they\nwere explicitly calling attention to the revisability of conventions\nand the sentences that owed their meanings to those conventions.\nSecond, nowadays any talk of convention is likely to prompt the\nresponse: “But that cannot be! No proposition can be made true\nby our conventions or decisions.” Unless it is a proposition\nabout conventions, this second sentence of the response is true. But\nit is also completely irrelevant. Analyticity applies to\nsentences rather than propositions. Our conventions and\ndecisions can and do affect what expressions mean and thus what\nsentences mean. Once the meaning is specified, it may well be that any\nsentence that has this meaning would be true even if, for example, the\npoint masses of the universe were arranged quite otherwise than they\nin fact are. These are the analytic sentences. No claim is being made\nthat meaning causes anything or that convention makes\nanything true. The “making” image here is out of place. It\nis just that in these cases the truth value of the sentence may well\nbe functionally dependent on meaning alone. If it is, then in this\nspecial sense, truth value depends on meaning, and that depends on\nconvention. Other sentences whose meanings are specified might well be\ntrue or false depending on how things in the external world, so to\nspeak, are arranged. In this other category of sentence the truth\nvalue is not functionally dependent on meaning alone. They are the\nsynthetic sentences. Now this puts matters extremely informally. But\nat least the nature of the confusions over certainty and convention\nshould be clear.\n\nIn the Logical Syntax of Language (1934/1937) Carnap defined\n‘analytic’ in a new way in order to circumvent\nGödel’s incompleteness results. The method used was to\ndistinguish between a derivation relation (the relation that holds\nbetween some premises and what can be got from them in a finite number\nof steps) and a consequence relation. The latter is an essentially\nsemantic relation that holds between some premises and some other\nclaim such that on all valuations under which the premises are all\ntrue, so is that other claim. This definition bears a stronger\nresemblance to Tarski’s account in (Tarski 1936b/1956). In any\ncase, Carnap is able to show that for any sentence of pure mathematics\neither it or its negation is a consequence of the null set of\npremises. This leaves Gödel’s results completely intact as\nthey concerned what is provable, that is, derivable from the null set\nof premises or from any one consistent axiomatization of mathematical\ntruths.\n\nAs noted above, another innovation of Logical Syntax is the\nPrinciple of Tolerance. While it reflects a long-standing attitude on\nCarnap’s part, the principle itself is new. Later Carnap was to\nsay that the Principle of Tolerance was “perhaps better called\nthe principle of conventionality” (Carnap 1942, 247), that is,\nthe conventionality of linguistic forms. Tolerance stabilizes the\nverification principle as well as Carnap’s empiricism, and it\nreinforces the idea that the analytic-synthetic distinction is always\nrelative to a particular language (Creath 2009).\n\nIn the late 1950s Carnap began exploring (1963a and 1966) how a notion\nof analyticity might be developed for novel theoretical terms where\nthe theories in which those terms are embedded are presented by means\nof a system of postulates. It is not clear that the account he\ndeveloped was intended to supersede his earlier account. In any case\nCarnap’s suggestion is as follows (where for convenience terms\nare used autonomously): Let T be the totality of theoretical\npostulates, and C be the totality of mixed sentences (the\nsentences of the theory containing both antecedent and novel terms).\nAlso let R(TC) be the Ramsey sentence for\nTC, that is, the result of replacing each of the\nnon-observational terms in TC with predicate variables and\nclosing that open sentence with corresponding existential quantifiers.\nR(TC) ⊃ TC can, Carnap says, be thought\nof as the analytic sentence for the theory, that is, a sentence that\ngives to the theoretical terms of TC their meaning. Over the\nlast decade, this idea of Carnap’s has provoked considerable\ndiscussion that has not yet been resolved. Whatever worries there may\nbe concerning this part of Carnap’s view, they are distinct from\nthe more famous concerns raised by Quine.\n\nQuine began having doubts about analyticity about 1940, though he\nseems not to have been firmly committed against it until later. In any\ncase his doubts were not published until 1951 in his famous paper\n“Two Dogmas of Empiricism”. Quine’s readers have\nunderstood his arguments in many different ways. The most general form\nof his complaint is that ‘analytic’ so far lacks the\nappropriate tie to observational criteria that Carnap’s own\naccount of theoretical terms in empirical science would demand. More\nspecifically, where there has been an attempt at such a general\ncriterion it has resulted in either a “drastic failure as tended\nto admit all or no sentences as analytic, or there has been a\ncircularity” (Quine 1963, 404) of a kind that defines\n‘analytic’ in terms that themselves lack the appropriate\nempirical criteria and so can be accounted for only by appeal to\nanalyticity itself.\n\nThis complaint falls far short, as Quine well understood, of a proof\nthat Carnap’s appeal to analyticity was doomed. First, it relies\non the demand that theoretical terms must satisfy some empirical\nsignificance criterion. Many people at the time, including some who\nfollowed Quine in rejecting analyticity, also rejected any general\nempirical significance demand for theoretical terms. Second, one could\naccept the demand for theoretical terms in physics or chemistry and\ndeny, as Carnap did, that the demand applied to his own work. This is\nbecause Carnap saw himself as working in an area within\nmetamathematics rather than in empirical linguistics. Third, Quine did\nnot pretend to have considered all of the possibilities for the\nexplication of analyticity. And so it may be possible to meet\nQuine’s demands to the extent that they are legitimate. Fourth\nand finally, Quine seems in Roots of Reference (1974) to have\nprovided an explication for ‘analytic’ that meets his\ndemand for empirical/behavioral criteria without inducing either the\ndrastic failure or the circularity envisioned above.\n\nThere is another somewhat independent thrust to Quine’s campaign\nagainst analyticity. In the last section of “Two Dogmas”\n(1951) Quine gives an extremely attractive sketch for an alternative\nepistemology that apparently makes no appeal to analyticity. Insofar\nas that sketch can be filled out successfully it would constitute a\ndispensability argument against analyticity. Whether it can be thus\nfilled out, however, remains to be seen.\n\nQuine’s other provocative theses, including especially his\nclaims about the indeterminacy of translation, while relevant to his\nassessment of analyticity, would carry us too far afield to consider\ntheir ramifications here. As with most topics in philosophy there is\nno uniform agreement in the literature as to whether the notion of\nanalyticity is or can be made sufficiently clear for use in scientific\nphilosophy. Nor is there such agreement that Quine’s\nepistemological sketch can be satisfactorily filled out. Both\napproaches have their defenders and their detractors. But between them\nthey seem to be the most promising avenues for integrating the\nlogic-mathematical part of science with the more straightforwardly\nempirical parts. Since Carnap is and Quine can be argued to be within\nthe logical empiricist tradition, this progress toward such\nunification can be counted as part of the legacy of the movement.\n4.3 Unity of Science and Reduction\n\nThe commitment of some of the logical empiricists to the unity of\nscience has been in recent years often discussed but less often\nunderstood. One hears in conversation that it was a sort of rearguard\naction designed to preserve as much as possible of a phenomenalist\nversion of ontological reduction. One reads in print that it can be\nrefuted by the obvious fact that the various sciences have quite\ndistinct theoretical vocabularies (Suppes 1978). Both reactions are\nmisplaced.\n\nIt was the left wing of the Vienna Circle, and above all Otto Neurath,\nthat championed the unity of science. They also promoted physicalism,\nanti-foundationalism, and a generally naturalistic viewpoint. A main\nfocus of their activities from the late 30s was The Encyclopedia\nof Unified Science edited by Neurath in Europe and Carnap and\nCharles Morris in Chicago. A great many philosophers of many different\npersuasions participated in that project. The project may have been\nunified science, but they did not have a completely unified view of\nwhat that project was. Here we will discuss the Neurath and Carnap\nversions of it to see what their central concerns were.\n\nNeurath seems to have had two primary motivations to advance under the\nbanner of the unity of science. First, he was concerned that there be\nno a priori methodological cleavage between the natural and the social\nsciences. On the social scientific side he was concerned that these\nsciences not condone some private, mysterious mode of insight\n(empathy) whose results could not be checked against more ordinary\npublic observation. Such a methodology would be a harbor for\nmetaphysics. On the natural scientific side, he was concerned to point\nout that, for Duhemian and other reasons, the situation is much\nmessier than is sometimes supposed, and so invidious comparisons by\nnatural scientists at the expense of social science were\nunwarranted.\n\nSecond, because Neurath was socially and politically engaged he was\nconcerned that the various sciences be connected in such a way that\nthey could be used together to solve complex human and social\nproblems. For this, considerable overlap of vocabulary was needed, and\nthis he called a “universal jargon”.\n\nIn recent years it is sometimes claimed that Neurath meant by the\nunity of science what some contemporary philosophers have defended as\nthe disunity of science. One cannot rule this claim out a priori. But\nthe often substantial differences among the current defenses of\ndisunity make evaluating this claim difficult. It is fair to say,\nhowever, that Neurath was suspicious of grand hypotheses, familiar\nsince the 19th century to derive all of chemistry, biology,\npsychology, and the social sciences (in that order) from a few basic\nprinciples of physics. It is unclear whether this stems from a general\nopposition to system building, since he was eager to develop\ninferential connections among the various sciences. Perhaps this is\nbetter expressed as an opposition to speculative system\nbuilding and to the idea that there is only one way of systematizing\nour science than to systematicity as such.\n\nCarnap’s position on unity is different from Neurath’s,\nbut they overlap. Carnap distinguished the unity of the language of\nscience from the unity of the laws of science. He wanted to defend the\nformer and to say what would be required for the latter. As far as the\nunity of the language of science, Carnap did in the Aufbau\ntry to initiate a program for defining all of scientific concepts on\nthe basis of a very small number of basic concepts, perhaps only one\nbasic concept. That does afford a certain conceptual economy, but it\nis now generally held by Carnap scholars (see especially Friedman 1987\nand Richardson 1998) that ontological reduction and reduction to a\nphenomenalist basis was far from his motive. Carnap explicitly\nacknowledged that another system of definitions, one with a\nphysicalist basis, might also be possible. Instead of ontological\neconomy and a phenomenal basis, Carnap’s project seems to have\nbeen the more Kantian one of indicating how semantic intersubjectivity\nis possible: How can it be that, even though I have only my own\nexperiences and you have only yours, we can nevertheless share a\ncommon body of concepts? The answer is given in terms of shared\ninferential structure and identifying any given concept with a unique\nplace within that shared overall structure. This is a highly holistic\nconception of concepts and it depends on thinking of the body of\nscientific commitments as a whole, as a unity.\n\nThe Aufbau was largely drafted before Carnap joined the\nVienna Circle. Once there and under some influence from Neurath,\nCarnap campaigned more insistently for physicalism and for the unity\nof science. They seemed often to be two sides of the same coin. From\n1933 onward there was a succession of monograph series with\n‘Unified Science’ in the title. Until his death in 1945,\nNeurath was in each case the main editor and Carnap either the\nassociate editor or one of the associate editors. The\nInternational Encyclopedia of Unified Science, begun in 1938 is\nundoubtedly the most famous of these. Carnap’s own essay on this\ntopic “Logical Foundations of the Unity of Science” (1938)\nwas printed as part of the very first number in the encyclopedia.\n\nThe dates here are relevant because by the time of this essay Carnap\nhad already decided (Carnap 1936–37) that theoretical terms\ncould not in general be given explicit definitions in the observation\nlanguage even though the observation reports were already in a\nphysicalist vocabulary. The partially defined theoretical terms could\nnot be eliminated. This seems to have caused Carnap no consternation\nat all, and it never seems to have occurred to him that there was any\nconflict whatever between this result and the unity of science. This\nis because by this point the elimination of concepts was not the point\nof the exercise; their inferential and evidential integration was.\n\nIn the 1936–37 article, “Testability and Meaning”\nCarnap called the partial definitions themselves “reduction\nsentences” and the system of definitions of theoretical terms,\nboth partial and complete, as a reduction of the theoretical terms to\nthe observational basis. Plainly he means by the word\n‘reduction’ something other than what we currently mean,\nnot that there is anything univocal about current uses of the word. By\n‘reduction’ of vocabulary A to vocabulary\nB Carnap means the specification of the inferential relations\nthat would allow us to say what sentences or combinations of sentences\nin A would count as evidence for sentences in B.\n\nThis is also the key to what Carnap means by the unity of the language\nof science. The language of science is unified, no matter how\ndifferent and exotic its various technical vocabularies may be, when\neach of its terms is reduced to (can be tested in) a common public\nobservation vocabulary. The call for the unity of the language of\nscience, then, amounts to no more than the demand that the various\nclaims of the separate sciences should be publicly testable in a\ncommon observation language. Controversies will of course arise as to\nwhat the observational vocabulary should be and what are the\nacceptable forms of linkage. Carnap’s demand for unity in the\nlanguage of science abstracts from those controversies to concentrate\non the goal of public testability. That does not seem to be an\nunreasonable demand.\n\nThe unity of the language of science so far discussed is quite a\ndifferent issue from the unity of the laws of science. And\nCarnap’s attitudes toward them are quite different. The latter\nissue concerns the extent to which the laws of one special science can\nbe inferred from those of another. Carnap tries to articulate what\nwould be involved in such a unification, but he nowhere says that such\na unity is either possible or mandatory. Finding any sort of\ninferential connections among sets of laws would be welcome of course.\nBut the question of how much unity there is, if any, among the various\nsciences is an empirical question that philosophers are ill equipped\nto answer. Philosophers should not make pronouncements, especially in\nadvance of having putative laws in hand, either that scientific laws\nare unified or that they are not. A certain modest deference to the\nempirical facts that philosophers generally do not have, again, does\nnot seem unreasonable.\n\nTaking unity as a working hypothesis, as some philosophers have done,\namounts to looking for inferential and nomological\nconnections among various sets of laws, but not to the assertion that\nsuch connection will be found. Even if we accept the idea that such\nconnections would be welcome if found, the question of whether one\nshould spend significant effort in looking for them is not thereby\nanswered. That would be a difficult and delicate practical question of\nhow to apportion one’s research effort that for the purposes of\nthis essay we must set aside.\n4.4 Probability\n\nThere are two broad approaches to probability represented in logical\nempiricism. One of these, the so-called frequentist approach, has an\nextensive 19th century history and was further developed\nfrom about 1920 onward by Richard von Mises and Hans Reichenbach. The\nother is the epistemic approach to probability. This goes back at\nleast to Laplace at the end of the 18th century. In the\n20th century Rudolf Carnap, who explored what he called\nlogical probability, and Frank Ramsey and Richard Jeffrey whose\naccounts can be distinguished from Carnap’s and are often called\nsubjective probability, all defended the epistemic approach. While\nRamsey visited the Vienna Circle he was not much influenced by its\nmembers on these matters. By contrast, Jeffrey studied and later\ncollaborated with Carnap but also made significant contributions of\nhis own.\n\nIt is natural to begin thinking about probabilities with a simple\nmathematical account that takes as its point of departure various\ngames of chance involving cards, dice, or coins. Bettors have long\nnoted that some outcomes are much more likely than others. In this\ncontext it is convenient to take the probability of a kind of outcome\nto be the ratio of such outcomes to all possible outcomes. Usually for\nreasons of symmetry in the physical set up, the possible outcomes are\nassumed to be equally likely. Where that assumption happens to be true\nor nearly so the empirical results of, say, a great many throws of a\npair of dice tends to be close to what the simple mathematical account\nwould suggest. Conversely, where the outcomes deviate from the\nexpected ratios, bettors begin to suspect that the dice, coins, and\ncards (or the manipulations of them) are not all that they seem. The\nsuspicion is that the outcomes are not equally likely and that the\nsimple mathematical account does not apply.\n\nThese facts suggest both two limitations of the simple account and the\nbeginnings of a way around them. The first limitation is that the\naccount applies only where the outcomes can be partitioned into\nalternatives that are equally likely. This is not the case when dice\nare loaded or in such real world cases as radioactive decay or weather\nforecasting. A second limitation is that the account, in describing\nthe possible outcomes as equally likely, implicitly appeals to the\nvery probability notion for which clarification was sought. The\nrealization that we can sometimes discover the falsehood of the\nassumption of equal likelihood and make a much more reasonable\nestimate of probability by making a large number of trials is very\nsuggestive. And from his dissertation onward Reichenbach worked out a\nvariety of imagined physical models that could guide ones thinking\nabout probability in useful ways. The result is what is often called\nthe frequency theory of probability (or sometimes the statistical\nfrequency theory or the limit frequency theory).\n\nEven a perfectly fair coin in an odd number of flips will never result\nin exactly the same number of heads and of tails. When the coin is\nfair and the number of flips is even, an outcome perfectly balanced\nbetween heads and tails is not guaranteed either. So, even on the\nassumption that the probability of the coin’s coming up heads\ndoes not change over the course of the trials, we need to be cautious.\nA larger number of flips might make us more confident that the ratio\nwe have seen is close to the “actual” value, but there is\nno finite number of flips after which we can say that the observed\nratio is exactly right. We will never make an infinite number of flips\neither, and in actual cases a large finite number of flips might so\nerode the coin as to bias the coin and discredit the result.\nNotwithstanding these limitations on an actual series of trials one\ncan imagine an infinite series of trials and define a notion of\nprobability with respect to it. This raises its own difficulty, namely\nthat ratios are not defined for infinite collections. They would be\ndefined, however, for any finite initial segment of such an infinite\nseries, thus giving a sequence of ratios. If this sequence of ratios\nsettles down on a limit, the probability of the coin showing a head\ngiven that it has been flipped can be defined as the limit of the\nratio of heads to total flips as the number of flips goes to\ninfinity.\n\nWhile probability thus defined has a somewhat counterfactual\ncharacter, that is not an obvious defect. Moreover, this notion of\nprobability applies perfectly well to biased coins and loaded dice, as\nwell as to radioactive decay. On the surface at least it also seem to\navoid using the notion of probability in its own definition, and in\nthese respects it seems to be an important improvement over the simple\nmathematical model with which we began. The definition locates the\nprobability objectively “out in nature” so to speak, and\nthis comports well with Reichenbach’s scientific realism.\n\nA problem that remained troublesome concerns the fact that one often\nwants to assign probabilities to particular events, events that in the\nnature of things cannot be repeated in all their particularity. Thus\nit is unclear how a frequency theory of probability is to be applied\nto such individual cases. This is often called the problem of the\nsingle case. It is a little difficult to assess how serious this is,\nbecause in actual practice we often have no difficulty in making\nprobability assignments to single cases. Suppose we are interested in\nthe probability of rain tomorrow. Tomorrow will never be repeated, and\nwe want to estimate the probability now. What we do is to look back\nthrough the records to find days relevantly like today and determine\nin what fraction of those cases those days were followed by rainy days\nand use that as our estimate. Even if we are comfortable with this\npractice, however, it is another matter to say why this should give us\na reasonable estimate of the value of the limit involved in a\nlogically impossible infinite sequence. This problem of the single\ncase was much discussed, and Wesley Salmon made progress in dealing\nwith it. Indeed, Salmon’s account of statistical explanation can\nbe viewed as a substantial mitigation of the problem of the single\ncase (W. Salmon 1970).\n\nThere are residual difficulties in making estimates of the\nprobabilities on the basis of finite evidence. The problem is that\neven when we are assured that the sequence of ratios has a limit, we\nhave no a priori grounds for saying how close the current ratio is to\nthat limit. We can boldly estimate the limit by means of the so-called\n“straight rule”. This just takes the most recent ratio as\nthe desired estimate. This is a good practical solution where the\nnumber of trials is already high, but this does not really say why the\nestimate should be good, how good it is supposed to be, or how many\ntrials would be high enough. In addition, the straight rule can yield\ncounterintuitive results where the number of trials is small.\n\nThough there are these issues outstanding, frequency theories define a\nconcept of probability indispensable for quantum theories and for a\nwide variety of other applications in the natural and social sciences.\nIt was not the only concept of probability to be developed by the\nlogical empiricist tradition. The primary other such concept was the\nepistemic conception of probability. We will begin with Carnap and\nthen move to those who developed a subjectivist account.\n\nCarnap is addressing a different issue than was addressed by von Mises\nand Reichenbach. Instead of focusing on physical phenomena and ratios\nwithin them, Carnap focuses on arguments and takes as his point of\ndeparture the widespread conviction that some arguments are stronger,\nin varying degrees, than others, even for the same conclusion.\nSimilarly some bodies of evidence can give us more reason to believe a\ngiven conclusion than would another body of evidence. Carnap sets as\nhis task the development of a quantitative concept of probability that\nwill clarify and explicate these widespread convictions. Such a\nquantitative concept would be an extraordinarily useful tool, and it\nwould be a useful successor to our ordinary, somewhat scattered\nnotions of confirmation and induction.\n\nCarnap approaches the problem by first considering extremely limited\nartificial languages and trying to find a confirmation function that\nwill work for that. If he succeeds he would then try to develop an\naccount that would work for a broader and richer range of languages.\nIn this his approach is like that of a physicist developing a physical\ntheory for the highly artificial situation of a billiard table or air\ntrack and then broadening the theory to deal with a wider range of\ncases. In Carnap’s case, however, it is somewhat unclear what\nsuccess would be in an artificial language very much unlike our own.\nIn any case, Carnap is not trying to describe our linguistic habits\nbut to clarify or even to replace them with something more useful.\n\nAs early as Logical Syntax (Carnap 1934/1937,\n244/316–17) Carnap had suggested that Wittgenstein’s\nremarks in the Tractatus about ranges (Tractatus,\n4.463) might be a starting point for thinking about probability. By\n1945 Carnap also distinguished the two approaches described here,\ninsisting that they were not competitors but were attempting to\nexplicate two different concepts of probability. One need not choose\none as the only concept; both concepts were useful. Reichenbach, by\ncontrast, never conceded that both concepts were needed and insisted\nthat his frequency notion could serve all epistemic purposes for which\nany notion of probability is needed.\n\nCarnap’s general strategy was first to identify a broad class of\nconfirmation functions, as subjectivists Ramsay and de Finetti were\nalso to do, and then find a natural way of limiting this class still\nfurther. The confirmation functions have to meet some basic\nmathematical conditions. The axioms that state these conditions\npartially define a function, and this function can be interpreted in a\nnumber of ways. Carnap himself lists three in Carnap 1950. In (1955),\nJohn Kemeny (one of Carnap’s collaborators and later a\nco-inventor of BASIC programming language and still later president of\nDartmouth College) gave an argument that persuaded Carnap that it was\nmore fruitful to think of the function as indicating fair betting\nquotients rather than evidential support. This took Carnap even closer\nin conception to the work of such subjectivists as Ramsey and de\nFinetti. Indeed, the discussion of fair betting quotients, and related\nissues of Dutch book arguments had been initiated by de Finetti.\n\nIn Logical Foundations of Probability (1950) Carnap had\ndiscussed Bayes’ theorem and promised to expand the discussion\nin a second volume. Carnap’s interest in Bayesianism grew, but\nthat second volume never materialized, quite possibly because rapid\ndevelopment of the field was still under way at the time of\nCarnap’s death. As his work proceeded Carnap tended to explain\nprobabilities by reference to events and propositions rather than\nspeak overtly about sentences. A similar change appears in the rest of\nCarnap’s work as well. It is not clear, however, whether this\namounts to a major change of view or a change in what he sees as the\nmost felicitous mode of expression. As the years progressed Carnap\ntended to see the remaining differences between himself and his\nsubjectivist co-workers as chiefly differences in emphasis. In any\ncase the subjectivist tradition is now dominant in philosophical\ndiscussions of probability (Zabell 2007, 293). Richard Jeffrey, whose\nown work arose out of logical empiricism, carried on that tradition\nfor 35 years after Carnap’s death. Jeffrey himself made major\ncontributions including a principle for updating ones beliefs when the\nevidence one learns is not certain. The world knows this principle as\n“Jeffrey conditionalization”; he called it simply\n“probability kinematics”.\n\nPopper’s view of probability, his propensity theory, differs\nfrom either of the two approaches discussed above. Unlike the\nepistemic approach of Carnap and others, Popper was not trying to\nclarify inductive relations because he did not believe that there are\ninductive inferences. Theories can be corroborated by their passing\nsevere tests, but they are not thereby inductively confirmed or made\nmore probable. For a discussion of whether there are any significant\nsimilarities between Popper’s idea of corroboration and the\nideas of inductive confirmation that he rejects, see (Salmon 1967,\n1968).\n\nPropensities are thought of as tendencies of a physical event or state\nto produce another event or state. Because propensities are to be\nfeatures of external events and not, to use Hume’s phrase,\nrelations of ideas, the propensity theory and the\nstatistical-frequency theory are sometimes grouped together as\naccounts of chance. Popper has specifically applied propensities to\nsingle non-repeatable events (1957), and that suggests that the\nconcept of propensity does not involve any essential reference to long\nsequences of events. Popper has also taken propensities as producing\noutcomes with a certain limit frequency (1959). This does suggest a\nrather closer tie to the statistical frequency approach. Later\nphilosophers developed both sorts of propensity theories, single-case\ntheories and long-run theories. (Gillies 2000) And like other\napproaches to probability and induction all these views remain\ncontroversial. While we will not discuss the relative merits of the\nvarious approaches further, those who are interested in Popper’s\nviews in this area should look at the many papers on probability,\ninduction, confirmation, and corroboration, and Popper’s\nreplies, in The Philosophy of Karl Popper (Schilpp 1974).\n5. Impact\n\nIn 1967 John Passmore reported that: “Logical positivism, then,\nis dead, or as dead as a philosophical movement ever becomes.”\n(1967, 57) Earlier in the same article he had equated logical\npositivism with logical empiricism, so presumably that was dead too.\nAt that time few would have disagreed with Passmore, even though\nCarnap was still alive and active. But in speaking of this movement\nPassmore was referring not to a movement but to specific doctrines,\nand his interpretation of them was much influenced by Ayer. Even so,\nPassmore conceded that the movement had left a legacy and that\n“the spirit which inspired the Vienna circle” persisted.\nIt still does.\n\nPart of the movement’s legacy lies in contemporary philosophy of\nscience. In the US nearly all philosophers of science can trace their\nacademic lineages to Reichenbach. Most were either his students or\nstudents of his students and so on. His scientific realism inspired a\ngeneration of philosophers, even those clearly outside the movement.\nEven the reaction against various forms of realism that have appeared\nin recent decades have roots in the logical empiricist movement.\nMoreover, philosophers of science are expected to know a great deal of\nthe science about which they philosophize and to be cautious in\ntelling practicing scientists what concepts they may or may not use.\nIn these respects and others contemporary philosophers promote a kind\nof naturalism, and by so doing they follow both the precept and the\nexample of the logical empiricists.\n\nThere are other issues where the legacy of logical empiricism is still\nvisible. Two different approaches to probability are still under\ndiscussion. One of them explores the objective chances of external\nevents; this investigation follows in the tradition of the frequency\ntheory of Reichenbach and von Mises. The second approach has an\nepistemic conception of probability as exemplified by Carnap. S.L.\nZabell summarizes the current situation as follows:\n\nBut although the technical contributions of Carnap and his school\nremain of considerable interest today, Carnap’s most lasting\ninfluence was more subtle but also more important: he largely shaped\nthe way current philosophy views the nature and role of probability,\nin particular its widespread acceptance of the Bayesian paradigm (as,\nfor example, in Earman, 1992; Howson and Urbach, 1993; and Jeffrey,\n2004). (Zabell 2007, 294)\n\n\nThere is also a continuing concern for how the various sciences fit\ntogether. Some have scouted theoretical unification and others a more\npluralistic model, just as the logical empiricists did. There was for\na while a vogue for the disunity of science. Some even said that their\nconception of the disunity of science is just what Neurath meant by\nthe unity of science. Parts of the discussion were intended as\nchallenges to logical empiricism, but often the arguments used were\npioneered by the logical empiricists themselves.\n\nFor the 30 years after Passmore’s report metaphysics became ever\nmore visible in philosophy. It was a diverse development, but in the\nself-conceptions of many of its most prominent practitioners there was\nno attempt to shun science or logic or to think that metaphysics had\naccess to facts that were deeper than or beyond those that a proper\nscience could reach. So the metaphysics that blossomed was not\nnecessarily of the sort that Carnap, Neurath, Reichenbach, and others\ncombated. Finally, in contemporary meta-philosophy variously logical\nempiricist ideas on ontology (Blatti and Lapointe 2016), explication\n(Kitcher 2008, and Carus 2007), and philosophy as conceptual\nengineering (Creath 1990, Chalmers 2020, and Haslanger 2000) continue\nto be of interest.\n\nEven in its heyday many philosophers who on either doctrinal or\nsociological grounds can be grouped with the logical empiricists did\nnot see themselves that way. We should not expect philosophers today\nto identify with the movement either. Each generation finds its place\nby emphasizing its differences from what has gone before. But the\nspirit of the movement still has its adherents. There are many who\nvalue clarity and who want to understand the methodology of science,\nits structure, and its prospects. There are many who want to find a\nnatural home within a broad conception of science for conceptual\ninnovation, for logic and mathematics, and for their own study of\nmethodology. And importantly there are those who see in science a\nprospect for intellectual and social reform and who see in their own\nstudy of science some hope for freeing us all from the merely habitual\nways of thinking “by which we are now possessed” (Kuhn\n1962, 1). These are the motives that define the movement called\nlogical empiricism. As Twain might have said, the reports of its death\nare greatly exaggerated.\n",
    "bibliography": {
        "categories": [
            "Cited Literature",
            "Other Selected Literature"
        ],
        "cat_ref_text": {
            "Cited Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Ayer, A.J., 1936, <em>Language Truth, and Logic</em>, London:\nGollancz.",
                "Blatti, S. and S. Lapointe (eds.), 2016, <em>Ontology After\nCarnap</em>, Oxford: Oxford University Press.",
                "Carnap, R., 1928/1967, <em>Der logische Aufbau der Welt</em>,\ntranslated by R.A. George as <em>The Logical Structure of the\nWorld</em>, Berkeley: University of California Press.",
                "–––, 1934/1937, <em>Logische Syntax der\nSprache</em>, translated by A. Smeaton as <em>The Logical Syntax of\nLanguage</em>, London: Kegan Paul, Trench, Trubner &amp; Co.",
                "–––, 1935, <em>Philosophy and Logical\nSyntax</em>, London: Kegan Paul, Trench, Trubner, &amp; Co.",
                "–––, 1936–37, “Testability and\nMeaning”, <em>Philosophy of Science</em>, 3: 419–71, 4:\n1–40.",
                "–––, 1938, “Logical Foundations of the\nUnity of Science”, <em>International Encyclopedia of Unified\nScience</em> (Volume 1, Number 1), Chicago: University of Chicago\nPress, 42–62.",
                "–––, 1942, <em>Introduction to Semantics</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1950, <em>Logical Foundations of\nProbability</em>, Chicago: University of Chicago Press.",
                "–––, 1958 [2017], “Value Concepts”,\ntranscribed and translated by A. Carus, <em>Synthese</em> 194:\n185–94. [Original manuscript\n <a href=\"http://digital.library.pitt.edu/u/ulsmanuscripts/pdf/31735061815522.pdf\" target=\"other\">available online</a>]",
                "–––, 1963a, “Carl G. Hempel on Scientific\nTheories”, in <em>The Philosophy of Rudolf Carnap</em>, P.A.\nSchilpp (ed.), LaSalle, IL: Open Court, 958–66.",
                "–––, 1963b, “K.R. Popper on Probability\nand Induction”, in <em>The Philosophy of Rudolf Carnap</em>,\nP.A. Schilpp (ed.), LaSalle, IL: Open Court, 995–998.",
                "–––, 1966, <em>Philosophical Foundations of\nPhysics</em>, M. Gardner (ed.), New York: Basic Books.",
                "Carus, A.W., 2007, <em>Carnap and Twentieth-Century\nThought</em><em>: Explication as Enlightenment</em>, Cambridge:\nCambridge University Press.",
                "Chalmers, D., 2020, “What is Conceptual Engineering and\nShould It to Be?”, <em>Inquiry</em>, published online 16 September 2020. \ndoi:10.1080/0020174X.2020.1817141",
                "Creath, R., 1976, “On Kaplan on Carnap on\nSignificance”, <em>Philosophical Studies</em>, 30:\n393–400.",
                "–––, 1990, “Introduction”, in <em>Dear Carnap,\nDear Van: The Quine-Carnap Correspondence and Related Work</em>, R.\nCreath (ed.), Los Angeles: University of California Press,\n1–43.",
                "–––, 2009, “The Gentle Strength of\nTolerance: <em>The Logical Syntax of Language</em> and Carnap’s\nPhilosophical Programme”, in <em>Carnap’s Logical Syntax\nof Language</em>, P. Wagner (ed.), Houndsmills, Basingstoke, UK:\nPalgrave Macmillan, 203–214.",
                "Earman, J., 1992, <em>Bayes or Bust: A Critical Examination of\nBayesian Confirmation Theory</em>, Cambridge, MA: MIT Press.",
                "Friedman, M., 1987, “Carnap’s <em>Aufbau</em>\nReconsidered”, <em>Noûs</em>, 21: 521–45.",
                "Gillies, D., 2000, “Varieties of Propensity”,\n<em>British Journal for the Philosophy of Science</em>, 51:\n807–835.",
                "Gödel, K., 1995, “Is Mathematics Syntax of\nLanguage?” in K. Gödel, <em>Collected Works</em> (Volume\n3), S. Fefferman, et al. (eds.), Oxford: Oxford University Press,\n334–362.",
                "Haslanger, S. 2000, “Gender and Race (What Are They? What Do We\nWant Them to Be?”, <em>Noûs</em>, 34: 31–55.",
                "Hempel, C.G., 1950, “Problems and Changes in the Empiricist\nCriterion of Meaning”, <em>Revue International de\nPhilosophie</em>, 11: 41–63.",
                "–––, 1951, “The Concept of Cognitive\nSignificance: A Reconsideration”, <em>Proceedings of the\nAmerican Academy of Arts and Sciences</em>, 80: 61–77.",
                "Howson, C. and Urbach, P., 1993, <em>Scientific Reasoning: The\nBayesian Approach</em>, LaSalle, IL: Open Court.",
                "–––, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.",
                "Kaplan, D., 1975, “Significance and Analyticity: A Comment\non Some Recent Proposals of Carnap”, in <em>Rudolf Carnap,\nLogical Empiricist</em>, J. Hintikka (ed.), Dordrecht, Boston: Reidel,\n87–94.",
                "Kemeny, J., 1955, “Fair Bets and Inductive\nProbabilities”, <em>Journal of Symbolic Logic</em>, 20:\n263–73.",
                "Kitcher, Philip. 2008, “Carnap and the Caterpillar”,\n<em>Philosophical Topics</em>, 36: 111–27.",
                "Kuhn, T., 1962, <em>The Structure of Scientific Revolutions</em>,\n<em>International Encyclopedia of Unified Science</em> (Volume II,\nNumber 2), Chicago: University of Chicago Press.",
                "Passmore, J., 1967, “Logical Positivism”, <em>The\nEncyclopedia of Philosophy</em> (Volume 5), P. Edwards (ed.), New\nYork: Macmillan, 52–57.",
                "Popper, K., 1935/1959, <em>Logik der Forschung</em>, translated by\nthe author as <em>The Logic of Scientific Discovery</em>, New York:\nBasic Books.",
                "–––, 1957, “The Propensity Interpretation\nof the Calculus of Probability”, S. Körner (ed.), <em>The\nColston Papers</em>, 9: 65–70.",
                "–––, 1959, “The Propensity Interpretation\nof Probability”, <em>British Journal for the Philosophy of\nScience</em>, 10: 25–42.",
                "Quine, W.V., 1951, “Two Dogmas of Empiricism”,\n<em>Philosophical Review</em>, 60: 20–43.",
                "–––, 1963, “Carnap and Logical\nTruth”, in <em>The Philosophy of Rudolf Carnap</em>, P. Schilpp\n(ed.), LaSalle, IL: Open Court, 385–406.",
                "–––, 1974, <em>The Roots of Reference</em>,\nLaSalle, IL: Open Court.",
                "Reichenbach, H., 1916/2008, <em>Der Begriff der Wahrscheinlichkeit\nfür die mathematische Darstellung der Wirklichkeit</em>, edited\nand translated by F. Eberhardt and C. Glymour as <em>The Concept of\nProbability in the Mathematical Representation of Reality</em>,\nLaSalle, IL: Open Court.",
                "–––, 1938, <em>Experience and Prediction: An\nAnalysis of the Foundations and the Structure of Knowledge</em>,\nChicago: University of Chicago Press.",
                "Richardson, A., 1998, <em>Carnap’s Construction of the\nWorld: The</em> Aufbau <em>and the Emergence of Logical\nEmpiricism</em>, Cambridge: Cambridge University Press.",
                "Russell, B., 1914, <em>Our Knowledge of the External World as a\nField for Scientific Method in Philosophy</em>, LaSalle, IL: Open\nCourt.",
                "Salmon, W., 1967, <em>The Foundations of Scientific\nInference</em>, Pittsburgh: University of Pittsburgh Press.",
                "–––, 1968, “The Justification of Inductive\nRules of Inference”, in <em>The Problem of Inductive Logic</em>,\nI. Lakatos (ed.), Amsterdam: North-Holland, 24–43.",
                "–––, 1970, “Statistical\nExplanation”, in <em>Nature and Function of Scientific\nTheories</em>, R. Colodny (ed.), Pittsburgh: University of Pittsburgh\nPress, 173–231.",
                "Schilpp, P. (ed.), 1974, <em>The Philosophy of Karl Popper</em>,\nLaSalle, IL: Open Court.",
                "Suppes, P., 1978, “The Plurality of Science”, in\n<em>PSA 1978: Proceedings of the 1978 Biennial Meeting of the\nPhilosophy of Science Association</em> (Volume 2), P. Asquith and I.\nHacking (eds.), East Lansing, MI: Philosophy of Science Association,\n3–16.",
                "Tarski, A., 1936a/1956, “Der Wahrheitsbegriff in den\nformalisierten Sprachen”, translated by J.H. Woodger as\n“The Concept of Truth in Formalized Languages” in\n<em>Logic, Semantics, Metamathematics</em>, by A. Tarski, Oxford:\nClarendon Press, 152–278.",
                "–––, 1936b/1956, “Über den Begriff\nden logischen Folgerung”, translated by J.H. Woodger as\n“On the Concept of Logical Consequence”, in <em>Logic,\nSemantics, Metamathematics</em>, by A. Tarski, Oxford: Clarendon\nPress, 409–20.",
                "Uebel, T., 2012, “Carnap, Philosophy, and ‘Politics in\nits Broadest Sense’”, in <em>Carnap and the Legacy of\nLogical Empiricism</em>, R. Creath (ed.), Vienna: Springer,\n133–145.",
                "–––, 2013, “Logical Positivism –\nLogical Empiricism: What’s in a Name?”, <em>Perspectives\nof Science</em>, 21: 58–99.",
                "Waismann, F., 1967/1979, <em>Wittgenstein und der Wiener\nKreis</em>, translated by J. Schulte and B. McGinnis as\n<em>Wittgenstein and the Vienna Circle</em>, Oxford: Basil\nBlackwell.",
                "Wittgenstein, L., 1921/1922, <em>Logische-Philosophische\nAbhandlung</em>, translated by C.K. Ogden as <em>Tractatus\nLogico-Philosophicus</em>, London: Routledge &amp; Kegan Paul.",
                "Zabell, S. L., 2007, “Carnap on Probability and\nInduction”, in <em>The Cambridge Companion to Carnap</em>, M.\nFriedman and R. Creath (eds.), Cambridge: Cambridge University Press,\n273–294.\n</ul>\n<h3>"
            ],
            "Other Selected Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Awodey, S. and A. W. Carus, 2004, “How Carnap Could Have\nReplied to Gödel”, in S. Awodey and C. Klein (eds.),\n<em>Carnap Brought Home: The View From Jena</em>, LaSalle, IL: Open\nCourt, 203–223.",
                "Cartwright, N. , J. Cat, L. Fleck, and T. Übel, 1996,\n<em>Otto Neurath: Philosophy Between Science and Politics</em>,\nCambridge: Cambridge University Press.",
                "Carnap, R. 2019, <em>The Collected Works of Rudolf Carnap, Vol. 1,\nEarly Writings</em>, A. Carus et al. (eds.), Oxford: Oxford University\nPress.",
                "Creath, R. 1990, <em>Dear Carnap, Dear Van: The Quine-Carnap\nCorrespondence and Related Work</em>, R. Creath (ed.), Los Angeles:\nUniversity of California Press.",
                "Friedman, M., 1987, “Carnap’s <em>Aufbau</em>\nReconsidered”, <em>Noûs</em>, 21: 521–45.",
                "–––, 1999, <em>Reconsidering Logical\nPositivism</em>, Cambridge: Cambridge University Press.",
                "–––, 2000, <em>A Parting of the Ways: Carnap,\nCassirer, and Heidegger</em>, LaSalle, IL: Open Court.",
                "Friedman, M. and R. Creath (eds.), 2007, <em>The Cambridge\nCompanion to Carnap</em>, Cambridge: Cambridge University Press.",
                "Frost-Arnold, G., 2013, <em>Carnap, Tarski, and Quine at Harvard:\nConversations of Logic, Mathematics, and Science</em>, Chicago: Open\nCourt.",
                "Hintikka, J. (ed.), 1962, <em>Logic and Language: Studies\nDedicated to Professor Rudolf Carnap on the Occasion of His Seventieth\nBirthday</em>, Dordrecht: Reidel.",
                "––– (ed.), 1975, <em>Rudolf Carnap, Logical\nEmpiricist: Materials and Perspectives</em>, Dordrecht: Reidel.",
                "Howson, C., 1973, “Must the Logical Probability of Laws be\nZero?” <em>British Journal for Philosophy of Science</em>, 24:\n153–163.",
                "Jeffrey, R., 1975, “Probability and Falsification: Critique\nof the Popper Program”, <em>Synthese</em>, 30:\n95–117.",
                "–––, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.",
                "Mancosu, P., “Harvard 1940–41: Tarski, Carnap, and\nQuine on a Finitistic Language of Mathematics for Science”,\n<em>History and Philosophy of Logic</em>, 26: 327–57.",
                "Miller, D., 1997, “Sir Karl Raimund Popper, CH, FBA”,\n<em>Biographical Memoirs of Fellows of the Royal Society of\nLondon</em>, 43: 367–409.",
                "Parrini, P., W. Salmon, and M. Salmon (eds.), 2003, <em>Logical\nEmpiricism: Historical and Contemporary Perspectives</em>, Pittsburgh:\nUniversity of Pittsburgh Press.",
                "Rescher, N. (ed.), 1985, <em>The Heritage of Logical\nPositivism</em>, Lanham, MD: University Presses of America.",
                "Rescher, N., 2006, “The Berlin School of Logical Empiricism\nand Its Legacy”, <em>Erkenntnis</em>, 64: 281–304.",
                "Richardson, A., 1998, <em>Carnap’s Construction of the\nWorld: The</em> Aufbau<em>and the Emergence of Logical\nEmpiricism</em>, Cambridge: Cambridge University Press.",
                "Richardson, A. and Übel, T. (eds.), 2007, <em>The Cambridge\nCompanion to Logical Empiricism</em>, New York: Cambridge University\nPress.",
                "Salmon, W. and G. Wolters (eds.), 1994, <em>Language, Logic, and\nthe Structure of Scientific Theories: The Carnap-Reichenbach\nCentennial</em>, Pittsburgh: University of Pittsburgh Press, and\nKonstanz, Germany: University of Konstanz Press.",
                "Sarkar, S., (ed.), 1992, <em>Synthese: Carnap: A Centenary\nReappraisal</em>, 93(1–2).",
                "Schilpp, P. (ed.), 1963, <em>The Philosophy of Rudolf Carnap</em>,\nLaSalle, IL: Open Court.",
                "Spohn, W. (ed.), 1991, <em>Erkenntnis: Special Volume in Honor of\nRudolf Carnap and Hans Reichenbach</em>, 35(1–3).",
                "Stadler, F., 1997/2001, <em>Studien zum Wiener Kreis: Entwicklung\nund Wirkung des Logischen Empiricismus im Kontext</em>, translated by\nC. Nielsen, et al. as <em>The Vienna Circle: Studies in the Origins,\nDevelopment and Influence of Logical Empiricism</em>, Vienna:\nSpringer.",
                "Übel, T., 2007, <em>Empiricism at the Crossroads: The Vienna\nCircle’s Protocol-Sentence Debate Revisited</em>, LaSalle, IL:\nOpen Court.",
                "Zabell, S. L., 1996, “Confirming Universal\nGeneralizations”, <em>Erkenntnis</em>, 45: 267–283.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Cited Literature</h3>\n<ul class=\"hanging\">\n<li>Ayer, A.J., 1936, <em>Language Truth, and Logic</em>, London:\nGollancz.</li>\n<li>Blatti, S. and S. Lapointe (eds.), 2016, <em>Ontology After\nCarnap</em>, Oxford: Oxford University Press.</li>\n<li>Carnap, R., 1928/1967, <em>Der logische Aufbau der Welt</em>,\ntranslated by R.A. George as <em>The Logical Structure of the\nWorld</em>, Berkeley: University of California Press.</li>\n<li>–––, 1934/1937, <em>Logische Syntax der\nSprache</em>, translated by A. Smeaton as <em>The Logical Syntax of\nLanguage</em>, London: Kegan Paul, Trench, Trubner &amp; Co.</li>\n<li>–––, 1935, <em>Philosophy and Logical\nSyntax</em>, London: Kegan Paul, Trench, Trubner, &amp; Co.</li>\n<li>–––, 1936–37, “Testability and\nMeaning”, <em>Philosophy of Science</em>, 3: 419–71, 4:\n1–40.</li>\n<li>–––, 1938, “Logical Foundations of the\nUnity of Science”, <em>International Encyclopedia of Unified\nScience</em> (Volume 1, Number 1), Chicago: University of Chicago\nPress, 42–62.</li>\n<li>–––, 1942, <em>Introduction to Semantics</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1950, <em>Logical Foundations of\nProbability</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1958 [2017], “Value Concepts”,\ntranscribed and translated by A. Carus, <em>Synthese</em> 194:\n185–94. [Original manuscript\n <a href=\"http://digital.library.pitt.edu/u/ulsmanuscripts/pdf/31735061815522.pdf\" target=\"other\">available online</a>]</li>\n<li>–––, 1963a, “Carl G. Hempel on Scientific\nTheories”, in <em>The Philosophy of Rudolf Carnap</em>, P.A.\nSchilpp (ed.), LaSalle, IL: Open Court, 958–66.</li>\n<li>–––, 1963b, “K.R. Popper on Probability\nand Induction”, in <em>The Philosophy of Rudolf Carnap</em>,\nP.A. Schilpp (ed.), LaSalle, IL: Open Court, 995–998.</li>\n<li>–––, 1966, <em>Philosophical Foundations of\nPhysics</em>, M. Gardner (ed.), New York: Basic Books.</li>\n<li>Carus, A.W., 2007, <em>Carnap and Twentieth-Century\nThought</em><em>: Explication as Enlightenment</em>, Cambridge:\nCambridge University Press.</li>\n<li>Chalmers, D., 2020, “What is Conceptual Engineering and\nShould It to Be?”, <em>Inquiry</em>, published online 16 September 2020. \ndoi:10.1080/0020174X.2020.1817141</li>\n<li>Creath, R., 1976, “On Kaplan on Carnap on\nSignificance”, <em>Philosophical Studies</em>, 30:\n393–400.</li>\n<li>–––, 1990, “Introduction”, in <em>Dear Carnap,\nDear Van: The Quine-Carnap Correspondence and Related Work</em>, R.\nCreath (ed.), Los Angeles: University of California Press,\n1–43.</li>\n<li>–––, 2009, “The Gentle Strength of\nTolerance: <em>The Logical Syntax of Language</em> and Carnap’s\nPhilosophical Programme”, in <em>Carnap’s Logical Syntax\nof Language</em>, P. Wagner (ed.), Houndsmills, Basingstoke, UK:\nPalgrave Macmillan, 203–214.</li>\n<li>Earman, J., 1992, <em>Bayes or Bust: A Critical Examination of\nBayesian Confirmation Theory</em>, Cambridge, MA: MIT Press.</li>\n<li>Friedman, M., 1987, “Carnap’s <em>Aufbau</em>\nReconsidered”, <em>Noûs</em>, 21: 521–45.</li>\n<li>Gillies, D., 2000, “Varieties of Propensity”,\n<em>British Journal for the Philosophy of Science</em>, 51:\n807–835.</li>\n<li>Gödel, K., 1995, “Is Mathematics Syntax of\nLanguage?” in K. Gödel, <em>Collected Works</em> (Volume\n3), S. Fefferman, et al. (eds.), Oxford: Oxford University Press,\n334–362.</li>\n<li>Haslanger, S. 2000, “Gender and Race (What Are They? What Do We\nWant Them to Be?”, <em>Noûs</em>, 34: 31–55.</li>\n<li>Hempel, C.G., 1950, “Problems and Changes in the Empiricist\nCriterion of Meaning”, <em>Revue International de\nPhilosophie</em>, 11: 41–63.</li>\n<li>–––, 1951, “The Concept of Cognitive\nSignificance: A Reconsideration”, <em>Proceedings of the\nAmerican Academy of Arts and Sciences</em>, 80: 61–77.</li>\n<li>Howson, C. and Urbach, P., 1993, <em>Scientific Reasoning: The\nBayesian Approach</em>, LaSalle, IL: Open Court.</li>\n<li>–––, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.</li>\n<li>Kaplan, D., 1975, “Significance and Analyticity: A Comment\non Some Recent Proposals of Carnap”, in <em>Rudolf Carnap,\nLogical Empiricist</em>, J. Hintikka (ed.), Dordrecht, Boston: Reidel,\n87–94.</li>\n<li>Kemeny, J., 1955, “Fair Bets and Inductive\nProbabilities”, <em>Journal of Symbolic Logic</em>, 20:\n263–73.</li>\n<li>Kitcher, Philip. 2008, “Carnap and the Caterpillar”,\n<em>Philosophical Topics</em>, 36: 111–27.</li>\n<li>Kuhn, T., 1962, <em>The Structure of Scientific Revolutions</em>,\n<em>International Encyclopedia of Unified Science</em> (Volume II,\nNumber 2), Chicago: University of Chicago Press.</li>\n<li>Passmore, J., 1967, “Logical Positivism”, <em>The\nEncyclopedia of Philosophy</em> (Volume 5), P. Edwards (ed.), New\nYork: Macmillan, 52–57.</li>\n<li>Popper, K., 1935/1959, <em>Logik der Forschung</em>, translated by\nthe author as <em>The Logic of Scientific Discovery</em>, New York:\nBasic Books.</li>\n<li>–––, 1957, “The Propensity Interpretation\nof the Calculus of Probability”, S. Körner (ed.), <em>The\nColston Papers</em>, 9: 65–70.</li>\n<li>–––, 1959, “The Propensity Interpretation\nof Probability”, <em>British Journal for the Philosophy of\nScience</em>, 10: 25–42.</li>\n<li>Quine, W.V., 1951, “Two Dogmas of Empiricism”,\n<em>Philosophical Review</em>, 60: 20–43.</li>\n<li>–––, 1963, “Carnap and Logical\nTruth”, in <em>The Philosophy of Rudolf Carnap</em>, P. Schilpp\n(ed.), LaSalle, IL: Open Court, 385–406.</li>\n<li>–––, 1974, <em>The Roots of Reference</em>,\nLaSalle, IL: Open Court.</li>\n<li>Reichenbach, H., 1916/2008, <em>Der Begriff der Wahrscheinlichkeit\nfür die mathematische Darstellung der Wirklichkeit</em>, edited\nand translated by F. Eberhardt and C. Glymour as <em>The Concept of\nProbability in the Mathematical Representation of Reality</em>,\nLaSalle, IL: Open Court.</li>\n<li>–––, 1938, <em>Experience and Prediction: An\nAnalysis of the Foundations and the Structure of Knowledge</em>,\nChicago: University of Chicago Press.</li>\n<li>Richardson, A., 1998, <em>Carnap’s Construction of the\nWorld: The</em> Aufbau <em>and the Emergence of Logical\nEmpiricism</em>, Cambridge: Cambridge University Press.</li>\n<li>Russell, B., 1914, <em>Our Knowledge of the External World as a\nField for Scientific Method in Philosophy</em>, LaSalle, IL: Open\nCourt.</li>\n<li>Salmon, W., 1967, <em>The Foundations of Scientific\nInference</em>, Pittsburgh: University of Pittsburgh Press.</li>\n<li>–––, 1968, “The Justification of Inductive\nRules of Inference”, in <em>The Problem of Inductive Logic</em>,\nI. Lakatos (ed.), Amsterdam: North-Holland, 24–43.</li>\n<li>–––, 1970, “Statistical\nExplanation”, in <em>Nature and Function of Scientific\nTheories</em>, R. Colodny (ed.), Pittsburgh: University of Pittsburgh\nPress, 173–231.</li>\n<li>Schilpp, P. (ed.), 1974, <em>The Philosophy of Karl Popper</em>,\nLaSalle, IL: Open Court.</li>\n<li>Suppes, P., 1978, “The Plurality of Science”, in\n<em>PSA 1978: Proceedings of the 1978 Biennial Meeting of the\nPhilosophy of Science Association</em> (Volume 2), P. Asquith and I.\nHacking (eds.), East Lansing, MI: Philosophy of Science Association,\n3–16.</li>\n<li>Tarski, A., 1936a/1956, “Der Wahrheitsbegriff in den\nformalisierten Sprachen”, translated by J.H. Woodger as\n“The Concept of Truth in Formalized Languages” in\n<em>Logic, Semantics, Metamathematics</em>, by A. Tarski, Oxford:\nClarendon Press, 152–278.</li>\n<li>–––, 1936b/1956, “Über den Begriff\nden logischen Folgerung”, translated by J.H. Woodger as\n“On the Concept of Logical Consequence”, in <em>Logic,\nSemantics, Metamathematics</em>, by A. Tarski, Oxford: Clarendon\nPress, 409–20.</li>\n<li>Uebel, T., 2012, “Carnap, Philosophy, and ‘Politics in\nits Broadest Sense’”, in <em>Carnap and the Legacy of\nLogical Empiricism</em>, R. Creath (ed.), Vienna: Springer,\n133–145.</li>\n<li>–––, 2013, “Logical Positivism –\nLogical Empiricism: What’s in a Name?”, <em>Perspectives\nof Science</em>, 21: 58–99.</li>\n<li>Waismann, F., 1967/1979, <em>Wittgenstein und der Wiener\nKreis</em>, translated by J. Schulte and B. McGinnis as\n<em>Wittgenstein and the Vienna Circle</em>, Oxford: Basil\nBlackwell.</li>\n<li>Wittgenstein, L., 1921/1922, <em>Logische-Philosophische\nAbhandlung</em>, translated by C.K. Ogden as <em>Tractatus\nLogico-Philosophicus</em>, London: Routledge &amp; Kegan Paul.</li>\n<li>Zabell, S. L., 2007, “Carnap on Probability and\nInduction”, in <em>The Cambridge Companion to Carnap</em>, M.\nFriedman and R. Creath (eds.), Cambridge: Cambridge University Press,\n273–294.</li>\n</ul>\n<h3>Other Selected Literature</h3>\n<ul class=\"hanging\">\n<li>Awodey, S. and A. W. Carus, 2004, “How Carnap Could Have\nReplied to Gödel”, in S. Awodey and C. Klein (eds.),\n<em>Carnap Brought Home: The View From Jena</em>, LaSalle, IL: Open\nCourt, 203–223.</li>\n<li>Cartwright, N. , J. Cat, L. Fleck, and T. Übel, 1996,\n<em>Otto Neurath: Philosophy Between Science and Politics</em>,\nCambridge: Cambridge University Press.</li>\n<li>Carnap, R. 2019, <em>The Collected Works of Rudolf Carnap, Vol. 1,\nEarly Writings</em>, A. Carus et al. (eds.), Oxford: Oxford University\nPress.</li>\n<li>Creath, R. 1990, <em>Dear Carnap, Dear Van: The Quine-Carnap\nCorrespondence and Related Work</em>, R. Creath (ed.), Los Angeles:\nUniversity of California Press.</li>\n<li>Friedman, M., 1987, “Carnap’s <em>Aufbau</em>\nReconsidered”, <em>Noûs</em>, 21: 521–45.</li>\n<li>–––, 1999, <em>Reconsidering Logical\nPositivism</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2000, <em>A Parting of the Ways: Carnap,\nCassirer, and Heidegger</em>, LaSalle, IL: Open Court.</li>\n<li>Friedman, M. and R. Creath (eds.), 2007, <em>The Cambridge\nCompanion to Carnap</em>, Cambridge: Cambridge University Press.</li>\n<li>Frost-Arnold, G., 2013, <em>Carnap, Tarski, and Quine at Harvard:\nConversations of Logic, Mathematics, and Science</em>, Chicago: Open\nCourt.</li>\n<li>Hintikka, J. (ed.), 1962, <em>Logic and Language: Studies\nDedicated to Professor Rudolf Carnap on the Occasion of His Seventieth\nBirthday</em>, Dordrecht: Reidel.</li>\n<li>––– (ed.), 1975, <em>Rudolf Carnap, Logical\nEmpiricist: Materials and Perspectives</em>, Dordrecht: Reidel.</li>\n<li>Howson, C., 1973, “Must the Logical Probability of Laws be\nZero?” <em>British Journal for Philosophy of Science</em>, 24:\n153–163.</li>\n<li>Jeffrey, R., 1975, “Probability and Falsification: Critique\nof the Popper Program”, <em>Synthese</em>, 30:\n95–117.</li>\n<li>–––, 2004, <em>Subjective Probability: The Real\nThing</em>, Cambridge: Cambridge University Press.</li>\n<li>Mancosu, P., “Harvard 1940–41: Tarski, Carnap, and\nQuine on a Finitistic Language of Mathematics for Science”,\n<em>History and Philosophy of Logic</em>, 26: 327–57.</li>\n<li>Miller, D., 1997, “Sir Karl Raimund Popper, CH, FBA”,\n<em>Biographical Memoirs of Fellows of the Royal Society of\nLondon</em>, 43: 367–409.</li>\n<li>Parrini, P., W. Salmon, and M. Salmon (eds.), 2003, <em>Logical\nEmpiricism: Historical and Contemporary Perspectives</em>, Pittsburgh:\nUniversity of Pittsburgh Press.</li>\n<li>Rescher, N. (ed.), 1985, <em>The Heritage of Logical\nPositivism</em>, Lanham, MD: University Presses of America.</li>\n<li>Rescher, N., 2006, “The Berlin School of Logical Empiricism\nand Its Legacy”, <em>Erkenntnis</em>, 64: 281–304.</li>\n<li>Richardson, A., 1998, <em>Carnap’s Construction of the\nWorld: The</em> Aufbau<em>and the Emergence of Logical\nEmpiricism</em>, Cambridge: Cambridge University Press.</li>\n<li>Richardson, A. and Übel, T. (eds.), 2007, <em>The Cambridge\nCompanion to Logical Empiricism</em>, New York: Cambridge University\nPress.</li>\n<li>Salmon, W. and G. Wolters (eds.), 1994, <em>Language, Logic, and\nthe Structure of Scientific Theories: The Carnap-Reichenbach\nCentennial</em>, Pittsburgh: University of Pittsburgh Press, and\nKonstanz, Germany: University of Konstanz Press.</li>\n<li>Sarkar, S., (ed.), 1992, <em>Synthese: Carnap: A Centenary\nReappraisal</em>, 93(1–2).</li>\n<li>Schilpp, P. (ed.), 1963, <em>The Philosophy of Rudolf Carnap</em>,\nLaSalle, IL: Open Court.</li>\n<li>Spohn, W. (ed.), 1991, <em>Erkenntnis: Special Volume in Honor of\nRudolf Carnap and Hans Reichenbach</em>, 35(1–3).</li>\n<li>Stadler, F., 1997/2001, <em>Studien zum Wiener Kreis: Entwicklung\nund Wirkung des Logischen Empiricismus im Kontext</em>, translated by\nC. Nielsen, et al. as <em>The Vienna Circle: Studies in the Origins,\nDevelopment and Influence of Logical Empiricism</em>, Vienna:\nSpringer.</li>\n<li>Übel, T., 2007, <em>Empiricism at the Crossroads: The Vienna\nCircle’s Protocol-Sentence Debate Revisited</em>, LaSalle, IL:\nOpen Court.</li>\n<li>Zabell, S. L., 1996, “Confirming Universal\nGeneralizations”, <em>Erkenntnis</em>, 45: 267–283.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Ayer, Alfred Jules",
            "Carnap, Rudolf",
            "Gödel, Kurt",
            "Hempel, Carl",
            "Neurath, Otto",
            "Popper, Karl",
            "Quine, Willard Van Orman",
            "Reichenbach, Hans",
            "Sellars, Wilfrid",
            "Tarski, Alfred",
            "Vienna Circle"
        ],
        "entry_link": [
            {
                "../ayer/": "Ayer, Alfred Jules"
            },
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../goedel/": "Gödel, Kurt"
            },
            {
                "../hempel/": "Hempel, Carl"
            },
            {
                "../neurath/": "Neurath, Otto"
            },
            {
                "../popper/": "Popper, Karl"
            },
            {
                "../quine/": "Quine, Willard Van Orman"
            },
            {
                "../reichenbach/": "Reichenbach, Hans"
            },
            {
                "../sellars/": "Sellars, Wilfrid"
            },
            {
                "../tarski/": "Tarski, Alfred"
            },
            {
                "../vienna-circle/": "Vienna Circle"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logical-empiricism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/logical-empiricism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=logical-empiricism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/logical-empiricism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logical-empiricism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/logical-empiricism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=logical-empiricism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/logical-empiricism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.carnap.org/\" target=\"other\">Rudolf Carnap</a>,\n maintained by Douglas Marshall (University of Minnesota).",
            "<a href=\"http://www.univie.ac.at/ivc/e_institut/index.htm\" target=\"other\">Institute Vienna Circle</a>,\n Society for the Advancement of the Scientific World Conception,\nVienna.",
            "<a href=\"http://www.wvquine.org/\" target=\"other\">Willard Van Orman Quine</a>,\n maintained by Douglas Boynton Quine.",
            "<a href=\"http://pitt.libguides.com/asp\" target=\"other\">Archives of Scientific Philosophy</a>,\n Special Collections Department, University Library System, University\nof Pittsburgh.",
            "<a href=\"https://web.archive.org/web/20190607080152/https://viennacirclefoundation.nl/\" target=\"other\">Vienna Circle Foundation</a>,\n to promote studies of the work of members of the Vienna Circle and to\nprotect the Vienna Circle Archive, Amsterdam (this webpage is archived\nat the Internet Archive)."
        ],
        "listed_links": [
            {
                "http://www.carnap.org/": "Rudolf Carnap"
            },
            {
                "http://www.univie.ac.at/ivc/e_institut/index.htm": "Institute Vienna Circle"
            },
            {
                "http://www.wvquine.org/": "Willard Van Orman Quine"
            },
            {
                "http://pitt.libguides.com/asp": "Archives of Scientific Philosophy"
            },
            {
                "https://web.archive.org/web/20190607080152/https://viennacirclefoundation.nl/": "Vienna Circle Foundation"
            }
        ]
    }
}