{
    "url": "margaret-fell",
    "title": "Margaret Fell",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Jacqueline Broad\n<jacqueline.broad@monash.edu>",
        "author_links": [
            {
                "mailto:jacqueline%2ebroad%40monash%2eedu": "jacqueline.broad@monash.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nJacqueline Broad\n&lt;<a href=\"mailto:jacqueline%2ebroad%40monash%2eedu\"><em>jacqueline<abbr title=\" dot \">.</abbr>broad<abbr title=\" at \">@</abbr>monash<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jan 26, 2012",
        "substantive revision Wed Jan 29, 2020"
    ],
    "preamble": "\n\n\nOn the strength of her 1666 pamphlet, Womens Speaking\nJustified, the Quaker writer Margaret Fell has been hailed as a\nfeminist pioneer. In this short tract, Fell puts forward several\narguments in favour of women’s preaching. She asserts the\nspiritual equality of the sexes, she appeals to female exempla in the\nBible, and she reinterprets key scriptural passages that appear to\nendorse women’s subordination to men. Some scholars, however,\nhave questioned Fell’s status as a feminist thinker. They point\nto the fact that, according to Fell and her fellow Quakers, women are\npermitted to speak in church—but only in so far as they are\nvessels or mouthpieces for Christ. In every other respect, it is\nargued, the early Quakers continue to either ignore, denigrate, or\nefface the female sex. Other critics point out that the Quakers’\ngender egalitarian principles operate in a rather limited sphere of\nactivity—that of religious worship alone—and do not extend\nto the socio-political domain. Notwithstanding such criticisms,\nFell’s defence of women’s preaching was undoubtedly\ninfluential in her time and may have inspired women writers beyond her\nreligious circle. Foxton (1994) claims that Quaker women’s\nwritings more generally set an important precedent for women’s\npublishing activities in the seventeenth century, on both religious and\nnon-religious topics. Recent scholars also point to evidence that Fell’s works on Judaism may have influenced Spinoza (cf. Fell 1987; Clausen-Brown 2019).\n",
    "toc": [
        {
            "#LifeWork": "1. Life and works"
        },
        {
            "#QuakThouPrac": "2. Quaker thought and practice"
        },
        {
            "#DoctLigh": "2.1 Doctrine of the light"
        },
        {
            "#AntiClerAntiAuth": "2.2 Anti-clericalism and anti-authoritarianism"
        },
        {
            "#LibeCons": "2.3 Liberty of conscience"
        },
        {
            "#QuakFemi": "3. Quaker feminism"
        },
        {
            "#ArguAgaiWomePrea": "3.1 Arguments against women’s preaching"
        },
        {
            "#PrecWomeSpeaJust": "3.2 Precursors to Womens Speaking Justified"
        },
        {
            "#ArguWomeSpeaJust": "3.3 Arguments of Womens Speaking Justified"
        },
        {
            "#OtheQuakDefeWomePrea": "4. Other Quaker defences of women’s preaching"
        },
        {
            "#CritQuakDefeWome": "5. Criticisms of Quaker defences of women"
        },
        {
            "#DeniNatuWome": "5.1 Denigration of natural women"
        },
        {
            "#LimiEgal": "5.2 Limitations to egalitarianism"
        },
        {
            "#RespCrit": "5.3 Response to criticisms"
        },
        {
            "#ConcFellPlacHistFemi": "6. Conclusion: Fell’s place in history of feminism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#WorkFell": "Works by Fell"
        },
        {
            "#OthePrimLite": "Other Primary literature"
        },
        {
            "#SecoLite": "Secondary literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and works\n\nFell’s long life spanned the reigns of six English monarchs\nand some of the most dramatic political events in English history,\nincluding the Civil Wars of 1642–51 and the Glorious Revolution of\n1688–89. Fell (née Askew) was born at Marsh Grange,\nDalton-in-Furness, in Lancashire, England, in 1614, and she died in\n1702. At the age of seventeen, she married the barrister Thomas Fell\n(c. 1598–1658) and together they had nine children. In 1652,\nupon his return home, Thomas Fell was greeted by neighbors who warned\nhim that his wife had been bewitched by a travelling preacher. This\npreacher was George Fox (1624–91), a charismatic religious dissenter\nand first-generation leader of the Society of Friends (also known as\nQuakers). Upon hearing Fox speak at her local church, Margaret Fell\ntestified that\n\n\nIt pleased the Lord so to open my understanding Imediately in the\ntime of G Fs [George Fox’s] declaration. That I saw perfectly\nJust then that wee were all wrong, & that we were but Theives,\nthat had stollen the scriptures. which caused me to shed many tears.\nAnd I satt down in my pew & wept all the while … (Glines\n2003, 430).\n\n\n\nFrom that day forward, Margaret Fell was a convert to Quakerism.\nDespite his initial reservations, Thomas Fell was supportive of his\nwife’s conversion, and the Fell family home of Swarthmoor Hall\nbecame a popular meeting place for Friends. In these early years, while\nThomas Fell was chief magistrate of the area, the northern Quakers seem\nto have avoided persecution. Though Margaret Fell eventually suffered\nimprisonment for her beliefs, she remained a woman of considerable\nwealth and social status throughout her life.\n\n\nTogether with Fox and William Penn (1644–1718), Fell is now regarded\nas one of the founders of Quakerism. She helped to sustain the movement\nthrough her large correspondence with other Friends on a range of\npersonal and religio-political topics. She travelled widely and spent\nextended periods in London petitioning the political authorities on\nbehalf of persecuted Quakers; she personally addressed not only Oliver\nCromwell but also Charles II and James II. And on at least three\noccasions, she spent periods in prison for holding Quaker meetings at\nher house and for refusing to take the Oath of Allegiance. Fell married\nGeorge Fox in 1669, eleven years after her first husband’s death,\nand she was subsequently known as Margaret Fox. Together they were\nactive organizers of the separate Quaker women’s meetings, first\nofficially begun in 1671.\n\n\nNot long after her conversion, Fell began to express her Quaker\nbeliefs in print, starting with False Prophets, Antichrists,\nDeceivers in 1655. She was the author (or co-author) of at least\n23 works in total, mostly in the form of short pamphlets. Some of her\nmore substantial works—including A Call to the Universall\nSeed of God (1665), Womens Speaking Justified (1666;\nsecond edition, 1667), and A Touch-Stone: or, A Perfect Tryal by\nthe Scriptures (1667)—were written during the period of her\nimprisonment in Lancaster Castle (1664–68). Following her death,\nseveral of her works were collected together and published as A\nBrief Collection of Remarkable Passages and Occurrences (1710).\nDespite its 535 pages, this collection is nevertheless incomplete and\nincludes only a small sample of letters. Her works are now available in\ntheir original form in online databases such as Early English Books\nOnline, or in selective modern anthologies such as Wallace (1992),\nBooy (2004), and Garman et al. (1996). Elsa F. Glines has\npublished 164 of Fell’s surviving letters in her collection\nThe Letters of Margaret Fell (2003).\n2. Quaker thought and practice\n\n\nFell’s views about female spiritual authority are best\nunderstood in the context of her wider religious beliefs. Above all,\nFell embraces the Quaker notion that every human being has the\n“Light of Christ” within them and that this light is the\nSecond Coming of Christ in the flesh (cf. Bruyneel 2010, 6–7;\nBruyneel 2015, 107–8; Donawerth and Lush 2018,\n11–13). According to the Quaker philosophy, all human beings are\ncapable of attaining salvation provided that they turn their minds to\nthe divine light. This universalism concerning salvation, and the\nQuaker view that everyone is capable of discerning fundamental\nreligious truths for themselves, had notable implications for early\nQuaker practice. The Quakers believe that Christ is equally manifest\nin everyone and that God is “no respecter of persons”\n(Acts 10:34). From early on, the Quakers enacted this belief by taking\na collaborative approach to prayer meetings. They did not appoint a\nsingle authoritarian preacher, “set up to teach them, it may be\nthirty or forty years together” (Fell 1667b, 86), but rather\nmembers would wait in silence till someone felt the light stir\nwithin. A guiding principle, Fell says, was that no-one should\n“strive for Mastery” but everyone should “esteem\nothers better than themselves” (Fell 1710, 55). In their\nday-to-day interactions with social superiors, Quaker men would not\nremove their hats, and Quaker women would not curtsey. They refused to\ntake oaths (such as the Oaths of Allegiance and Supremacy) and they\ndid not use deferential titles. This lack of outward submission led\nsome critics to accuse Quakers of “levelling all\nconditions” and ignoring social hierarchies between magistrates\nand people, husbands and wives, and masters and servants (Collier\n1657, 12).\n\n\nDespite her anti-authoritarian beliefs, however, Fell was no\nadvocate of active resistance to political authority. She was, in fact,\none of the first writers to articulate the Quaker philosophy of peace\nand non-resistance. In a letter to Charles II, dated 1660, she declares\nthat the Quakers aspire\n\n\n\nto live peaceably with all men, And not to Act any thing against the\nKing nor the peace of the Nation, by any plotts, contrivances,\ninsurrections, or carnall weapons to hurt or destroy either him or the\nNation thereby, but to be obedient unto all just & lawfull\nCommands. (Glines 2003, 280)\n\n\n\nFell emphasizes that although Friends cannot in good conscience take\nan oath, “in Substance they perform that, which is true\nAllegiance to the King” (Fell 1710, 29–30). They express their\nallegiance by opposition to resistance and through denial of the\nPope’s authority (Fell 1710, 31). In none of her works does Fell\ncall for the subject’s right to rebel against tyrannical or\nirreligious political leaders.\n\n\nIn the early years of the movement, Quakers also dressed plainly and\nwithout ostentation. This practice was an outcome of focusing on the\n“Inner-Man” rather than outer appearances (Fell 1660f, 20).\nIn one of her last “Epistle to Friends” (1698), Fell\nsternly warns against the dangers of leading young Friends into\n“the observation of outward things”. The outward form does\nnot make a true Christian, but rather the inner person:\n“It’s the Spirit,” she says, “that gives\nLife” (Fell 1710, 535).\n2.1 Doctrine of the light\n\n\nThis emphasis on the inward rather than the outward person lies at\nthe heart of Fell’s egalitarian views about spiritual authority.\nAccording to Quaker philosophy, the spirit of Christ is “in the\ninward parts”, it is “the Law of God written in the\nheart” or the “Candle of the Lord in you” (Fell 1710,\n35, 49). The light of Christ is divinely or supernaturally implanted in every individual’s conscience;\nit is not a natural human capacity, such as reason or rational judgment\n(cf. Apetrei 2009, 134). By participating in this light, human beings\npartake in “a living, pure, eternal, immortal Principle”\n(Fell 1710, 92). Through the inner light, they come to learn God’s\nwill and law—the light “makes the will of God\nmanifest” (Fell 1710, 50). They learn moral truths, such as\n“to doe to all men as ye would they should doe to you”, and\nthat “thou shalt not steal” and “thou shalt not\nkill” (Fell 1656a, 2, 24). The light enables human beings to\nrecognize sin and to make considered moral judgments in matters of\njustice and equity. And the light reproaches the individual for\nstraying from the righteous path: it “will reprove, this teacheth\nin secret, and is alwayes present, when you are upon your Beds”\n(Fell 1656c, 7).\n\n\nBut while the light is undoubtedly divine or supernatural in nature,\naccording to Fell, it is still up to the individual to direct her mind\nto the light in order to attain redemption. Above all, personal\nsalvation depends upon the mind discerning the light within and then\ndiligently keeping to it. The individual must engage in constant mental\neffort, she must “consider seriously” and “come to\nsearch and examine” her beliefs for herself (Fell 1656b, 1,\n14).\n\n\nFell reiterates these points in several tracts addressed to the Jews\nof Europe, including For Manasseth Ben Israel (1656), A\nLoving Salutation (c. 1656–57) and A Call unto the Seed\nof Israel (1668). In the 1650s, Oliver Cromwell contemplated\nreadmitting the Jews to England for the first time since their\nexpulsion in the thirteenth century. In her writings, Fell welcomes\nthe return of the Jews, but only on the condition that they convert to\nChristianity. As a millenarian thinker, she believes that the\nconversion of the Jews signals the fulfilment of biblical prophecies\nforetelling “the last days” and the second coming of\nChrist (cf. Gardiner 1994; Guibbory 2000). Fell thus appeals to the\nJews to turn from their “outward worship” and to\nacknowledge the divine light within them. In Manasseth Ben\nIsrael, Fell calls on them to “therefore cease from your\nabomination, and turne to the living God” (Fell 1656c,\n4). “If ever you come to know the true and living God,”\nshe says, “you must hearken to this Prophet which calls your\nminds to within, for by this doth the living God teach his People\nhimselfe” (5). In A Loving Salutation, Fell likewise\nurges the Jews to “hearken diligently” (Fell 1656a, 3):\n“Incline your eare, and come unto me, hear, and your souls shall\nlive” (3), and “thine eyes shall see thy teacher, and thy\neares shall heare a voice behind thee” (6). With such exhortations, Fell emphasizes\nthat living in the light requires certain activity on part of the\nmoral agent, and not just the mere passive reception of the power and\nspirit of God. While everyone has the divine light within their\nconscience, they can only know the truths that the light\nreveals—and attain salvation—by actively hearkening to the\nlight: “if ye desire this inheritance,” she says to the\nJews, “turn your minds into the light” (8).\n\n\nIn these and other writings, Fell promotes a certain critical\nattitude toward customary ways of practising and thinking about\nreligion. The path to God, she says, “leads out of the world, out\nof the worlds ways, fashions, and customs, and this makes a separation\nfrom the world” (Fell 1710, 65). The individual must learn to\nrely on her own independent faculty of moral judgement or her\nconscience. Both Jews and Gentiles are urged to “let\nthat in your Consciences (which is of God) which respects no Person,\nRead and Examine those Scriptures” (Fell 1710, 65).\n\n\nIn the 1650s, Fell arranged to have Manasseth Ben Israel\nand A Loving Salutation translated into Hebrew, in a bid to\nreach a Jewish audience. There is some evidence that Baruch Spinoza\nwas the anonymous translator of A Loving Salutation (cf. Fell\n1987), and that he may have adapted some of Fell’s arguments in\nhis Theological-Political Treatise (cf. Clausen-Brown\n2019).\n2.2 Anti-clericalism and anti-authoritarianism\n\n\nFell’s anti-clericalism (her opposition to the professional\nclergy) is typical of Quaker texts of the period. In her view, the\nlight is the only teacher or spiritual guide that anyone requires for\nsalvation. The divine law is not written in paper and ink but rather\nwith the spirit of the living God. Fell says that “Though ye may\nget all the words of the whole Scripture in your brains and\ncomprehension, so long as ye deny the light, and turn your minds from\nthe light, and seek to know these things without you, ye shall never\nknow them” (Fell 1656b, 3). The light of Christ makes everyone\ncapable of interpreting scripture for themselves, without the need for\nan education in Hebrew, Greek, or Latin. This claim is made most\nforcefully in A Touch-Stone: or, A Perfect Tryal by the\nScriptures, in which Fell says that preachers of the light need\nnot be “Learned Men, such as have been at Oxford or\nCambridge” (Fell 1667b, 18). The apostles, after all,\ndid not have degrees from prestigious universities, yet no one doubts\nthat they taught the word of God.\n\n\nOn these grounds, Fell rails against those who have “set up\nSchooles of Learning, as they call them; and educated youth up in that\ndarkness, and kept them studying and divining in their brains, till\nmany have studied themselves out of their Wits” (Fell 1667b,\n38–39). She encourages suspicion toward human religious authority and\nurges readers to question their ministers. “Try your\nTeachers,” she says, and do not “bow to mens wills and\nworships contrary to the command of Christ Jesus” (Fell\n1655, 1; 1660b, 3). If ministers are not in the light, then they do not\nspeak the word of God. Hence, no matter how well-educated or elevated\nin rank our ministers might be, we must not take their word on trust.\n“Fear ye not the reproaches of men,” she says,\n“neither be ye afraid of their revilings” (Fell 1668, 6).\nOn the whole, it is always better for the individual to offend other\nhuman beings rather than God himself.\n\n\nFell maintains that most university-educated interpreters of\nscripture invariably lead others away from God to their own inventions\nand imaginations. She says that\n\n\n\nThe first thing that I except against in matter and form of their\nWorship: Viz. All sorts of Preachers and Teachers that are out\nof Christ and his Apostles Spirit, Doctrine and Rule, is the taking a\npart or portion of Scripture for a Text, and adding to thereto their\nown Inventions, which they study out of their own brain, and also\nbringing other Authors, who have done the like, many of them not\nChristians but Heathens. (Fell 1667b, 21)\n\n\n\nThis anti-learning bent distances Fell from later religious\nfeminists, such as Mary Astell, who called for the higher education of\nwomen in her Serious Proposal to the Ladies (1694). For\nAstell, women can attain wisdom and virtue only if they are taught to\nimprove their natural reasoning skills through the study of religion\nand philosophy. In her plea for a female academy, she cites the works\nof René Descartes, Antoine Arnauld, Pierre Nicole, and Henry\nMore, as exemplary philosophical-theological texts. For Fell, however,\nreligious worship is about the individual directing herself to the\nlight and keeping to it; it does not consist in a dependence or\nreliance upon others’ words and meanings. Such worship can be\nperformed by anyone, anywhere, at any time.\n2.3 Liberty of conscience\n\n\nIn some of her writings, Fell provides religio-political defences of\nliberty of conscience (freedom of religious belief and worship) for\nQuakers. In a direct appeal to Charles II, Fell calls upon the king\n\n\n\nto a Consideration, according to Reason, Righteousness, and Equity,\nconcerning us, as a People, to maintain our just Liberties and Rights,\nas he is engaged by Promise, to defend us from Wrongs, Injuries, and\nViolence, done to us by Military and Merciless Men. (Fell 1710, 28)\n\n\n\nBy “liberty” here Fell means freedom from coercion and\npersecution for one’s religious beliefs and practices. She\nlaments “That the State should pretend Love to the Truth, and yet\nsuffer such things to be of Force, that all Bloody Persecutors may have\ntheir Wills, so far as the Lord gives them Power, upon those that live\nin the Truth” (Fell 1710, 43). Using gender-inclusive language,\nshe calls on the authorities to respect the rights of “free-born\nEnglish men and women” (Fell 1664, 1). Unlike her fellow\nQuaker William Penn (who anticipates the tolerationist views of John\nLocke), Fell does not offer detailed arguments for liberty of\nconscience based on pragmatic, political, or epistemological\nprinciples. She does point out, however, that “to use Violence\nand Cruelty, is absolutely contrary to the Doctrine and Command of\nChrist” (Fell 1667b, 45). She calls upon the political\nauthorities to exemplify the Christian virtues in their treatment of\nreligious dissenters.\n3. Quaker feminism\n\n\nAs we have seen, Quaker preaching is not preaching in the\ntraditional sense of exhortation on scripture: “For it was not\nChrist nor the Apostles Practice to take others\nRecords & Writings that had been spoken from others,”\nFell says, “but they spoke as the spirit gave them\nutterance” (Fell 1660f, 4). In Fell’s view, women can\njustifiably preach because true preaching does not require the\ntraditional book-learning of men, it requires only the light of Christ\nwithin. In their arguments, Fell and other Quaker authors repeatedly\ninvoke biblical quotations in support of the spiritual authority of\nwomen, such as the claims that “there is neither male nor female:\nfor ye are all one in Christ Jesus” (Galatians 3:28), and that\n“it shall come to pass in the last days, saith God, I will pour\nout of my Spirit upon all flesh: and your sons and your daughters shall\nprophesy” (Acts 2:17, quoting Joel 2:28). For many Quakers, the\nrise of the female preacher, like the conversion of the Jews, would be\na realization of millennial expectations about Christ’s second\ncoming. In arguing thus, they were challenging widespread opposition to\nwomen’s preaching at the time.\n3.1 Arguments against women’s preaching\n\n\nCritics of women’s preaching typically appealed to the natural\ninferiority of the female sex, the biblical tale of Eve’s\ntransgression, and Pauline injunctions against women speaking in\nchurch. In the anonymous A Spirit moving in the Women\nPreachers (1646), the author asserts that women preachers\ntransgress not only the rules of nature but also of modesty, divinity,\ndiscretion, and civility. On these grounds, the author concludes that\nwomen preachers cannot possibly be moved by the spirit of God but must\npartake in the spirit of darkness, ignorance, and gross error. To\nsupport his point, the author notes that the Serpent approached Eve\nfirst, because he knew that women were “the silly and weaker\nSex” and “naturally apt unto all mischiefe”\n(Anonymous 1646, 2). In his Antichrist in Man (1655), Joshuah\nMiller explicitly takes issue with the Quaker practice of permitting\nwomen to speak in church by citing two New Testament passages that\nseemingly forbid women’s spiritual leadership: 1 Corinthians\n14:34, “Let your women keep silence in the churches: for it is\nnot permitted unto them to speak”, and 1 Timothy 2:11–12,\n“Let the woman learn in silence with all subjection. But I suffer\nnot a woman to teach, nor to usurp authority over the man, but to be in\nsilence”. He asks:\n\n\n\nWhat monstrous Doctrine is this? to suffer Women to be Preachers by\nway of authority, condemned as against nature Isaiah 3.12. I\nCor. 14. 34, 35. 1 Tim. 2. 12. 14. This opinion was\nfirst held by the Pepuzians, that women might Preach, because they\nwickedly affirmed Christ assumed the form of a woman, and not of a man.\nIn France, they allow not a woman to bee a ruler over the\naffairs of mens goods: But with us some women will be rulers over, and\ndirecters of mens consciences; for so amongst the Quakers, women\ncommonly teach as well as men. (Miller 1655, 27)\n\n\n\nMiller’s reference to the “monstrous Doctrine” of\nwomen preachers calls to mind the arguments of Protestant reformer John\nKnox (c. 1514–1572) a generation before. In his 1558 work, The\nFirst Blast of the Trumpet Against the Monstrous Regiment of\nWomen, Knox urges his readers to rebel against female authority.\nHe points out that it is repugnant to nature that the weak shall lead\nthe strong, or that the foolish and mad shall govern the “sober\nof mind” (Knox 1558, 9). Nature informs us that women are\nphysically frail, mentally feeble, and generally lacking in the\nnecessary leadership virtues. Knox supports this view with reference to\nscriptural claims that it is a virtue for women to be submissive and\nsubject to men. As part of the legacy of Eve’s transgression, he\npoints out, the Bible states that man shall be lord and governor over\nwoman (Genesis 3:16). He also observes that the apostle Paul (again, in\nTimothy and Corinthians) deprives women of “all power and\nauthoritie, to speake, to reason, to interprete, or to teache, but\nprincipallie to rule or to judge in the assemblie of men” (Knox\n1558, 16).\n3.2 Precursors to Womens Speaking Justified\n\n\nThere are several early Quaker texts that challenge these nature and\nscripture-based arguments against women’s spiritual authority. In\ndoing so, the authors continue a tradition that began in the fifteenth\ncentury with the querelle des femmes, an ongoing debate about\nthe moral and intellectual status of women in continental Europe (cf.\nKelly 1984, 68). In this debate, defenders of women protest against the\ncontempt and defamation of women in the works of their male-biased\npeers. To support their cause, they repeatedly cite scriptural\narguments for women’s spiritual equality with men and put forward\nlong lists of female worthies. The Quakers partake in this tradition by\nexplicitly addressing the subject of women’s natural or\ndivinely-ordained subordination to men, as well as those problematic\nbiblical passages about Eve’s transgression and women\n“learning in silence”.\n\n\nIn one of the earliest defences, A Woman Forbidden to Speak\n(1654), Richard Farnworth sidesteps common criticisms of women’s\npreaching by pointing out that natural women are not permitted to speak\nat prayer meetings, for “nothing must speak in the Church in God\nbut the Holy Ghost” (Farnworth 1654, 3). If the spirit of God is\nmanifest in a woman, however, then that woman ought to be permitted to\nspeak—because she speaks with spiritual rather than carnal\nwisdom. As precedents, he cites the examples of Deborah in the book of\nJudges, the prophesying daughters of Philip, the woman named Phebe who\nwas commended to be “a Servant or Minister to the Church”\n(7), and other women who labored with Christ in the Gospel. Far from\nbeing forbidden to speak, these women were received into the church and\n“saluted with an holy kiss in the Lord” (7).\n\n\nIn The Woman Learning in Silence (1656), George Fox\nlikewise challenges those who would limit the spirit of God to\n“learned men, old books, and authors” (Fox 1656, 4). He\ngoes further than Farnworth by arguing that those who prevent women\nfrom speaking in church stop Christ himself from speaking. To\nsubstantiate his point, he provides a list of exemplary females from\nthe Bible, including the daughters of Philip, Hannah (or Anna) the\nProphetess, Priscilla “an instructer”, Phebe, Mary\nMagdalene, and other “women-labourers in the Gospel”. These\nhistorical women provide proof that the light of Christ is the same in\nthe male and the female—to suggest otherwise is to defy scripture\nand to place limits on the divine power. And “Who is it that dare\nlimit the holy One of Israel?” and “who is it that dares\nstop Christs mouth? that now is come to reign in his sons &\ndaughters” (5).\n\n\nIn To the Priests and People of England (1655), the Quaker\nwomen Priscilla Cotton and Mary Cole also argue in favor of the\nspiritual equality of men and women. In this work, written during a\nperiod of imprisonment in Exeter gaol, Cotton and Cole explicitly\naddress the Pauline injunctions to “Let your women keep silence\nin the churches” and “Let the woman learn in silence with\nall subjection”. They reinterpret these texts to make them\nconsistent with other passages that imply that it is\npermissible for women to speak or prophesy. Cotton and Cole say\n\n\nthou tellest the people, Women must not speak in the Church, whereas\nit is not spoke onely of a Female, for we are all one both male and\nfemale in Christ Jesus, but it’s weakness that is the woman by\nthe Scriptures forbidden, for else thou puttest the Scriptures at a\ndifference in themselves … for the Scriptures do say, that all\nthe Church may prophesie one by one, and that women were in the Church,\nas well as men, do thou judge; and the Scripture saith, that a woman\nmay not prophesie with her head uncovered, lest she dishonour her head\n(Cotton & Cole 1655,6–7).\n\n\n\nTheir point is that the Bible endorses a woman’s capacity for\nequal spiritual authority and her entitlement to speak in church and to\nprophesy. In light of these endorsements, they say, a different\ninterpretation must be given to those injunctions that suggest women\nmust not speak. Instead we must interpret “woman” to mean\n“weakness”, and accept that womanliness can be a property\nof both males and females. As an example, they highlight 1 Corinthians\n11:4–5, the warning that “Every man praying or prophesying,\nhaving his head covered, dishonoureth his head. But every\nwoman that prayeth or prophesieth with her head uncovered,\ndishonoureth her head”. According to Cotton and Cole, this\npassage might be re-interpreted in a positive light. Both males and\nfemales may speak in church, but if they speak then they “must be\ncovered with the covering of the Spirit”—they must be in\nthe light, as it were. If they are not in the light, then they speak as\n“women” regardless of their actual gender: they speak, that\nis, with a lack of authority or with carnal weakness rather than\nspiritual strength.\n\n\nSimilar arguments can be found in Sarah Blackborow’s Just\nand Equall Ballance Discovered (1660), Fox’s Concerning\nSons and Daughters (1661), Dorothy White’s A Call from\nGod out of Egypt (1662), Katherine Evans’ A\nBrief Discovery of God’s Eternal Truth (1663), and\nFell’s own work, A Call to the Universal Seed.\n3.3 Arguments of Womens Speaking Justified\n\n\nIn light of these earlier defences, Fell’s Womens Speaking\nJustified appears to be rather unoriginal in terms of content. But Trevett\nclaims that “it is special in the thoroughness of that appeal to\nBiblical precedent, in its sometimes cautious, but often spirited, case\nfor women, in its criticism of Church and clergy, and in its\noptimism” (Trevett 1991, 54). In this work—first published\nin 1666, and then with a new postscript in 1667—Fell brings\ntogether many of the different argumentative strategies used in the\naforementioned Quaker texts. She reinterprets key scriptural passages,\nshe provides numerous examples of biblical women speakers, she draws\nout the egalitarian implications of the doctrine of the light, and she\nappeals to anti-clerical and anti-authoritarian Quaker principles. In\nshort, she presents one of the “most comprehensively\nargued” Quaker defences of female preaching in her time (Trevett\n1991, 54). There is also evidence that Fell first formulated her arguments as early as 1652, prior to other Quaker defences of women (cf. Bruyneel 2010, 148; Donawerth and Lush 2018, 48).\n3.3.1 Spiritual equality\n\n\nFell’s primary concern is to establish “how God himself\nhath manifested his Will and Mind concerning women, and unto\nwomen” (Fell 1667c, 3). Toward this end, she examines significant\npassages about women in both the Old and New Testaments. In the\nbeginning (in Genesis 1:27), she notes, God joined male and female\ntogether in his own image and made no distinction between the sexes: he\n“put no such difference between Male and Female as men would\nmake” (Fell 1667c, 3). Following the fall, this spiritual\nequality between the sexes was compromised. The Serpent approached Eve,\ndiscerning that she was “more inclinable” to listen to him;\nand then, together with Adam, she was “tempted into the\ntransgression and disobedience” (3, 4). But when Eve tells God\nthe truth about the temptation and confesses her sin, God passes\nsentence on the Serpent: “I will put enmity between thee and the\nWoman,” he says, “and between thy Seed and her Seed”\n(4). In Fell’s view, these words (from Genesis 3:15) foretell the\nspecial role that women would play in the restoration of humankind. The\n“Seed of the Woman” refers to Christ himself, who is the\nSon of God “made of a woman”, the Virgin Mary (4).\nThose who prevent the Seed (or the inner light) of the Woman from\nspeaking, Fell says, prevent the message of Christ:\n\n\nThose that speak against the Power of the Lord, and the Spirit of\nthe Lord speaking in a woman, simply, by reason of her Sex, or because\nshe is a Woman, not regarding the Seed, and Spirit, and Power that\nspeaks in her; such speak against Christ, and his Church, and are of\nthe Seed of the Serpent, wherein lodgeth enmity. (5)\n\n\n\nIn Fell’s view, the coming of Christ returns the spiritual\nstanding of men and women to that of “the first Creation”.\nOnce again, the sexes are on an equal footing because they each have\nthe spirit or the light of Christ manifest within them: his\n“Spirit is poured upon all flesh, both Sons and Daughters”\n(12). Following the redemption, the “Lord hath manifested himself\nand his Power, without respect of Persons” (12), and\n“Christ in the Male and in the Female is one” (13).\n\n\nFell thus severely criticizes those men or “blind\nPriests” who “pervert the Apostles Words, and corrupt his\nintent” by “contemning and despising” women in order\nto prevent them from speaking in church (10, 14). To prevent a woman\nfrom speaking is to limit the power of Christ “whose Power and\nSpirit is infinite, that is pouring it upon all flesh” (12). She\nsees the priests’ tendency as part of a larger tendency of\n“the spirit of Darkness” (i.e. the state-sanctioned church)\nto prevent both Quaker men and women from spreading the message of God.\nFell foretells of a new age dawning “which brings freedom and\nliberty” (11), and in which all those who are in the spirit of\nthe Lord (men as well as women) can speak freely, without prejudice and\npersecution. In this sense, her book is (implicitly, at least) a\ncontinuation of her fight for liberty of conscience and the rights of\n“free-born English men and women” in her other\nworks (Fell 1664, 1; cf. also Skwire 2015).\n3.3.2 Biblical exempla\n\n\nTo validate her claims, Fell appeals to biblical examples of good\nand wise women, such as the woman of Samaria, Martha and Mary (the\nsisters of Lazarus), and the woman who poured precious ointment on\nChrist’s head, as well as Priscilla, Deborah, Huldah, Sarah, Anna\nthe Prophetess, Miriam, Elizabeth, Mary, Ruth, Rachel, Leah, the Queen\nof Sheba, Esther (or Hester), Judith, the wise woman of Abel, and the\ndaughters of Philip. These women provide historical proof that God gave\nhis spirit to women as well as men. But Fell singles out Mary\nMagdalene, Joanna, and Mary (mother of James)—the women who first\ndelivered the news of Christ’s resurrection to the\napostles—for special mention. If these women had not exhibited\nthe virtues of love and loyalty to Christ, Fell says, then “what\nhad become of the Redemption of the whole body of Mankind?” (Fell\n1667c, 7). In essence, she offers a pragmatic argument for permitting\nwomen to speak in church. If the apostles had not listened to women,\nthen the restitution of humanity would never have come about. Women\nclearly have a special providential role to play in spreading the word\nof the Lord. If ministers do not permit women to speak in church, then\nterrible consequences might follow.\n3.3.3 Scriptural exegesis\n\n\nIn light of Fell’s points about women’s spiritual\nequality with men and their special role in redemptive history, she\nadvises her readers to re-interpret or re-contextualize those common\ninjunctions against women’s speaking in the Bible. She begins\nwith 1 Corinthians 14:34, “Let your women keep silence in the\nchurches”. In a passage preceding this statement, Fell points\nout, “the Man is commanded to keep silence as well as the woman,\nwhen they are in confusion and out of order” (8). The\napostle’s words apply only to those women who are in\n“strife, confusion and malice in their speaking”\n(9)—those women who were “under the Law, and in that\nTransgression as Eve was” (8). But his words do not\napply to those women who have the “Everlasting Gospel to preach,\nand upon whom the Promise of the Lord is fulfilled”\n(9)—they do not apply to those who have turned to the light.\n\n\nIn “A further Addition” to the main text, Fell extends\nher analysis to 1 Timothy 2:11, “Let Women learn in silence, with\nall subjection”. Her argument proceeds by way of simple modus\ntollens. If this injunction applied to all women, she says, then\nno woman would be permitted to speak. But the apostle does\npermit women to speak—he explicitly mentions the four virgin\ndaughters of Philip (Acts 21:9), who were respected as prophets.\n“And was it not prophesied in Joel 2. that Hand\nmaids should Propesie [sic]? And are not Hand-maids\nwomen?” (14). Therefore, some women must be permitted to speak.\nTo explain the apostle’s command to silence, Fell suggests that\n“here you ought to make a distinction what sort of Women are\nforbidden to speak” (13). The reader ought to distinguish between\nthose women who are mere “busie-bodies, and\ntatlers” (13) and those women who have the spirit of the\nLord. We might also consider the idea that a woman’s\n“husband” in this passage is in fact Christ himself, and\nthat if a woman learns from this Husband, then she ought to be\npermitted to speak (17).\n\n\nIn a “Postscript” to the 1667 edition, Fell once again\naddresses those “dark Priests” who are “so mad\nagainst Womens Speaking” (18). She refers to the example of\nDeborah (Judges 5), a woman leader who sung and praised God in\n“glorious triumphing expressions” (18). Fell points out the\nhypocrisy of those priests who forbid women to preach and yet include\nthe words of Deborah in their sermons. She scorns those who “make\na Trade of Womens words to get money by, and take Texts, and Preach\nSermons upon Womens words; and still cry out, Women must not speak,\nWomen must be Silent” (16). These priests are being blatantly\ncontradictory: they allow that women can speak the word of God, and yet\nthey deny that women can speak the word of God.\n\n\nAt this point, it might also be noted that Fell’s works were\noften intended to be read aloud, and so we must be aware of a certain\nperformative aspect to Womens Speaking. The author’s\nargument achieves its greatest force when it is spoken or performed.\nThis is because the very act of saying the words establishes the\nconclusion of Fell’s argument—the idea that women are\ncapable of speaking the word of the Lord. The onus then falls on her\ncritics to point out where she speaks in ignorance. But given that she\nrepeats the same scriptural passages that they themselves use (her\narguments rely on premises they would accept), then there would appear\nto be little comeback.\n4. Other Quaker defences of women’s preaching\n\n\nFell’s arguments are echoed in the works of later Quaker\nwomen. In 1683, Elizabeth Bathurst published The Sayings of\nWomen (1683), the only other seventeenth-century tract after\nFell’s to be “exclusively devoted to the vindication of\nwomen’s speaking” (Apetrei 2010, 174). Like Womens\nSpeaking, this work is more than just a collection of quotations\nfrom the Bible: it is intended to show that, following Christ’s\nrestitution of humanity, women once again share a spiritual equality\nwith men. In the “Postscript” to this work, Bathurst\ncontrasts the state of women after the fall with the state of women\nfollowing Christ’s redemption. She points out that “As\nby Woman came in the Transgression and Degeneration; So by\nWoman also came the Reconciliation and Restoration, to wit,\nChrist, who came of the Woman’s Seed” (Bathurst\n1683, 24). Like Fell, Bathurst highlights the fact that women play a\nspecial role in redemptive history and, with the coming of Christ,\n“Male and Female are made all one” (24).\n\n\nOther Quaker women who assert the spiritual equality of men and\nwomen include Anne Docwra in her Epistle of Love (1683),\nDorcas Dole in Once more a Warning (1683), and an anonymous\nauthor in “A Seventeenth-Century Quaker Women’s\nDeclaration” (c. 1675–80), a piece that may have been\nthe work of Fell’s daughter, Sarah (Speizman & Kronick,\n1975).\n5. Criticisms of Quaker defences of women\n\n\nModern critics identify several problems with describing Quaker\ndefences of women as “feminist”. They point to the fact\nthat, despite their affirmations of spiritual equality, the Quakers\nstill uphold a negative conception of sexual difference, they suggest\nthat women preachers must typically transcend or efface their female\nsexuality, and they do not call for wider socio-political changes for\nwomen.\n5.1 Denigration of natural women\n\n\nIn some Quaker texts, “woman” or\n“womanliness” is redefined to mean weakness and carnal\nwisdom by contrast with strength and spiritual wisdom. In To The\nPriests and People, Cotton and Cole identify womanliness with\nweakness, vanity, shame, and dishonor. They insult the priests who\nvisit them in prison by saying that “you your selves are the\nwomen, that are forbidden to speak in the Church” (Cotton\n& Cole 1655, 7–8). In response, Gill (2005) notes that\n\n\nthere is a problem with accusing enemies with possessing\n‘feminine’ weakness. Such an argument retains categories of\ngender difference, thereby assigning them continued significance.\nMasculine characteristics remain preferable to those associated with\nwomen. (52; cf. also Trevett 1991, 50).\n\n\n\nIn short, these Quaker writers continue to perpetuate a male-biased\ntradition in Western religion according to which femaleness is\nsymbolically coded as inferior, imperfect, and “less\ndivine” than maleness (cf. Tuana 1993). They implicitly accept\nthe prejudices of their misogynist critics, such as Joshuah Miller and\nJohn Knox, who maintain that women are physically weak and mentally\nfeeble by nature.\n\n\nAnother, closely related, problem is that in some Quaker texts\nnatural women themselves are not permitted to preach the word of the\nLord. Smith (1982) points out that “Women functioned as the\nvessels for Christ’s teaching, not as speakers for\nthemselves” (70). Women are permitted to speak only insofar as\nthey are instruments or bearers of the light. According to Gill, the\nQuaker women “seem to be attempting to divorce spirituality from\nphysicality, claiming the message should be attended to rather than the\nperson delivering it” (Gill 2005, 42). But this separation\nbetween the spiritual and the physical is problematic. Spiritually\nspeaking, the body of the female preacher is simply irrelevant to the\ndelivery of the message; while physically speaking, the female preacher\nstill represents all that which is despicable and unworthy of God. In\nsum, it would appear that the early Quaker defenders of women’s\npreaching either ignore or denigrate a woman’s sexed body.\n5.2 Limitations to egalitarianism\n\n\nOther critics (Smith 1982; Broad & Green 2009) point out\nthat the Quakers’ egalitarian approach to female ministry is\nbuilt upon a purely religious conception of what makes all human beings\nequal. The problem is that this spiritual equality does not\nautomatically translate into political equality for women in a more\ngeneral sense. Smith (1982) notes that Fell’s defence of\nwomen’s speaking did not “include a questioning of other\naspects of sexual hierarchy” (96). In response to 1 Timothy\n2:11–12 (“I suffer not a woman to teach, nor to usurp authority\nover the man”), Fell writes that\n\n\nHere the Apostle speaks particularly to a Woman in Relation to her\nHusband, to be in subjection to him, and not to teach, nor usurp\nauthority over him, and therefore he mentions Adam and\nEve: But let it be strained to the utmost, as the opposers of\nWomens Speaking would have it, that is, That they should not preach nor\nspeak in the Church, of which there is nothing here. (Fell 1667, 9)\n\n\n\nHere Fell implicitly accepts the husband’s authority over the\nwife’s within marriage. Her stand on women’s preaching is\nnot meant to challenge hierarchical relations within the marital\ninstitution, it challenges only women’s subordinate position in\nthe church. Smith sees this as a pattern in sectarian women’s\ntexts of the seventeenth-century:\n\n\n\nMost female religious writers simply ignored political or feminist\ntopics. Even Margaret Fell Fox, one of the most forceful supporters of\nwomen’s being able to speak in Quaker meetings, argued in\nWomen’s Speaking Justified … that they should\nnever speak in a way that would usurp authority over men. For the large\nmajority of women writing religious tracts during the seventeenth\ncentury, the question of women’s rights simply never arose.\n(Smith 1982, 70)\n\n\n\nAlong the same lines, Broad and Green (2009, 172–79) point out that\nthere is no necessary inference from the Quaker theory of spiritual\nequality to the view that women as well as men ought to have equal\naccess to social goods, such as education. The Quakers’ arguments\ndo not logically lead to equal education for women, because women do\nnot require an education in order to attain salvation or to be in the\nspirit of the Lord. Their arguments do not logically lead to equal\nemployment opportunities or full political participation for women\neither, because it is only necessary that women be active and employed\nin religious matters. In short, the Quaker theory of sexual equality\ndoes not amount to a fully articulated feminist theory of political\nequality.\n5.3 Response to criticisms\n\n\nNevertheless, the charge of denigrating the female sex cannot be\nlevelled at Margaret Fell herself. Feroli (2006, 149–50) highlights the\nfact that Fell’s arguments in favour of women’s preaching\ndo not efface the significance of the female body. In Womens\nSpeaking Justified, Fell supports her case for female spiritual\nauthority by appealing to the Virgin Mary’s vital role in\nsalvation history. By virtue of her maternal power, Fell emphasizes,\nMary gave birth to the “Seed of the Woman”: “the holy\nGhost came upon her, and the holy thing that was born of her, was\ncalled the Son of God”, and Christ was “made\nof a woman” (Fell 1667c, 12, 4). Here Fell upholds a\npositive conception of sexual difference, according to which the female\nbody is integral (rather than irrelevant) to the bringing of\nChrist’s message. In addition, Fell also valorizes the women who\nspread the message of Christ’s resurrection. These women exhibit\nadmirable character traits or virtues, such as love and\nloyalty to Christ: their hearts were “united and knit unto him in\nlove”, and they “could not depart as the men did, but sat\nwatching and waiting, and weeping about the Sepulchre” (7). The\nwoman who pours ointment on Christ’s head also demonstrates that\nshe “knew more of the secret Power and Wisdom of God, then his\nDisciples did” (5). In such instances, women are not required to\ntranscend or efface their natural womanhood in order to be admirable,\nand they are not mere vessels for the message of Christ—they have\ntheir virtues regardless, as natural women. Hence Feroli says that\nFell’s text “not only affirms the theological point that\nwomen may speak in the church but also attempts to change general\nperceptions of women’s abilities” (Feroli 2006, 151). Her\ntext challenges negative stereotypes of women as mentally and morally\ninferior to men.\n\n\nMore generally, it might be noted that when the Quakers defend a\nwoman’s right to speak with religious authority, they are also\n(implicitly, at least) defending a natural woman’s ability to\nchoose freely to live in the light. In her millenarian “calls to\nthe Jews”, For Manasseth Ben Israel and A Loving\nSalutation, Fell emphasizes that while the spirit of the Lord\nmight be divinely implanted, turning to the light requires a certain\ncapacity for discernment, a firm resolution of will, and a natural\nbravery and courage on the part of the individual. First,\n“hearkening diligently” to the inner light requires the\nsubject actively to discern what is necessary for her salvation. An\nindividual must be capable of understanding or recognising what is her\ntrue good, such as “Eternall peace” (Fell 1656c, 5) or the\ndivine “Inheritance” (Fell 1656a, 8). Second, hearkening\nrequires that the subject show due attention to the voice of the Lord\nwithin, by an exercise of free will: the individual must will herself\nto “turn” her eyes or “incline” her ears (Fell\n1656a, 3). And third, hearkening requires strength of moral\ncharacter—not only because the light reproaches the individual\nwith her own sin, but because turning to the light may require\ncontradicting one’s spiritual teachers.  The light\n“lets you see the thoughts of your hearts, that they are vaine,\nwhich light lets you see when you doe amisse, when you tell a lye, when\nyou doe wrong to any man” (Fell 1656a, 2). This knowledge will\n“rip you up and lay you open … and make all the deceit of\nyour heart appear” (Fell 1656c, 7). The individual must be brave\nand steadfast to face up to such sinfulness. She must also reflect\ncritically on what she may have been taught to believe by family and\nfriends, especially those conventions concerning outward worship and\noutward appearances. In short, by affirming that women preachers can be\nin the light, Fell implicitly affirms that natural women are capable of\nasserting their intellect and will in order to attain salvation, even\nif that means defying their fathers, husbands, or other male spiritual\nguides.\n6. Conclusion: Fell’s place in history of feminism\n\n\nIn this last respect, Fell and her fellow Quakers anticipate the\nideas and arguments of later seventeenth-century feminists, such as\nMary Astell and Damaris Masham. These later women build on the basic\nProtestant insight that a woman’s salvation depends upon herself\nalone and her own independent capacity for reflection on her beliefs.\nThey call on women to avoid blind obedience to human religious\nauthority and they assert a woman’s capacity to discern moral and\nreligious truths for herself. But their arguments are also based on an\negalitarian concept of reason—or the idea that men and women have\nthe same natural capacity for rational judgment—and not the idea\nthat women are spiritually equal to men by virtue of a supernatural\nlight. It is reason, according to Astell and Masham, that is the\n“Candle of the Lord” in all human beings. They therefore\nemphasize that in order to attain everlasting happiness through virtue,\nwomen must be properly educated in order to improve their rational\nfaculties. In later centuries, these part-secular, part-religious ideas\nabout reason and education would evolve into calls for social and\npolitical equality for women.\n\n\nMargaret Fell is not an advocate of an egalitarian concept of reason\nor a supporter of equal educational opportunities for women. Her\narguments in favour of female preaching rest on a principle of\nspiritual equality, or the idea that both men and women have the\nsupernatural light of Christ within them. But for Fell, the ability to\nhearken to that light implicitly requires that women possess a natural\ncapacity to discern the truth for themselves, to exercise strength of\nwill, and to exhibit moral virtue or excellence of character. In these\nrespects, Fell’s arguments for female preaching contain an\nimplicit feminist challenge to negative perceptions about women’s\nmoral and intellectual abilities in her time. On these grounds, we\nmight conclude that her writings constitute something of a bridge\nbetween the querelle des femmes of the late-medieval period\nand the later feminist arguments of figures such as Astell and\nMasham.\n",
    "bibliography": {
        "categories": [
            "Works by Fell",
            "Other Primary literature",
            "Secondary literature"
        ],
        "cat_ref_text": {
            "Works by Fell": [
                "</h3>\n<ul class=\"hanging\">",
                "1655, <em>False\nProphets, Anticrists, Deceivers, Which are in the World, which John\nProphesied of, which hath been long hid and Covered. But now is\nunmasked in these last dayes with the Eternal Light which is risen\n… By M. Fell</em>, London: Giles Calvert.",
                "1656a, <em>A Loving\nSalutation to The seed of Abraham among the Jewes: where ever they are\nscattered up and down upon the face of the earth</em>, London: Thomas\nSimmons.",
                "1656b, <em>A\nTestimonie of the Touchstone, for all Professions, and all Forms, and\nGathered Churches (as they call them) of what sort soever to try their\nground and foundation by. And a Tryal by the Scriptures, who the False\nProphets are, which are in the world, which John said should be in the\nlast times by Margret Fell. Also, some of the Ranters Principles\nAnswered</em>, London: Thomas Simmons.",
                "1656c, <em>For\nManasseth Ben Israel. The Call of the Jewes out of Babylon. Which is\ngood tidings to the Meek, Liberty to the Captives, and for the opening\nof the Prison Doores</em>, London: Giles Calvert.",
                "1659a, <em>To the\nGeneral Councel, and Officers of the English Army, And to every Member\nin particular</em>, London: Thomas Simmons.",
                "1659b, <em>To the\nGeneral Council of Officers. The Representation of divers Citizens of\nLondon, and others Well-affected to the Peace and Tranquility of the\nCommonwealth</em>, London: John Clowes.",
                "1659, (with G. Fox),\n<em>A Paper concerning such as are made Ministers by the will of man;\nand an exhortation to all sober minded people to come out from among\nthem</em>, London: M.W.",
                "1660a, <em>The\nCitie of London Reproved For its Abominations, which doth concern all\nthe Inhabitants thereof that are guilty</em>, London: Robert\nWilson.",
                "1660b, <em>A\nDeclaration and an Information From us the People of God called\nQuakers, To the present Governors, the King and Both Houses of\nParliament, and All whom it may Concern. This was Delivered into the\nKings hand, the 22 day of the Fourth Moneth by M.F.</em>, London:\nThomas Simmons and Robert Wilson.",
                "1660c, <em>An\nEvident Demonstration to Gods Elect, Which clearly manifesteth to them,\nI. How necessary and expedient it is for them to come to witnesse true\nfaith. II. That after they have attained to the faith, it must be tried\nas gold is tried in the fire. III. It shews how many have departed from\nthe faith and denied it. IV. That the standing of the Saints is by\nfaith in the Son of God. V. How strong Abraham was in the faith, and\nhow all that believe are to look unto him. By Margret Fell</em>,\nLondon: Thomas Simmons.",
                "1660d, <em>This is\nto the Clergy Who are the Men that goes about to settle Religion (As\nthey say) according to the Church of England. Whether they be Bishops\nor Presbyters, or what Name soever they may go under</em>, London:\nRobert Wilson.",
                "1660e, <em>This was\ngiven to Major Generall Harrison and the rest. Read this in the Fear of\nthe Lord, and in the moderation of Your spirits, without\nprejudice</em>, London: Thomas Simmons.",
                "1660f, <em>A True\nTestimony From the People of God: (Who by the world are called Quakers)\nof the Doctrines of the Prophets, Christ, and the Apostles; which is\nwitnessed unto, by them who are now raised up by the same Power, and\nquickned by the same Spirit and Blood of the Everlasting Covenant,\nwhich brought again our Lord Jesus from the dead</em>, London: Robert\nWilson.",
                "1664, <em>To the\nMagistrates and People of England where this may come</em>, London:\nn.p.",
                "1664, (with G. Fox),\n<em>The Examination and Tryall of Margaret Fell and George Fox (at the\nseverall Assizes held at Lancaster the 14<sup>th</sup> and\n16<sup>th</sup> days of the First Moneth 1663. And the 29<sup>th</sup>\nof the 6<sup>th</sup> Moneth 1664.) For their Obedience to Christs\nCommand who saith, Swear not at all. Also Something in Answear to\nBishop Lancelot Andrews Sermon Concerning Swearing</em>, London:\nn.p.",
                "1664, (with J. Parke), <em>Two General Epistles To the\nFlock of God, where-ever they are dispersed on the Face of the Earth;\nwho are gathered and separated from the World, and its Wayes and\nWorships, to bear Testimony for the Lord God against the Deceit and\nDeceivableness which the Worships of the World have lain in, in the\ndark Night of Apostacy … written by M.F. and J.P.</em>, London:\nn.p.",
                "1665a, <em>A Call\nto the Universall Seed of God, Throughout the whole World, to Come up\nto the Place of Publick Worship, which Christ Jesus the great Prophet\nhath set up, who took not upon Him the nature of Angels, but the seed\nof Abraham, whereby he comes to raise up Adams House and fallen State,\ninto an Estate that shall never fall</em>, London: n.p.",
                "1665b, “John\nWigan, this in Answer to part of thy Appendix,” in Thomas Curwen,\net al., <em>This is An Answer to John Wiggans Book, Spread up and down\nin Lancashire, Cheshire, and Wales, who is a Baptist &amp; a\nMonarchy-man</em>, London: n.p., pp. 86-122.",
                "1666, <em>A\nLetter Sent to the King From M. F. Here is also thereunto Annexed a\nPaper written unto the Magistrates in 1664, which was then Printed, and\nshould have been dispersed, but was prevented by wicked hands</em>,\nLondon: n.p.",
                "1667a, <em>The\nStandard of the Lord Revealed. By which He hath led and guided and\npreserved his people since Adam to this day, as is manifested through\nthe Scriptures, and is shewed forth in this following Abstract….\nGiven forth at Lancaster Castle 11 month 1665/6. By M.F. a Prisoner of\nthe Lord</em>, London?: n.p.",
                "1667b, <em>A\nTouch-Stone, or, A Perfect Tryal by the Scriptures, of all the Priests,\nBishops, and Ministers, who have called themselves, the Ministers of\nthe Gospel … unto which is annexed Womens speaking justified\netc</em>, London: n.p.",
                "1667c, <em>Womens\nSpeaking Justified, Proved and Allowed of by the Scriptures. All such\nas speak by the Spirit and Power of the Lord Jesus. And how Women were\nthe first that preached the Tidings of the Resurrection of Jesus, and\nwere sent by Christ’s Own Command, before He ascended to the\nFather, John 20.17</em>, second edition, London: n.p.",
                "1668, <em>A Call\nunto the Seed of Israel, That They may come out of Egypts Darkness, and\nHouse of Bondage, unto the Land of Rest. Also The Righteous Law of God\nJustified. With an Epistle to all those, whose desires are after the\nTruth as it is in Jesus where ever they are Scattered. Also Twenty five\nQueries to all the Worlds Priests and People that say, the Light of\nChrist is Natural, By M.F.</em>, London: Robert Wilson.",
                "1671, “A few\nLines concerning Josiah Coale,” in <em>The Books And Divers\nEpistles Of the Faithful Servant of the Lord Josiah Coale; Collected\nand Published, as it was desired by him the Day of his departure out of\nthis Life</em>, London: n.p., pp. 25–26.",
                "1677, <em>The\nDaughter of Sion Awakened, And putting on Strength: She is Arising and\nshaking her self out of the Dust, and putting on her Beautiful\nGarments, M.F.</em>, London: n.p.",
                "1679,\n“Friend, Whosoever thou art,” in S. Crisp, <em>An Epistle\nto Friends Concerning the Present and Succeeding Times</em>, third\nedition, London: n.p., pp. 3–6.",
                "1690,\n“Margaret Fox’s Testimony concerning dear William\nCarter,” in <em>The Memory of That Faithful Servant of Christ\nWilliam Carter, Late of Cumberland (Deceased,) Revived. In the\nTestimonies of Certain Faithful Friends given concerning him, his\nFaithful Ministry and Blessed End</em>, London: Thomas Northcott, p.\n7.",
                "1694, “The\nTestimony of Margaret Fox Concerning her Late Husband, George Fox;\ntogether With a brief Account of some of his Travels, Sufferings and\nHardships endured for the Truth’s Sake,” in <em>A Journal\nor Historical Account of the Life, Travels, Sufferings, Christian\nExperiences and Labour of Love in the Work of the Ministry, of that\nAncient, Eminent and Faithful Servant of Jesus Christ, George Fox</em>,\nLondon: Thomas Northcott, vol. I, pp. i–ix.",
                "1710, <em>A Brief\nCollection of Remarkable Passages and Occurrences Relating to the\nBirth, Education, Life, Conversion, Travels, Services and Deep\nSufferings of that Ancient, Eminent, and Faithful Servant of the Lord,\nMargaret Fell; But by her Second Marriage, Margaret Fox. Together With\nSundry of Her Epistles, Books, and Christian Testimonies to Friends and\nOthers; and also to those in Supreme Authority, in the several late\nRevolutions of Government</em>, London: J. Sowle.",
                "1987, <em>Spinoza’s Earliest Publication? The Hebrew\nTranslation of Margaret Fell’s “A Loving Salutation to the Seed\nof Abraham among the Jews, wherever they are scattered up and down on\nthe Face of the Earth”</em>, ed. Richard H. Popkin and Michael\nA. Signer, Assen: Van Gorcum.",
                "2018, <em>Women’s Speaking Justified and Other\nPamphlets</em>, ed. J. Donawerth and R. M. Lush, Toronto: Iter, and\nTempe: Arizona Center for Medieval and Renaissance Studies.\n</ul>\n<h3 id=\"OthePrimLite\">"
            ],
            "Other Primary literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Anonymous, 1646, <em>A Spirit\nMoving In The Women-Preachers: Or, Certaine Quaeres, Vented and put\nforth unto this affronted, brazen-faced, strange, new Feminine\nBrood</em>, London: Henry Shepheard.",
                "Bathurst, E., 1683, <em>The Sayings of Women, Which were spoken\nupon sundry occasions, in several places of the Scriptures</em>,\nShoreditch: Andrew Sowle.",
                "Booy, D. (ed.), 2004, <em>Autobiographical Writings by Early\nQuaker Women</em>, Aldershot: Ashgate.",
                "Collier, T., 1657, <em>A Looking Glasse for the Quakers, Wherein\nThey may behold themselves</em>, London: Thomas Brewster.",
                "Farnworth, R., 1654, <em>A Woman forbidden to speak in the Church,\nThe grounds examined, the Mystery opened, the Truth cleared, and the\nignorance both of Priests and Peeple discovered</em>, London: Giles\nCalvert.",
                "Fox, G., 1656, <em>The Woman\nlearning in Silence: Or, The Mysterie Of The Womans Subjection To Her\nHusband</em>, London: Thomas Simonds.",
                "Glines, E. F. (ed.), 2003,\n<em>Undaunted Zeal: The Letters of Margaret Fell</em>, Richmond, IN:\nFriends United Press.",
                "Garman, M., Applegate, J.,\nBenefiel, M., and Meredith, D., (eds.), 1996, <em>Hidden in Plain\nSight: Quaker Women’s Writing 1650–1700</em>, Wallingford, PA:\nPendle Hill Publications.",
                "Knox, J., 1558, <em>The First\nBlast Of The Trumpet Against The Monstrous regiment of women</em>,\nGeneva: J. Poullain and A. Rebul.",
                "Miller, J., 1655,\n<em>Antichrist in Man The Quakers Idol. Or a faithfull discovery of\ntheir ways and opinions by an eye and ear-witness thereof</em>, London:\nJ. Macock for L. Lloyd.",
                "Wallace, T. S. (ed.), 1992,\n<em>A Sincere and Constant Love: An Introduction to the Work of\nMargaret Fell</em>, Richmond, IN: Friends United Press.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Ames, M., 2016, <em>Margaret Fell, Letters, and the Making of\nQuakerism</em>, London: Routledge.",
                "Apetrei, S., 2010, <em>Women, Feminism, and Religion in Early\nEnlightenment England</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2009, “The\nUniversal Principle of Grace: Feminism and Anti-Calvinism in Two\nSeventeenth-Century Writers”, <em>Gender &amp; History</em>,\n21(1): 130–146.",
                "Broad, J., and Green, K., 2009, <em>A History of Women’s Political\nThought in Europe, 1400–1700</em>, Cambridge: Cambridge\nUniversity Press.",
                "Brown, S. (ed.), 2007, <em>Women, Gender, and Radical Religion in\nEarly Modern Europe</em>, Leiden: Brill.",
                "Bruyneel, S., 2015, “Margaret Fell and the Second Coming of\nChrist”, in <em>Early Quakers and their Theological Thought,\n1647–1723</em>, ed. S.W. Angell and P. Dandelion, Cambridge:\nCambridge University Press, pp. 102–117.",
                "–––, 2010, <em>Margaret Fell and the End of Time: The\nTheology of the Mother of Quakerism</em>, Waco: Baylor University\nPress.",
                "Clausen-Brown, K., 2019, “Spinoza’s Translation of\nMargaret Fell and his Portrayal of Judaism in\nthe <em>Theological-Political Treatise</em>”, <em>The\nSeventeenth Century</em>, 34(1): 89–106.",
                "Donawerth, J., 2006, “Women’s Reading Practices in\nSeventeenth-Century England: Margaret Fell’s <em>Women’s\nSpeaking Justified</em>”, <em>Sixteenth Century Journal: Journal\nof Early Modern Studies</em>, 37(4): 985–1005.",
                "Donawerth, J., and Lush, R. M., 2018, “Introduction”\nto M. Fell, <em>Women’s Speaking Justified and Other\nPamphlets</em>, Toronto: Iter, and Tempe: Arizona Center for Medieval\nand Renaissance Studies, pp. 1–54.",
                "Feroli, T., 2006, <em>Political Speaking Justified: Women Prophets\nand the English Revolution</em>, Newark, DE: University of Delaware\nPress.",
                "Foxton, R., 1994, <em>Hear the Word of the Lord: A Critical and\nBibliographical Study of Quaker Women’s Writing,\n1650–1700</em>, Melbourne: The Bibliographical Society of\nAustralia and New Zealand.",
                "Gardiner, J. K., 1994, “Margaret Fell Fox and Feminist\nLiterary History: ‘A Mother in Israel’ Calls to the\nJews”, <em>Prose Studies</em>, 17(3): 42–56.",
                "Gill, C., 2005, <em>Women in the Seventeenth-Century Quaker\nCommunity: A Literary Study of Political Identities,\n1650–1700</em>, Aldershot: Ashgate.",
                "Guibbory, A., 2000, “Conversation, Conversion, Messianic\nRedemption: Margaret Fell, Menasseh ben Israel, and the Jews”,\nin <em>Literary Circles and Cultural Communities in Renaissance\nEngland</em>, C. J. Summers and T.-L. Pebworth (eds.), Columbia and\nLondon: University of Missouri Press, pp. 210–234.",
                "Hinds, H., 1996, <em>God’s Englishwomen: Seventeenth-Century\nRadical Sectarian Writing and Feminist Criticism</em>, Manchester:\nManchester University Press.",
                "Hobby, E., 1994, “Handmaids of the Lord and Mothers in\nIsrael: Early Vindications of Quaker Women’s\nProphecy”, <em>Prose Studies</em>, 17(3): 88–98.",
                "Kelly, J., 1984, “Early Feminist Theory and the <em>Querelle\ndes Femmes</em>, 1400–1789”, in <em>Women, History, and\nTheory: The Essays of Joan Kelly</em>, Chicago and London: Chicago\nUniversity Press, pp. 65–109.",
                "Kunze, B. Y., 1994,\n<em>Margaret Fell and the Rise of Quakerism</em>, New York:\nMacmillan.",
                "–––, 1988, “Religious Authority and Social\nStatus in Seventeenth-Century England: The Friendship of Margaret\nFell, George Fox, and William Penn”, <em>Church History</em>,\n57(2): 170–86.",
                "Leucke, M. S., 1997, “ ‘God Hath Made No Difference\nSuch as Men Would’: Margaret Fell and the Politics of Women’s\nSpeech”, <em>Bunyan Studies</em>, 7: 73–95.",
                "Lobo, G. I., 2012, “Early Quaker Writing, Oliver Cromwell,\nand the Nationalization of Conscience”, <em>Exemplaria</em>,\n24(1–2): 112–26.",
                "Mack, P., 1992, <em>Visionary Women: Ecstatic Prophecy in\nSeventeenth-Century England</em>, Berkeley, CA: University of\nCalifornia Press.",
                "Moore, R., 2000, <em>The Light in their Consciences: The Early\nQuakers in Britain 1646–1666</em>, University Park, PA:\nPennsylvania State University Press.",
                "Nevitt, M., 2006, <em>Women and the Pamphlet Culture of\nRevolutionary England, 1640–1660</em>, Aldershot: Ashgate.",
                "Ross, I., 1996, <em>Margaret Fell: Mother of Quakerism</em>, third\nedition; York: The Ebor Press.",
                "Schofield, M. A., 1987, “ ‘Womens Speaking\nJustified’: The Feminine Quaker Voice,\n1662–1797”, <em>Tulsa Studies in Women’s Literature</em>,\n6(1): 61–77.",
                "Skwire, S. E., 2015, “‘Without Respect of\nPersons’: Gender Equality, Theology, and the Law in the Writing\nof Margaret Fell”, <em>Social Philosophy and Policy</em>, 31(2):\n137–57.",
                "Smith, H. L., 1982, <em>Reason’s Disciples: Seventeenth\nCentury English Feminists</em>, Urbana: University of Illinois\nPress.",
                "Speizman, M. D., and Kronick, J. C., 1975, “A\nSeventeenth-Century Quaker Women’s Declaration”, <em>Signs</em>,\n1(1): 231–45.",
                "Stavreva, K., 2007, “Prophetic Cries at Whitehall: The\nGender Dynamics of Early Quaker Women’s Injurious Speech”,\nin <em>Women, Gender, and Radical Religion in Early Modern\nEurope</em>, S. Brown (ed.), Leiden: Brill, pp. 17–38.",
                "Thickstun, M. O., 1995, “Writing the Spirit: Margaret Fell’s\nFeminist Critique of Pauline Theology”, <em>Journal of the\nAmerican Academy of Religion</em>, 63(2): 269–79.",
                "–––, 1992, “ ‘This was a Woman that\nTaught’: Feminist Scriptural Exegesis in the Seventeenth\nCentury”, <em>Studies in Eighteenth-Century Culture</em>, 21:\n149–158.",
                "Trevett, C., 1991, <em>Women and Quakerism in the Seventeenth\nCentury</em>, York: Sessions Book Trust, The Ebor Press.",
                "Tuana, N., 1993, <em>The Less\nNoble Sex: Scientific, Religious, and Philosophical Conceptions of\nWoman’s Nature</em>, Bloomington and Indianapolis: Indiana\nUniversity Press.",
                "Wilcox, C. M., 1995,\n<em>Theology and Women’s Ministry in Seventeenth-Century English\nQuakerism: Handmaids of the Lord</em>, Lewiston, NY: Edwin Mellen\nPress.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"WorkFell\">Works by Fell</h3>\n<ul class=\"hanging\">\n<li>1655, <em>False\nProphets, Anticrists, Deceivers, Which are in the World, which John\nProphesied of, which hath been long hid and Covered. But now is\nunmasked in these last dayes with the Eternal Light which is risen\n… By M. Fell</em>, London: Giles Calvert.</li>\n<li>1656a, <em>A Loving\nSalutation to The seed of Abraham among the Jewes: where ever they are\nscattered up and down upon the face of the earth</em>, London: Thomas\nSimmons.</li>\n<li>1656b, <em>A\nTestimonie of the Touchstone, for all Professions, and all Forms, and\nGathered Churches (as they call them) of what sort soever to try their\nground and foundation by. And a Tryal by the Scriptures, who the False\nProphets are, which are in the world, which John said should be in the\nlast times by Margret Fell. Also, some of the Ranters Principles\nAnswered</em>, London: Thomas Simmons.</li>\n<li>1656c, <em>For\nManasseth Ben Israel. The Call of the Jewes out of Babylon. Which is\ngood tidings to the Meek, Liberty to the Captives, and for the opening\nof the Prison Doores</em>, London: Giles Calvert.</li>\n<li>1659a, <em>To the\nGeneral Councel, and Officers of the English Army, And to every Member\nin particular</em>, London: Thomas Simmons.</li>\n<li>1659b, <em>To the\nGeneral Council of Officers. The Representation of divers Citizens of\nLondon, and others Well-affected to the Peace and Tranquility of the\nCommonwealth</em>, London: John Clowes.</li>\n<li>1659, (with G. Fox),\n<em>A Paper concerning such as are made Ministers by the will of man;\nand an exhortation to all sober minded people to come out from among\nthem</em>, London: M.W.</li>\n<li>1660a, <em>The\nCitie of London Reproved For its Abominations, which doth concern all\nthe Inhabitants thereof that are guilty</em>, London: Robert\nWilson.</li>\n<li>1660b, <em>A\nDeclaration and an Information From us the People of God called\nQuakers, To the present Governors, the King and Both Houses of\nParliament, and All whom it may Concern. This was Delivered into the\nKings hand, the 22 day of the Fourth Moneth by M.F.</em>, London:\nThomas Simmons and Robert Wilson.</li>\n<li>1660c, <em>An\nEvident Demonstration to Gods Elect, Which clearly manifesteth to them,\nI. How necessary and expedient it is for them to come to witnesse true\nfaith. II. That after they have attained to the faith, it must be tried\nas gold is tried in the fire. III. It shews how many have departed from\nthe faith and denied it. IV. That the standing of the Saints is by\nfaith in the Son of God. V. How strong Abraham was in the faith, and\nhow all that believe are to look unto him. By Margret Fell</em>,\nLondon: Thomas Simmons.</li>\n<li>1660d, <em>This is\nto the Clergy Who are the Men that goes about to settle Religion (As\nthey say) according to the Church of England. Whether they be Bishops\nor Presbyters, or what Name soever they may go under</em>, London:\nRobert Wilson.</li>\n<li>1660e, <em>This was\ngiven to Major Generall Harrison and the rest. Read this in the Fear of\nthe Lord, and in the moderation of Your spirits, without\nprejudice</em>, London: Thomas Simmons.</li>\n<li>1660f, <em>A True\nTestimony From the People of God: (Who by the world are called Quakers)\nof the Doctrines of the Prophets, Christ, and the Apostles; which is\nwitnessed unto, by them who are now raised up by the same Power, and\nquickned by the same Spirit and Blood of the Everlasting Covenant,\nwhich brought again our Lord Jesus from the dead</em>, London: Robert\nWilson.</li>\n<li>1664, <em>To the\nMagistrates and People of England where this may come</em>, London:\nn.p.</li>\n<li>1664, (with G. Fox),\n<em>The Examination and Tryall of Margaret Fell and George Fox (at the\nseverall Assizes held at Lancaster the 14<sup>th</sup> and\n16<sup>th</sup> days of the First Moneth 1663. And the 29<sup>th</sup>\nof the 6<sup>th</sup> Moneth 1664.) For their Obedience to Christs\nCommand who saith, Swear not at all. Also Something in Answear to\nBishop Lancelot Andrews Sermon Concerning Swearing</em>, London:\nn.p.</li>\n<li>1664, (with J. Parke), <em>Two General Epistles To the\nFlock of God, where-ever they are dispersed on the Face of the Earth;\nwho are gathered and separated from the World, and its Wayes and\nWorships, to bear Testimony for the Lord God against the Deceit and\nDeceivableness which the Worships of the World have lain in, in the\ndark Night of Apostacy … written by M.F. and J.P.</em>, London:\nn.p.</li>\n<li>1665a, <em>A Call\nto the Universall Seed of God, Throughout the whole World, to Come up\nto the Place of Publick Worship, which Christ Jesus the great Prophet\nhath set up, who took not upon Him the nature of Angels, but the seed\nof Abraham, whereby he comes to raise up Adams House and fallen State,\ninto an Estate that shall never fall</em>, London: n.p.</li>\n<li>1665b, “John\nWigan, this in Answer to part of thy Appendix,” in Thomas Curwen,\net al., <em>This is An Answer to John Wiggans Book, Spread up and down\nin Lancashire, Cheshire, and Wales, who is a Baptist &amp; a\nMonarchy-man</em>, London: n.p., pp. 86-122.</li>\n<li>1666, <em>A\nLetter Sent to the King From M. F. Here is also thereunto Annexed a\nPaper written unto the Magistrates in 1664, which was then Printed, and\nshould have been dispersed, but was prevented by wicked hands</em>,\nLondon: n.p.</li>\n<li>1667a, <em>The\nStandard of the Lord Revealed. By which He hath led and guided and\npreserved his people since Adam to this day, as is manifested through\nthe Scriptures, and is shewed forth in this following Abstract….\nGiven forth at Lancaster Castle 11 month 1665/6. By M.F. a Prisoner of\nthe Lord</em>, London?: n.p.</li>\n<li>1667b, <em>A\nTouch-Stone, or, A Perfect Tryal by the Scriptures, of all the Priests,\nBishops, and Ministers, who have called themselves, the Ministers of\nthe Gospel … unto which is annexed Womens speaking justified\netc</em>, London: n.p.</li>\n<li>1667c, <em>Womens\nSpeaking Justified, Proved and Allowed of by the Scriptures. All such\nas speak by the Spirit and Power of the Lord Jesus. And how Women were\nthe first that preached the Tidings of the Resurrection of Jesus, and\nwere sent by Christ’s Own Command, before He ascended to the\nFather, John 20.17</em>, second edition, London: n.p.</li>\n<li>1668, <em>A Call\nunto the Seed of Israel, That They may come out of Egypts Darkness, and\nHouse of Bondage, unto the Land of Rest. Also The Righteous Law of God\nJustified. With an Epistle to all those, whose desires are after the\nTruth as it is in Jesus where ever they are Scattered. Also Twenty five\nQueries to all the Worlds Priests and People that say, the Light of\nChrist is Natural, By M.F.</em>, London: Robert Wilson.</li>\n<li>1671, “A few\nLines concerning Josiah Coale,” in <em>The Books And Divers\nEpistles Of the Faithful Servant of the Lord Josiah Coale; Collected\nand Published, as it was desired by him the Day of his departure out of\nthis Life</em>, London: n.p., pp. 25–26.</li>\n<li>1677, <em>The\nDaughter of Sion Awakened, And putting on Strength: She is Arising and\nshaking her self out of the Dust, and putting on her Beautiful\nGarments, M.F.</em>, London: n.p.</li>\n<li>1679,\n“Friend, Whosoever thou art,” in S. Crisp, <em>An Epistle\nto Friends Concerning the Present and Succeeding Times</em>, third\nedition, London: n.p., pp. 3–6.</li>\n<li>1690,\n“Margaret Fox’s Testimony concerning dear William\nCarter,” in <em>The Memory of That Faithful Servant of Christ\nWilliam Carter, Late of Cumberland (Deceased,) Revived. In the\nTestimonies of Certain Faithful Friends given concerning him, his\nFaithful Ministry and Blessed End</em>, London: Thomas Northcott, p.\n7.</li>\n<li>1694, “The\nTestimony of Margaret Fox Concerning her Late Husband, George Fox;\ntogether With a brief Account of some of his Travels, Sufferings and\nHardships endured for the Truth’s Sake,” in <em>A Journal\nor Historical Account of the Life, Travels, Sufferings, Christian\nExperiences and Labour of Love in the Work of the Ministry, of that\nAncient, Eminent and Faithful Servant of Jesus Christ, George Fox</em>,\nLondon: Thomas Northcott, vol. I, pp. i–ix.</li>\n<li>1710, <em>A Brief\nCollection of Remarkable Passages and Occurrences Relating to the\nBirth, Education, Life, Conversion, Travels, Services and Deep\nSufferings of that Ancient, Eminent, and Faithful Servant of the Lord,\nMargaret Fell; But by her Second Marriage, Margaret Fox. Together With\nSundry of Her Epistles, Books, and Christian Testimonies to Friends and\nOthers; and also to those in Supreme Authority, in the several late\nRevolutions of Government</em>, London: J. Sowle.</li>\n<li>1987, <em>Spinoza’s Earliest Publication? The Hebrew\nTranslation of Margaret Fell’s “A Loving Salutation to the Seed\nof Abraham among the Jews, wherever they are scattered up and down on\nthe Face of the Earth”</em>, ed. Richard H. Popkin and Michael\nA. Signer, Assen: Van Gorcum.</li>\n<li>2018, <em>Women’s Speaking Justified and Other\nPamphlets</em>, ed. J. Donawerth and R. M. Lush, Toronto: Iter, and\nTempe: Arizona Center for Medieval and Renaissance Studies.</li>\n</ul>\n<h3 id=\"OthePrimLite\">Other Primary literature</h3>\n<ul class=\"hanging\">\n<li>Anonymous, 1646, <em>A Spirit\nMoving In The Women-Preachers: Or, Certaine Quaeres, Vented and put\nforth unto this affronted, brazen-faced, strange, new Feminine\nBrood</em>, London: Henry Shepheard.</li>\n<li>Bathurst, E., 1683, <em>The Sayings of Women, Which were spoken\nupon sundry occasions, in several places of the Scriptures</em>,\nShoreditch: Andrew Sowle.</li>\n<li>Booy, D. (ed.), 2004, <em>Autobiographical Writings by Early\nQuaker Women</em>, Aldershot: Ashgate.</li>\n<li>Collier, T., 1657, <em>A Looking Glasse for the Quakers, Wherein\nThey may behold themselves</em>, London: Thomas Brewster.</li>\n<li>Farnworth, R., 1654, <em>A Woman forbidden to speak in the Church,\nThe grounds examined, the Mystery opened, the Truth cleared, and the\nignorance both of Priests and Peeple discovered</em>, London: Giles\nCalvert.</li>\n<li>Fox, G., 1656, <em>The Woman\nlearning in Silence: Or, The Mysterie Of The Womans Subjection To Her\nHusband</em>, London: Thomas Simonds.</li>\n<li>Glines, E. F. (ed.), 2003,\n<em>Undaunted Zeal: The Letters of Margaret Fell</em>, Richmond, IN:\nFriends United Press.</li>\n<li>Garman, M., Applegate, J.,\nBenefiel, M., and Meredith, D., (eds.), 1996, <em>Hidden in Plain\nSight: Quaker Women’s Writing 1650–1700</em>, Wallingford, PA:\nPendle Hill Publications.</li>\n<li>Knox, J., 1558, <em>The First\nBlast Of The Trumpet Against The Monstrous regiment of women</em>,\nGeneva: J. Poullain and A. Rebul.</li>\n<li>Miller, J., 1655,\n<em>Antichrist in Man The Quakers Idol. Or a faithfull discovery of\ntheir ways and opinions by an eye and ear-witness thereof</em>, London:\nJ. Macock for L. Lloyd.</li>\n<li>Wallace, T. S. (ed.), 1992,\n<em>A Sincere and Constant Love: An Introduction to the Work of\nMargaret Fell</em>, Richmond, IN: Friends United Press.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary literature</h3>\n<ul class=\"hanging\">\n<li>Ames, M., 2016, <em>Margaret Fell, Letters, and the Making of\nQuakerism</em>, London: Routledge.</li>\n<li>Apetrei, S., 2010, <em>Women, Feminism, and Religion in Early\nEnlightenment England</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2009, “The\nUniversal Principle of Grace: Feminism and Anti-Calvinism in Two\nSeventeenth-Century Writers”, <em>Gender &amp; History</em>,\n21(1): 130–146.</li>\n<li>Broad, J., and Green, K., 2009, <em>A History of Women’s Political\nThought in Europe, 1400–1700</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Brown, S. (ed.), 2007, <em>Women, Gender, and Radical Religion in\nEarly Modern Europe</em>, Leiden: Brill.</li>\n<li>Bruyneel, S., 2015, “Margaret Fell and the Second Coming of\nChrist”, in <em>Early Quakers and their Theological Thought,\n1647–1723</em>, ed. S.W. Angell and P. Dandelion, Cambridge:\nCambridge University Press, pp. 102–117.</li>\n<li>–––, 2010, <em>Margaret Fell and the End of Time: The\nTheology of the Mother of Quakerism</em>, Waco: Baylor University\nPress.</li>\n<li>Clausen-Brown, K., 2019, “Spinoza’s Translation of\nMargaret Fell and his Portrayal of Judaism in\nthe <em>Theological-Political Treatise</em>”, <em>The\nSeventeenth Century</em>, 34(1): 89–106.</li>\n<li>Donawerth, J., 2006, “Women’s Reading Practices in\nSeventeenth-Century England: Margaret Fell’s <em>Women’s\nSpeaking Justified</em>”, <em>Sixteenth Century Journal: Journal\nof Early Modern Studies</em>, 37(4): 985–1005.</li>\n<li>Donawerth, J., and Lush, R. M., 2018, “Introduction”\nto M. Fell, <em>Women’s Speaking Justified and Other\nPamphlets</em>, Toronto: Iter, and Tempe: Arizona Center for Medieval\nand Renaissance Studies, pp. 1–54.</li>\n<li>Feroli, T., 2006, <em>Political Speaking Justified: Women Prophets\nand the English Revolution</em>, Newark, DE: University of Delaware\nPress.</li>\n<li>Foxton, R., 1994, <em>Hear the Word of the Lord: A Critical and\nBibliographical Study of Quaker Women’s Writing,\n1650–1700</em>, Melbourne: The Bibliographical Society of\nAustralia and New Zealand.</li>\n<li>Gardiner, J. K., 1994, “Margaret Fell Fox and Feminist\nLiterary History: ‘A Mother in Israel’ Calls to the\nJews”, <em>Prose Studies</em>, 17(3): 42–56.</li>\n<li>Gill, C., 2005, <em>Women in the Seventeenth-Century Quaker\nCommunity: A Literary Study of Political Identities,\n1650–1700</em>, Aldershot: Ashgate.</li>\n<li>Guibbory, A., 2000, “Conversation, Conversion, Messianic\nRedemption: Margaret Fell, Menasseh ben Israel, and the Jews”,\nin <em>Literary Circles and Cultural Communities in Renaissance\nEngland</em>, C. J. Summers and T.-L. Pebworth (eds.), Columbia and\nLondon: University of Missouri Press, pp. 210–234.</li>\n<li>Hinds, H., 1996, <em>God’s Englishwomen: Seventeenth-Century\nRadical Sectarian Writing and Feminist Criticism</em>, Manchester:\nManchester University Press.</li>\n<li>Hobby, E., 1994, “Handmaids of the Lord and Mothers in\nIsrael: Early Vindications of Quaker Women’s\nProphecy”, <em>Prose Studies</em>, 17(3): 88–98.</li>\n<li>Kelly, J., 1984, “Early Feminist Theory and the <em>Querelle\ndes Femmes</em>, 1400–1789”, in <em>Women, History, and\nTheory: The Essays of Joan Kelly</em>, Chicago and London: Chicago\nUniversity Press, pp. 65–109.</li>\n<li>Kunze, B. Y., 1994,\n<em>Margaret Fell and the Rise of Quakerism</em>, New York:\nMacmillan.</li>\n<li>–––, 1988, “Religious Authority and Social\nStatus in Seventeenth-Century England: The Friendship of Margaret\nFell, George Fox, and William Penn”, <em>Church History</em>,\n57(2): 170–86.</li>\n<li>Leucke, M. S., 1997, “ ‘God Hath Made No Difference\nSuch as Men Would’: Margaret Fell and the Politics of Women’s\nSpeech”, <em>Bunyan Studies</em>, 7: 73–95.</li>\n<li>Lobo, G. I., 2012, “Early Quaker Writing, Oliver Cromwell,\nand the Nationalization of Conscience”, <em>Exemplaria</em>,\n24(1–2): 112–26.</li>\n<li>Mack, P., 1992, <em>Visionary Women: Ecstatic Prophecy in\nSeventeenth-Century England</em>, Berkeley, CA: University of\nCalifornia Press.</li>\n<li>Moore, R., 2000, <em>The Light in their Consciences: The Early\nQuakers in Britain 1646–1666</em>, University Park, PA:\nPennsylvania State University Press.</li>\n<li>Nevitt, M., 2006, <em>Women and the Pamphlet Culture of\nRevolutionary England, 1640–1660</em>, Aldershot: Ashgate.</li>\n<li>Ross, I., 1996, <em>Margaret Fell: Mother of Quakerism</em>, third\nedition; York: The Ebor Press.</li>\n<li>Schofield, M. A., 1987, “ ‘Womens Speaking\nJustified’: The Feminine Quaker Voice,\n1662–1797”, <em>Tulsa Studies in Women’s Literature</em>,\n6(1): 61–77.</li>\n<li>Skwire, S. E., 2015, “‘Without Respect of\nPersons’: Gender Equality, Theology, and the Law in the Writing\nof Margaret Fell”, <em>Social Philosophy and Policy</em>, 31(2):\n137–57.</li>\n<li>Smith, H. L., 1982, <em>Reason’s Disciples: Seventeenth\nCentury English Feminists</em>, Urbana: University of Illinois\nPress.</li>\n<li>Speizman, M. D., and Kronick, J. C., 1975, “A\nSeventeenth-Century Quaker Women’s Declaration”, <em>Signs</em>,\n1(1): 231–45.</li>\n<li>Stavreva, K., 2007, “Prophetic Cries at Whitehall: The\nGender Dynamics of Early Quaker Women’s Injurious Speech”,\nin <em>Women, Gender, and Radical Religion in Early Modern\nEurope</em>, S. Brown (ed.), Leiden: Brill, pp. 17–38.</li>\n<li>Thickstun, M. O., 1995, “Writing the Spirit: Margaret Fell’s\nFeminist Critique of Pauline Theology”, <em>Journal of the\nAmerican Academy of Religion</em>, 63(2): 269–79.</li>\n<li>–––, 1992, “ ‘This was a Woman that\nTaught’: Feminist Scriptural Exegesis in the Seventeenth\nCentury”, <em>Studies in Eighteenth-Century Culture</em>, 21:\n149–158.</li>\n<li>Trevett, C., 1991, <em>Women and Quakerism in the Seventeenth\nCentury</em>, York: Sessions Book Trust, The Ebor Press.</li>\n<li>Tuana, N., 1993, <em>The Less\nNoble Sex: Scientific, Religious, and Philosophical Conceptions of\nWoman’s Nature</em>, Bloomington and Indianapolis: Indiana\nUniversity Press.</li>\n<li>Wilcox, C. M., 1995,\n<em>Theology and Women’s Ministry in Seventeenth-Century English\nQuakerism: Handmaids of the Lord</em>, Lewiston, NY: Edwin Mellen\nPress.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Astell, Mary",
            "equality",
            "feminist philosophy",
            "Locke, John",
            "Masham, Lady Damaris",
            "Spinoza, Baruch",
            "toleration"
        ],
        "entry_link": [
            {
                "../astell/": "Astell, Mary"
            },
            {
                "../equality/": "equality"
            },
            {
                "../feminist-philosophy/": "feminist philosophy"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../lady-masham/": "Masham, Lady Damaris"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../toleration/": "toleration"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=margaret-fell\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/margaret-fell/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=margaret-fell&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/margaret-fell/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=margaret-fell": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/margaret-fell/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=margaret-fell&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/margaret-fell/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Fell, M., <a href=\"http://www.qhpress.org/texts/fell.html\" target=\"other\"><em>Womens Speaking Justified</em> …</a>, Quaker Heritage Press Online Texts.",
            "Fell, M., <em>Womens Speaking Justified</em> and other works, available (by subscription) at <a href=\"http://www.wwp.northeastern.edu/wwo/\" target=\"other\">Women Writers Online</a>.",
            "“<a href=\"http://www.qhpress.org/texts/oldqwhp/mf-e-toc.htm\" target=\"other\">Epistles by Margaret Fell</a>,”\n Quaker Heritage Press Online Texts.",
            "Fell, M., \n“<a href=\"http://www.qhpress.org/quakerpages/qwhp/mf2king.htm\" target=\"other\">Letter to the King on Persecution</a>,” Quaker Heritage Press Online Texts."
        ],
        "listed_links": [
            {
                "http://www.qhpress.org/texts/fell.html": "Womens Speaking Justified …"
            },
            {
                "http://www.wwp.northeastern.edu/wwo/": "Women Writers Online"
            },
            {
                "http://www.qhpress.org/texts/oldqwhp/mf-e-toc.htm": "Epistles by Margaret Fell"
            },
            {
                "http://www.qhpress.org/quakerpages/qwhp/mf2king.htm": "Letter to the King on Persecution"
            }
        ]
    }
}