{
    "url": "maritain",
    "title": "Jacques Maritain",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "William Sweet\n<wsweet@stfx.ca>",
        "author_links": [
            {
                "mailto:wsweet%40stfx%2eca": "wsweet@stfx.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nWilliam Sweet\n&lt;<a href=\"mailto:wsweet%40stfx%2eca\"><em>wsweet<abbr title=\" at \">@</abbr>stfx<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Dec 5, 1997",
        "substantive revision Wed May 1, 2019"
    ],
    "preamble": "\n\nJacques Maritain (1882–1973), French philosopher and political\nthinker, was one of the principal exponents of Thomism in the\ntwentieth century and an influential interpreter of the thought of St\nThomas Aquinas. \n",
    "toc": [
        {
            "#Life": "1. Life"
        },
        {
            "#GeneBack": "2. General Background"
        },
        {
            "#PrinCont": "3. Principal Contributions"
        },
        {
            "#Meta": "3.1 Metaphysics"
        },
        {
            "#Epis": "3.2 Epistemology"
        },
        {
            "#PhilNatu": "3.3 Philosophy of Nature"
        },
        {
            "#NatuTheoPhilReli": "3.4 Natural Theology and Philosophy of Religion"
        },
        {
            "#MoraPoliPhilPhilLaw": "3.5 Moral and Political Philosophy and Philosophy of Law"
        },
        {
            "#AestPhilArt": "3.6 Aesthetics and Philosophy of Art"
        },
        {
            "#GeneAsse": "4. General Assessment"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimLiteMariPrinWork": "Primary Literature: Maritain’s Principal Works"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Coll": "Collections"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\nJacques Maritain was born on November 18, 1882 in Paris. The son of\nPaul Maritain, a prominent lawyer, and Geneviève Favre,\ndaughter of the French statesman, Jules Favre, Jacques Maritain\nstudied at the Lycée Henri IV (1898–99) and at the\nSorbonne, where he prepared a licence in philosophy\n(1900–01) and in the natural sciences (1901–02). He was\ninitially attracted to the philosophy of Spinoza. \n\nIn 1901, Maritain met Raïssa Oumansoff, a fellow student at the\nSorbonne and the daughter of Russian Jewish immigrants. Both were\nstruck by the spiritual aridity of French intellectual life and made a\nvow to commit suicide within a year should they not find some answer\nto the apparent meaninglessness of life. Largely at the suggestion of\nhis friend, the poet and religious thinker Charles Péguy,\nMaritain attended lectures by Henri Bergson at the Collège de\nFrance (1903–04). Bergson’s challenges to the\nthen-dominant positivism sufficed to lead Jacques and Raïssa to\ngive up their thoughts of suicide, and they married in 1904. Soon\nthereafter, through the influence of the writer Léon Bloy, both\nMaritains, as well as Raïssa’s sister, Vera, sought baptism\nin the Roman Catholic Church (1906). (Vera would live with Jacques and\nRaïssa for the rest of her life.)\n\nMaritain received his agrégation in philosophy in 1905\nand, late in 1906, Jacques and Raïssa left for Heidelberg, where\nJacques continued his studies in the natural sciences. They returned\nto France in the summer of 1908, and it was at this time that the\nMaritains explicitly abandoned bergsonisme and Jacques began\nan intensive study of the writings of Thomas Aquinas. Recent studies\nhave argued that the influence of Bergson can nevertheless be found\nthroughout Maritain’s writings (Nelson 2007; Gwozdz 2010)\n\nIn 1912, Maritain became professor of philosophy at the Lycée\nStanislaus, though he also gave courses at the Institut Catholique de\nParis. He was named Assistant Professor at the Institut Catholique\n(attached to the Chair of the History of Modern Philosophy) in 1914.\nHe became full Professor in 1921 and, in 1928, was appointed to the\nChair of Logic and Cosmology, which he held until 1939.\n\nIn his early philosophical work (e.g., “La science moderne et la\nraison”, 1910, and\nLa philosophie bergsonienne, 1914), Maritain sought to defend\nThomistic philosophy from its Bergsonian and secular opponents.\nFollowing brief service in the first world war, Maritain returned to\nteaching and research. The focus of his philosophical work continued\nto be the defense of Thomist and, more generally, Catholic thought\n(e.g., Antimoderne [1922], Trois réformateurs:\nLuther, Descartes, Rousseau [1925], and Clairvoyance de Rome\npar les auteurs du ‘Pourquoi Rome a parlé’ (J.\nMaritain et D. Lallement) [1929]), but Maritain also authored\nsome introductory philosophical texts (e.g.,\nÉléments de philosophie [2 volumes,\n1920–23]) and his interests expanded to include aesthetics\n(e.g., Art et scholastique, 1920; 2nd ed.\n1927).\n\nBy the late 1920s, Maritain’s attention began to turn to social\nissues. Although he had some contact with the Catholic social action\nmovement, Action Française, he abandoned it in 1926\nwhen it was condemned by Pope Pius XI for its nationalistic and\nanti-democratic tendencies. Nevertheless, encouraged through his\nfriendships with the Russian philosopher Nicholas Berdiaev (beginning\nin 1924) and Emmanuel Mounier (from 1928), Maritain began to develop\nthe principles of a liberal Christian humanism and defense of natural\nrights.\n\nMaritain’s philosophical work came to be more eclectic, with the\npublication of books on Thomas Aquinas (1930), on religion and culture\n(1930), on Christian philosophy (1933), on Descartes (1932), on the\nphilosophy of science and epistemology (Distinguer pour unir; ou,\nles degrés du savoir, 1932) and, perhaps most importantly,\non political philosophy. Beginning in 1936, he produced a number of\ntexts, including Humanisme intégral (1936), De la\njustice politique (1940), Les droits de l’homme et la\nloi naturelle (1942), Christianisme et démocratie\n(1943), Principes d’une politique humaniste (1944),\nLa personne et le bien commun (1947), Man and the\nState (written in 1949, but published in 1951), and the\nposthumously published La loi naturelle ou loi\nnon-écrite (based on lectures delivered in August\n1950).\n\nMaritain’s ideas were especially influential in Latin America\nand, largely as a result of the ‘liberal’ character of his\npolitical philosophy, he increasingly came under attack from both the\nleft and the right, in France and abroad. Lectures in Latin America in\n1936 led to him being named as a corresponding member of the Brazilian\nAcademy of Letters, but also to being the object of a campaign of\nvilification in Chile as “a man of the left” (Compagnon\n2003: 167).\n\nFrom the early 1930s Maritain was an established figure in Catholic\nthought. He visited North and South America and, beginning in January\n1933, came periodically to the Institute of Mediaeval Studies and to\nSt Michael’s College in Toronto (Canada) to give courses of\nlectures. Following his lectures in Toronto at the beginning of 1940,\nhe moved to New York. With the occupation of France by the German\nmilitary in June 1940, the Maritains decided not to return to France;\nJacques taught at Columbia University (1941–44) as well as at\nPrinceton (1941–42).\n\nWhile in the United States during the war, Maritain was active in the\nwar effort, recording broadcasts destined for occupied France and\ncontributing to the Voice of America. He continued to lecture and\npublish on a wide range of subjects—not only in political\nphilosophy, but in aesthetics (e.g., Art and Poetry, 1943\n[French original 1935]), philosophy of education, and metaphysics\n(De Bergson à St Thomas d’Aquin, 1944).\nFollowing the liberation of France in the summer of 1944, he was named\nFrench ambassador to the Holy See, serving until 1948, but was also a\nmember of (and, for a time, Head) of the French delegation to UNESCO,\nand was importantly involved in the promotion and, indirectly, in the\ndrafting of the United Nations Universal Declaration of Human Rights\n(1948).\n\nIn the spring of 1948, Maritain returned to Princeton as Professor of\nPhilosophy; he also lectured at a number of American universities\n(particularly at the University of Notre Dame and the University of\nChicago), but frequently returned to France to give short courses in\nphilosophy—notably at ‘L’Eau vive’, in the\ntown of Soisy, near Paris. During this time, in addition to his work\nin political philosophy (cf. above, as well as Le philosophe dans\nla cité, 1960), Maritain published on aesthetics\n(Creative Intuition in Art and Poetry, 1953), religion\n(Approches de Dieu, 1953), moral philosophy (Neuf\nleçons sur les notions premières de la philosophie\nmorale, 1951; La philosophie morale, 1960), and the\nphilosophy of history (On the Philosophy of History,\n1957).\n\nIn 1952, at the age of seventy, Maritain retired from Princeton, but\ncontinued living and periodically lecturing there as Professor\nEmeritus. After the death of Raïssa’s sister Vera in\nPrinceton in December, 1959, the Maritains returned to France.\nFollowing Raïssa’s death in November 1960, Jacques moved to\nToulouse, where he decided to live with a religious order, the Little\nBrothers of Jesus. During this time he wrote a number of books, the\nbest-known of which was Le paysan de la Garonne (a work\nsharply critical of post-Vatican Council reforms), published in late\n1966. In 1970, he petitioned to join the order, and died in Toulouse\non April 28, 1973. He is buried alongside Raïssa in Kolbsheim\n(Alsace) France.\n2. General Background\n\nMaritain saw himself as working in continuity with the thought of\nThomas Aquinas, and his writings frequently contain quotations from\nand references to Aquinas’ texts. While his turn to Catholicism\nwas largely due to personal reasons and to the influence of friends,\nhis intellectual itinerary and his defense of Catholic thought and\nThomistic philosophy were undoubtedly determined by events affecting\nhis adopted church. \n\nOne such series of events was the attack on (principally Catholic)\nreligious organisations by secular and humanist forces within the\nFrench state in the early twentieth century, culminating in a number\nof laws affecting the taxation and ownership of church property and\nthe place of religion in public affairs. Another, at about the same\ntime, were those reflecting the tensions within\nCatholicism—particularly in France—in reaction to\ntheological modernism. The writings of George Tyrell in England and\nErnest Renan and Alfred Loisy in France were condemned for such\n‘errors’ as claiming that conscience is the primary source\nof religious truth and that all knowledge—including\ndogma—has a historical and contingent character, and so\nchallenging the authoritative character of magisterial pronouncements.\nFurther, the major philosophical traditions in France were seen as\nincompatible with Catholic theology. The dominant schools were the\nspiritualism or intuitionism of Bergson (which held that the emphasis\nin metaphysics on ‘being’ should be replaced by one on\ndurée or pure change), the idealism of Léon\nBrunschvicg, the spiritualism of André Lalande, and the\nmaterialism of Edmond Goblot; each challenged claims that were seen as\nessential to Catholicism. Given this turmoil, there was a call for a\ndefence of the philosophies and the theological teachings of the\nCatholic Church.\n\nMaritain’s early writings, then, sought to address some of the\nconcerns arising out of these events. Having been attracted initially\nto Spinoza’s idealism and, later, to Bergson’s vitalist\nintuitionism, he was able to come to the defense of Catholic thought\nwith a knowledge of its critics that surpassed many of his\ncontemporaries. Maritain rejected\n‘modernity’—Cartesian and post-Cartesian\nthought—for what he saw as its emphasis on epistemology over\nmetaphysics, and found an alternative in the ‘pre-modern’\nviews of Aquinas. Nevertheless, he saw that philosophy had to do more\nthan merely repeat Thomas’ views, and he took it upon himself to\ndevelop some aspects of Thomistic philosophy to address the problems\nof the contemporary world. Thus, though the most profound inspiration\nfor many of Maritain’s ideas was the work of Thomas Aquinas, his\nepistemology and aesthetics show also the influence of Christian\nmysticism, particularly that of St John of the Cross, and his social\nand political philosophy clearly reflects many of the ideals of\nEuropean liberalism.\n3. Principal Contributions\n3.1 Metaphysics\n\nAlthough Maritain did not produce a text that provided a comprehensive\nstatement of his metaphysics, his major contributions to the area are\nfound in Sept leçons sur l’être et les premiers\nprincipes de la raison spéculative (1934, A Preface to\nMetaphysics: Seven Lectures on Being), the Court\ntraité de l’existence et de l’existant (1947,\nExistence and the Existent) , and De Bergson à\nThomas d’Aquin, essais de métaphysique et de morale\n(1944). Discussion of his metaphysics are also found in other works,\nsuch as Distinguer pour unir; ou, les degrés du savoir\n(1932, The Degrees of Knowledge), Science et sagesse\n(1935, Science and Wisdom), Ransoming the Time\n(1941), and Raison et raisons (1948, The Range of\nReason).\n\nAs one might expect, Maritain’s metaphysics follows in the\ntradition of Aquinas, but it is far from a restatement of\nAquinas’s views. For Maritain, metaphysics in general is always\nin need of renewal and defense (see Dewan 2009), and Maritain saw his\ntask—and the task of Thomism in general—as being “to\nrenovate” Aquinas’s thought, “a task whose novelty\nmay well be greater than [Thomists] themselves realise”\n(Preface to Metaphysics, 1934 [1939: 12–13]). \n\nFollowing Aquinas, Maritain holds that metaphysics deals with being as\nbeing (ens inquantum ens), i.e., it “investigates the\nfirst principles of things and their highest causes”\n(Preface to Metaphysics, 1934 [1939: 27]). And Maritain also\nholds that there are certain fundamental metaphysical questions to\nwhich Aquinas’s responses are largely correct, though they may\nnot be complete as they stand. Maritain adopts, against John Duns\nScotus, Aquinas’s general position on analogy, being, and on the\nneed for analogical terms and concepts. Again, in answer to the\nproblem of unity and plurality—e.g., how can a thing be\nindividual and distinct and yet a member of a class of things of the\nsame kind?—Maritain follows Aquinas: that we have to distinguish\nwhat a thing is (its nature or essence, which it shares with\nthings of the same kind) from the fact that it is (i.e., that\nit has its own ‘act of existing’). When it comes to the\nanalysis of the nature and the unity of sensible beings, including\nhuman beings, Maritain employs Aquinas’s distinction between the\nform and the matter of a thing; nature or essence reflects the form,\nwhereas the individuality is determined by the matter.\n\nMaritain’s distinctive contribution is not, however, to the\ndetails of Thomistic metaphysics, but to bringing it into relation\nwith modern science and philosophy, and to explaining its foundations.\n\n\nFor Maritain, all human enquiry has ‘being’ as its object;\nbeing, in other words, is the formal object of the intellect\n(Preface to Metaphysics, 1934 [1939: 25]). But\n‘being’ can be grasped in different ways, and Maritain\ndistinguishes, for example, between sensible being (“the object\nfirst attained by the human intellect”) and being as being\n(which is the object of metaphysics). The way in which he does so\ndistinguishes him from several of the other leading twentieth-century\nThomists, such as Gilson and Fabro (Contat 2008). It is because of\nthis difference in object that Maritain distinguishes (as he notes in\nhis epistemology and his philosophy of nature, discussed below) among\nthe activities of the empirical scientist, the mathematician, the\nphilosopher, the theologian, and the mystic.\n\nMetaphysical enquiry—the enquiry into being as being—is,\nMaritain says, a mystery; being is, for example, something that is\n“pregnant with intelligibility” and too “pure for\nour intellect” (Preface to Metaphysics, 1934 [1939:\n4]). Nevertheless, the mystery of being is an “intelligible\nmystery” (1934 [1939: 83]), and Maritain holds that, unless one\ndoes metaphysics, one cannot be a philosopher; “a philosopher is\nnot a philosopher unless he is a metaphysician” (Existence\nand the Existent, 1947 [1948: 29]).\n\nPhilosophical reflection on being begins with the intuition of being,\nand Maritain insists that one needs this “eidetic”\nintuition for any genuine metaphysical knowledge to be possible. The\nintuition of being that lies at the root of metaphysical enquiry is\nnot that of “the vague being of common sense” (see\nPreface to Metaphysics, 1934 [1939: 78]), but an\n“intellectual intuition” (Existence and the\nExistent, 1947 [1948: 28]) or grasp of “the act of\nexisting”. (This emphasis by Maritain on the intuition of being\ngoes beyond what we find in Aquinas—some have argued that it is\naltogether foreign to him [Wippel 2014, Knasas 1992]—and\narguably reflects Bergson’s account of the intuition of\nduration. As noted earlier, some have argued that Maritain’s\ndebt to Bergson overall is much greater than he himself held [Gwozdz\n2010].) \n\nThis intuition of being \n\n\nis a perception direct and immediate …. It is a very simple\nsight, superior to any discursive reasoning or demonstration […\nof] a reality which it touches and which takes hold of it;\n(Preface to Metaphysics, 1934 [1939: 50–51]) \n\n\nit is, Maritain says, an awareness of the reality of one’s\nbeing—one which is decisive and has a dominant character. This\nview of intuition is not, then, that of a hunch or quick insight;\nneither is it (Maritain continues) the same as Bergson’s. It has\nan intellectual character, is a grasp of something that is\nintelligible, and requires “a certain level of intellectual\nspirituality” (1934 [1939: 49]). Maritain claims that this\nintuition of being is something which escaped Kant (1934 [1939: 48])\nand many subsequent philosophers until, perhaps, the arrival of the\nexistentialists. \n\nThere are approaches that one may adopt in order to acquire this grasp\nor intuition, but there is no method that one may follow that\ndefinitely produces it. This grasp may, for example, be acquired by\nfocusing on something real and then reflecting on what lies behind it.\nThus, this “eidetic intuition” or “ideating\nvisualisation” is one where we “look … reality\n… in the face”, in which “reality [is] stripped of\nits real existence outside the mind” and discloses “the\nconditions of … an existence of intelligibility in act”\n(Preface to Metaphysics, 1934 [1939: 58]). This metaphysical\nintuition is, then, an “ideating intuition” of things in\nthe perspective of their “intelligible values”, rather\nthan in terms of the actual conditions of their “contingence and\nsingularity” (Science and Wisdom, 1935 [1940: 108]).\n\n\nAlso distinctive in Maritain’s account of metaphysics is the\nemphasis on “the act of existing”. It is because of this\nthat Maritain has been called an ‘existentialist’; indeed,\nhis Existence and the Existent, is subtitled “an essay\non Christian existentialism”, and he describes his view as an\n“existential intellectualism” (Existence and the\nExistent, 1947 [1948: 70]). Maritain believes that such an\nemphasis is characteristic of any consistent Thomism; \n\n\nWhat distinguishes authentic Thomism … is precisely the primacy\nwhich [it] accords to existence and the intuition of existential\nbeing. (1947 [1948: 12]) \n\n\nThis ‘existentialism’, however, is quite distinct from the\nexistentialisms of Kierkegaard, Gabriel Marcel, or Jean-Paul Sartre.\nAn “authentic existentialism”, Maritain writes, \n\n\naffirm[s] the primacy of existence, but as implying and preserving\nessences or natures, and as manifesting the supreme victory of the\nintellect and intelligibility. (1947 [1948: 13]) \n\n\nIt stands against the position of his contemporaries who abandoned\ntalk of natures or essences or of their intelligibility, but also\nagainst those who imagine that essences were created and then came to\nexist. (For Maritain, essences do not preexist existence; essences\nmight be better seen as “capacities to exist” [1947 [1948:\n34]].)\n\nAs one has the intuition of being and pursues this investigation into\nbeing, one is led into the traditional questions of metaphysics and\nnatural theology. There are, Maritain holds, four basic principles of\nmetaphysics: the principles of identity, of sufficient reason, of\nefficient causality, and of finality (i.e., every agent acts for an\nend). Though the truth or the applicability of these principles does\nnot admit of direct proof, they are consistently confirmed by\nexperience and, Maritain holds, cannot be denied without contradiction\n(Preface to Metaphysics, 1934 [1939: 90]).\n\nMetaphysics, then, properly includes an investigation into the\ncause of being—i.e., God, in whom the act of existing\nis subsistent. Some sympathetic scholars (e.g., Yves Floucat) have\nnevertheless questioned whether Maritain ultimately had a consistent,\nThomistic view of what was the core of metaphysics (Floucat 1996). In\nany case, since Maritain holds that being is something that is grasped\nthrough intuition, one is not surprised to see that he will argue that\none can attain knowledge of the existence of God not only through the\nThomistic five ways, but also through intuition. (This is discussed in\n section 3.4, ‘Natural Theology and Philosophy of Religion’, below.)\n3.2 Epistemology\n\nMaritain’s primary work in epistemology is Distinguer pour\nunir; ou, les degrés du savoir (1932, Distinguish to\nUnite: or, The Degrees of Knowledge), though some see\nMaritain’s 1936 essay, “Science et philosophie” (in\nQuatre essais sur l’esprit, 1939), in which Maritain\naddresses arguments of the Vienna Circle, as completing his account of\nknowledge (Malquori 2009). One also finds a number of important essays\non the topic in Raison et raisons, essais\ndétachés (1948, The Range of Reason).\nMaritain, again, largely follows the realist view of Thomas\nAquinas—though he was significantly influenced by John of St\nThomas (John Poinsot), St John of the Cross, and St Augustine, and the\nstructure of Les degrés du savoir is similar to the\nprocedure traced in the Itinerarium mentis in Deum [Journey of the Soul into God, 1259 [1938, 2002] of St Bonaventure.\n\nAgainst ‘modern philosophy’, Maritain insisted on the\npriority of metaphysics over epistemology—in fact, he held that\n“the critique of knowledge is part of metaphysics”\n(The Range of Reason, 1948 [1952: 25])—and also\nmaintained that the structure and method of the various sciences were\ndetermined by the nature of the object to be known.\n\nMaritain called his view “critical realism”, and argued\nparticularly against the then-dominant rationalist and empiricist\naccounts of knowledge. He maintained that, despite the differences\namong them, Kantianism, idealism, pragmatism, and positivism all\nreflected the influence of nominalism—that universal notions are\ncreations of the human mind and have no foundation in reality.\nMaritain’s critical realism holds that what the mind knows is\nidentical with what exists. To know a thing is for its\n‘essence’ to exist immaterially in the mind. This is not\nto say that the mind mirrors or copies that which it knows, but that,\nin virtue of the properties apprehended, it ‘becomes’ the\nthings it knows. Maritain held that our knowledge of reality was\nthrough the ‘concept’—the esse\nintentionale—which was immaterial and universal, though the\nconcept itself was something known only by reflection. Thus, when it\ncomes to knowledge of sensible objects, for example, the mind has both\na passive role (receiving sense impressions) and an active one\n(constructing knowledge from these impressions) (see Deely 1997, Munoz\n2012).\n\nMaritain’s epistemology sought to explain the nature of\nknowledge found not just in science and philosophy, but in religious\nfaith and mysticism, and one of his aims was to show the different\n‘kinds’ of knowledge and their relations to one another.\nHe argued that there were different ‘orders’ of knowledge\nand, within them, different ‘degrees’ determined by the\nnature of the object to be known and the ‘degree of\nabstraction’ involved.\n\nFirst, in the order of rational knowledge, one can speak of the\nknowledge of sensible nature (i.e., of the objects of experimental\nscience), which is different from the knowledge of mathematics or of\n‘physico-mathematical’ objects (which is limited because\nits objects do not have a direct relation to the actual), which is, in\nturn, distinct from the knowledge of trans-sensible or metaphysical\nnature.\n\nThese ‘degrees of knowledge’ are not, however, independent\nof one another, and they have in common the requirement that to know\nsomething is to know why it is \n\n\nthe mind is not satisfied when it merely attains a thing […],\nbut only when it grasps that upon which that datum is founded in being\nand intelligibility. (Degrees of Knowledge, 1932 [1959: 23])\n\n\n\nFor example, natural science, which is based on sense perception, aims\nat formulating laws which reflect certain features of the objects\nperceived. The scientist, then, is primarily concerned with looking\nfor regularities in nature, employing what Maritain calls an\n“empiriological” approach (see Degrees of\nKnowledge, 1932 [1959: 178–180]; Philosophy of\nNature, 1935 [1951: 49]). (An empiriological analysis is a\nnon-philosophical and, specifically, non-ontological approach to\nunderstanding natural beings that does not seek to know them “in\nterms of their type of being or reality”, but only “in\nterms of their empirical manifestations” (Carlson 2012: 37).\nSuch an analysis does not provide knowledge of the essence of natural\nbeings. Maritain offers mathematical physics as an illustration of\nthis approach.) The product of this method is what Maritain calls\n“perinoetical” knowledge.\n\nBut for natural science to achieve the status of a science, it\npresupposes the capacity of human beings to know things apart from\ntheir particular individuating characteristics (though not apart from\nthe existence of matter), i.e., natural philosophy. Natural philosophy\n‘gets behind’ phenomena in order to discover essential\nconnections and causes. Thus, from that which is presented in sense\nperception, the mind constructs an object (the essence) which is\nuniversal. (This is possible because, Maritain maintains, there are\nessences or natures of things.) This process of ‘thinking\nthrough’ to the nature of the thing is called by Maritain\ndianoetical knowledge. So, while natural science and natural\nphilosophy both focus on the physical, the natural\nphilosopher—unlike the scientist—is concerned with the\nessence of the object and its definition (or, at the very least, an\naccount of its various properties). This is knowledge at the level of\nthe first ‘degree of abstraction’.\n\nPhysico-mathematical objects (e.g., quantity, number, and extension)\nstand at a second ‘degree’ of abstraction. While they\ncannot exist without the existence of material things, once known,\nthey can be conceived of without any reference to such objects.\nFinally, metaphysical or speculative knowledge deals with objects\nexisting at a third degree of abstraction (i.e., independently of\nmatter), such as substance, quality, goodness, and the divine. Because\nof the nature of the objects of metaphysics, this latter kind of\nknowledge does not involve logical inference as much as reasoning by\nanalogy or what Maritain calls ananoetic knowledge. Such\nknowledge (e.g., of the divine) is not through any direct\napprehension, but indirectly, through creatures.\n\nThere is a hierarchy among these ‘degrees of knowledge’.\nThose objects which are highest in intelligibility, immateriality, and\npotential to be known are the objects of the highest degree of\nknowledge. Maritain writes, \n\n\n[t]he metaphysician considers an object of knowing of a specifically\nhigher nature and intelligibility, and from it he acquires a proper\nknowledge, a scientific knowledge, by means that absolutely transcend\nthose of the physicist or the mathematician. (Degrees of\nKnowledge, 1932 [1959: 37]) \n\n\nNevertheless, while there are different ‘orders’ and\n‘degrees’ of knowledge, one should not conclude that there\nare different ‘knowledges’.\n\nMaritain points out that philosophical demonstration is different from\nnatural scientific or mathematical demonstrations: \n\n\nphilosophy is concerned with an objectively distinct field of\nknowledge and constitutes a really autonomous discipline, possessing\nits own adequate means of explaining this field of knowledge.\n(Range of Reason, 1948 [1952: 5]) \n\n\nThus, Maritain writes, natural philosophy penetrates to the nature of\nits object. Metaphysics—which is also a kind of philosophic\nknowing—is concerned with purely intelligible being. Science,\nhowever, is at best ‘empiriological’—it does not\nlead us to being itself, but only to the observable and measurable.\nConsequently, to employ a method of scientific demonstration to\nestablish or to criticize claims about the object of metaphysical\nknowledge is, to use Ryle’s classic term, a category mistake. It\nis precisely because he holds that empiricist and rationalist\nepistemologies do this, that Maritain takes issue with them.\n\nJust as there is an order of rational knowledge with its\n‘degrees’, there is another order and degrees of\nsuprarational knowledge—of a higher wisdom—that is beyond\n‘natural knowledge’. These are, on the one hand,\n‘the science of revealed mysteries’ or ‘theological\nwisdom’ and, on the other, ‘mystical theology’.\nHere, Maritain’s debt to Augustine and John of the Cross is\nparticularly evident (see Barreiro 2008). According to Maritain, in\ntheological wisdom, the divine is known by drawing not just on reason\nbut on faith. (This is distinct from metaphysical knowledge which, so\nto speak, approaches the divine from the ‘outside’.)\nMystical knowledge stands one level higher still—where there is\nno mediation by concepts—and “consists in knowing\n[…] Deity as such—according to a mode that is\nsuprahuman and supernatural” (The Degrees of\nKnowledge, 1932 [1959: 253]). This is a knowledge by\nconnaturality, but also a knowledge that can be pursued through the\npractical discipline of ‘mystical contemplation’. In this\nway, human beings acquire a kind of knowledge that makes them more\nloving and more spiritual. (It is worth noting that, for Maritain,\nthis mysticism extended beyond the Christian tradition. Not only did\nhe refer to the example of Ramanuja, but he encouraged the future\nIndologist Olivier Lacombe to direct his “philosophical work\ntowards the study of Indian mysticism” [Lardinois 2017: 314].)\n\n\nThe development of the notion of ‘knowledge by\nconnaturality’ (or ‘connatural knowledge’ or\n‘knowledge by inclination’), latent in Aquinas (Summa\ntheologiae, II-II, q. 45, a 2), is one of Maritain’s major\ncontributions to epistemology. Maritain places this knowledge at the\nlevel of the preconscious intellect. It is “non-conceptual and\nnon-rational”, (Natural Law, 2001: 18); he describes it\nas \n\n\nobscure, unsystematic, vital knowledge, by means of instinct or\nsympathy, and in which the intellect, in order to make its judgments,\nconsults the inner leanings of the subject. (Man and the\nState, 1951: 91) \n\n\nNor is it, as much knowledge is, a knowledge of essences.\nNevertheless, it is still connected to “intellectual act”\nand is a genuine knowledge of reality. This kind of knowledge lies at\nthe basis, not only of mystical experience, but of artistic activity\nand morality; it provides a knowledge of God, of the first principles\nof morality, and a knowledge of one’s own subjectivity. \n\nA number of questions have been raised concerning Maritain’s\nepistemology, particularly concerning his characterization of\nphilosophical knowledge. Moreover, while Maritain claims that there is\na difference in method between the sciences and philosophy, some have\nargued that it is not clear what exactly that difference is (Vitoria\n2011). For example, Maritain would follow Aquinas in holding that\nmetaphysics uses demonstratio quia—demonstration from\neffects. But it would seem that science also sometimes uses such a\nmethod of demonstration. Thus, it is not clear what it is in the\nmethod (as distinct from the content of the premises) that\ndifferentiates a metaphysical proof (e.g., of God’s existence)\nfrom a scientific argument establishing the existence of a cause of a\nnatural object.\n\nSecond, Maritain holds that scientific knowledge is distinguished from\nphilosophical knowledge in terms of their different methods and\ndifferent objects. But if scientific knowledge and philosophical\nknowledge are, as it were, incommensurable, it is not clear how\nphilosophy can judge, or be corrective of, the sciences.\n\nSome Thomist scholars have been reluctant to adopt Maritain’s\ndevelopment of Aquinas’ notion of ‘knowledge by\nconnaturality’, preferring instead to speak of “knowledge\nrelative to inclination” (Dewan 2010). Yet others have argued\nthat this development is of far-reaching significance, as\nMaritain’s notion of the intuition of being led him, in the\nyears following the publication of The Degrees of Knowledge,\nto recognise a greater role to be played by “the unconscious and\npreconscious life of the mind” (The Range of Reason,\n1948 [1952: 80]; Arraj 2006). \n\nFinally, it would seem that the model of demonstration that Maritain\nemploys is foundationalist and, thus, has to answer to those\ncriticisms that modern anti-foundationalism draws attention\nto—e.g., that a foundationalist theory sets a standard for\nknowledge that is not only without justification, but is a standard\nthat it cannot itself satisfy. Some defences of Thomistic epistemology\n(e.g., Veatch 1990),\nhowever, suggest ways in which such a concern might be addressed.\n3.3 Philosophy of Nature\n\nMaritain’s work in the philosophy of nature appears throughout\nhis work—in his Éléments de philosophie\n(Vol. 1, 1920, Introduction to Philosophy) and in an essay in\nScience et sagesse (1935, Science and Wisdom), but\nparticularly in Les degrés du savoir (1932, The\nDegrees of Knowledge) and La philosophie de la nature\n(1935, The Philosophy of Nature). Again, Maritain’s\naccount is based on Aristotle, Aquinas, and John Poinsot, though he\nclearly extends his predecessors’ views. \n\nAs noted earlier, Maritain’s early education and university\nstudies were in the natural sciences. His disillusionment with the\npositivistic approach to the sciences taken by his teachers in Paris,\nand his interest (following his conversion) in bringing Thomistic\nphilosophy to bear on the contemporary world led him to review the\nrelation between philosophy and the sciences and, particularly, to\ndevelop a philosophy of nature. \n\nFor Maritain, the philosophy of nature is a branch of speculative\nphilosophy. It seeks to provide an ontological analysis of corporeal,\nsensible ‘moving being’ (ens mobile);\nspecifically, it involves a search for the first principles of\nphysical things—i.e., principles that transcend sense. It is\nconcerned with, then, \n\n\na knowledge whose object, present in all things of corporeal nature,\nis mobile being as such and the ontological principles which account\nfor its mutability. (Degrees of Knowledge, 1932 [1959: 197])\n\n\n\nAmong the—and at the summit of—natural objects is\nhumanity, and thus psychology is the highest category of the\nphilosophy of nature.\n\nThe philosophy of nature lies, therefore, between the sciences and\nmetaphysics; it is to be distinguished from metaphysics, which deals\nwith all being qua being, but also from the (empiriological) sciences,\nwhich deal with sensible being qua observable or measurable. Because\nit seeks principles that underlie all physical objects, it follows\nfrom reflections on and goes beyond science; because it still refers\nto such objects and acknowledges that its conclusions need to be\nconsistent with verification by the senses, however, it is not\nmetaphysics.\n\nAccording to Maritain, the investigations of natural science fall\nshort of a philosophy of nature because the objective of a philosophy\nof nature is not merely to reflect on the methods and conclusions of\nthe physical sciences, but to provide the underlying principles.\nMoreover, the philosophy of nature understands that reality is not\nreducible to the physical (physical reality). It focuses on the\nessences of things and the (natural) classes to which those things\nbelong. \n\nMaritain’s account supposes that there is a metaphysical and\nepistemological hierarchy: of sensible, observable things as known\nthrough the senses, to “the intelligible necessities immersed in\nthe reality of this world of existence” which are known through\nthe intellect disengaged from the senses (Degrees of\nKnowledge, 1932 [1959: 145]), to the “universe of quantity\nas such” (mathematics), to metaphysics and, ultimately, to\nmystical experience (see 1932 [1959: 145–6]). The levels in this\nhierarchy are determined, then, by how and the extent to which what is\nknown is abstracted from matter. The philosophy of nature, then, is a\ndeductive science that lies at the first level of abstraction. It is\nclose to metaphysics in that it addresses general issues concerning\nthe universe, such as its relation to principles of necessity and\ncontingency, and to a first cause. But it also needs to be completed\nby a knowledge of the natural sciences, and so is at the same level of\nabstraction.\n\nWhat are the principles that such an approach seeks? The philosophy of\nnature is specifically concerned with the nature of movement, of\ncorporeal substance (i.e., matter and form), of life, and of the\nconstitutive principles of organisms. Maritain writes, \n\n\nit belongs to the philosophy of nature to instruct us about the nature\nof the continuum and of number, of quantity, of space, of motion, of\ntime, of corporeal substance, of transitive action, of vegetative and\nsensitive life, of the soul and its operative powers, etc. (1932\n[1959: 186]) \n\n\nand so is at the same level of abstraction as the natural\nsciences.\n\nMaritain’s position here contrasts sharply with that of his\ncolleague, Etienne Gilson, who was more favourable to Bergson and who\nwrote little on the philosophy of nature throughout his life, arguably\nbecause he believed that the underlying Aristotelianism of the\nThomistic position had been rendered irrelevant by modern science\n(Nelson 2007). Even sympathetic critics, such as Gerald McCool, argue\nthat Maritain’s account of the three different degrees of\nabstraction that underlie this view is a distortion of Aquinas’s\nown view (McCool 1989: 254). More ardent critics have objected to\nMaritain’s account of what he calls ‘positivism’,\nand some, such as George Boas, argued at the time that Maritain\ndepends on a theory of the existence of natural classes that have\nessences—a philosophical theory which may not, in fact, be\npresupposed by most scientists (Boas 1952). (Maritain, of course,\nwould reply that this is precisely his point; such essences are not\nthe object of empiriological sciences.)\n3.4 Natural Theology and Philosophy of Religion\n\nLike Aquinas, Maritain held that there was no conflict between true\nfaith and true reason, that religious belief was open to rational\ndiscussion, and that the existence of God and certain fundamental\nreligious beliefs could be philosophically demonstrated. (Maritain\nheld, however, that ‘Russellian mathematical logic’ was\n“inferior to traditional Aristotelian logic”, and that any\ndemonstration of religious belief needed to follow Aristotelian\nsyllogistic; Introduction to Logic, 1923 [1937a:\n222–232]; Kraal 2013: 357.) Religious belief, then, was not an\nattitude or a matter of private opinion—an option that could be\nembraced or not according to one’s private preferences; it was a\nmatter of ‘truth’. For Maritain, one must choose between\n“the true God or radical irrationality” (Introduction\nto Philosophy, 1920 [1944: 259]). \n\nMaritain held that philosophy was an ancilla theologiae\n(“handmaid of theology”), and that philosophy, under the\nrubric of metaphysical knowledge, allows for the demonstration of a\nnumber of basic religious beliefs. Like Aquinas, Maritain accepted the\nclassical foundationalist position that these beliefs could be\nestablished by rational deduction from self-evident principles and\nconstituted genuine knowledge. Specifically, he held that, by the use\nof natural reason, one can come to know certain truths about God, and\nthat the ‘five ways’ of Thomas Aquinas provided sure\nknowledge of God’s existence. But Maritain also argued that\nthere could be other ‘proofs’ of the existence of the\ndivine and, in Approches de Dieu (1953), he developed what he\ncalled a “sixth way”.\n\nThere is, Maritain writes, an intuition that is awakened in persons\nwhen they are engaged in thought—that is, that it seems\nimpossible that they, as thinking beings, should at some time have not\nbeen. As a thinking being, one seems to be free from the vicissitudes\nof time and space; there is no coming to be or ceasing to be—I\ncannot think what it is not to be. Nevertheless, we all know very well\nthat we were born—we came into existence. We are confronted,\nthen, with a contradiction—not a logical contradiction, but a\nlived contradiction. The only solution to this is that one has always\nexisted, but not through oneself, but within “a Being of\ntranscendent personality” and from whom “the self which is\nthinking now proceeded into temporal existence” (Approches\nde Dieu, in Oeuvres complètes, Vol. X, p. 64 [Engl. tr., pp. 71–72]). This being \n\n\nmust contain all things in itself in an eminent mode and be\nitself—in an absolutely transcendent way—being, thought\nand personality. This implies that the first existence is the infinite\nplenitude of being, separate by essence from all diversity of\nexistents. (ibid., p. 66 [Engl. tr., p. 74])\n\n\nMaritain also acknowledges the possibility of a natural,\npre-philosophical, but still rational knowledge of God (see\nApproches de Dieu, pp. 13–22).\nThis is, Maritain claims, a\n‘knowledge’ that is necessary to—and, in fact leads\nto—a philosophical demonstration of God’s existence. (In\nthis way, then, one can know that some religious beliefs are true,\neven without being able to demonstrate them.) Maritain’s\nargument, which resembles the Thomistic argument from contingent\nbeing, is that, in one’s intuition of being, one is aware,\nfirst, of a reality separate from oneself; second, of oneself as\nfinite and limited; and, third, of the necessity that there is\nsomething “completely free from nothingness and death”\n(ibid., p. 15 [Engl. tr., p. 19]).\nThis is concurrent with a “spontaneous reasoning” that\nfollows the same course to the conclusion that there is \n\n\nanother Whole […] another Being, transcendent and\nself-sufficient and unknown in itself and activating all beings\n[…] that is, self-subsisting Being, Being existing through\nitself. (ibid., p. 16 [Engl. tr., p. 20])\n\n\n\nThis knowledge of God, Maritain admits, is not demonstrative but is,\nnevertheless, “rich in certitude” (ibid., p.\n19 [Engl. tr., p. 23]) and is both presupposed\nby, and is the underlying force for, philosophical demonstrations of\nGod’s existence.\n\nThe difference between the pre-philosophical and the philosophical\nknowledge of God is that the latter is one which is based on a\n“scientific demonstration” (Approches de Dieu, p.\n19 [Engl. tr., p. 23])—on empirical\nfacts—and involving analogy, from which we have terms that can\nbe properly predicated of the divine. On the other hand,\npre-philosophical knowledge is “intuition”—an\napproach to knowledge, though not a “way”,\n(ibid., p. 20 [Engl. tr., p. 24]) a proof, or a\ndemonstration. This knowledge is based on a natural reasoning which\ncannot be expressed in words. Yet, it is important also to realize\nthat while Maritain allows that certain truths “are grasped by\nthe common sense before being the object of philosophical\nconcern” (ibid., p. 24 [Engl. tr., p. 30]),\nphilosophical proofs of the existence of God are not only\n“established and justified philosophically” at the level\nof philosophy itself, but are already “valid and\nefficacious” at the level of this “incohative and\nspontaneous” philosophy. (ibid., p.  24 [Engl. tr.,\np. 30]), and that what one arrives at by means of such an approach is\n(as it is in philosophical demonstrations) knowledge of the truth of a\nproposition.\n\nIt has been argued, however, that there are some difficulties with\nMaritain’s position here. For example, even if it is true that\npeople may ‘naturally’ affirm the proposition that there\nis a God, it is not obvious how they can claim that they know\nit. In other words, even if the proposition is true, it is not clear\nhow we can say that we know or believe it to be true. What Maritain\nseems to give us here is an explanation of how one arrives at a\ncertain proposition and of one’s certainty, but nothing more.\nBut, since the state of certainty of an individual is not the same as\nthe assertion that that person knows something to be true, it is not\nclear that the pre-philosophical approach provides one with an\nadequate basis to say that a religious belief is true, only that one\nis convinced of it. And, one might argue, parallel conclusions can be\ndrawn if one examines the other ways that Maritain suggests will lead\nto a putative knowledge of God.\n\n(Interestingly, Maritain was a critic of a number of arguments\nproposed in defence of religious belief. He argued that such defenses\nfail because they do not recognise that there are different types of\nknowledge, that these different types are hierarchically arranged, and\nthat the methods they employ are, by definition, unsuited to\ndemonstrate certain things. Thus, Maritain holds that while\n‘reason’, as “intelligence moving in a progressive\nway towards its term, the real”, can attain knowledge of God by\nmeans of demonstration, if we take ‘reason’ to be a purely\ndiscursive method—one which Maritain identifies with the\n“physical-mathematical sciences” and which he also calls\n“the ‘reason’ of rationalism”\n(Antimoderne, 1922: 64, my translation)—it\ncan know or say\nnothing at all about God. Because reason must be ordered to its\nobject, reason (in this second sense) can neither demonstrate nor even\nencounter revealed truths.)\n\nIn addition to the possibility of the demonstration of the existence\nof God and of the coherence of the divine attributes, Maritain allows\nthat there are a number of other ways in which one might come to know\nreligious beliefs to be true. Besides knowing God\n‘naturally’, there is a “non-conscious knowledge of\nGod” in the first act of human freedom (see Range of\nReason, 1948 [1952: 69–71]), “connatural\nknowledge”, “abstract intuition” (by which one knows\n“primary principles” such as the laws of identity and of\nnon-contradiction and the principle of causality), the “ways of\nthe practical intellect” (i.e., through moral or\naesthetic experience—though these do not provide a strict\ndemonstration; see Approches de Dieu, ch.\nIV) and, of course, divine revelation.\n\nFor Maritain, to say that one can attain, by reason, some knowledge of\nGod is not to say that everyone can do this. Moreover, Maritain also\nheld that it can be reasonable to believe, even in the absence of such\narguments or evidence, though what one believes must not contradict\nthe results of ‘true reason’. For example, Maritain argues\nthat, even if one holds that a belief is capable of a rational\ndemonstration, it does not follow that one must be able to provide it;\nthus, one’s knowledge of ‘revealed truths’ is\nreasonable, though Maritain (like Aquinas) would never claim that one\nmust be able to produce a philosophical demonstration of them.\nFurther, Maritain allows that theology can “reject as false any\nphilosophic affirmation which contradicts a theological truth”\n(Introduction to Philosophy, 1920 [1944: 126]).\n\nMaritain writes that there can be knowledge of the divine attributes.\nAs with all natural knowledge of the divine, this knowledge is\nbasically analogical, and it is often the result of a via\nnegativa. Thus, he insists that we know some things about God. We\ncan know that God is (quia est), though not what God is in\nhimself (quid est) (Degrees of Knowledge, Appendix\nIII, 1932 [1959: 423]). Moreover, against A.G. Sertillanges and\nEtienne Gilson, Maritain maintains that we can have affirmative\nknowledge about God—i.e., know in a more or less imperfect but,\nnevertheless, true way what God is. Besides, Maritain holds, knowledge\nthrough negation presupposes positive knowledge. (Mary Daly notes,\nhowever, that Maritain is not clear about the extent to which our\naffirmative knowledge of God is arrived at by means of philosophical\nargument [Daly 1966: 53.].) Nevertheless, Maritain acknowledges that\nthe knowledge of God that philosophy provides is incomplete and\nimperfect; the analogical knowledge that we have of God falls\nshort of a complete description of what God is.\n\nIt is not clear that Maritain avoids many of the concerns expressed by\ncritics of ‘analogical knowledge’. For example, if the\nterm ‘cause’ is used analogously when applied to God, then\nwhen one utters the proposition ‘God is the cause of the\nuniverse’ after examining Aquinas’s ‘second\nway’, it would seem that one has to be using this term in\nexactly the same sense as it has been used throughout the preceding\nargument. If it is not being used in exactly the same sense, then how\ncan one claim that Aquinas has demonstrated this conclusion?\nThe problem is not whether analogical predication is possible but,\nfirst, whether one can understand the analogical predicate and,\nsecond, whether one can employ such a predicate in a demonstration\nwithout committing the fallacy of equivocation.\n\nGiven Maritain’s account of faith and of suprarational\nknowledge, it would seem that he would see religious beliefs as\n‘trusts’ and, hence, as having more than a purely\ncognitive character. He would, no doubt, follow Aquinas who spoke of\nfaith as a ‘disposition’ or virtue (habitus). A\nhabitus is, of course, not merely the product of action, but\nitself is ordered to action. Thus, to say that religious beliefs are\npropositional in form is not to say that their function is only\ndescriptive. Nevertheless, Maritain’s account of religious\nbelief and its relation to argument and proof is not complete.\nMoreover, given that Maritain does employ\n‘foundationalism’ as a standard of sufficient evidence for\nclaiming that some propositions expressing religious belief are true,\nas noted above, there is some debate whether he can directly address\nthe challenges of ‘postmodern’ critics of foundationalist\nepistemology.\n3.5 Moral and Political Philosophy and Philosophy of Law\n\nMaritain’s moral and political philosophy lies within what may\nbe called the Aristotelian-Thomistic natural law tradition. Maritain\nheld, however, that Aristotelian ethics, by itself, was inadequate\nbecause it lacked knowledge of humanity’s ultimate end. The\nThomistic view—that there is a law in human nature that is\nderivative of (though knowable separately from) a divine or eternal\nlaw, and that humanity’s ‘end’ goes beyond anything\nattainable in this life—was, Maritain thought, a significant\nadvance on what Aristotle had provided. \n\nFollowing Aquinas, Maritain maintained that there is a natural law\nthat is “unwritten” but immanent in nature. Specifically,\ngiven that nature has a teleological character, one can know what a\nthing should do or how it should be used by examining its\n“end” and the “normality of its functioning”.\nMaritain therefore defines ‘natural law’ as \n\n\nan order or a disposition that the human reason may discover and\naccording to which the human will must act to accord itself with the\nnecessary ends of the human being. (La loi naturelle, 1986:\n21, my translation; see Man and the\nState, 1951: 86) \n\n\nThis law “prescribes our most fundamental duties” (Man\nand the State, 1951: 95) and is coextensive with morality.\n\nThere is, Maritain holds, a single natural law governing all beings\nwith a human nature. The first principles of this law are known\nconnaturally, not rationally or through concepts, by an\nactivity that Maritain, following Aquinas, called synderesis.\nThus, natural law is ‘natural’ because it not only\nreflects human nature, but is known naturally. Maritain acknowledges,\nhowever, that knowledge of the natural law varies throughout humanity\nand according to individuals’ capacities and abilities, and he\nspeaks of growth in an individual’s or a collectivity’s\nmoral awareness. This allows him to reply to the challenge that there\ncannot be a universal, natural law because no such law is known or\nrespected universally. Again, though this law is progressively known,\nit is never known completely, and so the natural law is never\nexhausted in any particular articulation of it (La loi\nnaturelle, see Sweet 1998). This recognition of the historical\nelement in human consciousness did not, however, prevent Maritain from\nholding that this law is objective and binding. (Critics have argued,\nhowever, that to speak of ‘connatural knowledge’ is\nobscure; it is quite unlike what we ordinarily call\n‘knowledge’ and is, therefore, inadequate as a basis for\nknowledge of law. [see, for example, Nielsen 1959 [1991].)\n\nA key notion in Maritain’s moral philosophy is that of human\nfreedom. He says that the ‘end’ of humanity is to be free\nbut, by ‘freedom’, he does not mean license or pure\nrational autonomy, but the realisation of the human person in accord\nwith his or her nature—specifically, the achievement of moral\nand spiritual perfection. Maritain’s moral philosophy, then,\ncannot be considered independently of his analysis of human nature.\nMaritain distinguishes between the human being as an individual and as\na person. Human beings are ‘individuals’ who are related\nto a common, social order of which they are parts. But they are also\npersons. The person is a ‘whole’, is an object of dignity,\n“must be treated as an end” (Les droits de\nl’homme, 1942 [1943: 84]), and has a transcendent destiny.\nIn both the material and the spiritual order, however, human beings\nparticipate in a common good (see D’Souza 2011). One is an\nindividual in virtue of being a material being; one is a person so far\nas one is capable of intellectual activity and freedom. Still, while\ndistinct, both elements are equally necessary to being a human being.\nIt is in virtue of their individuality that human beings have\nobligations to the social order, but it is in virtue of their\npersonality that they cannot be subordinated to that order. Moreover,\nit is through free choice and action that a person defines himself\n(see Toromczak 2008). Maritain’s emphasis on the value of the\nhuman person has been described as a form of personalism,\nwhich he saw as a via media between individualism and\nsocialism.\n\nThough some critics have challenged Maritain’s distinction\nbetween the person and the individual as, for example, lacking\nmetaphysical rigour (Floucat 1996), many Maritain scholars regard it\nas a useful way of founding a liberal, but non-individualist political\nphilosophy (D’Souza 2008) or grounding an applied ethics\n(Acevedo 2012). \n\nMaritain’s moral philosophy is clearly related to his political\nphilosophy and his philosophy of law. The personalist position that he\ndefended had antecedents in the nineteenth century, but it was perhaps\nthe first to be part of an account of a new model of civilization (De\nTavernier 2009). In one of his earliest political works, Maritain\ndescribed his view as “integral Christian\nHumanism”—‘integral’, because it considers the\nhuman being, an entity that has both material and spiritual\ndimensions, as a unified whole and because it sees human beings in\nsociety as participants in a common good. The object of\nMaritain’s political philosophy was to outline the conditions\nnecessary to making the individual fully human. His integral humanism,\nthen, seeks to bring the different dimensions of the human person\ntogether, without ignoring or diminishing the value of either, and it\nhas been regarded by some as superior to Charles Taylor’s\n“exclusive humanism” (Klassen 2011) or, at least, as a\ncompletion of it (Doyle 2009). While one’s private good as an\nindividual is subordinate to the (temporal) common good of the\ncommunity, as a person with a supernatural end, one’s\n‘spiritual good’ is superior to society—and this is\nsomething that Maritain believed all political communities should\nrecognize.\n\nFor Maritain, the best political order is one which recognizes the\nsovereignty of God. He rejects, therefore, not only fascism and\ncommunism, but all secular humanisms. Maritain objects that such\nviews—particularly fascism and communism—are not only\nsecular religions, but dehumanizing (Kinsella 2012) and, while he was\na defender of American-style democracy, he is clearly not interested\nin combining his attachment to Christianity with capitalism. A\ntheocentric humanism, Maritain would argue, has its philosophical\nfoundation in the recognition of the nature of the human person as a\nspiritual and material being—a being that has a relation to\nGod—and social and political institutions must therefore reflect\nthis.\n\nMaritain envisages a political society under the rule of law—and\nhe distinguishes four types of law: the eternal, the natural, the\n‘common law of civilisation’ (droit des gens or\njus gentium), and the positive (droit positif).\n\nThe natural law is “universal and invariable” and deals\nwith “the rights and duties which follow [necessarily] from the\nfirst principle” (see La loi naturelle; Man and the\nState, 1951: 97–98) or precept of law—that good is to\nbe done and evil avoided. Nevertheless, while the natural law is\n“self-evident” (see Man and the State, 1951: 90)\nand consistent with and confirmed by experience—something which\nmany critics have challenged—Maritain holds that it is not\nfounded on human nature. It is rooted in divine reason and in a\ntranscendent order (i.e., in the eternal law), and is ‘written\ninto’ human nature by God. At times, Maritain appears to hold\nthat natural law acquires its obligatory character only because of its\nrelation to the eternal law; he writes that “natural law is law\nonly because it is participation in Eternal Law” (see Man\nand the State, 1951: 96). (Some have concluded—perhaps too\nhastily—that a theory that refers to an Eternal Law must be\nultimately theological and cannot be purely philosophical.)\n\nThe droit des gens or ‘common law of\ncivilisation’ is an extension of the natural law to the\ncircumstances of life in society, and thus it is concerned with human\nbeings as social beings (e.g., as citizens or as members of families).\nThe ‘positive law’ is the system of rules and regulations\ninvolved in assuring general order within a particular society. It\nvaries according to the stage of social or economic development within\nthat community and according to the specific activities of individuals\nwithin it. Neither the positive law nor the droit des gens\nis, however, deducible from the natural law alone. Neither is known\nconnaturally and, therefore, is not part of the natural law.\nNevertheless, it is in virtue of their relation to natural law that\nthey “have the force of law and impose themselves on\nconscience” (Les droits de l’homme, 1942 [1943:\n90–1]). When a positive law acts against the natural law, it is,\nstrictly speaking, not a law. Thus, Maritain clearly rejects legal\npositivism.\n\nThe term ‘natural law’ and its relations both to\n‘eternal law’ and to positive law have, however, been the\nfocus of much controversy. Maritain’s account of natural law\nboth presupposes a metaphysical view of the nature of human beings and\na realistic epistemology, and critics have argued that there are a\nnumber of tensions or inconsistencies internal to it. Some of the\nprincipal criticisms of this account are i) that it is inconsistent\nbecause it sets forth a naturalistic theory of what is good and bad\nand yet claims that only a supernatural sanction will serve to explain\nmoral obligation, ii) that connatural knowledge is not only inadequate\nfor what we normally count as knowledge, but it is, in fact, also\nincapable of establishing that something is a natural moral law, iii)\nthat the first principle of moral law is vacuous, and iv) that\nMaritain glosses over the fact/value distinction.\n\nMaritain held that natural law theory entailed an account of human\nrights. Since the natural end of each person is to achieve moral and\nspiritual perfection, it is necessary to have the means to do so,\ni.e., to have rights which, since they serve to realise his or her\nnature, are called ‘natural’. This respects the\nAristotelian-Thomistic principle of justice, that we should distribute\nto each ‘what is truly his or hers’. Maritain replies to\nthe criticism that there are no such rights, since they are not\nuniversally recognised, by reminding his readers that, just as the\nnatural law comes to be recognised gradually and over time, so also is\nthere a gradual recognition of rights. Indeed, Maritain held that\ncertain basic natural rights can be recognised by all, without there\nhaving to be agreement on their foundation and, as an illustration of\nthis, he pointed to the general agreement on those rights found in the\n1948 United Nations Universal Declaration of Human Rights.\nNevertheless, he did insist that an adequate account of human rights\nrequired a foundation in natural law (see Man and the State,\n1951: Ch. IV)—a position rejected by many authors in the\nAnglo-American tradition, such as Rawls (Clark 2012).\n\nMaritain held that natural rights are fundamental and inalienable, and\nantecedent in nature, and superior, to society. Still, they should not\nbe understood as ‘antecedent’ in a temporal sense and do\nnot form the basis of the state or of the civil law. Rights are\ngrounded in the natural law, and specifically in relation to the\ncommon good. It is this good, and not individual rights, that is the\nbasis of the state, and it is because of this that Maritain held that\nthere can be a hierarchical ordering of these rights (Man and the\nState, 1951: 106–7).\n\nOne consequence of his natural law and natural rights theory is that\nMaritain favoured a democratic and liberal view of the state, and\nargued for a political society that is both personalist, pluralist,\nand Christianly-inspired. He held that the authority to rule derives\nfrom the people—for people have a natural right to govern\nthemselves. Still, this is consistent with a commitment to\nChristianity, Maritain thought, because the ideals of democracy are\nthemselves inspired by a belief in God’s rule, and that the\nprimary source of all authority is God (Man and the State,\n1951: 127).\n\nMaritain also favoured a number of liberal ideals, and the list of\nrights that he recognises extends significantly beyond that found in\nmany liberal theories, and includes the rights of workers as well as\nthose of the human and the civic person. He was, in particular, a\ndefender of freedom of conscience—and not simply freedom of\nreligion or freedom of worship—which he saw as fundamental to\nthe full development of human personality and to the common good of\nsociety (Sweet 2006, Coulter 2012).\n\nFurthermore, the ideal of freedom or liberty to be found in the state\nis close to that which is now generally called positive\nfreedom—i.e., one that reflects a view of the person as sharing\nin a common good. As a polity that attempts to provide the conditions\nfor the realisation of the human person as an individual who is,\nthereby, a member of a temporal community, it recognises that the use\nof goods by individuals must serve the good of all (Integral\nHumanism, 1936 [1968: 184]), and that individuals can be required\nto serve the community. Moreover, in such a state, political leaders\nwould be more than just spokespersons for the people (Man and the\nState, 1951: 140), and Maritain recognises that they can\nrepresent the ‘hidden will’ of the people. Their\naim—and the aim of the state as a whole—is, however,\nalways the common good. Since minorities may themselves reflect this\n‘hidden will’, Maritain also recognised the important role\nto be played by dissenting minorities.\n\n(Maritain does not discuss in any detail how his model\n‘Christian’ polity might be realised, but suggests that it\nis the only one that takes account of each person’s spiritual\nworth and that recognises the importance of providing the means to\nfoster one’s growth as a person. It recognises differences of\nreligious conscience and is, in this way, fundamentally pluralistic.\nSuch a polity, Maritain believed, would exhibit not just tolerance,\nbut friendship and fellowship [see D’Souza 2011, Zunic 2005],\nand would thereby have social cohesion. Whether it would indeed be\nable to accommodate plurality while remaining a unified community has,\nhowever, been a subject of some debate [Armour 2005].)\n\nIn such an ideal polity, Maritain imagines that a leadership role\nwould be played by a multiplicity of ‘civic fraternities’,\nfounded on freedom, inspired by the virtues of Christianity,\nreflecting a moral and spiritual discipline, and which are\nfundamentally democratic. While such groups would not necessarily\nexercise political power, the society as a whole would reflect\nChristian values—not just because these values are part of a\nprivileged religion or faith (a matter that Maritain would be wary\nof), but because these are necessary to the temporal community. In\nsuch a polity one would, of course, find a church and a state, though\nMaritain would see them as cooperative entities, with the state\noccupying itself with those matters that, while focusing on temporal\nconcerns, addressed the needs of the whole of the human person, and\nwith the church focussing on spiritual matters.\n\nIt is, perhaps, evident that such a polity could not survive within a\nsingle nation state that existed among a plurality of states with\ndifferent ideals, and so Maritain supported the ideal of a world\nfederation of political societies (see Goedert 2010). While the\nrealisation of such an ideal was something that lay in a distant\nfuture, Maritain nevertheless thought that such a federation was\npossible, providing that the individual states retained a fair degree\nof autonomy and that persons could be found from each state who would\nvoluntarily distance themselves from the particular interests of their\nhome country.\n\nMaritain had a significant influence in the development of and\nadvocacy for the Universal Declaration of Human Rights, and his\npolitical philosophy had a substantial impact on ‘Christian\nDemocratic’ parties in Western Europe, Chile, and Argentina\n(Saranyana, 1999–2002: 205), as well as on constitutional\nthinking in Latin America and, later, in Canada. His defence of\nnatural rights, developed beginning in the late 1930s and provided in\ndetail in Les droits de l’homme et la loi naturelle\n(1942), was arguably present in the articulation of the American\nDeclaration of the Rights and Duties of Man (adopted by the Ninth\nInternational Conference of American States, in Bogotá,\nColombia, in 1948) that, in turn, influenced several of the members of\nthe Drafting Committee of the UN Commission on Human Rights. Moreover,\nnot only were some of Maritain’s key writings read in advance by\nthe Drafting Committee, but one of its key members, Charles Malik,\nfollowed Maritain’s political thought closely in several\nrespects. It is not surprising, then, that the Declaration has close\nparallels with the rights enumerated earlier in the Les droits de\nl’homme et la loi naturelle, and Maritain was a major\nadvocate for such a text within UNESCO, in 1947–48, before its\nadoption by the UN General Assembly, and also in its later\nadvancement.\n3.6 Aesthetics and Philosophy of Art\n\nMaritain had a long-standing interest in art and the arts. From one of\nhis earliest books, Art et scolastique (1920, Art and\nScholasticism), through work addressing the painter Georges\nRouault and the author, Jean Cocteau (e.g., Art and Faith: Letters\nBetween Jacques Maritain and Jean Cocteau, 1926 [1948]), to\nFrontières de la poésie (1935, Art and\nPoetry), Situation de la poésie (1938, The\nSituation of Poetry), Creative Intuition in Art and\nPoetry (1953) and The Responsibility of the Artist\n(1960), one finds sustained attention given to the topic, and\nreferences to art appear throughout his work, particularly in his\nepistemology. This should be no surprise. Maritain’s wife,\nRaïssa, was a poet, and Maritain counted among his friends and\nacquaintances the artists, Marc Chagall and Georges Rouault, the\nauthors Georges Bernanos, Jean Cocteau, and Julien Green, and the\ncomposer Arthur Lourié.\n\nThe focus of Maritain’s writing is not aesthetic theory or even\naesthetic experience, but art and the nature of beauty. Maritain\nsought to engage the world of the contemporary arts, but he was also\ncritical of much of the aesthetics that was implied by it; he proposed\nto uncover principles of art at a time at which talk of such\nprinciples had already become somewhat suspect. His familiarity with\nthe arts made his work relevant and accessible to those who engaged in\nthem, and although his early work drew from his knowledge of western\nart, in his later work he also wrote about that found in Asian and\nIndian cultures.\n\nOf the arts, poetry is often singled out in Maritain’s\ndiscussions of beauty and contemplation. Yet Maritain’s\ndefinition of ‘poetry’ is unique; it is, he writes,\n“that intercommunication between the inner being things of and\nthe inner being of the human self which is a kind of divination”\n(Creative Intuition, 1953: 3)—though some critics\nremain uncertain of what Maritain means by this. Through poetry, then,\nMaritain held that there can be a contemplation of “the inner\nbeing of things” and, thereby, of beauty (Trapani 2011: 163).\nThus, there is a close relation between the understanding of being in\nphilosophy, and poetry (see Chenet 2012). \n\nA distinctive feature of Maritain’s discussion of art is his\naccount of what art is. For Maritain, art is “a virtue of the\npractical intellect that aims at making” (Art and\nScholasticism, 1920 [1962: 13]; Creative Intuition,\n1953: 49); it is, then, a virtue that is found in artisans and artists\nalike (see Storck 2010). The virtue or habitus of art,\nMaritain writes, is not simply an “interior growth of\nspontaneous life”, but has an intellectual character and\ninvolves cultivation and practice. As a characteristic of the\npractical intellect, art is not a speculative or a theoretical\nactivity; it aims not just at knowing, but at doing. Moreover, it can\nbe taught (Trutty-Coohill 2008). Finally, Maritain writes that the\n‘making’ at which art aims is something that is demanded\nby the end of the activity itself, not the particular interest of the\nartist.\n\nOn Maritain’s view, what distinguishes the fine arts from the\nwork of artisans is that the fine arts are primarily concerned with\nbeauty—i.e., “that which upon being seen pleases”\n(Art and Scholasticism, 1920 [1962: 23]; Creative\nIntuition, 1953: 160); this classical view, again adapted from\nAquinas, runs counter to some of the principal trends in aesthetics\nand art since the eighteenth century. Maritain insisted, however, that\nhis view of the place of beauty in art was more consistent with the\npractice of artistic activity. For example, even though a work of art\nis an end in itself, the general end of art is beauty. Thus, since art\nis a virtue that aims at making, to be an artist requires aiming at\nmaking beautiful things (Art and Scholasticism, 1920 [1962:\n33]).\n\nBeauty can be found in nature as well as in art. While beauty affects\nhuman beings through the senses, and while the awareness of beauty\ndoes not involve abstraction (as does knowledge in the sciences),\nnevertheless, beauty is an object of the intellect. Maritain,\nfollowing Aquinas, says that beauty “delights the\nunderstanding”; the appreciation of art, on the part of the\nspectator, then, involves awakening the intelligence.\n\nArt has both subjective and objective dimensions. The activity of\nartistic creation is clearly something that is carried out by a\nsubject. Moreover, Maritain acknowledges that beauty is\nanalogical—just as ‘good’ is; just as each thing is\ngood in its own way, so each thing is beautiful in its own way. Still,\nbeauty is not something purely subjective or relative.\nBeauty—and, by extension, art—is something that involves\nintegrity, proportion, and splendour or clarity, which are objective\nqualities. More broadly, art has a relation to the world; it can be a\nresponse to the world, but its expression is also determined by the\nworld and by the work itself. (This also serves to put the ambitions\nand pretensions of the artist into perspective.) Finally, beauty and\nart have a connection to the spiritual and spiritual experience\n(Creative Intuition, 1953: 178). As a creative activity, art\nis ultimately dependent upon (and Maritain says that it is\n“ordained to”) the creator and, therefore, its end,\nbeauty, has a relation to the divine and to the transcendentals of\ngoodness, truth, and unity. \n\nA second key feature of Maritain’s views on art is that art is\nrelated to freedom; his views here not only reflect his metaphysics,\nbut bear on his political philosophy. Artistic activity is, for\nMaritain, part of the basic drive in humans to create and make. This\nrequires freedom—and, thus, the artist must be free. Indeed, for\nMaritain, freedom is a fundamental characteristic of the human person.\nBut this freedom is not absolute. Maritain reminds his readers that\nfreedom is not license to do whatever one chooses. Freedom in all its\nforms is ultimately subject to truth and, for the artist, it is also\nsubject to “the spiritual conditions of honest work”\n(Art and Scholasticism, 1920 [1962: 4]). Maritain would say\nthat artistic activity is analogous to divine free creative activity\n(see his letters to Cocteau); it is “the highest natural\nresemblance to God’s activity” (Art and Faith,\n1926 [1948: 89]). \n\nWhile Maritain rejects the subordination of the artist to politics and\nto religious authority, he also denies that artists are answerable\nonly to themselves. The creative self, he writes, “dies to\nitself in order to live in [its] work” (Creative\nIntuition, 1953: 144). Moreover, Maritain writes that art\n‘perfects’ the artist; that by engaging in this activity\nthere is “a perfecting of the spirit” (Art and\nScholasticism, 1920 [1962: 62]). The freedom that Maritain\nascribes to artists, then, is not a lawless freedom.\n\nA third distinctive feature of Maritain’s philosophy of art is\nhis account of artistic (or what he sometimes calls\n‘poetic’) knowledge. Maritain notes the focus on the\nawareness of the self as a characteristic of art from the time of the\nGerman romantics, and he recognises its value so far as it challenges\nthe emphasis by some artists of the 17th century on reason and\nmechanical technique—perhaps having in mind figures such as Paul\nFreart de Chantelou. Artistic knowledge is an instance of what\nMaritain calls, in general, knowledge though connaturality; it is a\nkind of ‘creative intuition’ that arises out of “the\nfree creativity of the spirit” (Creative Intuition,\n1953: 112; Natural Law, 2001: 18; see Bellusci 2013, Klein\n2010). Maritain also describes artistic activity as a “grasping,\nby the poet, of his own subjectivity in order to create”\n(Creative Intuition, 1953: 113). As noted earlier, in the\ndiscussion of Maritain’s epistemology, this knowledge through\nconnaturality is found at the level of the preconscious intellect.\nWhile it is non-conceptual and “obscure” (Creative\nIntuition, 1953: 18; see Natural Law, 2001: 18), it is,\nnevertheless, a knowledge of a “concrete\nreality”—albeit one that “tends and extends to the\ninfinite” (Creative Intuition, 1953: 126). \n\nMaritain’s views on art had a significant influence on a number\nof artists, writers, and composers of his time, not only on his\ninterlocutors. The American writer, Flannery O’Connor; regarded\nArt and Scholasticism as the book that she “cut [her]\naesthetic teeth on” (O’Connor 1979: 216), and the Canadian\nwriter Morley Callaghan commented that, in the early part of the\ntwentieth century, “Christian artists were finding new dignity\nand spiritual adventure” in Maritain’s work (Callaghan\n1963 [2006: 76]). While no longer central in contemporary debate in\naesthetics, Maritain’s views continue to have a broad audience.\n\n4. General Assessment\n\nAt the time of his death, Maritain was arguably the best known\nCatholic philosopher in the world. The breadth of his philosophical\nwork, his influence in the social philosophy of the Catholic Church,\nand his ardent defenses of human rights made him one of the central\nfigures of his times. His writings influenced a range of figures, from\nThomas Merton, Yves Simon, and Gabriel Marcel (with whom, however, he\nwas later estranged), to Saul Alinksy, Martin Luther King, Paul\nMartin, and Eduardo Frei in politics, to artists such as Bernanos,\nJulien Green, and Lourié, and to Popes John XXIII and Paul VI\n(the latter having translated two of Maritain’s books into\nItalian, and who honored Maritain by presenting the “Message to\nMen of Thought and Science” to him at the close of the Second\nVatican Council, in 1965).\n\nMaritain’s philosophical work has been translated into some\ntwenty languages. As is evident from the preceding remarks, it covers\na wide range of areas—though much of it was written for a\ngeneral, rather than a professional academic, audience. Still, some of\nMaritain’s writings are polemical and, because much of his\nconcern (especially in the history of philosophy) was to address very\nspecific philosophical and theological issues of his time, these texts\nmay have a rather dated character.\n\nMaritain’s most enduring legacy is undoubtedly his moral and\npolitical philosophy, and the influence of his work on human rights\ncan be seen, not only in the United Nations Declaration of 1948 but,\nit has been claimed, in a number of national declarations, such as the\nCanadian Charter of Rights and Freedoms and the preamble to the\nConstitution of the Fourth French Republic (1946)—this last was\nlikely a reflection of Maritain’s lengthy correspondence with\nthe French war hero and, later, President, General Charles DeGaulle.\nMaritain’s Christian humanism and personalism have also had a\nsignificant influence in the social encyclicals of Pope Paul VI and in\nthe thought of Pope John Paul II. Interestingly, since the end of the\nCold War, there has been a revival of Maritain’s political ideas\nin Central and Eastern Europe.\n\nTwo other areas in which Maritain’s thought has been influential\nare his aesthetics and his philosophy of education. Although no longer\nas strong as they once were, they were particularly significant in\nLatin America and French-speaking Africa from the 1930s until recent\nyears. Maritain’s work in epistemology, though clearly essential\nto his political and religious thought and to his aesthetics, has not,\nhowever, had the reception Maritain would have held it deserved.\n\nIt is not easy to place Maritain’s work within the history of\nphilosophy in the twentieth century. Clearly, his influence was\nstrongest in those countries where Thomistic philosophy had pride of\nplace. While his political philosophy led him, at least in his time,\nto be considered a liberal and even a social democrat, he eschewed\nsocialism and, in Le paysan de la Garonne, was an early\ncritic of many of the religious reforms that followed the Second\nVatican Council. One can say, then, that he would be considered by\npresent-day liberals as too conservative, and by many conservatives as\ntoo liberal. Again, though generally considered to be a Thomist, the\nextent to which he was is a matter of some debate. Indeed, according\nto Etienne Gilson, Maritain’s ‘Thomism’ was really\nan epistemology and, hence, not a real Thomism at all. There is, not\nsurprisingly, no generally shared view of the precise character of\nMaritain’s philosophy.\n\nMaritain’s work nevertheless remains influential. Since 1958\nthere has been a Jacques Maritain Center at the University of Notre\nDame in the United States, there are journals devoted to his work,\nsuch as Études maritainiennes / Maritain Studies,\nNotes et documents, and the Cahiers Jacques et\nRaïssa Maritain, and there are currently some twenty\nnational associations which meet regularly, in addition to the\nInstitut International Jacques Maritain. The continuity of\ninterest in his thought in the English-speaking world led, in the mid\n1990s, the University of Notre Dame Press to undertake the publication\nof a Collected Works of the English-language editions of\nMaritain’s writings.\n",
    "bibliography": {
        "categories": [
            "Primary Literature: Maritain’s Principal Works",
            "Secondary Literature",
            "Collections"
        ],
        "cat_ref_text": {
            "Primary Literature: Maritain’s Principal Works": [
                "</h3>\n<p>\nA French-language edition of the works of Maritain is available under\nthe title <em>Oeuvres complètes de Jacques et Raïssa\nMaritain</em>, 16 vols., Fribourg (Switzerland): Éditions\nuniversitaires, 1986–2000. Volumes 14 and 15 contain the\nwritings of Raïssa Maritain, and Volume 16 includes previously\nunpublished work. The publication of a 20 volume set, in English, of\n<em>The Collected Works of Jacques Maritain</em> (under the general\neditorship of Ralph McInerny) is currently underway under auspices of\nthe University of Notre Dame Press. Summaries (in Italian) of\nMaritain’s major books are found in <em>Jacques Maritain:\nDizionario delle Opere</em>, by Piero Viotto, Rome: Città\nNuova, 2003. </p>\n<p>\nMaritain’s principal works are listed below in chronological\norder: (Except where indicated otherwise, place of publication is\nParis. English-language editions are noted as well.)</p>\n<ul class=\"hanging\">",
                "1910, “La science moderne et la raison”, <em>Revue de\nPhilosophie</em>, XVI/6 (1910), pp. 575–603. Reprinted\nin <em>Antimoderne</em>, Éditions de la Revue des Jeunes,\n1922.",
                "1914, <em>La Philosophie bergsonienne: études\ncritiques</em>, Marcel Rivière et Cie. [<em>Bergsonian\nPhilosophy and Thomism</em>, New York: Philosophical Library,\n1955.]",
                "1920, <em>Art et scolastique</em>, Librairie de l’Art\nCatholique. (The 1927 edition contains “Frontières de la\npoésie” and important notes.) [<em>Art and Scholasticism\nand The Frontiers of Poetry</em>, Joseph W. Evans (trans.), New York:\nCharles Scribner’s Sons, 1962.]",
                "1920, <em>Éléments de Philosophie I: Introduction\ngénérale à la philosophie</em>, Téqui.\n[<em>An Introduction to Philosophy</em>, E. I. Watkin (trans.),\nLondon: Sheed and Ward, 1944.]",
                "1921, <em>Théonas ou les entretiens d’un sage et deux\nphilosophes sur diverses matières inégalement\nactuelles</em>, First publication in the <em>Revue Universelle</em>,\nApril 1920 to April 1921, 1st edition, Nouvelle Librairie Nationale,\n1921; 2<sup>nd</sup> edition, corrected, 1925. [<em>Theonas:\nConversations of a Sage</em>, F.J. Sheed (trans.), London: Sheed and\nWard, 1933.]",
                "1922, <em>Antimoderne</em>, Éditions de la Revue des\nJeunes.",
                "1922, <em>De la vie d’oraison</em>, 1st edition privately\nprinted, Saint-Maurice d’Augaune; 2<sup>nd</sup> edition\nrevised, l’Art Catholique, 1925. [with Raïssa Maritain]\n[<em>Prayer and intelligence</em>, New York: P. J. Kennedy,\n1928.]",
                "1923, <em>Éléments de philosophie II: L’ordre\ndes concepts, I — Petite logique (Logique formelle)</em>.\nTéqui. [<em>An Introduction to Logic</em>, New York: Sheed and\nWard, 1937a; <em>Formal Logic</em>, Imelda Choquette (trans.), New\nYork: Sheed and Ward, 1937b.]",
                "1924, <em>Réflexions sur l’intelligence\net sur sa vie propre</em>, Bibliothèque français de\nphilosophie, Nouvelle Librairie Nationale; Desclée, 1938.",
                "1925, <em>Trois Réformateurs: Luther, Descartes,\nRousseau</em>, Librairie Plon. [<em>Three Reformers: Luther,\nDescartes, Rousseau</em>, New York: Charles Scribner’s Sons,\n1929.]",
                "1926, <em>Georges Rouault, peintre et lithographe</em>,\nÉditions Polyglotte, Frapier. [<em>Georges Rouault</em>, New\nYork: Harry N. Abrams, Inc., in association with Pocket Books, Inc.,\n1954.]",
                "1926, <em>Reponse à Jean Cocteau</em>, Librairie Stock.\n[<em>Art and Faith: Letters between Jacques Maritain and Jean\nCocteau</em>, New York: Philosophical Library, 1948.]",
                "1926, <em>Une opinion sur Charles Maurras et le devoir des\ncatholiques</em>, Plon.",
                "1927, <em>Primauté du spirituel</em>, Plon. [<em>The Things\nThat Are Not Caesar’s</em>, J.F. Scanlan (trans.), New York:\nCharles Scribner’s Sons, 1930.]",
                "1927, <em>Quelques pages sur Léon Bloy. Cahiers de la\nQuinzaine</em>, 10e de la 18 serie, á l’Action du\nLivre.",
                "1929, <em>Clairvoyance de Rome par les auteurs du ‘Pourquoi\nRome a parlé’. (J. Maritain et D. Lallement)</em>,\nÉditions Spes.",
                "1930, <em>Le Docteur angélique</em>, Desclée de\nBrouwer. [<em>St. Thomas Aquinas: Angels of the Schools</em>, J.F.\nScanlan (trans.), London: Sheed and Ward, 1931; Translation revised by\nPeter O’ Reilly and Joseph W. Evans, New York: Meridian Books,\n1958.]",
                "1930, <em>Religion et culture. dition originale: premier\nnuméro de la collection des questions disputées</em>,\nDesclée de Brouwer. 2<sup>nd</sup> edition, with a preface,\n1946. [<em>Religion and Culture</em>, London: Sheed and Ward,\n1931.]",
                "1932, <em>Distinguer pour unir; ou, les degrés du\nsavoir</em>, Desclée de Brouwer. Eighth edition, 1963.\n[<em>Distinguish to Unite: or, The Degrees of Knowledge</em>,\nTranslated under the supervision of G.B. Phelan. New York: Charles\nScribner’s Sons, 1959.]",
                "1932, <em>Le songe de Descartes</em>, Correa. [<em>The Dream of\nDescartes</em>, Mabelle L. Andison (trans.), New York: Philosophical\nLibrary, 1944.]",
                "1933, <em>Du regime temporel et de la liberté</em>,\nDesclée de Brouwer. [<em>Freedom in the modern world</em>,\nRichard O’Sullivan (trans.), London: Sheed &amp; Ward,\n1935.]",
                "1933, <em>De la philosophie chrétienne</em>,\n[“Questions disputées”, Vol. IX], Desclée de\nBrouwer. [<em>An Essay on Christian Philosophy</em>, Edward H.\nFlannery (trans.), New York, Philosophical Library, 1955.]",
                "1934, <em>Sept leçons sur l’être et les\npremiers principes de la raison spéculative</em>, Téqui.\n[<em>A Preface to Metaphysics: Seven Lectures on Being</em>, New York\nand London: Sheed and Ward, 1939.]",
                "1935, <em>Frontières de la poésie</em>, Louis Rouart\net fils. [<em>Art and Poetry</em>, E. de P. Matthews (trans.), New\nYork: Philosophical Library, 1943.]",
                "1935, <em>Science et sagesse, suivi\nd’éclaircissements sur ses frontières et son\nobjet</em>, “Cours et documents de Philosophie”,\nTéqui. [<em>Science and Wisdom</em>, New York: Charles\nScribner’s Sons, 1940.]",
                "1935, <em>Lettre sur l’indépendance</em>,\nDesclée de Brouwer.",
                "1935, <em>La philosophie de la nature, essai critique sur ses\nfrontières et son objet</em>, Téqui. [<em>Philosophy of\nNature</em>, Imelda C. Byrne (trans.), New York: Philosophical\nLibrary, 1951]",
                "1936, <em>Humanisme intégral: problemes temporels et\nspirituals d’une nouvelle chrétienté</em>, Fernand\nAubier. Two translations: <em>True humanism</em>, M.R. Adamson\n(trans.), London: Bles, 1938; <em>Integral Humanism: Temporal and\nSpiritual Problems of a New Christendom</em>, Joseph W. Evans\n(trans.), New York: Charles Scribner’s Sons, 1968.]",
                "1938, <em>Situation de la poésie</em>, Desclée de\nBrouwer. [with Raïssa Maritain] [<em>The Situation of\nPoetry</em>, Marshall Suther (trans.), New York: Philosophical\nLibrary, 1955.]",
                "1938, <em>Les Juifs parmi les nations</em>, Éditions du\nCerf. [<em>A Christian Look at the Jewish Question</em>, New York:\nLongmans, Green, 1939.]",
                "1938, <em>Questions de conscience</em>, [“Questions\ndisputées”, Vol. XXI] 2nd edition. Desclée de\nBrouwer.",
                "1939, <em>Quatre essais sur l’esprit dans sa condition\ncharnelle</em>, Bibliothèque français de philosophie,\nDesclée de Brouwer. Nouvelle Édition revue, Alsatia,\n1956.",
                "1939, <em>Antisemitism</em>, London, G. Bles.",
                "1940, <em>De la justice politique, notes sur la presente\nguerre</em>, Collection “Presences”, Plon.",
                "1940, <em>Scholasticism and Politics</em>, New York: The Macmillan\nCompany. [with Mortimer Jerome Adler]",
                "1941, <em>A travers le désastre</em>, New York:\nÉditions de la Maison française. [<em>France, My\nCountry, Through the Disaster</em>, New York: Longmans, Green,\n1941.]",
                "1941, <em>La pensée de Saint Paul, textes choisis et\nprésentés</em>, New York: Éditions de la Maison\nfrançaise. [<em>The Living Thoughts of Saint Paul</em>, Harry\nLorin Binsse (trans.), New York: Longmans, Green, 1941.]",
                "1941, <em>Ransoming the Time</em>, New York: Charles\nScribner’s Sons, Harry Lorin Binsse (trans.) [A translation of\nessays written in French, but not collected in a single volume.]",
                "1941, <em>Confession de foi</em>, New York: Éditions de la\nMaison française. [French translation of an essay published in\n<em>I Believe</em>, Clifton Fadiman (ed.), London: Allen and Unwin,\n1940.]",
                "1941, <em>Le Crépuscule de la civilisation</em>,\nMontréal: Éditions de l’Arbre. [<em>The Twilight\nof Civilization</em>, London: Sheed and Ward, 1946.]",
                "1941, “The immortality of man”, <em>The Review of\nPolitics</em>, 3(4): 411. Reprinted in <em>Man’s destiny in\neternity</em>, Boston: Beacon Press, chapter 2, 1949.\ndoi:10.1017/S0034670500002023",
                "1942, <em>Les droits de l’homme et la loi naturelle</em>,\nNew York: Éditions de la Maison française. [<em>The\nRights of Man and Natural Law</em>, Doris C. Anson (trans.), New York:\nCharles Scribner’s Sons, 1943.]",
                "1942, <em>Saint Thomas and the problem of evil</em>, Mrs. Gordon\nAndison [Mabelle L. Andison] (trans.), Milwaukee: Marquette University\nPress.",
                "1943, <em>Christianisme et Démocratie</em>, New York:\nÉditions de la Maison française. [<em>Christianity and\nDemocracy</em>, . Doris C. Anson (trans.), New York: Charles\nScribner’s Sons, 1944.]",
                "1943, <em>Sort de l’homme</em>, Neuchâtel:\nÉditions de La Baconnière.",
                "1943, <em>Education at the Crossroads</em>, New Haven: Yale\nUniversity Press. [<em>L’éducation à la\ncroisée des chemins</em>, Egloff, 1947; republished, with\nadditional material, as <em>Pour une philosophie de\nl’education</em>, Arthème Fayard, 1959. Nouvelle\nédition, 1969.]",
                "1944, <em>Principes d’une politique humaniste</em>, New\nYork: Éditions de la maison française.",
                "1944, <em>De Bergson à Thomas d’Aquin, essais de\nmétaphysique et de morale</em>, New York: Éditions de la\nMaison française. Hartmann, 1947.",
                "1945, <em>A travers la victoire</em>, Hartmann.",
                "1945, <em>Messages 1941–1944</em>, New York: Éditions\nde la Maison française; Hartmann.",
                "1945, <em>Pour la justice</em>, New York: Éditions de la\nMaison française.",
                "1947, <em>Court traité de l’existence et de\nl’existant</em>, Hartmann. [<em>Existence and the Existent</em>,\nLewis Galantière and Gerald B. Phelan (trans.), New York:\nPantheon Books, 1948.]",
                "1947, <em>La personne et le bien commun</em>, Desclée de\nBrouwer. [<em>The Person and the Common Good</em>, John J. Fitzgerald\n(trans.), New York: Charles Scribner’s Sons, 1947.]",
                "1948, <em>Art and faith</em>, New York, Philosophical Library.\n[see <em>Réponse a Jean Cocteau</em>, 1933.]",
                "1948, <em>Raison et raisons, essais détachés</em>,\nEgloff. [<em>The Range of Reason</em>, New York: Charles\nScribner’s Sons, 1952.]",
                "1949, <em>La signification de l’athéisme\ncontemporain</em>, Collection “Courier de Iles”,\nDesclée de Brouwer.",
                "1949, <em>Etienne Gilson, philosophe de la\nchrétienté</em>, Cerf.",
                "1951, <em>Man and the State</em>, Chicago: University of Chicago\nPress. [<em>L’Homme et L’État</em>, Translated into\nFrench by Robert and France Duval, Presses Universitaires de France,\n1953.]",
                "1951, <em>Lettres inédites sur l’inquiétude\nmoderne</em>, Éditions universelles. [with René\nSchwob]",
                "1951, <em>Neuf leçons sur les notions premières de\nla philosophie morale</em>, “Cours et documents de\nphilosophie”, Téqui. [<em>An Introduction to Basic\nProblems of Moral Philosophy</em>, Albany, N.Y.: Magi Books,\n1990.]",
                "1953, <em>Approches de Dieu</em>, Collection “Sagesse et\ncultures”, Alsatia; in <em>Oeuvres complètes de Jacques\net Raïssa Maritain</em>, Vol. X, Fribourg: Editions\nUniversitaires; Paris: Editions Saint-Paul, 1985); [<em>Approaches to\nGod</em>, Peter O’Reilly (trans.), New York: Harper and\nBrothers, 1954.]",
                "1953, <em>Creative Intuition in Art and Poetry</em>, New York:\nPantheon Books. [<em>L’Intuition créatrice dans\nl’art et dans la poésie</em>, Desclée de Brouwer,\n1966.]",
                "1957, <em>On the Philosophy of History</em>, New York: Charles\nScribner’s Sons. [<em>Pour une philosophie de\nl’histoire</em>, Mgr Charles Journet (trans.), Éditions\ndu Seuil, 1959.]",
                "1958, <em>Reflections on America</em>, New York: Charles\nScribner’s Sons. [<em>Réflexions sur\nl’Amérique</em>, Fayard, 1959.]",
                "1959, <em>Pour une philosophie de l’éducation</em>,\nFayard.",
                "1960, <em>Liturgy and contemplation</em>, London: G. Chapman.\n[with Raïssa Maritain]",
                "1960, <em>The Responsibility of the Artist</em>, New York: Charles\nScribner’s Sons. [<em>La responsabilité de\nl’artiste</em>, Georges and Christianne Brazzola (trans.),\nFayard, 1961.]",
                "1960, <em>Le philosophe dans la cité</em>, Alsatia.",
                "1960, <em>La philosophie morale. I. Examen historique et critique\ndes grands systemes</em>, Gallimard, Bibliothèque de\nIdées. [<em>Moral Philosophy</em>, Joseph W. Evans (ed.),\nLondon: G. Bles, 1964.]",
                "1961, <em>On the use of philosophy; three essays</em>, Princeton,\nN.J.: Princeton University Press.",
                "1963, <em>Dieu et la permission du mal</em>, Desclée de\nBrouwer. [<em>God and the Permission of Evil</em>, Milwaukee: The\nBruce Publishing Co., 1966.]",
                "1965, <em>Carnet de notes</em>, Desclée de Brouwer.\n[<em>Notebooks</em>, Joseph W. Evans (trans.), Albany: Magi Books/\nNotre Dame, IN: University of Notre Dame Press, 1984.]",
                "1965, <em>Le mystère d’Israël et autres\nessais</em>, Desclée de Brouwer.",
                "1967, <em>The Education of Man</em>, Donald and Idella Gallagher\n(eds), New York: Doubleday and Co.",
                "1967, <em>Le paysan de la Garonne: Une vieux laïc\ns’interroge à propos du temps présent</em>,\nDesclée de Brouwer. [<em>The Peasant of the Garonne: An Old\nLayman Questions Himself about the Present Time</em>, Micheal Cuddihy\nand Elizabeth Hughes (trans.), New York: Holt, Rinehart, and Winston,\n1968.]",
                "1967, <em>De la grâce et de l’humanité de\nJésus</em>, Bruges: Desclée de Brouwer. [<em>On the\nGrace and Humanity of Jesus</em>, Joseph W. Evans (trans.), New York:\nHerder and Herder, 1969.]",
                "1970, <em>De l’église du Christ, la personne de\nl’Église et son personnel</em>, Desclée de\nBrouwer. [<em>On the Church of Christ: The Person of the Church and\nHer Personnel</em>, Joseph W. Evans (trans.), Notre Dame, IN:\nUniversity of Notre Dame Press, 1973.]",
                "1973, <em>Approches sans entraves</em>, Librairie Arthème\nFayard.",
                "1973, <em>Jacques Maritain, Emmanuel Mounier (1929–1939):\n[Correspondance]</em>, Desclée de Brouwer.",
                "1979, <em>Une grande amitié: correspondance,\n1926–1972 / Julien Green et Jacques Maritain</em>,\nPrésentée et annotée par Jean-Pierre Piriou.\nPrécédée de <em>Jacques Maritain vivant</em> de\nJulien Green. Plon. [<em>The story of two souls: the correspondence of\nJacques Maritain and Julien Green</em>, Henry Bars and Eric Jourdan\n(eds), translated with an introduction and revised notes by Bernard\nDoering, New York: Fordham University Press, 1988.]",
                "1986, <em>La loi naturelle ou loi non écrite: texte\ninédit, établi par Georges Brazzola</em>, Fribourg,\nSuisse: Éditions universitaires. [<em>Lectures on Natural\nLaw</em>, William Sweet (trans.), in <em>The Collected Works of\nJacques Maritain</em>, vol. 6, Notre Dame, IN: University of Notre\nDame Press, (forthcoming).]",
                "1992, <em>Exiles and fugitives: the letters of Jacques and\nRaïssa Maritain, Allen Tate, and Caroline Gordon</em>, John M.\nDunaway (ed.), Baton Rouge: Louisiana State University Press.",
                "1993, <em>L’Europe et l’idée\nfédérale:</em> textes publiés par le Cercle\nd’études Jacques et Raïssa Maritain. Mame.",
                "2001, <em>Natural Law: reflections on theory and practice</em>\n(edited with Introductions and notes, by William Sweet), South Bend,\nIN: St Augustine’s Press [distributed by University of Chicago\nPress]; Second printing, corrected, 2003.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<p>\nThough now dated, the most comprehensive list of studies of\nMaritain’s work is found in Jean-Louis Allard and Pierre\nGermain, <em>Répertoire bibliographique sur la vie et\nl’oeuvre de Jacques et Raïssa Maritain</em>, Ottawa, 1994,\n232 p. </p>\n<ul class=\"hanging\">",
                "Acevedo, Alma, 2012, “Personalist Business Ethics and\nHumanistic Management: Insights from Jacques Maritain”, <em>\nJournal of Business Ethics</em>, 105(2): 197–219.\ndoi:10.1007/s10551-011-0959-x",
                "Allard, Jean-Louis, 1978, <em>L’éducation à la\nliberté ou la philosophie de l’éducation de\nJacques Maritain</em>, Ottawa: Éditions de\nl’Université d’Ottawa.",
                "–––, 1982, <em>Education for Freedom: The\nPhilosophy of Education of Jacques Maritain</em>, Notre Dame, IN:\nUniversity of Notre Dame Press.",
                "–––, 1985, <em>Jacques Maritain, Philosophe dans\nla cité/ A Philosopher in the World</em>, Ottawa: University of\nOttawa Press.",
                "American Maritain Association, 1981, <em>Selected Papers from the\nConference-Seminar on Jacques Maritain’s The Degrees of\nKnowledge</em>, St. Louis, MO: American Maritain Association.",
                "Armour, Leslie, 2005, “Escaping Determinate Being: The\nPolitical Metaphysics of Jacques Maritain and Charles de\nKoninck”, <em>Études Maritainiennes—Maritain\nStudies</em>, 21: 61–96.",
                "Arraj, James, 2006, “Maritain’s Lost Sequel to <em>The\nDegrees of Knowledge</em> and the Future of Thomism”,\n<em>Gregorianum</em>, 87(3): 544–556.",
                "Barré, Jean-Luc, 1996 [2005], <em>Jacques et Raïssa\nMaritain, les Mendiants du Ciel</em>, Paris: Stock. English\ntranslation: <em>Jacques &amp; Raïssa Maritain: Beggars for\nHeaven</em>, Bernard E. Doering (trans.), Notre Dame: University of\nNotre Dame Press, 2005.",
                "Barreira, Marcelo Martins, 2008, “A função do\nEntendimento e da Vontade na Contemplação\nMística: Sobre o paralelismo entre João da Cruz e\nTomás de Aquino”, <em>Revista Portuguesa de\nFilosofia</em>, 64(1): 545–557.",
                "Bars, Henry, 1959, <em>Maritain en notre temps</em>, Paris:\nBernard Grasset.",
                "Bellusci, David, 2013, “Jacques Maritain and Poetic\nIntuition”, <em>Maritain Studies / Etudes maritainiennes</em>,\n29: 40–52.",
                "Boas, George, 1952, “Review of <em>The Philosophy of\nNature</em>”, <em>The Journal of Philosophy</em>, 49(7):\n247–252. doi:10.2307/2021495",
                "Bonaventure of Bagnoregio, St., 1259 [1938, 2002], <em>Itinerarium\nMentis in Deum</em> [<em>Tria opuscula Seraphici Doctoris\nS. Bonaventurae. Breviloquium, Itinerarium mentis in Deum, et De\nreductione artium ad theologiam</em>, The Fathers of the Collegii\nS. Bonaventura (eds.), Florence: Quaracchi, 1938; <em>Journey of the\nSoul into God</em>, Zachary Hayes, OFM, and Philotheus Boehner, OFM\n(trans.), St. Bonaventure, NY, Franciscan Institute Publications,\n2002.",
                "Caldera, Rafael-Tomás, 1980, <em>Le jugement par\ninclination chez Saint Thomas d’Aquin</em>, Paris: Vrin.",
                "Callaghan, Morley, 1963, <em>That Summer in Paris; Memories of\nTangled Friendships with Hemingway, Fitzgerald, and Some Others</em>,\nNew York,: Coward-McCann. Toronto: Exile Editions, 2006.",
                "Campana, Gilberto, 2002, “Un testo di Maritain su\nSpinoza”, <em>Aquinas</em>, 45(1): 105–133.",
                "Carlson, John W., 2012, <em>Understanding Our Being</em>,\nWashington: Catholic University of America Press.",
                "Chenaux, Philippe, 1999, <em>Entre Maurras et Maritain, Une\ngénération intellectuelle catholique\n(1920–1930)</em>, Paris: Cerf.",
                "Chenet, François, 2012, “Métaphysique et\npoésie: une admirable <em>concordia discors</em>?”,\n<em>Revue Philosophique de la France et de l’Etranger</em>,\n202(1): 15–28.",
                "Clark, Meghan J., 2012, “Reasoned Agreement versus Practical\nReasonableness: Grounding Human Rights in Maritain and Rawls”,\n<em>Heythrop Journal</em>, 53(4): 637–648.\ndoi:10.1111/j.1468-2265.2009.00557.x",
                "Contat, Alain, 2008, “Le figure della differenza ontologica\nnel tomismo del Novecento (seconda parte)”, <em>Alpha Omega:\nRivista di Filosofia e Teologia dell’Ateneo Pontificio Regina\nApostolorum </em>, 11(2): 213–250.",
                "Compagnon, Olivier, 2003, <em>Jacques Maritain et\nl’Amérique du Sud. Le modèle malgré\nlui</em>, Villeneuve d’Ascq: Presses universitaires du\nSeptentrion.",
                "Coulter, Gregory J., 2012, “Maritain on tolerance and\nreligion”, <em>Science et esprit</em>, 64(2):\n217–227.",
                "Croteau, Jacques, 1950, <em>Les fondements thomistes du\npersonnalisme de Maritain</em>, Ottawa: Éditions de\nl’Université d’Ottawa.",
                "D’Souza, Mario, 2000, “Intellectual Unity,\nIntellectual Virtues, and Intellectual Culture”,\n<em>Études Maritainiennes—Maritain Studies</em>, 16:\n59–70.",
                "–––, 2008, “The Person, Natural Law, and\nthe Good of Pluralist Societies: Some Thoughts from Maritain’s\nPolitical Philosophy”, <em>Maritain Studies / Etudes\nmaritainiennes</em>, 24: 3–18.",
                "–––, 2011, “Being, Becoming, and the\nPhilosophical Transformation of the Self”, <em>Philosophy,\nCulture, and Traditions</em>, 7: 51–61.",
                "Daly, Mary F., 1966, <em>Natural Knowledge of God in the\nPhilosophy of Jacques Maritain</em>, Rome: Officium Libri\nCatholici-Catholic Book Agency.",
                "Daujat, Jean, 1978, <em>Maritain: Un maître pour notre\ntemps</em>, Paris: Téqui.",
                "De Tavernier, Johan, 2009, “The Historical Roots of\nPersonalism: From Renouvier’s Le Personnalisme, Mounier’s\nManifeste au service du personnalisme and Maritain’s Humanisme\nintégral to Janssens’ Personne et\nSociété”, <em>Ethical Perspectives: Journal of the\nEuropean Ethics Network</em>, 16(3): 361–392.",
                "Deely, John, 1997, “Quid Sit Postmodernismus?”,, in\n<em>Postmodernism and Christian Philosophy</em>, Roman T. Ciapalo\n(ed.), Washington, DC: Catholic University of America Press/American\nMaritain Association, pp. 68–96.",
                "Delfino, Robert A., 2002, “Mystical Theology in Aquinas and\nMaritain” in Ollivant 2002: 253–268.\n [<a href=\"https://maritain.nd.edu/ama/Many/Many301.pdf\" target=\"other\">Delfino 2002 available online (pdf)</a>]",
                "Dennehy, Raymond 2003, “Maritain’s Reply to\nGilson’s Rejection of Critical Realism”, in <em>A\nThomistic Tapestry: Essays in Memory of Etienne Gilson</em>, Peter A.\nRedpath (ed.), New York: Rodopi, pp. 57–80.",
                "Dewan, Lawrence, 2009, “St. Thomas and the Perennial Need\nfor Renewal in Metaphysics”, <em>Science et esprit</em>, 61(1):\n5–17.",
                "–––, 2010, “The Foundations of Human\nRights”, <em>Science et esprit</em>, 62(2–3):\n227–236.",
                "DiJoseph, John, 1996, <em>Jacques Maritain and the Moral\nFoundation of Democracy</em>, Lanham, MD: Rowman &amp;\nLittlefield.",
                "Doering, Bernard, 1983, <em>Jacques Maritain and the French\nCatholic Intellectuals</em>, Notre Dame, IN: University of Notre Dame\nPress.",
                "––– (ed.), 1994, <em>The Philosopher and the\nProvocateur: The Correspondence of Jacques Maritain and Saul\nAlinsky</em>, Notre Dame, IN: University of Notre Dame Press.",
                "Dougherty, Jude P., 2003, <em>Jacques Maritain: An Intellectual\nProfile</em>, Washington DC, Catholic University of America\nPress.",
                "Doyle, Dominic, 2009, “Retrieving the Hope of Christian\nHumanism: A Thomistic Reflection on Charles Taylor and Nicholas\nBoyle”, <em>Gregorianum</em>, 90(4): 699–722.",
                "Dunaway, John M., 1978, <em>Jacques Maritain</em>, Boston: Twayne\nPublishers.",
                "Eco, Umberto, 1961, <em>Storiografia Medievale ed Estetica Teorica\nAppunti Metodologici su Jacques Maritain</em>, Turin: Edizioni di\n“Filosofia”.",
                "Evans, Joseph W. (ed.), 1963, <em>Jacques Maritain: The Man and\nHis Achievement</em>, New York: Sheed and Ward.",
                "–––, 1973, “Jacques Maritain\n(1882–1973): A Biographical Memoir”, <em>Proceedings of\nthe National Academy of Education</em>, 5: 92–127.",
                "Fallon, Robert, 2002, “Composing Subjectivity:\nMaritain’s Poetic Knowledge in Stravinsky and Messiaen”,\nin Ollivant 2002: 284–302.\n [<a href=\"https://maritain.nd.edu/ama/Many/Many304.pdf\" target=\"other\">Fallon 2002 available online (pdf)</a>]",
                "Fecher, Charles A., 1953, <em>The Philosophy of Jacques\nMaritain</em>, Westminster, MD: Newman Press.",
                "FitzGerald, Desmond J. “Maritain and Gilson on\nPainting”, in <em>Beauty, Art, and the Polis</em>, Alice Ramos\n(ed.), Washington, DC: Catholic University of America Press, 2000, pp.\n190–199.",
                "Floucat, Yves, 1983, <em>Pour une philosophie chrétienne:\néléments d’un débat fondamental</em>,\nParis: Téqui.",
                "–––, 1996, <em>Jacques Maritain ou la\nfidélité à l’éternel</em>, Paris:\nFAC Editions.",
                "Fornasier, Roberto, 2010, <em>Jacques Maritain ambasciatore. La\nFrancia, la Santa Sede e i problemi del dopoguerra</em>, Roma:\nEdizioni Studium.",
                "Gallagher, Donald and Idella Gallager, 1962, <em>The Achievement\nof Jacques and Raissa Maritain: A Bibliography</em>, New York:\nDoubleday and Co..",
                "Goedert, Georges, 2010, “Die Idee einer politischen\nWelteinheit: ein philosophisches Projekt von Jacques Maritain”,\n<em>Perspektiven der Philosophie, Neues Jahrbuch</em>, 36:\n277–304.",
                "Gwozdz, Thomas L., 2010, “Young and Restless: Jacques\nMaritain and Henri Bergson”, <em>American Catholic Philosophical\nQuarterly</em>, 84(3): 549–564. doi:10.5840/acpq201084336",
                "Hubert, Bernard and Yves Floucat (eds), 1991, <em>Jacques Maritain\net ses contemporains</em>, Paris: Desclée.",
                "Hudson, Deal W. and Matthew J. Mancini (eds), 1987,\n<em>Understanding Maritain: Philosopher and Friend</em>, Macon, GA:\nMercer University Press.",
                "Institut International Jacques Maritain, 1984, <em>Droits des\npeuples, Droits de l’homme</em>, Paris: Éditions du\nCenturion.",
                "Jimenez Berguecio, Julio, S.J., 1948, <em>La ortodoxia de Jacques\nMaritain, ante un ataque recente</em>, Talca, Chile: Libreria\nCervantes.",
                "Jung, Hwa Yol, 1960, <em>The Foundation of Jacques\nMaritain’s Political Philosophy</em>, Gainesville, FL:\nUniversity of Florida Press.",
                "Killoran, John, 2000, “Approaches to Wisdom: Newman and\nMaritain on the University”, <em>Études\nMaritainiennes—Maritain Studies</em>, 16: 131–144",
                "Kinsella, Noel A., 2012, “Le service public dans ses pas:\nConsidérations philosophiques sur la foi et le service\npublic”, <em>Science et esprit</em>, 64(2): 143–156.",
                "Klassen, David J., 2011, “Integral Humanism or Exclusive\nHumanism? Reconsidering Maritain’s Political Philosophy”,\n<em>Philosophy, Culture, and Traditions</em>, 7: 87–101.",
                "Klein, Terrance W., 2010, “The Art of Knowing”,\n<em>Heythrop Journal</em>, 51(1): 60–72.\ndoi:10.1111/j.1468-2265.2009.00535.x",
                "Knasas, John F.X. (ed.), 1988, <em>Jacques Maritain: The Man and\nhis Metaphysics</em>, (<em>Maritain Studies / Études\nmaritainiennes</em>, 4), Mishawaka, IN: American Maritain\nAssociation.",
                "–––, 1992, “Gilson vs. Maritain: The Start\nof Thomistic Metaphysics”, <em>The Future of Thomism</em>, Deal\nHudson and Dennis Moran (eds.), Mishawaka, IN: American Maritain\nAssociation/Notre Dame, IN: University of Notre Dame Press.",
                "Kraal, Anders, 2013, “The Emergence of Logical Formalization\nin the Philosophy of Religion: Genesis, Crisis, and\nRehabilitation”, <em>History and Philosophy of Logic</em>,\n34(4): 351–366. doi:10.1080/01445340.2013.808805",
                "Lardinois, Roland, 2017, <em>Scholars and Prophets: Sociology of\nIndia from France in the 19th-20th Centuries</em>, London:\nRoutledge.",
                "Malquori, Diego, 2009, “Science et philosophie: Sobre la\nconcepció epistemològica de Jacques Maritain”,\n<em>Comprendre: Revista Catalana de Filosofia</em>, 11(1):\n31–45.\n [<a href=\"http://www.raco.cat/index.php/Comprendre/article/view/140841\" target=\"other\">Malquori 2009 available online</a>]",
                "Mathias, R., 2001, “Exploring the New Classicism:\nReflections on Stravinsky and Maritain c. 1920–1940”,\n<em>Études Maritainiennes—Maritain Studies</em>, 17\n(2001): 79–86.",
                "McCool, Gerald A., 1989, <em>Nineteenth-century Scholasticism: The\nSearch for a Unitary Method</em>, New York: Fordham University\nPress.",
                "McInerny, Ralph, 1988, <em>Art and Prudence: Studies in the\nThought of Jacques Maritain</em>, Notre Dame, IN: University of Notre\nDame Press.",
                "–––, 2003, <em>The Very Rich Hours of Jacques\nMaritain</em>, Notre Dame, IN: University of Notre Dame Press.",
                "Michener, Norah Willis, 1955, <em>Maritain on the Nature of Man in\na Christian Democracy</em>, Hull (Canada): Éditions\n“L’Eclair”.",
                "Minkiel, Stephen J., C.M. (ed.), 1981, <em>Jacques Maritain: The\nMan for Our Times</em>, Erie, PA: Gannon University Press.",
                "Muñoz, Ceferino P.D., 2012, “En torno a dos lecturas\nposibles sobre el conocimiento de las esencias en Tomas de\nAquino”, <em>Topicos: Revista de Filosofia (Mexico)</em>, 43:\n123–151.",
                "Nelson, Ralph C., 2007, <em>Two Masters, Two Perspectives:\nMaritain and Gilson on the Philosophy of Nature</em>, Washington DC:\nCatholic University of America Press.",
                "Nielsen, Kai, 1959 [1991], “An Examination of the Thomistic\nTheory of Natural [Moral] Law”, <em>Natural Law Forum</em>,\npaper 39, 4: 44–71; reprinted in his <em>God and the Grounding\nof Morality</em>, Ottawa, ON: University of Ottawa Press, 1991, ch. 3,\npp. 41–68.\n [<a href=\"https://scholarship.law.nd.edu/nd_naturallaw_forum/39/\" target=\"other\">Nielsen 1959 available online</a>]",
                "Nottingham, William J., 1968, <em>Christian Faith and Secular\nAction: An Introduction to the Life and Thought of Jacques\nMaritain</em>, St. Louis, MO: The Bethany Press.",
                "O’Connor, Flannery, 1979, <em>The Habit of Being:\nLetters</em>, New York: Farrar, Straus, and Giroux.",
                "Ollivant, Douglas A. (ed.), 2002, <em>Jacques Maritain and the\nMany Ways of Knowing</em>, Washington DC: Catholic University of\nAmerica Press.\n [<a href=\"https://maritain.nd.edu/ama/Many/\" target=\"other\">Ollivant 2002 available online</a>]",
                "Papini, Roberto (ed.), 1978, <em>Jacques Maritain e la\nSocietà Contemporanea</em>, Milan: Massimo.",
                "––– (ed.), 1981, <em>L’Apporto del\nPersonalismo alla Costruzione dell’ Europa</em>, Milan:\nMassimo.",
                "Possenti, Vittorio (ed.), 1978, <em>Maritain e Marx</em>, Milan:\nMassimo.",
                "––– (ed.), 1983, <em>Jacques Maritain:\nOggi</em>, Milan: Vita e Pensiero.",
                "–––, 1985, “Philosophie du droit et loi\nnaturelle selon Jacques Maritain”, in <em>Jacques Maritain:\nphilosophe dans la cité / a philosopher in the world</em>,\nJean-Louis Allard (ed.), Ottawa: University of Ottawa Press, pp.\n313–326.",
                "Possenti Ghiglia, Nora, 2000 [2006], <em>I tre Maritain. La\npresenza di Vera nel mondo di Jacques e Raïssa</em>, Milano:\nÀncora. French translation: <em>Les trois Maritain: La\nprésence de Véra dans le monde de Jacques et\nRaïssa</em>, René Mougel and Dominique Mougel (trans.),\nParole et Silence, 2006.",
                "Prouvost, Géry, 1991a, <em>Catholicité de\nl’intelligence métaphysique: La philosophie dans la foi\nselon Jacques Maritain</em>, Paris: Pierre Téqui.",
                "–––, 1991b, <em>Étienne Gilson-Jacques\nMaritain: Correspondance 1923–1971</em>, Paris: Librairie\nPhilosophique J. Vrin.",
                "Ramsey, Paul, 1962, <em>Nine Modern Moralists</em>, Englewood\nCliffs, NJ: Prentice-Hall.",
                "Redpath, Peter A. (ed.), 1990, <em>From Twilight to Dawn: The\nCultural Vision of Jacques Maritain</em>, Mishawaka, IN: American\nMaritain Association.",
                "Saranyana, Josep-Ignaci, et al., 1999–2002,\n<em>Teología en América Latina</em>, Madrid:\nIberoamericana.",
                "Schmitz, Kenneth L., 2000, “Jacques Maritain and Karol\nWojtyla: Approaches to Modernity”, in <em>The Bases of\nEthics</em>, William Sweet (ed.), Milwaukee, WI: Marquette University\nPress.",
                "Schultz, Walter James, 2001, “The Eclipse of the Person in\nPostmodern Iconography”, <em>Études\nMaritainiennes—Maritain Studies</em>, 17: 87–102.",
                "–––, 2005, “Freedom for Friendship:\nMaritain’s Christian Personalist Perspective on Global Democracy\nand the New World Order”, <em>Études\nMaritainiennes—Maritain Studies</em>, 21: 3–31.",
                "Storck, Michael, 2010, “The Meaning of the Word Art: A\nNeothomistic Investigation”, <em>Proceedings of the American\nCatholic Philosophical Association</em>, 84: 263–273.\ndoi:10.5840/acpaproc20108421",
                "Sweet, William, 1998, “Persons, Precepts, and\nMaritain’s Account of the Universality of Natural Law”,\n<em>Études Maritainiennes—Maritain Studies</em>, 14:\n141–165.",
                "–––, 2006, “Jacques Maritain and Freedom\nof Conscience”, <em>Journal of Dharma</em>, 31(1):\n29–43.",
                "Thomas Aquinas, St., 1265–74 [2006], <em>Summa\nTheologiae</em> [<em>Summary of Theology</em>], Thomas Gilby O.P.,\net. alii (eds.), Cambridge: Cambridge University Press.",
                "Torre, Michael D. (ed.), 1990, <em>Freedom in the Modern World:\nJacques Maritain, Yves R. Simon, Mortimer J. Adler</em>, Mishawaka,\nIN: American Maritain Association.",
                "Torończak, Edward, 2008, “Filozoficzno: Pedagogiczne\nimplikacje wyboru podstawowego czlowieka” (in Polish),\n<em>Studia Philosophiae Christianae</em>, 44(1): 176–191.",
                "Trapani Jr, John G., 2011, <em>Poetry, Beauty, and Contemplation:\nThe Complete Aesthetics of Jacques Maritain</em>, Washington, DC:\nCatholic University of America Press.",
                "Trutty-Coohill, Patricia, 2008, “Can Art Be Taught?”,\nin <em>Education in Human Creative Existential Planning</em>,\n(Analecta Husserliana, 95), Anna-Teresa Tymieniecka (ed.), pp.\n123–134. doi:10.1007/978-1-4020-6302-2_11",
                "Veatch, Henry B., 1990, “Preliminary Statement of Apology,\nAnalysis, and Critique”, Leonard A. Kennedy (ed.), <em>Thomistic\nPapers IV</em>, Houston: Center for Thomistic Studies, 1990,\npp. 5–63.",
                "Vitoria, María Angeles, 2011, “La relación\nentre filosofía y ciencias en Jacques Maritain: Implicaciones\ndel quehacer científico”, <em>Topicos: Revista de\nFilosofia (Mexico)</em>, 40: 171–193.\ndoi:10.21555/top.v40i1.90",
                "Wippel, John F., 2014, “Maritain and Aquinas on Our\nDiscovery of Being”, <em>Studia Gilsoniana: A Journal of\nClassical Philosophy</em>, 3: 415–443.\n [<a href=\"http://cejsh.icm.edu.pl/cejsh/element/bwmeta1.element.desklight-07ffc534-af58-42da-b84c-0fc1db6cd182\" target=\"other\">Wippel 2014 available online</a>]",
                "Zunic, Nikolaj, 2005, “Maritain on Human Fellowship and the\nEvil of Genocide”, <em>Études\nMaritainiennes—Maritain Studies</em>, 21: 97–121.\n</ul>\n<h3 id=\"Coll\">"
            ],
            "Collections": [
                "</h3>\n<ul class=\"hanging\">",
                "1948, <em>Jacques Maritain: Son oeuvre philosophique</em>, Paris:\nBibliothèque de la Revue Thomiste.",
                "1982, <em>Maritain Centenary</em>, special issue of <em>The Review\nof Politics</em>, 44(4).",
                "1943, Issue dedicated to Jacques Maritain of <em>The Thomist</em>,\nvolume 5, New York: Sheed and Ward.\n</ul>\n<p>\nAdditional studies of Maritain’s work are available in such\njournals as\n <a href=\"http://people.stfx.ca/wsweet/etudes.html\" target=\"other\"><em>Études Maritainiennes—Maritain Studies</em></a>,\n <em>Cahiers Jacques et Raïssa Maritain</em>, and <em>Notes et\ndocuments: pour une recherche personnaliste</em>. </p>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLiteMariPrinWork\">Primary Literature: Maritain’s Principal Works</h3>\n<p>\nA French-language edition of the works of Maritain is available under\nthe title <em>Oeuvres complètes de Jacques et Raïssa\nMaritain</em>, 16 vols., Fribourg (Switzerland): Éditions\nuniversitaires, 1986–2000. Volumes 14 and 15 contain the\nwritings of Raïssa Maritain, and Volume 16 includes previously\nunpublished work. The publication of a 20 volume set, in English, of\n<em>The Collected Works of Jacques Maritain</em> (under the general\neditorship of Ralph McInerny) is currently underway under auspices of\nthe University of Notre Dame Press. Summaries (in Italian) of\nMaritain’s major books are found in <em>Jacques Maritain:\nDizionario delle Opere</em>, by Piero Viotto, Rome: Città\nNuova, 2003. </p>\n<p>\nMaritain’s principal works are listed below in chronological\norder: (Except where indicated otherwise, place of publication is\nParis. English-language editions are noted as well.)</p>\n<ul class=\"hanging\">\n<li>1910, “La science moderne et la raison”, <em>Revue de\nPhilosophie</em>, XVI/6 (1910), pp. 575–603. Reprinted\nin <em>Antimoderne</em>, Éditions de la Revue des Jeunes,\n1922.</li>\n<li>1914, <em>La Philosophie bergsonienne: études\ncritiques</em>, Marcel Rivière et Cie. [<em>Bergsonian\nPhilosophy and Thomism</em>, New York: Philosophical Library,\n1955.]</li>\n<li>1920, <em>Art et scolastique</em>, Librairie de l’Art\nCatholique. (The 1927 edition contains “Frontières de la\npoésie” and important notes.) [<em>Art and Scholasticism\nand The Frontiers of Poetry</em>, Joseph W. Evans (trans.), New York:\nCharles Scribner’s Sons, 1962.]</li>\n<li>1920, <em>Éléments de Philosophie I: Introduction\ngénérale à la philosophie</em>, Téqui.\n[<em>An Introduction to Philosophy</em>, E. I. Watkin (trans.),\nLondon: Sheed and Ward, 1944.]</li>\n<li>1921, <em>Théonas ou les entretiens d’un sage et deux\nphilosophes sur diverses matières inégalement\nactuelles</em>, First publication in the <em>Revue Universelle</em>,\nApril 1920 to April 1921, 1st edition, Nouvelle Librairie Nationale,\n1921; 2<sup>nd</sup> edition, corrected, 1925. [<em>Theonas:\nConversations of a Sage</em>, F.J. Sheed (trans.), London: Sheed and\nWard, 1933.]</li>\n<li>1922, <em>Antimoderne</em>, Éditions de la Revue des\nJeunes.</li>\n<li>1922, <em>De la vie d’oraison</em>, 1st edition privately\nprinted, Saint-Maurice d’Augaune; 2<sup>nd</sup> edition\nrevised, l’Art Catholique, 1925. [with Raïssa Maritain]\n[<em>Prayer and intelligence</em>, New York: P. J. Kennedy,\n1928.]</li>\n<li>1923, <em>Éléments de philosophie II: L’ordre\ndes concepts, I — Petite logique (Logique formelle)</em>.\nTéqui. [<em>An Introduction to Logic</em>, New York: Sheed and\nWard, 1937a; <em>Formal Logic</em>, Imelda Choquette (trans.), New\nYork: Sheed and Ward, 1937b.]</li>\n<li>1924, <em>Réflexions sur l’intelligence\net sur sa vie propre</em>, Bibliothèque français de\nphilosophie, Nouvelle Librairie Nationale; Desclée, 1938.</li>\n<li>1925, <em>Trois Réformateurs: Luther, Descartes,\nRousseau</em>, Librairie Plon. [<em>Three Reformers: Luther,\nDescartes, Rousseau</em>, New York: Charles Scribner’s Sons,\n1929.]</li>\n<li>1926, <em>Georges Rouault, peintre et lithographe</em>,\nÉditions Polyglotte, Frapier. [<em>Georges Rouault</em>, New\nYork: Harry N. Abrams, Inc., in association with Pocket Books, Inc.,\n1954.]</li>\n<li>1926, <em>Reponse à Jean Cocteau</em>, Librairie Stock.\n[<em>Art and Faith: Letters between Jacques Maritain and Jean\nCocteau</em>, New York: Philosophical Library, 1948.]</li>\n<li>1926, <em>Une opinion sur Charles Maurras et le devoir des\ncatholiques</em>, Plon.</li>\n<li>1927, <em>Primauté du spirituel</em>, Plon. [<em>The Things\nThat Are Not Caesar’s</em>, J.F. Scanlan (trans.), New York:\nCharles Scribner’s Sons, 1930.]</li>\n<li>1927, <em>Quelques pages sur Léon Bloy. Cahiers de la\nQuinzaine</em>, 10e de la 18 serie, á l’Action du\nLivre.</li>\n<li>1929, <em>Clairvoyance de Rome par les auteurs du ‘Pourquoi\nRome a parlé’. (J. Maritain et D. Lallement)</em>,\nÉditions Spes.</li>\n<li>1930, <em>Le Docteur angélique</em>, Desclée de\nBrouwer. [<em>St. Thomas Aquinas: Angels of the Schools</em>, J.F.\nScanlan (trans.), London: Sheed and Ward, 1931; Translation revised by\nPeter O’ Reilly and Joseph W. Evans, New York: Meridian Books,\n1958.]</li>\n<li>1930, <em>Religion et culture. dition originale: premier\nnuméro de la collection des questions disputées</em>,\nDesclée de Brouwer. 2<sup>nd</sup> edition, with a preface,\n1946. [<em>Religion and Culture</em>, London: Sheed and Ward,\n1931.]</li>\n<li>1932, <em>Distinguer pour unir; ou, les degrés du\nsavoir</em>, Desclée de Brouwer. Eighth edition, 1963.\n[<em>Distinguish to Unite: or, The Degrees of Knowledge</em>,\nTranslated under the supervision of G.B. Phelan. New York: Charles\nScribner’s Sons, 1959.]</li>\n<li>1932, <em>Le songe de Descartes</em>, Correa. [<em>The Dream of\nDescartes</em>, Mabelle L. Andison (trans.), New York: Philosophical\nLibrary, 1944.]</li>\n<li>1933, <em>Du regime temporel et de la liberté</em>,\nDesclée de Brouwer. [<em>Freedom in the modern world</em>,\nRichard O’Sullivan (trans.), London: Sheed &amp; Ward,\n1935.]</li>\n<li>1933, <em>De la philosophie chrétienne</em>,\n[“Questions disputées”, Vol. IX], Desclée de\nBrouwer. [<em>An Essay on Christian Philosophy</em>, Edward H.\nFlannery (trans.), New York, Philosophical Library, 1955.]</li>\n<li>1934, <em>Sept leçons sur l’être et les\npremiers principes de la raison spéculative</em>, Téqui.\n[<em>A Preface to Metaphysics: Seven Lectures on Being</em>, New York\nand London: Sheed and Ward, 1939.]</li>\n<li>1935, <em>Frontières de la poésie</em>, Louis Rouart\net fils. [<em>Art and Poetry</em>, E. de P. Matthews (trans.), New\nYork: Philosophical Library, 1943.]</li>\n<li>1935, <em>Science et sagesse, suivi\nd’éclaircissements sur ses frontières et son\nobjet</em>, “Cours et documents de Philosophie”,\nTéqui. [<em>Science and Wisdom</em>, New York: Charles\nScribner’s Sons, 1940.]</li>\n<li>1935, <em>Lettre sur l’indépendance</em>,\nDesclée de Brouwer.</li>\n<li>1935, <em>La philosophie de la nature, essai critique sur ses\nfrontières et son objet</em>, Téqui. [<em>Philosophy of\nNature</em>, Imelda C. Byrne (trans.), New York: Philosophical\nLibrary, 1951]</li>\n<li>1936, <em>Humanisme intégral: problemes temporels et\nspirituals d’une nouvelle chrétienté</em>, Fernand\nAubier. Two translations: <em>True humanism</em>, M.R. Adamson\n(trans.), London: Bles, 1938; <em>Integral Humanism: Temporal and\nSpiritual Problems of a New Christendom</em>, Joseph W. Evans\n(trans.), New York: Charles Scribner’s Sons, 1968.]</li>\n<li>1938, <em>Situation de la poésie</em>, Desclée de\nBrouwer. [with Raïssa Maritain] [<em>The Situation of\nPoetry</em>, Marshall Suther (trans.), New York: Philosophical\nLibrary, 1955.]</li>\n<li>1938, <em>Les Juifs parmi les nations</em>, Éditions du\nCerf. [<em>A Christian Look at the Jewish Question</em>, New York:\nLongmans, Green, 1939.]</li>\n<li>1938, <em>Questions de conscience</em>, [“Questions\ndisputées”, Vol. XXI] 2nd edition. Desclée de\nBrouwer.</li>\n<li>1939, <em>Quatre essais sur l’esprit dans sa condition\ncharnelle</em>, Bibliothèque français de philosophie,\nDesclée de Brouwer. Nouvelle Édition revue, Alsatia,\n1956.</li>\n<li>1939, <em>Antisemitism</em>, London, G. Bles.</li>\n<li>1940, <em>De la justice politique, notes sur la presente\nguerre</em>, Collection “Presences”, Plon.</li>\n<li>1940, <em>Scholasticism and Politics</em>, New York: The Macmillan\nCompany. [with Mortimer Jerome Adler]</li>\n<li>1941, <em>A travers le désastre</em>, New York:\nÉditions de la Maison française. [<em>France, My\nCountry, Through the Disaster</em>, New York: Longmans, Green,\n1941.]</li>\n<li>1941, <em>La pensée de Saint Paul, textes choisis et\nprésentés</em>, New York: Éditions de la Maison\nfrançaise. [<em>The Living Thoughts of Saint Paul</em>, Harry\nLorin Binsse (trans.), New York: Longmans, Green, 1941.]</li>\n<li>1941, <em>Ransoming the Time</em>, New York: Charles\nScribner’s Sons, Harry Lorin Binsse (trans.) [A translation of\nessays written in French, but not collected in a single volume.]</li>\n<li>1941, <em>Confession de foi</em>, New York: Éditions de la\nMaison française. [French translation of an essay published in\n<em>I Believe</em>, Clifton Fadiman (ed.), London: Allen and Unwin,\n1940.]</li>\n<li>1941, <em>Le Crépuscule de la civilisation</em>,\nMontréal: Éditions de l’Arbre. [<em>The Twilight\nof Civilization</em>, London: Sheed and Ward, 1946.]</li>\n<li>1941, “The immortality of man”, <em>The Review of\nPolitics</em>, 3(4): 411. Reprinted in <em>Man’s destiny in\neternity</em>, Boston: Beacon Press, chapter 2, 1949.\ndoi:10.1017/S0034670500002023 </li>\n<li>1942, <em>Les droits de l’homme et la loi naturelle</em>,\nNew York: Éditions de la Maison française. [<em>The\nRights of Man and Natural Law</em>, Doris C. Anson (trans.), New York:\nCharles Scribner’s Sons, 1943.]</li>\n<li>1942, <em>Saint Thomas and the problem of evil</em>, Mrs. Gordon\nAndison [Mabelle L. Andison] (trans.), Milwaukee: Marquette University\nPress.</li>\n<li>1943, <em>Christianisme et Démocratie</em>, New York:\nÉditions de la Maison française. [<em>Christianity and\nDemocracy</em>, . Doris C. Anson (trans.), New York: Charles\nScribner’s Sons, 1944.]</li>\n<li>1943, <em>Sort de l’homme</em>, Neuchâtel:\nÉditions de La Baconnière.</li>\n<li>1943, <em>Education at the Crossroads</em>, New Haven: Yale\nUniversity Press. [<em>L’éducation à la\ncroisée des chemins</em>, Egloff, 1947; republished, with\nadditional material, as <em>Pour une philosophie de\nl’education</em>, Arthème Fayard, 1959. Nouvelle\nédition, 1969.]</li>\n<li>1944, <em>Principes d’une politique humaniste</em>, New\nYork: Éditions de la maison française.</li>\n<li>1944, <em>De Bergson à Thomas d’Aquin, essais de\nmétaphysique et de morale</em>, New York: Éditions de la\nMaison française. Hartmann, 1947.</li>\n<li>1945, <em>A travers la victoire</em>, Hartmann.</li>\n<li>1945, <em>Messages 1941–1944</em>, New York: Éditions\nde la Maison française; Hartmann.</li>\n<li>1945, <em>Pour la justice</em>, New York: Éditions de la\nMaison française.</li>\n<li>1947, <em>Court traité de l’existence et de\nl’existant</em>, Hartmann. [<em>Existence and the Existent</em>,\nLewis Galantière and Gerald B. Phelan (trans.), New York:\nPantheon Books, 1948.]</li>\n<li>1947, <em>La personne et le bien commun</em>, Desclée de\nBrouwer. [<em>The Person and the Common Good</em>, John J. Fitzgerald\n(trans.), New York: Charles Scribner’s Sons, 1947.]</li>\n<li>1948, <em>Art and faith</em>, New York, Philosophical Library.\n[see <em>Réponse a Jean Cocteau</em>, 1933.]</li>\n<li>1948, <em>Raison et raisons, essais détachés</em>,\nEgloff. [<em>The Range of Reason</em>, New York: Charles\nScribner’s Sons, 1952.]</li>\n<li>1949, <em>La signification de l’athéisme\ncontemporain</em>, Collection “Courier de Iles”,\nDesclée de Brouwer.</li>\n<li>1949, <em>Etienne Gilson, philosophe de la\nchrétienté</em>, Cerf.</li>\n<li>1951, <em>Man and the State</em>, Chicago: University of Chicago\nPress. [<em>L’Homme et L’État</em>, Translated into\nFrench by Robert and France Duval, Presses Universitaires de France,\n1953.]</li>\n<li>1951, <em>Lettres inédites sur l’inquiétude\nmoderne</em>, Éditions universelles. [with René\nSchwob]</li>\n<li>1951, <em>Neuf leçons sur les notions premières de\nla philosophie morale</em>, “Cours et documents de\nphilosophie”, Téqui. [<em>An Introduction to Basic\nProblems of Moral Philosophy</em>, Albany, N.Y.: Magi Books,\n1990.]</li>\n<li>1953, <em>Approches de Dieu</em>, Collection “Sagesse et\ncultures”, Alsatia; in <em>Oeuvres complètes de Jacques\net Raïssa Maritain</em>, Vol. X, Fribourg: Editions\nUniversitaires; Paris: Editions Saint-Paul, 1985); [<em>Approaches to\nGod</em>, Peter O’Reilly (trans.), New York: Harper and\nBrothers, 1954.]</li>\n<li>1953, <em>Creative Intuition in Art and Poetry</em>, New York:\nPantheon Books. [<em>L’Intuition créatrice dans\nl’art et dans la poésie</em>, Desclée de Brouwer,\n1966.]</li>\n<li>1957, <em>On the Philosophy of History</em>, New York: Charles\nScribner’s Sons. [<em>Pour une philosophie de\nl’histoire</em>, Mgr Charles Journet (trans.), Éditions\ndu Seuil, 1959.]</li>\n<li>1958, <em>Reflections on America</em>, New York: Charles\nScribner’s Sons. [<em>Réflexions sur\nl’Amérique</em>, Fayard, 1959.]</li>\n<li>1959, <em>Pour une philosophie de l’éducation</em>,\nFayard.</li>\n<li>1960, <em>Liturgy and contemplation</em>, London: G. Chapman.\n[with Raïssa Maritain]</li>\n<li>1960, <em>The Responsibility of the Artist</em>, New York: Charles\nScribner’s Sons. [<em>La responsabilité de\nl’artiste</em>, Georges and Christianne Brazzola (trans.),\nFayard, 1961.]</li>\n<li>1960, <em>Le philosophe dans la cité</em>, Alsatia.</li>\n<li>1960, <em>La philosophie morale. I. Examen historique et critique\ndes grands systemes</em>, Gallimard, Bibliothèque de\nIdées. [<em>Moral Philosophy</em>, Joseph W. Evans (ed.),\nLondon: G. Bles, 1964.]</li>\n<li>1961, <em>On the use of philosophy; three essays</em>, Princeton,\nN.J.: Princeton University Press.</li>\n<li>1963, <em>Dieu et la permission du mal</em>, Desclée de\nBrouwer. [<em>God and the Permission of Evil</em>, Milwaukee: The\nBruce Publishing Co., 1966.]</li>\n<li>1965, <em>Carnet de notes</em>, Desclée de Brouwer.\n[<em>Notebooks</em>, Joseph W. Evans (trans.), Albany: Magi Books/\nNotre Dame, IN: University of Notre Dame Press, 1984.]</li>\n<li>1965, <em>Le mystère d’Israël et autres\nessais</em>, Desclée de Brouwer.</li>\n<li>1967, <em>The Education of Man</em>, Donald and Idella Gallagher\n(eds), New York: Doubleday and Co.</li>\n<li>1967, <em>Le paysan de la Garonne: Une vieux laïc\ns’interroge à propos du temps présent</em>,\nDesclée de Brouwer. [<em>The Peasant of the Garonne: An Old\nLayman Questions Himself about the Present Time</em>, Micheal Cuddihy\nand Elizabeth Hughes (trans.), New York: Holt, Rinehart, and Winston,\n1968.]</li>\n<li>1967, <em>De la grâce et de l’humanité de\nJésus</em>, Bruges: Desclée de Brouwer. [<em>On the\nGrace and Humanity of Jesus</em>, Joseph W. Evans (trans.), New York:\nHerder and Herder, 1969.]</li>\n<li>1970, <em>De l’église du Christ, la personne de\nl’Église et son personnel</em>, Desclée de\nBrouwer. [<em>On the Church of Christ: The Person of the Church and\nHer Personnel</em>, Joseph W. Evans (trans.), Notre Dame, IN:\nUniversity of Notre Dame Press, 1973.]</li>\n<li>1973, <em>Approches sans entraves</em>, Librairie Arthème\nFayard.</li>\n<li>1973, <em>Jacques Maritain, Emmanuel Mounier (1929–1939):\n[Correspondance]</em>, Desclée de Brouwer.</li>\n<li>1979, <em>Une grande amitié: correspondance,\n1926–1972 / Julien Green et Jacques Maritain</em>,\nPrésentée et annotée par Jean-Pierre Piriou.\nPrécédée de <em>Jacques Maritain vivant</em> de\nJulien Green. Plon. [<em>The story of two souls: the correspondence of\nJacques Maritain and Julien Green</em>, Henry Bars and Eric Jourdan\n(eds), translated with an introduction and revised notes by Bernard\nDoering, New York: Fordham University Press, 1988.]</li>\n<li>1986, <em>La loi naturelle ou loi non écrite: texte\ninédit, établi par Georges Brazzola</em>, Fribourg,\nSuisse: Éditions universitaires. [<em>Lectures on Natural\nLaw</em>, William Sweet (trans.), in <em>The Collected Works of\nJacques Maritain</em>, vol. 6, Notre Dame, IN: University of Notre\nDame Press, (forthcoming).]</li>\n<li>1992, <em>Exiles and fugitives: the letters of Jacques and\nRaïssa Maritain, Allen Tate, and Caroline Gordon</em>, John M.\nDunaway (ed.), Baton Rouge: Louisiana State University Press.</li>\n<li>1993, <em>L’Europe et l’idée\nfédérale:</em> textes publiés par le Cercle\nd’études Jacques et Raïssa Maritain. Mame.</li>\n<li>2001, <em>Natural Law: reflections on theory and practice</em>\n(edited with Introductions and notes, by William Sweet), South Bend,\nIN: St Augustine’s Press [distributed by University of Chicago\nPress]; Second printing, corrected, 2003.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<p>\nThough now dated, the most comprehensive list of studies of\nMaritain’s work is found in Jean-Louis Allard and Pierre\nGermain, <em>Répertoire bibliographique sur la vie et\nl’oeuvre de Jacques et Raïssa Maritain</em>, Ottawa, 1994,\n232 p. </p>\n<ul class=\"hanging\">\n<li>Acevedo, Alma, 2012, “Personalist Business Ethics and\nHumanistic Management: Insights from Jacques Maritain”, <em>\nJournal of Business Ethics</em>, 105(2): 197–219.\ndoi:10.1007/s10551-011-0959-x</li>\n<li>Allard, Jean-Louis, 1978, <em>L’éducation à la\nliberté ou la philosophie de l’éducation de\nJacques Maritain</em>, Ottawa: Éditions de\nl’Université d’Ottawa.</li>\n<li>–––, 1982, <em>Education for Freedom: The\nPhilosophy of Education of Jacques Maritain</em>, Notre Dame, IN:\nUniversity of Notre Dame Press.</li>\n<li>–––, 1985, <em>Jacques Maritain, Philosophe dans\nla cité/ A Philosopher in the World</em>, Ottawa: University of\nOttawa Press.</li>\n<li>American Maritain Association, 1981, <em>Selected Papers from the\nConference-Seminar on Jacques Maritain’s The Degrees of\nKnowledge</em>, St. Louis, MO: American Maritain Association.</li>\n<li>Armour, Leslie, 2005, “Escaping Determinate Being: The\nPolitical Metaphysics of Jacques Maritain and Charles de\nKoninck”, <em>Études Maritainiennes—Maritain\nStudies</em>, 21: 61–96.</li>\n<li>Arraj, James, 2006, “Maritain’s Lost Sequel to <em>The\nDegrees of Knowledge</em> and the Future of Thomism”,\n<em>Gregorianum</em>, 87(3): 544–556.</li>\n<li>Barré, Jean-Luc, 1996 [2005], <em>Jacques et Raïssa\nMaritain, les Mendiants du Ciel</em>, Paris: Stock. English\ntranslation: <em>Jacques &amp; Raïssa Maritain: Beggars for\nHeaven</em>, Bernard E. Doering (trans.), Notre Dame: University of\nNotre Dame Press, 2005. </li>\n<li>Barreira, Marcelo Martins, 2008, “A função do\nEntendimento e da Vontade na Contemplação\nMística: Sobre o paralelismo entre João da Cruz e\nTomás de Aquino”, <em>Revista Portuguesa de\nFilosofia</em>, 64(1): 545–557.</li>\n<li>Bars, Henry, 1959, <em>Maritain en notre temps</em>, Paris:\nBernard Grasset.</li>\n<li>Bellusci, David, 2013, “Jacques Maritain and Poetic\nIntuition”, <em>Maritain Studies / Etudes maritainiennes</em>,\n29: 40–52.</li>\n<li>Boas, George, 1952, “Review of <em>The Philosophy of\nNature</em>”, <em>The Journal of Philosophy</em>, 49(7):\n247–252. doi:10.2307/2021495</li>\n<li>Bonaventure of Bagnoregio, St., 1259 [1938, 2002], <em>Itinerarium\nMentis in Deum</em> [<em>Tria opuscula Seraphici Doctoris\nS. Bonaventurae. Breviloquium, Itinerarium mentis in Deum, et De\nreductione artium ad theologiam</em>, The Fathers of the Collegii\nS. Bonaventura (eds.), Florence: Quaracchi, 1938; <em>Journey of the\nSoul into God</em>, Zachary Hayes, OFM, and Philotheus Boehner, OFM\n(trans.), St. Bonaventure, NY, Franciscan Institute Publications,\n2002.</li>\n<li>Caldera, Rafael-Tomás, 1980, <em>Le jugement par\ninclination chez Saint Thomas d’Aquin</em>, Paris: Vrin.</li>\n<li>Callaghan, Morley, 1963, <em>That Summer in Paris; Memories of\nTangled Friendships with Hemingway, Fitzgerald, and Some Others</em>,\nNew York,: Coward-McCann. Toronto: Exile Editions, 2006.</li>\n<li>Campana, Gilberto, 2002, “Un testo di Maritain su\nSpinoza”, <em>Aquinas</em>, 45(1): 105–133.</li>\n<li>Carlson, John W., 2012, <em>Understanding Our Being</em>,\nWashington: Catholic University of America Press.</li>\n<li>Chenaux, Philippe, 1999, <em>Entre Maurras et Maritain, Une\ngénération intellectuelle catholique\n(1920–1930)</em>, Paris: Cerf.</li>\n<li>Chenet, François, 2012, “Métaphysique et\npoésie: une admirable <em>concordia discors</em>?”,\n<em>Revue Philosophique de la France et de l’Etranger</em>,\n202(1): 15–28.</li>\n<li>Clark, Meghan J., 2012, “Reasoned Agreement versus Practical\nReasonableness: Grounding Human Rights in Maritain and Rawls”,\n<em>Heythrop Journal</em>, 53(4): 637–648.\ndoi:10.1111/j.1468-2265.2009.00557.x</li>\n<li>Contat, Alain, 2008, “Le figure della differenza ontologica\nnel tomismo del Novecento (seconda parte)”, <em>Alpha Omega:\nRivista di Filosofia e Teologia dell’Ateneo Pontificio Regina\nApostolorum </em>, 11(2): 213–250.</li>\n<li>Compagnon, Olivier, 2003, <em>Jacques Maritain et\nl’Amérique du Sud. Le modèle malgré\nlui</em>, Villeneuve d’Ascq: Presses universitaires du\nSeptentrion.</li>\n<li>Coulter, Gregory J., 2012, “Maritain on tolerance and\nreligion”, <em>Science et esprit</em>, 64(2):\n217–227.</li>\n<li>Croteau, Jacques, 1950, <em>Les fondements thomistes du\npersonnalisme de Maritain</em>, Ottawa: Éditions de\nl’Université d’Ottawa.</li>\n<li>D’Souza, Mario, 2000, “Intellectual Unity,\nIntellectual Virtues, and Intellectual Culture”,\n<em>Études Maritainiennes—Maritain Studies</em>, 16:\n59–70.</li>\n<li>–––, 2008, “The Person, Natural Law, and\nthe Good of Pluralist Societies: Some Thoughts from Maritain’s\nPolitical Philosophy”, <em>Maritain Studies / Etudes\nmaritainiennes</em>, 24: 3–18.</li>\n<li>–––, 2011, “Being, Becoming, and the\nPhilosophical Transformation of the Self”, <em>Philosophy,\nCulture, and Traditions</em>, 7: 51–61.</li>\n<li>Daly, Mary F., 1966, <em>Natural Knowledge of God in the\nPhilosophy of Jacques Maritain</em>, Rome: Officium Libri\nCatholici-Catholic Book Agency.</li>\n<li>Daujat, Jean, 1978, <em>Maritain: Un maître pour notre\ntemps</em>, Paris: Téqui.</li>\n<li>De Tavernier, Johan, 2009, “The Historical Roots of\nPersonalism: From Renouvier’s Le Personnalisme, Mounier’s\nManifeste au service du personnalisme and Maritain’s Humanisme\nintégral to Janssens’ Personne et\nSociété”, <em>Ethical Perspectives: Journal of the\nEuropean Ethics Network</em>, 16(3): 361–392.</li>\n<li>Deely, John, 1997, “Quid Sit Postmodernismus?”,, in\n<em>Postmodernism and Christian Philosophy</em>, Roman T. Ciapalo\n(ed.), Washington, DC: Catholic University of America Press/American\nMaritain Association, pp. 68–96. </li>\n<li>Delfino, Robert A., 2002, “Mystical Theology in Aquinas and\nMaritain” in Ollivant 2002: 253–268.\n [<a href=\"https://maritain.nd.edu/ama/Many/Many301.pdf\" target=\"other\">Delfino 2002 available online (pdf)</a>]</li>\n<li>Dennehy, Raymond 2003, “Maritain’s Reply to\nGilson’s Rejection of Critical Realism”, in <em>A\nThomistic Tapestry: Essays in Memory of Etienne Gilson</em>, Peter A.\nRedpath (ed.), New York: Rodopi, pp. 57–80.</li>\n<li>Dewan, Lawrence, 2009, “St. Thomas and the Perennial Need\nfor Renewal in Metaphysics”, <em>Science et esprit</em>, 61(1):\n5–17.</li>\n<li>–––, 2010, “The Foundations of Human\nRights”, <em>Science et esprit</em>, 62(2–3):\n227–236.</li>\n<li>DiJoseph, John, 1996, <em>Jacques Maritain and the Moral\nFoundation of Democracy</em>, Lanham, MD: Rowman &amp;\nLittlefield.</li>\n<li>Doering, Bernard, 1983, <em>Jacques Maritain and the French\nCatholic Intellectuals</em>, Notre Dame, IN: University of Notre Dame\nPress.</li>\n<li>––– (ed.), 1994, <em>The Philosopher and the\nProvocateur: The Correspondence of Jacques Maritain and Saul\nAlinsky</em>, Notre Dame, IN: University of Notre Dame Press.</li>\n<li>Dougherty, Jude P., 2003, <em>Jacques Maritain: An Intellectual\nProfile</em>, Washington DC, Catholic University of America\nPress.</li>\n<li>Doyle, Dominic, 2009, “Retrieving the Hope of Christian\nHumanism: A Thomistic Reflection on Charles Taylor and Nicholas\nBoyle”, <em>Gregorianum</em>, 90(4): 699–722.</li>\n<li>Dunaway, John M., 1978, <em>Jacques Maritain</em>, Boston: Twayne\nPublishers.</li>\n<li>Eco, Umberto, 1961, <em>Storiografia Medievale ed Estetica Teorica\nAppunti Metodologici su Jacques Maritain</em>, Turin: Edizioni di\n“Filosofia”.</li>\n<li>Evans, Joseph W. (ed.), 1963, <em>Jacques Maritain: The Man and\nHis Achievement</em>, New York: Sheed and Ward.</li>\n<li>–––, 1973, “Jacques Maritain\n(1882–1973): A Biographical Memoir”, <em>Proceedings of\nthe National Academy of Education</em>, 5: 92–127.</li>\n<li>Fallon, Robert, 2002, “Composing Subjectivity:\nMaritain’s Poetic Knowledge in Stravinsky and Messiaen”,\nin Ollivant 2002: 284–302.\n [<a href=\"https://maritain.nd.edu/ama/Many/Many304.pdf\" target=\"other\">Fallon 2002 available online (pdf)</a>]</li>\n<li>Fecher, Charles A., 1953, <em>The Philosophy of Jacques\nMaritain</em>, Westminster, MD: Newman Press.</li>\n<li>FitzGerald, Desmond J. “Maritain and Gilson on\nPainting”, in <em>Beauty, Art, and the Polis</em>, Alice Ramos\n(ed.), Washington, DC: Catholic University of America Press, 2000, pp.\n190–199.</li>\n<li>Floucat, Yves, 1983, <em>Pour une philosophie chrétienne:\néléments d’un débat fondamental</em>,\nParis: Téqui.</li>\n<li>–––, 1996, <em>Jacques Maritain ou la\nfidélité à l’éternel</em>, Paris:\nFAC Editions.</li>\n<li>Fornasier, Roberto, 2010, <em>Jacques Maritain ambasciatore. La\nFrancia, la Santa Sede e i problemi del dopoguerra</em>, Roma:\nEdizioni Studium.</li>\n<li>Gallagher, Donald and Idella Gallager, 1962, <em>The Achievement\nof Jacques and Raissa Maritain: A Bibliography</em>, New York:\nDoubleday and Co..</li>\n<li>Goedert, Georges, 2010, “Die Idee einer politischen\nWelteinheit: ein philosophisches Projekt von Jacques Maritain”,\n<em>Perspektiven der Philosophie, Neues Jahrbuch</em>, 36:\n277–304.</li>\n<li>Gwozdz, Thomas L., 2010, “Young and Restless: Jacques\nMaritain and Henri Bergson”, <em>American Catholic Philosophical\nQuarterly</em>, 84(3): 549–564. doi:10.5840/acpq201084336</li>\n<li>Hubert, Bernard and Yves Floucat (eds), 1991, <em>Jacques Maritain\net ses contemporains</em>, Paris: Desclée.</li>\n<li>Hudson, Deal W. and Matthew J. Mancini (eds), 1987,\n<em>Understanding Maritain: Philosopher and Friend</em>, Macon, GA:\nMercer University Press.</li>\n<li>Institut International Jacques Maritain, 1984, <em>Droits des\npeuples, Droits de l’homme</em>, Paris: Éditions du\nCenturion.</li>\n<li>Jimenez Berguecio, Julio, S.J., 1948, <em>La ortodoxia de Jacques\nMaritain, ante un ataque recente</em>, Talca, Chile: Libreria\nCervantes.</li>\n<li>Jung, Hwa Yol, 1960, <em>The Foundation of Jacques\nMaritain’s Political Philosophy</em>, Gainesville, FL:\nUniversity of Florida Press.</li>\n<li>Killoran, John, 2000, “Approaches to Wisdom: Newman and\nMaritain on the University”, <em>Études\nMaritainiennes—Maritain Studies</em>, 16: 131–144</li>\n<li>Kinsella, Noel A., 2012, “Le service public dans ses pas:\nConsidérations philosophiques sur la foi et le service\npublic”, <em>Science et esprit</em>, 64(2): 143–156.</li>\n<li>Klassen, David J., 2011, “Integral Humanism or Exclusive\nHumanism? Reconsidering Maritain’s Political Philosophy”,\n<em>Philosophy, Culture, and Traditions</em>, 7: 87–101.</li>\n<li>Klein, Terrance W., 2010, “The Art of Knowing”,\n<em>Heythrop Journal</em>, 51(1): 60–72.\ndoi:10.1111/j.1468-2265.2009.00535.x</li>\n<li>Knasas, John F.X. (ed.), 1988, <em>Jacques Maritain: The Man and\nhis Metaphysics</em>, (<em>Maritain Studies / Études\nmaritainiennes</em>, 4), Mishawaka, IN: American Maritain\nAssociation.</li>\n<li>–––, 1992, “Gilson vs. Maritain: The Start\nof Thomistic Metaphysics”, <em>The Future of Thomism</em>, Deal\nHudson and Dennis Moran (eds.), Mishawaka, IN: American Maritain\nAssociation/Notre Dame, IN: University of Notre Dame Press.</li>\n<li>Kraal, Anders, 2013, “The Emergence of Logical Formalization\nin the Philosophy of Religion: Genesis, Crisis, and\nRehabilitation”, <em>History and Philosophy of Logic</em>,\n34(4): 351–366. doi:10.1080/01445340.2013.808805</li>\n<li>Lardinois, Roland, 2017, <em>Scholars and Prophets: Sociology of\nIndia from France in the 19th-20th Centuries</em>, London:\nRoutledge.</li>\n<li>Malquori, Diego, 2009, “Science et philosophie: Sobre la\nconcepció epistemològica de Jacques Maritain”,\n<em>Comprendre: Revista Catalana de Filosofia</em>, 11(1):\n31–45.\n [<a href=\"http://www.raco.cat/index.php/Comprendre/article/view/140841\" target=\"other\">Malquori 2009 available online</a>]</li>\n<li>Mathias, R., 2001, “Exploring the New Classicism:\nReflections on Stravinsky and Maritain c. 1920–1940”,\n<em>Études Maritainiennes—Maritain Studies</em>, 17\n(2001): 79–86.</li>\n<li>McCool, Gerald A., 1989, <em>Nineteenth-century Scholasticism: The\nSearch for a Unitary Method</em>, New York: Fordham University\nPress.</li>\n<li>McInerny, Ralph, 1988, <em>Art and Prudence: Studies in the\nThought of Jacques Maritain</em>, Notre Dame, IN: University of Notre\nDame Press.</li>\n<li>–––, 2003, <em>The Very Rich Hours of Jacques\nMaritain</em>, Notre Dame, IN: University of Notre Dame Press.</li>\n<li>Michener, Norah Willis, 1955, <em>Maritain on the Nature of Man in\na Christian Democracy</em>, Hull (Canada): Éditions\n“L’Eclair”.</li>\n<li>Minkiel, Stephen J., C.M. (ed.), 1981, <em>Jacques Maritain: The\nMan for Our Times</em>, Erie, PA: Gannon University Press.</li>\n<li>Muñoz, Ceferino P.D., 2012, “En torno a dos lecturas\nposibles sobre el conocimiento de las esencias en Tomas de\nAquino”, <em>Topicos: Revista de Filosofia (Mexico)</em>, 43:\n123–151.</li>\n<li>Nelson, Ralph C., 2007, <em>Two Masters, Two Perspectives:\nMaritain and Gilson on the Philosophy of Nature</em>, Washington DC:\nCatholic University of America Press.</li>\n<li>Nielsen, Kai, 1959 [1991], “An Examination of the Thomistic\nTheory of Natural [Moral] Law”, <em>Natural Law Forum</em>,\npaper 39, 4: 44–71; reprinted in his <em>God and the Grounding\nof Morality</em>, Ottawa, ON: University of Ottawa Press, 1991, ch. 3,\npp. 41–68.\n [<a href=\"https://scholarship.law.nd.edu/nd_naturallaw_forum/39/\" target=\"other\">Nielsen 1959 available online</a>]</li>\n<li>Nottingham, William J., 1968, <em>Christian Faith and Secular\nAction: An Introduction to the Life and Thought of Jacques\nMaritain</em>, St. Louis, MO: The Bethany Press.</li>\n<li>O’Connor, Flannery, 1979, <em>The Habit of Being:\nLetters</em>, New York: Farrar, Straus, and Giroux.</li>\n<li>Ollivant, Douglas A. (ed.), 2002, <em>Jacques Maritain and the\nMany Ways of Knowing</em>, Washington DC: Catholic University of\nAmerica Press.\n [<a href=\"https://maritain.nd.edu/ama/Many/\" target=\"other\">Ollivant 2002 available online</a>]</li>\n<li>Papini, Roberto (ed.), 1978, <em>Jacques Maritain e la\nSocietà Contemporanea</em>, Milan: Massimo.</li>\n<li>––– (ed.), 1981, <em>L’Apporto del\nPersonalismo alla Costruzione dell’ Europa</em>, Milan:\nMassimo.</li>\n<li>Possenti, Vittorio (ed.), 1978, <em>Maritain e Marx</em>, Milan:\nMassimo.</li>\n<li>––– (ed.), 1983, <em>Jacques Maritain:\nOggi</em>, Milan: Vita e Pensiero.</li>\n<li>–––, 1985, “Philosophie du droit et loi\nnaturelle selon Jacques Maritain”, in <em>Jacques Maritain:\nphilosophe dans la cité / a philosopher in the world</em>,\nJean-Louis Allard (ed.), Ottawa: University of Ottawa Press, pp.\n313–326.</li>\n<li>Possenti Ghiglia, Nora, 2000 [2006], <em>I tre Maritain. La\npresenza di Vera nel mondo di Jacques e Raïssa</em>, Milano:\nÀncora. French translation: <em>Les trois Maritain: La\nprésence de Véra dans le monde de Jacques et\nRaïssa</em>, René Mougel and Dominique Mougel (trans.),\nParole et Silence, 2006.</li>\n<li>Prouvost, Géry, 1991a, <em>Catholicité de\nl’intelligence métaphysique: La philosophie dans la foi\nselon Jacques Maritain</em>, Paris: Pierre Téqui.</li>\n<li>–––, 1991b, <em>Étienne Gilson-Jacques\nMaritain: Correspondance 1923–1971</em>, Paris: Librairie\nPhilosophique J. Vrin.</li>\n<li>Ramsey, Paul, 1962, <em>Nine Modern Moralists</em>, Englewood\nCliffs, NJ: Prentice-Hall.</li>\n<li>Redpath, Peter A. (ed.), 1990, <em>From Twilight to Dawn: The\nCultural Vision of Jacques Maritain</em>, Mishawaka, IN: American\nMaritain Association.</li>\n<li>Saranyana, Josep-Ignaci, et al., 1999–2002,\n<em>Teología en América Latina</em>, Madrid:\nIberoamericana.</li>\n<li>Schmitz, Kenneth L., 2000, “Jacques Maritain and Karol\nWojtyla: Approaches to Modernity”, in <em>The Bases of\nEthics</em>, William Sweet (ed.), Milwaukee, WI: Marquette University\nPress.</li>\n<li>Schultz, Walter James, 2001, “The Eclipse of the Person in\nPostmodern Iconography”, <em>Études\nMaritainiennes—Maritain Studies</em>, 17: 87–102.</li>\n<li>–––, 2005, “Freedom for Friendship:\nMaritain’s Christian Personalist Perspective on Global Democracy\nand the New World Order”, <em>Études\nMaritainiennes—Maritain Studies</em>, 21: 3–31.</li>\n<li>Storck, Michael, 2010, “The Meaning of the Word Art: A\nNeothomistic Investigation”, <em>Proceedings of the American\nCatholic Philosophical Association</em>, 84: 263–273.\ndoi:10.5840/acpaproc20108421</li>\n<li>Sweet, William, 1998, “Persons, Precepts, and\nMaritain’s Account of the Universality of Natural Law”,\n<em>Études Maritainiennes—Maritain Studies</em>, 14:\n141–165.</li>\n<li>–––, 2006, “Jacques Maritain and Freedom\nof Conscience”, <em>Journal of Dharma</em>, 31(1):\n29–43.</li>\n<li>Thomas Aquinas, St., 1265–74 [2006], <em>Summa\nTheologiae</em> [<em>Summary of Theology</em>], Thomas Gilby O.P.,\net. alii (eds.), Cambridge: Cambridge University Press.</li>\n<li>Torre, Michael D. (ed.), 1990, <em>Freedom in the Modern World:\nJacques Maritain, Yves R. Simon, Mortimer J. Adler</em>, Mishawaka,\nIN: American Maritain Association.</li>\n<li>Torończak, Edward, 2008, “Filozoficzno: Pedagogiczne\nimplikacje wyboru podstawowego czlowieka” (in Polish),\n<em>Studia Philosophiae Christianae</em>, 44(1): 176–191.</li>\n<li>Trapani Jr, John G., 2011, <em>Poetry, Beauty, and Contemplation:\nThe Complete Aesthetics of Jacques Maritain</em>, Washington, DC:\nCatholic University of America Press.</li>\n<li>Trutty-Coohill, Patricia, 2008, “Can Art Be Taught?”,\nin <em>Education in Human Creative Existential Planning</em>,\n(Analecta Husserliana, 95), Anna-Teresa Tymieniecka (ed.), pp.\n123–134. doi:10.1007/978-1-4020-6302-2_11</li>\n<li>Veatch, Henry B., 1990, “Preliminary Statement of Apology,\nAnalysis, and Critique”, Leonard A. Kennedy (ed.), <em>Thomistic\nPapers IV</em>, Houston: Center for Thomistic Studies, 1990,\npp. 5–63.</li>\n<li>Vitoria, María Angeles, 2011, “La relación\nentre filosofía y ciencias en Jacques Maritain: Implicaciones\ndel quehacer científico”, <em>Topicos: Revista de\nFilosofia (Mexico)</em>, 40: 171–193.\ndoi:10.21555/top.v40i1.90</li>\n<li>Wippel, John F., 2014, “Maritain and Aquinas on Our\nDiscovery of Being”, <em>Studia Gilsoniana: A Journal of\nClassical Philosophy</em>, 3: 415–443.\n [<a href=\"http://cejsh.icm.edu.pl/cejsh/element/bwmeta1.element.desklight-07ffc534-af58-42da-b84c-0fc1db6cd182\" target=\"other\">Wippel 2014 available online</a>]</li>\n<li>Zunic, Nikolaj, 2005, “Maritain on Human Fellowship and the\nEvil of Genocide”, <em>Études\nMaritainiennes—Maritain Studies</em>, 21: 97–121.</li>\n</ul>\n<h3 id=\"Coll\">Collections</h3>\n<ul class=\"hanging\">\n<li> 1948, <em>Jacques Maritain: Son oeuvre philosophique</em>, Paris:\nBibliothèque de la Revue Thomiste.</li>\n<li>1982, <em>Maritain Centenary</em>, special issue of <em>The Review\nof Politics</em>, 44(4).</li>\n<li>1943, Issue dedicated to Jacques Maritain of <em>The Thomist</em>,\nvolume 5, New York: Sheed and Ward.</li>\n</ul>\n<p>\nAdditional studies of Maritain’s work are available in such\njournals as\n <a href=\"http://people.stfx.ca/wsweet/etudes.html\" target=\"other\"><em>Études Maritainiennes—Maritain Studies</em></a>,\n <em>Cahiers Jacques et Raïssa Maritain</em>, and <em>Notes et\ndocuments: pour une recherche personnaliste</em>. </p>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aquinas, Thomas",
            "God: and other ultimates",
            "liberalism",
            "religion: philosophy of"
        ],
        "entry_link": [
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../god-ultimates/": "God: and other ultimates"
            },
            {
                "../liberalism/": "liberalism"
            },
            {
                "../philosophy-religion/": "religion: philosophy of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=maritain\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/maritain/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=maritain&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/maritain/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=maritain": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/maritain/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=maritain&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/maritain/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://maritain.nd.edu/\" target=\"other\">The Jacques Maritain Center, University of Notre Dame</a>\n [includes electronic texts of a number of Maritain’s major\ntexts, as well as transcriptions of manuscripts]",
            "<a href=\"https://sites.google.com/site/cjma4acjm/home\" target=\"other\">The Canadian Jacques Maritain Association</a>",
            "<a href=\"https://www.facebook.com/Cercle-d'Etudes-Jacques-et-Raissa-Maritain-997298293699773/\">Cercle\nd’études Jacques et Raïssa Maritain</a>"
        ],
        "listed_links": [
            {
                "https://maritain.nd.edu/": "The Jacques Maritain Center, University of Notre Dame"
            },
            {
                "https://sites.google.com/site/cjma4acjm/home": "The Canadian Jacques Maritain Association"
            },
            {
                "https://www.facebook.com/Cercle-d'Etudes-Jacques-et-Raissa-Maritain-997298293699773/": "Cercle\nd’études Jacques et Raïssa Maritain"
            }
        ]
    }
}