{
    "url": "marriage",
    "title": "Marriage and Domestic Partnership",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Elizabeth Brake\n<elizabeth.brake@rice.edu>",
        "author_links": [
            {
                "https://elizabethbrake.com": "Elizabeth Brake"
            },
            {
                "mailto:elizabeth%2ebrake%40rice%2eedu": "elizabeth.brake@rice.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://elizabethbrake.com\" target=\"other\">Elizabeth Brake</a>\n&lt;<a href=\"mailto:elizabeth%2ebrake%40rice%2eedu\"><em>elizabeth<abbr title=\" dot \">.</abbr>brake<abbr title=\" at \">@</abbr>rice<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Jul 11, 2009",
        "substantive revision Wed Jul 14, 2021"
    ],
    "preamble": "\n\nMarriage, a prominent institution regulating sex, reproduction, and\nfamily life, is a route into classical philosophical issues such as\nthe good and the scope of individual choice, as well as itself raising\ndistinctive philosophical questions. Political philosophers have taken\nthe organization of sex and reproduction to be essential to the health\nof the state, and moral philosophers have debated whether marriage has\na special moral status and relation to the human good. Philosophers\nhave also disputed the underlying moral and legal rationales for the\nstructure of marriage, with implications for questions such as the\ncontent of its moral obligations and the legal recognition of same-sex\nmarriage. Feminist philosophers have seen marriage as playing a\ncrucial role in women’s oppression and thus a central topic of\njustice. In this area philosophy courts public debate: in 1940,\nBertrand Russell’s appointment to an academic post was withdrawn\non the grounds that the liberal views expressed in Marriage and\nMorals made him morally unfit for such a post. Likewise, debate\nover same-sex marriage has been highly charged. Unlike some\ncontemporary issues sparking such wide interest, there is a long\ntradition of philosophical thought on marriage.\n\nPhilosophical debate concerning marriage extends to what marriage,\nfundamentally, is; therefore, Section 1 examines its definition.\nSection 2 sets out the historical development of the philosophy of\nmarriage, which shapes today’s debates. Many of the ethical\npositions on marriage can be understood as divided on the question of\nwhether marriage should be defined contractually by the spouses or by\nits institutional purpose, and they further divide on whether that\npurpose necessarily includes procreation or may be limited to the\nmarital love relationship. Section 3 taxonomizes ethical views of\nmarriage accordingly. Section 4 will examine rival political\nunderstandings of marriage law and its rationale. Discussion of\nmarriage has played a central role in feminist philosophy; Section 5\nwill outline the foremost critiques of the institution.\n",
    "toc": [
        {
            "#DefMar": "1. Defining Marriage"
        },
        {
            "#UndMarHisOri": "2. Understanding Marriage: Historical Orientation"
        },
        {
            "#MarMor": "3. Marriage and Morals"
        },
        {
            "#ConVie": "3.1 Contractual Views"
        },
        {
            "#InsVie": "3.2 Institutional Views"
        },
        {
            "#PolMar": "4. The Politics of Marriage"
        },
        {
            "#MarLegCon": "4.1 Marriage and Legal Contract"
        },
        {
            "#RatMarLaw": "4.2 The Rationale of Marriage Law"
        },
        {
            "#SamSexMar": "4.3 Same-Sex Marriage"
        },
        {
            "#ArgRef": "4.4 Arguments for Marriage Reform"
        },
        {
            "#MarOpp": "5. Marriage and Oppression: Gender, Race, and Class"
        },
        {
            "#FemApp": "5.1 Feminist Approaches"
        },
        {
            "#QueCri": "5.2 The Queer Critique"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ConWor": "Contemporary Works"
        },
        {
            "#HisWorFirPubPri195": "Historical Works"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Defining Marriage\n\n‘Marriage’ can refer to a legal contract and civil status,\na religious rite, and a social practice, all of which vary by legal\njurisdiction, religious doctrine, and culture. History shows\nconsiderable variation in marital practices: polygyny has been widely\npracticed, some societies have approved of extra-marital sex and,\narguably, recognized same-sex marriages, and religious or civil\nofficiation has not always been the norm (Boswell 1994; Mohr 2005, 62;\nCoontz 2006). More fundamentally, while the contemporary Western ideal\nof marriage involves a relationship of love, friendship, or\ncompanionship, marriage historically functioned primarily as an\neconomic and political unit used to create kinship bonds, control\ninheritance, and share resources and labor. Indeed, some ancients and\nmedievals discouraged ‘excessive’ love in marriage. The\nWestern ‘love revolution’ in marriage dates popularly to\nthe 18th century (Coontz 2006, Part 3). The understanding\nof marriage as grounded in individual choice and romantic love\nreflects historically and culturally situated beliefs and practices.\nMost notably, the aspect of consent or voluntary entry - often taken\nto be crucial to marriage (Cott 2000) - is challenged where practices\nof forced or child marriage are prevalent (Narayan 1997; Bhandary\n2018). Arranged marriage, which is compatible with the consent of the\nspouses, prioritizes caregiving and economic aspects of the\ninstitution over romantic love (Bhandary 2018).\n\nThe global variety of marriage practices and law is difficult to\nencapsulate: notable variations in law include recognition of same-sex\nmarriage, polygamy, and ‘common-law’ marriage,\nrestrictions on marriages between members of the same family or of\ndifferent social castes, the existence of civil marriage, practices of\narranged, forced, or child marriage, and women’s rights within\nmarriage (see Moses 2018 for an entry into the literature on these\ndifferences), as well as cultural and religious practices of temporary\nmarriage (Shrage 2013, Nolan 2016) or polyamorous marriage (Brake\n2018). Religious, cultural, and philosophical traditions also shape\nideals of marriage. For instance, Xiaorong Li writes that\n“Confucian ideals of family, society, and women’s\nrole” influence expectations of marriage in China (Li 1995,\n413). However, scholarship on such differences must be careful to\navoid misrepresentation (see for example discussion of misleading\nWestern accounts of ‘sati’ and dowry-murder in India in\nNarayan 1997).\n\nEthical and political questions regarding marriage are sometimes\nanswered by appeal to the definition of marriage. But the historical\nand cultural variation in marital practices has prompted some\nphilosophers to argue that marriage is a ‘family\nresemblance’ concept, with no essential purpose or structure\n(Wasserstrom 1974; see also the interesting discussion of whether the\nmany different practices identified by anthropologists as marriage\nshould be counted as marriages in Nolan, forthcoming). If marriage has\nno essential features, then one cannot appeal to definition to justify\nparticular legal or moral obligations. For instance, if monogamy is\nnot an essential feature of marriage, then one cannot appeal to the\ndefinition of marriage to justify a requirement that legal marriage be\nmonogamous. To a certain extent, the point that actual legal or social\ndefinitions cannot settle the question of what features marriage\nshould have is just. First, past applications of a term need not yield\nnecessary and sufficient criteria for applying it:\n‘marriage’ (like ‘citizen’) may be extended to\nnew cases without thereby changing its meaning (Mercier 2001). Second,\nappeal to definition may be uninformative: for example, legal\ndefinitions are sometimes circular, defining marriage in terms of\nspouses and spouses in terms of marriage (Mohr 2005, 57). Third,\nappeal to an existing definition in the context of debate over what\nthe law of marriage, or its moral obligations, should be risks begging\nthe question: in debate over same-sex marriage, for example, appeal to\nthe current legal definition begs the normative question of what the\nlaw should be. However, this point also tells against the argument for\nthe family resemblance view of marriage, as the variation of marital\nforms in practice does not preclude the existence of a normatively\nideal form. Thus, philosophers who defend an essentialist definition\nof marriage offer normative definitions, which appeal to fundamental\nethical or political principles. Defining marriage must depend on,\nrather than precede, ethical and political inquiry.\n2. Understanding Marriage: Historical Orientation\n\nSetting the agenda for contemporary debate, ancient and medieval\nphilosophers raised recurring themes in the philosophy of marriage:\nthe relation between marriage and the state, the role of sex and\nprocreation in marriage, and the gendered nature of spousal roles.\nTheir works reflect evolving, and overlapping, ideas of marriage as an\neconomic or procreative unit, a religious sacrament, a contractual\nassociation, and a relationship of mutual support.\n\nIn his depiction of the ideal state, Plato (427–347 BCE)\ndescribed a form of marriage contrasting greatly with actual marriage\npractices of his time. He argued that, just as male and female\nwatchdogs perform the same duties, men and women should work together,\nand, among Guardians, ‘wives and children [should be held] in\ncommon’ (The Republic, ca. 375–370 BCE,\n423e–424a). To orchestrate eugenic breeding, temporary marriages\nwould be made at festivals, where matches, apparently chosen by lot,\nwould be secretly arranged by the Rulers. Resulting offspring would be\ntaken from biological parents and reared anonymously in nurseries.\nPlato’s reason for this radical restructuring of marriage was to\nextend family sympathies from the nuclear family to the state itself:\nthe abolition of the private family was intended to discourage private\ninterests at odds with the common good and the strength of the state\n(ibid., 449a-466d; in Plato’s Laws, ca.\n355–47 BCE, private marriage is retained but still designed for\npublic benefit).\n\nAristotle (384–322 BCE) sharply criticized this proposal as\nunworkable. On his view, Plato errs in assuming that the natural love\nfor one’s own family can be transferred to all fellow-citizens.\nThe state arises from component parts, beginning with the natural\nprocreative union of male and female. It is thus a state of families\nrather than a family state, and its dependence on the functioning of\nindividual households makes marriage essential to political theory\n(Politics, 1264b). The Aristotelian idea that the stability\nof society depends on the marital family influenced Hegel, Rawls, and\nSandel, among others. Aristotle also disagreed with Plato on gender\nroles in marriage, and these views too would prove influential.\nMarriage, he argued, is properly structured by gender: the husband,\n“fitter for command,” rules. The sexes express their\nexcellences differently: “the courage of a man is shown in\ncommanding, of a woman in obeying,” a complementarity which\npromotes the marital good (Politics, ca. 330 BCE, 1253b,\n1259b, 1260a; Nicomachean Ethics, ca. 325 BCE,\n1160–62).\n\nIn contrast to the ancients, whose philosophical discussion of sex and\nsexual love was not confined to marriage, Christian philosophers\nintroduced a new focus on marriage as the sole permissible context for\nsex, marking a shift from viewing marriage as primarily a political\nand economic unit. St. Augustine (354–430), following St. Paul,\ncondemns sex outside marriage and lust within it. “[A]bstinence\nfrom all sexual union is better even than marital intercourse\nperformed for the sake of procreating,” and the unmarried state\nis best of all (The Excellence of Marriage, ca. 401, §6,\n13/15). But marriage is justified by its goods: “children,\nfidelity [between spouses], and sacrament.” Although procreation\nis the purpose of marriage, marriage does not morally rehabilitate\nlust. Instead, the reason for the individual marital sexual act\ndetermines its permissibility. Sex for the sake of procreation is not\nsinful, and sex within marriage solely to satisfy lust is a pardonable\n(venial) sin. As marital sex is preferable to\n“fornication” (extra-marital sex), spouses owe the\n“marriage debt” (sex) to protect against temptation,\nthereby sustaining mutual fidelity (Marriage and Desire, Book\nI, ca. 418–19, §7, 8, 17/19, 14/16).\n\nSt. Thomas Aquinas (ca. 1225–1274) grounded concurring judgments\nabout sexual morality in natural law, explicating marriage in terms of\nbasic human goods, including procreation and fidelity between spouses\n(Finnis 1997). Monogamous marriage, as the arrangement fit for the\nrearing of children, “belong[s] to the natural law.”\nMonogamous marriage secures paternal guidance, which a child needs;\nfornication is thus a mortal sin because it “tends to injure the\nlife of the offspring.” (Aquinas rejects polygamy on similar\ngrounds while, like Augustine, arguing that it was once permitted to\npopulate the earth.) Marital sex employs the body for its purpose of\npreserving the species, and pleasure may be a divinely ordained part\nof this. Even within marriage, sex is morally troubling because it\ninvolves “a loss of reason,” but this is compensated by\nthe goods of marriage (Summa Theologiae, unfinished at\nAquinas’ death, II-II, 153, 2; 154, 2). Among these goods,\nAquinas emphasizes the mutual fidelity of the spouses, including\npayment of the “marriage debt” and “partnership of a\ncommon life”—a step towards ideas of companionate marriage\n(Summa Theologiae, Supp. 49, 1).\n\nIndeed, we see indications of discontent with the economic model of\nmarriage a century earlier in the letters of Héloïse (ca.\n1100–1163) to Abelard (1079–1142). Héloïse\nattacks marriage, understood as an economic transaction, arguing that\na woman marrying for money or position deserves “wages, not\ngratitude” and would “prostitute herself to a richer man,\nif she could.” In place of this economic relation she praises\nlove, understood on a Ciceronian model of friendship: the “name\nof wife may seem more sacred or more binding, but sweeter for me will\nalways be the word friend (amica), or, if you will permit me,\nthat of concubine or whore” (Abelard and Héloïse,\nLetters, ca. 1133–1138, 51–2). The relation\nbetween love and marriage will continue to preoccupy later\nphilosophers. Do marital obligations and economic incentives threaten\nlove, as Héloïse suggested? (Cave 2003, Card 1996) As\nSøren Kierkegaard (1813–1855) dramatically suggests in\nThe Seducer’s Diary, are the obligations of marriage\nincompatible with romantic and erotic love? Or, instead, does marital\ncommitment uniquely enable spousal love, as Aquinas suggested? (Finnis\n1997; cf. Kierkegaard’s Judge William’s defense of\nmarriage [Either/Or, 1843, vol. 2].)\n\nQuestions of the relation between love and marriage emerge from\nchanging understandings of the role of marriage; in the early modern\nera, further fault lines appear as new understandings of human society\nconflict with the traditional structure of marriage. For Aristotle,\nAugustine, and Aquinas, marriage was unproblematically structured by\nsexual difference, and its distinctive features explained by nature or\nsacrament. But in the early modern era, as doctrines of equal rights\nand contract appeared, a new ideal of relationships between adults as\nfree choices between equals appeared. In this light, the unequal and\nunchosen content of the marriage relationship raised philosophical\nproblems. Thomas Hobbes (1588–1679) acknowledged that his\narguments for rough equality among humans apply to women:\n“whereas some have attributed the dominion [over children] to\nthe man only, as being of the more excellent sex; they misreckon in\nit. For there is not always that difference of strength, or prudence\nbetween the man and the woman, as that the right can be determined\nwithout war.” Nonetheless, Hobbes admits that men dominate in\nmarriage, which he explains (inadequately) thus: “for the most\npart commonwealths have been erected by the fathers, not by the\nmothers of families” (Leviathan, 1651, Ch. 20; Okin\n1979, 198–199, Pateman 1988, 44–50).\n\nLikewise, defending marital hierarchy posed a problem for John Locke\n(1632–1704). Locke ties his rejection of political patriarchy to\na rejection of the patriarchal family, arguing that marriage, like the\nstate, rests on consent, not natural hierarchy; marriage is a\n“voluntary compact.” But Locke fails to follow this\nreasoning consistently, for Lockean marriage remains hierarchical: in\ncases of conflict, “the rule … naturally falls to the\nman’s as the abler and stronger.” Ceding decision-making\npower to one party on the basis of a presumed natural hierarchy\ncreates an internal tension in Locke’s views (The Second\nTreatise of Government, 1690, §77, 81, 82; Okin 1979,\n199–200). This inconsistency prompted Mary Astell’s\n(1666–1731) response: “If all Men are born free,\nhow is it that all women are born slaves? as they must be if the being\nsubjected to the inconstant, uncertain, unknown, arbitrary\nWill of Men, be the perfect Condition of Slavery?”\n(“Reflections upon Marriage,” 1700, 18) Similar tensions\narise for Jean-Jacques Rousseau (1712–1778), whose treatise on\neducation, Émile, describes the unequal status of\nÉmile’s wife, Sophie. Her education, a template for all\nwomen’s, prepares her only to please and serve her husband and\nrear children. Mary Wollstonecraft (1759–1798) attacked\nRousseau’s views on women’s nature, education, and marital\ninequality in A Vindication of the Rights of Woman (see also\nOkin 1979, Chapter 6).\n\nThe contractual understanding of marriage prompts the question as to\nwhy marital obligations should be fixed other than by spousal\nagreement. Immanuel Kant (1724–1804) combined a contractual\naccount of marriage with an Augustinian preoccupation with sexual\nmorality to argue that the distinctive content of the marriage\ncontract was required to make sex permissible. In Kant’s view,\nsex involves morally problematic objectification, or treatment of\noneself and other as a mere means. The marriage right, a “right\nto a person akin to a right to a thing,” gives spouses\n“lifelong possession of each other’s sexual\nattributes,” a transaction supposed to render sex compatible\nwith respect for humanity: “while one person is acquired by the\nother as if it were a thing, the one who is acquired acquires\nthe other in turn; for in this way each reclaims itself and restores\nits personality.” But while these rights, according to Kant,\nmake sex compatible with justice, married sex is not clearly virtuous\nunless procreation is a possibility (Metaphysics of Morals,\n1797–98, Ak 6:277–79, 6:424–427). Kant’s\naccount of sexual objectification has had wide influence—from\nfeminists to new natural lawyers. More surprisingly, given his views\non gender inequality and the wrongness of same-sex sexual activity,\nKant’s account of marriage has been sympathetically\nreconstructed by feminists and defenders of same-sex marriage drawn by\nKant’s focus on equality, reciprocity, and the moral\nrehabilitation of sex within marriage (Herman 1993, Altman 2010,\nPapadaki 2010). Kant interestingly suggests that morally problematic\nrelationships can be reconstructed through equal juridical rights, but\nhow such reconstruction occurs is puzzling (Herman 1993, Brake 2005).\nAmong other things, it is difficult to see how Kant’s insistence\non equal marriage rights can be reconciled with his views on gender\ninequality (Sticker 2020).\n\nCharacteristically, G. W. F. Hegel’s (1770–1831) account\nof marriage synthesizes the preceding themes. Hegel returns to\nAristotle’s understanding of (nuclear) marriage as the\nfoundation of a healthy state, while explicating its contribution in\nterms of spousal love. Hegel criticized Kant’s reduction of\nmarriage to contract as “disgraceful” because spouses\nbegin “from the point of view of contract—i.e. that of\nindividual personality as a self-sufficient unit—in order to\nsupersede it.” They “consent to constitute a\nsingle person and to give up their natural and individual\npersonalities within this union.” The essence of marriage is\nethical love, “the consciousness of this union as a substantial\nend, and hence in love, trust, and the sharing of the whole of\nindividual existence.” Ethical love is not, like sexual love,\ncontingent: “Marriage should not be disrupted by passion, for\nthe latter is subordinate to it” (Elements of the Philosophy\nof Right, 1821, §162–63, 163A).\n\nLike his predecessors, Hegel must justify the distinctive features of\nmarriage, and in particular, why, if it is the ethical love\nrelationship which is ethically significant, formal marriage is\nnecessary. Hegel’s contemporary Friedrich von Schlegel had\nargued that love can exist outside marriage—a point which Hegel\ndenounced as the argument of a seducer! For Hegel, ethical love\ndepends on publicly assuming spousal roles which define individuals as\nmembers in a larger unit. Such unselfish membership links marriage and\nthe state. Marriage plays an important role in Hegel’s system of\nright, which culminates in ethical life, the customs and institutions\nof society: family, civil society, and the state. The role of marriage\nis to prepare men to relate to other citizens as sharers in a common\nenterprise. In taking family relationships as conditions for good\ncitizenship, Hegel follows Aristotle and influences Rawls and Sandel;\nit is also notable that he takes marriage as a microcosm of the\nstate.\n\nKant and Hegel attempted to show that the distinctive features of\nmarriage could be explained and justified by foundational normative\nprinciples. In contrast, early feminists argued that marital hierarchy\nwas simply an unjust remnant of a pre-modern era. John Stuart Mill\n(1806–1873) argued that women’s subordination within\nmarriage originated in physical force—an anomalous holdover of\nthe ‘law of the strongest’. Like Wollstonecraft in her\n1792 A Vindication of the Rights of Woman, Mill compared\nmarriage and slavery: under coverture wives had no legal rights,\nlittle remedy for abuse, and, worse, were required to live in intimacy\nwith their ‘masters’. This example of an inequality based\non force had persisted so long, Mill argued, because all men had an\ninterest in retaining it. Mill challenged the contractual view that\nentry into marriage was fully voluntary for women, pointing out that\ntheir options were so limited that marriage was “only\nHobson’s choice, ‘that or none’” (The\nSubjection of Women, 1869, 29). He also challenged the view that\nwomen’s nature justified marital inequality: in light of\ndifferent socialization of girls and boys, there was no way to tell\nwhat woman’s nature really was. Like Wollstonecraft, Mill\ndescribed the ideal marital relationship as one of equal friendship\n(Abbey and Den Uyl, 2001). Such marriages would be “schools of\njustice” for children, teaching them to treat others as equals.\nBut marital inequality was a school of injustice, teaching boys\nunearned privilege and corrupting future citizens. The comparison of\nmarriage with slavery has been taken up by more recent feminists\n(Cronan 1973), as has the argument that marital injustice creates\nunjust citizens (Okin 1994).\n\nMarxists also saw marriage as originating in ancient exercises of\nforce and as continuing to contribute to the exploitation of women.\nFriedrich Engels (1820–1895) argued that monogamous marriage\nissued from a “world historical defeat of the female\nsex” (Engels 1884, 120). Exclusive monogamy “was not\nin any way the fruit of individual sex love, with which it had nothing\nwhatever to do … [but was based on] economic\nconditions—on the victory of private property over primitive,\nnatural communal property” (ibid., 128). Monogamy\nallowed men to control women and reproduction, thereby facilitating\nthe intergenerational transfer of private property by producing\nundisputed heirs. Karl Marx (1818–83) argued that abolishing the\nprivate family would liberate women from male ownership, ending their\nstatus “as mere instruments of production” (The\nCommunist Manifesto, Marx 1848, 173). The Marxist linking of\npatriarchy and capitalism, in particular its understanding of marriage\nas an ownership relation ideologically underpinning the capitalist\norder, has been especially influential in feminist thought (Pateman\n1988, cf. McMurtry 1972).\n3. Marriage and Morals\n\nThe idea that marriage has a special moral status and entails fixed\nmoral obligations is widespread—and philosophically\ncontroversial. Marriage is a legal contract, although an anomalous one\n(see 4.1); as the idea of it as a contract has taken hold, questions\nhave arisen as to how far its obligations should be subject to\nindividual choice. The contractual view of marriage implies that\nspouses can choose marital obligations to suit their interests.\nHowever, to some, the value of marriage consists precisely in the\nlimitations it sets on individual choice in the service of a greater\ngood: thus, Hegel commented that arranged marriage is the most ethical\nform of marriage because it subordinates personal choice to the\ninstitution. The institutional view holds that the purpose of the\ninstitution defines its obligations, taking precedence over\nspouses’ desires, either in the service of a procreative union\nor to protect spousal love, in the two most prominent forms of this\nview. These theories have implications for the moral status of\nextra-marital sex and divorce, as well as the purpose of marriage.\n3.1 Contractual Views\n\nOn the contractual view, the moral terms and obligations of marriage\nare understood as promises between spouses. Their content is supplied\nby surrounding social and legal practices, but their promissory nature\nimplies that parties to the promise can negotiate the terms and\nrelease each other from marital obligations.\n\nOne rationale for treating marital obligations as such promises might\nbe thought to be the voluntaristic account of obligation. On this\nview, all special obligations (as opposed to general duties) are the\nresult of voluntary undertakings; promises are then the paradigm of\nspecial obligations (see entry on Special Obligations). Thus, whatever\nspecial obligations spouses have to one another must originate in\nvoluntary agreement, best understood as promise. We will return to\nthis below. A second rationale is the assumption that existing\nmarriage practices are morally arbitrary, in the sense that there is\nno special moral reason for their structure. Further, there are\ndiverse social understandings of marriage. If the choice between them\nis morally arbitrary, there is no moral reason for spouses to adopt\none specific set of marital obligations; it is up to spouses to choose\ntheir terms. Thus, the contractual account depends upon the assumption\nthat there is no decisive moral reason for a particular marital\nstructure.\n\nOn the contractual account, not just any contracts count as marriages.\nThe default content of marital promises is supplied by social and\nlegal practice: sexual exclusivity, staying married, and so on. But it\nentails that spouses may release one another from these moral\nobligations. For example, extra-marital sex has often been construed\nas morally wrong by virtue of promise-breaking: if spouses promise\nsexual exclusivity, extra-marital sex breaks a promise and is thereby\nprima facie wrong. However, if marital obligations are simply\npromises between the spouses, then the parties can release one\nanother, making consensual extra-marital sex permissible (Wasserstrom\n1974). Marriage is also sometimes taken to involve a promise to stay\nmarried. This seems to make unilateral divorce morally problematic, as\npromisors cannot release themselves from promissory obligations (Morse\n2006). But standard conditions for overriding promissory obligations,\nsuch as conflict with more stringent moral duties, inability to\nperform, or default by the other party to a reciprocal promise would\npermit at least some unilateral divorces (Houlgate 2005, Chapter 12).\nSome theorists of marriage have suggested that marital promises are\nconditional on enduring love or fulfilling sex (Marquis 2005, Moller\n2003). But this assumption is at odds with the normal assumption that\npromissory conditions are to be stated explicitly.\n\nRelease from the marriage promise is not the only condition for\npermissible divorce on the contractual view. Spouses may not be\nobligated to one another to stay married—but they may have\nparental duties to do so: if divorce causes avoidable harm to\nchildren, it is prima facie wrong (Houlgate 2005, Chapter 12,\nRussell 1929, Chapter 16). However, in some cases divorce will benefit\nthe child—as when it is the means to escape abuse. A vast\nempirical literature disputes the likely effects of divorce on\nchildren (Galston 1991, 283–288, Young 1995). What is notable\nhere, philosophically, is that this moral reason against divorce is\nnot conceived as a spousal, but a parental, duty.\n\nMarriage is widely taken to have an amatory core, suggesting that a\nfurther marital promise is a promise to love, as expressed in wedding\nvows ‘to love and cherish’. But the possibility of such\npromises has met with skepticism. If one cannot control whether one\nloves, the maxim that ‘ought implies can’ entails that one\ncannot promise to love. One line of response has been to suggest that\nmarriage involves a promise not to feel but to behave a certain\nway—to act in ways likely to sustain the relationship. But such\nreinterpretations of the marital promise face a problem: promises\ndepend on what promisors intend to promise—and presumably most\nspouses do not intend to promise mere behavior (Martin 1993, Landau\n2004, Wilson 1989, Mendus 1984, Brake 2012, Chapter 1; see also\nKronqvist 2011). However, developing neuroenhancement technology\npromises to bring love under control through “love drugs”\nwhich would produce bonding hormones such as oxytocin. While the use\nof neuroenhancement to keep one’s vows raises questions about\nauthenticity and the nature of love (as well as concerns regarding its\nuse in abusive relationships), it is difficult to see how such\ntechnology morally differs from other love-sustaining devices such as\nromantic dinners—except that it is more likely to be effective\n(Savulescu and Sandberg 2008).\n\nOne objection to the contractual account is that, without appeal to\nthe purpose of the institution, there is no reason why not just any\nset of promises count as marriage (Finnis 2008). The objection\ncontinues that the contractual account cannot explain the point of\nmarriage. Some marriage contractualists accept this implication.\nAccording to the “bachelor’s argument,” marriage is\nirrational: chances of a strongly dis-preferred outcome (a loveless\nmarriage) are too high (Moller 2003). Defenders of the rationality of\nmarriage have replied that marital obligations are rational because\nthey help agents to secure their long-term interests in the face of\npassing desires (Landau 2004). From the institutional perspective,\nevaluating the rationality of marriage thus, in terms of fulfilling\nsubjective preferences, clashes with the tradition of viewing it as\nuniquely enabling certain objective human goods; however, a positive\ncase must be made for the latter view.\n\nAnother objection to the contractual view concerns voluntarism.\nCritics of the voluntarist approach to the family deny that family\nmorality is exhausted by voluntary obligations (Sommers 1989).\nVoluntarist conceptions of the family conflict with common-sense\nintuitions that there are unchosen special duties between family\nmembers, such as filial duties. However, even if voluntarism is false,\nthis does not suffice to establish special spousal duties. On the\nother hand, voluntarism alone does not entail the contractual view,\nfor it does not entail that spouses can negotiate the obligations of\nmarriage or that the obligations be subject to release, only that\nspouses must agree to them. Voluntarism, in other words, need not\nextend to the choice of marital obligations and hence need not entail\nthe contractual account. The contractual account depends on denying\nthat there is decisive moral reason for marriage to incorporate\ncertain fixed obligations. Let us turn to the case that there is such\nreason.\n3.2 Institutional Views\n\nThe main theoretical alternatives to the contractual view hold that\nmarital obligations are defined by the purpose of the institution and\nthat spouses cannot alter these institutional obligations (much like\nthe professional moral obligations of a doctor; to become a doctor,\none must voluntarily accept the role and its obligations, and one\ncannot negotiate the content of these obligations). The challenge for\ninstitutional views is to defend such a view of marriage, explaining\nwhy spouses may not jointly agree to alter obligations associated with\nmarriage. Kant confronted this question, arguing that special marital\nrights were morally necessary for permissible sex. His account of\nsexual objectification has influenced a prominent contemporary rival\nto the contractual view—the new natural law view, which takes\nprocreation as essential to marriage. A second widespread approach\nfocuses solely on love as the defining purpose of marriage.\n3.2.1 New Natural Law: Marriage as Procreative Union\n\nLike Kant, the new natural law account of marriage focuses on the\npermissible exercise of sexual attributes; following Aquinas, it\nemphasizes the goods of marriage, which new natural lawyers, notably\nJohn Finnis (cf. George 2000, Grisez 1993, Lee 2008), identify as\nreproduction and fides—roughly, marital friendship (see\nentry on The Natural Law Tradition in Ethics). Marriage is here taken\nto be the institution uniquely apt for conceiving and rearing children\nby securing the participation of both parents in an ongoing union. The\nthought is that there is a distinctive marital good related to sexual\ncapacities, consisting in procreation and fides, and\nrealizable only in marriage. Within marriage, sex may be engaged in\nfor the sake of the marital good. Marital sex need not result in\nconception to be permissible; it is enough that it is open towards\nprocreation and expresses fides. The view does not entail\nthat it is wrong to take pleasure in sex, for this can be part of the\nmarital good.\n\nHowever, sex outside marriage (as defined here) cannot be orientated\ntoward the marital good. Furthermore, sexual activity not orientated\ntoward this good—including same-sex activity, masturbation,\ncontracepted sex, sex without marital commitment (even within legal\nmarriage)—is valueless; it does not instantiate any basic good.\nFurthermore, such activity is impermissible because it violates the\nbasic good of marriage. Marital sex is thought to instantiate the good\nof marriage. By contrast, non-marital sex is thought to treat sexual\ncapacities instrumentally—using them merely for pleasure. (It is\nhere that the account is influenced by Kant.) Non-marital sex violates\nthe good of marriage by treating sexual capacities in a way contrary\nto that good. Furthermore, for an agent merely to condone non-marital\nsex damages his or her relation to the marital good, for even a\nhypothetical willingness to treat sex instrumentally precludes proper\nmarital commitment (Finnis 1997, 120).\n\nAs Finnis emphasizes, one feature of the new natural law account of\nmarriage is that the structure of marriage can be fully explained by\nits purpose. Marriage is between one man and one woman because this is\nthe unit able to procreate without third-party assistance; permanence\nis required to give children a lifelong family. Finnis charges, as\nnoted above, that accounts which do not ground marriage in this\npurpose have no theoretical reason to resist the extension of marriage\nto polygamy, incest, and bestiality (Finnis 1995). As all non-marital\nsex fails to instantiate basic goods, there is no way morally to\ndistinguish these different relations.\n\nA further point concerns law: to guide citizens’ judgments and\nchoices towards the relationship in which they can uniquely achieve\nthe marital good, the state should endorse marriage, as understood on\nthis view, and not recognize same-sex relationships as marriages.\nHowever, it might be asked whether this is an effective way to guide\nchoice, and whether state resources might be better spent promoting\nother basic human goods. Moreover, as the argument equally implies a\nstate interest in discouraging contraception, divorce, and\nextra-marital sex, the focus on same-sex marriage appears arbitrary\n(Garrett 2008, Macedo 1995). This objection is a specific instance of\na more general objection: this account treats sex and the marital good\ndifferently than it does the other basic human goods. Not only is less\nattention paid to promoting those goods legally (and discouraging\nbehavior contrary to them), but the moral principle forbidding action\ncontrary to basic human goods is not consistently applied\nelsewhere—for example, to eating unhealthily (Garrett 2008).\n\nA second objection attacks the claim that non-marital sex cannot\ninstantiate any basic human goods. This implausibly consigns all\nnon-marital sex (including all contracepted sex) to the same value as\nanonymous sex, prostitution, or masturbation (Macedo 1995, 282).\nPlausibly, non-marital sex can instantiate goods such as\n“pleasure, communication, emotional growth, personal stability,\nlong-term fulfillment” (Corvino 2005, 512), or other basic human\ngoods identified by the new natural law account, such as knowledge,\nplay, and friendship (Garrett 2008; see also Blankschaen 2020).\n\nA third objection is related. The view seems to involve a double\nstandard in permitting infertile opposite-sex couples to marry\n(Corvino 2005; Macedo 1995). The new natural lawyers have responded\nthat penile-vaginal sex is reproductive in type, even if not in\neffect, while same-sex activity can never be reproductive in type\n(Finnis 1997, cf. George 2000, Lee 2008). Reproductive-type sex can be\noriented towards procreation even if not procreative in effect. But it\nis unclear how individuals who know themselves to be infertile can\nhave sex for the reason of procreation (Macedo 1995, Buccola 2005).\nUltimately, to differentiate infertile heterosexual couples from\nsame-sex couples, new natural lawyers invoke complementarity between\nmen and women as partners and parents. Thus, the defense of this\naccount of marriage turns on a controversial view of the nature and\nimportance of sexual difference (Finnis 1997, Lee 2008).\n\nA related, influential argument focuses on the definition of marriage.\nThis argues that marriage is necessarily between one man and one woman\nbecause it involves a comprehensive union between spouses, a unity of\nlives, minds, and bodies. Organic bodily union requires being united\nfor a biological purpose, in a procreative-type act (Girgis, et al.,\n2010). Like the new natural law arguments, this has raised questions\nas to why only, and all, different-sex couples, even infertile ones,\ncan partake in procreative-type acts, and why bodily union has special\nsignificance (Arroyo 2018, Johnson 2013).\n\nWhile much discussion of new natural law accounts of marriage\noscillates between attacking and defending the basis in biological sex\ndifference, some theorists sympathetic to new natural law attempt to\navoid the Scylla of rigid biological restrictions and the Charybdis of\nliberal “plasticity” regarding marriage (Goldstein 2011).\nGoldstein, for one, offers an account of marriage as a project\ngenerated by the basic good of friendship; while this project includes\nprocreation as a core feature, the institution of marriage has, on\nthis account, a compensatory power, meaning that the institution\nitself can compensate for failures such as inability to procreate.\nSuch an account grounds marriage in the new natural law account of\nflourishing, but it also allows the extension to same-sex marriage\nwithout, according to Goldstein, permitting other forms such as\npolygamy.\n3.2.2 Marriage as Protecting Love\n\nA second widespread (though less unified) institutional approach to\nmarriage appeals to the ideal marital love relationship to define the\nstructure of marriage. This approach, in the work of different\nphilosophers, yields a variety of specific prescriptions, on, for\nexample, whether marital love (or committed romantic love in general)\nrequires sexual difference or sexual exclusivity (Scruton 1986,\n305–311, Chapter 11, Halwani 2003, 226–242, Chartier\n2016). Some, but not all, proponents explicitly argue that the marital\nlove relationship is an objective good (Scruton 1986, Chapter 11,\n356–361, Martin 1993). These views, however, all take the\nessential feature, and purpose, of marriage to be protecting a sexual\nlove relationship. The thought is that marriage helps to maintain and\nsupport a relationship either in itself valuable, or at least valued\nby the parties to it.\n\nOn this approach, the structure of marriage derives from the behavior\nneeded to maintain such a relationship. Thus marriage involves a\ncommitment to act for the relationship as well as to exclude\nincompatible options—although there is controversy over what\nspecific policies these general commitments entail. To take an\nuncontroversial example, marriage creates obligations to perform acts\nwhich sustain love, such as focusing on the beloved’s good\nqualities (Landau 2004). More controversially, some philosophers argue\nthat sustaining a love relationship requires sexual exclusivity. The\nthought is that sexual activity generates intimacy and affection, and\nthat objects of affection and intimacy will likely come into\ncompetition, threatening the marital relationship. Another version\nfocuses on the emotional harm, and consequent damage to the\nrelationship, caused by sexual jealousy. Thus, due to the\npsychological conditions required to maintain romantic love, marriage,\nas a love-protecting institution, generates obligations to sexual\nexclusivity (Martin 1993, Martin 1994, Scruton 1986, Chapter 11,\n356–361, Steinbock 1986). However, philosophers dispute the\npsychological conditions needed to maintain romantic love. Some argue\nthat casual extra-marital sex need not create competing relationships\nor trigger jealousy (Halwani 2003, 235; Wasserstrom 1974). Indeed,\nsome have even argued that extra-marital sex, or greater social\ntolerance thereof, could strengthen otherwise difficult marriages\n(Russell 1929, Chapter 16), and some polyamorists (those who engage in\nmultiple sex or love relationships) claim that polyamory allows\ngreater honesty and openness than exclusivity (Emens 2004). Other\nphilosophers have treated sexual fidelity as something of a red\nherring, shifting focus to other qualities of an ideal relationship\nsuch as attentiveness, warmth, and honesty, or a commitment to justice\nin the relationship (Martin 1993, Kleingeld 1998).\n\nViews understanding marriage as protecting love generate diverse\nconclusions regarding its obligations. But such views share two\ncrucial assumptions: that marriage has a role to play in creating a\ncommitment to a love relationship, and that such commitments may be\nefficacious in protecting love (Cave 2003, Landau 2004, Martin 1993,\nMartin 1994, Mendus 1984, Scruton 1986, 356–361). However, both\nof these assumptions may be questioned. First, even if commitment can\nprotect a love relationship, why must such a commitment be made\nthrough a formal marriage? If it is possible to maintain a long-term\nromantic relationship outside marriage, the question as to the point\nof marriage re-emerges: do we really need marriage for love? May not\nthe legal and social supports of marriage, indeed, trap individuals in\na loveless marriage or themselves corrode love by associating it with\nobligation? (Card 1996, Cave 2003; see also Gheaus 2016) Second, can\ncommitment, within or without marriage, really protect romantic love?\nHigh divorce rates would seem to suggest not. Of course, even if, as\ndiscussed in 3.1, agents cannot control whether they love, they can\nmake a commitment to act in ways protective of love (Landau 2004,\nMendus 1984). But this returns us the difficulty, suggested by the\npreceding paragraph, of knowing how to protect love!\n\nReflecting the difficulty of generating specific rules to protect\nlove, many such views have understood the ethical content of marriage\nin terms of virtues (Steinbock 1991, Scruton 1986, Chapter 11,\n356–361). The virtue approach analyzes marriage in terms of the\ndispositions it cultivates, an approach which, by its reference to\nemotional states, promises to explain the relevance of marriage to\nlove. However, such approaches must explain how marriage fosters\nvirtues (Brake 2012). Some virtue accounts cite the effects of its\nsocial status: marriage triggers social reactions which secure spousal\nprivacy and ward off the disruptive attention of outsiders (Scruton\n1986, 356–361). Its legal obligations, too, can be understood as\nUlysses\n contracts[1]:\n they protect relationships when spontaneous affection wavers,\nsecuring agents’ long-term commitments against passing desires.\nWhether or not such explanations ultimately show that marital status\nand obligations can play a role in protecting love, the general focus\non ideal marital love relationships may be characterized as overly\nidealistic when contrasted with problems in actual marriages, such as\nspousal abuse (Card 1996). This last point suggests that moral\nanalysis of marriage cannot be entirely separated from political and\nsocial inquiry.\n4. The Politics of Marriage\n\nIn political philosophy, discussions of marriage law invoke diverse\nconsiderations, reflecting the theoretical orientations of\ncontributors to the debate. This discussion will set out the main\nconsiderations invoked in arguments concerning the legal structure of\nmarriage.\n4.1 Marriage and Legal Contract\n\nMarriage is a legal contract, but it has long been recognized to be an\nanomalous one. Until the 1970s in the U.S., marriage law restricted\ndivorce and defined the terms of marriage on the basis of gender.\nMarking a shift towards greater alignment of marriage with contractual\nprinciples of individualization, marriage law no longer imposes\ngender-specific obligations, it allows pre-nuptial property\nagreements, and it permits easier exit through no-fault divorce. But\nmarriage remains (at least in U.S. federal law) an anomalous contract:\n“there is no written document, each party gives up its right to\nself-protection, the terms of the contract cannot be re-negotiated,\nneither party need understand its terms, it must be between two and\nonly two people, and [until 2015, when the US Supreme Court decision\nin Obergefell v. Hodges established same-sex marriage in the\nUS] these two people must be one man and one woman” (Kymlicka\n1991, 88).\n\nProponents of the contractualization, or privatization, of marriage\nhave argued that marriage should be brought further into line with the\ncontractual paradigm. A default assumption for some liberals, as for\nlibertarians, is that competent adults should be legally permitted to\nchoose the terms of their interaction. In a society characterized by\nfreedom of contract, restrictions on entry to or exit from marriage,\nor the content of its legal obligations, appear to be an illiberal\nanomaly. Full contractualization would imply that there should be no\nlaw of marriage at all—marriage officiation would be left to\nreligions or private organizations, with the state enforcing whatever\nprivate contracts individuals make and otherwise not interfering\n(Vanderheiden 1999, Sunstein and Thaler 2008, Chartier 2016; for a\ncritique of contractualization, see Chambers 2016). The many legal\nimplications of marriage for benefit entitlements, inheritance,\ntaxation, and so on, can also be seen as a form of state interference\nin private choice. By conferring these benefits, as well as merely\nrecognizing marriage as a legal status, the state encourages the\nrelationships thereby formalized (Waldron 1988–89,\n 1149–1152).[2]\n\nMarriage is the basis for legal discrimination in a number of\ncontexts; such discrimination requires justification, as does the\nresource allocation involved in providing marital benefits (Cave 2004,\nVanderheiden 1999). In the absence of such justification, providing\nbenefits through marriage may treat the unmarried unjustly, as their\nexclusion from such benefits would then be arbitrary (Card 1996).\nThus, there is an onus to provide a rationale justifying such resource\nallocations and legal discrimination on the basis of marriage, as well\nas for restricting marriage in ways that other contracts are not\nrestricted.\n\nBefore exploring some common rationales, it is worth noting that\ncritics of the social contract model of the state and of freedom of\ncontract have used the example of marriage against contractual\nprinciples. First, Marxists have argued that freedom of contract is\ncompatible with exploitation and oppression—and Marxist\nfeminists have taken marriage as a special example, arguing against\ncontractualizing it on these grounds (Pateman 1988, 162–188).\nSuch points, as we will see, suggest the need for rules governing\nproperty division on divorce. Second, communitarians have argued that\ncontractual relations are inferior to those characterized by trust and\naffection—again, using marriage as a special example (Sandel\n1982, 31–35, cf. Hegel 1821, §75, §161A). This\nobjection applies not only to contractualizing marriage, but more\ngenerally, to treating it as a case for application of principles of\njustice: the concern is that a rights-based perspective will undermine\nthe morally superior affection between family members, importing\nconsiderations of individual desert which alienate family members from\ntheir previous unselfish identification with the whole (Sandel 1982,\n31–35). However, although marriages are not merely an exchange\nof rights, spousal rights protect spouses’ interests when\naffection fails; given the existence of abuse and economic inequality\nwithin marriage, these rights are especially important for protecting\nindividuals within, and after, marriage (Kleingeld 1998, Shanley 2004,\n3–30, Waldron 1988).\n4.2 The Rationale of Marriage Law\n\nAs noted, a rationale must be given for marriage law which explains\nthe restrictions placed on entry and exit, the allocation of resources\nto marriage, and legal discrimination on the basis of it. The next\nsection will examine gender restrictions on entry; this section will\nexamine reasons for recognizing marriage in law at all, allocating\nresources to it, and constraining property division on divorce.\n\nA first reason for recognizing marriage should be set aside. This is\nthat the monogamous heterosexual family unit is a natural,\npre-political structure which the state must respect in the form in\nwhich it finds it (Morse 2006; cf. new natural lawyers, Girgis et al.\n2010). But, whatever the natural reproductive unit may be, marriage\nlaw, as legislation, is constrained by principles of justice\nconstraining legislation. Within most contemporary political\nphilosophy, the naturalness of a given practice is irrelevant; indeed,\nin no area other than the family is it proposed that law should follow\nnature (with the possible exception of laws regarding suicide).\nFinally, such objections must answer to feminist concerns that\nexcluding the family unit from principles of justice, allowing natural\naffection to regulate it, has facilitated inequality and abuse within\nit (see section 5).\n\nLet us then begin with the question of why marriage should be\nrecognized in law at all. One answer is that legal recognition conveys\nthe state’s endorsement, guiding individuals into a valuable\nform of life (George 2000). A second is that legal recognition is\nnecessary to maintain and protect social support for the institution,\na valuable form of life which would otherwise erode (Raz 1986, 162,\n392–3; Scruton 1986, 356–361; see discussion in Waldron\n1988–89). But this prompts the question as to why this form of\nlife is valuable.\n\nIt is sometimes argued that traditions, having stood the test of time,\nhave proved their value. Not only is marriage itself such a tradition,\nbut through its child-rearing role it can pass on other traditions\n(Sommers 1989, Scruton 1986, 356–361, cf. Devlin 1965, Chapter\n4). But many marital traditions—coverture, gender-structured\nlegal duties, marital rape exemptions, inter-racial marriage\nbans—have been unjust. Tradition provides at best a prima\nfacie reason for legislation which may be overridden by\nconsiderations of justice. Further, in a diverse society, there are\nmany competing traditions, amongst which this rationale fails to\nchoose (Garrett 2008).\n\nAn account of the value of a particular form of marriage itself (and\nnot just qua tradition) is needed. One thought is that\nmonogamous marriage encourages the sexual self-control needed for\nhealth and happiness; another is that it encourages the goods of love\nand intimacy found in committed relationships. State support for\nmonogamous marriage, by providing incentives to enter marital\ncommitments, thus helps people lead better lives (e.g. Macedo 1995,\n286). However, this approach faces objections. First, the explanation\nin terms of emotional goods underdetermines the institution to be\nsupported: other relationships, such as friendships, embody emotional\ngoods. Second, claims about the value of sexual self-control are\ncontroversial; objectors might argue that polygamy, polyamory, or\npromiscuity are equally good options (see 5.2). There is a further\nproblem with this justification, which speaks to a division within\nliberal thought. Some liberals embrace neutrality, the view that the\nstate should not base law on controversial judgments about what\nconstitutes valuable living. To such neutral liberals, this class of\nrationales, which appeal to controversial value judgments about sex\nand love, must be excluded (Rawls 1997, 779). Some theorists have\nsought to develop rationales consistent with political liberalism,\narguing, for instance, that the intimate dyadic marital relationship\nprotects autonomy (Bennett 2003), or that some form of marriage could\nbe justified by its efficiency in providing benefits (Toop 2019) or\nits role in protecting diverse caring relationships (Brake 2012),\nfragile romantic love relationships (Cave 2017), or caregivers and\nchildren (Hartley and Watson 2012, Toop 2019; see also May 2016,\nWedgwood 2016).\n\nIt is widely accepted that the state should protect children. If\ntwo-parent families benefit children, incentives to marry may be\njustified as promoting two-parent families and hence children’s\nwelfare. One benefit of two-parent families is economic: there is a\ncorrelation between single motherhood and poverty. Another benefit is\nemotional: children appear to benefit from having two parents (Galston\n1991, 283–288). (Moreover, some argue that gender\ncomplementarity in parenting benefits children; but empirical evidence\ndoes not seem to support this [Lee 2008, Nussbaum 1999, 205, Manning\net al., 2014].)\n\nOne objection to this line of argument is that marriage is an\nineffective child anti-poverty plan. For one thing, this account\nassumes that incentives to marry will lead a significant number of\nparents who would not otherwise have married to marry. But marriage\nand child-rearing have increasingly diverged despite incentives to\nmarry. Second, this approach does not address the many children\noutside marriages and in poor two-parent families. Child poverty could\nbe addressed more efficiently through direct anti-child-poverty\nprograms rather than the indirect strategy of marriage (Cave 2004;\nVanderheiden 1999; Young 1995). Moreover, there is controversy over\nthe psychological effects of single parenthood, particularly over the\ncausality underlying certain correlations: for instance, are children\nof divorce unhappier due to divorce itself, or to the high-conflict\nmarriage preceding it? (Young 1995) Indeed, some authors have recently\nargued that children might be better protected by legally separating\nmarriage from parenting: freestanding parenting frameworks would be\nmore durable than marriage (which can end in divorce), would protect\nchildren outside of marriages, and would accommodate new family forms\nsuch as three-parent families (Brennan and Cameron 2016, Shrage 2018;\nsee also Chan and Cutas 2012).\n\nA related, but distinct, line of thought invokes the alleged\npsychological effects of two-parent families to argue that marriage\nbenefits society by promoting good citizenship and state stability\n(Galston 1991, 283–288). This depends on the empirical case (as\nwe have seen, a contested one) that children of single parents face\npsychological and economic hurdles which threaten their capacity to\nacquire the virtues of citizenship. Moreover, if economic dependence\nproduces power inequality within marriage, then Mill’s\n‘school of injustice’ objection applies—an\ninstitution teaching injustice is likely to undermine the virtues of\ncitizenship (Okin 1994, Young 1995).\n\nFinally, a rationale for restricting the terms of exit from marriage\n(but not for supporting it as a form of life) is the protection of\nwomen and children following divorce. Women in gender-structured\nmarriages, particularly if they have children, tend to become\neconomically vulnerable. Statistically, married women are more likely\nthan their husbands to work in less well-paid part-time work, or to\ngive up paid work entirely, especially to meet the demands of\nchild-rearing. Thus, following divorce, women are likely to have a\nreduced standard of living, even to enter poverty. Because these\npatterns of choice within marriages lead to inequalities between men\nand women, property division on divorce is a matter of equality or\nequal opportunity, and so a just law of divorce is essential to gender\njustice (Okin 1989, Chapters 7 and 8; Rawls 1997, 787–794;\nShanley 2004, 3–30; Waldron 1988, and see 5.1). However, it can\nstill be asked why a law recognizing marriage as such should be\nnecessary, as opposed to default rules governing property distribution\nwhen such gender-structured relationships end (Sunstein and Thaler\n2008, Chambers 2017). Indeed, placing these restrictions only on\nmarriage, as opposed to enacting general default rules, may make\nmarriage less attractive, especially to men, and hence be\ncounter-productive, leaving women more vulnerable.\n\nThe preceding two rationales are both weakened by the diminished\nsocial role of marriage; changing legal and social norms undermine its\neffectiveness as a policy tool. In the 20th century,\nmarriage was beset by a “perfect storm”: the expectation\nthat it should be emotionally fulfilling, women’s liberation,\nand effective contraception (Coontz 2006, Chapter 16). Legally, exit\nfrom marriage has become relatively easy since the ‘no-fault\ndivorce revolution’ of the 1970’s. Moreover, cohabitation\nand child-rearing increasingly take place outside marriage. This\nreflects the end of laws against unmarried cohabitation and legal\ndiscrimination against children on grounds of\n‘illegitimacy’, as well as diminishing social stigmas\nagainst such behavior. Given such significant changes, marriage is at\nbest an indirect strategy for achieving goals such as protecting women\nor children (Cave 2004, Sunstein and Thaler 2008, Vanderheiden\n1999).\n\nSome theorists have argued, in the absence of a compelling rationale\nfor marriage law, for abolishing marriage altogether, replacing it\nwith civil unions or domestic partnerships. This line of thought will\nbe taken up in 4.4, after an examination of the debate over same-sex\nmarriage.\n4.3 Same-Sex Marriage\n\nMany arguments for same-sex marriage invoke liberal principles of\njustice such as equal treatment, equal opportunity, and neutrality.\nWhere same-sex marriage is not recognized in law, marriage provides\nbenefits which are denied to same-sex couples on the basis of their\norientation; if the function of marriage is the legal recognition of\nloving, or “voluntary intimate,” relationships, the\nexclusion of same-sex relationships appears arbitrary and unjustly\ndiscriminatory (Wellington 1995, 13). Same-sex relationships are\nrelevantly similar to different-sex relationships recognized as\nmarriages, yet the state denies gays and lesbians access to the\nbenefits of marriage, hence treating them unequally (Mohr 2005, Rajczi\n2008, Williams 2011). Further, arguments in support of such\ndiscrimination seem to depend on controversial moral claims regarding\nhomosexuality of the sort excluded by neutrality (Wellington 1995,\nSchaff 2004, Wedgwood 1999, Arroyo 2018).\n\nA political compromise (sometimes proposed in same-sex marriage\ndebates) of restricting marriage to different-sex couples and offering\ncivil unions or domestic partnerships to same-sex couples does not\nfully answer the arguments for same-sex marriage. To see why such a\ntwo-tier solution fails to address the arguments grounded in equal\ntreatment, we must consider what benefits marriage provides. There are\ntangible benefits such as eligibility for health insurance and\npensions, privacy rights, immigration eligibility, and hospital\nvisiting rights (see Mohr 2005, Chapter 3), which could be provided\nthrough an alternate status. Crucially, however, there is also the\nimportant benefit of legal, and indirectly social, recognition of a\nrelationship as marriage. The status of marriage itself confers\nlegitimacy and invokes social support. A two-tier system would not\nprovide equal treatment because it does not confer on same-sex\nrelationships the status associated with marriage.\n\nIn addition, some philosophers have argued that excluding gays and\nlesbians from marriage is central to gay and lesbian oppression,\nmaking them ‘second-class citizens’ and underlying social\ndiscrimination against them. Marriage is central to concepts of good\ncitizenship, and so exclusion from it displaces gays and lesbians from\nfull and equal citizenship: “being fit for marriage is\nintimately bound up with our cultural conception of what it means to\nbe a citizen … because marriage is culturally conceived as\nplaying a uniquely foundational role in sustaining civil\nsociety” (Calhoun 2000, 108). From this perspective, the\n‘separate-but-equal’ category of civil unions retains the\nharmful legal symbol of inferiority (Card 2007, Mohr 2005, 89, Calhoun\n2000, Chapter 5; cf. Stivers and Valls 2007; for a comprehensive\nsurvey of these issues, see Macedo 2015).\n\nHowever, if marriage is essentially different-sex, excluding same-sex\ncouples is not unequal treatment; same-sex relationships simply do not\nqualify as marriages. One case that marriage is essentially\ndifferent-sex invokes linguistic definition: marriage is by definition\ndifferent-sex, just as a bachelor is by definition an unmarried man\n(Stainton, cited in Mercier 2001). But this confuses meaning and\nreference. Past applications of a term need not yield necessary and\nsufficient criteria for applying it: ‘marriage’, like\n‘citizen’, may be extended to new cases without thereby\nchanging its meaning (Mercier 2001). As noted above, appeal to past\ndefinition begs the question of what the legal definition should be\n(Stivers and Valls 2007).\n\nA normative argument for that marriage is essentially different-sex\nappeals to its purpose: reproduction in a naturally procreative unit\n(see 3.2.a). But marriage does not require that spouses be able to\nprocreate naturally, or that they intend to do so at all. Further,\nmarried couples adopt and reproduce using donated gametes, rather than\nprocreating ‘naturally’. Nor do proponents of this\nobjection to same-sex marriage generally suggest that entry to\nmarriage should be restricted by excluding those unable to procreate\nwithout third-party assistance, or not intending to do so.\n\nIndeed, as the existence of intentionally childless married couples\nsuggests, marriage has purposes other than\nchild-rearing—notably, fostering a committed relationship (Mohr\n2005, Wellington 1995, Wedgwood 1999). This point suggests a second\ndefense of same-sex marriage: exclusive marital commitments are goods\nwhich the state should promote amongst same-sex as well as\nopposite-sex couples (Macedo 1995). As noted above, such rationales\ncome into tension with liberal neutrality; further controversy\nregarding them will be discussed below (5.2).\n\nSome arguments against same-sex marriage invoke a precautionary\nprinciple urging that changes which might affect child welfare be made\nwith extreme caution. But in light of the data available, Murphy\nargues that the precautionary principle has been met with regard to\nharm to children. On his view, parenting is a basic civil right, the\nrestriction of which requires the threat of a certain amount of harm.\nBut social science literature shows that children are neither\ntypically nor seriously harmed by same-sex parenting (see Manning\net al., 2014). Even if two biological parents statistically\nprovide the optimal parenting situation, optimality is too high a\nstandard for permitting parenting. This can be seen if an optimality\ncondition is imagined for other factors, such as education or wealth\n(Murphy 2011).\n\nA third objection made to same-sex marriage is that its proponents\nhave no principled reason to oppose legally recognizing polygamy (e.g.\nFinnis 1997; see Corvino 2005). One response differentiates the two by\nciting harmful effects and unequal status for women found in\nmale-headed polygyny, but not in same-sex marriage (e.g. Wedgwood\n1999, Crookston 2014, de Marneffe 2016, Macedo 2015). Another response\nis to bite the bullet: a liberal state should not choose amongst the\nvarious ways (compatible with justice) individuals wish to organize\nsex and intimacy. Thus, the state should recognize a diversity of\nmarital relationships—including polygamy (Calhoun 2005, Mahoney\n2008) or else privatize marriage, relegating it to private contract\nwithout special legal recognition or definition (Baltzly 2012).\n\nFinally, some arguments against same-sex marriage rely on judgments\nthat same-sex sexual activity is impermissible. As noted above, the\nsoundness of these arguments aside, neutrality and political\nliberalism exclude appeal to such contested moral views in justifying\nlaw in important matters (Rawls 1997, 779, Schaff 2004, Wedgwood 1999,\nArroyo 2018). However, some arguments against same-sex\nmarriage have invoked neutrality, on the grounds that legalizing\nsame-sex marriage would force some citizens to tolerate what they find\nmorally abhorrent (Jordan 1995, and see Beckwith 2013). But this\nreasoning seems to imply, absurdly, that mixed-race marriage, where\nthat is the subject of controversy, should not be legalized. A rights\nclaim to equal treatment (if such a claim can support same-sex\nmarriage) trumps offense caused to those who disagree; the state is\nnot required to be neutral in matters of justice (Beyer 2002; Boonin\n1999; Schaff 2004; see also Barry 2011, Walker 2015).\n4.4 Arguments for Marriage Reform\n\nA number of theorists have argued for the abolition or restructuring\nof marriage. While same-sex marriage became legally recognized\nthroughout the United States following the Supreme Court decision in\nObergefell v Hodges 576 U.S. _ (2015), some philosophers\ncontend that justice requires further reform. Some have proposed that\ntemporary marriage contracts be made available (Nolan 2016, Shrage\n2013) and that legal frameworks for marriage and parenting be\nseparated (Brennan and Cameron 2016, Shrage 2018). A more sweeping\nview, to be discussed in Section 5, is that marriage is in itself\noppressive and unjust, and hence ought to be abolished (Card 1996,\nFineman 2004, Chambers 2013, 2017). A second argument for\ndisestablishing or privatizing legal marriage holds that, in the\nabsence of a pressing rationale for marriage law (as discussed in\n4.2), the religious or ethical associations of marriage law give\nreason for abolishing marriage as a legal category. Marriage has\nreligious associations in part responsible for public controversy over\nsame-sex marriage. If marriage is essentially defined by a\nreligious or ethical view of the good, then legal recognition of it\narguably violates state neutrality or even religious freedom (Metz\n2010, but see Macedo 2015, May 2016, Wedgwood 2016).\n\nThere are several reform proposals compatible with the\n‘disestablishment’ of marriage. One proposal is full\ncontractualization or privatization, leaving marriage to churches and\nprivate organizations. “Marital contractualism” (MC) would\nrelegate spousal agreements to existing contract law, eradicating any\nspecial legal marital status or rights. Garrett has defended MC as the\ndefault position, arguing that state regulation of contracts between\nspouses and state expenditures on marriage administration and\npromotion need justification. On his view, efficiency, equality,\ndiversity, and informed consent favor MC; there is no adequate\njustification for the costly redistribution of taxpayer funds to the\nmarried, or for sustaining social stigma against the unmarried through\nlegal marriage (Garrett 2009, see also Chartier 2016).\n\nBut marriage confers rights not available through private contract and\nwhich arguably should not be eliminated due to their importance in\nprotecting intimate relationships—such as evidentiary privilege\nor special eligibility for immigration. A second proposal would retain\nsuch rights while abolishing marriage; on this proposal, the state\nought to replace civil marriage entirely with a secular status such as\ncivil union or domestic partnership, which could serve the purpose of\nidentifying significant others for benefit entitlements, visiting\nrights, and so on (March 2010, 2011). This would allow equal treatment\nof same-sex relationships while reducing controversy, avoiding\nnon-neutrality, and respecting the autonomy of religious organizations\nby not compelling them to recognize same-sex marriage (Sunstein and\nThaler 2008). However, neither solution resolves the conflict between\nreligious autonomy and equality for same-sex relationships.\nPrivatization does not solve this conflict so long as religious\norganizations are involved in civil society—for example, as\nemployers or benefit providers. The question is whether religious\nautonomy would allow them, in such roles, to exclude same-sex civil\nunions from benefits. Such exclusion could be defended as a matter of\nreligious autonomy; but it could also be objected to as unjust\ndiscrimination—as it would be if, for example, equal treatment\nwere denied to inter-racial marriages.\n\nAnother issue raised by such a reform proposal is how to delimit the\nrelationships entitled to such recognition. Recall the new natural law\ncharge that liberalism entails an objectionable\n“plasticicty” regarding marriage (3.2.1). One question is\nwhether recognition should be extended to polygamous or polyamorous\nrelationships. Some defenders of same-sex marriage hold that their\narguments do not entail recognizing polygamy, due to its oppressive\neffects on women (Wedgwood 1999). However, some monogamous marriages\nare also oppressive (March 2011), and egalitarian polygamous or\npolyamorous relationships, such as a group of three women or three\nmen, exist (Emens 2004). Thus, oppressiveness does not cleanly\ndistinguish monogamous from polygamous relationships. Brooks has\nsought to show that polygamy is distinctively structurally\ninegalitarian as one party (usually the husband) can determine who\nwill join the marriage, whereas wives cannot (Brooks 2009). However,\nthis overlooks various possible configurations—if a polygamous\n“sister wife,” for instance, has the legal right to marry\noutside the existing marriage, there is no structural inequality\n(Strauss 2012). Most fundamentally, some authors have urged that a\npolitically liberal state should not prescribe the arrangements in\nwhich its competent adult members seek love, sex, and intimacy, so\nlong as they are compatible with justice (Calhoun 2005, March 2011).\nSome philosophers have argued that polygamists and polyamorous people\nare unjustly excluded from the benefits of marriage, and that legal\nrecognition of plural marriage - or small groups of friends –\ncan preserve equality (Brake 2012, 2014, Den Otter 2015, Shrage 2016).\nFinally, the history of racialized stigmatization of polygamy gives\nreason to consider whether anti-polygamous intuitions rest on just\nfoundations (Denike 2010).\n\nConservatives also charge that the liberal approach cannot rule out\nincestuous marriage. While this topic has sparked less debate than\npolygamy, one defender of the civil-unions-for-all proposal has\npointed out that civil union status, as justified on politically\nliberal grounds, would not connote sexual or romantic involvement.\nThus, eligibility of adult family members for this status would not\nconvey state endorsement of incest; whether the state should prohibit\nor discourage incest is an independent question (March 2010).\n\nA further problem arises with the proposal to replace marriage with\ncivil unions on neutrality grounds. Civil unions, if they carry legal\nbenefits similar to marriage, would still involve legal discrimination\n(between members of civil unions and those who were not members)\nrequiring justification (for a specific example of this problem in the\narea of immigration law, see Ferracioli 2016). Depending on how\nrestrictive the entry criteria for civil unions were (for example,\nwhether more than two parties, blood relations, and those not\nromantically involved could enter) and how extensive the entitlements\nconferred by such unions were, the state would need to provide reason\nfor this discrimination. In the absence of compelling neutral reasons\nfor such differential treatment, liberty considerations suggest the\nstate should cease providing any special benefits to members of civil\nunions (or intimate relationships) (Vanderheiden 1999, cf. Sunstein\nand Thaler 2008). As noted in 4.2, some political liberals have sought\nto provide rationales showing why a liberal state should support\ncertain relationships; these rationales generate corresponding reform\nproposals. One approach focuses on protecting economically dependent\ncaregivers; Metz proposes replacing civil marriage with\n“intimate care-giving unions” which would protect the\nrights of dependent caregivers (Metz 2010; cf. Hartley and Watson\n2012). Another approach holds that caring relationships themselves -\nwhether friendships or romantic relationships - should be recognized\nas valuable by the politically liberal state, and it should,\naccordingly, distribute rights supporting them equally; the\ncorresponding reform proposal, “minimal marriage,” would\nprovide rights directly supporting relationships, but not economic\nbenefits, without restriction as to sex or number of parties or the\nnature of their caring relationship (Brake 2012). This would extend\nmarriage not only to polyamorists, but to asexuals and aromantics, as\nwell as those who choose to build their lives around friendships. A\nthird approach proposes that marital rights and status be replaced by\n“piecemeal directives” which would regulate the various\nfunctional contexts to which marriage law now applies (such as\ncohabitation and co-parenting) (Chambers 2017); this proposal would\navoid designating any relationship type as entitled to special\ntreatment.\n\nMany of the views discussed to this point imply that current marriage\nlaw is unjust because it arbitrarily excludes some groups from\nbenefits; it follows, on such views, that marrying is to avail oneself\nof privileges unjustly extended. This seems to give reason for\nboycotting the institution, so long as some class of persons is\nunjustly excluded (Parsons 2008).\n\nBefore Obergefell, U.S. law was in patchwork regarding\nmarriages involving at least one transgender person —\n“trans—marriage,” in Loren Cannon’s term. As a\ntransgender person traveled from state to state, both their legal sex\nand marital status could change (Cannon 2009, 85). While some raised\nconcerns that the political rationales given for recognizing such\nmarriages (such as the possibility of penile-vaginal intercourse)\nreaffirmed heteronormative assumptions (Robson 2007), to other\ntheorists, the possibility of trans-marriage itself suggests the\ninstability or incoherence of legal gender categories and gendered\nrestrictions on marriage (Cannon 2009, Almeida 2012).\n5. Marriage and Oppression: Gender, Race, and Class\n\nMarriage historically played a central role in women’s\noppression, meaning economic and political disempowerment and\nlimitation of opportunities. Until the late 19th century,\nthe doctrine of coverture (in English and U.S. law) suspended a\nwife’s legal personality on marriage, ‘covering’ it\nwith that of her husband, removing her rights to own property, make a\nwill, earn her own money, make contracts, or leave her husband, and\ngiving her little recourse against physical abuse. Well into the\n20th century, legislatures continued to impose gendered\nlegal roles within marriage (known as ‘head and master\nlaws’), to exempt rape within marriage from criminal\nprosecution, and to allow—or impose—professional bars on\nmarried women (Coontz 2006, 238; Cronan 1973; Kleingeld 1998). John\nStuart Mill compared wives’ condition under coverture to slavery\n(see section 1); while the late 20th century U.S. saw\ngender-neutrality in legal marital responsibilities and an end to the\nmarital rape exemption, criticisms of marriage as oppressive persist.\nContemporary feminist attention to marriage is focused on spousal\nabuse—indeed, some U.S. states still exempt spouses from sexual\nbattery charges (Posner and Silbaugh 1996)—, the gendered\ndivision of labor in marriage, and the effects of marriage on\nwomen’s economic opportunities and power.\n\nWhile Mill and Engels saw the establishment of monogamous marriage as\nan ancient defeat of the female sex, Aquinas, Kant, and many others\nhave seen monogamy as a victory for women, securing for them faithful\npartners, protection, and material support. So Kant writes that\n“skepticism on this topic [marriage] is bound to have bad\nconsequences for the whole feminine sex, because this sex would be\ndegraded to a mere means for satisfying the desire of the other sex,\nwhich, however, can easily result in boredom and\nunfaithfulness.—Woman becomes free by marriage; man loses his\nfreedom by it” (Kant 1798, 210–211, [309]). However, as a\nhistorical thesis about the origin of marriage, the idea that monogamy\nprovided women with needed material support has been debunked. In\nearly hunting-gathering societies, female foraging likely provided\nmore than male hunting, child-care was arranged communally, and,\nrather than a single male providing for his female partner, survival\nrequired a much larger group (Coontz 2006, 37–38). As a thesis\nabout the protection of women by their male partners, the incidence of\nrape and violence by male partners themselves must be taken into\naccount (e.g., in the contemporary U.S., Tjaden and Thoennes 2000).\nAnd as a thesis about sex difference, evolutionary\n‘just-so’ stories purporting to show that women are\nnaturally more monogamous have been challenged by feminist\nphilosophers of biology (Tuana 2004).\n\nMarriage law has also been a tool of racial oppression. The majority\nof American states at one time prohibited inter-racial marriage; the\nSupreme Court struck down such laws in 1967 (Wallenstein 2002,\n253–254). Anti-miscegenation law did not prevent actual sex and\nprocreation between races, but it excluded women of color and their\nchildren from the benefits of marriage. It was also a potent symbol of\nalleged racial difference. Furthermore, African-American marriage\npatterns were shaped by slavery. Enslaved persons could not legally\nmarry, and slave couples and their children were frequently separated\n(Cott 2000). Contemporary philosophers of race argue that marriage is\nstill implicated in systemic racism (Collins 1998). For example,\nhistorical conditions and structural racism have led to practices of\nshared child-rearing in some African-American communities. Some\ntheories of marriage imply that such child-rearing practices are\ninferior to the marital family. Theorists of racial oppression argue\nthat such practices should be recognized as a valuable alternative,\nand, moreover, that law which excludes such practices from benefits\naccorded to marriage may be racially unjust (Vanderheiden 1999; cf.\nCollins 1998, Card 1996). Immigration law has also made women who are\ndependent on marriage for their immigration status vulnerable to\nabuse, particularly those women who are also subject to racism or\ncultural marginalization (Narayan 1995).\n\nRecent work has also highlighted the contemporary class-based marriage\ngap in the U.S.: wealthier people are more likely to marry (McClain\n2013). This suggests a different link between marriage and oppression:\none effect of socioeconomic inequality may be to deprive the worse-off\nof access to marriage (perhaps because poverty impedes the formation\nof stable relationships) and the further legal benefits marriage can\nbring. There is arguably a tension, among egalitarian approaches,\nbetween feminist criticisms of marriage as inherently oppressive and\negalitarian criticisms of barriers to accessing it (Chambers\n2013).\n5.1 Feminist Approaches\n\nA major theme in feminist political philosophy has been the exclusion\nof the marital family from justice. Political philosophy has tended to\nrelegate family life to natural hierarchy or affection (Okin 1979,\n1989). Historically, this meant that the private sphere of marriage,\nto which women were confined, was also the zone of state\nnon-interference, so that what happened to women there was not subject\nto norms of justice. Gradually, law and political philosophy have come\nto recognize that equal rights and liberties should be upheld within\nthe private sphere as outside it, but many political philosophers\nstill resist applying principles of justice directly within the\nprivate sphere. However, feminists argue that gender-structured\nmarriage contributes to, or is even the mainstay of, women’s\neconomic inequality and disempowerment, and that justice must\ntherefore regulate its terms—even, perhaps, to the point of\ninterfering with voluntary marital relations (Okin 1989, Ferguson\n2016). At the same time, marriage has been a crucial site of socially\nvaluable care work, which often falls disproportionately on women, and\nrecent feminist work has focused on how the state can support that\nwork more equitably (Metz 2010, Bhandary 2018).\n\nAs noted above, one persistent rationale for excluding the family from\nnorms of justice is that its natural relations of affection and trust\nare superior to merely just relations and likely to be threatened by\nconstruing the family in terms of justice (Hegel 1821, §75,\n§161A; Sandel 1982, 31–35). But abuse within marriage and\ninequality on dissolution are significant problems, the gravity of\nwhich should, according to critics, outweigh these finer virtues;\nrights within marriage protect spouses when affection fails (Waldron\n1988, Okin 1989). Moreover, it is not clear that affection and justice\nmust conflict; a commitment to treating one’s spouse justly\ncould be part of marital love (Kleingeld 1998). Finally, marriage is\npart of the basic structure of society, and thus, at least within\nRawlsian liberalism, is subject to principles of justice. This does\nnot determine, however, how principles of justice should constrain\nmarriage; the default liberal presumption is that marriage, as a\nvoluntary association, should be ordered as spouses choose—so\nlong as these choices do not lead to injustice (Rawls 1997, 792). We\nwill return to this below.\n\nMarriage is a focus of feminist concern due to its effects on\nwomen’s life chances. Continuing disadvantage accruing to women\nin marriage has been widely documented, and in some feminist analyses,\nundergirds gender inequality (rival accounts place greater emphasis on\nsexual objectification or workplace discrimination). Wives, even those\nwho work full-time outside the home, perform more housework than\nhusbands—this ‘second shift’ affecting their\nworkplace competitiveness. The social assignment of primary\nresponsibility for childcare to women, combined with the difficulty of\ncombining childcare with paid work, also undermine the workplace\ncompetitiveness of women with children (Okin 1989, Chapter 7). The\ngendered division of labor and the fact that ‘women’s\nwork’ is less well-paid than men’s together make it more\nlikely that married women, rather than their husbands, will downgrade\ntheir careers, choose part-time work, or stay home to facilitate\nchild-rearing or when the spouses’ careers conflict. These\nchoices make women “vulnerable by marriage”: economic\ndependence, and dependence on marriage for benefits such as health\ninsurance, fosters power inequality and makes exit difficult, in turn\nfacilitating abuse (Okin 1989, Chapter 7, Narayan 1995, Card 1996,\nBrake 2016, Ferguson 2016).\n\nAs discussed in 4.2, rationales of equality or equal opportunity are\ngiven for addressing economic inequalities arising within marriage\nthrough divorce law (Okin 1989, Chapters 7 and 8; Shanley 2004,\n3–30, Rawls 1997, 787–794). However, divorce law does not\naddress non-economic sources of power imbalances (such as gender role\nsocialization) within on-going marriages, nor does it address the\nsystemic way in which such inequalities arise. Equal opportunity seems\nto require changing social norms related to marriage in ways which\ndivorce law does not. First, the gendered division of labor within\nongoing marriages is costly for women (Kleingeld 1998). Second, power\nimbalances within marriage limit girls’ expectations and teach\nchildren to accept gendered inequality (Okin 1989, Chapter 7, Okin\n1994). Third, anticipation of marriage affects women’s\ninvestment in their earning ability before marriage (Okin 1989,\nChapter 7). (But for an argument that some hierarchy and inequality in\nmarriage is just, see Landau 2012.)\n\nSuch social norms could be addressed through education or through\nmedia campaigns promoting the equitable division of housework. Legal\nmeasures such as requiring all marital income to be held equally could\nencourage power equality within marriage (Okin 1989, Chapter 8).\nHowever, state interference in on-going marriages arguably conflicts\nwith spouses’ liberties (Rawls 1997, 787–794). This seems\nto raise a theoretical problem for liberal feminism. Recent liberal\nfeminist approaches to marriage focus on how a just law of marriage\ncan protect women’s interests as well as supporting a fairer\ndistribution of care work, which often falls on women (Metz 2010,\nBrake 2012, Hartley and Watson 2012, Ferguson 2016, Bhandary 2018; see\nalso reform proposals in 4.4 above).\n\nWhile many feminists have focused on the reform of marriage, others\nhave argued for its abolition as a legal status (Metz 2010, Chambers\n2013, 2017). It is sometimes claimed that marriage is inherently\nstructured by sexist social norms, precluding the possibility of\nfeminist reform — and that marriage also reinforces stigma\nagainst the unmarried (Chambers 2017). On such views, abolishing\nmarriage is necessary to reshape social expectations and change\npatterns of choice accompanying it. For example, legal marriage may\nencourage women’s economic dependence by enabling and providing\nincentives for it. Thus, the legal structure of marriage, in\ncombination with social norms, is taken to encourage choices which\ndisempower women relative to men. Moreover, legal recognition of\nmarriage itself endorses an ideal of a central, exclusive love\nrelationship which, on the views of some feminists, encourages women\nto make disadvantageous choices by inculcating an exaggerated\nvaluation of such relationships—at the expense of women’s\nother aspirations. Thus, in The Second Sex, feminist\nphilosopher Simone de Beauvoir (1908–86) identified the\nexpectations surrounding marriage as one of the primary means by which\nwomen are socialized into a femininity which, in her view, was\nlimiting: marriage “is the destiny traditionally offered to\nwomen by society” (de Beauvoir 1949 [1989], 425; see also Okin\n1989), leading women to focus on their attractiveness as\nmates—and not on study, career, or other ambitions. For this\nreason, some feminists have rejected ideals of romantic, exclusive\nlove relationships, arguing that women should choose non-monogamy or\nlesbian separatism (Firestone 1970; see also Card 1996). The idea that\nmarriage is essentially tied to such an ideal of romantic love will\nrequire further examination in the next section.\n5.2 The Queer Critique\n\nJust as some feminists argue that marriage is inherently sexist, so\nsome philosophers of gay, lesbian, bisexual, and transgender\noppression argue that it is essentially heterosexist. (Some of these\nphilosophers refer to themselves as queer theorists, reclaiming the\nword “queer” from its earlier, pejorative usage.) Queer\ntheorists have sought to demonstrate that a wide range of social\ninstitutions display heteronormativity, that is, the assumption of\nheterosexuality and of the gender difference that defines it as a\nnorm. Because queer theorists resist the normativity of gender as well\nas of heterosexuality, there is an overlap between their critiques of\nmarriage and those of some feminists, especially lesbian feminists.\nFor these critics of heteronormativity, same-sex marriage is\nundesirable because it would assimilate same-sex relationships to an\nessentially heterosexual marital ideal: “Queer theorists worry\nthat pursuing marriage rights is assimilationist, because it rests on\nthe view that it would be better for gay and lesbian relationships to\nbe as much like traditional heterosexual intimate relationships as\npossible” (Calhoun 2000, 113). On this view, extending marriage\nto same-sex marriage will undermine, rather than achieve, gay and\nlesbian liberation - and, indeed, further marginalize asexuals,\naromantics, polyamorists, and those who choose to build their lives\naround friendships.\n\nRecall that some arguments for same-sex marriage claim that central,\nexclusive relationships are valuable, and that same-sex marriage would\nbenefit gays and lesbians by encouraging them to enter such\nrelationships (e.g. Macedo 2005; see 3.3). But critics of\nheteronormativity, drawing on gay and lesbian experience, have argued\nthat the central, exclusive relationship ideal is a heterosexual\nparadigm. Such critics note that gays and lesbians often choose\nrelationships which are less possessive and more flexible than\nmonogamous marriage. Instead of recognizing the diverse relationships\nfound in the gay and lesbian community, same-sex marriage would\nassimilate lesbian and gay relationships into the heterosexual model.\nWhile some advocates of same-sex marriage argue that marital status\nwould confer legitimacy on same-sex relationships, these critics argue\nthat the state should not confer legitimacy (and hence, implicitly,\nillegitimacy) on consensual adult relationships, any more than it\nshould so discriminate between children born in or out of wedlock.\nSuch conferrals of legitimacy are thought to discourage diversity.\nMoreover, same-sex marriage would expose gays and lesbians to the\ndisadvantages, even evils, of marriage: economic incentives to stay in\nloveless marriages and reduced exit options which facilitate abuse and\nviolence (Card 1996, 2007, Ettelbrick 1989).\n\nOther philosophers of gay and lesbian oppression have responded in\ndefense of same-sex marriage that it not only serves gay liberation,\nit is essential to it. Excluding gays and lesbians from marriage marks\nthem as inferior, and so same-sex marriage would decrease stigmas\nagainst homosexuality. Further, the costs of same-sex marriage must be\nweighed with benefits such as healthcare, custody and inheritance\nrights, and tax and immigration status (Calhoun 2000, Chapter 5,\nFerguson 2007, Mayo and Gunderson 2000). Finally, in response to\nworries about gay and lesbian assimilation, defenders of same-sex\nmarriage have argued that marriage can incorporate diversity, rather\nthan suppressing it. Marriage need not entail monogamy; indeed, it is\nargued that same-sex marriage could perform the liberatory function of\nteaching heterosexuals that neither gender roles nor monogamy are\nessential to love and marriage (Mohr 2005, 69–9, cf. Halwani\n2003, Chapter 3; but see Brake 2018 for discussion of whether\n“subversive weddings” can transform social attitudes if\nthey are not recognized as initiating marriages).\n\nThe feminist and queer critiques of marriage as essentially sexist, or\nessentially heterosexist, face the same objection as do other claims\nabout the essence of marriage. Just because marriage has in the past\npossessed certain features does not entail that they are inherent to\nit. Thus, rather than reproducing sexist and heterosexist patterns,\nsame-sex marriage could serve women’s and gay liberation by\ntransforming marriage, even, perhaps, opening the door to recognition\nof a still wider variety of family forms (Ferguson 2007, Mayo and\nGunderson 2000, Calhoun 2005, Brake 2012).\n",
    "bibliography": {
        "categories": [
            "<a name=\"ConWor\">Contemporary Works</a>",
            "<a name=\"HisWorFirPubPri195\">Historical Works</a>"
        ],
        "cat_ref_text": {
            "<a name=\"ConWor\">Contemporary Works</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Abbey, Ruth, and Den Uyl, Douglas, 2001, “The Chief\nInducement? The Idea of Marriage As Friendship,” <em>Journal of\nApplied Philosophy</em>, 18(1): 37–52.",
                "Almeida, Luís Duarte d’, 2012, “Legal\nSex,” <em>Oxford Studies in Philosophy of Law</em> (Volume 2),\nOxford: Oxford University Press, pp. 277–310.",
                "Altman, Matthew C., 2010, “Kant on Sex and Marriage: The\nImplications for the Same-Sex Marriage Debate,”\n<em>Kant-Studien</em>, 101(3): 309–330.",
                "Arneson, Richard, 2005, “The Meaning of Marriage: State\nEfforts to Facilitate Friendship, Love, and Childrearing,”\n<em>San Diego Law Review</em>, 42: 979–1001.",
                "Arroyo, Christopher, 2018, “Is the Same-sex Marriage Debate\nReally Just about Marriage?,” <em>Journal of Applied\nPhilosophy</em>, 35(1): 186–203.",
                "Baltzly, Vaughn Bryan, 2012, “Same-Sex Marriage, Polygamy,\nand Disestablishment,” <em>Social Theory and Practice</em>,\n38(2): 333–362.",
                "Barry, Peter Brian, 2011, “Same-Sex Marriage and the Charge\nof Illiberality,” <em>Social Theory and Practice</em>, 37(2):\n333–357.",
                "Beckwith, Francis J., 2013, “Justificatory Liberalism and\nSame-Sex Marriage,” <em>Ratio Juris</em>, 26(4):\n487–509.",
                "Bennett, Christopher, 2003, “Liberalism, Autonomy, and\nConjugal Love,” <em>Res Publica</em>, 9: 285–301.",
                "Beyer, Jason A., 2002, “Public Dilemmas and Gay Marriage:\nContra Jordan,” <em>Journal of Social Philosophy</em>, 33(1):\n9–16.",
                "Bhandary, Asha, 2018, “Arranged Marriage: Could It\nContribute to Justice?,” <em>Journal of Political\nPhilosophy</em>, 26(2): 193–215.",
                "Blankschaen, Kurt, 2020, “Rethinking Same-Sex Sex in Natural\nLaw Theory,” <em>Journal of Applied Philosophy</em>, 37(3):\n428–445.",
                "Boonin, David, 1999, “Same-Sex Marriage and the Argument\nfrom Public Disagreement,” <em>Journal of Social\nPhilosophy</em>, 30(2): 251–259.",
                "Boswell, John, 1994, <em>The Marriage of Likeness: Same-Sex Unions\nin Pre-Modern Europe</em>, London: HarperCollins.",
                "Brake, Elizabeth, 2005, “Justice and Virtue in Kant’s\nAccount of Marriage,” <em>Kantian Review</em>, 9:\n58–94.",
                "–––, 2012, <em>Minimizing Marriage: Marriage,\nMorality, and the Law</em>, New York: Oxford University Press.",
                "–––, 2014, “Recognizing Care: The Case for\nFriendship and Polyamory,” <em>Syracuse Law and Civic Engagement\nJournal</em>, 1,\n [<a href=\"http://slace.syr.edu/wp-content/uploads/2014/08/Brake-Article-Final.pdf\" target=\"other\">available online</a>].",
                "–––, 2016, “Equality and Non-Hierarchy in\nMarriage: What Do Feminists Really Want?,” in <em>After\nMarriage: Rethinking Marital Relationships</em>, E. Brake (ed.), New\nYork: Oxford University Press, pp. 100–124.",
                "–––, 2018, “Do Subversive Weddings\nChallenge Amatonormativity? Polyamorous Weddings and Romantic Love\nIdeals,” <em>Analize: Journal of Gender and Feminist\nStudies</em>, 11,\n [<a href=\"http://www.analize-journal.ro/library/files/numarul_11/11_3_elizabeth_brake_61-84.pdf\" target=\"other\">Brake 2018 available online</a>].",
                "Brennan, Samantha, and Bill Cameron, 2016, “Is Marriage Bad\nfor Children? Rethinking the Connection between Having Children,\nRomantic Love, and Marriage,” in <em>After Marriage: Rethinking\nMarital Relationships</em>, E. Brake (ed.), New York: Oxford\nUniversity Press, pp. 84–99.",
                "Brooks, Thom, 2009, “The Problem with Polygamy,”\n<em>Philosophical Topics</em>, 37(2): 109–22.",
                "Buccola, Nicholas, 2005, “Finding Room for Same-Sex\nMarriage: Toward a More Inclusive Understanding of a Cultural\nInstitution,” <em>Journal of Social Philosophy</em>, 36(3):\n331–343.",
                "Calhoun, Cheshire, 2000, <em>Feminism, the Family, and the\nPolitics of the Closet: Lesbian and Gay Displacement</em>, Oxford:\nOxford University Press.",
                "–––, 2005, “Who’s Afraid of\nPolygamous Marriage? Lessons for Same-Sex Marriage Advocacy from the\nHistory of Polygamy,” <em>San Diego Law Review</em>, 42:\n1023–1042.",
                "Cannon, Loren, 2009, “Trans-Marriage and the Unacceptability\nof Same-Sex Marriage Restrictions,” <em>Social Philosophy\nToday</em>, 25: 75–89.",
                "Card, Claudia, 1996, “Against Marriage and\nMotherhood,” <em>Hypatia</em>, 11(3): 1–23.",
                "–––, 2007, “Gay Divorce: Thoughts on the\nLegal Regulation of Marriage,” <em>Hypatia</em>, 22(1):\n24–38.",
                "Cave, Eric M., 2003, “Marital Pluralism: Making Marriage\nSafer for Love,” <em>Journal of Social Philosophy</em>, 34(3):\n331–347.",
                "–––, 2004, “Harm Prevention and the\nBenefits of Marriage,” <em>Journal of Social Philosophy</em>,\n35(2): 233–243.",
                "–––, 2017, “Liberalism, Civil Marriage,\nand Amorous Caregiving Dyads,” <em>Journal of Applied\nPhilosophy</em>, 36(1): 50–72.",
                "Chambers, Clare, 2013, “The Marriage-Free State,”\n<em>Proceedings of the Aristotelian Society</em>, 113 (2):\n123–143.",
                "–––, 2016, “The Limitations of Contract:\nRegulating Personal Relationships in a Marriage-Free State,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 51–83.",
                "–––, 2017, <em>Against Marriage: An Egalitarian\nDefence of the Marriage-Free State</em>, Oxford: Oxford University\nPress.",
                "Chan, Sarah, and Daniela Cutas (eds.), 2012, <em>Families\n––Beyond the Nucelar Ideal</em>, New York: Bloomsbury\nAcademic.",
                "Chartier, Gary, 2016, <em>Public Practice, Private Law: An Essay\non Love, Marriage, and the State</em>, Cambridge: Cambridge University\nPress.",
                "Collins, Patricia Hill, 1998, “It’s All in the Family:\nIntersections of Gender, Race, and Nation,” <em>Hypatia</em>,\n13(3): 62–82.",
                "Coontz, Stephanie, 2006, <em>Marriage: a History</em>, London:\nPenguin.",
                "Corvino, John, 2005, “Homosexuality and the PIB\nArgument,” <em>Ethics</em>, 115: 501–534.",
                "Cott, Nancy, 2000, <em>Public Vows: A History of Marriage and the\nNation</em>, Cambridge, MA: Harvard University Press.",
                "Cronan, Sheila, 1973, “Marriage,” in <em>Radical\nFeminism</em>, ed. Anne Koedt, Ellen Levine, Anita Rapone, New York:\nQuadrangle, pp.213 –221.",
                "Crookston, Emily, 2014, “Love and Marriage?,”\n<em>Journal of Moral Philosophy</em>, 11(4): 267–289.",
                "De Marneffe, Peter, 2016, “Liberty and Polygamy,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 125–159.",
                "Den Otter, Ron, 2015, <em>In Defense of Plural Marriage</em>,\nCambridge: Cambridge University Press.",
                "Denike, Margaret, 2010, “The Racialization of White\nMan’s Polygamy,” <em>Hypatia</em>, 25(4):\n852–874.",
                "Devlin, Patrick, 1965, <em>The Enforcement of Morals</em>, Oxford:\nOxford University Press.",
                "Emens, Elizabeth F., 2004, “Monogamy’s Law: Compulsory\nMonogamy and Polyamorous Existence,” <em>New York University\nReview of Law and Social Change</em>, 29: 277–376.",
                "Ettelbrick, Paula, “Since When is Marriage a Path to\nLiberation?,” 1989, <em>Out/look: National Lesbian and Gay\nQuarterly</em>, 6(9): 14–17; reprinted in Andrew Sullivan (ed.),\n<em>Same-Sex Marriage: Pro and Con</em>, New York: Vintage, 2004, pp.\n122–128.",
                "Ferguson, A., 2007, “Gay Marriage: An American and Feminist\nDilemma,” <em>Hypatia</em>, 22(1): 39–57.",
                "Ferguson, Michaele L., 2016, “Vulnerability by Marriage:\nOkin’s Radical Feminist Critique of Structural Gender\nInequality,” <em>Hypatia</em> (A Journal of Feminist\nPhilosophy), 31(3): 687–703.",
                "Ferracioli, Luara, 2016, “Family Migration Schemes and\nLiberal Neutrality: A Dilemma,” <em>Journal of Moral\nPhilosophy</em>, 13(5): 553–575.",
                "Fineman, Martha, 2004, <em>The Autonomy Myth: A Theory of\nDependency</em>, New York: The New Press.",
                "Finnis, John, 1994, “Law, Morality, and ‘Sexual\nOrientation’,” <em>Notre Dame Law Review</em>, 69:\n1049–1076.",
                "–––, 1997, “The Good of Marriage and the\nMorality of Sexual Relations: Some Philosophical and Historical\nObservations,” <em>American Journal of Jurisprudence</em>, 42:\n97–134.",
                "–––, 2008, “Marriage: A Basic and Exigent\nGood,” <em>The Monist</em>, 91(3–4): 388–406.",
                "Firestone, Shulamith, 1970, <em>The Dialectic of Sex: The Case for\nFeminist Revolution</em>, New York: William Morrow and Co.",
                "Galston, William, 1991, <em>Liberal Purposes</em>, Cambridge:\nCambridge University Press.",
                "Garrett, Jeremy, 2008, “History, Tradition, and the\nNormative Foundations of Civil Marriage,” <em>The Monist</em>,\n91(3–4): 446–474.",
                "–––, 2008, “Why the Old Sexual Morality of\nthe New Natural Law Undermines Traditional Marriage,” <em>Social\nTheory and Practice</em>, 34(4): 591–622.",
                "–––, 2009, “A Prima Facie Case Against\nCivil Marriage,” <em>Southwest Philosophy Review</em>, 25(1):\n41–53.",
                "George, Robert P., 2000, “‘Same-Sex Marriage’\nand ‘Moral Neutrality’,” in <em>Homosexuality and\nAmerican Public Life</em>, Christopher Wolfe (ed.), Dallas: Spence\nPublishing Company, pp. 141–153.",
                "Gheaus, Anca, 2016, “The (Dis)value of Commitment to\nOne’s Spouse,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 204–224.",
                "Girgis, Sherif, Robert P. George, and Ryan T. Anderson, 2010,\n“What is Marriage?” <em>Harvard Journal of Law and Public\nPolicy</em>, 34(1): 245–288.",
                "Goldstein, Joshua D., 2011, “New Natural Law Theory and the\nGrounds of Marriage,” <em>Social Theory and Practice</em>, 37\n(3): 461–482.",
                "Grisez, Germain, 1993, <em>The Way of the Lord Jesus</em>, vol. 2\n<em>Living a Christian Life</em>, Quincy, IL: Franciscan Press.",
                "Halwani, Raja, 2003, <em>Virtuous Liaisons</em>, Peru, IL: Open\nCourt.",
                "Hartley, Christie, and Watson, Lori, 2012, “Political\nLiberalism, Marriage and the Family,” <em>Law and\nPhilosophy</em>, 31(2): 185–212.",
                "Herman, Barbara, 1993, “Could it be worth thinking about\nKant on sex and marriage?,” in <em>A Mind of One’s\nOwn</em>, Louise Antony and Charlotte Witt (eds.), Oxford: Westview\nPress, pp. 49–67.",
                "Houlgate, Laurence, 2005, <em>Children’s Rights, State\nIntervention, Custody and Divorce: Contradictions in Ethics and Family\nLaw</em>, Lewiston, NY: The Mellen Press.",
                "Johnson, Rebekah, 2013, “Marriage and the Metaphysics of\nBodily Union,” <em>Social Theory and Practice</em>, 39(2):\n288–312.",
                "Jordan, Jeff, 1995, “Is It Wrong to Discriminate on the\nBasis of Homosexuality?,” <em>Journal of Social Philosophy</em>,\n26(1): 39–52.",
                "Kleingeld, Pauline, 1998, “Just Love? Marriage and the\nQuestion of Justice,” <em>Social Theory and Practice</em>,\n24(2): 261–281.",
                "Kronqvist, Camilla, 2011, “The Promise That Love Will\nLast,” <em>Inquiry</em>, 54(6): 650–668.",
                "Kymlicka, Will, 1991,“Rethinking the Family,”\n<em>Philosophy and Public Affairs</em>, 20(1): 77–97.",
                "Landau, Iddo, 2004, “An Argument for Marriage,”\n<em>Philosophy</em>, 79: 475–481.",
                "–––, 2012, “Should Marital Relations be\nNon-Hierarchical?,” <em>Ratio</em>, 25(1): 51–67.",
                "Lee, Patrick, 2008, “Marriage, Procreation, and Same-Sex\nUnions,” <em>The Monist</em>, 91(3–4): 422–438.",
                "Li, Xiaorong, 1995, “Gender Inequality in China and Cultural\nRelativism,” in <em>Women, Culture and Development: A Study of\nHuman Capabilities</em>, Martha Nussbaum and Jonathan Glovers (eds.),\nNew York: Oxford University Press, pp. 407–425.",
                "Macedo, Stephen, 1995, “Homosexuality and the Conservative\nMind,” <em>Georgetown Law Review</em>, 84: 261–300.",
                "–––, 2015, <em>Just Married: Same-Sex Couples,\nMonogamy &amp; the Future of Marriage</em>, Princeton: Princeton\nUniversity Press.",
                "Mahoney, Jon, 2008, “Liberalism and the Polygamy\nQuestion,” <em>Social Philosophy Today</em>, 23:\n161–174.",
                "Manning, W., Fettro, M., and Lamidi, E., 2014, “Child\nWell-Being in Same-Sex Parent Families: Review of Research Prepared\nfor the American Sociological Association Amicus Brief,”\n<em>Population Research &amp; Policy Review</em>, 33(4):\n485–502.",
                "March, Andrew F., 2010, “What Lies Beyond Same-Sex Marriage?\nMarriage, Reproductive Freedom and Future Persons in Liberal Public\nJustification,” <em>Journal of Applied Philosophy</em>, 27(1):\n39–58.",
                "March, Andrew F., 2011, “Is There a Right to Polygamy?\nMarriage, Equality, and Subsidizing Families in Liberal Political\nJustification,” <em>Journal of Moral Philosophy</em>, 8:\n246–272.",
                "Marquis, Don, 2005, “What’s Wrong with\nAdultery?,” in <em>What’s Wrong?</em>, Graham Oddie and\nDavid Boonin (eds.), New York: Oxford University Press, pp.\n231–238.",
                "Martin, Mike W., 1993, “Love’s Constancy,”\n<em>Philosophy</em>, 68(263): 63–77.",
                "–––, 1994, “Adultery and Fidelity,”\n<em>Journal of Social Philosophy</em>, 25(3): 76–91.",
                "May, Simon, 2016, “Liberal Neutrality and Civil\nMarriage,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 9–28.",
                "Mayo, David J. and Gunderson, Martin, 2000, “The Right to\nSame-Sex Marriage: A Critique of the Leftist Critique,”\n<em>Journal of Social Philosophy</em>, 31(3): 326–337.",
                "McClain, Linda C., 2013, “The Other Marriage Equality\nProblem,” <em>Boston University Law Review</em>, 93(3):\n921–970.",
                "McMurtry, John, 1972, “Monogamy: A Critique,” <em>The\nMonist</em>, 56: 587–99.",
                "Mendus, Susan, 1984, “Marital Faithfulness,”\n<em>Philosophy</em>, 59: 243–252.",
                "Mercier, Adèle, 2001, <em>Affidavit</em>, Ontario Superior\nCourt of Justice (Divisional Court), Between Halpern al. (Applicants)\nand <em>Canada (Attorney General</em>) et al. (Respondents), Court\nfile 30/2001, 30/2001, Nov.\n [<a href=\"https://web.archive.org/web/20170227000528/http://www.samesexmarriage.ca/docs/adele_mercier.pdf\" target=\"other\">available online</a>]",
                "Metz, Tamara, 2010, <em>Untying the Knot: Marriage, the State, and\nthe Case for their Divorce</em>, Princeton: Princeton University\nPress.",
                "Mohr, Richard D., 2005, <em>The Long Arc of Justice: Lesbian and\nGay Marriage, Equality, and Rights</em>, New York: Columbia University\nPress.",
                "Moller, Dan, 2003, “An Argument Against Marriage,”\n<em>Philosophy</em>, 78(1): 79–91.",
                "Morse, Jennifer Roback, 2006, “Why Unilateral Divorce Has No\nPlace in a Free Society,” in <em>The Meaning of Marriage</em>,\nRobert P. George and Jean Bethke Elshtain (eds.), Dallas: Spence\nPublishing Co, pp. 74–99.",
                "Moses, Julia (ed.), 2018, <em>Marriage, Law and Modernity: Global\nHistories</em>, New York: Bloomsbury.",
                "Murphy, Timothy F., 2011, “Same-Sex Marriage: Not a Threat\nto Marriage or Children,” <em>Journal of Social Philosophy</em>,\n42(3): 288–304.",
                "Narayan, Uma, 1995, “‘Male-Order’ Brides:\nImmigrant Women, Domestic Violence and Immigration Law,”\n<em>Hypatia</em>, 10(1): 104–119.",
                "–––, 1997, <em>Dislocating Cultures: Identities,\nTraditions, and Third-World Feminism</em>, Routledge: New York.",
                "Nolan, Daniel, 2016, “Temporary Marriage,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 180–203.",
                "–––, forthcoming, “Marriage and its\nLimits,” <em>Inquiry</em>.",
                "Nussbaum Martha, 1999, <em>Sex and Social Justice</em>, Oxford:\nOxford University Press.",
                "Okin, Susan Moller, 1979, <em>Women in Western Political\nThought</em>, Princeton: Princeton University Press.",
                "–––, 1989, <em>Justice, Gender, and the\nFamily</em>, New York: Basic Books.",
                "–––, 1994, “Political Liberalism<em>,\nJustice, and Gender</em>,” <em>Ethics</em>, 105(1):\n23–43.",
                "Papadaki, Lina, 2010, “Kantian Marriage and Beyond: Why It\nIs Worth Thinking About Kant on Marriage,” <em>Hypatia</em>, 25\n(2): 276–294.",
                "Parsons, Kate, 2008, “Subverting the Fellowship of the\nWedding Ring,” <em>Journal of Social Philosophy</em>, 39(3):\n393–410.",
                "Pateman, Carole, 1988, <em>The Sexual Contract</em>, Cambridge:\nPolity Press.",
                "Posner, Richard, and Silbaugh, Katharine, 1996, <em>A Guide to\nAmerica’s Sex Laws</em>, Chicago: The University of Chicago\nPress.",
                "Rajczi, Alex, 2008, “A Populist Argument for Same-Sex\nMarriage,” <em>The Monist</em>, 91(3–4):\n475–505.",
                "Rawls, John, 1997, “The Idea of Public Reason\nRevisited,” <em>The University of Chicago Law Review</em>,\n64(3): 765–807.",
                "Raz, Joseph, 1986, <em>The Morality of Freedom</em>, Oxford:\nOxford University Press.",
                "Robson, Ruthann, 2007, “A Mere Switch or a Fundamental\nChange? Theorizing Transgender Marriage,” <em>Hypatia</em>, 22\n(1): 58–70.",
                "Sandel, Michael, 1982, <em>Liberalism and the Limits of\nJustice</em>, Cambridge: Cambridge University Press.",
                "Savulescu, Julian, and Sandberg, Anders, 2008,\n“Neuroenhancement of Love and Marriage: The Chemicals Between\nUs,” <em>Neuroethics</em>, 1: 31–44.",
                "Schaff, Kory, 2004, “Equal Protection and Same-Sex\nMarriage,” <em>Journal of Social Philosophy</em>, 35(1):\n133–147.",
                "Scruton, Roger, 1986, <em>Sexual Desire</em>, London: The Free\nPress.",
                "Shanley, Mary Lyndon, <em>et al</em>., 2004, <em>Just\nMarriage</em>, Oxford: Oxford University Press (includes title essay\nby Shanley and short replies by 13 others).",
                "Shrage, Laurie, 2013, “Reforming Marriage: A Comparative\nApproach,” <em>Journal of Applied Philosophy</em>, 30(2):\n107–121.",
                "–––, 2016, “Polygamy, Privacy, and\nEquality,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 160–179.",
                "–––, 2018, “Decoupling Marriage and\nParenting,” <em>Journal of Applied Philosophy</em>, 35(3):\n496–512.",
                "Sommers, Christina Hoff, 1989, “Philosophers Against the\nFamily,” in <em>Person to Person</em>, George Graham and Hugh\nLaFollete (eds.), Philadelphia: Temple University Press, pp.\n82–105.",
                "Steinbock, Bonnie, 1986, “Adultery,” <em>QQ: Report\nfrom the Center for Philosophy and Public Policy</em>, 6(1):\n12–14.",
                "Sticker, Martin, 2020, “The Case against Different-Sex\nMarriage in Kant,” <em>Kantian Review</em>, 25(3):\n441–464.",
                "Stivers, Andrew, and Valls, Andrew, 2007, “Same-sex marriage\nand the regulation of language,” <em>Politics, Philosophy and\nEconomics</em>, 6(2): 237–253.",
                "Strauss, Gregg, 2012, “Is Polygamy Inherently\nUnequal?,” <em>Ethics</em>, 122(3): 516–544.",
                "Sunstein, Cass, and Thaler, Richard, 2008, “Privatizing\nMarriage,” <em>The Monist</em>, 91(3–4):\n377–387.",
                "Tjaden, Patricia, and Thoennes, Nancy, 2000, “Full Report of\nthe Prevalence, Incidence, and Consequences of Violence Against\nWomen,” Findings from the National Violence Against Women\nSurvey, published by the U. S. Department of Justice, NCJ 183781.",
                "Toop, Alison, 2019, “Is Marriage Incompatible with Political\nLiberalism,” <em>Journal of Moral Philosophy</em>, 16(3):\n302–326.",
                "Tuana, Nancy, 2004, “Coming to Understand: Orgasm and the\nEpistemology of Ignorance,” <em>Hypatia</em>, 19(1):\n194–232.",
                "Vanderheiden, Steve, 1999, “Why the State Should Stay Out of\nthe Wedding Chapel,” <em>Public Affairs Quarterly</em>, 13(2):\n175–190.",
                "Waldron, Jeremy, 1988, “When Justice Replaces Affection: The\nNeed for Rights,” <em>Harvard Journal of Law and Public\nPolicy</em>, 11(3): 625–647.",
                "–––, 1988–89, “Autonomy and\nPerfectionism in Raz’s <em>Morality of Freedom</em>,”\n<em>Southern California Law Review</em>, 62: 1097–1152.",
                "Walker, Greg, 2015, “Public Reason Liberalism and\nSex-Neutral Marriage A Response to Francis J. Beckwith,”\n<em>Ratio Juris</em>, 28(4): 486–503.",
                "Wallenstein, Peter, 2002, <em>Tell the Court I Love My Wife: Race,\nMarriage, and Law—An American History</em>, New York: Palgrave\nMacmillan.",
                "Wasserstrom, Richard, 1974, “Is Adultery Immoral?,” in\n<em>Philosophical Forum</em>, 5: 513–528.",
                "Wedgwood, Ralph, 1999, “The Fundamental Argument for\nSame-Sex Marriage,” <em>The Journal of Political\nPhilosophy</em>, 7(3): 225–242.",
                "–––, 2016, “Is Civil Marriage\nIlliberal?,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 29–50.",
                "Weitzman, Lenore, 1981, <em>The Marriage Contract</em>, New York:\nMacmillan.",
                "Wellington, Adrian Alex, 1995, “Why Liberals Should Support\nSame Sex Marriage,” <em>Journal of Social Philosophy</em>,\n26(3): 5–32.",
                "Williams, Reginald, 2011, “Same-Sex Marriage and\nEquality,” <em>Ethical Theory and Moral Practice</em>, 14(5):\n589–595.",
                "Wilson, John, 1989, “Can One Promise to Love\nAnother?,” <em>Philosophy</em>, 64: 557–63.",
                "Young, Iris Marion, 1995, “Mothers, Citizenship, and\nIndependence: A Critique of Pure Family Values,”\n<em>Ethics</em>, 105: 535–556.\n</ul>\n<h3>"
            ],
            "<a name=\"HisWorFirPubPri195\">Historical Works</a>": [
                "</h3>\n<p>\nThe following works were first published prior to 1950.</p>\n<ul class=\"hanging\">",
                "Abelard and Heloise, 2003, <em>The Letters of Abelard and\nHeloise</em>, Betty Radice (trans.), M. T. Clanchy (rev.), London:\nPenguin, revised edition.",
                "Aquinas, Thomas, 1981, <em>Summa Theologiae</em>, English\nDominicans (trans.), New York: Christian Classics (reprint of London:\nBurns, Oates, and Washbourne 1912–36).",
                "Aristotle, 1984, <em>The Complete Works of Aristotle: The Revised\nOxford Translation</em>, Jonathan Barnes (ed.), Princeton: Princeton\nUniversity Press.",
                "Astell, Mary, 1700, “Reflections upon Marriage,” in\n<em>Political Writings</em>, Patricia Springborg (ed.), Cambridge:\nCambridge University Press, 1996, pp. 1–80.",
                "Augustine, 1999, <em>Marriage and Virginity: The Excellence of\nMarriage, Holy Virginity, The Excellence of Widowhood, Adulterous\nMarriages, Continence</em>, vol. I/9, Ray Kearney (trans), David\nHunter (ed.), John E. Rotelle (series ed.), Hyde Park, New York: New\nCity Press.",
                "Augustine, 1998, <em>Answer to the Pelagians, II: Marriage and\nDesire, Answer to the Two Letters of the Pelagians, Answer to\nJulian</em>, vol. I/24, Roland J. Teske (trans.), John E. Rotelle\n(series ed.), Hyde Park, New York: New City Press.",
                "de Beauvoir, Simone, 1949, <em>Le Deuxième sexe</em>,\nParis: Gallimard. Translated as <em>The Second Sex</em>, H. M.\nParshley (trans.), New York: Vintage, 1972. [Page references to 1989\nedition.]",
                "Engels, Friedrich, 1884 [1972], <em>The Origin of the Family,\nPrivate Property, and the State</em>, Eleanor Burke Leacock (ed.), New\nYork: International.",
                "Hegel, G. W. F., 1995, <em>Elements of the Philosophy of\nRight</em>, Allen W. Wood (ed.), H. B. Nisbet (trans.), Cambridge:\nCambridge University Press.",
                "Hobbes, Thomas, 1962, <em>Leviathan</em>, Michael Oakeshott (ed.),\nNew York: Simon and Schuster.",
                "Kant, Immanuel, 1785 [1991], <em>The Metaphysics of Morals</em>,\nMary Gregor (trans.), Cambridge: Cambridge University Press.",
                "–––, 1798 [2006], <em>Anthropology from a\nPragmatic Point of View</em>, Robert B. Louden (trans., ed.),\nCambridge: Cambridge University Press.",
                "Kierkegaard, Søren, 1987, <em>Either/Or</em>, 2 vols.,\nHoward V. Hong and Edna H. Hong (trans.), Princeton: Princeton\nUniversity Press.",
                "Locke, John, 1988, <em>Two Treatises of Government</em>, Peter\nLaslett (ed.), Cambridge: Cambridge University Press.",
                "Mill, John Stuart, 1988, <em>The Subjection of Women</em>, Susan\nMoller Okin (ed.), Indianapolis: Hackett Publishing Company.",
                "Marx, Karl, 1848, <em>The Communist Manifesto</em>, in\n<em>Selected Writings</em>, Lawrence Simon (ed.), Indianapolis:\nHackett, 1994, pp. 157–186.",
                "Plato, 1997, <em>Complete Works</em>, John Cooper (ed.), D. S.\nHutchinson (assoc. ed.), Indianapolis: Hackett Publishing Co.",
                "Rousseau, Jean-Jacques, 1762 [1993], <em>Émile</em>,\nBarbara Foxley (trans.), P. D. Jimack (intro.), London: J. M.\nDent.",
                "Russell, Bertrand, 1929, <em>Marriage and Morals</em>, New York:\nHorace Liveright.",
                "Wollstonecraft, Mary, 1792 [1997], <em>The Vindications: The\nRights of Men, The Rights of Woman</em>, D.L. Macdonald and Kathleen\nScherf (eds.), Peterborough, ON.: Broadview.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"ConWor\">Contemporary Works</a></h3>\n<ul class=\"hanging\">\n<li>Abbey, Ruth, and Den Uyl, Douglas, 2001, “The Chief\nInducement? The Idea of Marriage As Friendship,” <em>Journal of\nApplied Philosophy</em>, 18(1): 37–52.</li>\n<li>Almeida, Luís Duarte d’, 2012, “Legal\nSex,” <em>Oxford Studies in Philosophy of Law</em> (Volume 2),\nOxford: Oxford University Press, pp. 277–310.</li>\n<li>Altman, Matthew C., 2010, “Kant on Sex and Marriage: The\nImplications for the Same-Sex Marriage Debate,”\n<em>Kant-Studien</em>, 101(3): 309–330.</li>\n<li>Arneson, Richard, 2005, “The Meaning of Marriage: State\nEfforts to Facilitate Friendship, Love, and Childrearing,”\n<em>San Diego Law Review</em>, 42: 979–1001.</li>\n<li>Arroyo, Christopher, 2018, “Is the Same-sex Marriage Debate\nReally Just about Marriage?,” <em>Journal of Applied\nPhilosophy</em>, 35(1): 186–203.</li>\n<li>Baltzly, Vaughn Bryan, 2012, “Same-Sex Marriage, Polygamy,\nand Disestablishment,” <em>Social Theory and Practice</em>,\n38(2): 333–362.</li>\n<li>Barry, Peter Brian, 2011, “Same-Sex Marriage and the Charge\nof Illiberality,” <em>Social Theory and Practice</em>, 37(2):\n333–357.</li>\n<li>Beckwith, Francis J., 2013, “Justificatory Liberalism and\nSame-Sex Marriage,” <em>Ratio Juris</em>, 26(4):\n487–509.</li>\n<li>Bennett, Christopher, 2003, “Liberalism, Autonomy, and\nConjugal Love,” <em>Res Publica</em>, 9: 285–301.</li>\n<li>Beyer, Jason A., 2002, “Public Dilemmas and Gay Marriage:\nContra Jordan,” <em>Journal of Social Philosophy</em>, 33(1):\n9–16.</li>\n<li>Bhandary, Asha, 2018, “Arranged Marriage: Could It\nContribute to Justice?,” <em>Journal of Political\nPhilosophy</em>, 26(2): 193–215.</li>\n<li>Blankschaen, Kurt, 2020, “Rethinking Same-Sex Sex in Natural\nLaw Theory,” <em>Journal of Applied Philosophy</em>, 37(3):\n428–445.</li>\n<li>Boonin, David, 1999, “Same-Sex Marriage and the Argument\nfrom Public Disagreement,” <em>Journal of Social\nPhilosophy</em>, 30(2): 251–259.</li>\n<li>Boswell, John, 1994, <em>The Marriage of Likeness: Same-Sex Unions\nin Pre-Modern Europe</em>, London: HarperCollins.</li>\n<li>Brake, Elizabeth, 2005, “Justice and Virtue in Kant’s\nAccount of Marriage,” <em>Kantian Review</em>, 9:\n58–94.</li>\n<li>–––, 2012, <em>Minimizing Marriage: Marriage,\nMorality, and the Law</em>, New York: Oxford University Press.</li>\n<li>–––, 2014, “Recognizing Care: The Case for\nFriendship and Polyamory,” <em>Syracuse Law and Civic Engagement\nJournal</em>, 1,\n [<a href=\"http://slace.syr.edu/wp-content/uploads/2014/08/Brake-Article-Final.pdf\" target=\"other\">available online</a>].</li>\n<li>–––, 2016, “Equality and Non-Hierarchy in\nMarriage: What Do Feminists Really Want?,” in <em>After\nMarriage: Rethinking Marital Relationships</em>, E. Brake (ed.), New\nYork: Oxford University Press, pp. 100–124.</li>\n<li>–––, 2018, “Do Subversive Weddings\nChallenge Amatonormativity? Polyamorous Weddings and Romantic Love\nIdeals,” <em>Analize: Journal of Gender and Feminist\nStudies</em>, 11,\n [<a href=\"http://www.analize-journal.ro/library/files/numarul_11/11_3_elizabeth_brake_61-84.pdf\" target=\"other\">Brake 2018 available online</a>].</li>\n<li>Brennan, Samantha, and Bill Cameron, 2016, “Is Marriage Bad\nfor Children? Rethinking the Connection between Having Children,\nRomantic Love, and Marriage,” in <em>After Marriage: Rethinking\nMarital Relationships</em>, E. Brake (ed.), New York: Oxford\nUniversity Press, pp. 84–99.</li>\n<li>Brooks, Thom, 2009, “The Problem with Polygamy,”\n<em>Philosophical Topics</em>, 37(2): 109–22.</li>\n<li>Buccola, Nicholas, 2005, “Finding Room for Same-Sex\nMarriage: Toward a More Inclusive Understanding of a Cultural\nInstitution,” <em>Journal of Social Philosophy</em>, 36(3):\n331–343.</li>\n<li>Calhoun, Cheshire, 2000, <em>Feminism, the Family, and the\nPolitics of the Closet: Lesbian and Gay Displacement</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2005, “Who’s Afraid of\nPolygamous Marriage? Lessons for Same-Sex Marriage Advocacy from the\nHistory of Polygamy,” <em>San Diego Law Review</em>, 42:\n1023–1042.</li>\n<li>Cannon, Loren, 2009, “Trans-Marriage and the Unacceptability\nof Same-Sex Marriage Restrictions,” <em>Social Philosophy\nToday</em>, 25: 75–89.</li>\n<li>Card, Claudia, 1996, “Against Marriage and\nMotherhood,” <em>Hypatia</em>, 11(3): 1–23.</li>\n<li>–––, 2007, “Gay Divorce: Thoughts on the\nLegal Regulation of Marriage,” <em>Hypatia</em>, 22(1):\n24–38.</li>\n<li>Cave, Eric M., 2003, “Marital Pluralism: Making Marriage\nSafer for Love,” <em>Journal of Social Philosophy</em>, 34(3):\n331–347.</li>\n<li>–––, 2004, “Harm Prevention and the\nBenefits of Marriage,” <em>Journal of Social Philosophy</em>,\n35(2): 233–243.</li>\n<li>–––, 2017, “Liberalism, Civil Marriage,\nand Amorous Caregiving Dyads,” <em>Journal of Applied\nPhilosophy</em>, 36(1): 50–72.</li>\n<li>Chambers, Clare, 2013, “The Marriage-Free State,”\n<em>Proceedings of the Aristotelian Society</em>, 113 (2):\n123–143.</li>\n<li>–––, 2016, “The Limitations of Contract:\nRegulating Personal Relationships in a Marriage-Free State,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 51–83.</li>\n<li>–––, 2017, <em>Against Marriage: An Egalitarian\nDefence of the Marriage-Free State</em>, Oxford: Oxford University\nPress.</li>\n<li>Chan, Sarah, and Daniela Cutas (eds.), 2012, <em>Families\n––Beyond the Nucelar Ideal</em>, New York: Bloomsbury\nAcademic.</li>\n<li>Chartier, Gary, 2016, <em>Public Practice, Private Law: An Essay\non Love, Marriage, and the State</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Collins, Patricia Hill, 1998, “It’s All in the Family:\nIntersections of Gender, Race, and Nation,” <em>Hypatia</em>,\n13(3): 62–82.</li>\n<li>Coontz, Stephanie, 2006, <em>Marriage: a History</em>, London:\nPenguin.</li>\n<li>Corvino, John, 2005, “Homosexuality and the PIB\nArgument,” <em>Ethics</em>, 115: 501–534.</li>\n<li>Cott, Nancy, 2000, <em>Public Vows: A History of Marriage and the\nNation</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Cronan, Sheila, 1973, “Marriage,” in <em>Radical\nFeminism</em>, ed. Anne Koedt, Ellen Levine, Anita Rapone, New York:\nQuadrangle, pp.213 –221.</li>\n<li>Crookston, Emily, 2014, “Love and Marriage?,”\n<em>Journal of Moral Philosophy</em>, 11(4): 267–289.</li>\n<li>De Marneffe, Peter, 2016, “Liberty and Polygamy,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 125–159.</li>\n<li>Den Otter, Ron, 2015, <em>In Defense of Plural Marriage</em>,\nCambridge: Cambridge University Press.</li>\n<li>Denike, Margaret, 2010, “The Racialization of White\nMan’s Polygamy,” <em>Hypatia</em>, 25(4):\n852–874.</li>\n<li>Devlin, Patrick, 1965, <em>The Enforcement of Morals</em>, Oxford:\nOxford University Press.</li>\n<li>Emens, Elizabeth F., 2004, “Monogamy’s Law: Compulsory\nMonogamy and Polyamorous Existence,” <em>New York University\nReview of Law and Social Change</em>, 29: 277–376.</li>\n<li>Ettelbrick, Paula, “Since When is Marriage a Path to\nLiberation?,” 1989, <em>Out/look: National Lesbian and Gay\nQuarterly</em>, 6(9): 14–17; reprinted in Andrew Sullivan (ed.),\n<em>Same-Sex Marriage: Pro and Con</em>, New York: Vintage, 2004, pp.\n122–128.</li>\n<li>Ferguson, A., 2007, “Gay Marriage: An American and Feminist\nDilemma,” <em>Hypatia</em>, 22(1): 39–57.</li>\n<li>Ferguson, Michaele L., 2016, “Vulnerability by Marriage:\nOkin’s Radical Feminist Critique of Structural Gender\nInequality,” <em>Hypatia</em> (A Journal of Feminist\nPhilosophy), 31(3): 687–703.</li>\n<li>Ferracioli, Luara, 2016, “Family Migration Schemes and\nLiberal Neutrality: A Dilemma,” <em>Journal of Moral\nPhilosophy</em>, 13(5): 553–575.</li>\n<li>Fineman, Martha, 2004, <em>The Autonomy Myth: A Theory of\nDependency</em>, New York: The New Press.</li>\n<li>Finnis, John, 1994, “Law, Morality, and ‘Sexual\nOrientation’,” <em>Notre Dame Law Review</em>, 69:\n1049–1076.</li>\n<li>–––, 1997, “The Good of Marriage and the\nMorality of Sexual Relations: Some Philosophical and Historical\nObservations,” <em>American Journal of Jurisprudence</em>, 42:\n97–134.</li>\n<li>–––, 2008, “Marriage: A Basic and Exigent\nGood,” <em>The Monist</em>, 91(3–4): 388–406.</li>\n<li>Firestone, Shulamith, 1970, <em>The Dialectic of Sex: The Case for\nFeminist Revolution</em>, New York: William Morrow and Co.</li>\n<li>Galston, William, 1991, <em>Liberal Purposes</em>, Cambridge:\nCambridge University Press.</li>\n<li>Garrett, Jeremy, 2008, “History, Tradition, and the\nNormative Foundations of Civil Marriage,” <em>The Monist</em>,\n91(3–4): 446–474.</li>\n<li>–––, 2008, “Why the Old Sexual Morality of\nthe New Natural Law Undermines Traditional Marriage,” <em>Social\nTheory and Practice</em>, 34(4): 591–622.</li>\n<li>–––, 2009, “A Prima Facie Case Against\nCivil Marriage,” <em>Southwest Philosophy Review</em>, 25(1):\n41–53.</li>\n<li>George, Robert P., 2000, “‘Same-Sex Marriage’\nand ‘Moral Neutrality’,” in <em>Homosexuality and\nAmerican Public Life</em>, Christopher Wolfe (ed.), Dallas: Spence\nPublishing Company, pp. 141–153.</li>\n<li>Gheaus, Anca, 2016, “The (Dis)value of Commitment to\nOne’s Spouse,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 204–224.</li>\n<li>Girgis, Sherif, Robert P. George, and Ryan T. Anderson, 2010,\n“What is Marriage?” <em>Harvard Journal of Law and Public\nPolicy</em>, 34(1): 245–288.</li>\n<li>Goldstein, Joshua D., 2011, “New Natural Law Theory and the\nGrounds of Marriage,” <em>Social Theory and Practice</em>, 37\n(3): 461–482.</li>\n<li>Grisez, Germain, 1993, <em>The Way of the Lord Jesus</em>, vol. 2\n<em>Living a Christian Life</em>, Quincy, IL: Franciscan Press.</li>\n<li>Halwani, Raja, 2003, <em>Virtuous Liaisons</em>, Peru, IL: Open\nCourt.</li>\n<li>Hartley, Christie, and Watson, Lori, 2012, “Political\nLiberalism, Marriage and the Family,” <em>Law and\nPhilosophy</em>, 31(2): 185–212.</li>\n<li>Herman, Barbara, 1993, “Could it be worth thinking about\nKant on sex and marriage?,” in <em>A Mind of One’s\nOwn</em>, Louise Antony and Charlotte Witt (eds.), Oxford: Westview\nPress, pp. 49–67.</li>\n<li>Houlgate, Laurence, 2005, <em>Children’s Rights, State\nIntervention, Custody and Divorce: Contradictions in Ethics and Family\nLaw</em>, Lewiston, NY: The Mellen Press.</li>\n<li>Johnson, Rebekah, 2013, “Marriage and the Metaphysics of\nBodily Union,” <em>Social Theory and Practice</em>, 39(2):\n288–312.</li>\n<li>Jordan, Jeff, 1995, “Is It Wrong to Discriminate on the\nBasis of Homosexuality?,” <em>Journal of Social Philosophy</em>,\n26(1): 39–52.</li>\n<li>Kleingeld, Pauline, 1998, “Just Love? Marriage and the\nQuestion of Justice,” <em>Social Theory and Practice</em>,\n24(2): 261–281.</li>\n<li>Kronqvist, Camilla, 2011, “The Promise That Love Will\nLast,” <em>Inquiry</em>, 54(6): 650–668.</li>\n<li>Kymlicka, Will, 1991,“Rethinking the Family,”\n<em>Philosophy and Public Affairs</em>, 20(1): 77–97.</li>\n<li>Landau, Iddo, 2004, “An Argument for Marriage,”\n<em>Philosophy</em>, 79: 475–481.</li>\n<li>–––, 2012, “Should Marital Relations be\nNon-Hierarchical?,” <em>Ratio</em>, 25(1): 51–67.</li>\n<li>Lee, Patrick, 2008, “Marriage, Procreation, and Same-Sex\nUnions,” <em>The Monist</em>, 91(3–4): 422–438.</li>\n<li>Li, Xiaorong, 1995, “Gender Inequality in China and Cultural\nRelativism,” in <em>Women, Culture and Development: A Study of\nHuman Capabilities</em>, Martha Nussbaum and Jonathan Glovers (eds.),\nNew York: Oxford University Press, pp. 407–425.</li>\n<li>Macedo, Stephen, 1995, “Homosexuality and the Conservative\nMind,” <em>Georgetown Law Review</em>, 84: 261–300.</li>\n<li>–––, 2015, <em>Just Married: Same-Sex Couples,\nMonogamy &amp; the Future of Marriage</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Mahoney, Jon, 2008, “Liberalism and the Polygamy\nQuestion,” <em>Social Philosophy Today</em>, 23:\n161–174.</li>\n<li>Manning, W., Fettro, M., and Lamidi, E., 2014, “Child\nWell-Being in Same-Sex Parent Families: Review of Research Prepared\nfor the American Sociological Association Amicus Brief,”\n<em>Population Research &amp; Policy Review</em>, 33(4):\n485–502.</li>\n<li>March, Andrew F., 2010, “What Lies Beyond Same-Sex Marriage?\nMarriage, Reproductive Freedom and Future Persons in Liberal Public\nJustification,” <em>Journal of Applied Philosophy</em>, 27(1):\n39–58.</li>\n<li>March, Andrew F., 2011, “Is There a Right to Polygamy?\nMarriage, Equality, and Subsidizing Families in Liberal Political\nJustification,” <em>Journal of Moral Philosophy</em>, 8:\n246–272.</li>\n<li>Marquis, Don, 2005, “What’s Wrong with\nAdultery?,” in <em>What’s Wrong?</em>, Graham Oddie and\nDavid Boonin (eds.), New York: Oxford University Press, pp.\n231–238.</li>\n<li>Martin, Mike W., 1993, “Love’s Constancy,”\n<em>Philosophy</em>, 68(263): 63–77.</li>\n<li>–––, 1994, “Adultery and Fidelity,”\n<em>Journal of Social Philosophy</em>, 25(3): 76–91.</li>\n<li>May, Simon, 2016, “Liberal Neutrality and Civil\nMarriage,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 9–28.</li>\n<li>Mayo, David J. and Gunderson, Martin, 2000, “The Right to\nSame-Sex Marriage: A Critique of the Leftist Critique,”\n<em>Journal of Social Philosophy</em>, 31(3): 326–337.</li>\n<li>McClain, Linda C., 2013, “The Other Marriage Equality\nProblem,” <em>Boston University Law Review</em>, 93(3):\n921–970.</li>\n<li>McMurtry, John, 1972, “Monogamy: A Critique,” <em>The\nMonist</em>, 56: 587–99.</li>\n<li>Mendus, Susan, 1984, “Marital Faithfulness,”\n<em>Philosophy</em>, 59: 243–252.</li>\n<li>Mercier, Adèle, 2001, <em>Affidavit</em>, Ontario Superior\nCourt of Justice (Divisional Court), Between Halpern al. (Applicants)\nand <em>Canada (Attorney General</em>) et al. (Respondents), Court\nfile 30/2001, 30/2001, Nov.\n [<a href=\"https://web.archive.org/web/20170227000528/http://www.samesexmarriage.ca/docs/adele_mercier.pdf\" target=\"other\">available online</a>]</li>\n<li>Metz, Tamara, 2010, <em>Untying the Knot: Marriage, the State, and\nthe Case for their Divorce</em>, Princeton: Princeton University\nPress.</li>\n<li>Mohr, Richard D., 2005, <em>The Long Arc of Justice: Lesbian and\nGay Marriage, Equality, and Rights</em>, New York: Columbia University\nPress.</li>\n<li>Moller, Dan, 2003, “An Argument Against Marriage,”\n<em>Philosophy</em>, 78(1): 79–91.</li>\n<li>Morse, Jennifer Roback, 2006, “Why Unilateral Divorce Has No\nPlace in a Free Society,” in <em>The Meaning of Marriage</em>,\nRobert P. George and Jean Bethke Elshtain (eds.), Dallas: Spence\nPublishing Co, pp. 74–99.</li>\n<li>Moses, Julia (ed.), 2018, <em>Marriage, Law and Modernity: Global\nHistories</em>, New York: Bloomsbury.</li>\n<li>Murphy, Timothy F., 2011, “Same-Sex Marriage: Not a Threat\nto Marriage or Children,” <em>Journal of Social Philosophy</em>,\n42(3): 288–304.</li>\n<li>Narayan, Uma, 1995, “‘Male-Order’ Brides:\nImmigrant Women, Domestic Violence and Immigration Law,”\n<em>Hypatia</em>, 10(1): 104–119.</li>\n<li>–––, 1997, <em>Dislocating Cultures: Identities,\nTraditions, and Third-World Feminism</em>, Routledge: New York.</li>\n<li>Nolan, Daniel, 2016, “Temporary Marriage,” in\n<em>After Marriage: Rethinking Marital Relationships</em>, E. Brake\n(ed.), New York: Oxford University Press, pp. 180–203.</li>\n<li>–––, forthcoming, “Marriage and its\nLimits,” <em>Inquiry</em>.</li>\n<li>Nussbaum Martha, 1999, <em>Sex and Social Justice</em>, Oxford:\nOxford University Press.</li>\n<li>Okin, Susan Moller, 1979, <em>Women in Western Political\nThought</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1989, <em>Justice, Gender, and the\nFamily</em>, New York: Basic Books.</li>\n<li>–––, 1994, “Political Liberalism<em>,\nJustice, and Gender</em>,” <em>Ethics</em>, 105(1):\n23–43.</li>\n<li>Papadaki, Lina, 2010, “Kantian Marriage and Beyond: Why It\nIs Worth Thinking About Kant on Marriage,” <em>Hypatia</em>, 25\n(2): 276–294.</li>\n<li>Parsons, Kate, 2008, “Subverting the Fellowship of the\nWedding Ring,” <em>Journal of Social Philosophy</em>, 39(3):\n393–410.</li>\n<li>Pateman, Carole, 1988, <em>The Sexual Contract</em>, Cambridge:\nPolity Press.</li>\n<li>Posner, Richard, and Silbaugh, Katharine, 1996, <em>A Guide to\nAmerica’s Sex Laws</em>, Chicago: The University of Chicago\nPress.</li>\n<li>Rajczi, Alex, 2008, “A Populist Argument for Same-Sex\nMarriage,” <em>The Monist</em>, 91(3–4):\n475–505.</li>\n<li>Rawls, John, 1997, “The Idea of Public Reason\nRevisited,” <em>The University of Chicago Law Review</em>,\n64(3): 765–807.</li>\n<li>Raz, Joseph, 1986, <em>The Morality of Freedom</em>, Oxford:\nOxford University Press.</li>\n<li>Robson, Ruthann, 2007, “A Mere Switch or a Fundamental\nChange? Theorizing Transgender Marriage,” <em>Hypatia</em>, 22\n(1): 58–70.</li>\n<li>Sandel, Michael, 1982, <em>Liberalism and the Limits of\nJustice</em>, Cambridge: Cambridge University Press.</li>\n<li>Savulescu, Julian, and Sandberg, Anders, 2008,\n“Neuroenhancement of Love and Marriage: The Chemicals Between\nUs,” <em>Neuroethics</em>, 1: 31–44.</li>\n<li>Schaff, Kory, 2004, “Equal Protection and Same-Sex\nMarriage,” <em>Journal of Social Philosophy</em>, 35(1):\n133–147.</li>\n<li>Scruton, Roger, 1986, <em>Sexual Desire</em>, London: The Free\nPress.</li>\n<li>Shanley, Mary Lyndon, <em>et al</em>., 2004, <em>Just\nMarriage</em>, Oxford: Oxford University Press (includes title essay\nby Shanley and short replies by 13 others).</li>\n<li>Shrage, Laurie, 2013, “Reforming Marriage: A Comparative\nApproach,” <em>Journal of Applied Philosophy</em>, 30(2):\n107–121.</li>\n<li>–––, 2016, “Polygamy, Privacy, and\nEquality,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 160–179.</li>\n<li>–––, 2018, “Decoupling Marriage and\nParenting,” <em>Journal of Applied Philosophy</em>, 35(3):\n496–512.</li>\n<li>Sommers, Christina Hoff, 1989, “Philosophers Against the\nFamily,” in <em>Person to Person</em>, George Graham and Hugh\nLaFollete (eds.), Philadelphia: Temple University Press, pp.\n82–105.</li>\n<li>Steinbock, Bonnie, 1986, “Adultery,” <em>QQ: Report\nfrom the Center for Philosophy and Public Policy</em>, 6(1):\n12–14.</li>\n<li>Sticker, Martin, 2020, “The Case against Different-Sex\nMarriage in Kant,” <em>Kantian Review</em>, 25(3):\n441–464.</li>\n<li>Stivers, Andrew, and Valls, Andrew, 2007, “Same-sex marriage\nand the regulation of language,” <em>Politics, Philosophy and\nEconomics</em>, 6(2): 237–253.</li>\n<li>Strauss, Gregg, 2012, “Is Polygamy Inherently\nUnequal?,” <em>Ethics</em>, 122(3): 516–544.</li>\n<li>Sunstein, Cass, and Thaler, Richard, 2008, “Privatizing\nMarriage,” <em>The Monist</em>, 91(3–4):\n377–387.</li>\n<li>Tjaden, Patricia, and Thoennes, Nancy, 2000, “Full Report of\nthe Prevalence, Incidence, and Consequences of Violence Against\nWomen,” Findings from the National Violence Against Women\nSurvey, published by the U. S. Department of Justice, NCJ 183781.</li>\n<li>Toop, Alison, 2019, “Is Marriage Incompatible with Political\nLiberalism,” <em>Journal of Moral Philosophy</em>, 16(3):\n302–326.</li>\n<li>Tuana, Nancy, 2004, “Coming to Understand: Orgasm and the\nEpistemology of Ignorance,” <em>Hypatia</em>, 19(1):\n194–232.</li>\n<li>Vanderheiden, Steve, 1999, “Why the State Should Stay Out of\nthe Wedding Chapel,” <em>Public Affairs Quarterly</em>, 13(2):\n175–190.</li>\n<li>Waldron, Jeremy, 1988, “When Justice Replaces Affection: The\nNeed for Rights,” <em>Harvard Journal of Law and Public\nPolicy</em>, 11(3): 625–647.</li>\n<li>–––, 1988–89, “Autonomy and\nPerfectionism in Raz’s <em>Morality of Freedom</em>,”\n<em>Southern California Law Review</em>, 62: 1097–1152.</li>\n<li>Walker, Greg, 2015, “Public Reason Liberalism and\nSex-Neutral Marriage A Response to Francis J. Beckwith,”\n<em>Ratio Juris</em>, 28(4): 486–503.</li>\n<li>Wallenstein, Peter, 2002, <em>Tell the Court I Love My Wife: Race,\nMarriage, and Law—An American History</em>, New York: Palgrave\nMacmillan.</li>\n<li>Wasserstrom, Richard, 1974, “Is Adultery Immoral?,” in\n<em>Philosophical Forum</em>, 5: 513–528.</li>\n<li>Wedgwood, Ralph, 1999, “The Fundamental Argument for\nSame-Sex Marriage,” <em>The Journal of Political\nPhilosophy</em>, 7(3): 225–242.</li>\n<li>–––, 2016, “Is Civil Marriage\nIlliberal?,” in <em>After Marriage: Rethinking Marital\nRelationships</em>, E. Brake (ed.), New York: Oxford University Press,\npp. 29–50.</li>\n<li>Weitzman, Lenore, 1981, <em>The Marriage Contract</em>, New York:\nMacmillan.</li>\n<li>Wellington, Adrian Alex, 1995, “Why Liberals Should Support\nSame Sex Marriage,” <em>Journal of Social Philosophy</em>,\n26(3): 5–32.</li>\n<li>Williams, Reginald, 2011, “Same-Sex Marriage and\nEquality,” <em>Ethical Theory and Moral Practice</em>, 14(5):\n589–595.</li>\n<li>Wilson, John, 1989, “Can One Promise to Love\nAnother?,” <em>Philosophy</em>, 64: 557–63.</li>\n<li>Young, Iris Marion, 1995, “Mothers, Citizenship, and\nIndependence: A Critique of Pure Family Values,”\n<em>Ethics</em>, 105: 535–556.</li>\n</ul>\n<h3><a name=\"HisWorFirPubPri195\">Historical Works</a></h3>\n<p>\nThe following works were first published prior to 1950.</p>\n<ul class=\"hanging\">\n<li>Abelard and Heloise, 2003, <em>The Letters of Abelard and\nHeloise</em>, Betty Radice (trans.), M. T. Clanchy (rev.), London:\nPenguin, revised edition.</li>\n<li>Aquinas, Thomas, 1981, <em>Summa Theologiae</em>, English\nDominicans (trans.), New York: Christian Classics (reprint of London:\nBurns, Oates, and Washbourne 1912–36).</li>\n<li>Aristotle, 1984, <em>The Complete Works of Aristotle: The Revised\nOxford Translation</em>, Jonathan Barnes (ed.), Princeton: Princeton\nUniversity Press.</li>\n<li>Astell, Mary, 1700, “Reflections upon Marriage,” in\n<em>Political Writings</em>, Patricia Springborg (ed.), Cambridge:\nCambridge University Press, 1996, pp. 1–80.</li>\n<li>Augustine, 1999, <em>Marriage and Virginity: The Excellence of\nMarriage, Holy Virginity, The Excellence of Widowhood, Adulterous\nMarriages, Continence</em>, vol. I/9, Ray Kearney (trans), David\nHunter (ed.), John E. Rotelle (series ed.), Hyde Park, New York: New\nCity Press.</li>\n<li>Augustine, 1998, <em>Answer to the Pelagians, II: Marriage and\nDesire, Answer to the Two Letters of the Pelagians, Answer to\nJulian</em>, vol. I/24, Roland J. Teske (trans.), John E. Rotelle\n(series ed.), Hyde Park, New York: New City Press.</li>\n<li>de Beauvoir, Simone, 1949, <em>Le Deuxième sexe</em>,\nParis: Gallimard. Translated as <em>The Second Sex</em>, H. M.\nParshley (trans.), New York: Vintage, 1972. [Page references to 1989\nedition.]</li>\n<li>Engels, Friedrich, 1884 [1972], <em>The Origin of the Family,\nPrivate Property, and the State</em>, Eleanor Burke Leacock (ed.), New\nYork: International.</li>\n<li>Hegel, G. W. F., 1995, <em>Elements of the Philosophy of\nRight</em>, Allen W. Wood (ed.), H. B. Nisbet (trans.), Cambridge:\nCambridge University Press.</li>\n<li>Hobbes, Thomas, 1962, <em>Leviathan</em>, Michael Oakeshott (ed.),\nNew York: Simon and Schuster.</li>\n<li>Kant, Immanuel, 1785 [1991], <em>The Metaphysics of Morals</em>,\nMary Gregor (trans.), Cambridge: Cambridge University Press.</li>\n<li>–––, 1798 [2006], <em>Anthropology from a\nPragmatic Point of View</em>, Robert B. Louden (trans., ed.),\nCambridge: Cambridge University Press.</li>\n<li>Kierkegaard, Søren, 1987, <em>Either/Or</em>, 2 vols.,\nHoward V. Hong and Edna H. Hong (trans.), Princeton: Princeton\nUniversity Press.</li>\n<li>Locke, John, 1988, <em>Two Treatises of Government</em>, Peter\nLaslett (ed.), Cambridge: Cambridge University Press.</li>\n<li>Mill, John Stuart, 1988, <em>The Subjection of Women</em>, Susan\nMoller Okin (ed.), Indianapolis: Hackett Publishing Company.</li>\n<li>Marx, Karl, 1848, <em>The Communist Manifesto</em>, in\n<em>Selected Writings</em>, Lawrence Simon (ed.), Indianapolis:\nHackett, 1994, pp. 157–186.</li>\n<li>Plato, 1997, <em>Complete Works</em>, John Cooper (ed.), D. S.\nHutchinson (assoc. ed.), Indianapolis: Hackett Publishing Co.</li>\n<li>Rousseau, Jean-Jacques, 1762 [1993], <em>Émile</em>,\nBarbara Foxley (trans.), P. D. Jimack (intro.), London: J. M.\nDent.</li>\n<li>Russell, Bertrand, 1929, <em>Marriage and Morals</em>, New York:\nHorace Liveright.</li>\n<li>Wollstonecraft, Mary, 1792 [1997], <em>The Vindications: The\nRights of Men, The Rights of Woman</em>, D.L. Macdonald and Kathleen\nScherf (eds.), Peterborough, ON.: Broadview.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "love",
            "Aquinas, Thomas: moral, political, and legal philosophy",
            "Aristotle, General Topics: ethics",
            "Augustine, Saint",
            "Beauvoir, Simone de",
            "civil rights",
            "ethics: natural law tradition",
            "feminist philosophy, interventions: liberal feminism",
            "feminist philosophy, interventions: philosophy of biology",
            "feminist philosophy, interventions: philosophy of law",
            "feminist philosophy, topics: perspectives on reproduction and the family",
            "feminist philosophy, topics: perspectives on trans issues",
            "Hegel, Georg Wilhelm Friedrich: social and political philosophy",
            "homosexuality",
            "Kant, Immanuel: social and political philosophy",
            "Mill, John Stuart: moral and political philosophy",
            "obligations: special",
            "parenthood and procreation",
            "personal relationship goods",
            "Plato: ethics and politics in The Republic",
            "Russell, Bertrand: moral philosophy",
            "sex and sexuality",
            "social institutions",
            "Wollstonecraft, Mary"
        ],
        "entry_link": [
            {
                "https://plato.stanford.edu/entries/love/": "love "
            },
            {
                "../aquinas-moral-political/": "Aquinas, Thomas: moral, political, and legal philosophy"
            },
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../beauvoir/": "Beauvoir, Simone de"
            },
            {
                "../civil-rights/": "civil rights"
            },
            {
                "../natural-law-ethics/": "ethics: natural law tradition"
            },
            {
                "../feminism-liberal/": "feminist philosophy, interventions: liberal feminism"
            },
            {
                "../feminist-philosophy-biology/": "feminist philosophy, interventions: philosophy of biology"
            },
            {
                "../feminism-law/": "feminist philosophy, interventions: philosophy of law"
            },
            {
                "../feminism-family/": "feminist philosophy, topics: perspectives on reproduction and the family"
            },
            {
                "../feminism-trans/": "feminist philosophy, topics: perspectives on trans issues"
            },
            {
                "../hegel-social-political/": "Hegel, Georg Wilhelm Friedrich: social and political philosophy"
            },
            {
                "../homosexuality/": "homosexuality"
            },
            {
                "../kant-social-political/": "Kant, Immanuel: social and political philosophy"
            },
            {
                "../mill-moral-political/": "Mill, John Stuart: moral and political philosophy"
            },
            {
                "../special-obligations/": "obligations: special"
            },
            {
                "../parenthood/": "parenthood and procreation"
            },
            {
                "../personal-relationship-goods/": "personal relationship goods"
            },
            {
                "../plato-ethics-politics/": "Plato: ethics and politics in The Republic"
            },
            {
                "../russell-moral/": "Russell, Bertrand: moral philosophy"
            },
            {
                "../sex-sexuality/": "sex and sexuality"
            },
            {
                "../social-institutions/": "social institutions"
            },
            {
                "../wollstonecraft/": "Wollstonecraft, Mary"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=marriage\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/marriage/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=marriage&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/marriage/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=marriage": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/marriage/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=marriage&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/marriage/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.unmarried.org/\" target=\"other\">Alternatives to Marriage Project</a>",
            "<a href=\"https://www.gao.gov/assets/ogc-97-16.pdf\">1997 General Accounting Office Report on marriage in U.S. Federal Law</a>"
        ],
        "listed_links": [
            {
                "http://www.unmarried.org/": "Alternatives to Marriage Project"
            },
            {
                "https://www.gao.gov/assets/ogc-97-16.pdf": "1997 General Accounting Office Report on marriage in U.S. Federal Law"
            }
        ]
    }
}