{
    "url": "metaphor",
    "title": "Metaphor",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "David Hills\n<dhills@stanford.edu>",
        "author_links": [
            {
                "mailto:dhills%40stanford%2eedu": "dhills@stanford.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nDavid Hills\n&lt;<a href=\"mailto:dhills%40stanford%2eedu\"><em>dhills<abbr title=\" at \">@</abbr>stanford<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 19, 2011",
        "substantive revision Fri Aug 12, 2022"
    ],
    "preamble": "\n\nMetaphor is a poetically or rhetorically ambitious use of words, a\nfigurative as opposed to literal use. It has\nattracted more philosophical interest and provoked more philosophical\ncontroversy than any of the other traditionally recognized figures of\nspeech.\n",
    "toc": [
        {
            "#NamiPart": "1. Naming of Parts"
        },
        {
            "#AnciAcco": "2. The Ancient Accounts"
        },
        {
            "#Para": "3. Paraphrase"
        },
        {
            "#FourTrad": "4. Four Traditions"
        },
        {
            "#SemaTwisAcco": "4.1 Semantic Twist Accounts"
        },
        {
            "#PragTwisAcco": "4.2 Pragmatic Twist Accounts"
        },
        {
            "#CompAcco": "4.3 Comparativist Accounts"
        },
        {
            "#BrutForcAcco": "4.4 Brute Force Accounts"
        },
        {
            "#ReceDeve": "5. Recent developments"
        },
        {
            "#MetaCognLing": "5.1 Metaphor and Contemporary Linguistics"
        },
        {
            "#MetaContWars": "5.2 Metaphor and the Context Wars"
        },
        {
            "#MetaMakeBeli": "5.3 Metaphor and Make-Believe"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Naming of Parts\n\nBut soft, what light through yonder window breaks?\n\nIt is the east and Juliet is the sun!\n\n(William Shakespeare, Romeo and Juliet, 2. 2. 2–3)\n\n\n—History, Stephen said, is a nightmare from which I am trying to\nawake.\n\n(James Joyce, Ulysses, chap. 2)\n\n\nA work is a death mask of its conception.\n\n(Walter Benjamin, Einbahnstraße)\n\n\nWhen we resort to metaphor, we contrive to talk about two things at\nonce; two different and disparate subject matters are mingled to rich\nand unpredictable effect. One of these subject matters is already\nunder discussion or at least up for consideration when a speaker\nresorts to metaphor in the first place. This is the metaphor’s\nprimary subject or tenor: the young girl Juliet in\nthe case of Romeo’s metaphor; history, Ireland’s history\nor the world’s, in the case of Stephen’s; works, prose\nwritings in general, in the case of Benjamin’s. The second\nsubject matter is newly introduced with an eye to temporarily\nenriching our resources for thinking and talking about the first. This\nis the metaphor’s secondary subject or\nvehicle: the sun; nightmares from which one tries to awake;\ndeath masks, i.e., death masks in general. The primary subject of a\nmetaphor may be a particular thing, or it may be a whole kind of\nthing, and likewise for the secondary subject—with the result\nthat the metaphor itself may take the verbal form of an identity\nstatement (X is Y) as with Romeo; a predication or membership\nstatement (X is a G) as with Stephen Daedalus; or a statement\nof inclusion (Fs are Gs) as with Benjamin.\n\nIf we ask how primary and secondary subjects are brought into relation\nby being spoken of together in a metaphor, it seems natural to say\nthat metaphor is a form of likening, comparing, or\nanalogizing. The maker of a metaphor (or the metaphor itself)\nlikens the primary subject to the secondary subject: Romeo (or\nRomeo’s speech) likens Juliet to the sun, Stephen likens history\nto nightmares, Benjamin likens works in prose to death masks. But it\nis unclear what we mean when we say this, to the point where some are\nreluctant to appeal to likeness or similarity in explaining what\nmetaphor is or how it works. Much of the power and interest of many a\ngood metaphor derives from how massively and conspicuously different\nits two subject matters are, to the point where metaphor is sometimes\ndefined by those with no pretensions to originality as “a\ncomparison of two unlike things.” The interpretation of\na metaphor often turns not on properties the secondary subject\nactually has or even on ones it is believed to have but instead on\nones we habitually pretend it to have: think of what happens when we\ncall someone a gorilla.\n\nMetaphor is but one of many techniques, named and unnamed, for\nlikening one thing to another by means of words. We may employ an\nexplicit comparison of one thing to another, built around\nlike, as, or some other explicit comparative\nconstruction, in what’s known as simile:\n\nOne walking a fall meadow finds on all sides\n\nThe Queen-Anne’s lace lying like lilies on water.\n\n(Richard Wilbur, “The Beautiful Changes”)\n\n\nHe looked about as inconspicuous as a tarantula on a\nslice of angel food.\n\n(Raymond Chandler, Farewell, My Lovely, chap. 1)\n\n\nWe may interweave parallel observations about two different subject\nmatters by means of so and too and thus. We\nmay liken a whole bunch of things to one another by making\nconspicuously parallel statements about each, inviting our listener to\nregister the parallelism and ponder its significance. Or we may simply\njuxtapose mention of a first thing with mention of a second in a\nsuitably conspicuous and suggestive manner:\n\nThe apparition of these faces in the crowd;\n\nPetals on a wet, black bough.\n\n(Ezra Pound, In a Station of The Metro)\n\n\nPart of what is distinctive about metaphorical likening in\nparticular is that in resorting to it, we speak of one thing or kind\n(the primary subject) as and in terms of a second\nthing or kind (the secondary subject). Our deployment of language\ntakes place as if primary subject and secondary subject\n(Juliet and the sun) were one and the same; or as if the\nprimary subject (history) were an instance of the secondary subject\n(nightmares); or as if the primary subject (works) were\nincluded within the secondary subject (death masks). In this sense,\nthe primary subject is spoken of as the secondary subject.\nWords, idioms, and other ways of talking customarily deployed in\nconnection with the secondary subject (the sun, death masks) are\nappropriated and redeployed for use in thinking and talking about the\nprimary subject (Juliet, prose works). In this sense, the primary\nsubject is spoken of and thought about in terms of the\nsecondary subject. It is easy to feel that in Romeo’s metaphor,\nfamiliar fragments of sun-talk come to be about Juliet without ceasing\nto be about the sun. If so, the double aboutness exhibited by\nmetaphorical language is something philosophers must strive to\nunderstand.\n\nA sentence metaphor typically likens many things or kinds to many\nother things or kinds at a single verbal stroke. Benjamin’s\nterse little aphorism manages to liken works to death masks,\nconceptions to living human beings, the changes a conception undergoes\nbefore being incorporated into a finished work to life, the\nstabilization and stultification it allegedly undergoes after such\nincorporation to death—and so on. In the context provided by the\nrest of his speech, Romeo’s exclamation manages to liken Juliet\nto the sun, her room and balcony to the east, Romeo himself to\ncreatures dependent on the sun for warmth and light and nurturance,\nRomeo’s old love Rosaline to that lesser light the moon, the\nsight of Juliet to the light of the sun, Juliet’s appearance at\nher window as the sun’s rising in the east—and so on. Only\nsome of a metaphor’s primary subjects and some of its secondary\nsubjects are explicitly referred to by any verbal expression contained\ntherein. Listeners must work the others out for themselves. In this\nrespect, every metaphor leaves something implicit.\n\nNevertheless, some metaphors are explicit in the sense that\nthey liken one or more named things or kinds to one or more other\nnamed things or kinds by means of locutions regularly found in overt\nliteral statements of identity, membership, or inclusion:\n\nI am a moth and you are a flame.\n\n\nI, Ahab, am a speeding locomotive.\n\n\nwhile other metaphors are implicit in that they eschew such\nsimple alignments, mingling primary subject language and secondary\nsubject language almost at random, yet in such a way as to leave\nlisteners able to work out which is which and what’s being\nlikened to what else:\n\nI shall flutter helplessly closer and closer until you burn me to\ndeath at last.\n\n\nThe path of my fixed purpose is laid with iron rails, whereon my soul\nis grooved to run. Over unsounded gorges, through the rifled hearts of\nmountains, under torrents’ beds, unerringly I rush.\nNaught’s an obstacle, naught’s an angle to the iron way!\n\n—Ahab (Melville, Moby-Dick, chap. 38)\n\n\nWithin the confines of a given metaphor, we distinguish pretty readily\nbetween words and phrases that are to be taken metaphorically and\nothers that are to be taken only literally. To take an expression\nmetaphorically is one way to take it figuratively, and to take an\nexpression figuratively is to reinterpret it, to construe it\nin a manner that departs from but remains informed by some relevant\nprior literal construal of it. Various other kinds of figurative\nreinterpretation are exhibited in various other recognized figures of\nspeech: metonymy (This policy covers you from the cradle to\nthe grave), irony (You’re a fine friend),\nhyperbole (loud enough to wake the dead), and so on.\n\nThe portion of a metaphor that undergoes figurative reinterpretation\nis its focus and the rest is its frame. The focus of\na metaphor may be a single word drawn from almost any part of speech.\nIt may be a multi-word phrase like the sun or death\nmask. It may consist of scattered parts of an extended sentence,\nthe remainder of which is to be taken only literally:\n\nIf, baby, I’m the bottom, you’re the\ntop. (Cole Porter)\n\n\nThe path of my fixed purpose is laid with iron\nrails, where on my soul is grooved to\nrun.\n\n\nOr it may be an extended phrase, rich in internal syntactic\nstructure:\n\nAn aged man is but a paltry thing,\n\nA tattered coat upon a stick …\n\n(W.B. Yeats, “Sailing to Byzantium”)\n\n\nPhilosophers need to elucidate (a) the nature of the difference\nbetween taking language literally and taking it metaphorically, the\nnature, if you will, of the reinterpretation language undergoes when\nwe take it metaphorically, and (b) the nature of the division of\nexpressive labor between a metaphor’s focus and its frame.\n\nLiterary theorists regularly acknowledge the existence of\nextended metaphors, unitary metaphorical likenings that\nsprawl over multiple successive sentences. There are also\ncontracted metaphors, metaphors that run their course within\nthe narrow confines of a single clause or phrase or word. They reveal\nthemselves most readily when distinct metaphors are mixed to\npowerful, controlled, anything but hilarious effect:\n\nPhilosophy is the battle against [the bewitchment of\nour intelligence by means of our language]. (Wittgenstein,\nPhilosophical Investigations, §109)\n\n\nNot all sentence metaphors take the form of declarative sentences by\nany means: there are metaphorical questions, metaphorical commands,\nmetaphorical optatives, etc. Despite such complications, modern\nmetaphor theory tends to treat the freestanding declarative\nmetaphorical sentence as the fundamental unit of metaphorical\naction.\n2. The Ancient Accounts\n\nThis is a distinctively modern development. Ancient philosophers and\nrhetoricians viewed metaphor as a temporary self-explanatory change in\nthe use we make of a general or singular term, typically a\nnoun or noun phrase. When we resort to metaphor, a term that routinely\nstands for one thing or kind is made to stand for another, suitably\nrelated thing or kind instead, and this change in what the term stands\nfor occurs on the fly, without warning and without special\nexplanation. The effect is to transfer the term in question\nfrom its accustomed place in our verbal classificatory scheme to some\nother unaccustomed place for special temporary expressive purposes.\nFor Aristotle, writing in the middle of the fourth century BCE, the\nfigurative redeployment of term counts as a metaphor regardless of\nprecisely how the term’s usual referent and its special\ntemporary referent are related (Poetics 21 1457b ff. See also\nRhetoric 3.2 1404b-1505b, 3.4 1406b–1407a,\n3.10–11 1410b–1413b). By the time Quintilian and Cicero\ncome along, metaphor is one of many distinct recognized figures of\nspeech, and a self-explanatory terminological transfer counts as\nmetaphorical only if it is based on a real or supposed\nanalogy or likeness between the regular referent and\nthe special temporary one. The change matters less than one might\nexpect, since although Aristotle recognized four different kinds of\nmetaphor, he regarded the analogy-based kind as the most interesting\nby far and devoted the bulk of his discussion to it.\n\nSometimes we resort to metaphor because there’s no established\nterm for the thing we want to talk about and no need to contrive a new\nterm that will refer to it once and for all. More often and more\ninterestingly, we resort to metaphor for the sake of the pleasure our\naudience will take in puzzling it out, the persona it allows us to\nadopt in addressing our audience, and the quasi-sensory vividness it\nbrings to the audience’s apprehension of whatever we say with\nits help. (See Cicero, De Oratore, 55 BCE,\n3.159–60)\n\nAristotle portrays the understanding of one kind of metaphor as a\nstimulating exercise in analogical equation solving. Suppose\nEmpedocles employs the term “old age” under circumstances\nwhere it looks for all the world as if what is really being discussed\nis the course of a single day. Old age itself lacks any\nimmediate bearing on efforts to understand the course of a single day,\nso we conjecture that on this special occasion, the term “old\nage” stands for something with the kind of immediate bearing on\nefforts to understand the course of a single day that old\nage itself has on efforts to understand some other\nsubject matter readily called to mind by invoking old\nage—namely, the course of a single human life. Just as\nold age constitutes the final stage of the course of a single life,\nwhat constitutes the final stage of the course of a single day is\nevening. Old age is to a life as evening is to a\nday. We thus infer that on this special occasion, “old\nage” is being employed to refer to evening, and we interpret the\nsentence in which it figures accordingly (Poetics 10\n1457b).\n\nIn working this out, we activate and begin to explore a complex and\npotentially fruitful analogy between the way a person’s physical\nand intellectual powers wax and wane over the course of a single human\nlife and the way the sun’s powers wax and wane over the course\nof a single day, between the way individual human lives repeat each\nother with variations in the course of an extended human lineage and\nthe way individual days do so over the course of a year, and so on.\nThe effort to recover a simple metaphorical meaning (evening) for the\nterm “old age” calls forth a beneficial, pleasurable,\ncomplex intellectual effort from us. The sentence we thereby come to\nunderstand may say something simple and unambitious that could easily\nbe said without resorting to metaphor, but the effort to recover this\nmeaning has a cognitive value transcending that of the meaning itself.\nSomething happens to the terms on which we access our own thoughts\nabout days and how they run: evening is set before our eyes in the\nsuggestive and instructive guise of an elderly human being. For\ndiscussion see Ricoeur (1997, 9–43), Lloyd (1996), Moran (1996),\nHalliwell (2003, 189–191). On ancient rhetoric and poetics more\ngenerally, see the entries\n Aristotle’s Rhetoric\n and\n Plato on Rhetoric and Poetry\n in this encyclopedia.\n\nAs modern poetics developed out of ancient rhetoric, metaphors came to\nbe seen as meaning, communicating, or at least suggesting something\ninherently complex, open-ended, and resistant to compact literal\nstatement.\n3. Paraphrase\n\nSometimes the effort to render a given original in a given medium\nrequires approximation and elaboration of various sorts, so that any\nrendering of the given original in the given medium will be correct\nonly up to a point and incorrect thereafter (such is approximation)\nand more complex or longwinded than the thing rendered (such is\nelaboration). When this is the case we often call our renderings\nparaphrases of their originals. Sometimes originals and\nparaphrases are both verbal, and the aim of the paraphrase is to\nexplain or exposit the original: think of a lawyer’s paraphrase\nof an obscure statute or a preacher’s paraphrase of a cryptic\nBible passage. Sometimes neither original nor paraphrase is verbal and\nthe aim is to adapt the original in some sense or other:\nthink of a polyphonic paraphrase by Palestrina of a snatch of medieval\nplainsong or the paraphrase of an acanthus leaf in the design of a\nCorinthian capital.\n\nThe effort to translate a literary work from one language to another,\nto render the original work in a language not its own, involves a\ncomplex mixture of exposition and adaptation. Translational rendering\nis especially likely to resort to approximation and\nelaboration—paraphrase—when confronted by metaphors and\nother figures of speech. Yet it is often said that poetry is\nwhat’s lost in translation, to the point where Coleridge\nproposed “untranslatableness in words of the same language\nwithout injury to the meaning” as “the infallible test of\na blameless style” (Biographia Literaria, chap. 22). If\nmetaphor is a form of poetry, it might seem to follow that paraphrase\nin words of the same language is impossible or uncalled for\nwhere metaphor is concerned. The American New Critic Cleanth Brooks\nargued as much in a famous essay called “The Heresy of\nParaphrase” (1947).\n\nNevertheless, there is a familiar way of registering how one takes or\nunderstands a given metaphor, naturally called paraphrase,\nsuch that dispensing with it entirely would condemn\narticulate consumers of metaphor to an unproductive silence. It is\nhard not to sympathize with Stanley Cavell when he writes in\n“Aesthetic Problems of Modern Philosophy” (1969):\n\nNow suppose I am asked what someone means who says, “Juliet is\nthe sun.” … I may say something like: Romeo means that\nJuliet is the warmth of his world; that his day begins with her; that\nonly in her nourishment can he grow. And his declaration suggests that\nthe moon, which other lovers use as an emblem of their love, is merely\nher reflected light, and dead in comparison; and so on. In a word, I\nparaphrase it. Moreover, if I could not provide an explanation of this\nform, that is a very good reason, a perfect reason, for supposing that\nI do not know what it means. Metaphors are paraphrasable.\n\n\nHe adds:\n\nThe “and so on” which ends my example of paraphrase is\nsignificant. It registers what William Empson called the\n“pregnancy” of metaphors, the burgeoning of meaning in\nthem… The over-reading of metaphors so often complained of, no\ndoubt justly, is a hazard they must run for their high interest.\n\n\nPerhaps we can agree that explications of the sort Cavell has in mind\nexist and have some legitimate role to play in the understanding and\nappreciation of metaphor—and agree to call such explications\nparaphrases—while agreeing to disagree about how they\nrelate to the language they purport to explain.\n\nThe paraphrasability of poetry in general and metaphor in particular\nis an important topic of debate in aesthetics: See Levinson (2001),\nCamp (2006), Hills (2008), Lepore (2009), Lamarque (2015), Currie and\nFrascaroli (2021).\n4. Four Traditions\n\nThe mid twentieth century saw a striking renewal of interest in\nmetaphor theory, marked by interdisciplinary collaboration of a close\nand ongoing kind. Poets and novelists, linguists and literary critics,\nanalytic philosophers and continental philosophers all got in on the\nact and followed each other’s work with remarkable care and\ncloseness. Accounts of metaphor developed in this period fall into\nfour basic types.\n4.1 Semantic Twist Accounts\n\nSemantic Twist Accounts hold that metaphor results from the\ninteraction or interanimation of words and word meanings as they are\nbrought together and act on each other in the settings provided by\nparticular utterances made on particular concrete occasions.\n\nWhen we take an uttered sentence as a metaphor, we assign it a new and\ndistinctively metaphorical meaning. The assignment of fresh\nmeaning to the sentence as a whole results from a more local\nassignment of fresh meaning to one or more of the sentence’s\nconstituent words or phrases, the ones we take metaphorically, the\nfocal words or phrases. The meanings assigned the remainder\nof the sentence, the framing words or phrases, remain\nunchanged. (Here it’s taken for granted that whatever meanings\nmay be, they obey a compositionality principle, according to\nwhich the meaning of a complex expression is a function of the\nmeanings of its elementary components and the manner in which those\ncomponents are woven together by the complex expression’s\nsyntax.)\n\nThe frame isn’t a passive bystander to changes in the\ninterpretation of the focus: it induces and controls these changes.\nWhen we attempt to take each and every part of the sentence in the\nmost literal and straightforward way possible, there proves to be\nsomething deviant, incongruous, or otherwise out of\norder—something semantically or pragmatically inappropriate,\nsomething incoherent at worst and strained at best—about how we\nmust then take the sentence as a whole. If unstrained, coherent,\ncontextually appropriate sense is to be made of the sentence as a\nwhole, something’s gotta give. What in fact does give\nis our straightforward literal understanding of the focal expressions.\nThe meanings of these expressions undergo a metaphorical\ntwist, a twist produced by the more unyieldingly literal meanings\nof the expressions that serve as the metaphor’s frame.\n\nMetaphor results from a kind of tension between the literal meanings\naccruing to the focus and the literal meanings accruing to the frame,\na tension which disappears when we alter the meanings accruing to the\nfocus just enough to make it disappear. Paraphrase is an\neffort to re-express the new metaphorically determined sentence\nmeaning in more literal or at least, less ambitiously metaphorical\nterms. Influential early semantic twist accounts were provided by I.A.\nRichards (1936), Max Black (1954), and Monroe Beardsley (1962).\n\nAn especially lucid and careful version was offered later on by the\nliterary scholar Harold Skulsky (1986, 1992). Skulsky maintains that\nwhen a speaker speaks figuratively, he switches from ordinary\nvernacular English to an improvised dialect, a metaphorese,\nthat is richer than the vernacular in the speech act potentials it\naccords certain particular sentence forms, the meanings it accords\ncertain particular words or phrases, or both. The listener must master\nthis dialect on the spot and on the fly, treating the speaker’s\ntiny specimen of correct usage as her main clue to how it differs from\nthe familiar vernacular. We have willful and challenging linguistic\ninnovation on the part of a speaker, followed by a resourceful\nstruggle to keep up on the part of a listener, “a distinctive\nkind of cooperative activity halfway between a game and a rite”\nthat requires and thereby elicits a special cognitive rapport between\nthe two parties (1992, 24).\n\nFiguration occurs only when:\n\n(a) The speaker’s utterance proves gratuitously\n“confusing” as long as we attempt to interpret it in\naccord with established vernacular rules assigning speech act\npotentials to sentence forms and meanings to words or phrases.\n\n\n(b) Speaker and listener alike are well acquainted with a shared stock\nof methods for equipping sentence forms with temporary non-vernacular\nspeech act potentials (schemes) and words and phrases with temporary\nnon-vernacular meanings (tropes). Schemes and tropes provide ways of\nbeing conventionally unconventional in our employment of language.\n\n\nMany schemes and tropes are such that the innovations they license at\na given point depend on what’s mutually understood to be the\ncase for present communicative purposes, what’s implicitly taken\nto be true or at least truistic, at the point where the\ninnovation occurs. Any such assumption is what Skulsky calls a\ntalk postulate. Something may be a talk postulate because\nit’s so widely and firmly believed as to be obvious (and\nobviously obvious), because we’re assuming it for the time being\nfor purposes of argument, or simply because it’s something we\nroutinely pretend to believe in particular conversational settings.\nThe crucial points are three:\n\n(a) Talk postulates needn’t be believed, either by people in\ngeneral or by the parties to the particular conversation at hand.\n\n\n(b) It is talk postulates, not the actual or presumed beliefs of the\nparticipants, that determine what can and can’t be intelligibly\nasserted, ordered, asked, etc. in a given conversational setting.\n\n\n(c) Talk postulates are and need to be community property, with the\nconsequence that the broader the community is in which they are to\nfunction, the harder it becomes to modify them by means of individual\nconversational moves.\n\n\nThe conventional vernacular use of a declarative form like “You\nlaughed” is to assert and thereby inform you that you just now\ndid just that—laugh. But asserting this to you or informing you\nof it is out of the question if you’ve just burst out laughing\nat a funeral; under the circumstances, your laughter can’t\nconceivably come as news to you. A scheme, call it the scheme\nof rebuke, enables me to use this sentence form in a\nconventionally unconventional manner to blame you for your\nlaughter or scold you for your laughter when (and because)\ninforming you of it is manifestly out of the question.\n\nA trope, by contrast, is a recipe for turning out new word or\nphrase meanings when none of the vernacular ones will do. Hyperbole\nand metonymy may be understood as tropes in this sense, and so can\nmetaphor:\n\nConsider what the murderers say when Macbeth asks if they’re\nkindly disposed toward their oppressor: “We are men, my\nliege” [3.1.96]. … The sentence as uttered is pointlessly\ntrue; but this time [unlike the laughing at a funeral case], what\nneeds reinterpreting isn’t the vernacular force of the sentence;\nasserting is a good move after a question. Here the culprit is\n“men,” which can’t be taken at face value. In\ncontext the vernacular meaning has to yield to another one related to\nit in some familiar way, maybe by a loose kind of implication. When it\ncomes to feelings about oppressors, the relevant truism or folklore\nassumption about being men is that they’re the kind of creatures\nthat keep track both of injuries and chances to get even.\n“Men” here means creatures like that. (1992, 9–10)\n\n\nHere being G is an implication of being F in a\nparticular conversational setting just in case it readily follows from\ntalk postulates conspicuously active there that whatever is F\nis also G. In the Macbeth case, whatever is a man is such\nthat he keeps track of injuries and is ready to avenge himself on\nthose who injure him whenever he can. The recipe for metaphor, then,\nmight read something like this:\n\nIf being F is what it would take for the term T to\napply in some conversationally salient vernacular sense, and being\nG is an implication of being F given the talk\npostulates active in the current conversational setting, then being\nG will be what it takes for T to apply in one\navailable temporary, non-vernacular, metaphorese sense. Whether\nT actually takes on this sense depends on how T is\nbest disambiguated in metaphorese given the current\nconversational setting.\n\n4.2 Pragmatic Twist Accounts\n\nPragmatic Twist Accounts maintain that when we resort to\nmetaphor, we use words and phrases with their standard literal\nmeanings to say one thing, put one thing into words, yet we\nare taken to mean, taken to assert or acknowledge or\notherwise indicate, something entirely different. Our sentence as used\nby us means one thing, we in using it mean or are properly construed\nas meaning something entirely different. Metaphor is a genre of\ndeliberate and overt suggestion, one by means of which speakers\ncommit themselves to, implicitly vouch for the truth\nof, the things they suggest. Paraphrase is an effort to get at\nwhat is metaphorically suggested by putting it (or some part of it, or\nsome approximation to it) directly into words, thereby explicitly\nsaying (more or less fully and more or less accurately) what was\nimplicitly vouched for by the original metaphorical utterance.\n\nThe thought that metaphor concerns what speakers mean as\nopposed to what their words mean is old and widespread. Often\nit comes with the further thought that metaphor reveals by\nconcealing—revealing things in the end by concealing them at the\noutset.\n\nThe poet says B but he means A. He hides A\nin B. B is the normal everyday meaning that the\nwords so to speak “ought” to have on the face of them, and\nA is what the poet really has to say to us, and which he can\nonly say through or alongside, or by modifying, these normal everyday\nmeanings. A is his own new, original, or poetic meaning.\n(Barfield, 1962)\n\n\nThe first concerted attempt to build a philosophical account of\nmetaphor around these familiar ideas was Grice’s account of\nconversational implicature in the second of his 1967 William James\nLectures, which appeared with various supplementations and\nafterthoughts as Grice (1989).\n\nThe following exposition lightly modernizes Grice’s own at\ncertain points. For fuller discussions of Grice’s work as a\nwhole see the entries concerning\n Paul Grice,\n implicature, and\n pragmatics.\n Detailed elaborations of Grice’s account of metaphor were\noffered by Searle (1979a) and Martinich (1984).\n\nA conversation is a loosely collaborative exchange of\ninformation having one or more mutually understood aims. Participants\npresume they share certain pertinent information already, but each is\npresumed to need further information the others might be in a position\nto provide. In conversations we can and regularly do hold the other\nparticipants responsible for the truth of both more and less—in\nsome ways more, in other ways less—than they explicitly put into\nwords. For once a conversation is under way, each of us is entitled to\ninterpret the words of the others in light of the supposition that\nthey are cooperative, rational, and unconfused about the current state\nof conversational play, even if there is good reason to doubt or\ndisbelieve this supposition, e.g. even if they exhibit troubling\nsigns of recklessness or deceitfulness. This is an application to\nspeech of a much more general principle: in improvised voluntary\ncollaborations of any sort, the responsibilities a given party\nshoulders are those he willingly lets himself seem ready to shoulder,\nno more and no less.\n\nSo my words may imply something I don’t: if something my words\nimply is manifestly so firmly accepted already as to need no\ncertification from me, or so firmly rejected or patently unknowable by\nme as to be unable to benefit from any certification I might attempt,\nit forms no part of what I commit myself to in speaking my words. On\nthe other hand, I may imply something my words don’t: I can\nand do vouch for the truth of a thing that isn’t implied by the\nwords I speak when my audience can square my utterance of those words\nwith the supposition that I am cooperative, rational, and unconfused\nabout the state of conversational play only by assuming that I am in a\nposition to vouch for that thing’s truth (in that I believe it\nand have good grounds for believing it) and am prepared to actually do\nso. Such, nearly enough, was how Grice defined the special kind\nof speaker meaning he dubbed conversational implicature.\n\nThis tells us what implicature is but not how it happens. For that we\nneed four more ideas. (1) Declarative sentences are standing equipment\nfor calling attention to the propositions they express: the\nproposition an uttered sentence calls to mind most immediately,\nreliably, and deliberately is the one it semantically expresses. (2)\nOnce a conversation is under way I can vouch for the truth of any\nproposition whatsoever by calling attention to it with a sufficient\nshow of deliberateness, if I am plausibly in a position to\nvouch for its truth and if no other plausible motive for\ncalling attention to it can be expected to come to mind. (3) Suppose I\ncall attention to a thing of any sort with a sufficient show\nof deliberateness. If the thing strikes my audience as a fully\nappropriate object of attention in its own right, their attention will\ndwell on it and go no further; they’ll treat my drawing their\nattention to it as an end in itself, as it were. But if the thing\ndoesn’t strike them as an appropriate resting place for\ntheir attention, they’ll view my drawing their attention to it\nas a means to some further attentional end, an effort to refer\nattention onward to some further, ultimately more worthy object. (4)\nWhat a cooperative, rational, unconfused speaker is out to vouch\nfor as true in speaking as she does includes both what she is\nout to get across, the part expected to address her\nlistener’s presumed informational needs, and a rudimentary\nrationale for speaking as she does, serving to reconcile the\nwords she produces with the supposition that she is cooperative,\nrational, and unconfused. For without a reputation for being\ncooperative, rational, and unconfused, a speaker simply won’t be\nable to collaborate effectively with her audience. Of course, parts of\nwhat she is out to vouch for may do double duty, meeting the\nlistener’s informational needs while at the same time helping to\npreserve or cultivate her own reputation.\n\nSo: if she is cooperative, rational, and unconfused, a speaker does\nher best to endow her contribution—the content she is\nout to vouch for, the part of that content she is out to get across,\nand the verbal form she employs for these purposes—with certain\nfeatures that are manifestly desirable from her listener’s point\nof view. She does her best to comply with certain familiar\nconversational maxims:\n\nQuality: Be truthful: vouch only for what you believe and is\nwell supported by your evidence.\n\n\nQuantity: Make what you are out to get across informative\nbut not overinformative, appropriate in scope and shape to what a\nlistener can readily absorb in a single conversational turn.\n\n\nRelation: Make what you are out to get across\nrelevant to the listener’s presumed informational\nneeds.\n\n\nManner: Manage the relation between what you are out to get\nacross and the words by means of which you endeavor to get it across\nso as to render your utterance clear, unambiguous, efficient,\nand orderly. (26–7)\n\n\n(The maxims concern characteristics that are matters of degree, so the\nbest way to read them is a matter of some controversy. On the\ninterpretation adopted here, I obey Relation if and only if what I am\nout to get across is both (a) adequately relevant and (b) about as\nrelevant as I can readily make it without sacrificing anything of\ncomparable importance. Similarly for the other maxims. On this\ninterpretation, Gricean maxims don’t call on us to maximize\nanything.)\n\nListeners know that cooperative, rational, unconfused speakers do\ntheir best to comply with the maxims. So speakers can arrange\nfor a difference between what they express and what they are properly\ntaken to vouch for by speaking so as to put their reputation for\ncooperativeness, rationality, and unconfusedness in a kind of\ncontrolled short-term jeopardy from which their listeners can readily\nrescue them.\n\nSuppose speaker S expresses proposition P in words\nW. And suppose circumstances are such that if we\nwere to understand S as out to vouch for the truth of\nP and P alone, no more and no less, in uttering\nW, we would thereby portray S as avoidably violating\nmaxim M or at least, avoidably inviting the suspicion that\nshe is avoidably violating it, with the consequence that either her\ncontribution is gratuitously unresponsive to her audience’s\ninformational needs or she is gratuitously neglecting to maintain her\nreputation as cooperative, rational, and unconfused. In either case,\nshe wouldn’t be behaving as a cooperative, rational,\nunconfused speaker must. To clear her her of this charge, to\nsquare our interpretation of her words with the governing supposition\nthat she is behaving as a cooperative, rational, unconfused\nspeaker must, we need to find something more or\nsomething else she might be out to vouch for.\n\nFour basic scenarios are possible here.\n\n(1) Sometimes P and P alone is what S is\nout to get across, despite the fact that getting P and\nP alone across by means of W manifestly violates\nsome particular maxim. In that case S may be designedly\ncalling attention to, hence trying to vouch for the truth of, some\nplausible account of why her informational and expressive resources\nleave her in a position where some such violation couldn’t be\nhelped—confront her with a clash of maxims.\n\nA: Where does C live?\n\nB: Somewhere in the South of France.\n\n[B implicitly signals that he can’t be adequately informative\nand truthful at the same time, hence implicates that he doesn’t\nknow which town C lives in.] (32)\n\n\n(2) Sometimes getting P and P alone across by means\nof W would manifestly violate some maxim or other if\nS were in a position to vouch for any of various manifestly more\ndesirable propositions by expressing one of them via any of various\nmanifestly available sequences of words. In that case S may\nbe designedly calling attention to, hence trying to vouch for the\ntruth of, some plausible account of why she couldn’t do\nthis—why her respect for the maxims actually puts each of these\nmore desirable-looking contributions off limits.\n\nA: Some students passed. [A implicitly signals that he isn’t in\na position to offer the more informative, equally compact All\nstudents passed, hence implicates that (for all he knows) some\nstudents didn’t pass.]\n\n\n(3) Sometimes the expression of P by means of W\nwould manifestly violate some particular maxim if P and P\nalone were what S was out to get across, but the natural\ninference is that what she was out to get across was P and then\nsome: the expression of P by means of W readily\ncalls to mind some unique more inclusive story Q about the\nworld of which P forms an essential part, such that\nS might plausibly be in a position to vouch for\nQ’s truth and such that doing so by means of\nW, if it could be managed, might plausibly comply\nwith all the maxims. In that case S may be designedly calling\nattention to, hence trying to vouch for the truth of, the whole of\nQ.\n\nA: I am out of petrol.\n\nB: There’s a garage around the corner.\n\n[B implicates that the garage in question may be open and\nmay have gas to sell, hence may be an efficient way\nto satisfy A’s declared need, since only against this background\ncould the expressed fact that the garage is around the corner be\nexpected to be relevant to A’s informational needs.] (32)\n\n\n(4) Last but not least, sometimes the expression of P by\nmeans of W would manifestly violate some particular maxim if\nP formed any essential part of what S was\nout to get across, and the natural inference is that what she was out\nto get across is something entirely different: the expression\nof P by means of W readily calls to mind some unique\nalternative message Q about the world of which P\nforms no part whatsoever, such that S might plausibly be in a\nposition to vouch for Q’s truth and such that doing so\nby means of W, if it could be managed, might\nplausibly comply with all the maxims. (Such is the residual force of\nthe idea that verbal expressions of P are equipment for\nasserting P that S will still be viewed as vouching\nfor the truth of P as well unless doing so is manifestly out\nof the question in the circumstances at hand, as it often will be.\nWhat she won’t be vouching for is P’s\nvalue or interest in the light of her\nlistener’s presumed informational needs.)\n\nWhen such a Q readily comes to mind, S may be\ndesignedly calling attention to, hence trying to vouch for the truth\nof, Q. In such a case, S is enabled to fulfill a\nconversational maxim (by meaning something other than what she\nactually expresses) precisely by speaking in such a way that she would\nflout the maxim, blatantly violate it, if she were to mean what she\nsays. Grice speaks in such cases of exploiting the maxim in\nquestion. To exploit a maxim is to fulfill it “at the level\nof” what one means by manifestly and avoidably violating\nit—flouting it—“at the level of” what one\nexpresses.\n\nThere are two main ways to play out this scenario.\n\nOn the first, Q admits of intelligible and compact expression\nbut is something the speaker is understandably reluctant to assert\noutright. The notorious letter of recommendation example is of this\nkind.\n\nA: Dear Sir, Mr. X’s command of English is excellent, and his\nattendance at tutorials has been regular.\n\n“[A] cannot be unable, through ignorance, to say more, since the\nman is his pupil; moreover, he knows more information than this is\nwanted [and information of a different kind: A would be in violation\nof Quantity if what he said formed any part of what he\nmeant]. He must, therefore, be wishing to impart information he is\nreluctant to write down. This supposition is only tenable if he thinks\nMr. X is no good at philosophy. This, then, is what he is\nimplicating.” (33)\n\n\nOn the second, Q is so extensive or so resistant to\nintelligible compact expression for other reasons that the benefits to\nspeaker and listener alike of a terse and simple utterance outweigh\nthe inferential costs to the listener involved in extracting a large\nmessage from a small package. This is often the case with allusions,\nfor instance. Where outright explicit assertion can’t be managed\nor can be managed only with excessive effort on both sides, suggestion\nhas to suffice and will violate no general conversational norms.\n\nGrice proposes that metaphor exemplifies this second way of playing\nout  the flouting scenario. Suppose I say to you,\n“you’re the cream in my coffee.” No human being\nliterally is or literally could be a dollop of viscous potable dairy\nproduct I could literally stir into a piping hot breakfast beverage.\nThis is a commonplace acceptance of which on your part isn’t\nabout to be shaken by any words from me. So for you to take me as out\nto get that across, alone or in combination with other\nthings, would be for you to take me to be “blatantly and\ninexplicably” violating Quantity (and/or Relation); you’d\nbe portraying me as being utterly, obviously, and to all appearances\npointlessly untruthful, uninformative, and irrelevant. But in\ncircumstances such as these, the proposition that you’re the\ncream in my coffee reliably calls to mind a certain particular other\nproposition, “attributing to [you] some feature or features in\nrespect of which [you] resemble (more or less fancifully) the\nmentioned substance.” Perhaps it’s the proposition that\nyou’re such a comforting luxury (for me) that you’ve\nbecome a necessity (for me) for most intents and purposes—a\nproposition whose explicit expression is regrettably clumsy and\nlongwinded and ungenerous. (In fact the 1924 DeSylva, Brown, and\nHenderson lyric Grice is quoting from continues as follows:\n“You’re the cream in my coffee, / You’re the salt in\nmy stew, / You will always be / My necessity, / I’d be lost\nwithout you…”) The only obvious reason I could have for\ncalling your attention to this proposition in these circumstances is\nin order to get it across and hence, vouch for its truth. So I do\nvouch for its truth.\n\nBy speaking of “more or less fanciful resemblance,” Grice\nreinstated the ancient idea that metaphor is a special figure based in\nsome special way upon likeness or analogy. Subsequent advocates of an\nimplicature approach to metaphor were sometimes skeptical about this\nfeature of the account. Searle, for instance, found it hard to see any\nreal resemblance between literally cold things and metaphorically cold\npeople. After starting a long list of possible relations between what\na metaphorical speaker says about an object and what she should be\ntaken to mean, he despairs of completing it:\n\nThe question, “How do metaphors work?” is a bit like the\nquestion, “How does one thing remind us of another thing?”\nThere is no single answer to either question… (Searle,\nIntroduction to Expression and Meaning, 1979, x)\n\n\nThis registers an important general fact about pragmatic explanations\nin the Gricean style. Conversational implicatures can come off only if\nsomething in particular reliably comes to mind once there is an\nappearance of a maxim violation to explain or explain away. Often\nenough, something in particular does reliably come to mind,\nbut Gricean conversational principles in and of themselves do nothing\nto explain what comes to mind or why it does so.\n\nOne and the same metaphor can often be plausibly paraphrased in\nsubstantively different ways. Yet Grice’s account appears to\ndepend on there being some unique alternative message that\nreliably comes to mind when the speaker’s words are pondered. It\nhas struck some commentators that metaphorical interpretation involves\na kind of indeterminacy Gricean implicature theory can’t readily\naccommodate. See Davis (1998), 70–74 and the response by Saul\n(2001) for the main arguments on both sides.\n\nThere is also the phenomenon of twice-apt metaphor (Hills,\n1997, 2008). Consider Romeo’s death speech:\n\nRomeo: Here’s to my love! [He drinks] O true apothecary!\n\nThy drugs are quick. Thus with a kiss I die.—5.3.119–120\n\n\nWho’s the true apothecary? The impoverished pharmacist who sold\nRomeo the poison, or death itself? Both, surely. From time to time we\nare induced to construe one and the same utterance both\nliterally and metaphorically. In such cases an utterance is\nalready apt, already in complete accord with\npertinent conversational norms, when regarded as an effort to mean\nwhat one says, no more and no less. Yet a metaphoric reconstrual of\nthe utterance comes to mind anyway, without the spur of any\nthreatened impropriety in the initial literal construal on which it is\nbased, and listeners view the speaker as vouching for the truth of\nboth construals at once.\n\nDeterminacy worries help motivate one influential and sweeping\nreworking of Gricean pragmatics, the relevance theory of\nSperber and Wilson (1995). In an early and somewhat simplified\nformulation (Sperber and Wilson 1985), relevance theory takes metaphor\nto be an especially dramatic form of loose talk and takes talk in\ngeneral to be at least somewhat loose most of the time. What is meant\ntypically departs from what is said, to the point where all a speaker\never commits herself to in expressing a proposition is a\nnoteworthy interpretive resemblance between this proposition\nand the one whose truth she is out to vouch for. (Two propositions\nbear an interpretive resemblance to one another in a given setting to\nthe extent that they have similar consequences, given whatever is\nmutually taken for granted in that setting.) And speakers can\nanticipate what competent listeners will take them to mean only up to\na point. What they can most firmly anticipate being taken to mean is\nstrongly implied by their utterance, what they may or may not\nbe taken to mean, depending on facts about the listeners they\naren’t in a position to know, is only weakly implied.\nThe result is that what’s meant by an utterance, what the\nspeaker vouches for in speaking as she does, isn’t sharply\ndelimited but trails off, in much the way that good paraphrases\ntypically trail off.\n\nWhen a listener L provisionally decides that utterance\nU is worth processing, he goes into the deductive inference\nbusiness in the following highly specific manner:\n\n(a) L starts with U alone as his premise set\nP, but he gradually adds auxiliary\nassumptions to P, starting with what’s\nmost salient (in the present context) and most firmly taken for\ngranted (for present conversational purposes), but proceeding\neventually to add assumptions that are progressively less and less\nsalient, less and less firmly taken for granted.\n\n\n(b) L proceeds to derive consequences from his slowly\nexpanding premise set P, starting with the\nmost immediate and easily derived ones, but proceeding eventually to\nderive others that are more and more remote, more and more difficult\nto derive.\n\n\n(c) As he does so, L retains any derived consequences he\njudges to be sufficiently novel, sufficiently credible, and\nsufficiently worthy of his attention, given an understanding of his\nneeds and interests and responsibilities as a consumer of information\nthat’s presumptively shared by himself and the speaker,\naccumulating these consequences in a set C.\n\n\n(d) L continues until he finally harvests a set of\nconsequences C he regards as adequately\ncompensating him for the effort it took to obtain it—or he\ndespairs of reaching such a point and casts about for some other\nstimulus to process instead.\n\n\nIn the former case, where L does eventually feel adequately\ncompensated for his processing of U, he stops processing\nU at this break-even point and takes U to properly\nconvey the consequence set C. In the latter\ncase, L doesn’t treat U as properly conveying\nanything at all.\n\nIn general C will be in some ways stronger,\nin other ways weaker, than U itself. In some ways stronger,\nsince auxiliary hypotheses have got in on the act. In other ways\nweaker, since various parts of U’s own content that\nhave been judged to be old news, obviously false, or simply not worth\nattending to have fallen by the wayside.\n\nSuppose this is how listeners always process utterances. Then\nto the considerable extent that speakers can anticipate the course of\nsuch processing (what will get added to the premise set, what\nconsequences will get drawn, what will get discarded along the way,\nwhere the break-even point will be reached), speakers can anticipate\nwhat listeners will make of their words. Yet they can’t\nanticipate the course or extent of listeners’ processing in\ncomplete detail, with the result that their responsibility for what a\nlistener makes of their words, the degree to which they can be said to\nhave vouched in advance for the results of the listener’s\nprocessing, trails off as this processing continues. Sperber and\nWilson contend that this processing model accounts for standard\nGricean implicatures, metaphors included, without requiring\nthe listener to reconstruct the speaker’s precise rationale for\nspeaking as she did and without a rich and contentious set of\nconversational norms.\n\nBut why should we believe that this is how listeners always\nprocess inferences?\n\nFirst, it is a general principle of human cognition (and one whose\ntruth we all implicitly recognize) that our attention always goes to\nwhatever stimulus in our environment (if any) looks to be most worth\nprocessing then and there, whatever looks then and there to be\n“optimally relevant” (if anything does). A stimulus counts\nas just plain relevant if it’s worth processing at all, and how\nrelevant or worth processing a stimulus actually is depends jointly on\ntwo things about it:\n\n(a) how much novel and pertinent information one could extract by\nprocessing the stimulus, and\n\n\n(b) how little processing effort it would cost us to extract this\ninformation.\n\n\nThe processing of any stimulus takes the form of extracting more and\nmore remote consequences from the conjunction of it with less and less\nantecedently salient, less and less antecedently taken-for-granted,\nauxiliary assumptions. Such is the Cognitive Principle of\nRelevance.\n\nSecond, in claiming the attention of a listener at all, a speaker\nimplicitly assures him that the stimulus she’s offering him is\nrelevant and indeed optimally relevant—the most relevant\nstimulus within reach. (In view of the Cognitive Principle, he\nwouldn’t process her utterance unless he took it to be the most\nrelevant stimulus within reach, so to induce him to process it, she\nmust get him to take it to be the most relevant stimulus within\nreach.) Such is the Communicative Principle of Relevance.\n\nFrom these principles, Sperber and Wilson deduce two key\ncorollaries:\n\n(I) When I provisionally deem a stimulus optimally relevant, I\nundertake to keep processing it until one of two things happens: (a) I\nreap a consequence set that strikes me as worth the effort I’ve\nso far invested, or (b) I change my mind about whether the stimulus is\nindeed optimally relevant. Whether it would seem worth my while to\nprocess this stimulus any further once I reached the break-even point\nwould depend on further information available to me if and when I\nactually reach that point.\n\n\n(II) In claiming the attention of a listener for her utterance, and\nthus implicitly vouching for its optimal relevance, the speaker is\nimplicitly vouching for the truth of all the propositions she can\nexpect the listener to collect into his consequence set by processing\nthat utterance to the extent implicitly encouraged by deeming the\nutterance optimally relevant.\n\n\nIf we grant both (I) and (II), then we have at once a story about why\nlisteners process utterances as relevance theory claims and a story\nabout why speakers implicitly vouch for the results of such\nprocessing, insofar as these results are foreseeable. In claiming the\nattention of L for my utterance U, I’m\nimplicitly vouching for the truth of whatever I can expect L\nto come up with if he processes U the way he’d process\nany promising stimulus and continues to do so until it yields a result\nthat adequately repays his investment of effort to date. But this is\nall I implicitly vouch for in speaking as I do. After that, the\nlistener is on his own.\n\nThe trickiest part of this is the argument for (II). Suppose some\nsignificant part of the consequence set C\nthat L can be expected to extract from U is either\n(undetectably) false or (undetectably) undeserving of\nL’s attention. This would detract in a very substantial\nway from the relevance of U: falsity of the part detracts\nvery substantially from overall truth, and lack of pertinence in the\npart detracts very substantially from overall pertinence. So\nsubstantially, in fact, that S will almost always have\navailable to her some other utterance U* the\nprocessing of which would have yielded L more in the way of\noverall pertinent truth than U does—even if we make\nallowances for motives S may have to conceal part of what she\nknows from L. If this is the case, then U will\nscarcely be optimally relevant, the most relevant stimulus\nwithin reach, since U* is more relevant\nand it’s definitely within reach as well.\n\nIt’s possible to suspect that this argument equivocates in its\nfinal stages. Until then, “U is optimally\nrelevant” appears to mean:\n\nU is the most relevant to L of the various\nactual stimuli it is in L’s power to\nattend to here and now, given L’s presumed\ninformational needs.\n\n\nThis is what S implicitly claims in inviting L to\nattend to her utterance. Yet in those final stages, “U\nis optimally relevant” needs to mean instead:\n\nU is the most relevant to L among the various\npossible stimuli it’s in S’s power to\noffer L here and now, given S’s information\nand L’s presumed informational needs.\n\n\nSo far I’ve been presenting the implicature-based view of\nmetaphor Sperber and Wilson expounded in the first (1986) edition of\nRelevance, a view on which metaphor involves literally saying or\nexpressing one thing while figuratively communicating something else.\nThereafter Sperber and Wilson moved to a “direct\nexpression” view of metaphor and loose talk more generally, on\nwhich they involve pragmatically induced changes in what is said,\nresulting from pragmatically induced adjustments in the properties and\nrelations the certain particular focal expressions contribute to the\ntruth conditions of an uttered sentence. In Bezuidenhout (2001),\nWilson and Sperber (2002), and Sperber and  Wilson (2008),\nmetaphor ceases to be a matter of conversational implicature and\nbecomes a matter of conversational explicature instead. This blurs the\npreviously sharp line between semantic twist and pragmatic twist\napproaches to metaphor and commits relevance theory to a form of\ntruth-conditional pragmatics. An especially full defense and\ndevelopment of this new approach comes in Robyn Carston’s\n(2002).\n\nRelevance theoretic accounts of metaphor and other forms of figurative\nlanguage remain under active development. Billy Clark (2013) provides\na comprehensive overview; Scott, Clark, and Carston (2019) collects\nrecent applications.\n4.3 Comparativist Accounts\n\nAncient Greek poetry was rich in extended explicit\ncomparisons—similes—of the sort we now call epic\nor Homeric. At Iliad 20.164–73, Aeneas is\nbearing down on Achilles when the roles of attacker and attacked are\nabruptly reversed; this is a literal rendering from (Stott, 2006):\n\n… He rushed against him like a rapacious lion\n\nthat men are eager to kill, the whole town,\n\nonce they have gathered. He ignores them\n\ngoing his own way, but when one of the young men, swift in battle,\n\nstrikes him with a spear, then he crouches down with open mouth,\n\nfoam appears around his teeth, and his brave spirit groans in his\nheart,\n\nand he lashes his ribs and flanks with his tail\n\non both sides, urging himself to fight.\n\nWith glowing eyes he charges forcefully forward\n\nto see if he will kill one of the men or himself be slain in the\ncrowd.\n\n\nAncient rhetoricians would maintain that Homer’s simile and a\nmetaphor employing the epithet “the lion” so as to\nmanifestly refer to the man Achilles are alike in that they make or\npresent one and the same comparison, each in its own way: both bits of\nlanguage compare Achilles to a lion. Aristotle goes\non to contend that “similes are metaphors needing an explanatory\nword” (Poetics 1407a)—as if the difference\nbetween the “The lion [Achilles] rushed” (metaphor) and\n“He [Achilles] rushed as a lion” (simile) came down to the\npresence in the latter of a stage direction indicating that Achilles\nwent on the attack in the guise of a lion. A simile is thus a\nlengthened metaphor. Quintilian turns things round, speaking of\nmetaphors as shortened similes:\n\nIn general terms, Metaphor is a shortened form of Simile; the\ndifference is that in Simile something is [overtly] compared with the\nthing we wish to describe, while in metaphor one thing is substituted\nfor the other.—Institutio Oratoria, ca. 95 AD, 8.6,\n8–9.\n\n\nLike his fellow ancients, Quintilian conceived metaphor as an affair\nof terms rather than as an affair of sentences. A metaphorical\nemployment of the term “lion” to refer to the man Achilles\ndoesn’t say that Achilles is like a lion, since it\ndoesn’t say anything at all. Namings aren’t\nsayings; they merely pave the way for sayings. What Quintilian meant,\nthen, is that a simile states the real or alleged similarity\n(of Achilles to lions) which the corresponding metaphorical\nsubstitution leaves to a listener’s imagination.\n\nOnce we come to view the sentence as the fundamental unit of\nmetaphorical action, Quintilian’s remark suggests something to\nus that it couldn’t suggest to Quintilian himself: what a simple\nsentence metaphor (Juliet is the sun, History is a\nnightmare) really says is that Juliet is like the\nsun, history like a nightmare—where the extent and\nnature of the alleged likeness are things listeners must infer from\nthe concrete conversational setting in which the metaphor is employed.\nIt suggests that a sentence metaphor is an elliptical simile, a\nfigurative comparison whose key comparative construction is understood\nto be present but remains unpronounced. Some such comparativist\naccount of metaphor has been proposed from time to time by modern\ncritics (Nowottny, 1962) and by modern linguists (Ortony, 1979).\n\nAn especially detailed version was developed by Robert Fogelin (1998)\nfrom suggestions by Amos Tversky (1977).\n\nFor Fogelin, to speak figuratively is to speak so as to\nstand corrected, to speak so as to manifestly invite and reliably\nelicit some particular spontaneous correction from one’s\naudience. This is easiest to see and easiest to understand when it\ncomes to figurative predications, e.g. instances of irony or\nunderstatement. In such cases correcting the speaker consists\nin correcting what she said by understanding her to have said\none thing while meaning another. Listeners take the speaker’s\nactual words and edit them in the privacy of their own heads, thereby\nbringing her utterance into accord with the context in which she spoke\nthem as called for by Gricean conversational principles. When a\nspeaker indulges in understatement, correction of what she says\ninvolves strengthening it; when she indulges in irony, our correction\ninvolves reversing it (in some sense or other, the nature of the\nreversal varying from case to case), and so forth. Often the value and\ninterest of a thought is enhanced by the listener’s coming up\nwith it for himself and deciding for himself that it is appropriate to\nthe circumstances in which he finds himself. Figurative predication is\none way to impose these tasks on a listener; that’s one of our\nmain reasons for resorting to it.\n\nWhether it is to be taken literally or figuratively, an\nunqualified simple comparison\n\n(an) A is like (a) B\n\n\nis to be understood as saying that (an) A has enough of the\nfeatures of (a) B that are salient in the present context. Or\nif you prefer, (an) A is similar enough to (a) B in\nrespects that concern aspects of (a) B that\nare salient in the present context. What counts as enough in\nthe way of shared salient B-features or enough in\nthe way of similarity to B in salient B-respects\ndepends in turn on the contextually salient interests or concerns that\nare understood to motivate the making of the comparison in the first\nplace. So whether they are to be taken literally or figuratively,\nunqualified simple comparisons have highly context-sensitive truth\nconditions.\n\nFogelin follows Tversky in supposing that when we compare (an)\nA to (a) B, it is the currently salient features or\naspects of the second thing or kind of thing that call the\ntune. This represents a break with how likeness or resemblance or\nsimilarity has usually been construed in the philosophical\nliterature—viz., as a symmetric relation, with the\nresult that (an) A is like (a) B just in case, or\njust to the extent that, (a) B is like (an) A. On\nthe understanding of likeness talk being offered here, this\nwon’t be true at least in general. And Fogelin seems right about\nthis:\n\nTo start with a personal experience, I was once struck by the present\nPope’s likeness (in a photograph) to Arnold Palmer. [The Pope at\nthe time was John Paul II.] It was not difficult to identify the\nsource of the likeness: the Pope has Arnold Palmer’s eyes. At\nthe same time, I felt no compulsion to say that Arnold Palmer looked\nlike the Pope. Why not? The answer, I think, is that Arnold\nPalmer’s eyes—that crinkled down-the-fairway\nsquint—are one of the distinctive features of his face: it would\nappear, for instance, in caricatures drawn of him. On the other hand,\nArnold Palmer’s eyes are not distinctive features of the\nPope’s face. Put very crudely, it seemed to me that the Pope\nresembled Arnold Palmer, but not conversely, because the Pope\npossessed one of Arnold Palmer’s distinctive features whereas\nArnold Palmer did not possess a distinctive feature of the Pope. (43)\n\n\nComparisons have conversationally adjustable contents, resulting from\nthe attribution of conversationally adjustable contents to comparative\nconstructions such as is like. To assign a comparative\nstatement a particular truth-value, one must bring to bear a\nconversationally adjustable canon of similarity, telling us\nhow much like (a) B and in what respects a thing A\nneeds to be in order for A to count as unqualifiedly like (a)\nB for present conversational purposes. For instance, in\nordinary contexts governed by a routine default canon of\nsimilarity,\n\n(1) A road grader is like a bulldozer\n\n\ncomes out true, since “like bulldozers, road graders are also\nused to push around large quantities of dirt, the chief difference\nbeing that road graders have their blades beneath the chassis rather\nthan in front of them.” (88)\n\nWe’re now in a position to draw a distinction between literal\ncomparisons and figurative comparisons, similes, that accords with the\nidea that to speak figuratively is to speak so as to stand corrected.\nFigurative comparisons invite a different kind of correction than\nfigurative predications do.\n\nTo take a comparison literally is to assess it in the light\nof a canon of similarity already in play when the comparison is\nuttered, a generally prevailing or already\nprevailing canon of similarity. This is how we always take a\ncomparison on first encountering it. And when the content we thereby\nassign it is fully in accord with Gricean conversational principles,\nthis is the only way we ever do take it, the way we presume we were\nintended to take it all along. Such is how we take (1), for\nexample.\n\nBut sometimes taking a comparison literally yields a content that is\nmanifestly false, manifestly uninformative, or otherwise at odds with\nconversational principles. Such is the case with\n\n(2) Margaret Thatcher is like a bulldozer.\n\n\n“Margaret Thatcher cannot, for example, move huge quantities of\ndirt in an efficient manner” (87). Nor is she routinely prepared\nto get dirty in any literal sense. Listeners can be counted on to know\nas much and notice as much. So confronted with (2), they cast about\nfor a possible adjustment to the previously prevailing canon of\nsimilarity that brings the content of (2) into line with\nconversational principles and is manifestly smaller, manifestly more\nnatural, manifestly easier to make, than any other adjustment that\nwould do the trick. This adjustment relaxes the standards of\nhow like a bulldozer a thing needs to be in order to be\njust plain like a bulldozer, like a bulldozer without\nqualification. And it bestows fresh salience on relatively\nabstract features of bulldozers, features a powerful person might\ncredibly share: an ability to take on large tasks, an ability to wear\ndown large obstacles a little at a time, a certain gracelessness in\nmoment-to-moment operation, etc.\n\nWhen they think they’ve hit on such a possible adjustment,\nlisteners promptly implement it: they reinterpret the comparison in\naccord with the adjusted canon of similarity and take the resulting\nadjusted content to be what the speaker intended to get across all\nalong. (The whole process takes place without conscious inference;\nindeed, this is part of what makes the adjustment a natural one in\nFogelin’s eyes.) To take a comparison figuratively is simply to\nexecute this kind of adjustment in how we interpret it. A\nsimile, a figurative comparative statement, is simply a\ncomparison that manifestly requires and therefore routinely receives\nthis kind of adjusted truth-conditional interpretation. When a simile\nis figuratively true, it will ordinarily be literally false—it\nwill compare things such that the first is unlike the second\nby generally prevailing or previously prevailing standards, yet the\nfirst is like the second by new standards the simile\nitself helps to impose; this is the sense in which a simile is an\nexhibition of unity in variety, a likening of dissimilar things.\n\nThis account of how similes differ from more routine literal\ncomparisons predicts that similes exhibit the same kind of\nreversibility failure as their literal counterparts and do so for\nfundamentally the same reason. And this prediction seems to be\ncorrect. Witness this observation from the novelist William H.\nGass:\n\n[In the Song of Solomon, we read] “Thy teeth are like a flock of\nsheep that are even shorn, which come up from the washing; whereof\nevery one bears twins, and none is barren among them.” …\nMay I comfortably think of those sheep as wandering teeth? (Gass 1995,\n40)\n\n\nAs with comparisons generally, our interest in a simile usually\nisn’t an interest in the bare fact of likeness; it’s an\ninterest in the specific features of (an) A in virtue of\nwhich it’s figuratively like (a) B. So: ordinarily a\nlistener is expected to infer for himself or notice for himself what\nit is about (an) A that’s supposed to make it count as\nlike (a) B by these newly prevailing, adjusted standards:\n\nwhat it is about A that in fact makes it enough like (a)\nB by these standards (in the case of figurative truth);\n\n\nwhat it is about A that we are supposed to think makes it\nenough like (a) B by these standards (in the case of\nfigurative falsity).\n\n\nTo do this is to paraphrase the simile in question. In the\ncase of (2), we might come up with something along the lines of\n\n(3) Thatcher is a gross, powerful person who overcomes all obstacles\nin getting the job done. (Tversky, 1977, 351)\n\n\nOn being told by Gertrude Stein that his portrait of her didn’t\nlook much like her, Picasso is said to have responded,\n“Don’t worry, it will.” If we call such portraits,\nportraits that vindicate themselves in the fullness of time by\nimposing their own novel standards of vindication, Picasso\nlikenesses, we might say that on Fogelin’s account of\nthings, similes are Picasso likenings.\n\nIf we can understand\n\n(4) Margaret Thatcher is a bulldozer.\n\n\nas somehow short for (2), we’ll see how (3) is in order as a\nparaphrase of (4) as well. We’ll have a ready explanation of the\nfact that there is all the difference in the world between saying in a\nspirit of metaphor that money is blood (a stuff\nwhich invigorates by circulating and facilitating vital exchanges) and\nsaying in a spirit of metaphor that blood is money\n(in that parting with it, letting it be shed, is a powerful but\ndrastic way of obtaining precious things). As for the fact that\nmetaphors often invite more subtle and ambitious readings than the\ncorresponding similes would in their place, ellipsis itself has\npowerful effects on how words are best interpreted in context. Imagine\ntrying to find precise, conversationally natural, non-elliptical\nequivalents for such cleverly crafted ellipses as these:\n\nGarbage in, garbage out.\n\n\nFrom each according to his ability, to each according to his need.\n\n4.4 Brute Force Accounts\n\nBrute Force Accounts maintain that in metaphor, no words go\nmissing and neither words nor speakers are induced to mean anything\nout of the ordinary. Instead, an utterance that would otherwise be\nidle or pointless produces something Richard Moran calls a\n“framing effect”(Moran, 1989): listeners are induced to\nview or consider or experience the primary subject (or subjects) in a\nfresh and special light, a light afforded by juxtaposing it (or them)\nwith the secondary subject (or subjects). What makes a remark\nmetaphorical is the fact that it induces this framing\neffect—together, perhaps, with the specific syntactic strategy\nit employs for getting the job done. Paraphrase (so-called) is best\nviewed as an effort to provide a salient and representative sample of\nthe real or apparent truths about the primary subject(s) the framing\neffect induces us to notice, think about, or dwell upon. It\nmustn’t be viewed as a restatement of some metaphorically\nexpressed or metaphorically conveyed message, since there is no such\nmessage, restatable or otherwise. As Donald Davidson put it in the\nmost influential statement of such an account, “What Metaphors\nMean”:\n\nWhen we try to say what a metaphor “means,” we soon\nrealize there is no end to what we want to mention… How many\nfacts are conveyed by a photograph? None, an infinity, or one great\nunstatable fact? Bad question. A picture is not worth a thousand\nwords, or any other number. Words are the wrong currency to exchange\nfor a picture. (Davidson 1978, 46–7)\n\n\nDavidson cheerfully admits that there are things we can naturally and\nusefully refer to as metaphorical meaning and metaphorical truth. But\nthey aren’t the seeds of metaphorical understanding; they are\namong its fruits. We mislocate metaphorical meanings if we regard them\nas accruing to particular words or phrases, the words and phrases we\ntake metaphorically. And we mislocate metaphorical truth if we think\nof it as accruing to particular sentences, the ones we take to be\nmetaphors.\n\nWhen it comes to metaphorical meaning: metaphors are subject to\ninterpretation in much the same way or sense as dreams are. We may\ninterpret a dream with an eye to ascribing it a determinate cognitive\nvalue or interest, thereby coming to terms with it. Whether an\ninterpretation of a dream and the value or interest it ascribes to the\ndream in question can be made to stick depends as much on the nature\nof the interpreter and her concerns as on the nature of the dream and\nits origins. A successful dream interpretation is the successful\noutcome of a hermeneutic negotiation between an interpreter and a\ndream, or between an interpreter and a dreamer, where what counts as a\nsuccessful outcome depends on what both parties bring to the\ntransaction: “Metaphor is the dreamwork of language, and, like\nall dreamwork, its interpretation reflects as much on the interpreter\nas on the originator.” (31)\n\nWhen it comes to metaphorical truth: there can be truth (call it\nmetaphorical truth) in a sentence that is itself, considered simply as\na sentence, simply false, just as there can be truth (call it mythic\ntruth) in a story that is itself, considered simply as a story, simply\nfalse. Understood along these lines, metaphorical truth would be\nsomething like the revelatory power conferred upon a metaphorical\nsentence (or on the impulse to use such a sentence) by a successful\nmetaphorical interpretation of the sentence, a successful ascription\nto it of metaphorical meaning.\n\nDavidson’s own version of a brute-force account has two main\npositive inspiring ideas.\n\nThe first is the analogy between metaphors and jokes, an analogy he\nmay have encountered originally in work of Ted Cohen (cf. Cohen 1978).\nMetaphors and jokes are alike in being small-scale works of verbal\nart. It takes wit to make jokes and a sense of humor to get them; it\ntakes genius of a certain sort to make metaphors and taste of a\ncertain sort to get them. All four capacities just mentioned are\ncreative capacities, modes of inventiveness—inventive\nconstruction in the case of wit and genius, inventive construal in the\ncase of humor and taste. The acquisition of these capacities\nisn’t simply a matter of assimilating rules, nor is their\nexercise simply a matter of applying rules. But capacities that are in\nthis sense creative or inventive are already at work in literal\nconstrual, even if they don’t have such fancy names.\n\nWe get closer to the heart of Davidson’s analogy if we contend\nthat metaphors (taken as metaphors) have meanings only in the same way\nor sense that jokes (taken as jokes) do: both metaphors and jokes have\npoints, points which will be got by some and missed by\nothers. The point of a joke or metaphor is based on and made possible\nby appropriate assignments of literal meanings to the words and\nphrases that go to make up an utterance—based on and made\npossible by an appropriate literal construal of the\nutterance. Yet one may manage the called-for literal construal of a\njoke or metaphor yet nevertheless miss (fail to get) its point.\n\nThe point of a joke or metaphor is at once something more\nthan a second meaning or import, assigned in the course of a second\nact of construal, and something less than this. It is\nsomething more, in that producing a joke or metaphor in the first\nplace requires some kind and degree of artistic success: to produce a\njoke or metaphor at all is to bring something off. Getting (the point\nof) either kind of verbal contraption involves appreciating what the\nspeaker has brought off in producing it. And no amount of intellectual\nunderstanding of the speaker’s ends, the\nspeaker’s means, or the manner in which and extent to which the\nspeaker’s means achieved the speaker’s ends suffices for\nappreciation. Appreciation involves a capacity and readiness to\nexperience and value the finished contraption in ways called for by\nwhat its maker has brought off.\n\nThe second inspiring idea is an account of the framing effect itself,\non which it consists for the most part in a state of mind in which we\nare encouraged and enabled to make comparisons, encouraged and enabled\nto notice similarities and dissimilarities, analogies and\ndisanalogies, between primary and secondary subjects. Metaphor is\nconcerned with likenesses or analogies although it\ndoesn’t state them.\n\nSometimes a brief but powerful poetic utterance consists solely of the\njuxtaposed mentionings of two different things or sights or\nsituations, managed so as to suggest that one of the two is there to\nshed light on the other. In Buson’s haiku:\n\nA sudden chill—\n\nin our room my dead wife’s\n\ncomb, underfoot. (Stryk and Ikemoto, 1995, 50)\n\n\nthe light source, the chill, comes first. More commonly, as in\nPound’s “In a Station of the Metro,” it comes\nsecond. Critics often regard such poetic miniatures as limiting\ncases—in a nonprejudicial sense, degenerate cases—of\nmetaphor or simile. Northrop Frye (1957, 123) speaks of\n“metaphor by juxtaposition”; he’d have us regard\nPound’s semicolon as the ghost of a departed metaphor-forging\nform of the verb to be:\n\nThese faces in the crowd are petals on a wet black bough.\n\n\nJohn Hollander (1985, 278) speaks of “evaded simile”;\nhe’d have us regard the semicolon as the ghost of a departed\ncomparative construction:\n\nThese faces in the crowd are like petals on a wet black\nbough.\n\n\nDavidson’s idea is the reverse of Frye’s and\nHollander’s: he’d have us regard both the is of\nmetaphor and the is like of simile as lengthenings of\nPound’s semicolon. What it is about A that lights up or\nis brought into prominence when A is considered in the light\nof B is what A shares or at least might be regarded\nas sharing with B, specific concrete real or putative\nlikenesses between A and B. For Davidson himself,\nthe framing effect is a cognitive affair; it consists in having\none’s attention drawn to such real or putative likenesses. Not\nall advocates of a brute force account would agree with him about\nthis. (See for instance Rorty 1989, 17–18.)\n\nDavidson confronts semantic twist accounts like Skulsky’s with\nthe following thought experiment:\n\n\nYou are entertaining a visitor from Saturn by trying to teach him the\nword “floor.” You go through the familiar dodges, leading\nhim from floor to floor, pointing and stamping and repeating the\nword.…\n\nShould we call this process learning something about the world or\nlearning something about language? An odd question, since what is\nlearned is that a bit of language refers to a bit of the world. Still,\nit is easy to distinguish between the business of learning the meaning\nof a word and using the word once the meaning is learned. Comparing\nthese two activities, it is natural to say that the first concerns\nlearning something about language, while the second concerns learning\nsomething about the world…\n\nYour friend from Saturn now transports you through space to his home\nsphere, and looking back remotely on earth you say to him, nodding at\nthe earth, “floor.” Perhaps he will think this is still\npart of the lesson and assume that the word “floor”\napplies properly to the earth, at least as seen from Saturn. But what\nif you thought he already knew the meaning of “floor” and\nyou were remembering how Dante, from a similar place in the heavens,\nsaw the inhabited earth as “the small round floor that makes us\npassionate”? [Paradiso 22.151, trans. Laurence Binyon]\nYour purpose was metaphor, not drill in the use of the language. What\ndifference would it make to your friend which way he took it? With the\ntheory of metaphor under consideration, very little difference.\n(36–7)\n\n\nSemantic twist theory locates metaphor’s specialness in a\nspecial kind of on-the-fly language learning. So it is committed to\nviewing metaphorical understanding as a process in which how we are\nalready disposed to experience, think about, and otherwise respond to\nthe primary and secondary subjects informs how we freshly\nexperience, think about, and respond to words such as\n“floor.” A process in which what needs attending to,\nwhat needs active re-experiencing, is language, not the world.\nMetaphorical understanding, metaphorical language learning, would be\non all fours with respect to the prior and more drawn out business of\nlearning the literal meaning of “floor.” But metaphorical\nunderstanding isn’t like this at all. On the contrary, it is a\nprocess in which how we already experience, think about, and otherwise\nrespond to words such as “floor” informs how we\nfreshly experience, think about, and respond to the primary and\nsecondary subjects. A process in which what needs attending to,\nwhat needs active re-experiencing, is the world, not language. Brute\nforce theory gets this exactly right; semantic twist theory gets it\nexactly wrong.\n\nRoger M. White (1996) agrees with Davidson about the comparison-based\nnature of the framing effect but rejects his juxtaposition-based\naccount of how metaphors deploy their syntactic raw material. On\nWhite’s alternative brute force account, metaphor involves a\npair of recoverable parent sentences that have been intertwined or\ninterwoven to yield the sentence actually uttered; metaphor’s\ncharacteristic effect on the listener requires the tacit\nreconstruction by him of those parent sentences, followed by an active\ncomparison of the differing situations those differing sentences would\nserve to describe. Metaphor still works by inducing a framing effect\nrather than by formulating or communicating any particular\npropositional content. But it is a whole situation, not a discrete\nobject or kind of object, that metaphor enables us to view in a new\nlight; the new light is shed by the invocation of a second situation\nof comparable complexity; and the invocation is managed by an\ninterweaving of sentences rather than by a juxtaposition of terms.\nSuch an account might be called conflationism. It’s\nespecially appealing as an account of implicit metaphors such\nas Ahab’s, and White employs it to offer close readings of\nambitious literary metaphors from Shakespeare, Dostoyevsky, and\nothers.\n\nMore recently, Lepore and Stone (2010, 2015) have drawn on David\nLewis’s work on convention, signaling, and conversational\nscorekeeping to offer a Davidson-inspired account of how speakers and\naudiences collaborate in bringing off the special verbal\naccomplishment that is a metaphor.\n\nIt won’t be possible to analyze metaphor in terms of special\nspeaker meanings (in the manner of Grice) or special word meanings (in\nthe manner of Skulsky) unless the words of a metaphor are put to\nspecial nonstandard communicative use. Yet not all coordination with\nan audience by means of conventionally signaled intentions counts as\ncommunication with that audience. Say that a speaker S\ncoordinates with his audience in the joint achievement of goal\nG by means or utterance U when circumstances are\nsuch that:\n\n\n(a) S can motivate his listeners to collaborate with him in\nachieving G simply by getting them to think he intends that\nhe and they collaborate in achieving it;\n\n(b) Motivating his listeners in this manner pretty much exhausts the\ncontribution S himself needs to make to their joint\nachievement of G;\n\n(c) S can get his listeners to think he so intends simply by\nproducing something that will function under the circumstances as a\nconventional signal that he so intends, where conventional signal\nsystems are defined and explained along lines laid down in Lewis\n(1969);\n\n(d) Understandings already in place between S and his\nlisteners enable his production of U to function as just such\na conventional signal of just such an intention on his part; and\n\n(e) S in fact produces U.\n\n\nJoke-telling and metaphor-making certainly involve coordination with\nan audience so defined: coordination in a shared relishing of the\nridiculousness of some situation or attitude; coordination in a joint\nexploration of the ramifications of some pregnant comparison; or what\nhave you. But if we follow Lewis (1979), such coordination amounts to\ncommunication if and only if either\n\n\n(1) G simply consists in the addition of particular\npropositions to some public, jointly maintained conversational score\nor record; or at least,\n\n(2) all it would take to achieve G under the circumstances is\nsome such addition to some such conversational score or record.\n\n\nAnd the goals built into joke-telling and metaphor-making don’t\nmeet this condition. No collaborative adjustment in what is taken for\ngranted for present conversational purposes suffices by itself to make\nit the case that we relish the ridiculousness of a situation together,\nexplore the ramifications of a comparison together, or what have you.\nSo metaphors and jokes are instances of non-communicative verbal\ncoordination: however much communication bringing off a metaphor or\njoke may often require, bringing off a metaphor or a joke is not in\nitself a communicative accomplishment. (The point has an interesting\nconsequence for theories of\n speech acts.\n Sometimes speakers collaborate with audiences on the production of a\nperlocutionary effect without collaborating with them on the\nproduction of any enabling illocutionary effect. Such brute\nperlocutionary acts include the bringing off of metaphors and jokes.\nWhen we tell a joke or propound a metaphor, we do something\nby speaking as we do without doing anything in\nspeaking as we do.)\n\nImportant details of Davidson’s own views about metaphor are\nprovided in Davidson (1986) and (2005). For detailed critical\ncommentary see Reimer (1996, 2001, 2004), Reimer and Camp (2008), and\nCamp (2013). For much more on metaphors, jokes, and human intimacy see\nCohen (1978, 2008).\n5. Recent developments\n5.1 Metaphor and Contemporary Linguistics\n\nIn the late 1970s, linguists interested in analogical reasoning and\nreading comprehension came to believe that pragmatic twist accounts in\nthe style of Grice and Searle could be subjected to rigorous\nlaboratory tests, using techniques originally developed for the\npsycholinguistics of reading. They reasoned that if metaphorical\nconstruals of language are based on prior literal construals and get\nconstructed and assessed only when available literal construals fail\nto equip an utterance with a contextually pertinent message, we should\nexpect subtle processing delays in the comprehension of metaphors,\ndelays absent from the comprehension of comparably familiar literal\nlocutions and idioms. And we should expect available metaphorical\ninterpretations of utterances to go unnoticed when they’re\nirrelevant to the cognitive task at hand. An agenda-setting\nstudy by Ortony et al (1978) reported results broadly consistent with\nGrice and Searle. But before long further studies in the same style\n(Glucksberg, Gildea, and Booklin, 1982; Blasko and Connine, 1993)\nclaimed to have empirically refuted pragmatic twist theory. A search\nbegan for accounts on which metaphorical construals could be simple\nuniform functions of the literal consturals on which they are based,\nable to compete with literal rivals on a level playing field from the\nvery beginning of utterance processing.\n\nTwo such accounts became popular in the psycholinguistic community.\nAccording to the structure mapping approach of Dedre Gentner and her\ncolleagues, the content of a [novel] metaphor to the effect that\nlawyers are sharks consists of the true and novel part of what’s\nsuggested about lawyers by the best available analogy between them and\nsharks (Bowdle and Gentner, 2005). According to the superordinate\ncategory approach of Sam Glucksberg, the class of metaphorical sharks\nis some broader class of things—rapacious, relentless,\nravenous things—with the property that it is typified by\ntypical sharks. (Glucksberg, 2001). Sympathetic reviews of this\nexperimental tradition and the theories it has inspired appear in\nGibbs (1994) and Holyoak (2019).\n\nIt’s possible to wonder whether pragmatic twist accounts really\nhave the implications for real-time utterance processing that\npsycholinguists routinely take them to have. (Searle’s account\nof how we can in principle work out metaphorical speaker’s\nmeanings never purported to be a blow-by-blow narrative of real-time\nutterance processing. The more familiar and stereotyped a metaphorical\nconstrual gets, the more likely we may be to spot it and endorse it\nwithout considering and rejecting any literal rivals first. And\nGrice’s theory predicts there will be situations where we can\nsafely conclude that a literal construal accords with the Cooperative\nPrinciple only after we consider and reject various of its figurative\nrivals.) It’s possible to wonder whether structure mapping and\nsuperordinate category accounts can handle recalcitrant timing data\nany better than the Gricean competition. More recent studies suggest\nthat literal construals may have an especially urgent and timely claim\non our attention after all, see esp. Giora (2003).\n\nIn the 1980s a distinctive style of theorizing about language,\nthought, and meaning took shape in the work of Charles Fillmore,\nEleanor Rosch, George Lakoff, Ronald Langacker and their followers\nthat came to be known as cognitive linguistics (Lee 2001,\nCroft and Cruse 2004).\n\nCognitive linguists break with advocates of Chomskian generative\ngrammar, denying that the terms on which words intelligibly combine\nare set by brute hard-wired principles of universal grammar embodied\nin a special purpose language module. Instead, the terms on which\nwords meaningfully combine are a direct reflection of the terms on\nwhich certain strategies for conceiving concrete situations,\nstrategies the words serve to signal and evoke, can be successfully\ncoordinated with one another. They break with advocates of a Fodorian\nlanguage of thought, denying that conceiving or thinking is a matter\nof manipulating sentence-like discursive mental representations in\naccord with syntactically stated, truth preserving inferential rules.\nInstead, conceiving is a matter of manipulating unconscious mental\nimagery so as to let concretely pictured physical objects and\nsituations stand in for the more abstract objects and situations\nwe’re endeavoring to understand.\n\nVerbal and nonverbal signs don’t possess fixed meanings or\napplicability conditions independent of particular occasions of use.\nSigns prompt audiences to construct contextually appropriate meanings\nfor them afresh and on the fly, each time would-be communicators\nresort to them. Communication depends on the would-be\ncommunicator’s ability to anticipate and purposefully manipulate\nthe spontaneous, largely unconscious constructions of meaning her\nsignals will elicit from her intended audience.\n\nConcepts are first and foremost techniques for coping with their\nsubject matters; only secondarily are they means of referring to\nparticular constituents of those subject matters for the purpose of\nframing discursively structured true and false thoughts about them.\nAnd talk of discursively structured thoughts needs to be\ntaken with a grain of salt. Tempting as it is to regard the meaning of\na concept as a matter of the mind-independent thing or kind or\nrelation to which it refers, tempting as it is to regard the content\nof a true or false thought as a matter of the mind-independent\nproposition the thought expresses, tempting as it is to regard the\nthoughts we think as arranging already meaningful concepts in much the\nway the sentences we speak arrange already meaningful words, such\nthinking underestimates the degree to which how we think is\nimplicated in what we are able to think and what we are\nable to think about. Talk of referents and propositional contents\nand logical forms belongs to a formalistic picture of what\nthinking is like, a picture which is at best an intermittently\nconvenient fiction.\n\nOur most basic concepts, our most basic coping strategies, are those\nwe employ incessantly in the course of purposeful voluntary bodily\nmovement executed in response to sense-perceptible features of things\nin our immediate spatial vicinity. These basic concepts sketch out a\nworld of discrete objects and discrete parcels of various physical\nstuffs (substances), laid out in space and changing over time as the\nobjects and substances in question come into existence, move about\nfrom place to place, and eventually go out of existence. They present\nthis sensorimotor world to us from a particular determinate\nspatiotemporal perspective, and characterize it for us more or less as\nfollows.\n\nThere’s an inherent difference between horizontal and vertical\ndirections; with only one vertical direction but many different\nhorizontal ones. There’s an inherent difference between higher\nand lower places, hence also an inherent difference between upward and\ndownward motion. Some objects are undifferentiated point particles;\nothers are extended, with distinguishable fronts and backs and sides;\na few have distinguishable tops and bottoms as well. (An\nobject’s front is the part of it that normally faces forward as\nit moves and the part one normally needs to manipulate if one has\nserious business to transact with the object; a thing’s top is\nthe part that is normally highest up, etc.) Some motions, the forced\nones, result from external influences on a moving object or substance,\npushes or pulls exerted on it by other objects or substances in its\nimmediate physical surroundings. Others, the spontaneous motions,\noccur at the initiative of the moving thing itself; these are physical\nactions on the part of physical agents. Some objects are hollow and\ncan accommodate other objects or substances within themselves, in an\ninterior place that moves around with them whenever they move around;\nthese are the containers. One place or object may be connected to\nanother place or object by a traversible path consisting of\nintervening locations. Such a path may be short, straight, and direct;\nor it may be long, crooked, and indirect. Objects and substances stand\nin relations of fitting, sticking, gripping, supporting and the like,\nand each of these relations has immediate consequences for how (and\nhow independently) the objects or substances in question can move.\nEtc.\n\nThe concepts that figure in the foregoing remarks outline a kind of\nfolk geometry, folk kinematics, and folk dynamics. The relations with\nwhich these concepts are concerned aren’t the only immediate\nobjects of human experience: we are aware of some of our own emotions\nwith equal immediacy. But they are the most “clearly\ndelineated” objects of experience and those with which human\nthinking is most inevitably and incessantly concerned.\n\nWe exhibit these relations to ourselves and make inferences about them\nby means of simple diagrammatic mental images, images the unconscious\nemployment of which routinely mediates the planning and execution of\nour voluntary bodily movements: these are sensorimotor image\nschemas. We use these schemas to monitor and manage our ongoing\nactivities in the here and now, and to envisage possible future\ncircumstances and possible future activities when we speculate or\nplan. We may also employ them in imagistic demonstrations of important\ngeneral principles governing the geometric, kinematic, and dynamic\nrelations they serve to depict, truths such as:\n\n\n(1) If object x is in container c and c\nitself is in a second container d, then x is in\nd.\n\n(2) If object x starts out at a and travels\ncontinuously in a single direction along a direct path leading from\na to b, then x gets closer and closer to\nb at later and later times until it eventually arrives at\nb (if it ever does).\n\n\nSuch demonstrations are possible because once properly set up and\nproperly deployed, an image-schematic depiction is often found to\npossess reality-describing content in excess of what its constructor\ndeliberately imposed in the first place. When this occurs, the\ndepiction is treated by its constructor as carrying information (or\nmisinformation) concerning what situations of the kind she set out to\npicture typically are or necessarily must be like.\nSome of this excess information may be presented explicitly and\nstatically, so that she can simply read it off the face of the\ndepiction she has constructed. This is how we might demonstrate (1) to\nourselves. Such is structural inference. The rest of it is\npresented only implicitly and dynamically, so that she can retrieve it\nonly by setting her depiction in motion and letting its changing\nstates tell her how situations of the kind she set out to picture\ntypically would or necessarily must evolve over time. This is how we\nmight demonstrate (2) to ourselves. Such is enactment, also\ncalled simulation, elaboration, or running a mental\nspace. (For “structural inference” and\n“enactment” see Lakoff and Johnson (2003), 257. For\n“simulation,” “elaboration,” and\n“running a space,” see Fauconnier and Turner (2002),\n42–48.)\n\nLakoff and his collaborators maintain that metaphor is at bottom a\nconceptual matter, a matter of thinking of one thing as and in terms\nof another. What Lakoff calls a conceptual metaphor or\ncross-domain map (e.g. love is a\njourney) is a standing pervasive culture-wide disposition to\nconceive one fixed sort of thing (e.g. love affairs), as and in terms\nof another fixed sort of thing (e.g. journeys). Such a cognitive\ndisposition sets up a standing correspondence between particular\nstandard love-affair concepts on the one hand and particular standard\njourney concepts on the other, with the effect that each time the\nrelevant conceptual metaphor is invoked (in connection, perhaps, with\na new pair of lovers),\n\n\nThe lovers correspond to travelers.\n\nThe love relationship corresponds to the vehicle.\n\nThe lovers’ common goals correspond to their common destinations\non the journey.\n\nDifficulties in the relationship correspond to impediments to travel.\n(Lakoff 1993, 207)\n\n\nAnd so on. By exploiting these correspondences, we can and do redeploy\nfamiliar, easy patterns of thinking about one familiar sort of thing\nlending itself to direct sensorimotor representation (journeys) in\nnovel and strenuous bouts of thinking about a second, more elusive\nsort of thing (love affairs):\n\n\nThe metaphor involves understanding one domain of experience, love, in\nterms of a very different domain of experience, journeys…\n(206)\n\nMetaphor allows us to understand a relatively abstract or inherently\nunstructured subject matter in terms of a more concrete, or at least\nmore highly structured subject matter. (244–245)\n\n\nOver time this single cognitive disposition may manifest itself in\nmany different verbal expressions:\n\nOur relationship has hit a dead-end street… Look how far\nwe’ve come. We can’t turn back now. It’s been a\nlong, bumpy road. We’re at a crossroads. We may have to go our\nseparate ways. The relationship isn’t going anywhere.\nWe’re spinning our wheels. Our relationship is off the track.\nThis marriage is on the rocks. We may have to bail out of this\nrelationship. (206)\n\n\nWhat makes these verbal expressions metaphorical, according\nto Lakoff, is the fact that they are direct, conventionally\nstraightforward puttings-into-words of inherently metaphorical\nthoughts, thoughts constructed in the first place under the\nsupervision of the single conceptual metaphor love is a journey.\nActivate a conceptual metaphor; use it to think a metaphorical\nthought; put that thought into words in the usual routine manner,\nprovided for by the usual routine meanings of the words in question;\nand the result thereby counts as a verbal metaphor. Lakoff effectively\ndefines verbal metaphor as the conventionally straightforward\nputting-into-words of an inherently metaphorical conceiving, an\ninherently metaphorical thought. Such is the application to verbal\nmetaphor of the general cognitive linguistic principle that syntactic\nform is the direct expression of underlying meaning relations.\n\nA mental space is an arrangement of discrete concepts or\nimages deployed so as to represent some familiar recurrent sort of\nsituation. Imaginative manipulation of such a space allows us to\nanticipate the structure at a time and behavior over time of\nsituations of the sort it is designed to represent. Mental spaces\nrepresent ways things can be conceived to be in something of\nthe way possible worlds represent ways they could be. Gilles\nFauconnier (1994) proposed them as a basis for interpretations of\ncounterfactuals and propositional attitude constructions he viewed as\nsuperior to the standard truth conditional interpretations based on\nquantification over possible worlds.\n\nSuppose two such spaces, representing distinct sorts of situations,\ncan be viewed as contrasting enrichments of a single generic\nspace representing a more general sort of situation they\ninstantiate in differing and contrasting ways. Concepts or images in\nthe first space correspond to concepts or images in the\nsecond if they flesh out the same concept or image in the generic\nspace. One can then construct a fourth blended space deriving\nsome of its representational features from the first input space, some\nfrom the second, and still others from general principles of\nconceptual integration, in hopes that the result may\naccurately represent—accurately anticipate the structure at a\ntime and behavior over time—of some independently interesting\nsort of situation. Fauconnier and Turner (2002) offered a general\nframework for studying blended spaces and the conceptual integration\nnetworks that produce them. They envisioned diverse applications of\nthe framework to the study of informal reasoning and the\ninterpretation of ordinary language. One such application was the\ninterpretation of analogical metaphors of the form “X is the Y\nof Z”—e.g. “Vanity is the quicksand of\nreason”—a matter Turner explores at length in his\n(1998).\n Conceptual metaphor theory and blending theory remain under active\ndevelopment. Comprehensive surveys of the field include Kövecses\n(2010) and Dancygier & Sweetser (2014). Objections to the approach\nare scouted in Gibbs (2017). A study relating variations in conceptual\nmetaphor to variations in subjects’ perception of their own\nembodiment is in Littlemore (2019).\n5.2 Metaphor and the Context Wars\n\nA metaphor’s paraphrasable content isn’t definitively\nsettled by the pertinent literal meanings of its constituent words and\nphrases. The sun can nourish and illuminate, but it can also parch and\ndessicate and burn. What I convey about a person by metaphorically\nlikening her to the sun depends on which forms of solar power come to\nmind when I do so, and that in turn depends in an intricate manner on\nthe concrete conversational setting in which I do so. Metaphors\nexhibit a profound and conspicuous context-sensitivity, and\nmuch of the work done on metaphor over the past few years has been\ninformed by more general debates about the proper treatment of\ncontext-sensitivity in systematic philosophy of language.\n\nFor the literalist, the primary verbal expressers of\npropositions, the fundamental verbal bearers of truth-values, are\nsuitably disambiguated sentence types. Hence the primary\nbearers of referents, extensions, and truth-conditional\ncontents, the fundamental units of account in compositional\nsemantics, are suitably disambiguated word and phrase types.\nIt is easy to see what this comes to in the case of artificial\nlanguages suitable to pure mathematics and kindred abstract subject\nmatters. It is harder to see what it comes to in the case of natural\nlanguages, where a single sentence type may be used to assert many\ndifferent propositions with every outward show of candor and\ndirectness in as many different concrete conversational settings. The\nliteralist hopes to take the context-sensitivity of indexicals like\nI and here and now as a model for\nunderstanding semantic context-sensitivity more generally.\n\nHere an independently plausible conception of conversational exchange\ncomes to her aid. The utterances of speakers and the interpretive\nactivity of listeners is profoundly and pervasively shaped by the\ncurrent values of a small number of basic situating\nparameters. These parameters have fairly determinate values at\neach stage in a well-run conversation; a wide variety of\nconversational proprieties and improprieties turn on their current\nvalues at any given stage; the values change from utterance to\nutterance in response to publicly discernible events in a manner\ngoverned by simple principles of conversational dynamics, so that\ncareful and well-situated participants have a fighting chance of\nkeeping track of their changing values. Participants need\nthat fighting chance, since fluent unconstrained conversational\nexchange resulting in full understanding by each of what all the\nothers are saying requires the participants to possess more or less\naccurate, more or less thoroughgoing mutual knowledge of the values of\nthe parameters at each and every point in the exchange.\n\nThe single most obvious and pervasively important situating parameter\nis what is (pragmatically) presupposed, the\nset of propositions whose truth is mutually assumed for current\nconversational purposes. Yet it is easy to make a case for regarding\nwho is speaking, who is being addressed, the time of speaking,\nrelations of relative salience, etc, as additional situating\nparameters. In fact, the parameters to which the contents of various\nspecial “context-sensitive” words and phrases are\nmost obviously sensitive appear to be among the situating parameters\nmutual knowledge of which is essential to unconstrained conversational\ncoordination more generally. So perhaps we should think of\nsentence types as expressing propositions, and of word and phrase\ntypes as expressing propositional constituents or contents,\nrelative to one or another assignment of values to the various\nsituating parameters that govern ongoing conversational exchange,\nwhich will then proceed more or less as follows:\n\n\n(a) The content accruing to a sentence (type) when it is uttered, the\ncontent it has relative to the currently active values of the\npertinent situating parameters, serves to determine what can be said\nor otherwise directly communicated by uttering it.\n\n(b) What is said or otherwise directly communicated by an utterance,\ntogether with various other publicly accessible changes in\nconversational circumstances, serve to determine how situating\nparameters change in preparation for the next utterance somebody might\nmake.\n\n(c) When the values situating parameters take on in preparation for\nthe next utterance are fully appropriate as they stand to the\ninterpretation of the next utterance when it comes, the content taken\non by this utterance when it comes is the content the uttered sentence\npossesses relative to those preset parameter values.\n\n(d) When the values the parameters take on in preparation for the next\nutterance are inappropriate as they stand to the next\nutterance when it comes, but there is a unique simple, feasible,\npublicly guessable change in those values that would render the\nutterance appropriate and appropriately interpretable, that change\noccurs forthwith, and the content taken on by the next utterance when\nit comes is the one the uttered sentence possesses relative to the\nfreshly minted set of parameter values resulting from this last-minute\nadjustment. The literature calls this process\naccommodation.\n\n\nFor purposes of semantic and pragmatic theorizing, we can represent\nthe contexts to which the contents of context-sensitive\nexpressions are sensitive and in relation to which they vary by\nsets of possible values for the situating parameters. And we\ncan represent the meaning of a given suitably disambiguated word or\nphrase type by a rule for arriving at an appropriate propositional\nconstituent or truth-conditional contribution or content,\ngiven a context thus understood. David Kaplan called such a\nrule taking us from contexts to contents a character. The\ntechnical resources employed by literalism were put in place gradually\nover the years by Richard Montague (1974), David Kaplan (1989), David\nLewis (1979), and Robert Stalnaker (1999), but whether any of them\nwould fully endorse it is open to question. Prominent literalists\ninclude Kent Bach (2005), Jason Stanley (2007), and the self-styled\nsemantic minimalists: Emma Borg (2004) and Herman Cappelen and Ernie\nLepore (2005).\n\nThe contextualist, by contrast, insists that what it would\ntake for an utterance to be true or instead false, what it would take\nfor an uttered sentence type to be true or instead false\nas uttered, is a matter of what it would take for us to be\nspeaking truly or instead falsely in producing the utterance. When I\nemploy my words with every outward show of candor and directness,\nthere simply isn’t room for a principled and explanatory\ndistinction between what I say and what I mean, the proposition I\nexpress and the proposition I communicate. As a general rule, the\nproposition I express in speaking as I do is what you’d be\naffirming if you responded with Yes, that’s so; what\nyou’d be denying if you responded with No, that’s not\nso; what you’d be questioning if you responded with Is\nthat so? Where there is a disparity between what is said\nand what is successfully meant in either direction, the disparity\nneeds to be pretheoretically discernible at least in broad outline, or\nGricean conversational inferences won’t get off the ground in\nthe first place.\n\nGrant me this much, the contextualist continues, and you’ll need\nto conclude that there’s no assignable limit to the number of\ncontents a term with a given literal meaning can assume, no assignable\nlimit to the features of an occasion of use that can become pertinent\nto determining which of these contents the term actually will assume\non some particular occasion of use, given its literal meaning.\nContexts resist summary representation in terms of sets of situating\nparameter values, and the passage from literal meaning to appropriate\ncontent, given a context, can’t be encapsulated in any tidy\nparametric rule; it is hermeneutic rather than algorithmic in nature.\nAs Charles Travis puts it:\n\nTake any open sentence you like, with any number of supposed places in\nit, each to be filled with reference to a given sort of thing. Take\nany sequence of things, each fit for reference in its corresponding\nplace. Then what the open sentence means is compatible with its saying\nany of indefinitely many things [about] those things, so referred to\nin some closing of it. For example, there is indefinite variety in the\nthings to be said in saying someone to be home at a time. (Are you at\nhome when your house, you in it, has just slid down the hill?) (Travis\n2008, 2).\n\n\nThe contextualist concludes that there is nothing compact and\nsurveyable, relative to which natural language sentence types\ncan be said to express determinate propositions. Indeed, sentence\ntypes as such don’t express propositions or possess\ntruth conditions at all. What truth and falsity and propositional\ncontent accrue to first and foremost are speakings to particular\ncommunicative effect on the part of particular speakers. “Only\nin the context of a speech act does a sentence express a determinate\ncontent”(Recanati, 2004). Prominent contextualists include\nTravis (2008), John Searle (1979a), François Recanati (2004),\nHerbert Clark (1992), Stephen Levinson (2000), and latter-day\nrelevance theorists: Robyn Carston (2002), Anne Bezuidenhout (2002),\nand Sperber and Wilson themselves in work from the mid-90s on.\n\nConfronted with puzzles like Travis’s about what it takes to be\nliterally “at home,” the literalist needs to\nmaintain that the proposition I succeed in communicating by uttering a\nsentence often differs from the one my sentence expresses relative to\nprevailing values for relevant situating parameters, even when I speak\nwith every surface sign of candor and directness. She concludes from\nthis that there are disparities between what we strictly speaking\nsay, the propositions we verbally express, and what we\nsuccessfully mean that are subtler than those exhibited in\nclassical Gricean implicatures. She hopes the discriminatory and\nexplanatory strategies Grice brought to bear on relatively gross\ndisparities between the said and the meant can eventually be brought\nto bear on these subtler ones as well.\n\nThe contextualist is free to think of at least some figurative uses as\nturning on a contrast between the literal content accruing to\nan expression directly and from below (in virtue of its meaning and\nrelevant features of its occasion of use) and a distinct, derived,\nfigurative content the expression passes on up the tree of\ngrammar as its contribution to the content of any larger syntactic\nwholes in which it may be embedded. In other words, he is free to\nregard at least some figures of speech as involving pragmatically\ninspired processes of content reassignment.\n\nFor the literalist, however, all possible contents for a given\nexpression issue from some appropriate underlying literal meaning for\nit in fundamentally the same way and with fundamentally the same\ndirectness: we simply apply one and the same content-determining\nrule, one and the same character, to different\ncontexts. Literalism therefore has no place for figurative\ncontents (so understood) in its accounts of figurative\nlanguage use.\n\nRecent contextualist accounts of metaphor have tended to be exercises\nin “truth conditional pragmatics”: metaphor involves some\ncombination of enrichment and loosening in the applicability\nconditions of pertinent general terms, where the resulting content\nshift is just drastic enough to bring what the speaker is thereby\ntaken to be saying and what she is thereby taken to mean or\nimplicate into accord with pertinent conversational norms. The\nconceptual raw materials for the shifted content derive in part from\nwhat is taken for granted at a given point in a given conversation, in\npart from commonplaces belonging to “encyclopedia entries”\npermanently associated with particular terms for all competent users\nof those terms. In relevance theoretic accounts—Carston (2002),\nBezuidenhout (2001), Sperber and Wilson (2008)—the adjustment is\npart of the same reflectively accessible process of conversational\ninference we use to work out classical Gricean implicatures. In\nRecanati’s competing account (2004), it is managed by\n“associative” processes to which the listener lacks\nroutine reflective access. Sperber and Wilson maintain that metaphor\nis just an especially dramatic instance of processes of content\nmodulation at work throughout the interpretation of language,\ninvolving no distinctive principles of its own.\n\nRecent literalist accounts of metaphor have come in two styles.\n\nOn the one hand, there are efforts to portray the context sensitivity\nof metaphor in terms of Kaplanian characters: rules that render the\nsemantic content of a suitable specific metaphorical constituent a\nsuitable function of the current value of some specific situating\nparameter of special relevance to metaphor in particular.\n\nWhen employed within the scope of modal and counterfactual\nconstructions, a metaphorical focal expression brings the properties\nit actually picks out here and now to the characterization of\ncircumstances in which it would have picked out other properties, had\nit been employed in them. This encourages Josef Stern (2000) to posit\na term-taking, term-making operator, “metaphorically\nspeaking” or “mthat,” ordinarily left unpronounced,\nwhose behavior is modeled on that of Kaplan’s rigidifying\noperator “dthat.” Stern supposes that at any given point\nin any given conversation, there is a set of things mutually taken for\ngranted for various figure-interpreting purposes; he calls them\nI-presuppositions. (Think back to Skulsky’s\ntalk-postulates.) Like ordinary presuppositions, I-presuppositions\nchange from utterance to utterance under the impact of accommodation\npressures, and they equip terms with “implications” in\nsomething like Skulsky’s sense: a property P is\n“implied by” or m-associated with a general term\nΦ in context c just in case it is I-presupposed in that\ncontext that things to which Φ applies have property P.\nThe full Kaplanian account of “mthat” runs more or less as\nfollows:\n\nIf Φ is a general term, then for a given context c,\n“mthat [Φ]” has as its content the conjunction of all\nthe properties that are m-associated with Φ in context c;\nfor that context c, it picks out this conjunction of\nproperties in any circumstance s. (115)\n\n\nThis makes the content of “mthat [Φ]” a function of a\nspecial purpose situating parameter, the set of active\nI-presuppositions, even in cases where Φ itself has\nthe same content in every context.\n\nOn the other hand, there are efforts to rehabilitate the classical\nGricean implicature account of metaphor by challenging the specific\ndiagnostics for ‘what is said’ insisted upon by\ncontemporary contextualists. Neo-Gricean literalists undertake to\nargue that what is meant can differ from what is said even\nwhen speakers speak with every outward show of candor and directness,\nand that this is precisely what happens when speakers resort to\nmetaphor. The arguments they employ against their contextualist\nopponents bear a striking resemblance to those Kripke employed against\nDonnellan’s content-based treatment of the distinction\nbetween referential and attributive uses of definite\ndescriptions. See Donnellan (1966), Kripke (1977), and the entry on\n descriptions.\n\nAn especially detailed effort along these lines comes from Elisabeth\nCamp (2006); only one of her arguments can be reviewed here. Some time\nback the linguist Larry Horn drew attention to “the phenomenon\nof metalinguistic negation—a device for\nobjecting to a previous utterance on any grounds whatever, including\nthe conventional or conversational implicata it potentially induces,\nits morphology, its style or register, or its phonetic\nrealization” (Horn, 1988, 381). Consider “It wasn’t\nwarm, it was sweltering,” where of course, if\nit was sweltering, it follows that it was warm as well. In\nmany circumstances, a form of words the contextualist regards as\nreserved for denying what is said can in fact be pressed into service\nto deny one or another associated, unexpressed proposition. Camp\ncontends that this renders direct denial diagnostics for what is said\nsystematically unreliable. If she’s right about this, direct\naffirmation diagnostics and direct questioning diagnostics will be in\ntrouble for the same sort of reason.\n5.3 Metaphor and Make-Believe\n\nIn 1962 the Australian philosopher Colin Murray Turbayne brought out a\nlittle book on Berkeley’s theory of vision called The Myth\nof Metaphor. It had as much say about metaphor in general as\nabout Berkeley in particular.\n\nDescartes and Newton understood physical objects as complex\nmechanisms, clockworks, artifacts of a divine clockmaker, operating on\neach other and on human perceivers to welcome or unwelcome effect in\naccord with simple exceptionless mechanical laws. Berkeley understood\nthem as assemblages of visual ideas, conventional signs in a language\nGod employs to point out potentially pleasurable opportunities and\npotentially painful dangers to dependent finite spirits like\nourselves. Turbayne thinks these disparate understandings of physical\nobjects are best viewed not as competing theories but as compatible\nand complementary metaphors.\n\nMetaphor involves the use of a term or other sign in a novel sense\ndifferent from its customary sense, what Turbayne calls\n“sort-crossing.” Yet not every sort-crossing, not every\ntrope, counts as a metaphor, just those involving “the pretense\nthat something is the case when it is not,” as when Descartes\ncandidly says he will describe “this earth, and generally the\nwhole visible world, as if it were merely a machine”\n(13–14). When I say man is a wolf, “though I give him [man] the\nsame name I do not believe he is another sort of wolf. I only make\nbelieve he is… That is, I pretend that something is the case\nwhen it is not, and I implicitly ask my audience to do the same”\n(14). The pretending here comes with some intending:\n“I intend that [man] shares some of the properties of wolves but\nnot enough of them to classified as an actual wolf.” Similarly\n“when I say that vision is a language I intend that vision\nshares some of the properties of language but not enough to let it be\nranged alongside English and French” (15). It appears that what\nI say when I resort to metaphor, what I intend by it in\nTurbayne’s special sense, is whatever it would take to sustain\nmy pretense and render it worthwhile. Pretense about the world goes\nhand in hand with pretense about language: the sense of semantic\nstrain (zeugma) involved in “Men and timber-wolves are\nwolves” shows that the word “wolf” is really being\nused in two different senses even though it is as if it were being\nused in just one (15); there is a shared pretense that the two senses\nare the same (17), despite awareness on all sides that they are really\ndistinct. Often what is expected to sustain and reward such a\npretense, what we intend in pretending, is some set of resemblances\nbetween primary and secondary subjects. But this needn’t be the\ncase, and when it isn’t, metaphor ceases to be a trope of\nresemblance entirely. Poetically ambitious synecdoches and metonymies\nare metaphors without being similitudes.\n\nIt is easy to lose sight of metaphorical pretense. We may mistake the\nmodel for a real instance of what it models, drift from make believe\nto outright belief, confuse the mask with the face beneath it, take\nliterally what was originally meant metaphorically. Turbayne seems to\nthink this happened to Berkeley and his mechanist rivals. They set out\nto offer metaphors but ended up propounding theories; they lost track\nof their own “as ifs” and became victims of their own\ninsights.\n\nTurbayne’s thought about metaphor was a collection of\nundeveloped gestures. It took Kendall Walton (1993) to rediscover\nthese ideas and make an organized theory out of them. Walton has\npioneered an approach to imaginative play in children and its\nanalogues in adult human culture built around the notion of a game\nof make-believe. Such a game is governed by complex, tacit,\nmutually understood rules or norms, principles of generation,\nthat render what’s fictional in the game, what players\nof it are supposed to imagine in playing it, a fixed function of the\nactual states and behaviors of various things and people they\nperceive, manipulate, and otherwise interact with as they play\nit. Walton calls such generators of fictional content\nprops.\n\nIconic and verbal representations of various familiar traditional\nkinds—dolls, hobby horses, statues, paintings, novels—are\ninanimate props, artifacts whose whole raison\nd’être is to help generate fictional content in\nmake-believe games of various familiar recurrent kinds. What such\nrepresentations represent is a matter of how they stand ready to\nfunction as props, how they stand ready to shape fictional content by\nhelping to generate it when games of these familiar recurrent kinds\nactually get played. Actors, on the other hand, are animate\nprops, props of a peculiarly active and self-conscious kind. They help\nto author and direct (in their capacity as autonomous agents) the\nfictional content they help to generate (in their capacity as props)\nand go on to consume (in their capacity as obedient imaginers). Actors\nbehave so as to deliberately shape what comes out fictional in the\ngames they play with one another and with salient inanimate bits of\nthe world around them, thereby deliberately orchestrating their own\nimaginings and those of their fellow players.\n\nThe most conspicuous games of make-believe, those involving\npremeditated acting, prefabricated representations, or both, are games\nwhose players vividly and eagerly imagine what they are supposed to\nimagine under the rules because doing so is intrinsically satisfying\nin some way. Props in such games are means to imaginative ends,\nderiving their instrumental value or interest from the intrinsic value\nor interest of the fictional content they help generate. Such games\nare content oriented. Examples include playing cops and\nrobbers, putting on Hamlet, reading a novel for the sake of\nits story. Walton (1990) analyzed various important modes of\nrepresentation in and outside the arts—depiction, narration,\ndramatic enactment, etc.—in terms of the special sorts of prop\nand special sorts of principle of generation characteristic of such\nanthropologically conspicuous, intrinsically satisfying, content\noriented games.\n\nBut not all games of make-believe are like this. Sometimes the games\nwe play and the fictions we generate in the course of playing them owe\nmuch of their value and interest to the manner in which they enable us\nto perceive, conceive, and manipulate their own props. Sometimes our\nthought and speech about objects that already really exist and are\nalready of vital interest to us can be helpfully structured or\nrestructured by pressing these objects into service as props in a\nsuitable game of make-believe, turning them for the time being into\nimprovised representations of something almost entirely different.\nPretend for a moment that Italy is a boot, turn Italy for the time\nbeing into an improvised representation of a boot, and you have a\nreadymade scheme for locating particular Italian cities in relation to\neach other, deriving from familiar established ways of thinking and\ntalking about boots and their component parts. Games of this second\nsort are prop oriented (Walton 1993). Since little turns on\nhow vividly we imagine the things such games call on us to imagine, we\nmay be only dimly aware of playing them even as we do so. Yet we are\nare remarkably skilled at playing such games with one another on a\npickup basis, never formulating, let alone stipulating, the principles\nof generation that govern our imaginative collaborations for as long\nas they last.\n\nHearing “Juliet is the sun” in its concrete conversational\nsetting, we come to suspect that Romeo is imagining his new love to\njust plain be exactly that, the sun. We come to suspect that Romeo is\nenabled to imagine this and in his personal opinion\ncalled on to image it by the rules of a game of make-believe\nhe spontaneously finds himself playing, a game we attempt to join him\nin playing as we struggle to make appropriate sense of his words.\nRomeo imagines Juliet to be the sun because he feels called on to do\nso, and he feels called on to do so because of the rules he takes\nhimself to be playing by (on the one hand) and what he seriously\nbelieves about Juliet herself (on the other).\n\nPerhaps Romeo’s game is such that in going through the motions\nof asserting that Juliet is the sun, he renders it fictional that he\ndoes assert this and does so sincerely and truthfully. (Many games of\nmake-believe do work this way, after all.) If so, his utterance is an\nact of verbal participation in the game on which it comments,\na fiction-generating move in the game under the rules: going\nthrough the motions of asserting that Juliet is the sun will\nfictionally count as sincerely and truthfully asserting this very\nthing. Or perhaps not: perhaps Romeo isn’t pretending to say or\nassert anything at all in speaking as he does. Perhaps he isn’t\nspeaking in his capacity as make-believe actor at all; perhaps he\nspeaks merely in his other capacities as make-believe author and\ndirector and audience. In either case, his words serve to signal an\nunderstanding on his part that it is fictional in the game he’s\nplaying that Juliet is the sun: an understanding on his part that\nunder the rules of the game that he and any suitably attuned listeners\nare playing together, he and they are to imagine Juliet to be the\nsun—imagine her to just plain be exactly that.\n\nAs we have already seen, this understanding on Romeo’s part is\nin turn a joint product and joint expression of his working\nunderstanding of the rules he’s playing by (on the one hand) and\nhis working understanding of what Juliet herself is actually like (on\nthe other). So: what would Romeo’s signal do for a listener who\nis already suitably attuned with him, a listener already reliably\ndisposed to play by the same rules he plays by? It would ascribe to\nJuliet the properties that in Romeo’s opinion render it\nfictional that she is the sun, the properties that in\nRomeo’s opinion make the role of the sun fall to her,\nunder those rules. And these are the very properties that turn up in a\nsuccessful paraphrase of Romeo’s utterance when it gets taken as\na metaphor. We listeners undertake to discover what properties these\nare by responding to Romeo’s utterance as a make-believe signal,\ndoing our best to enter into the spirit of a game already in progress,\nand reflecting on the rules we find ourselves playing by if and when\nwe succeed in doing so.\n\nAt any rate, this is how things go in the basic case. Sometimes the\nrules by which the maker of a metaphor is playing are so familiar and\nstereotyped that we can recover them without any prior effort to join\nin and play along, in which case we may not bother to do so. For that\nmatter, sometimes the initiator of the game may merely go through the\nmotions of playing it himself, failing to imagine the things he is\nnominally called on to imagine by make-believe signals he himself\nemits, in which case he merely alludes to a game that even he\ndoesn’t bother to play.\n\nAll of which suggests the broad outlines of a novel account of how we\ngo about interpreting many metaphors:\n\nThe metaphorical statement (in its context) implies or suggests or\nintroduces or calls to mind a (possible) game of make-believe. The\nutterance may be an act of verbal participation in the implied game,\nor it may merely be the utterance of a sentence that could be used in\nparticipating in the game. In saying what she does, the speaker\ndescribes things that are or would be props in the implied game. It\nmay be possible in favorable cases to paraphrase what she says about\nthem with reasonable fidelity. Typically, the paraphrase will specify\nfeatures of the props by virtue of which it would be fictional in the\nimplied game that the speaker speaks truly, if her utterance is an act\nof verbal participation in it. (Walton 1993, 46)\n\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aristotle, 1987, <em>Rhetoric: A Theory of Civic Discourse</em>,\nGeorge A. Kennedy (trans.), Oxford: Oxford University Press,\n1987.",
                "–––, 1987, <em>Poetics I, With the Tractatus\nCoislinianus, a Hypothetical Reconstruction of Poetics II, and the\nFragments of the On the Poets</em>, Richard Janko (trans.),\nIndianapolis: Hackett, 1987.",
                "–––, 2018, <em>Rhetoric,</em> C.D.C. Reeve (trans.),\nIndianapolis: Hackett.",
                "Bach, Kent, 2005, “Context <em>Ex Machina</em>,” in\n<em>Semantics vs. Pragmatics</em>, Zoltan Szabó (ed.), Oxford\nand New York: Oxford University Press, pp. 15–44.",
                "Barfield, Owen, 1962, “Poetic Diction and Legal\nFiction,” in <em>The Importance of Language</em>, Max Black\n(ed.), Englewood Cliffs, New Jersey: Prentice-Hall, 1962,\n57–71.",
                "Beardsley, Monroe C., 1962, “The Metaphorical Twist,”\n<em>Philosophy and Phenomenological Research</em>, 22(3):\n293–307.",
                "Bezuidenhout, Anne, 2001, “Metaphor and What is Said: A\nDefense of a Direct Expression View of Metaphor,” <em>Midwest\nStudies in Philosophy</em>, 25(1): 156–86.",
                "–––, 2002, “Truth Conditional\nPragmatics,” <em>Philosophical Perspectives</em>, 16:\n105–34.",
                "Black, Max, 1954, “Metaphor,” <em>Proceedings of the\nAristotelian Society</em>, 55: 273–94.",
                "Blasko, Dawn G. and Cynthia M. Connine, 1993, “Effects of\nFamiliarity and Aptness on Metaphor Processing,” <em>Journal of\nExperimental Psychology: Learning, Memory, and Cognition</em> 19(2):\n295–308.",
                "Borg, Emma, 2004. <em>Minimal Semantics</em>, Oxford: Oxford\nUniversity Press.",
                "Boys-Stones, G.R. (ed.), 2003, <em>Metaphor, Allegory, and the\nClassical Tradition: Ancient Thought and Modern Revisions</em>, Oxford\nand New York: Oxford University Press.",
                "Bowdle, Brian F. and Dedre Gentner, 2005, “The Career of\nMetaphor,” <em>Psychological Review</em> 112(1):\n193–216.",
                "Brooke-Rose, Christine, 1958, <em>A Grammar of Metaphor,</em>\nLondon: Secker &amp; Warburg.",
                "Brooks, Cleanth, 1947, “The Heresy of Paraphrase,” in\n<em>The Well Wrought Urn: Studies in the Structure of Poetry</em>, New\nYork: Reynal &amp; Hitchcock, 1947, 192–214.",
                "Camp, Elisabeth, 2006, “Contextualism, Metaphor, and What is\nSaid,” <em>Mind &amp; Language</em>, 21(3): 280–309.",
                "–––, 2006. “Metaphor and That Certain\n‘Je Ne Sais Quoi’,” <em>Philosophical Studies</em>\n129(1): 1–25.",
                "–––, 2013, “Metaphor and Varieties of\nMeaning,” in <em>A Companion to Donald Davidson,</em> Ernest\nLepore and Kirk Ludwig (eds.), Hoboken: Wiley-Blackwell,\n361–78.",
                "Cappelen, Herman, and Ernie Lepore, 2005, <em>Insensitive\nSemantics: A Defense of Semantic Minimalism and Speech Act\nPluralism</em>, Oxford: Blackwell Publishing.",
                "Carston, Robyn, 2002, “The Pragmatics of On-Line Concept\nConstruction,” in <em>Thoughts and Utterances: The Pragmatics of\nExplicit Communication</em>, Malden, MA and Oxford: Blackwell\nPublishing, 320–75.",
                "Cavell, Stanley, 1969, “Aesthetic Problems of Modern\nPhilosophy,” in <em>Must We Mean What We Say? A Book of\nEssays</em>, New York: Charles Scribner’s Sons,\n73–96.",
                "Cicero, <em>De Oratore</em>, in <em>On the Ideal Orator</em>,\nJames M. May and Jakob Wisse (trans.), London and New York: Oxford\nUniversity Press, 2001.",
                "Clark, Billy, 2003, <em>Relevance Theory.</em> Cambridge and New\nYork: Cambridge University Press.",
                "Clark, Herbert H., 1992, “Making Sense of Nonce\nSense,” in <em>Arenas of Language Use</em>, Chicago and London:\nChicago University Press and CSLI, 305–40.",
                "Cohen, Ted, 1978, “Metaphor and the Cultivation of\nIntimacy,” <em>Critical Inquiry</em>, 5(1): 3–12.",
                "–––, 2008, <em>Thinking of Others: On the Talent\nfor Metaphor</em>, Princeton: Princeton University Press.",
                "Croft, William and D. Alan Cruse, 2004, <em>Cognitive\nLinguistics</em>, Cambridge and New York: Cambridge University\nPress.",
                "Currie, Gregory and Jacopo Frascaroli, 2021, “Poetry and the\nPossibility of Paraphrase,” <em>Journal of Aesthetics and Art\nCriticism</em> 79(4): 428–39.",
                "Dancygier, Barbara and Eve Sweetser. <em>Figurative Language</em>,\nCambridge: Cambridge University Press, 2014.",
                "Davidson, Donald, 1978, “What Metaphors Mean.”\n<em>Critical Inquiry</em>, 5(1) : 31–47. Reprinted in\n<em>Inquiries into Truth and Interpretation</em>, Oxford and New York:\nOxford University Press, 1984, 245–264.",
                "–––, 1986, “A Nice Derangement of\nEpitaphs,” in Truth and Interpretation: Perspectives on the\nPhilosophy of Donald Davidson, Ernest Lepore (ed.), Oxford and New\nYork: Blackwell, 433–46.",
                "–––, 2005, “Locating Literary\nLanguage,” in <em>Truth, Language, and History</em>, Oxford:\nClarendon Press, 167–181.",
                "Davis, Wayne A., 1998, <em>Implicature: Intention, Convention, and\nPrinciple in the Failure of Gricean Theory</em>, New York: Cambridge\nUniversity Press.",
                "Donnellan, Keith S., 1966, “Reference and Definite\nDescriptions”, <em>Philosophical Review</em>, 75(3):\n281–304.",
                "Donoghue, Denis, 2014, <em>Metaphor</em>, Cambridge, Massachusetts\nand London: Harvard University Press.",
                "Fauconnier, Gilles, 1994, <em>Mental Spaces: Aspects of Meaning\nConstruction in Natural Languages</em>, New York: Cambridge University\nPress.",
                "Fauconnier, Gilles, and Mark Turner, 1998, “Conceptual\nIntegration Networks,” <em>Cognitive Science</em>, 22(2):\n133–187.",
                "–––, 2002, <em>The Way We Think: Conceptual\nBlending and the Mind’s Hidden Complexities</em>, New York:\nBasic Books.",
                "Fogelin, Robert J., 1988, <em>Figuratively Speaking</em>, New\nHaven: Yale University Press. A revised edition was issued by Oxford\nUniversity Press in 2011.",
                "Frye, Northrop, 1957, <em>Anatomy of Criticism: Four Essays</em>,\nPrinceton: Princeton University Press.",
                "Gass, William H., 1972, “In Terms of the Toenail: Fiction\nand the Figures of Life,” in <em>Fiction and the Figures of\nLife</em>, New York: Vintage, 55–78.",
                "–––, 1975, <em>On Being Blue: A Philosophical\nInquiry</em>, Boston: David R. Godine.",
                "Geary, James, 2011, <em>I is an Other: The Secret Life of Metaphor\nand How it Shapes the Way We See the World</em>, New York:\nHarperCollins.",
                "Gibbs, Jr., Raymond W., 1994, <em>The Poetics of Mind: Figurative\nThought, Language, and Understanding</em>. Cambridge and New York:\nCambridge University Press.",
                "–––, 2017, <em>Metaphor Wars: Conceptual\nMetaphors in Human Life,</em> Cambridge and New York: Cambridge\nUniversity Press.",
                "Giora, Rachel, 2003, <em>On Our Mind: Salience, Context, and\nFigurative Language.</em> Oxford and New York: Oxford University\nPress.",
                "Glucksberg, Sam, 2001, <em>Understanding Figurative Language: From\nMetaphors to Idioms.</em> Oxford and New York: Oxford University\nPress.",
                "Glucksberg, Sam, Patricia Gildea, and Howard B. Booklin, 1982,\n“On Understanding Nonliteral Speech: Can People Ignore\nMetaphors?” <em>Journal of Verbal Learning and Verbal\nBehavior</em>, 21: 85–98.",
                "Goatly, Andrew 2011, <em>The Language of Metaphors,</em> 2nd ed.\nLondon and New York: Routledge.",
                "Goodman, Nelson, 1976, <em>Languages of Art</em>, Indianapolis:\nHackett Publishing Company.",
                "–––, 1979, “Metaphor as\nMoonlighting,” <em>Critical Inquiry</em>, 6(1):\n125–130.",
                "Grice, Herbert Paul, 1989, “Logic and Conversation, Lecture\n2” in <em>Studies in the Way of Words</em>, Cambridge,\nMassachusetts and London: Harvard University Press, 22–40.",
                "Guetti, James L., 1993, “Gambling With Language:\nMetaphor,” in <em>Wittgenstein and the Grammar of Literary\nExperience</em>, Athens: University of Georgia Press,\n122–146.",
                "Halliwell, Stephen, 2002, <em>The Aesthetics of Mimesis: Ancient\nTexts and Modern Problems</em>, Princeton and Oxford: Princeton\nUniversity Press.",
                "Hills, David, 1997, “Aptness and Truth in Verbal\nMetaphor,” <em>Philosophical Topics</em>, 25(1):\n117–153.",
                "–––, 2008, “Problems of Paraphrase:\nBottom’s Dream,” <em>Baltic International Yearbook of\nCognition, Logic, and Communication</em>, 3. URL=\n&lt;http://thebalticyearbook.org/journals/baltic/article/view/22/21&gt;",
                "–––, 2017, “The What and the How of\nMetaphorical Imagining, Part One.” <em>Philosophical\nStudies</em> 174(1): 13–31.",
                "Hollander, John, 1985, <em>Vision and Resonance: Two Senses of\nPoetic Form</em>, 2nd edition, New Haven: Yale University Press.",
                "Holyoak, Keith James, 2019, <em>The Spider’s Thread:\nMetaphor in Mind, Brain, and Poetry.</em> Cambridge, Massachusetts: MIT\nPress.",
                "Horn, Laurence R., 1988, <em>A Natural History of Negation</em>,\nChicago, University of Chicago Press, 1988. A reissue edition with a\nnew introduction was published by Stanford: CSLI Publications,\n2001.",
                "Kaplan, David, 1989, “Demonstratives,” in <em>Themes\nFrom Kaplan</em>, Joseph Almog, Howard K. Wettstein, and John Perry\n(eds.), New York: Oxford University Press, 481–563.",
                "Kirby, John T., 1997, “Aristotle on Metaphor,” <em>The\nAmerican Journal of Philology</em>, 118(4): 517–554.",
                "Kittay, Eva Feder, 1987, <em>Metaphor: Its Cognitive Force and\nLinguistic Structure</em>, Oxford and New York: Clarendon Press.",
                "Kövecses, Zoltán, 2010, <em>Metaphor: A Practical\nIntroduction,</em> 2nd ed. Oxford and New York: Oxford University\nPress.",
                "Kripke, Saul, 1977, “Speaker’s Reference and Semantic\nReference,” <em>Midwest Studies in Philosophy</em>, 2:\n255–276.",
                "Lakoff, George, 1993, “The Contemporary Theory of\nMetaphor.” In <em>Metaphor and Thought</em>, 2nd edition, Andrew\nOrtony (ed.), Cambridge: Cambridge University Press,\n202–251.",
                "Lakoff, George, and Mark Johnson, 2003, “Afterword,”\nin <em>Metaphors We Live By</em>, 2nd edition, Chicago and London:\nUniversity of Chicago Press, 170–190.",
                "Lamarque, Peter, 2015, “Semantic Finegrainedness and Poetic\nValue,” in <em>The Philosophy of Poetry,</em> John Gibson (ed.),\nOxford University Press, 18–36.",
                "Lee, David, 2001, <em>Cognitive Linguistics: An Introduction</em>,\nOxford and New York: Oxford University Press.",
                "Lepore, Ernie, 2009, “The Heresy of Paraphrase: When the\nMedium Really is the Message,” <em>Midwest Studies in Philosophy</em>,\n33(1): 177–97.",
                "Lepore, Ernie, and Matthew Stone, 2010, “Against Metaphorical\nMeaning,” <em>Topoi</em>, 29(2): 165–180.",
                "–––, 2015, <em>Imagination and Convention:\nDistinguishing Grammar and Inference in Language</em>, Oxford: Oxford\nUniversity Press.",
                "Levinson, Jerrold, 2001, “Who’s Afraid of a\nParaphrase?” <em>Theoria</em> 67(1): 7–23.",
                "Levinson, Stephen C., 2000, <em>Presumptive Meanings: The Theory\nof Generalized Conversational Implicature</em>, Cambridge, Massachusetts: MIT\nPress.",
                "Lewis, David, 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, Massachusetts: Harvard University Press.",
                "–––, 1979, “Scorekeeping in a Language\nGame,” <em>Journal of Philosophical Logic</em>, 8(1):\n339–357.",
                "Littlemore, Jeanette, 2019, <em>Metaphors in the Mind: Sources of\nVariation in Embodied Metaphor,</em> Cambridge: Cambridge University\nPress.",
                "Lloyd, G.E.R., 1996, “The Metaphors of Metaphors,” in\n<em>Aristotelian Explorations</em>, Cambridge: Cambridge University\nPress, 205–222.",
                "Martinich, A.P., 1984, “A Theory for Metaphor,”\n<em>Journal of Literary Semantics</em>, 13(1): 35–56.",
                "Montague, Richard, 1974, <em>Formal Philosophy; Selected Papers of\nRichard Montague</em>, Richmond H. Thomason (ed.), New Haven: Yale\nUniversity Press.",
                "Moran, Richard, 1989, “Seeing and Believing: Metaphor,\nImage, and Force,” <em>Critical Inquiry</em>, 16(1):\n87–112.",
                "–––, 1996, “Artifice and Persuasion: The\nWork of Metaphor in the <em>Rhetoric</em>,” in <em>Essays on\nAristotle’s Rhetoric</em>, Amelie Rorty (ed.), Berkeley:\nUniversity of California Press.",
                "Nowottny, Winifred, 1962, <em>The Language Poets Use</em>, New\nYork: Oxford University Press.",
                "Ortony, Andrew, 1979, “The Role of Similarity in Similes and\nMetaphors,” in <em>Metaphor and Thought</em>, 1st edition,\nAndrew Ortony (ed.), Cambridge: Cambridge University Press,\n186–201.",
                "Ortony, Andrew, Diane L. Schallert, Ralph E. Reynolds, and Stephen\nJ. Antos, 1978, “Interpreting Metaphors and Idioms: Some\nEffects of Context on Comprehension,” <em>Journal of Verbal\nLearning and Verbal Behavior</em>, 17(4): 465–77.",
                "Quintilian, <em>Institutio Oratoria</em>, in <em>The\nOrator’s Education</em>, 5. vols, Donald A. Russell (trans.),\nLoeb Classical Library, Cambridge, Massachusetts and London: Harvard\nUniversity Press, 2001.",
                "Recanati, François, 2004, <em>Literal Meaning</em>,\nCambridge and New York: Cambridge University Press.",
                "Reimer, Marga, 1996, “The Problem of Dead Metaphor,”\n<em>Philosophical Studies</em>, 82(1): 13–25.",
                "–––, 2001, “Davidson on Metaphor,”\n<em>Midwest Studies in Philosophy</em>, 25(1): 142–156.",
                "–––, 2004, “What Malapropisms Mean: A\nReply to Donald Davidson,” <em>Erkenntnis</em>, 60(3):\n317–334.",
                "Reimer, Marga and Elisabeth Camp, 2008, “Metaphor,” in\n<em>Oxford Handbook of the Philosophy of Language,</em> Ernest Lepore\nand Barry C. Smith (eds.), Oxford: Oxford University Press,\n845–63.",
                "Richards, Ivor A., 1936, <em>The Philosophy of Rhetoric</em>,\nLondon and New York: Oxford University Press.",
                "Richie, L. David, 2013, <em>Metaphor (Key Topics in Semantics and\nPragmatics)</em>, Cambridge and New York: Cambridge University\nPress.",
                "Ricoeur, Paul, 1978, “The Metaphorical Process as Cognition,\nImagination, and Feeling,” <em>Critical Inquiry</em>, 5(1):\n143–159.",
                "–––, 1977, <em>The Rule of Metaphor:\nMulti-Disciplinary Studies of the Creation of Meaning in\nLanguage</em>, Robert Czerny (trans.), Toronto and Buffalo: University\nof Toronto Press.",
                "Saul, Jennifer M., 2001, “Review of Wayne A. Davis,\n<em>Implicature: Intention, Convention, and the Failure of Gricean\nTheory</em>,” <em>Noûs</em>, 35(4): 630–641.",
                "Scott, Kate, Billy Clark, and Robyn Carston, eds, 2019, <em>Relevance,\nPragmatics and Interpretation: Essays in Honour of Deirdre\nWilson.</em> Cambridge: Cambridge University Press.",
                "Scott, William C., 2006, “Similes in a Shifting Scene:\n<em>Iliad</em>, Book 11,” <em>Classical Philology</em>, 101(2):\n103–114.",
                "Searle, John R., 1979a, “Metaphor,” in <em>Expression\nand Meaning: Studies in the Theory of Speech Acts</em>, Cambridge and\nNew York: Cambridge University Press, 76–116.",
                "–––, 1979b, “Literal Meaning,” in\n<em>Expression and Meaning: Studies in the Theory of Speech Acts</em>,\nCambridge and New York: Cambridge University Press, 117–36.",
                "Skulsky, Harold, 1986, “Metaphorese.”\n<em>Noûs</em>, 20(3): 351–69.",
                "–––, 1992, <em>Language Recreated:\nSeventeenth-Century Metaphorists and the Act of Metaphor</em>, Athens:\nUniversity of Georgia Press.",
                "Sparshott, Francis E., 1974, “ ‘As,’ Or the\nLimits of Metaphor,” <em>New Literary History</em>, 6(1):\n75–94.",
                "Sperber, Dan, and Deirdre Wilson, 1985, “Loose Talk,”\n<em>Proceedings of The Aristotelian Society</em>, 86:\n153–171.",
                "–––, 1995, <em>Relevance: Communication and\nCognition</em>, 2nd edition, Oxford and Cambridge, Massachusetts: Blackwell.",
                "–––, 2008, “A Deflationary Account of\nMetaphors,” in <em>The Cambridge Handbook of Metaphor and\nThought</em>, Raymond W. Gibbs, Jr. (ed.), Cambridge and New York:\nCambridge University Press, 84–105.",
                "Stalnaker, Robert, 1999, <em>Context and Content: Essays on\nIntentionality in Speech and Thought</em>, Oxford and New York: Oxford\nUniversity Press.",
                "Stanley, Jason, 2007, <em>Language in Context: Selected\nEssays</em>, Oxford: Oxford University Press.",
                "Stern, Josef, 2000, <em>Metaphor in Context</em>, Cambridge,\nMassachusetts: MIT Press.",
                "Stryk, Lucien, and Takashi Ikemoto, 1995, <em>Zen Poetry: Let the\nSpring Breeze Enter</em>, New York: Grove Press.",
                "Travis, Charles, 2008, “Introduction,” in\n<em>Occasion-Sensitivity: Selected Essays</em>, Oxford and New York:\nOxford University Press, 1–16.",
                "Turbayne, Colin Murray, 1970, <em>The Myth of Metaphor,</em> rev\ned., Columbia, South Carolina: University of South Carolina Press.\nFirst published by Yale University Press in 1962.",
                "Turner, Mark, 1998, “Figure,” in <em>Figurative\nLanguage and Thought</em>, Albert N. Katz (ed.), New York and Oxford:\nOxford University Press, 44–87.",
                "Tversky, Amos, 1977, “Features of Similarity,”\n<em>Psychological Review</em>, 84(4): 327–352.",
                "Walton, Kendall L, 1990, <em>Mimesis as Make-Believe: On the\nFoundations of the Representational Arts</em>, Cambridge,\nMassachusetts and London: Harvard University Press.",
                "–––, 1993, “Metaphor and Prop Oriented\nMake-Believe,” <em>European Journal of Philosophy</em>, 1(1):\n39–57.",
                "White, Roger M., 1996, <em>The Structure of Metaphor: The Way the\nLanguage of Metaphor Works</em>, Oxford and Cambridge, MA:\nBlackwell.",
                "Wilson, Deirdre, and Dan Sperber, 2002, “Truthfulness and\nRelevance,” <em>Mind</em>, 111(443): 583–632."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Aristotle, 1987, <em>Rhetoric: A Theory of Civic Discourse</em>,\nGeorge A. Kennedy (trans.), Oxford: Oxford University Press,\n1987.</li>\n<li>–––, 1987, <em>Poetics I, With the Tractatus\nCoislinianus, a Hypothetical Reconstruction of Poetics II, and the\nFragments of the On the Poets</em>, Richard Janko (trans.),\nIndianapolis: Hackett, 1987.</li>\n<li>–––, 2018, <em>Rhetoric,</em> C.D.C. Reeve (trans.),\nIndianapolis: Hackett.</li>\n<li>Bach, Kent, 2005, “Context <em>Ex Machina</em>,” in\n<em>Semantics vs. Pragmatics</em>, Zoltan Szabó (ed.), Oxford\nand New York: Oxford University Press, pp. 15–44.</li>\n<li>Barfield, Owen, 1962, “Poetic Diction and Legal\nFiction,” in <em>The Importance of Language</em>, Max Black\n(ed.), Englewood Cliffs, New Jersey: Prentice-Hall, 1962,\n57–71.</li>\n<li>Beardsley, Monroe C., 1962, “The Metaphorical Twist,”\n<em>Philosophy and Phenomenological Research</em>, 22(3):\n293–307.</li>\n<li>Bezuidenhout, Anne, 2001, “Metaphor and What is Said: A\nDefense of a Direct Expression View of Metaphor,” <em>Midwest\nStudies in Philosophy</em>, 25(1): 156–86.</li>\n<li>–––, 2002, “Truth Conditional\nPragmatics,” <em>Philosophical Perspectives</em>, 16:\n105–34.</li>\n<li>Black, Max, 1954, “Metaphor,” <em>Proceedings of the\nAristotelian Society</em>, 55: 273–94.</li>\n<li>Blasko, Dawn G. and Cynthia M. Connine, 1993, “Effects of\nFamiliarity and Aptness on Metaphor Processing,” <em>Journal of\nExperimental Psychology: Learning, Memory, and Cognition</em> 19(2):\n295–308.</li>\n<li>Borg, Emma, 2004. <em>Minimal Semantics</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Boys-Stones, G.R. (ed.), 2003, <em>Metaphor, Allegory, and the\nClassical Tradition: Ancient Thought and Modern Revisions</em>, Oxford\nand New York: Oxford University Press.</li>\n<li>Bowdle, Brian F. and Dedre Gentner, 2005, “The Career of\nMetaphor,” <em>Psychological Review</em> 112(1):\n193–216.</li>\n<li>Brooke-Rose, Christine, 1958, <em>A Grammar of Metaphor,</em>\nLondon: Secker &amp; Warburg.</li>\n<li>Brooks, Cleanth, 1947, “The Heresy of Paraphrase,” in\n<em>The Well Wrought Urn: Studies in the Structure of Poetry</em>, New\nYork: Reynal &amp; Hitchcock, 1947, 192–214.</li>\n<li>Camp, Elisabeth, 2006, “Contextualism, Metaphor, and What is\nSaid,” <em>Mind &amp; Language</em>, 21(3): 280–309.</li>\n<li>–––, 2006. “Metaphor and That Certain\n‘Je Ne Sais Quoi’,” <em>Philosophical Studies</em>\n129(1): 1–25.</li>\n<li>–––, 2013, “Metaphor and Varieties of\nMeaning,” in <em>A Companion to Donald Davidson,</em> Ernest\nLepore and Kirk Ludwig (eds.), Hoboken: Wiley-Blackwell,\n361–78.</li>\n<li>Cappelen, Herman, and Ernie Lepore, 2005, <em>Insensitive\nSemantics: A Defense of Semantic Minimalism and Speech Act\nPluralism</em>, Oxford: Blackwell Publishing.</li>\n<li>Carston, Robyn, 2002, “The Pragmatics of On-Line Concept\nConstruction,” in <em>Thoughts and Utterances: The Pragmatics of\nExplicit Communication</em>, Malden, MA and Oxford: Blackwell\nPublishing, 320–75.</li>\n<li>Cavell, Stanley, 1969, “Aesthetic Problems of Modern\nPhilosophy,” in <em>Must We Mean What We Say? A Book of\nEssays</em>, New York: Charles Scribner’s Sons,\n73–96.</li>\n<li>Cicero, <em>De Oratore</em>, in <em>On the Ideal Orator</em>,\nJames M. May and Jakob Wisse (trans.), London and New York: Oxford\nUniversity Press, 2001.</li>\n<li>Clark, Billy, 2003, <em>Relevance Theory.</em> Cambridge and New\nYork: Cambridge University Press.</li>\n<li>Clark, Herbert H., 1992, “Making Sense of Nonce\nSense,” in <em>Arenas of Language Use</em>, Chicago and London:\nChicago University Press and CSLI, 305–40.</li>\n<li>Cohen, Ted, 1978, “Metaphor and the Cultivation of\nIntimacy,” <em>Critical Inquiry</em>, 5(1): 3–12.</li>\n<li>–––, 2008, <em>Thinking of Others: On the Talent\nfor Metaphor</em>, Princeton: Princeton University Press.</li>\n<li>Croft, William and D. Alan Cruse, 2004, <em>Cognitive\nLinguistics</em>, Cambridge and New York: Cambridge University\nPress.</li>\n<li>Currie, Gregory and Jacopo Frascaroli, 2021, “Poetry and the\nPossibility of Paraphrase,” <em>Journal of Aesthetics and Art\nCriticism</em> 79(4): 428–39.</li>\n<li>Dancygier, Barbara and Eve Sweetser. <em>Figurative Language</em>,\nCambridge: Cambridge University Press, 2014.</li>\n<li>Davidson, Donald, 1978, “What Metaphors Mean.”\n<em>Critical Inquiry</em>, 5(1) : 31–47. Reprinted in\n<em>Inquiries into Truth and Interpretation</em>, Oxford and New York:\nOxford University Press, 1984, 245–264.</li>\n<li>–––, 1986, “A Nice Derangement of\nEpitaphs,” in Truth and Interpretation: Perspectives on the\nPhilosophy of Donald Davidson, Ernest Lepore (ed.), Oxford and New\nYork: Blackwell, 433–46.</li>\n<li>–––, 2005, “Locating Literary\nLanguage,” in <em>Truth, Language, and History</em>, Oxford:\nClarendon Press, 167–181.</li>\n<li>Davis, Wayne A., 1998, <em>Implicature: Intention, Convention, and\nPrinciple in the Failure of Gricean Theory</em>, New York: Cambridge\nUniversity Press.</li>\n<li>Donnellan, Keith S., 1966, “Reference and Definite\nDescriptions”, <em>Philosophical Review</em>, 75(3):\n281–304.</li>\n<li>Donoghue, Denis, 2014, <em>Metaphor</em>, Cambridge, Massachusetts\nand London: Harvard University Press.</li>\n<li>Fauconnier, Gilles, 1994, <em>Mental Spaces: Aspects of Meaning\nConstruction in Natural Languages</em>, New York: Cambridge University\nPress.</li>\n<li>Fauconnier, Gilles, and Mark Turner, 1998, “Conceptual\nIntegration Networks,” <em>Cognitive Science</em>, 22(2):\n133–187.</li>\n<li>–––, 2002, <em>The Way We Think: Conceptual\nBlending and the Mind’s Hidden Complexities</em>, New York:\nBasic Books.</li>\n<li>Fogelin, Robert J., 1988, <em>Figuratively Speaking</em>, New\nHaven: Yale University Press. A revised edition was issued by Oxford\nUniversity Press in 2011.</li>\n<li>Frye, Northrop, 1957, <em>Anatomy of Criticism: Four Essays</em>,\nPrinceton: Princeton University Press.</li>\n<li>Gass, William H., 1972, “In Terms of the Toenail: Fiction\nand the Figures of Life,” in <em>Fiction and the Figures of\nLife</em>, New York: Vintage, 55–78.</li>\n<li>–––, 1975, <em>On Being Blue: A Philosophical\nInquiry</em>, Boston: David R. Godine.</li>\n<li>Geary, James, 2011, <em>I is an Other: The Secret Life of Metaphor\nand How it Shapes the Way We See the World</em>, New York:\nHarperCollins.</li>\n<li>Gibbs, Jr., Raymond W., 1994, <em>The Poetics of Mind: Figurative\nThought, Language, and Understanding</em>. Cambridge and New York:\nCambridge University Press.</li>\n<li>–––, 2017, <em>Metaphor Wars: Conceptual\nMetaphors in Human Life,</em> Cambridge and New York: Cambridge\nUniversity Press.</li>\n<li>Giora, Rachel, 2003, <em>On Our Mind: Salience, Context, and\nFigurative Language.</em> Oxford and New York: Oxford University\nPress.</li>\n<li>Glucksberg, Sam, 2001, <em>Understanding Figurative Language: From\nMetaphors to Idioms.</em> Oxford and New York: Oxford University\nPress.</li>\n<li>Glucksberg, Sam, Patricia Gildea, and Howard B. Booklin, 1982,\n“On Understanding Nonliteral Speech: Can People Ignore\nMetaphors?” <em>Journal of Verbal Learning and Verbal\nBehavior</em>, 21: 85–98.</li>\n<li>Goatly, Andrew 2011, <em>The Language of Metaphors,</em> 2nd ed.\nLondon and New York: Routledge.</li>\n<li>Goodman, Nelson, 1976, <em>Languages of Art</em>, Indianapolis:\nHackett Publishing Company.</li>\n<li>–––, 1979, “Metaphor as\nMoonlighting,” <em>Critical Inquiry</em>, 6(1):\n125–130.</li>\n<li>Grice, Herbert Paul, 1989, “Logic and Conversation, Lecture\n2” in <em>Studies in the Way of Words</em>, Cambridge,\nMassachusetts and London: Harvard University Press, 22–40.</li>\n<li>Guetti, James L., 1993, “Gambling With Language:\nMetaphor,” in <em>Wittgenstein and the Grammar of Literary\nExperience</em>, Athens: University of Georgia Press,\n122–146.</li>\n<li>Halliwell, Stephen, 2002, <em>The Aesthetics of Mimesis: Ancient\nTexts and Modern Problems</em>, Princeton and Oxford: Princeton\nUniversity Press.</li>\n<li>Hills, David, 1997, “Aptness and Truth in Verbal\nMetaphor,” <em>Philosophical Topics</em>, 25(1):\n117–153.</li>\n<li>–––, 2008, “Problems of Paraphrase:\nBottom’s Dream,” <em>Baltic International Yearbook of\nCognition, Logic, and Communication</em>, 3. URL=\n&lt;http://thebalticyearbook.org/journals/baltic/article/view/22/21&gt;</li>\n<li>–––, 2017, “The What and the How of\nMetaphorical Imagining, Part One.” <em>Philosophical\nStudies</em> 174(1): 13–31.</li>\n<li>Hollander, John, 1985, <em>Vision and Resonance: Two Senses of\nPoetic Form</em>, 2nd edition, New Haven: Yale University Press.</li>\n<li>Holyoak, Keith James, 2019, <em>The Spider’s Thread:\nMetaphor in Mind, Brain, and Poetry.</em> Cambridge, Massachusetts: MIT\nPress.</li>\n<li>Horn, Laurence R., 1988, <em>A Natural History of Negation</em>,\nChicago, University of Chicago Press, 1988. A reissue edition with a\nnew introduction was published by Stanford: CSLI Publications,\n2001.</li>\n<li>Kaplan, David, 1989, “Demonstratives,” in <em>Themes\nFrom Kaplan</em>, Joseph Almog, Howard K. Wettstein, and John Perry\n(eds.), New York: Oxford University Press, 481–563.</li>\n<li>Kirby, John T., 1997, “Aristotle on Metaphor,” <em>The\nAmerican Journal of Philology</em>, 118(4): 517–554.</li>\n<li>Kittay, Eva Feder, 1987, <em>Metaphor: Its Cognitive Force and\nLinguistic Structure</em>, Oxford and New York: Clarendon Press.</li>\n<li>Kövecses, Zoltán, 2010, <em>Metaphor: A Practical\nIntroduction,</em> 2nd ed. Oxford and New York: Oxford University\nPress.</li>\n<li>Kripke, Saul, 1977, “Speaker’s Reference and Semantic\nReference,” <em>Midwest Studies in Philosophy</em>, 2:\n255–276.</li>\n<li>Lakoff, George, 1993, “The Contemporary Theory of\nMetaphor.” In <em>Metaphor and Thought</em>, 2nd edition, Andrew\nOrtony (ed.), Cambridge: Cambridge University Press,\n202–251.</li>\n<li>Lakoff, George, and Mark Johnson, 2003, “Afterword,”\nin <em>Metaphors We Live By</em>, 2nd edition, Chicago and London:\nUniversity of Chicago Press, 170–190.</li>\n<li>Lamarque, Peter, 2015, “Semantic Finegrainedness and Poetic\nValue,” in <em>The Philosophy of Poetry,</em> John Gibson (ed.),\nOxford University Press, 18–36.</li>\n<li>Lee, David, 2001, <em>Cognitive Linguistics: An Introduction</em>,\nOxford and New York: Oxford University Press.</li>\n<li>Lepore, Ernie, 2009, “The Heresy of Paraphrase: When the\nMedium Really is the Message,” <em>Midwest Studies in Philosophy</em>,\n33(1): 177–97.</li>\n<li>Lepore, Ernie, and Matthew Stone, 2010, “Against Metaphorical\nMeaning,” <em>Topoi</em>, 29(2): 165–180.</li>\n<li>–––, 2015, <em>Imagination and Convention:\nDistinguishing Grammar and Inference in Language</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Levinson, Jerrold, 2001, “Who’s Afraid of a\nParaphrase?” <em>Theoria</em> 67(1): 7–23.</li>\n<li>Levinson, Stephen C., 2000, <em>Presumptive Meanings: The Theory\nof Generalized Conversational Implicature</em>, Cambridge, Massachusetts: MIT\nPress.</li>\n<li>Lewis, David, 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, Massachusetts: Harvard University Press.</li>\n<li>–––, 1979, “Scorekeeping in a Language\nGame,” <em>Journal of Philosophical Logic</em>, 8(1):\n339–357.</li>\n<li>Littlemore, Jeanette, 2019, <em>Metaphors in the Mind: Sources of\nVariation in Embodied Metaphor,</em> Cambridge: Cambridge University\nPress.</li>\n<li>Lloyd, G.E.R., 1996, “The Metaphors of Metaphors,” in\n<em>Aristotelian Explorations</em>, Cambridge: Cambridge University\nPress, 205–222.</li>\n<li>Martinich, A.P., 1984, “A Theory for Metaphor,”\n<em>Journal of Literary Semantics</em>, 13(1): 35–56.</li>\n<li>Montague, Richard, 1974, <em>Formal Philosophy; Selected Papers of\nRichard Montague</em>, Richmond H. Thomason (ed.), New Haven: Yale\nUniversity Press.</li>\n<li>Moran, Richard, 1989, “Seeing and Believing: Metaphor,\nImage, and Force,” <em>Critical Inquiry</em>, 16(1):\n87–112.</li>\n<li>–––, 1996, “Artifice and Persuasion: The\nWork of Metaphor in the <em>Rhetoric</em>,” in <em>Essays on\nAristotle’s Rhetoric</em>, Amelie Rorty (ed.), Berkeley:\nUniversity of California Press.</li>\n<li>Nowottny, Winifred, 1962, <em>The Language Poets Use</em>, New\nYork: Oxford University Press.</li>\n<li>Ortony, Andrew, 1979, “The Role of Similarity in Similes and\nMetaphors,” in <em>Metaphor and Thought</em>, 1st edition,\nAndrew Ortony (ed.), Cambridge: Cambridge University Press,\n186–201.</li>\n<li>Ortony, Andrew, Diane L. Schallert, Ralph E. Reynolds, and Stephen\nJ. Antos, 1978, “Interpreting Metaphors and Idioms: Some\nEffects of Context on Comprehension,” <em>Journal of Verbal\nLearning and Verbal Behavior</em>, 17(4): 465–77.</li>\n<li>Quintilian, <em>Institutio Oratoria</em>, in <em>The\nOrator’s Education</em>, 5. vols, Donald A. Russell (trans.),\nLoeb Classical Library, Cambridge, Massachusetts and London: Harvard\nUniversity Press, 2001.</li>\n<li>Recanati, François, 2004, <em>Literal Meaning</em>,\nCambridge and New York: Cambridge University Press.</li>\n<li>Reimer, Marga, 1996, “The Problem of Dead Metaphor,”\n<em>Philosophical Studies</em>, 82(1): 13–25.</li>\n<li>–––, 2001, “Davidson on Metaphor,”\n<em>Midwest Studies in Philosophy</em>, 25(1): 142–156.</li>\n<li>–––, 2004, “What Malapropisms Mean: A\nReply to Donald Davidson,” <em>Erkenntnis</em>, 60(3):\n317–334.</li>\n<li>Reimer, Marga and Elisabeth Camp, 2008, “Metaphor,” in\n<em>Oxford Handbook of the Philosophy of Language,</em> Ernest Lepore\nand Barry C. Smith (eds.), Oxford: Oxford University Press,\n845–63.</li>\n<li>Richards, Ivor A., 1936, <em>The Philosophy of Rhetoric</em>,\nLondon and New York: Oxford University Press.</li>\n<li>Richie, L. David, 2013, <em>Metaphor (Key Topics in Semantics and\nPragmatics)</em>, Cambridge and New York: Cambridge University\nPress.</li>\n<li>Ricoeur, Paul, 1978, “The Metaphorical Process as Cognition,\nImagination, and Feeling,” <em>Critical Inquiry</em>, 5(1):\n143–159.</li>\n<li>–––, 1977, <em>The Rule of Metaphor:\nMulti-Disciplinary Studies of the Creation of Meaning in\nLanguage</em>, Robert Czerny (trans.), Toronto and Buffalo: University\nof Toronto Press.</li>\n<li>Saul, Jennifer M., 2001, “Review of Wayne A. Davis,\n<em>Implicature: Intention, Convention, and the Failure of Gricean\nTheory</em>,” <em>Noûs</em>, 35(4): 630–641.</li>\n<li>Scott, Kate, Billy Clark, and Robyn Carston, eds, 2019, <em>Relevance,\nPragmatics and Interpretation: Essays in Honour of Deirdre\nWilson.</em> Cambridge: Cambridge University Press.</li>\n<li>Scott, William C., 2006, “Similes in a Shifting Scene:\n<em>Iliad</em>, Book 11,” <em>Classical Philology</em>, 101(2):\n103–114.</li>\n<li>Searle, John R., 1979a, “Metaphor,” in <em>Expression\nand Meaning: Studies in the Theory of Speech Acts</em>, Cambridge and\nNew York: Cambridge University Press, 76–116.</li>\n<li>–––, 1979b, “Literal Meaning,” in\n<em>Expression and Meaning: Studies in the Theory of Speech Acts</em>,\nCambridge and New York: Cambridge University Press, 117–36.</li>\n<li>Skulsky, Harold, 1986, “Metaphorese.”\n<em>Noûs</em>, 20(3): 351–69.</li>\n<li>–––, 1992, <em>Language Recreated:\nSeventeenth-Century Metaphorists and the Act of Metaphor</em>, Athens:\nUniversity of Georgia Press.</li>\n<li>Sparshott, Francis E., 1974, “ ‘As,’ Or the\nLimits of Metaphor,” <em>New Literary History</em>, 6(1):\n75–94.</li>\n<li>Sperber, Dan, and Deirdre Wilson, 1985, “Loose Talk,”\n<em>Proceedings of The Aristotelian Society</em>, 86:\n153–171.</li>\n<li>–––, 1995, <em>Relevance: Communication and\nCognition</em>, 2nd edition, Oxford and Cambridge, Massachusetts: Blackwell.</li>\n<li>–––, 2008, “A Deflationary Account of\nMetaphors,” in <em>The Cambridge Handbook of Metaphor and\nThought</em>, Raymond W. Gibbs, Jr. (ed.), Cambridge and New York:\nCambridge University Press, 84–105.</li>\n<li>Stalnaker, Robert, 1999, <em>Context and Content: Essays on\nIntentionality in Speech and Thought</em>, Oxford and New York: Oxford\nUniversity Press.</li>\n<li>Stanley, Jason, 2007, <em>Language in Context: Selected\nEssays</em>, Oxford: Oxford University Press.</li>\n<li>Stern, Josef, 2000, <em>Metaphor in Context</em>, Cambridge,\nMassachusetts: MIT Press.</li>\n<li>Stryk, Lucien, and Takashi Ikemoto, 1995, <em>Zen Poetry: Let the\nSpring Breeze Enter</em>, New York: Grove Press.</li>\n<li>Travis, Charles, 2008, “Introduction,” in\n<em>Occasion-Sensitivity: Selected Essays</em>, Oxford and New York:\nOxford University Press, 1–16.</li>\n<li>Turbayne, Colin Murray, 1970, <em>The Myth of Metaphor,</em> rev\ned., Columbia, South Carolina: University of South Carolina Press.\nFirst published by Yale University Press in 1962.</li>\n<li>Turner, Mark, 1998, “Figure,” in <em>Figurative\nLanguage and Thought</em>, Albert N. Katz (ed.), New York and Oxford:\nOxford University Press, 44–87.</li>\n<li>Tversky, Amos, 1977, “Features of Similarity,”\n<em>Psychological Review</em>, 84(4): 327–352.</li>\n<li>Walton, Kendall L, 1990, <em>Mimesis as Make-Believe: On the\nFoundations of the Representational Arts</em>, Cambridge,\nMassachusetts and London: Harvard University Press.</li>\n<li>–––, 1993, “Metaphor and Prop Oriented\nMake-Believe,” <em>European Journal of Philosophy</em>, 1(1):\n39–57.</li>\n<li>White, Roger M., 1996, <em>The Structure of Metaphor: The Way the\nLanguage of Metaphor Works</em>, Oxford and Cambridge, MA:\nBlackwell.</li>\n<li>Wilson, Deirdre, and Dan Sperber, 2002, “Truthfulness and\nRelevance,” <em>Mind</em>, 111(443): 583–632.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, General Topics: rhetoric",
            "cognition: embodied",
            "Davidson, Donald",
            "descriptions",
            "fictionalism",
            "Grice, Paul",
            "Hamann, Johann Georg",
            "implicature",
            "Kuhn, Thomas",
            "Plato: rhetoric and poetry",
            "pragmatics",
            "Ricoeur, Paul",
            "speech acts"
        ],
        "entry_link": [
            {
                "../aristotle-rhetoric/": "Aristotle, General Topics: rhetoric"
            },
            {
                "../embodied-cognition/": "cognition: embodied"
            },
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../fictionalism/": "fictionalism"
            },
            {
                "../grice/": "Grice, Paul"
            },
            {
                "../hamann/": "Hamann, Johann Georg"
            },
            {
                "../implicature/": "implicature"
            },
            {
                "../thomas-kuhn/": "Kuhn, Thomas"
            },
            {
                "../plato-rhetoric/": "Plato: rhetoric and poetry"
            },
            {
                "../pragmatics/": "pragmatics"
            },
            {
                "../ricoeur/": "Ricoeur, Paul"
            },
            {
                "../speech-acts/": "speech acts"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=metaphor\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/metaphor/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=metaphor&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/metaphor/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=metaphor": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/metaphor/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=metaphor&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/metaphor/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.bbc.co.uk/programmes/b00w227c\" target=\"other\">A history of metaphor</a>,\n BBC Radio 4 program produced by Thomas Morris.",
            "<a href=\"http://web.archive.org/web/20110716110429/http://cogsci.berkeley.edu/lakoff/\" target=\"other\">Conceptual Metaphor Home Page</a>,\n archived copy of a webpage that was maintained by George Lakoff (U.\nCalifornia/Berkeley).",
            "<a href=\"https://www.frontiersin.org/articles/10.3389/fnhum.2014.00958/full\" target=\"other\">Mapping the Brain’s Metaphor Circuitry: Metaphorical Thought in Everyday Reason,</a>\n A review article by George Lakoff for <em>Frontiers in Human\nNeuroscience,</em> Dec 16 2014.",
            "<a href=\"https://www.youtube.com/watch?v=A0edKgL9EgM\" target=\"other\">The Art of the Metaphor,</a>\n a TED-Ed Lesson by Jane Hirschfeld.",
            "<a href=\"https://www.youtube.com/watch?v=2cU56SWXHFw\" target=\"other\">Metaphorically Speaking,</a>\n a TED Talk by James Geary.",
            "<a href=\"https://www.youtube.com/watch?v=i5EmZh_Obi8\" target=\"other\">Liz Camp on Metaphor,</a>\n a Phil 101 Episode.",
            "<a href=\"https://www.oxfordbibliographies.com/view/document/obo-9780199828340/obo-9780199828340-0244.xml?rskey=5q4cvp&amp;result=1&amp;q=metaphor#firstMatch\" target=\"other\">Psychological Perspectives on Metaphor</a>,\n an Oxford Bibliography by Brian Bowdle.",
            "<a href=\"https://www.oxfordbibliographies.com/view/document/obo-9780195396577/obo-9780195396577-0362.xml?rskey=5q4cvp&amp;result=2&amp;q=metaphor#firstMatch\" target=\"other\">Metaphor,</a>\n an Oxford Bibliography by David Hills.",
            "<a href=\"https://www.oxfordbibliographies.com/view/document/obo-9780199772810/obo-9780199772810-0167.xml?rskey=5q4cvp&amp;result=3&amp;q=metaphor#firstMatch\" target=\"other\">Metaphor,</a>\n an Oxford Bibliography by Mark Johnson."
        ],
        "listed_links": [
            {
                "http://www.bbc.co.uk/programmes/b00w227c": "A history of metaphor"
            },
            {
                "http://web.archive.org/web/20110716110429/http://cogsci.berkeley.edu/lakoff/": "Conceptual Metaphor Home Page"
            },
            {
                "https://www.frontiersin.org/articles/10.3389/fnhum.2014.00958/full": "Mapping the Brain’s Metaphor Circuitry: Metaphorical Thought in Everyday Reason,"
            },
            {
                "https://www.youtube.com/watch?v=A0edKgL9EgM": "The Art of the Metaphor,"
            },
            {
                "https://www.youtube.com/watch?v=2cU56SWXHFw": "Metaphorically Speaking,"
            },
            {
                "https://www.youtube.com/watch?v=i5EmZh_Obi8": "Liz Camp on Metaphor,"
            },
            {
                "https://www.oxfordbibliographies.com/view/document/obo-9780199828340/obo-9780199828340-0244.xml?rskey=5q4cvp&result=1&q=metaphor#firstMatch": "Psychological Perspectives on Metaphor"
            },
            {
                "https://www.oxfordbibliographies.com/view/document/obo-9780195396577/obo-9780195396577-0362.xml?rskey=5q4cvp&result=2&q=metaphor#firstMatch": "Metaphor,"
            },
            {
                "https://www.oxfordbibliographies.com/view/document/obo-9780199772810/obo-9780199772810-0167.xml?rskey=5q4cvp&result=3&q=metaphor#firstMatch": "Metaphor,"
            }
        ]
    }
}