{
    "url": "michel-henry",
    "title": "Michel Henry",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Frédéric Seyler\n<fseyler@depaul.edu>",
        "author_links": [
            {
                "mailto:fseyler%40depaul%2eedu": "fseyler@depaul.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nFrédéric Seyler\n&lt;<a href=\"mailto:fseyler%40depaul%2eedu\"><em>fseyler<abbr title=\" at \">@</abbr>depaul<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Oct 7, 2016",
        "substantive revision Wed Sep 30, 2020"
    ],
    "preamble": "\n\nMichel Henry (1922–2002) developed a radically revised approach\nto phenomenology through a critical reading of the phenomenological\ntradition (especially of Husserl and Heidegger).  Henry named his\napproach “phenomenology of life” and, before that,\n“material phenomenology” or “radical\nphenomenology”. He was, in part, influenced by the work of Maine\nde Biran. Perhaps the most characteristic, as well as most\ncontroversial, feature of Henry’s phenomenology of life is that\nit grounds intentionality in a pre-intentional form of appearing,\nnamely immanent affectivity or “life”. In the last period\nof his work (1992–2002), Henry developed a philosophy of\nreligion and Christianity based on his phenomenology. He is widely\nrecognized as one of the major figures of 20th-century\nFrench phenomenology.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Work"
        },
        {
            "#PhenLifeConcTranAffe": "2. Phenomenology of Life and the Concept of Transcendental Affectivity"
        },
        {
            "#CritInteOntoMoni": "2.1 The Critique of Intentionality and of Ontological Monism"
        },
        {
            "#SourHenrPhen": "2.2 Sources of Henry’s Phenomenology"
        },
        {
            "#LifeLiviPhilChri": "2.3 Life and the Living: Philosophy of Christianity"
        },
        {
            "#Aest": "3. Aesthetics"
        },
        {
            "#ApplPhenArtAest": "3.1 Applied Phenomenology: Art and Aesthetics"
        },
        {
            "#HenrPhenReadKand": "3.2 Henry’s Phenomenological Reading of Kandinsky"
        },
        {
            "#PartArtFormMusiLite": "3.3 Particular Art Forms: From Music to Literature"
        },
        {
            "#EthiPoliPhil": "4. Ethics and Political Philosophy"
        },
        {
            "#ArtIntrEthi": "4.1 Art as Intrinsically Ethical"
        },
        {
            "#CritContCultBarb": "4.2 The Critique of Contemporary Culture as “Barbarism”"
        },
        {
            "#ChriEthiRecoAbsoLife": "4.3 Christian Ethics as Recognition of Absolute Life"
        },
        {
            "#PoliPhil": "4.4 Political Philosophy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#WorkMichHenr": "Works by Michel Henry"
        },
        {
            "#PrinWork": "Principal Works"
        },
        {
            "#Nove": "Novels"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#SeleWork": "Selected Works"
        },
        {
            "#SpecEditPeri": "Special Edition Periodicals"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Work\n\nMichel Henry was born on January 10, 1922 in Haiphong, Vietnam (then,\nFrench Indochina). After the accidental death of his father, the\nfamily returned to Paris in 1929. In Paris, Henry became a student at\nthe prestigious Lycée Henri IV, then graduated with a Master\nthesis on Spinoza in 1943 with Jean Grenier as director. Soon after\nhaving turned in his thesis, partially published in the Revue\nd’histoire de la philosophie et d’histoire\ngénérale de la civilisation in 1944 and 1946, Henry\njoined the French Resistance and was assigned to the\n“Pericles” division in the region of Haut Jura. He\nreturned to Paris at the end of 1944, obtaining the\nAgrégation in philosophy in 1945. As a researcher at\nthe French National Research Center CNRS and the Fondation\nThiers, he began working under the supervision of both Jean Wahl\nand Jean Hyppolite on his Ph.D. thesis, which would be published in\n1963 and become one of his major works: The Essence of\nManifestation. His second book, Philosophy and Phenomenology\nof the Body, although published two years later, was already\nfinished around 1950, having first been planned as a part of the main\nthesis but, due to its length, was presented as Henry’s\nsecondary thesis (a requirement in the French academic system at that\ntime). In 1963, the dissertation committee, composed of Jean Wahl,\nJean Hyppolite, Ferdinand Alquié, Paul Ricoeur, and Henri\nGouhier, was impressed by Henry’s main Ph.D. thesis, a work that\ntranslates almost a decade of research into more than 900 pages of\ncomplex philosophical argument. Preferring a position in southern\nFrance to one at the Sorbonne, Henry had already been appointed to the University\nof Montpellier in 1960 where he remained a professor until his\nretirement in 1982. He devoted his entire philosophical career to the\ndevelopment of his phenomenology of life with, among other\npublications, Marx (1976), Genealogy of\nPsychoanalysis (1985), Seeing the Invisible (1988),\nMaterial Phenomenology (1990), I Am the Truth\n(1996), Incarnation (2000). In addition, he authored four\nnovels, one of which—L’amour les yeux\nfermés—was awarded the Prix Renaudot in\n1976. He died on July 3, 2002 in Albi, France. \n2. Phenomenology of Life and the Concept of Transcendental Affectivity\n\nSince the publication of the Essence of Manifestation in\n1963, Henry’s entire oeuvre was devoted to the systematic\ndevelopment of a phenomenology that, while constituting itself within\nthe phenomenological tradition, criticizes substantially not only\nclassical Husserlian phenomenology but also the works of some of\nHusserl’s most famous successors: Heidegger, Sartre and\nMerleau-Ponty. The originality of Henry’s phenomenology lies in\nthe fact that it considers intentionality to be only one of two modes\nof appearing. In other words, Henry argues that the way in which\nphenomena appear to us cannot be restricted to the\n“consciousness of something” as classical phenomenology\nwould suggest. On the contrary, for Henry, intentional consciousness\nmust be founded in a more fundamental mode of appearing that\nis precisely non- and even pre-intentional and that\ntherefore essentially differs from intentionality. It is this\nfundamental mode of appearing that Henry designates as\n“affectivity”, “pathos” or\n“life”.\n2.1 The Critique of Intentionality and of Ontological Monism\n\nIf Henry’s critique of intentionality is construed through a\ncritique of Husserlian phenomenology, it nevertheless comports a much\nwider perspective that includes a “deconstruction” of the\nhistory of philosophy in general, insofar as the latter relies on a\nlimited concept of appearing or phenomenality. Every philosophy, Henry\nargues, relies on phenomenological presuppositions and, therefore,\n“a critique of phenomenality necessarily concerns philosophy in\ngeneral” (PNI 105). Phenomenality as such, however, is the\nobject of phenomenology. As Husserl notes in, for instance, his\nGöttingen Lectures of 1905, phenomenology is concerned with\nhow objects are given (Gegenstände im\nWie, Husserl [GW]: 117). The mode of givenness, i.e.,\nappearing itself, is therefore what phenomenology must\ninvestigate. For Henry, however, this line of thought must be taken\none step further to include the fact that appearing itself must\nappear. Since things are devoid of the ability to become phenomena by\nthemselves, Henry argues, that which makes them appear has itself to\nappear. Otherwise, nothing would appear at all (PNI 107–8). As a\nresult, phenomenology cannot be reduced to a method that would make us\nsee how things appear to us.  Instead it finds its proper object with\nthe question “How does appearing appear?” According to\nHenry’s reading of the phenomenological tradition, however, we\nare faced with a very peculiar situation where intentionality is\nconsidered the sole mode of appearing.\n\nSince intentionality is, as Sartre emphasized, always consciousness of\nsomething other than consciousness itself, appearing becomes\n“ek-static” by its very essence, i.e., it points to\nsomething exterior to itself. This leads in turn to replace the\nquestion of appearing with that of the appearing of entities\nor beings and, finally, centers the focus of phenomenology on\nbeings (étants) insofar as they\nappear. This tendency, an “ontological monism” that\naccording to Henry has pervaded most of the history of philosophy,\nleads to a reduction of human subjectivity to the sole function of\nbeing directed outward, and thus to equate it with the exteriority or\n“transcendence of the world” (EM 89). Henry does not deny\nthat decisive results were achieved through the perspective of\nintentionality, notably in Husserl’s investigations into\nnoetic-noematic correlation (I 91). His question however is that of\nintentionality itself, i.e., the transcendental question\nregarding the conditions that make intentionality possible. If\nintentionality gives access to objects, how do we access\nintentionality itself and is such an access also intentional? In other\nwords, is the way through which intentionality is given homogenous to\nthe way objects are given? The problem with a philosophical horizon\nconstituted by ontological monism is that it presupposes “the\nunderstanding of the essence of manifestation as representation”\nand, thus, makes “inaccessible to philosophical thought the\nvery idea of a reception which would not be essentially the reception\nof an exterior content” (EM 237).\n\nFor Henry, the answer to the question of homogeneity is clearly\nnegative. If intentionality enables us “to see”, in the\nsense of sight pertaining to consciousness in general, then we must\nbear in mind that the act of seeing is not itself seen—on the\ncontrary, it escapes sight. As a result, an intentional act is not\nprimarily given in an intentional way. Or, in the language of the\nEssence of Manifestation, we must admit “the\nimpossibility for transcendence to lay its own foundation and thus to\nconstitute the essence of the foundation” (EM 210). \n\nMoreover, if we take seriously the claim that appearing itself must\nappear, then in order to avoid an infinite regress such appearing\nwould have to be self-appearing\n(auto-apparaître). Intentionality, however, since it\npoints toward and reveals something other than itself, cannot fulfill\nthis task of self-revelation. Thus, Henry concludes that the\nfundamental mode of appearing, namely the self-appearing of appearing,\ncannot have an intentional structure. It must be non-intentional and,\nsince intentionality is tied to visibility in the general sense of\nperception (or representation), invisible. In other words,\nthe origin and the essence of manifestation—the\n“archi-revelation”\n(Archi-Révélation) as Henry will put it later\nin Genealogy of Psychoanalysis for instance—is a\nself-revelation or, in the terminology forged as early as the\nEssence of Manifestation, an auto-affection that\nrefers to nothing but itself.\n\nIn Henry, “life” (vie) has therefore no\nbiological meaning, but an exclusively phenomenological one, which\nmeans that it refers to this fundamental mode of appearing that is, as\nself-appearing, radically distinct from the ek-static nature of\nintentionality. It is not the opening to an other, but enclosed in\nitself, undergoing itself in self-experience (épreuve de\nsoi that Henry distinguishes from conscience de soi,\nself-awareness), which is precisely for Henry the condition of\npossibility of any experience of an other or\nhetero-affection. As Henry intends to illustrate in\nBarbarism through the somewhat ironic example of a biology\nstudent, none of the forms of intentional directedness—including\nthe most elaborate forms of scientific knowledge—would be\npossible if they weren’t revealed as such to a living subject\nthat is characterized by auto-affection or, better yet, that\nis auto-affection. Henry also uses the term\n“transcendental affectivity” to characterize this\nself-appearing proper to his phenomenological concept of life: it is\ntranscendental in the sense that it is the condition of\npossibility of every possible phenomenon, and it is\naffectivity because the self-experience that characterizes\nthe living (vivant) is a form of primal suffering\n(souffrir originaire) or pathos.\n\n“Pathos” refers to the fact that, because of its\nself-enclosed nature, such an experience cannot cease to adhere to\nitself. But, like the flip side of a coin, this self-adherence is also\nthe condition for the greatest joy, namely the joy of living. Joy and\nsuffering are thus fundamental tonalities that both express the fact\nthat life cannot escape from itself, that it is irremediably tied to\nitself. This explains for instance why the concrete experience of\nsuffering can become unbearable. Henry’s analysis of appearing\nis, as one can see, connected to the question of the subject\nof appearing: phenomena only exist for a subject, and subjectivity is\nprecisely conceived of as life, i.e., as the essence and origin of\nevery possible phenomenon. At the same time, and because of its\nauto-affective nature, subjectivity is marked by the fundamental\ntonalities of joy and suffering.\n\nHenry’s approach to phenomenology could be characterized further\nas “hyletic”, in reference to Husserl’s concept of\nhylè (primal impressions, raw sensuous-data as matter\nfor consciousness), with one important difference however. Whereas for\nHusserl hylè is raw matter destined to be shaped into\nan intentional form (morphè) and only becomes a\nphenomenon through this shaping, Henry’s “material\nphenomenology” reverses the relation between\nhylè and morphè by 1) giving to\nhylè its own form of (self-)appearing as affectivity,\nindependently from intentionality; and 2) grounding intentionality in\naffectivity, the latter becoming the transcendental condition of the\nformer. As Henry writes in Material Phenomenology (1990):\n\n\nThis self-givenness […] is structurally different from\n“relating-to”. It is not in itself a\n“relating-to” but insurmountably excludes it from itself.\nIt is not outside of itself but in itself, not transcendence but\nradical immanence. And it is only on the basis of this radical\nimmanence that something like transcendence is possible. Seeing is\nactualized only as a nonseeing […]. This nonseeing, this\nunseen, this invisible, is not the unconscious. It is not the negation\nof phenomenality but its first phenomenalization. It is not a\npresupposition but rather our life in its non-ek-static but yet\nundeniable pathos. (MP 81)\n\n\nConsequently, Henry understands his phenomenology as being a radical\ndeparture from monism insofar as it advocates the “duplicity of\nappearing”. If a non-intentional self-appearing is necessary in\norder for intentionality to be possible, than there are indeed two\nmodes of appearing: an intentional appearing that operates by means of\ndifference and that constitutes the intentional object as\ntranscendent; and a non-intentional or “affective”\nappearing (apparaître pathétique, which\nwould—in opposition to “ek-static\nappearing”—literally translate as “pathetic\nappearing”, an expression that remains controversial among Henry\ntranslators) that is given in pure immanence prior to any\nsubject-object division. \n2.2 Sources of Henry’s Phenomenology\n\nFrom the perspective of the history of philosophy, a critique of\nmonism amounts to a critique of most philosophies, and Henry\nrecognizes only a few precursors as having a presentiment of the\nimmanence pertaining to life as self-appearing. One clear case is\nFrench philosopher Maine de Biran (1766–1824), whose work\ninspired Henry’s second book Philosophy and Phenomenology of\nthe Body (1965), explicitly subtitled: Essay in Biranian\nOntology. Through Biran’s “sense of effort”,\nHenry connects the theme of the original essence of manifestation to\nthat of the subjective body as locus of immanent affectivity (see\nKühn 1992). Although it appeared after the Essence of\nManifestation, it is interesting to note that the Biran-book was\noutlined before the Essence and originally planned as a part\nof this more comprehensive work. Considering Biran’s influence on Henry, especially in the light of Henry’s handwritten notes (now available at the Henry-Archive at the University of Louvain-la-Neuve), the phenomenology of life has been conceived of as “phenomenological vitalism” (see Jean 2015). This thesis, however, has not been widely echoed by Henry scholars (for a critique: see Kühn 2019), in part because it relies on notes that Henry himself chose not to publish. \n\nAs for the Essence of Manifestation itself, it finds a\nprecursor concerning the structure of immanence in the works of\nMeister Eckhart and, though to a lesser extent, in the concept of love\nin Fichte’s Die Anweisung zum seligen Leben oder auch die\nReligionslehre (The Way Towards the Blessed Life or The\nDoctrine of Religion) of 1806. Other authors will be interpreted\nin a similar way by Henry: Marx (1976), but also\nSchopenhauer, Nietzsche and Freud in the 1985 Genealogy of\nPsychoanalysis. In the same book, Henry develops an\ninterpretation of Descartes’ Cogito that cannot be overestimated\nin its importance for Henry’s project insofar as it is\nrepeatedly used to introduce Henry’s own concept of the\nphenomenological reduction as “counter-reduction”, most\nnotably in Section 18 of Incarnation. As for Spinoza, J.-M.\nLongneaux (2004) has defended the thesis of a Spinozism in Henry, who\ndevoted his Master thesis to the concept of happiness in\nSpinoza. However, because Henry almost never again refers to Spinoza\nafter this early work (the subject of which was imposed by his\nthesis-advisor) and will even explicitly distance himself from\nSpinoza’s rationalism, it seems unlikely that Spinoza\nconstitutes an important source for Henry’s phenomenology,\ndespite Longneaux’ arguments. The writings of Husserl and\nHeidegger have played a decisive role in the elaboration of what Henry\ntermed the “phenomenology of life”. but as can be seen\nfrom the critique of intentionality and the emphasis on immanence\nagainst the Heideggerian theme of being-in-the-world, their influence\noperates “by contrast”, which means that Henry will\ndevelop his phenomenology through a series of oppositions to the\nthought of Husserl and Heidegger rather than in accordance with\nthem.\n\nIn the last phase of Henry’s work, however, another source of\nWestern thought came to the foreground, namely Christianity.\nParadoxically, it was before he developed his philosophy of\nChristianity that Henry was targeted (along with Levinas, J.-L. Marion\nand J.-L. Chrétien) by D. Janicaud’s critique of what he\npolemically termed the “theological turn” in French\nphenomenology (Janicaud 1991). Janicaud’s critique is, in fact,\nnot so much directed against an explicit reference to\n“theology” in phenomenology (which is why the term\n“theological turn” is polemical and, in a way,\nmisleading), but against an attempt to radicalize phenomenology beyond\nthe scope of object manifestation and intentionality. One can\ntherefore read Janicaud’s essay as advocating in favor of a\n“minimalistic phenomenology” or “surface\nphenomenology” that remains inside such a scope. However, as\nZahavi has pointed out, practically all of the major phenomenological\nthinkers cross such boundaries, especially as they seek to approach\nthe core of subjectivity as well as “the\nphenomenological question concerning the condition of possibility for\nmanifestation” (Zahavi 1999: 236). One can therefore interpret\nHenry’s explicit “turn” toward a philosophy of\nChristianity as his reaffirmation of the possibility of a radicalized\nphenomenology in which such a philosophy is grounded (see also Capelle\n2004).\n2.3 Life and the Living: Philosophy of Christianity\n\nWith the publication of I Am the Truth. Toward a Philosophy of\nChristianity in 1996, phenomenology of life was extended to a\nphilosophical reading of Christianity. This “extension”\nwas already announced in 1992 with a talk given at the Ecole Normale\nSupérieure under the title “Parole et religion: La parole\nde Dieu” (“Speech and Religion: The Word of God”)\nwhich contains—sometimes word for word—some of the main\ntheses that will be developed in I Am the Truth. Incarnation\n(2000) and Words of Christ (2002) continue to pursue the\nproject of a philosophy of Christianity by focusing on the concepts of\nflesh and revelation, respectively. But what does a philosophical or\neven a phenomenological “reading” of Christianity mean\nhere? To be sure, Henry’s philosophical approach does not rely\non religious faith in the sense that his phenomenology of life would\npresuppose Christian faith. It is rather the other way\naround: as Henry himself admitted, it is the development of his\nphenomenology that led him to discover in the Scriptures an intuition\nof life that, although written in a non-philosophical language,\ncorresponds to his own phenomenological concept of immanent\naffectivity.\n\nFrom a philosophical perspective, the turning point that leads Henry\nto his interpretation of Christianity is the need to account for\nindividual subjectivity as rooted in life, a life that is\ncommon to all the living and therefore transcends the living\nwhile remaining at the same time immanent. This aspect is present in\nHenry’s thought long before he turns toward a philosophy of\nChristianity, when, following Kierkegaard, he repeatedly emphasizes\nthat the “me” is not its own foundation. This is why\nauto-affection is, for Henry, essentially tied to a form of passivity:\nsubjectivity is characterized by a dimension of suffering, i.e., of\npathos, without which it would simply not be living\nsubjectivity. Subjective powers of the “I can” therefore\nalways refer to a deep-seated and original powerlessness of a life\nthat cannot escape from itself. It is this relation between the living\nand life that Henry seeks to describe through the concept of\n“transcendental birth”.\n\nTranscendental birth, which is identical to the birth of subjectivity,\ncannot be understood with reference to the world, for\ninstance as “being-in-the-world”. Henry argues: \n\n\nin the world and in the externality of its “outside”,\nno “Living” is possible—and consequently no livings\neither (IAT 71) \n\n\nIn other words, the status of auto-affection as immanent\nself-appearing—i.e., Henry’s definition of transcendental\nsubjectivity or ipseity (from ipse, self)—cannot be\nengendered by something of an entirely different nature (the\nexteriority or “externality” of the world), but must be\nengendered “within” auto-affection itself, i.e., within\nand through life.\n\nLife as capable of engendering the form of ipseity is, for Henry,\nabsolute life, which transcends each individual living being.\nSubjective powers described by the “I can” thus take place\nwhen the “I” is given to itself in auto-affection. By\nengendering individual life, absolute life engenders in fact itself.\nThis is, however, only possible in the form of ipseity, since life,\nfor Henry, equates with auto-affection, which in turn equates with\nipseity. In the language of Christianity, absolute life is God and the\noriginal form of ipseity (or “archi-ipseity”) is Christ as\nthe “First living” (Premier vivant).\n\nIn Henry’s phenomenological terminology, the process of\nself-engendering reflects a transcendence in immanence:\nwithin the immanence of auto-affection, it is in fact absolute life\nthat affects itself through each living individual (see Lavigne 2009). Or, as Henry also\nputs it, absolute life gives itself to itself through the\nindividuality of the living and it is only through such\n“participation” that the latter can be said to be alive. This also leads Henry to distinguish an auto-affection in the strong sense (i.e. pertaining to absolute life) from an auto-affection in the weak sense (i.e. pertaining to the individual living being).\nThe relation of the living to absolute life is thus described by Henry\nas a relation of “sonship” (filiation), whereby\ntranscendental birth does not denote a singular event but a stable\ncondition, namely the human condition as “son of\nabsolute Life”. Life’s self-engendering is here understood\nas a continuous process, a movement of life’s “eternal\ncoming forth in itself” (IAT 55) which thereby supports the life\nof each individual living. The living is thus understood as being\ncontinuously “traversed by Life”, a condition, however,\nthat, being strictly immanent, can be “forgotten” by the\nindividual living being—an aspect that will play a fundamental\nrole in Henry’s ethical perspective (see\n Section 4.2).\n3. Aesthetics\n\nBesides Henry’s book on Kandinsky (Seeing the Invisible\n1988), a 1996 interview with M. Huhl and J.-M. Brohm, published under\nthe title “Art et phénoménologie de la vie”\n(“Art and Phenomenology of Life”) is the best overview of\nHenry’s position with regard to aesthetics and the philosophy of\nart. This interview not only shows how Henry applies the principles of\nhis phenomenology of life to art and aesthetics, but also illustrates\nsuch an application in the fields of painting—including the\nimportance given to Kandinsky’s artistic work and\ntheory—music, architecture, and literature.\n3.1 Applied Phenomenology: Art and Aesthetics\n\nAccording to a phenomenological theme that Henry traces back to\nHusserl and Heidegger, the world is not limited to any existing world,\nbut includes in itself the possibility of creating new fields of\nexperience for the human. Art would thus be such a possibility,\ninsofar as the artist surpasses “habitual facticity” and\nestablishes through the work of art a dimension of being that is\n“absolutely specific” and “original”. Above\nall art reveals, through its ability to create a new ontological\ndimension, a more fundamental reality than the world itself, namely\n“the possibility of world” as such. In this sense, art\nreveals that which is ordinarily concealed: “a pure appearing\nthat brings things into visibility” (AP 284). In other words, if\nthings are given to us in an immediate way—when we perceive\nbodies and, to a certain extent, our own body—such thematic\ngivenness is only possible because space is given in a non-thematic\nway, as Kant’s Transcendental Aesthetic already emphasizes.\nSpace is, therefore, not what we perceive but that which allows\nperception. As Henry argues, this is the kind of role that Heidegger\nattributes to the world insofar as it is not the sum of beings\nanymore, but the condition of their appearing. Thus, by creating\n“a world”, art reveals precisely this form of original\nappearing. Beyond the things perceived, art “make[s] us see\nthe appearing that conceals itself and in which the thing unveils\nitself” (AP 284).\n\nHenry follows Heidegger here so far as to say that art reveals an\noriginal appearing. But he opposes Heidegger in at least two essential\npoints: 1) The idea that the world of art is a world apart from\nordinary experience; and 2) The idea that the original appearing is\nthe appearing of a world. With regard to the first point, Henry\nobserves that the rise of art as a separate domain is historically\nsituated in modernity. Such a separation did not exist when some of\nhumanity’s greatest art works were created, the temples of\nancient Greece or the cathedrals of the Middle Ages, for instance. The\nfunction of these edifices was to serve as a place where the divine\ncould be worshipped, and the divine was the chief concern of those who\nconceived them, not beauty. As Henry concludes, it is only through our\nretrospective glance and through the projection of our own\n20th-century concept of art that we find these works\nbeautiful; and beauty has even become the only thing we are capable of\nfinding in them “since we have lost their original\nmeaning”, i.e., “since we do not anymore see a temple as\nan access to the sacred essence of things, but as a work of art”\n(AP 285–6).\n\nBut Henry’s highlighting of the religious origin of art is also\nconnected to the question of the original appearing that is unveiled\nby art. In his critique of Heidegger, Henry distinguishes between\nBeing and Time, on the one hand, and Heidegger’s later\ntexts that were influenced by Hölderlin and Nietzsche on the\nother. With regard to Being and Time, Henry’s\nopposition is clearly marked: “the original appearing is not the\none that Heidegger thought of, it is not the world”, which means\nthat \n\n\nit is not an ek-static appearing […], it is therefore not an\nhorizon, but what I call Life, i.e., a revelation\nthat is not the revelation of an other, that does not open to an\nexteriority, but that opens to itself. (AP 286) \n\n\nThe original appearing to which art refers is the immanent\nself-appearing of life given through auto-affection or pathos. In a\nfundamental sense for Henry, such affective appearing is given in\nsuffering and joy as basic tonalities. With regard to\nHölderlin’s and Nietzsche’s reference to the Greek\ngods, this means that Dionysus has to be seen as the “first\ngod”, since he is the god of desire, of life tied to itself in\nboth suffering and joy (AP 287). Moreover, Dionysus “has no\nworld” but suffers the burden of his own pathos from which he\nseeks to escape by generating Apollo, i.e., the god of light and,\nthus, the hope of distancing oneself from pathos. Here art becomes a\nsource of light, a figure through which Dionysus strives to escape\nfrom suffering. This is not, however, Henry’s concept of art: it\nis through the influence of Kandinsky’s writings that he\nconceives of art as an “intensification of life” (AP 296),\nwhere life is understood as auto-affection and original appearing.\n3.2 Henry’s Phenomenological Reading of Kandinsky\n\nAccording to Henry, Kandinsky is the first artist to theorize a new\nconception of art and to root art in transcendental life. But\nhow could art, and painting in particular, “intensify”\ninvisible and affective life since it is made of visible elements such\nas form and color? For Kandinsky, color is first and foremost a\n“radically subjective impression”, “an inner\nresonance” (AP 290). In the terminology of Henry’s\nphenomenology, such an apparent paradox is accounted for by the\nduplicity of appearing: on the one hand, there is a noematic color,\nthe color red as a moment of a particular object, which is only made\npossible by a primal impression of red that is, on the other hand,\npurely immanent and subjective. Or, as Henry writes: \n\n\nThere is no red in the world. Red is a sensation, and such sensation\nis absolutely subjective, originally invisible. Original colors are\ninvisible; they are, however, laid over things through a process of\nprojection. (AP 290) \n\n\nFor the painter, then, the choice of a color is determined by its\nemotional power. It is not the world that is painted, but, in a sense,\nemotion itself. This applies to abstract painting, which obviously\ndoes not represent any worldly object, but it also applies to any\nother form of painting. A painting that would be a simple copy of what\nhas been seen in the world would be utterly\n“insignificant”. As Henry’s example of a painting\nfrom the Quattrocento illustrates, even figurative\npainting—in this case a representation of the Adoration of the\nMagi—chooses its colors according to their emotional power, not\naccording to a “realistic” representation. Thus, while\nproviding a theoretical basis for abstract painting, it is in fact a\ntheory of painting as such that Kandinsky provides. For such a theory,\nforms are, very much like colors, not entities exterior to life but\nthe expression of a force (K 123). Kandinsky’s theory of\nforms—referring to point, plane and line as their basic\nelements—therefore amounts to a theory of forces that inhabit\nnot the world but our body as it is subjectively lived through (K 82).\nSuch is the essence of Kandinsky’s theory of painting: to be a\nvisible composition that both expresses and touches living\ninteriority. Through this project, and as Kandinsky himself admits,\npainting has been ascribed the same purpose as music: to express\n“not the world […] but the Ground of Being and of\nLife” (“Dessiner la musique”, PHV III, 272).\n3.3 Particular Art Forms: From Music to Literature\n\nFollowing a Schopenhauerian line of thought, Henry states that music\n“does not express the horizon of the world or any of its\nobjects” (AP 292), but affectivity itself, i.e., a\nforce—the Will in Schopenhauer—that lies outside of\nrepresentation. More precisely, music is the immediate reproduction of\na force that lies “outside the world” (PHV III, 264) and\nwhich is in this sense abstract. For Schopenhauer every great\nwork of art is the expression of a force. In architecture for\ninstance, both a Greek temple and a baroque façade express and\nrepresent forces. The specificity of music, however, lies in the fact\nthat it expresses the Will in an immediate way. Moreover, this\nSchopenhauerian standpoint is taken further with regard to another\nidea to which Henry will agree, namely that of the living body as\nbeing the immediate manifestation of the Will. As the important\nchapter devoted to Schopenhauer in Genealogy of\nPsychoanalysis shows, Henry interprets the Will within the\nframework of his own concept of life as immanent auto-affection or\naffectivity, while at the same time acknowledging that Schopenhauer\nwas “one of the greatest thinkers of all times, albeit a poor\nphilosopher” (AP 292).\n\nThe fact that most of Henry’s writings on art focus either on\npainting or on music does not allow one to conclude that his thesis of\nart as an “intensification of life” would not apply, or\nwould apply any less, to other art forms. Architecture is repeatedly\nused by Henry, for instance in Barbarism where the baroque\nfaçade is taken as an example of both expression and\nreproduction (for the spectator) of an immanent play of forces (B\n103).\n\nThe same principle applies to dance. According to Henry, dance is not\nfigurative; its purpose is not “to tell us a story”, but\nto express movement abilities pertaining to the body thereby enabling\nthe spectator to feel these abilities in his or her own body, very\nmuch “like the forms in a painting makes me feel the forces that\nare within me and with which I coincide” (AP 306).\n\nLiterature, too, occupies a special place in Henry’s oeuvre. It\nis the one art that he himself practiced as a novelist—his novel\nL’amour les yeux fermés was awarded the French\nPrix Renaudot in 1976—though literature as an art form is never\nclearly theorized in his philosophy. In a 1991 interview\npublished under the title “Narrer le pathos” (“To\nNarrate Pathos”) Henry admits that an aesthetic theory of\nliterature still remains a task for his phenomenology. Nonetheless,\nthe interview contains several indications concerning the direction\nsuch a theory would have to take. As the title indicates, novels and\nother forms of fictional writing such as poetry for instance, are\nconceived both as an expression of pathos (from the standpoint of the\nartist) and as its reproduction or intensification (from the\nstandpoint of the reader). As in the case of painting, it is\nHenry’s approach to music that provides the foundation for the\naesthetics of writing. In order to accomplish this task, the words of\nthe poet or those of the novelist must be able to unveil affectivity\nrather than be limited to ek-static appearing as their ultimate\nphenomenological possibility. In the latter case, they are bound to\ngive the thing as absent, as Henry argues while commenting on\nHeidegger’s analysis of Trakl’s poem “Ein\nWinterabend”: the snow, the ringing of the bells when the night\nfalls, etc., are brought into presence by the poet’s words, but,\nat the same time, this presence is retrieved from them since they are\ngiven as not really being there. But this is only true in so far as\nthe presence to which words refer is the one that characterizes what\ncan be seen or perceived within the ek-static appearing of the world.\nIn such a context, poetry can only give things through an ambiguous\npresence-absence (“Phénoménologie\nmatérielle et langage”, PHV III, 333). For Henry, it is\nonly when words are envisaged as the expression of pathos that they\nspeak to a living present beneath the words and their representations.\nSuch a language of affectivity would thus have to be largely\ndisconnected from any form of realism and objectivity, while making\nroom for the imaginary as in hallucination, since “in\nhallucination pathos governs directly its own images” (PHV III,\n313).\n\nAs can be seen from Henry’s approach regarding different art\nforms such as painting, music, and literature, art aims, or should\naim, at being an intensification of life as immanent pathos. Life in\nthis sense, however, can be forgotten and its force can be diminished.\nIf therefore, like Henry states, art is an “arising of the most\nessential life that breaks through in each of us”, then art also\naccomplishes an “ethical oeuvre” (AP 296).\n4. Ethics and Political Philosophy\n\nEven if one does not find a systematic development of ethics in the\nfew articles that Henry explicitly devotes to this subject, it is\nnonetheless possible to use these writings as a foundation for an\nethics from the standpoint of his phenomenology of life. Given the\nemphasis that Henry puts on the fundamental nature of life as\naffectivity as well as the tendency toward a forgetting of\nlife’s essence, it seems consistent to ascribe to ethics the\ntask of unmasking and, if possible, overcoming such forgetting. In\nthis sense, Henry’s ethics could be termed an “ethics of\naffectivity” (Seyler 2010). Among the possible angles that allow\nfor further development with regard to ethics in Henry’s\nwritings, the three following stand out: 1) the idea that art is\nintrinsically ethical; 2) the critique of contemporary culture through\nthe concept of “barbarism”; and 3) the concept of religion\nas developed by Henry’s philosophy of Christianity.\n4.1 Art as Intrinsically Ethical\n\nAs we have seen above, Henry explicitly ascribes an ethical function\nto art. This involves two essential concepts: that of life’s\n“self-growth” (auto-accroissement) and that of\nthe bond between the living and absolute life (the latter concept\nbeing especially important in his philosophy of religion). Self-growth\ndescribes the movement inherent to life, namely “the living\n‘me’” itself (AP 295). Such a movement, however, is\nnot simply the continuation of an unchanging state. Self-experience is\nprimarily an experience (épreuve) of passivity, of\npathos in Henry’s terminology: We have neither brought ourselves\ninto existence nor do we continue to make ourselves exist. On the\ncontrary, it is absolute life that engenders itself “in”\nus. But for the same reason, the experience of passivity is one of the\n“weight” of subjectivity, leading to the urge to deploy\nsubjective powers. Perhaps in analogy with intentional acts that seek\nfulfillment in intuition, Henry’s concept of self-growth refers,\non the level of immanent affectivity, to subjectivity seeking the\ndevelopment of its powers in the “I can”:\n\n\nEach eye […] wants to see more. Culture exists when this\nprescription—which is the energy of vision—is followed in\nthis display of what is seen and in the creation of this display. What\nis now entirely clear to us is that this energy resides in vision as\nsuch. That is to say that it resides […] in its self-growth, in\nwhat has been called its will to power. (B 100–1)\n\n\nIn this context, the work of art appears as a possible mediation\ntoward such a subjective self-growth, both for the artist and the\nspectator. Art, however, is not limited to this intensification of\nsubjectivity. It functions at the same time as a\n“reminder” of the bond between the living and absolute\nlife, and this, according to Henry, is precisely the function of\nethics, namely “to make us relive this forgotten bond” (AP\n296). By taking religio in its etymological sense as\n“bond”, Henry’s aesthetics are therefore not only\nintrinsically ethical but also intrinsically religious. “Art is\nby its very nature ethical”, just as it is “a form of\nreligious life” (AP 297), a conclusion that for Henry is\ncompatible with a Christian as well as Nietzschean approach to art.\nHowever, since aesthetics is not only concerned with art but\nencompasses all sensible experience, it is not only art that is\nethically relevant but everything that affects sensibility, and this\nincludes the world as a whole given its organization in cultural forms\nand traditions (B 102–3). For this reason, Henry’s\ncritique of contemporary culture has to be seen as an important part\nof his approach to ethics.\n4.2 The Critique of Contemporary Culture as “Barbarism”\n\nIf, for Henry, culture has always to be understood as “a culture\nof life”, i.e., as the cultivation of subjective powers, then it\nincludes art without being limited to it. Cultural praxis comports\nwhat Henry designates as its “elaborate forms” (e.g., art,\nreligion, discursive knowledge) as well as everyday forms related to\nthe satisfaction of basic needs. Both types of forms, however, fall\nunder the ethical category of subjective self-growth and illustrate\nthe bond between the living and absolute life. The inversion\nof culture in “barbarism” means that within a particular\nsocio-historical context the need for subjective self-growth is no\nlonger adequately met, and the tendency toward an occultation of the\nbond between the living and absolute life is reinforced. According to\nHenry, who echoes Husserl’s analysis in Crisis, such an\ninversion takes place in contemporary culture, the dominating feature\nof which is the triumph of Galilean science and its technological\ndevelopments (B xiv).\n\nInsofar as it relies on objectification, the “Galilean\nprinciple” is directly opposed to Henry’s philosophy of\nimmanent affectivity. For Henry, science, including modern Galilean\nscience, nonetheless remains a highly elaborated form of culture (B\n62). Although “the joy of knowing is not always as innocent as\nit seems”, (B 72) the line separating culture from\n“barbarism” is crossed when science is transformed into\nscientist ideology, i.e., when the Galilean principle is made into an\nontological claim according to which ultimate reality is given only\nthrough the objectively measurable and quantifiable. Here,\nHenry’s critique of scientism functions in parallel with his\ncritique of ontological monism: in both cases, it is ek-static\nappearing that is considered as the only access to reality, which\namounts to the (ideological or philosophical) negation of subjectivity\nas immanent auto-affection. As the Essence of Manifestation\nalready notes in opposition to Hegel but also to Heidegger: \n\n\nObjectification is not possible unless the essence which objectifies\nitself originally arrives in itself […]. That this original\narriving of the essence in itself be not constituted by\nobjectification, that it cannot, as Hegel and Heidegger would wish, be\nthe consequence hereof, results precisely from its being the condition\nof this objectification. (EM 278)\n\n\nBut the concept of “barbarism” is not limited to a\ncritique of scientist ideology and its paradigm of objectification.\nMore importantly, it targets the implications of such an ideology on\nthe level of everyday praxis in what Henry terms “practices of\nbarbarism”. This rather polemical use of the term\n“barbarism” refers to practices that impoverish rather\nthan develop subjective powers. If it includes the ordinary sense of\nbarbarism as brutality and extreme violence, it is by no means limited\nto it and extends to every form of practice that reverses the movement\nof self-growth inherent to subjectivity. On a societal level, the\nconcept of “barbarism” becomes a reinterpretation of the\nFreudian “malaise in civilization”. “There is a\nmalaise in civilization every time that the energy of Life remains\nunemployed”, explains Henry (B 103). “Reverse” forms\nof practice thus illustrate the alienation of subjective praxis\nthrough the domination of the Galilean principle and its technological\noutcomes. With regard to the practice of television, for instance,\nHenry’s critique targets the constant succession from one image\nto the other that makes an aesthetic contemplation impossible. As a\ncorollary to their inconstancy, televised images are also considered\ninsignificant. If they had any significance, they would not only\ncapture attention but would also call for reflection and\ncontemplation. However, this is precisely what an uninterrupted flow\nof images makes impossible:\n\n\nEmergence and disappearance are thus only the continually resumed act\nof life getting rid of itself. It is only in light of such an act that\ndisappearance can become fully intelligible. It presupposes that the\ncontent of the image is of no interest in itself and that it is\ndestined to be replaced by another one. If it were to arouse true\nattention and have a worth of its own, instead, this would imply that\nit would remain and that the perception of it would arouse a growth of\nsensibility and intelligence in the spectator. This would imply that\nthe mind, occupied with this inner work, would latch onto the image\n[…], in the omni-temporality of the cultural object that\ndelivers it to contemplation. But, in such a case, life would no\nlonger seek to flee itself in such an image; instead it would find its\naccomplishment in it, that is to say, in itself. (B 111, translation\nedited)\n\n\nAs this passage indicates, the underlying principle of\n“barbarism” is that of a flight from subjectivity into\nanonymous processes mastered by techno-science, which are then used\ngradually to replace living praxis. Henry’s concept of\n“barbarism” can thereby be related to Kierkegaardian\ndespair as “sickness unto death” (EM 680–1, B\n64–66). More precisely, “barbarism” is seen as the\nultimate form of despair in which the desire to escape oneself as\nliving subjectivity takes the form of a negation of life pure and\nsimple. It is important to note that for Henry such a desire is itself\nrooted in life, i.e., in immanent affectivity, as a desire to escape\nthe tonalities of suffering that life necessarily undergoes.\nConsequently, “barbarism” is a project impossible to\naccomplish, because life remains itself even through forms of flight\nand negation that Henry does not hesitate to characterize as\n“madness” (B 52). And it is this movement of fleeing that\nHenry recognizes as constituting the characteristic trait of\nmodernity.\n4.3 Christian Ethics as Recognition of Absolute Life\n\nHenry’s reading of Christian ethics in I Am the Truth\nconfirms that what is at stake for the ethics of affectivity is the\nrecognition of the bond between individual and absolute life. For\nHenry, cultural renaissance is therefore inherently religious and is\nconnected to the theme of “second birth”. In I am the\nTruth, as in Incarnation, the opposition of\n“barbarism” and culture remains operative. As an example,\nHenry considers the negation of God in the world of techno-science to\nbe implied by the negation of the human as living ipseity (IAT 263),\nsince “practices of barbarism” impair the subjective need\nfor action, in which the human is able to experience life as an\nabsolute. Paradoxically, the search for oneself in the world, which\naccording to Henry characterizes modernity, can only be overcome by\nabandoning oneself to absolute life, i.e., by renouncing the care for\noneself in the world (souci de soi dans le monde) (IAT\n143–144). Not to care anymore about oneself as worldly ego means\n“to be only a living that is traversed by Life” (DD 169),\ni.e., to rediscover what was previously forgotten, namely absolute\nlife, and to live from the infinite love that the absolute has for\nitself. In order to account for this “second birth”, Henry\nexplicitly refers to a teleology oriented toward the\nrecognition of absolute life. Eventually, such recognition expresses\nitself through a double negation in which what negates the absolute is\nnegated in return. But, being immanent and affective, this recognition\nalso resists its description and escapes representation. “Second\nbirth” is only possible within subjective praxis and, more\nprecisely, through the work of mercy, since \n\n\nonly the work of mercy practices the forgetting of self in which,\nall interest for the Self (right down to the idea of what we call a\nself or a me) now removed, no obstacle is now posed to the unfurling\nof life in this Self extended to its original essence. (IAT 170)\n\n\n\nHowever, it is through the action of immanent life itself that\n“the life of the ego is changed into Life of the absolute”\n(IAT 165). Consequently, such a mutation of praxis can only be an\ninterior one, which means that it can never be commanded from a point\nof view exterior to immanent affectivity or even be the result of the\nego’s conscious caring for salvation. This point is not\nunproblematic for an ethics of affectivity, since what has been\nidentified as its fundamental issue depends not primarily on\ndecisions consciously put into action, but on the immanent dynamic of\naffectivity itself.\n4.4 Political Philosophy\n\nHenry’s critique of contemporary culture also raises the\nquestion of social conditions and their impact on the exercise of\nsubjective potentialities (see also Gély 2007). The issue of\nsocial organization refers here to two important fields of\ninvestigation: economics, investigated in Marx (1976), and\npolitics, investigated mainly in From Communism to Capitalism.\nTheory of a Catastrophe (1990) as well as in two important\narticles: “La vie et la république” (“Life\nand the Republic”, 1989) and “Difficile\ndémocratie” (“Difficult Democracy”, 2000).\nFor both economics and politics, Henry’s normative critique\ntargets the forgetting and the occultation of life as a transcendental\ngenesis in which political organization and economy are rooted.\nPolitics and economics are both superstructures that are necessarily\ntied to representation and measurement, but their legitimacy comes\nfrom what is ante-political and ante-economic, namely transcendental\nlife. In Henry’s view, modernity turns this actual genesis\nupside down: superstructures seem to have become autonomous and, in\nreverse, tend to impose their laws on immanent life. This reversal is\nonly possible insofar as the foundational character of life as\nimmanent appearing remains forgotten. As Henry argues in From\nCommunism to Capitalism, in techno-scientific capitalism, and\neven more in totalitarianism, the tendency toward an (albeit illusory)\nautonomization of superstructures becomes extreme. Despite the\nviolence of totalitarianism, and as can be seen from the analysis of\nHenry’s concept of “barbarism”, alienation can never\nbe total. It is nonetheless very real, precisely because it is able to\naffect individual praxis by substituting the “laws of\nideality” for those of “vital teleology” (B 134).\nAnd again, it is the lack of recognition of immanent life as\nfundamental phenomenality that makes the reversal that characterizes\n“barbarism” possible. While Henry distinguishes between an\noriginal ethics—ethos itself as first ethics in which\nlife accomplishes its essence—and ethics as normative and\ndiscursive (B 96–7), it is to the latter that the philosophical\ntask of reminding us of the transcendental genesis and, hence, of life\nas fundamental appearing is assigned. Thereby, the ethics of\naffectivity becomes political insofar as it identifies and unmasks\n“hypostases” in economics and politics (VR 158).\nHenry’s phenomenology can then conceptualize cultural\nrenaissance as a “reversal of the reversal” operating in\nfigures of “barbarism”. As far as the political realm is\nconcerned, however, such a renaissance faces the tension—the\naporia even—that must exist between invisible life as\nipseity and public affairs as general. This tension, which constitutes\nthe political, underlies the democratic project as the self-foundation\nof communal life (DD 171). From Henry’s point of view, democracy\ndoes not necessarily promote culture: if democracy is a chance to\nreestablish “the true order of things, the foundation of the\npolitical in life, for which it can be nothing but a mediation”,\n(VR 162) it also entails the risk that the visibility necessary to\npublic life be posited as the only possible mode of appearing.\nDemocracy may thereby favor the occultation of its own foundation and\nbecome the objective ally of the Galilean principle (DD 175).\nMoreover, the prospect of political self-foundation is, in its\nessence, at risk of reproducing the transcendental illusion of the ego\n(IAT 140) on the communal level: just like the ego is victim of an\nillusion when it presumes to be the ultimate source of the “I\ncan”, so is a political community misdirected if it presumes to\nbe the ultimate constitutive power of communal life. On this political\nlevel the religious bond with absolute life can also fall into\noblivion. In such a case, it is the conquest of human rights that is\neventually threatened by the reduction of the human to that which\nscientific exteriority is able to measure and enunciate. As\nHenry’s phenomenology of intersubjectivity in Part III of\nMaterial Phenomenology explains, absolute life is shared by\nall living and provides the ground for an invisible and immanent\ncommunity. The core of Henry’s political philosophy lies\ntherefore in the principle according to which the political is only\nlegitimate as a mediation for what is ante-political—namely\nlife, both individual and communal.\n\nThe originality of Henry’s contribution to phenomenology is\nwithout a doubt his thesis of the duality of appearing, where\n“immanent affectivity” or “life” designates\nthe “first” and more fundamental form of appearing.\nHenry’s approach can therefore be described as a systematic\nphenomenology and philosophy of life. It is also a philosophy of\nimmanence, but enriched with the heritage of transcendental\nphenomenology, since, for Henry, immanent affectivity is nothing less\nthan the condition of possibility of both the world and consciousness.\nFurthermore, this transcendental framework leads him to develop a\ncritique of the history of philosophy as well as an approach to\npractical philosophy and the philosophy of religion. As a philosophy\nof immanence, however, the formidable challenge Henry’s\nphenomenology faces lies in its application to what it regards as\ntranscendent, namely that which is given to us through the distance of\nintentional consciousness: the world and even ourselves as intentional\nbeings.\n",
    "bibliography": {
        "categories": [
            "Works by Michel Henry",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Works by Michel Henry": [
                "</h3>\n<h4 id=\"PrinWork\">Principal Works</h4>\n<ul class=\"hanging\">",
                "<em>Le bonheur de Spinoza</em>, mémoire de fin\nd’étude (1943) reprinted in <em>Le bonheur de Spinoza\nsuivi de: J.-M. Longneaux, “Étude sur le spinozisme de\nMichel Henry”</em>, Paris: Presses Universitaires de France,\n2004.",
                "<strong>[EM]</strong> <em>L’essence de la\nmanifestation</em>, Paris: Presses Universitaires de France, 1963;\nsecond edition, 1990. English Translation by G. Etzkorn: <em>The\nEssence of Manifestation</em>, The Hague: Nijhoff, 1973; second\nedition, 2004.",
                "<em>Philosophie et phénoménologie du corps. Essai\nd’ontologie biranienne</em>, Paris: Presses Universitaires de\nFrance, 1965. English translation by G. Etzkorn: <em>Philosophy and\nPhenomenology of the Body</em>, The Hague: Nijhoff, 1975.",
                "<em>Marx</em>, 2 volumes, vol. 1: Une philosophie de la\nréalité, vol. 2: Une philosophie de\nl’économie. Paris: Gallimard, 1976. Partial English\ntranslation by K. McLaughlin: <em>Marx. A Philosophy of Human\nReality</em>, Bloomington: Indiana University Press, 1983.",
                "<em>Généalogie de la psychanalyse. Le commencement\nperdu</em>, Paris: Presses Universitaires de France, 1985. English\ntranslation by D. Brick :\n<em>The Genealogy of Psychoanalysis</em>, Stanford: Stanford\nUniversity Press, 1993.",
                "<strong>[B]</strong> <em>La barbarie</em>, Paris: Presses\nUniversitaires de France, 1987<sup>1</sup>, 2004<sup>2</sup>. English\ntranslation by S. Davidson: <em>Barbarism</em>, London/ New York:\nContinuum, 2012.",
                "<strong>[K]</strong> <em>Voir l’invisible. Sur\nKandinsky</em>, Paris: Presses Universitaires de France,\n1988<sup>1</sup>, 2005<sup>2</sup>. English translation by\nS. Davidson: <em>Seeing the Invisible. On Kandinsky</em>, London/New\nYork: Continuum, 2009.",
                "<strong>[MP]</strong> <em>Phénoménologie\nmatérielle</em>, Paris: Presses Universitaires de France,\n1990. English translation by S. Davidson: <em>Material\nPhenomenology</em>, New York: Fordham University Press, 2008.",
                "<em>Du communisme au capitalisme. Théorie d’une\ncatastrophe</em>, Paris: Odile Jacob, 1990. English translation by S.\nDavidson: <em>From Communism to Capitalism. Theory of a\nCatastrophe</em>, London: Bloomsbury Academic, 2014.",
                "<strong>[IAT]</strong> <em>C’est moi la\nvérité. Pour une philosophie du christianisme</em>,\nParis: Seuil, 1996. English translation by S. Emanuel: <em>I Am the\nTruth. Toward a Philosophy of Christianity</em>, Stanford: Stanford\nUniversity Press, 2003.",
                "<strong>[I]</strong> <em>Incarnation. Une philosophie de la\nchair</em>, Paris: Seuil, 2000. English translation by K. Hefty:\n<em>Incarnation. A Philosophy of Flesh</em>, Evanston: Northwestern\nUniversity Press, 2015.",
                "<em>Paroles du Christ</em>, Paris: Seuil, 2002. English\ntranslation by C. Gschwandtner: <em>Words of Christ</em>, Grand\nRapids: Eerdmans, 2012.",
                "<strong>[PHV]</strong> <em>Phénoménologie de la\nvie</em>, 4 volumes (collected articles): Volume I: De la\nphénoménologie. Paris: Presses Universitaires de France,\n2003; Volume II: De la subjectivité. Paris: Presses\nUniversitaires de France, 2003. Volume III: De l’art et du\npolitique. Paris: Presses Universitaires de France, 2004. Volume IV:\nSur l’éthique et la religion. Paris: Presses\nUniversitaires de France, 2004.",
                "<em>Auto-donation. Entretiens et conférences</em>, Paris:\nBeauchesne, 2002<sup>1</sup>, 2004<sup>2</sup>.",
                "<strong>[PNI]</strong> “Phénoménologie\nnon-intentionnelle: une tâche de la phénoménologie\nà venir”, in Janicaud, D. (ed.),\n<em>L’intentionnalité en question. Entre\nphénoménologie et sciences cognitives.</em> Paris: Vrin,\n1995, 383–397; reprinted in <em>Phénoménologie de\nla vie</em>, vol. I, Paris, Presses Universitaires de France, 2003,\n105–121 (translations by the author).",
                "<strong>[AP]</strong> “Art et phénoménologie\nde la vie”, in <em>Prétentaine</em>, 6, 1996,\n27–43; reprinted in <em>Phénoménologie de la\nvie</em>, vol. III, Paris: Presses Universitaires de France, 2004,\n283–308 (translations by the author).",
                "<strong>[VR]</strong> “La vie et la\nrépublique”, in <em>Enseignement philosophique</em>, 3,\n1989, 148–160; reprinted in <em>Phénoménologie de\nla vie</em>, vol. III, Paris: Presses Universitaires de France,\n147–165. (translations mine)",
                "<strong>[DD]</strong> “Difficile démocratie”,\nin David, A. and Greisch, J.(ed.), <em>Michel Henry</em>,\n<em>l’épreuve de la vie</em>, Paris: Cerf 2000,\n39–54; reprinted in <em>Phénoménologie de la\nvie</em>, vol. III. Paris: Presses Universitaires de France, 2004,\n167–182. (translations mine)\n</ul>\n<h4 id=\"Nove\">Novels</h4>\n<ul class=\"hanging\">",
                "<em>Le jeune officier</em>, Paris: Gallimard, 1954.",
                "<em>L’amour les yeux fermés</em>, Paris: Gallimard,\n1977<sup>1</sup>, 1982<sup>2</sup>.",
                "<em>Le fils du roi.</em> Paris: Gallimard, 1981.",
                "<em>Le cadavre indiscret</em>, Paris: Albin-Michel, 1996\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<h4 id=\"SeleWork\">Selected Works</h4>\n<ul class=\"hanging\">",
                "Audi, P., 2006, <em>Michel Henry. Une trajectoire\nphilosophique</em>, Paris: Les Belles Lettres.",
                "Barbaras, R., 1991, “Le sens de l’auto-affection chez\nM. Henry et chez M. Merleau-Ponty”, <em>Epochè</em>, 2:\n91–111.",
                "Barbaras, R., 2012, “The Essence of Life: Desire or\nDrive?”, in Hanson, J. and Kelly, M. (eds.), 2012, <em>Michel\nHenry and the Affect of Thought</em>, London/New York: Continuum:\n40–61.",
                "Brohm, J.-M. and J. Leclercq. (eds.), 2009, <em>Michel Henry</em>,\nLausanne: L’Âge d’Homme.",
                "Capelle, Ph. (ed.), 2004, <em>Phénoménologie et\nchristianisme chez Michel Henry. Les derniers écrits de Michel\nHenry en débat</em>, Paris: Cerf.",
                "David, A. and J. Greisch. (eds.), 2001, <em>Michel Henry,\nl’épreuve de la vie</em>, Paris: Cerf.",
                "Davidson,S. and F. Seyler. (eds.), 2019, <em>The Michel Henry Reader</em>, Evanston: Northwestern University Press.",
                "Enders, M. (ed.), 2015, <em>Immanenz und Einheit. Festschrift zum\n70. Geburtstag von Rolf Kühn</em>, Boston/Leiden: Brill Academic\nPublishers.",
                "Fichte, J. G., 1806, <em>Die Anweisung zum seligen Leben oder auch\ndie Religionslehre</em>, in <em>Gesamtausgabe der Bayerischen Akademie\nder Wissenschaften</em>, Vol. I, 9, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog, 1995. English translation by W. Smith, <em>The Way\nTowards the Blessed Life or The Doctrine of Religion</em>, London:\nChapman, 1849.",
                "Garcia-Baro, M., 1997, “Introduccion a la teoria de la\nverdad de Michel Henry”, <em>Dialogo Filosofico</em>, 38:\n189–202.",
                "Gély, R., 2007, <em>Rôles, action sociale et vie\nsubjective. Recherches à partir de la\nphénoménologie de Michel</em>, Bruxelles: Lang.",
                "Green, G., 2012, “Kant and Henry: An Inheritance of Idealism\nand a ‘Turn’ for Phenomenology”, <em>Analecta\nHermeneutica</em>, 4: 1–19.",
                "Grätzel, S. and F. Seyler (eds.), 2013, <em>Sein, Existenz,\nLeben: Michel Henry und Martin Heidegger</em>, Freiburg i. Br.:\nAlber.",
                "Gschwandtner, C., 2010, “Can We Hear the Voice of God?\nMichel Henry and Words of Christ”, in Benson, B.E. and Wirzba,\nW. (eds.), 2010, <em>Words of Life. New Theological Turns in French\nPhenomenology.</em> New York: Fordham University Press:\n147–157.",
                "Haar, M., 1987, “Michel Henry entre\nphénoménologie et métaphysique”,\n<em>Philosophie</em>, 15: 30–59.",
                "Hanson, J. and M. Kelly (eds.), 2012, <em>Michel Henry and the\nAffect of Thought</em>, London/New York: Continuum.",
                "Hart, J., 1999, “A Phenomenological Theory and Critique of\nCulture: A Reading of Michel Henry’s <em>La\nbarbarie</em>”, <em>Continental Philosophy Review</em>, 32(3):\n255–270.",
                "Hatem, J.(ed.), 2003, <em>Michel Henry. La parole de la vie</em>,\nParis: L’Harmattan.",
                "Husserl, E., [GW], <em>Gesammelte Werke</em>, Vol. X, The Hague:\nNijhoff, 1966.",
                "Janicaud, D., 1991, <em>Le tournant théologique de la\nphénoménologie française.</em> Combas:\nÉclat. English translation by B. C. Prusak: <em>The French\nDebate. Part I: The Theological Turn of French Phenomenology</em>, New\nYork: Fordham University Press 2004.",
                "Jean, G., 2015, <em>Force et temps. Essai sur le vitalisme\nphénoménologique de Michel Henry</em>, Paris:\nHermann.",
                "Jean, G. and J. Leclercq (eds.), 2014, <em>Lectures de Michel\nHenry: Enjeux et perspectives</em>, Louvain: Presses Universitaires de\nLouvain.",
                "Jdey, A. and R. Kühn (eds.), 2011, <em>Michel Henry et\nl’affect de l’art. Recherches sur\nl’esthétique</em> <em>de la phénoménologie\nmatérielle</em>, Boston/Leiden: Brill Academic Publishers.",
                "Kawase, M., 2012, “Genjitsukan no genshogaku: Michel Henry\nto Kimura Bin” [The Sentiment of Reality: Michel Henry and\nKimura Bin], <em>Ritsumeikan bungaku</em>, 625: 1077–1089.",
                "Kühn, R., 1992, <em>Leiblichkeit als Lebendigkeit. Michel\nHenrys Phänomenologie absoluter Subjektivität als\nAffektivität</em>, Freiburg i. Br.: Alber.",
                "–––, 2003, <em>Radicalité et\npassibilité. Pour une phénoménologie\npratique</em>, Paris: L’Harmattan.",
                "–––, 2016, <em>Wie das Leben spricht:\nNarrativität als radikale Lebensphänomenologie. Neuere\nStudien zu Michel Henry</em>, Dordrecht: Spinger.",
                "–––, 2019, “‘Vitalismus’ und reine Potenzialität bei Michel Henry”, <em>Phänomenologische Forschungen</em>, 1: 53–70.",
                "Kühn, R. and S. Nowotny (eds.), 2002, <em>Michel Henry:\nSelbsterprobung des Lebens und der Kultur</em>, Freiburg/München:\nAlber.",
                "Laoureux, S., 2005, <em>L’immanence à la limite</em>,\nParis: Cerf.",
                "Lavigne, J.-F. (ed.), 2006, <em>Michel Henry. Pensée de la\nvie et culture contemporaine</em>, Actes du colloque international de\nMontpellier 3–5 décembre 2003. Paris: Beauchesne.",
                "–––, 2009, “The Paradox and Limits of\nMichel Henry’s Concept of Transcendence”,\n<em>International Journal of Philosophical Studies</em>, 17(3):\n377–388.",
                "–––, 2011, “Souffrance et ipséité selon Michel Henry”, <em>Cahiers Philosophiques</em>, 3: 66–81.",
                "Longneaux, J.-M., 2004,“Étude sur le spinozisme de\nMichel Henry”, in M. Henry, <em>Le bonheur de Spinoza, suivi de:\nJ.-M. Longneaux, “Étude sur le spinozisme de Michel\nHenry”</em>, Paris: Presses Universitaires de France, 2004,\n153–429.",
                "Martins, F., 2004, “Michel Henry: beatitude e\nfenomenologia”, <em>Revista Portuguesa de Filosofia</em>, 60(4):\n1031–1040.",
                "O’Sullivan, M., 2006, <em>Incarnation, Barbarism and Belief.\nAn Introduction to the Work of Michel Henry</em>, Bern: Lang.",
                "Ricoeur, P., 2014, “Le Marx de Michel Henry”, in Jean,\nG. and Leclercq, J. (eds.), 2014, <em>Lectures de Michel Henry: Enjeux\net perspectives</em>, Louvain: Presses Universitaires de Louvain:\n161–183.",
                "Rivera, J., 2015, <em>The Contemplative Self after Michel Henry</em>, Notre Dame: Notre Dame University Press.",
                "Sebbah, J.-D., 2001, <em>L’épreuve de la limite</em>,\n<em>Derrida, Henry, Levinas et la phénoménologie</em>,\nParis: Presses Universitaires de France. English translation by\nS. Barker: <em>Testing the Limit: Derrida, Henry, Levinas, and the\nPhenomenological Tradition</em>, Stanford: Stanford University Press\n2012.",
                "Seyler, F., 2009, “Michel Henry et la critique du\npolitique”, <em>Studia Phaenomenologica</em>, IX:\n351–377.",
                "–––, 2010, <em>Barbarie ou culture:\nL’éthique de l’affectivité dans la\nphénoménologie de Michel Henry</em>, Paris:\nKimé.",
                "–––, 2014, “Fichte in 1804: A Radical\nPhenomenology of Life? On a Possible Comparison Between the 1804\n<em>Wissenschaftslehre</em> and Michel Henry’s\nPhenomenology”, <em>Journal of Speculative Philosophy</em>,\n28(3): 295–304.",
                "Staudigl, M., 2009, “From the ‘Metaphysics of the\nIndividual’ to the Critique of Society: On the Practical\nSignificance of Michel Henry’s Phenomenology of Life”,\n<em>Continental Philosophy Review</em>, 45(3), 339–361.",
                "Steinbock, A., 1999, “The Problem of Forgetfulness in Michel\nHenry”, <em>Continental Philosophy Review</em>, 32(3):\n271–302.",
                "Vidalin, A., 2012, <em>Acte du Christ et actes de l’homme.\nLa théologie morale à l’épreuve de la\nphénoménologie de la vie</em>, Paris: Parole et\nSilence.",
                "Yamagata, Y., 2006, “Le langage du sentiment”, in\nLavigne 2006: 261–274.",
                "Zahavi, D., 1999, “Michel Henry and the Phenomenology of the\nInvisible”, <em>Continental Philosophy Review</em>, 32(3):\n223–240.\n</ul>\n<h4 id=\"SpecEditPeri\">Special Edition Periodicals</h4>\n<ul class=\"hanging\">",
                "<em>Philosophie</em>, XV, 1987.",
                "<em>Les Etudes philosophiques</em>, I, 1988.",
                "<em>Annales de philosophie de Beyrouth</em>, 16, 1995 &amp; 18,\n1997.",
                "<em>Communio</em>, XXI, 1996.",
                "<em>Continental Philosophy Review</em>, 32(3), 1999.",
                "<em>Revue philosophique de la France et de\nl’étranger</em>, 3, 2001.",
                "<em>Etudes phénoménologiques</em>, 39–40,\n2004.",
                "<em>Phainomenon</em>, 13, 2006.",
                "<em>Studia Phaenomenologica</em>, IX, 2009.",
                "<em>International Journal for Philosophical Studies</em>, 17(3),\n2009.",
                "<em>Cahiers philosophiques de Strasbourg</em>, 30, 2011.",
                "<em>Cahiers philosophiques</em>, 126(3), 2011.",
                "<em>Alea. International Journal for Phenomenology and\nHermeneutics</em>, 10, 2012",
                "<em>Journal of French and Francophone Philosophy—Revue de\nphilosophie française et de langue française</em>,\nXX(2), 2012.",
                "<em>Revue Internationale Michel Henry</em> (Journal, since\n2010).",
                "<em>Michel Henry kenkyu</em> (Journal in Japanese, since\n2011).",
                "<em>Analecta Hermeneutica</em>, vol. 8, 2016.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\nPage indications refer to the English translations when available</p>\n<h3 id=\"WorkMichHenr\">Works by Michel Henry</h3>\n<h4 id=\"PrinWork\">Principal Works</h4>\n<ul class=\"hanging\">\n<li><em>Le bonheur de Spinoza</em>, mémoire de fin\nd’étude (1943) reprinted in <em>Le bonheur de Spinoza\nsuivi de: J.-M. Longneaux, “Étude sur le spinozisme de\nMichel Henry”</em>, Paris: Presses Universitaires de France,\n2004.</li>\n<li><strong>[EM]</strong> <em>L’essence de la\nmanifestation</em>, Paris: Presses Universitaires de France, 1963;\nsecond edition, 1990.  English Translation by G. Etzkorn: <em>The\nEssence of Manifestation</em>, The Hague: Nijhoff, 1973; second\nedition, 2004.</li>\n<li><em>Philosophie et phénoménologie du corps. Essai\nd’ontologie biranienne</em>, Paris: Presses Universitaires de\nFrance, 1965. English translation by G. Etzkorn: <em>Philosophy and\nPhenomenology of the Body</em>, The Hague: Nijhoff, 1975.</li>\n<li><em>Marx</em>, 2 volumes, vol. 1: Une philosophie de la\nréalité, vol. 2: Une philosophie de\nl’économie. Paris: Gallimard, 1976. Partial English\ntranslation by K. McLaughlin: <em>Marx. A Philosophy of Human\nReality</em>, Bloomington: Indiana University Press, 1983.</li>\n<li><em>Généalogie de la psychanalyse. Le commencement\nperdu</em>, Paris: Presses Universitaires de France, 1985. English\ntranslation by D. Brick :\n<em>The Genealogy of Psychoanalysis</em>, Stanford: Stanford\nUniversity Press, 1993.</li>\n<li><strong>[B]</strong> <em>La barbarie</em>, Paris: Presses\nUniversitaires de France, 1987<sup>1</sup>, 2004<sup>2</sup>. English\ntranslation by S.  Davidson: <em>Barbarism</em>, London/ New York:\nContinuum, 2012.</li>\n<li><strong>[K]</strong> <em>Voir l’invisible. Sur\nKandinsky</em>, Paris: Presses Universitaires de France,\n1988<sup>1</sup>, 2005<sup>2</sup>.  English translation by\nS. Davidson: <em>Seeing the Invisible. On Kandinsky</em>, London/New\nYork: Continuum, 2009.</li>\n<li><strong>[MP]</strong> <em>Phénoménologie\nmatérielle</em>, Paris: Presses Universitaires de France,\n1990. English translation by S.  Davidson: <em>Material\nPhenomenology</em>, New York: Fordham University Press, 2008.</li>\n<li><em>Du communisme au capitalisme. Théorie d’une\ncatastrophe</em>, Paris: Odile Jacob, 1990. English translation by S.\nDavidson: <em>From Communism to Capitalism. Theory of a\nCatastrophe</em>, London: Bloomsbury Academic, 2014.</li>\n<li><strong>[IAT]</strong> <em>C’est moi la\nvérité. Pour une philosophie du christianisme</em>,\nParis: Seuil, 1996. English translation by S. Emanuel: <em>I Am the\nTruth. Toward a Philosophy of Christianity</em>, Stanford: Stanford\nUniversity Press, 2003.</li>\n<li><strong>[I]</strong> <em>Incarnation. Une philosophie de la\nchair</em>, Paris: Seuil, 2000. English translation by K. Hefty:\n<em>Incarnation. A Philosophy of Flesh</em>, Evanston: Northwestern\nUniversity Press, 2015.</li>\n<li><em>Paroles du Christ</em>, Paris: Seuil, 2002. English\ntranslation by C. Gschwandtner: <em>Words of Christ</em>, Grand\nRapids: Eerdmans, 2012.</li>\n<li><strong>[PHV]</strong> <em>Phénoménologie de la\nvie</em>, 4 volumes (collected articles): Volume I: De la\nphénoménologie. Paris: Presses Universitaires de France,\n2003; Volume II: De la subjectivité. Paris: Presses\nUniversitaires de France, 2003. Volume III: De l’art et du\npolitique. Paris: Presses Universitaires de France, 2004. Volume IV:\nSur l’éthique et la religion. Paris: Presses\nUniversitaires de France, 2004.</li>\n<li><em>Auto-donation. Entretiens et conférences</em>, Paris:\nBeauchesne, 2002<sup>1</sup>, 2004<sup>2</sup>.</li>\n<li><strong>[PNI]</strong> “Phénoménologie\nnon-intentionnelle: une tâche de la phénoménologie\nà venir”, in Janicaud, D. (ed.),\n<em>L’intentionnalité en question. Entre\nphénoménologie et sciences cognitives.</em> Paris: Vrin,\n1995, 383–397; reprinted in <em>Phénoménologie de\nla vie</em>, vol. I, Paris, Presses Universitaires de France, 2003,\n105–121 (translations by the author).</li>\n<li><strong>[AP]</strong> “Art et phénoménologie\nde la vie”, in <em>Prétentaine</em>, 6, 1996,\n27–43; reprinted in <em>Phénoménologie de la\nvie</em>, vol. III, Paris: Presses Universitaires de France, 2004,\n283–308 (translations by the author).</li>\n<li><strong>[VR]</strong> “La vie et la\nrépublique”, in <em>Enseignement philosophique</em>, 3,\n1989, 148–160; reprinted in <em>Phénoménologie de\nla vie</em>, vol. III, Paris: Presses Universitaires de France,\n147–165. (translations mine)</li>\n<li><strong>[DD]</strong> “Difficile démocratie”,\nin David, A. and Greisch, J.(ed.), <em>Michel Henry</em>,\n<em>l’épreuve de la vie</em>, Paris: Cerf 2000,\n39–54; reprinted in <em>Phénoménologie de la\nvie</em>, vol. III. Paris: Presses Universitaires de France, 2004,\n167–182. (translations mine)</li>\n</ul>\n<h4 id=\"Nove\">Novels</h4>\n<ul class=\"hanging\">\n<li><em>Le jeune officier</em>, Paris: Gallimard, 1954.</li>\n<li><em>L’amour les yeux fermés</em>, Paris: Gallimard,\n1977<sup>1</sup>, 1982<sup>2</sup>.</li>\n<li><em>Le fils du roi.</em> Paris: Gallimard, 1981.</li>\n<li><em>Le cadavre indiscret</em>, Paris: Albin-Michel, 1996</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<h4 id=\"SeleWork\">Selected Works</h4>\n<ul class=\"hanging\">\n<li>Audi, P., 2006, <em>Michel Henry. Une trajectoire\nphilosophique</em>, Paris: Les Belles Lettres.</li>\n<li>Barbaras, R., 1991, “Le sens de l’auto-affection chez\nM. Henry et chez M. Merleau-Ponty”, <em>Epochè</em>, 2:\n91–111.</li>\n<li>Barbaras, R., 2012, “The Essence of Life: Desire or\nDrive?”, in Hanson, J. and Kelly, M. (eds.), 2012, <em>Michel\nHenry and the Affect of Thought</em>, London/New York: Continuum:\n40–61.</li>\n<li>Brohm, J.-M. and J. Leclercq. (eds.), 2009, <em>Michel Henry</em>,\nLausanne: L’Âge d’Homme.</li>\n<li>Capelle, Ph. (ed.), 2004, <em>Phénoménologie et\nchristianisme chez Michel Henry. Les derniers écrits de Michel\nHenry en débat</em>, Paris: Cerf.</li>\n<li>David, A. and J. Greisch. (eds.), 2001, <em>Michel Henry,\nl’épreuve de la vie</em>, Paris: Cerf.</li>\n<li>Davidson,S. and F. Seyler. (eds.), 2019, <em>The Michel Henry Reader</em>, Evanston: Northwestern University Press.</li>\n<li>Enders, M. (ed.), 2015, <em>Immanenz und Einheit. Festschrift zum\n70. Geburtstag von Rolf Kühn</em>, Boston/Leiden: Brill Academic\nPublishers.</li>\n<li>Fichte, J. G., 1806, <em>Die Anweisung zum seligen Leben oder auch\ndie Religionslehre</em>, in <em>Gesamtausgabe der Bayerischen Akademie\nder Wissenschaften</em>, Vol. I, 9, Stuttgart-Bad Cannstatt:\nFrommann-Holzboog, 1995. English translation by W. Smith, <em>The Way\nTowards the Blessed Life or The Doctrine of Religion</em>, London:\nChapman, 1849.</li>\n<li>Garcia-Baro, M., 1997, “Introduccion a la teoria de la\nverdad de Michel Henry”, <em>Dialogo Filosofico</em>, 38:\n189–202.</li>\n<li>Gély, R., 2007, <em>Rôles, action sociale et vie\nsubjective. Recherches à partir de la\nphénoménologie de Michel</em>, Bruxelles: Lang.</li>\n<li>Green, G., 2012, “Kant and Henry: An Inheritance of Idealism\nand a ‘Turn’ for Phenomenology”, <em>Analecta\nHermeneutica</em>, 4: 1–19.</li>\n<li>Grätzel, S. and F. Seyler (eds.), 2013, <em>Sein, Existenz,\nLeben: Michel Henry und Martin Heidegger</em>, Freiburg i. Br.:\nAlber.</li>\n<li>Gschwandtner, C., 2010, “Can We Hear the Voice of God?\nMichel Henry and Words of Christ”, in Benson, B.E. and Wirzba,\nW. (eds.), 2010, <em>Words of Life. New Theological Turns in French\nPhenomenology.</em> New York: Fordham University Press:\n147–157.</li>\n<li>Haar, M., 1987, “Michel Henry entre\nphénoménologie et métaphysique”,\n<em>Philosophie</em>, 15: 30–59.</li>\n<li>Hanson, J. and M. Kelly (eds.), 2012, <em>Michel Henry and the\nAffect of Thought</em>, London/New York: Continuum.</li>\n<li>Hart, J., 1999, “A Phenomenological Theory and Critique of\nCulture: A Reading of Michel Henry’s <em>La\nbarbarie</em>”, <em>Continental Philosophy Review</em>, 32(3):\n255–270.</li>\n<li>Hatem, J.(ed.), 2003, <em>Michel Henry. La parole de la vie</em>,\nParis: L’Harmattan.</li>\n<li>Husserl, E., [GW], <em>Gesammelte Werke</em>, Vol. X, The Hague:\nNijhoff, 1966.</li>\n<li>Janicaud, D., 1991, <em>Le tournant théologique de la\nphénoménologie française.</em> Combas:\nÉclat. English translation by B. C. Prusak: <em>The French\nDebate. Part I: The Theological Turn of French Phenomenology</em>, New\nYork: Fordham University Press 2004.</li>\n<li>Jean, G., 2015, <em>Force et temps. Essai sur le vitalisme\nphénoménologique de Michel Henry</em>, Paris:\nHermann.</li>\n<li>Jean, G. and J. Leclercq (eds.), 2014, <em>Lectures de Michel\nHenry: Enjeux et perspectives</em>, Louvain: Presses Universitaires de\nLouvain.</li>\n<li>Jdey, A. and R. Kühn (eds.), 2011, <em>Michel Henry et\nl’affect de l’art. Recherches sur\nl’esthétique</em> <em>de la phénoménologie\nmatérielle</em>, Boston/Leiden: Brill Academic Publishers.</li>\n<li>Kawase, M., 2012, “Genjitsukan no genshogaku: Michel Henry\nto Kimura Bin” [The Sentiment of Reality: Michel Henry and\nKimura Bin], <em>Ritsumeikan bungaku</em>, 625: 1077–1089.</li>\n<li>Kühn, R., 1992, <em>Leiblichkeit als Lebendigkeit. Michel\nHenrys Phänomenologie absoluter Subjektivität als\nAffektivität</em>, Freiburg i. Br.: Alber.</li>\n<li>–––, 2003, <em>Radicalité et\npassibilité. Pour une phénoménologie\npratique</em>, Paris: L’Harmattan.</li>\n<li>–––, 2016, <em>Wie das Leben spricht:\nNarrativität als radikale Lebensphänomenologie. Neuere\nStudien zu Michel Henry</em>, Dordrecht: Spinger.</li>\n<li>–––, 2019, “‘Vitalismus’ und reine Potenzialität bei Michel Henry”, <em>Phänomenologische Forschungen</em>, 1: 53–70.</li>\n<li>Kühn, R. and S. Nowotny (eds.), 2002, <em>Michel Henry:\nSelbsterprobung des Lebens und der Kultur</em>, Freiburg/München:\nAlber.</li>\n<li>Laoureux, S., 2005, <em>L’immanence à la limite</em>,\nParis: Cerf.</li>\n<li>Lavigne, J.-F. (ed.), 2006, <em>Michel Henry. Pensée de la\nvie et culture contemporaine</em>, Actes du colloque international de\nMontpellier 3–5 décembre 2003. Paris: Beauchesne.</li>\n<li>–––, 2009, “The Paradox and Limits of\nMichel Henry’s Concept of Transcendence”,\n<em>International Journal of Philosophical Studies</em>, 17(3):\n377–388.</li>\n<li>–––, 2011, “Souffrance et ipséité selon Michel Henry”, <em>Cahiers Philosophiques</em>, 3: 66–81.</li>\n<li>Longneaux, J.-M., 2004,“Étude sur le spinozisme de\nMichel Henry”, in M. Henry, <em>Le bonheur de Spinoza, suivi de:\nJ.-M. Longneaux, “Étude sur le spinozisme de Michel\nHenry”</em>, Paris: Presses Universitaires de France, 2004,\n153–429.</li>\n<li>Martins, F., 2004, “Michel Henry: beatitude e\nfenomenologia”, <em>Revista Portuguesa de Filosofia</em>, 60(4):\n1031–1040.</li>\n<li>O’Sullivan, M., 2006, <em>Incarnation, Barbarism and Belief.\nAn Introduction to the Work of Michel Henry</em>, Bern: Lang.</li>\n<li>Ricoeur, P., 2014, “Le Marx de Michel Henry”, in Jean,\nG. and Leclercq, J. (eds.), 2014, <em>Lectures de Michel Henry: Enjeux\net perspectives</em>, Louvain: Presses Universitaires de Louvain:\n161–183.</li>\n<li>Rivera, J., 2015, <em>The Contemplative Self after Michel Henry</em>, Notre Dame: Notre Dame University Press.</li>\n<li>Sebbah, J.-D., 2001, <em>L’épreuve de la limite</em>,\n<em>Derrida, Henry, Levinas et la phénoménologie</em>,\nParis: Presses Universitaires de France. English translation by\nS. Barker: <em>Testing the Limit: Derrida, Henry, Levinas, and the\nPhenomenological Tradition</em>, Stanford: Stanford University Press\n2012.</li>\n<li>Seyler, F., 2009, “Michel Henry et la critique du\npolitique”, <em>Studia Phaenomenologica</em>, IX:\n351–377.</li>\n<li>–––, 2010, <em>Barbarie ou culture:\nL’éthique de l’affectivité dans la\nphénoménologie de Michel Henry</em>, Paris:\nKimé.</li>\n<li>–––, 2014, “Fichte in 1804: A Radical\nPhenomenology of Life? On a Possible Comparison Between the 1804\n<em>Wissenschaftslehre</em> and Michel Henry’s\nPhenomenology”, <em>Journal of Speculative Philosophy</em>,\n28(3): 295–304.</li>\n<li>Staudigl, M., 2009, “From the ‘Metaphysics of the\nIndividual’ to the Critique of Society: On the Practical\nSignificance of Michel Henry’s Phenomenology of Life”,\n<em>Continental Philosophy Review</em>, 45(3), 339–361.</li>\n<li>Steinbock, A., 1999, “The Problem of Forgetfulness in Michel\nHenry”, <em>Continental Philosophy Review</em>, 32(3):\n271–302.</li>\n<li>Vidalin, A., 2012, <em>Acte du Christ et actes de l’homme.\nLa théologie morale à l’épreuve de la\nphénoménologie de la vie</em>, Paris: Parole et\nSilence.</li>\n<li>Yamagata, Y., 2006, “Le langage du sentiment”, in\nLavigne 2006: 261–274.</li>\n<li>Zahavi, D., 1999, “Michel Henry and the Phenomenology of the\nInvisible”, <em>Continental Philosophy Review</em>, 32(3):\n223–240.</li>\n</ul>\n<h4 id=\"SpecEditPeri\">Special Edition Periodicals</h4>\n<ul class=\"hanging\">\n<li><em>Philosophie</em>, XV, 1987.</li>\n<li><em>Les Etudes philosophiques</em>, I, 1988.</li>\n<li><em>Annales de philosophie de Beyrouth</em>, 16, 1995 &amp; 18,\n1997.</li>\n<li><em>Communio</em>, XXI, 1996.</li>\n<li><em>Continental Philosophy Review</em>, 32(3), 1999.</li>\n<li><em>Revue philosophique de la France et de\nl’étranger</em>, 3, 2001.</li>\n<li><em>Etudes phénoménologiques</em>, 39–40,\n2004.</li>\n<li><em>Phainomenon</em>, 13, 2006.</li>\n<li><em>Studia Phaenomenologica</em>, IX, 2009.</li>\n<li><em>International Journal for Philosophical Studies</em>, 17(3),\n2009.</li>\n<li><em>Cahiers philosophiques de Strasbourg</em>, 30, 2011.</li>\n<li><em>Cahiers philosophiques</em>, 126(3), 2011.</li>\n<li><em>Alea. International Journal for Phenomenology and\nHermeneutics</em>, 10, 2012</li>\n<li><em>Journal of French and Francophone Philosophy—Revue de\nphilosophie française et de langue française</em>,\nXX(2), 2012.</li>\n<li><em>Revue Internationale Michel Henry</em> (Journal, since\n2010).</li>\n<li><em>Michel Henry kenkyu</em> (Journal in Japanese, since\n2011).</li>\n<li><em>Analecta Hermeneutica</em>, vol. 8, 2016.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Heidegger, Martin",
            "Husserl, Edmund",
            "intentionality",
            "Levinas, Emmanuel",
            "Meister Eckhart",
            "Merleau-Ponty, Maurice",
            "phenomenology",
            "Sartre, Jean-Paul"
        ],
        "entry_link": [
            {
                "../heidegger/": "Heidegger, Martin"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../intentionality/": "intentionality"
            },
            {
                "../levinas/": "Levinas, Emmanuel"
            },
            {
                "../meister-eckhart/": "Meister Eckhart"
            },
            {
                "../merleau-ponty/": "Merleau-Ponty, Maurice"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../sartre/": "Sartre, Jean-Paul"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=michel-henry\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/michel-henry/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=michel-henry&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/michel-henry/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=michel-henry": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/michel-henry/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=michel-henry&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/michel-henry/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://uclouvain.be/fr/instituts-recherche/isp/alpha/bibliographie.html\" target=\"other\">Fonds Michel Henry</a>,\n Université catholique de Louvain (in French).",
            "<a href=\"http://www.uclouvain.be/409215.html\" target=\"other\">Complete Henry Bibliography</a>,\n   (in French)."
        ],
        "listed_links": [
            {
                "https://uclouvain.be/fr/instituts-recherche/isp/alpha/bibliographie.html": "Fonds Michel Henry"
            },
            {
                "http://www.uclouvain.be/409215.html": "Complete Henry Bibliography"
            }
        ]
    }
}