{
    "url": "mysticism",
    "title": "Mysticism",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Richard Jones\n<rhjones2488@gmail.com>\nJerome Gellman",
        "author_links": [
            {
                "mailto:rhjones2488%40gmail%2ecom": "rhjones2488@gmail.com"
            },
            {
                "http://in.bgu.ac.il/humsos/philo/StaffCV/CV%20GELLMAN.pdf": "Jerome Gellman"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nRichard Jones\n&lt;<a href=\"mailto:rhjones2488%40gmail%2ecom\"><em>rhjones2488<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"http://in.bgu.ac.il/humsos/philo/StaffCV/CV%20GELLMAN.pdf\" target=\"other\">Jerome Gellman</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Nov 11, 2004",
        "substantive revision Wed Jun 29, 2022"
    ],
    "preamble": "\n\nUnder the influence of William James’ Varieties of Religious\nExperience, philosophical interest in mysticism has heavily\nfocused on distinctive, allegedly knowledge-granting\n“mystical experiences.” Philosophers have dealt with such\ntopics as the classification of mystical experiences, their nature, to\nwhat extent mystical experiences are conditioned by a mystic’s\nlanguage and culture, and whether mystical experiences furnish\nevidence for the truth of mystical claims. Some philosophers have\nrecently questioned the emphasis on experience in favor of examining\nbroader mystical phenomena. Indeed, “mysticism” is best\nthought of as a constellation of distinctive practices, discourses,\ntexts, institutions, traditions, and experiences aimed at human\ntransformation, variously defined. But this entry will\nconcentrate on the topics philosophers have discussed concerning\nmystical experiences.\n",
    "toc": [
        {
            "#MystExpe": "1. Mystical Experiences"
        },
        {
            "#ClasMystExpe": "2. Classifying Mystical Experiences"
        },
        {
            "#ExtrIntr": "2.1 Extrovertive and Introvertive"
        },
        {
            "#DualMoni": "2.2 Dualistic and Monistic"
        },
        {
            "#TheuNonTheuMyst": "2.3 Theurgic and Non-Theurgic Mysticism"
        },
        {
            "#ApopKataMyst": "2.4 Apophatic and Kataphatic Mysticism"
        },
        {
            "#AttrMystExpe": "3. The Attributes of Mystical Experience"
        },
        {
            "#NoetQual": "3.1 Noetic Quality"
        },
        {
            "#Inef": "3.2 Ineffability"
        },
        {
            "#Para": "3.3 Paradoxicality"
        },
        {
            "#PureConsEven": "4. Pure Consciousness Events"
        },
        {
            "#DefePureConsEven": "4.1 Defenders of Pure Consciousness Events"
        },
        {
            "#DeniPureConsEven": "4.2 Denial of Pure Consciousness Events"
        },
        {
            "#Esse": "5. Essentialism"
        },
        {
            "#Pere": "6. Perennialism"
        },
        {
            "#Cons": "7. Constructivism"
        },
        {
            "#SoftConsArguAgaiPureConsEven": "7.1 Soft Constructivist Arguments Against Pure Consciousness Events"
        },
        {
            "#CritSoftCons": "7.2 Criticism of Soft Constructivism"
        },
        {
            "#HardConsAgaiEsse": "7.3 Hard Constructivism Against Essentialism"
        },
        {
            "#CritHardCons": "7.4 Criticism of Hard Constructivism"
        },
        {
            "#InheAttr": "8. Inherentists and Attributionists"
        },
        {
            "#Epis": "9. Epistemology"
        },
        {
            "#DoxaPracAppr": "9.1 The Doxastic Practice Approach"
        },
        {
            "#ArguExpe": "9.2 The Argument from Experience"
        },
        {
            "#DisaSensExpe": "9.3 Disanalogies to Sense-Experience"
        },
        {
            "#EvalDisaArgu": "9.4 Evaluation of the Disanalogy Arguments"
        },
        {
            "#ArguExpeDepeDoxaPracAppr": "9.5 The Argument from Experience as Dependent on the Doxastic Practice Approach"
        },
        {
            "#ProbReliDive": "9.6 The Problem of Religious Diversity"
        },
        {
            "#ScieStudMediPsyc": "9.7 Scientific Studies: Meditation and Psychedelics"
        },
        {
            "#CritNatuExpl": "9.8 A Critique of Naturalist Explanations"
        },
        {
            "#GendStudMyst": "10. Gender and the Study of Mysticism"
        },
        {
            "#MystMora": "11. Mysticism and Morality"
        },
        {
            "#SecuMyst": "12. Secular Mysticism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Mystical Experiences\n\nBecause of its variable meanings, a definition of “mystical\nexperience” must be partly stipulative. It is common among\nphilosophers to refer to “mystical experience” in a\nnarrow sense: a purportedly nonsensory or\nextrovertive unitive experience by a subject of an\nobject granting acquaintance of realities or states of affairs that\nare of a kind not accessible by way of sense-perception, somatosensory\nmodalities, or standard introspection. A unitive experience\ninvolves the eradication of a sense of multiple discrete entities,\nand the cognitive significance of the experience is deemed to lie\nprecisely in that phenomenological feature. Examples are experiences\nof “union with God,” the realization that one is identical to the\nbeing shared with God or that one is identical to the\nBrahman of Advaita Vedanta (i.e., that the self/soul is identical\nwith the one eternal, absolute reality), experiencing a oneness\nto all of nature, and the Buddhist unconstructed extrovertive\nexperience devoid of a sense of any multiplicity of\nrealities (see Smart 1958, 1978; Wainwright 1981, chap. 1).\nHowever, as discussed in Section 2.2.1, few classical\nmystics refer to their experiences as the union of\ntwo realities: there is no literal “merging” or\n“absorption” of one reality into another resulting in only\none entity. Excluded from the narrow definition are, for example,\nexperiences of “contact” with God in which the subject and\nGod remain ontologically distinct, even if there is a lessening of\nboundaries, or a Jewish Kabbalistic experience of a single\nsupernal sefirah.\n\nA more inclusive definition of “mystical experience” is:\n\nA purportedly nonsensory awareness or a nonstructured\nsensory experience granting acquaintance of realities or states\nof affairs that are of a kind not accessible by way of ordinary\nsense-perception structured by mental conceptions, somatosensory\nmodalities, or standard introspection.\n\n\n“Experience,” “consciousness,” and “awareness” are\nnotoriously difficult to define and will be left unanalyzed here, but\nthe other key terms in the definition can be understood as\nfollows:\n\n\n\n“Purportedly” allows the definition to be accepted without\nnecessarily accepting that mystics ever really do experience realities\nor states of affairs in the way they described. \n\n\n“Nonsenory awareness” includes content of a kind not appropriate\nto sense-perception, somatosensory modalities (including the means for\nsensing pain and body temperature, and internally sensing body, limb,\norgan, and visceral positions and states), or standard introspection.\nSome mystics have referred to a distinct “spiritual” means of\nknowing appropriate only to a non-physical realm (nous,\nintellectus, buddhi). A super sense-perceptual mode\nof experience may accompany sense-perception as in the cases of\n“nature mysticism” or “cosmic consciousness” (Bucke 1901),\nas when, for example, a person has an awareness of God while\nwatching a setting sun. \n\n\n“Nonstructured sensory experience” consists of phenomenological\nsensory content but lacks the conceptualization normally\nstructuring sense-perception. \n\n\n“Acquaintance” of realities in mystical experiences means the\nsubject is putatively aware of one or\nmore realities in a way that overcomes the normal subject/object\nduality: the “acquaintance” is “knowledge by\nparticipation” or “knowledge by identity” (Forman 1990,\nIntroduction). Mystical experiences are allegedly\n“direct,” “unmediated” insights in that sense. \n\n\n“States of affairs” include the impermanence of all reality and\nthat God is the ground of the self. “Acquaintance” of states of\naffairs comes in two forms. In one, a subject is aware of either\n(one or more) realities on which (one or more) states of affairs\nsupervene. An example would be an awareness of God (a reality)\naffording an awareness of one’s utter dependence on God (a state\nof affairs). In its second form, acquaintance of states of affairs\ninvolves an insight directly, without supervening on acquaintance, of\nany reality. An example is coming to “see” the\nimpermanence of all that exists in the phenomenal world. \n\n\nHereafter “mystical experience” will be used in the broader\nsense, unless otherwise noted, not merely for unitive\nexperiences. Correspondingly, the term “mysticism” will refer to\npractices, discourse, texts, institutions, and traditions associated\nwith these experiences. The definition excludes paranormal\nexperiences such as visions, voices, out-of-body experiences,\nand powers such as telepathy. All of these are\n“dualistic” acquaintance of subjects with objects or qualities of\na kind accessible to the senses or to ordinary introspection.\n\nThe subject may not have the mental separation at the time of the\nexperience by which she could tell herself, as it were, what\nrealities or state of affairs were then being disclosed to her. The\nrealization may arise following the experience.\n\nMystical experiences occur within all world religions and\nprobably all primal religions. In some traditions, the experiences are\nallegedly of a supersensory reality, such as God or Brahman. Many\nBuddhist traditions, however, make no claim for an experience of a\nsupersensory reality but instead cultivate an experience of\n“unconstructed awareness” involving an awareness of the world on\na completely or partially non-conceptual level (see\nGriffiths 1993). The non-conceptual experience is thought to\ngrant knowledge of the true nature of phenomenal reality, such\nas the impermanent nature of all things. Prajnaparamita and\nMadhyamaka Buddhists refer to this as the experience of the\n“thusness” (tathata) or\n“thatness” (tattva) of reality that\nis accessible only in the absence of ordinary\nsense-perceptual cognition that is structured by cultural\nconceptions.\n\nIt should be emphasized that mystics value achieving enduring\nstates of consciousness over\ntransient experiences — in particular, they value\nthe personal transformation leading to the enlightened state free of a\nsense of a phenomenal “self” in which they are aligned with the way\nthings really are (as defined by their tradition). Mysticism is a\nmatter of practices and ways of life, not episodic experiences.\n\nCare should also be taken not to confuse “mystical experience” with\n“religious experience.” The latter refers to any experience\nhaving significance appropriate to a religious context. This includes\nmany instances of mystical experiences but also religious visions\nand voices, and various religious feelings, such as religious awe\nand sublimity. Also included is what Friedrich Schleiermacher\nidentified as the fundamental religious experience: the feeling of\n“absolute dependence” (Schleiermacher 1963). Rudolf\nOtto reserved the term “numinous” (from Latin “numen”\nmeaning “divine” or “spirit”) for experiences allegedly of a reality\nperceived of as “wholly other” than the subject, producing a\nreaction of dread and fascination before an incomprehensible mystery\n(Otto 1957). In the sense of “mystical” used here,\nOtto’s numinous experience is a dualistic experience\nand not thus mystical. Your garden-variety sense of God’s\n“presence” would count as a numinous experience. A\n“secular” mysticism is also possible (see Section 12). \n2. Classifying Mystical Experiences\n\nMystical experiences can be classified through various\ndichotomies. (See Wainwright 1981, 33–40 and Jones 2016, 31–34\nfor detailed typologies.) The most common are these:\n2.1 Extrovertive and Introvertive\n\nWalter Stace (1960) fixed the distinction between\n“extrovertive” and “introvertive” mystical experiences in\nphilosophy of mysticism (also see Otto 1932, 57–72). When\nan experience includes sense-perception, it is an “extrovertive”\nexperience. Mystical extrovertive experiences include consciousness of\nthe unity of nature overlaid onto one’s sense-perception of the\nworld, as well as non-unitive extrovertive experiences such as\n“cosmic consciousness.” When not extrovertive, an experience is\n“introvertive.” Examples include the experience of\n“nothingness” — an awareness lacking all\ndifferentiated content — and an awareness of God\nlacking sense-experiences.\n\nExtrovertive mystical experiences are not merely stunted\nintrovertive ones but complete experiences in their own right\n(see Jones 2016; contra Stace 1960). Paul Marshall (2005) has\ndeveloped a detailed phenomenology of these experiences.\n2.2 Dualistic and Monistic\n\nA favorite distinction of Western philosophers is between dualistic\nand monistic experiences. A dualistic experience maintains\nsome distinction, however tenuous, between the subject and what\nis disclosed. Thus, theistic mystical experiences typically are\ndualistic, retaining, at some level, a distinction between God and the\nmystic. Monistic experiences are the extreme of unitive\nexperiences in that they dissolve all duality (Merkur 1999). They\nare either experiences of the absolute ontological oneness of\neverything, free of our conceptual distinctions, or are pure\nconsciousness experiences.\n2.2.1 Union with God\n\nClassical mystics did not usually speak of a true “union with\nGod.” The term “unio mystica” was devised in the\nthirteenth century, but few Christian mystics used that term before\nthe modern era (McGinn 2001, 132; Jantzen 1995) — only\nin the modern study of mysticism has unio mystica received a\ncentral place (McGinn 2006, 427). When Abrahamic mystics\ndo use the language of union, it involves a falling away of the\nseparation between a person and God short of identity: the\nidea is more of “communion” with God than union.\n“Deification” means becoming God-like. All mystical\nexperiences involve overcoming a sense of “self,” but usually not\na sense of becoming another reality. In theisms, this is an\nalignment of spirits, not an ontological union of different substances\nthat were once distinct. Christian mystics used various metaphors.\nHenry Suso (1295–1366) likened union with God to a drop of\nwater falling into wine, taking on the taste and color of the wine\n(Suso 1953, 185); Jan van Ruysbroeck (1293–1381)\ndescribed union as “iron within the fire and the fire within the\niron;” Teresa of Avila (1515–1882) likened the soul\nthat absorbs and is saturated with God to a sponge and\nwater. (See Pike 1992,\nchap. 2; Mommaers 2009.) A “spiritual marriage” of\nthe soul (the bride) and Christ (the bridegroom) is common. Bernard of\nClairvaux (1090–1153) described unification as “mutuality\nof love.” Overall, classical Christian mystics usually\ntreated “becoming one with God” as a loving union of wills\nwith God’s or even a fusion of the mind with God’s (McGinn\n2006, 427–429). Medieval Christian mystics generally interpreted the\nbiblical claim that “it is no longer I who lives but Christ who\nlives in me” (Galatians 2:20) to mean the Holy\nSpirit was filling their mind or spirit resulting in a\ncomplete alignment of one’s will with God’s. In Sufism, when\none’s sense of self passes away (fana), one is filled with\nthe presence of Allah (baqa), although the orthodox Sufis\ninsist that the soul does not cease to exist but only that one is\nunaware of it in the blinding light of the presence of Allah\n(Schimmel 1975).\n2.2.2 Identity with God\n\nTheistic mystics sometimes speak as though they have the awareness of\nbeing fully absorbed into God or even becoming identical\nto God. Examples are the Islamic Sufi mystic al-Husayn al-Hallaj\n(858–922) proclaiming “I am the Real” (see\nSchimmel 1975, chap. 2) and the Jewish Kabbalist Isaac of\nAcre (b. 1291?) who wrote of the soul being completely absorbed\ninto God “as a jug of water into a running\nwell” (Idel 1988, 67). The Hasidic master\nRabbi Shneur Zalman of Liadi (1745–1812) wrote of a\nperson as a drop of water in the ocean of the Infinite with an\nillusory sense of individual “dropness.” The Christian\nmystic Meister Eckhart (c. 1260–1327/8) claimed that we and\nGod share the same being (esse) supplied by a\ntranscendent Godhead (Eckhart 2009, 109). It is still controversial,\nhowever, as to when such declarations are to be taken as assertions of\ntrue identity and when they are hyperbolic variations on descriptions\nof union-type experiences. Shankara’s Advaita gives a nontheistic\nexample: our “essence” (atman) is identical to the only\nreality there is (Brahman) — there is a nonduality\n(a-dvaita) of all essences.\n2.3 Theurgic and Non-Theurgic Mysticism\n\nIn theurgic (from the Greek “theourgia”) mysticism a mystic\nintends to activate the divine (e.g., God’s grace) in a mystical\nexperience (Shaw 1995, 4). Nonetheless, theistic\nmystics typically claim that experiences of God’s activity do\nnot result from their own endeavors. So too, most mystics are not\ninvolved in theurgic activity. The Jewish Kabbalah is the most\nprominent form of theurgic mysticism. In it, the mystic aims to bring\nabout a modification in the inner life of the Godhead (see\nIdel 1988).\n2.4 Apophatic and Kataphatic Mysticism\n\nApophatic mysticism (from the\nGreek “apophasis,” meaning negation or\n“saying away”) is contrasted with kataphatic mysticism (from the\nGreek “kataphasis,” meaning affirmation or\n“saying with”). Apophatic mystics claim that nothing positive can\nbe said about objects or states of affairs that they experience. These\nare absolutely indescribable, or “ineffable.” Thus,\napophatic theology typically will be negative theology — that we\ncan say only what God is not. Kataphatic mysticism does make claims\nabout what a mystic experiences. Pertaining to God, this means\nthat God can be described by positive terms. Analytic philosophers of\nmysticism have mainly dealt with kataphatic conceptions. (For an\nexception see Alston 2005 in the Other Internet Resources.)\n\nShankara’s Advaita Vedanta is apophatic: nothing describing phenomenal\nfeatures can be applied to Brahman. Even discussing Brahman without\nqualities (nirguna-brahman) is still a form of the formless\nBrahman (Brahma-sutra-bhasya III.2.14). So too, Plotinus\nstated that no name applies to the One (Enneads IV.9.5).\nIn a remark echoed by Augustine and Thomas Aquinas about God, he\nwrote that we can only state what the One is not, not what it is\n(Enneads V.3.14). \n\nThe two approaches can represent two stages in mystical contemplation\nwith the apophatic approach usually treated as higher. Theologians\nalso may utilize the apophatic approach (and ineffability) in contexts\nunrelated to mystical experiences. Even the theologian who introduced\nthe via negativa to Christianity, Pseudo-Dionysius the\nAreopagite (c. 500), also wrote works in the affirmative\nkataphatic approach on religious symbolism and the names of God,\nwhile still stressing that God cannot be fully captured by any\nname. \n3. The Attributes of Mystical Experience\n\nThree purported features of mystical experiences are of special\ninterest to philosophers:\n3.1 Noetic Quality\n\nMystical experiences, both introvertive and extrovertive, are\nalleged to be “noetic,” i.e., giving knowledge of what a subject\napprehends (see James 1958). As Chris Letheby puts it: “Noetic\nquality refers to a strong sense of gaining a genuine and unmediated\ninsight, or of encountering ultimate reality; the mystical experience,\nby definition, is felt to be ‘more real than real’” (Letheby 2021,\n25). To what extent this knowledge could come from the experiences\nalone will be discussed in Section 9.\n3.2 Ineffability\n\nWhen classical mystics invoke “ineffability,” it is typically to\naffirm that there is more to what was experienced that can be\nexpressed in any language, not to deny anything can be said about that\nreality. But William James (1958, 292–93) deemed absolute\nineffability or indescribability to be an essential mark of\nmysticism. Even indirect depictions of what is experienced through\nanalogies, metaphors, and art turn it into something like a\nphenomenal object and thus must ultimately be denied. Moreover, it is\nnot always clear whether it is the experience or its alleged\nobject or both that is considered ineffable by a given\nmystic.\n\nA logical problem with ineffability was noted long ago by Augustine:\nGod should not be said to be ineffable, for to say that X is\nineffable is to say something about X, which\ncontravenes ineffability (Augustine 1958, 10–11). This\nproblem has been raised by Alvin Plantinga (1980, 23–25) and\nKeith Yandell (1975).\n\nSeveral responses to this problem are possible. One is to avoid speech\naltogether and remain silent about what is revealed in experience.\nMystics, however, have not been very good at this. A second is to\ndistinguish first-order from second-order attributions, where\n“ineffability” is a second-order term solely about all\nfirst-order phenomenal descriptive terms (Jones 2016, 204–208).\nThat is, to say that something is ineffable would be to assert\nthat it could not be described by any first-order terms, including\n“ineffable.” A third possibility is to say that “X is\nineffable” is really a statement about the\nterm “X,” saying about it that it fails to\nrefer to any describable entity.\n\nA fourth possibility lies in the ongoing negation of whatever is\nsaid about X ad infinitum in an infinite\n“unsaying” or taking back of what has been said (Sells 1994,\nchap. 1). An example of unsaying can be found in the endless negations\nin some Zen Buddhist meditative exercises. Since the truth about\nreality “as it is” lies outside of our conceptualizations of it,\nwe cannot say that truth, only experience it. Hence,\nwhen we say, “Reality is not reality” (i.e., that reality as\nit is differs from what we take it to be conceptually), we must also\nsay that “Reality is not not-reality” to counter an affirmation\nof its nature as not-reality. We must then negate the latter by saying\n“Reality is neither not-reality nor not-not-reality.” And so on. (See\nNhat Hanh, 1994, chap. 5.) But classical mystics typically affirmed,\nas Shankara did with Brahman, that a reality lay behind all\nnegations. So too, Eckhart prayed to God to make him free of God\n(Eckhart 2009, 424, 531) — it is not a denial of God but an\nattempt to get to the Godhead behind God and creation.\n\nWilliam Alston (1991) offers a fifth possibility: when mystics\ntalk about “indescribability,” they refer only to the difficulty\nof describing in literal terms rather than by metaphor, analogy,\nand symbols.\n\nA sixth solution comes from Richard Gale and Ninian Smart each of\nwhom have argued that “ineffability” is merely an honorific\ntitle marking the value and intensity of an experience a mystic\nconsiders profound (Gale 1960; Smart 1958, 69). \n\nAs another possibility, Wayne Proudfoot (1985, 125–27)\nargues that invoking ineffability is not to\ndescribe but to prescribe that no language shall be\napplicable, and so serves to create and maintain a protective sense of\nmystery. However, experiences of ineffability occur in art\nand music (Gallope 2017) and in everyday experience. Think of the\nimpossibility of describing the taste of coffee to someone who has\nnever tasted it (King 1988). This diminishes the “protective\nstrategies” argument.\n\nSome philosophers think that a stress on ineffability signifies an\nattempt to consign mysticism to the irrational, thus excluding it\nfrom more sensible human pursuits, or consign them to the realm of the\nemotions (Jantzen 1995, 344). Others have staunchly defended the\nrationality of mysticism against charges of irrationalism\n(Staal 1975; Jones 2016, chap. 7).\n3.3 Paradoxicality\n\nScholars of mysticism sometimes stress the alleged\n“paradoxical” nature of mystical experiences. Four senses of\n“paradoxical” are relevant. (1) According to its etymology,\n“paradoxical” refers to what is surprising or “contrary to\nexpectation.” (2) Language can be intentionally\n“paradoxical” in using a logically improper form of words to\nconvey what is not intended to be logically absurd. This may be for\nrhetorical effect or because of difficulty in conveying a thought\nwithout resort to linguistic tricks. (3) A “paradox” can involve\nan unexpected logical contradiction, as in the “Liar\nParadox.” (4) “Paradoxicality” may be an\nintended logical contradiction. Walter Stace sees this as a\nuniversal feature of mystical experiences (Stace 1960,\n212). \n\nInsofar as mystical experiences are out of the ordinary, and the\nunitive quality strange to most of us, reports of them may very well\nbe surprising or contrary to expectation. Hence, they may be\nparadoxical in sense (1). Reports of mystical experiences may be\nparadoxical also in sense (2) because at times mystical language\ndoes assume logically offensive forms when actual absurdity may\nnot be intended. Frits Staal argued that paradoxical mystical language\nhas been used systematically to make logically respectable claims\n(Staal 1975). However, paradox in this sense occurs less\nfrequently in first-hand reports of mystical experiences and more in\nsecond-order mystical systems of thought (Moore 1973).\n\nThere is no good reason for thinking that reports of mystical\nexperience must imply logical absurdity, as in (3) or (4). As noted\nabove, while there do occur forms of expression that are\ncontradictory, the contradiction is often removed by the device of\n“unsaying” or canceling out that propels the discourse into\na non-discursive realm.\n\nThe attempt to designate mystical experiences as paradoxical in senses\n(3) and (4) may result from being too eager to take logically deviant\nlanguage literally. For example, Zen Buddhists speak of\nreaching a state of mind beyond both thought and “no-thought” and\nperception and “no-perception” — i.e., having thoughts but\nnot projecting our conceptual distinctions onto reality, thereby\navoiding the fabrication of a false world of discrete\nobjects. Labeling mental activity ceases. No logical\nabsurdity infects this description. While mystics use much literal\nlanguage in describing their experiences (see Alston 1992,\n80–102), the literality need not extend to paradox in senses (3)\nor (4).\n\nBut paradox is only natural in mystical discourse: mystics want to\naffirm something of the nature of what they experienced, but they must\nutilize language originally designed for phenomenal realities and\nso must then deny the ascriptions as not actually applicable. Thus,\nthe paradox of affirming something and then denying it is not\nirrational or nonsense. But we would need to have a mystical\nexperience to see why the features were affirmed and why they are\ndenied as not truly applicable.\n4. Pure Consciousness Events\n\nIs the content of mystical experiences “given” to\na mystic, or is it constructed by the mystic in accordance\nwith the mystical, religious, and cultural tradition in which he or\nshe is embedded? First consider the possibility of “pure\nconsciousness events” (PCEs) — mental events\nthat allegedly involve an “emptying out” by a subject of\nall phenomenological qualities and content (including concepts,\nthoughts, sense-perception, and sensuous images) and yet remaining\nawake, thereby leaving only unconditioned consciousness. Do such\nevents occur? And if they do, how significant are they in\nmysticism?\n4.1 Defenders of Pure Consciousness Events\n\nDefenders of PCEs depend on alleged references to pure consciousness\nin the mystical literature. One example is the Buddhist\nphilosopher Paramaartha (499–569) who stated\nexplicitly that all of our cognitions were “conditioned”\nby our concepts save for the\n“unconditioned” experience of the emptiness of\nphenomena (Forman 1989). Another example is Meister Eckhart\nwho described a “forgetting” that abandons concepts and\nsense-experience to sink into a mystical\n“oblivion” (Forman 1990, 121–159). In addition, Robert\nForman has testified to a PCE he himself underwent (Forman 1990,\nIntroduction).\n4.2 Denial of Pure Consciousness Events\n\nCriticisms of the possibility of PCEs include: (1) Reports\nof PCEs found in the literature may not be decisive in establishing\nthe occurrence of PCEs. We should suspect an\n“idealization” in these reports in which an ideal goal is\npresented as achieved when in fact it wasn’t. Mystics\nthereby remember an experience with content as pure\nconsciousness only because of a “confirmation bias” of what\nwas expected. (2) Reports of “emptying out” and\n“forgetting” may refer only to an emptying of ordinary\nexperiential content, thereby making room for an extraordinary\ncontent. This accords well with the conception of ayin\n(nothingness) in Jewish mysticism, which is positively saturated with\ndivine reality (Matt 1997). For a theist such as Eckhart,\nemptying the mind by “unknowing” is to empty the mind of all\ncontent other than the being that we share with God (Eckhart\n2009, 34–36, 42–43), not an absolute emptiness of content.\n(3) Even if a subject honestly reports on a pure consciousness\nepisode, there may have been conceptual events the subject either\nrepressed or experienced in a nebulous way (Wainwright 1981,\n117–119). The latter simply do not remain for memory. (4)\nSome argue that because of the way our brain has evolved for our\nsurvival, all experience or awareness is necessarily\nintentional. Consciousness is always consciousness\nof something to a subject and hence necessarily contains some\ndualistic content. Thus, because of our nature, there can be no\nexperiences free of any content (Katz 1978). Defenders of the\npossibility of PCEs reply that it is the interpretation of\nthe experience’s content a mystic gives after the experience\nthat reflects cultural ideas, but the experience\nitself is only a pure consciousness.\n\nBut even if PCEs occur, PCE defenders may be exaggerating the\ncentrality in mysticism of complete emptying out. The goal of\nclassical mysticisms is to align oneself with reality (as defined by\none’s tradition) — e.g., attaining the selflessness of nirvana\nor aligning one’s will with God’s. It is questionable if a PCE is\ncentral in mainstream theistic mysticisms where a mystic forgets\nall else usually only to better contemplate God. Typical is the\nChristian mystic Jan Ruysbroeck who wrote that emptying oneself is but\na prelude to the mystical life of contemplating God through an act of\ndivine grace (Zaehner 1957, 170–171). Likewise, the\n“shedding of corporeality” in early Hasidism was meant to\nenable the mystic to contemplate the unified supernal structure of the\ndivine sefirot. And the Zen master Dogen\n(1200–1253) wrote about “wrongly thinking that the nature\nof things will appear when the whole world we perceive is\nobliterated” (Dogen 1986, 39).\n5. Essentialism\n\n“Essentialists” claim that there is a “common core” to all\nmystical experiences independent of culture. That is, the common\nlow-ramified accounts of mystical experiences in different cultures\nand eras reveal that a universal mystical consciousness\n— the PCE — grounds all the different cultural\nexpressions. Alternatively, at least there is a shared\ncommonality of certain phenomenological features in all mystical\nexperiences that is invariant from culture to culture and era to era\neven if all mystical experiences are constructed and so each mystical\nexperience is flavored differently by a particular\nculture. This universal state of consciousness is\nindependent of any religion or culture and produces some\ncommon phenomenological features in all types of mystical experiences.\nThe common core is always culturally mediated in the\nexpressions of each mystic’s culture, but this does not erase\nthe experiential uniformity since experience and interpretation can be\ndistinguished.\n\nThus, essentialists argue there is only one type of\nmystical experience or that all types of mystical experiences\nshare common phenomenological features. For many essentialists\ntoday, the common physiology or neurology of all people regardless of\nculture is responsible for this commonality, not any alleged\nobjects of mystical experiences.\n\nStace’s essentialism has generated much discussion\n(Stace 1960). He proposes two mystical experiences found “in all\ncultures, religions, periods, and social conditions.” First,\nhe identifies a universal extrovertive experience that apprehends\nthe One or the Oneness of all in or through the multiplicity of the\nphenomenal world that is the inner life or consciousness of the\nworld. The Oneness is experienced as a sacred objective\nreality in a feeling of “bliss” or “joy.” This universal\nextrovertive experience (or the experienced reality, it is not always\nclear which) is paradoxical, and possibly ineffable (Stace 1960,\n79). Second, Stace identifies a\nuniversal monistic introvertive experience that “looks\ninward into the mind” to achieve “pure consciousness” —\ni.e., an experience phenomenologically not of anything but\nconsciousness (Stace 1960, 86) — i.e, a PCE. Stace calls\nthis the “unitary consciousness” or the “void and empty unity”\nthat is left when all empirical content is excluded (Stace 1960,\n110). Like his extrovertive experience, Stace’s universal\nintrovertive experience involves a blissful sense of sacred\nobjectivity and is paradoxical and possibly ineffable. Stace\nconsiders the universal introvertive experience to be a ripening of\nmystical awareness beyond the halfway house of the universal\nextrovertive consciousness.\n\nStace assimilates theistic mystical experiences to the PCE by\ndistinguishing between experience and interpretation: theistic mystics\nare conditioned (perhaps subconsciously) by their surroundings to\nput a theistic interpretation on their empty introvertive experiences.\nNinian Smart (1965) concurs: descriptions of theistic mystical\nexperiences reflect an interpretive overlay upon an experiential base\ncommon to both theistic and non-theistic experiences.\n\nThe psychologist Ralph Hood (2006 and 2017)\nargues that psychometric studies provide “strong empirical\nsupport” for the common core thesis. Does the fact that\nneuroscientists have found different patterns in the brain for\ndifferent types of mystical experiences and meditative practices (see\nSection 9.7) mean that the experiences must be different? Even if\nthere is a common neural basis to all mystical experiences, does it\nmean that the phenomenology of the experiences must be identical?\n\nStace has been strongly criticized for simplifying or distorting\nmystical reports (see Moore 1973 for a summary) and for failing\nto properly articulate the differences between extrovertive and\nintrovertive experiences (e.g., Almond 1982, chap. 4). Nelson\nPike (1992, chap. 5) criticized the Stace-Smart position\nbecause in Christian mysticism union with God is divided into\ndiscernible phases, which finds no basis in Christian theology. Thus,\nthese phases plausibly reflect experience, not a culturally-controlled\ninterpretation.\n\nIn contrast to Stace and essentialism in general, R. C. Zaehner\nidentified three distinct types of mystical consciousness: (1) a\n“panenhenic” extrovertive experience in which\none experiences the oneness of nature, one’s self\nincluded; (2) a “monistic” experience of an undifferentiated unity\ntranscending space and time; and (3) the “theistic” experience\nwhere there is a duality between the subject and the object of the\nexperience (Zaehner 1957). Zaehner thought that theistic\nexperiences are an advance over the monistic since the latter, he\nthought, express a self-centered interest of the mystic to be\nincluded in the ultimate. But in his typology he had to tell\nBuddhists what their experiences really were (type 2) despite their\nexplicit rejection of that position. He later admitted that Zen\nmystical experiences did not fit his typology.\n6. Perennialism\n\nEssentialists make a claim about mystical experiences, not\ndoctrines. The term “perennial philosophy” has been a\nmatter of doctrines since Leibniz. In the twentieth century,\nphilosophers dubbed “perennial philosophers” or “perennialists”\nclaimed that there are universal mystical doctrines about what is\nallegedly experienced that transcend all cultures and religions\n— a common core of esoteric doctrines that are expressed\ndifferently in different religions and cultures (Huxley\n1945; Schuon 1975; Smith 1976 and 1987). That is,\nperennialists argued for a universalism of\n“esoteric” mystical doctrines lying beneath the “exoteric”\nexpressions of each salvific religion, not of mystical experiences.\nScholars today who are labelled the “new perennialists” such as\nKenneth Rose (2016) and Steve Taylor (2017) are more properly labelled\n“essentialists.” (Constructivists unnecessarily confuse\nphilosophical issues by mislabeling essentialism as perennialism [see\nJones 2020].)\n7. Constructivism\n\nThe approach that opposes both essentialism and perennialism is\n“contextualism.” Under this approach, all mystical phenomena,\nincluding the mystics’ own understanding of their experiences\nand of what they experienced, must be understood in term of each\nparticular mystic’s culture and era.\n“Constructivists” assert the conceptual\n“construction” of mystical experiences by cultural influences\n— i.e., beliefs, memories, expectations shaped by a mystic’s\ncultural structure the experiences. There are cultural, social,\npsychological, and linguistic influences. Thus, context\npenetrates mystical experiences themselves and not merely the\npost-experiential understanding given by mystics. There is no way to\nseparate mystical experiences completely from their\ninterpretations since our conceptual apparatus shapes our very\nexperience. (See Jones 1909, introduction; Katz 1978\nand 1983; for criticism, see Evans 1989; Forman 1990\nand 1999; Stoeber 1992).\n\n“Soft constructivism” is the view that there are no mystical\nexperiences without at least some structuring from the\nconceptualizations provided by the mystic’s culture. “Hard\nconstructivism” is the view that a mystic’s specific\ncultural background completely determines the alleged cognitive content\nof all mystical experiences, not merely shapes or influences an\nindependent experiential element. On the assumption that mystical\ntraditions are widely divergent, hard constructivism entails the\ndenial of both essentialism and perennialism. Soft constructivism\nis consistent with essentialism, however, since it is consistent with\nthere being some transcultural mystical experiences involving\nconceptualizations common across mystical traditions.\n“Nonconstructivism” is the view that some or all mystical experiences\nare in fact free of any cultural influence, and the divergence in\nunderstanding their content comes from post-experiential\ninterpretations.\n\nConstructivism is based on prevailing philosophical theories of the\nnature of consciousness. Nonconstructivists, as noted below, can\ninvoke some suggestive work in neuroscience. But the principal\ndifficulty in resolving the issue of constructivism is that we only\nhave mystics’ post-experiential accounts, which all parties agree are\nshaped by a mystic’s culture — we can never get to the\nexperiences themselves to see if they are constructed or not.\n7.1 Soft Constructivist Arguments Against Pure Consciousness Events\n\nBoth soft and hard constructivist arguments have been mobilized\nagainst the possibility of PCEs. Here is a sampling of soft\nconstructivist arguments:\n\n\n\nPCEs are impossible because of the “kind of beings” that we are\n(Katz 1978, 59). It is a fact about being human that we can\nexperience only with the aid of memory, language, expectations, and\nconceptualizations. Thus, we cannot have a\n“pure” awareness empty of all content. (Also see\nSection 4.2). \n\n\nWe should distinguish an “experience” from an “event”\n(Proudfoot 1985, chap. 4; Bagger 1999, chap. 4). That\nX has an experience E entails that X\nconceptualizes E during the event. Hence, even if pure\nconsciousness events happen to occur, they do not count as\n“experiences” until the subject conceptualizes them, and\nat that moment they cease to be “pure\nconsciousness.” \n\n\nA survey of mystical literature shows that mystical experiences always\nhave conceptual content and thus are not empty of\nconceptualizations. \n\n\nSubjects could not know they had undergone a PCE if the\nexperience were truly empty of all conceptual content\n(Bagger 1999, 102–103) since there would be nothing to\nobserve while it is going on, and hence nothing to retain later. Nor\ncould a subject surmise that a PCE had transpired by remembering a\n“before” and an “after” with an unaccounted for middle. This\nwould fail to distinguish a PCE from plain unconsciousness. \n\n\nSuppose a PCE has occurred and that a subject somehow knows that.\nStill, there is a problem of the relationship of a PCE to the\nsubsequent claims to knowledge: if a PCE were empty of all\nexperiential content, the experiencers could not claim to have\nhad acquaintance of anything (Bagger 1999,\n102–103). Nothing could be retained from the experience to\nshape a mystic’s beliefs or values. \n\n\nSo too, if PCEs were empty of everything but a featureless\nconsciousness, they could not have an impact on the life of a\nmystic, and yet the experiences do have an impact.\nThus, the state must have some differentiated content. \n\n7.2 Criticism of Soft Constructivism\n\nSeveral objections can be raised against soft constructivism:\n\n\n\nWhile our cultural sets shape our ordinary experience, there is no\ngood reason to believe that we could not enjoy experiences on a\npre-conceptual level of awareness, especially through a regimen of\ntraining. The constructivist Steven Katz notes our “most\nbrutish, infantile, and sensate levels” of experience when we\nwere infants (Katz 1988, 755). It is hard to see why in principle\nwe could not retrieve such an unconceptualized level of\nexperience. \n\n\nIt makes little difference whether a PCE is called an\n“experience” or an “event.” A PCE occurs within a wider\nexperience of the subject, including the subject’s coming out of\nthe PCE and assigning it meaning. Let this wider experience be the\n“experience” under discussion, rather than the PCE alone.\n\n\n\nNeuropsychological studies of mystical experience point to the\npossibility of a state of pure consciousness. For example,\na theory by Eugene d’Aquili and Andrew Newberg (1999)\naccounts for PCEs by reference to occurrences in the brain that cut\noff ordinary brain activity from consciousness. (Also see Hood 2006\nand Section 9.7 below.) \n\n\nThere may be no problem about mystics knowing they had PCEs. If\nwe accept a reliabilist account of knowledge, a belief is knowledge if\nproduced by a reliable cognitive mechanism (perhaps with some further\nconditions). In order to have knowledge, a person does not have to be\naware of and judge evidence, nor be cognizant of the reliability of\nthe mechanism that produces the knowledge. Hence, “awakening” from\nwhat is in fact a PCE, if it produces the belief that one has\n“awakened” from a PCE, could be a reliable cognitive mechanism\nsufficient for knowing one had had a PCE. If we stick to an\nevidentialist conception of knowledge, mystics might be able to have\nevidence they had undergone a PCE, though not at the time of its\noccurrence, since a conscious event can have elements that one\ndoes not note at the time but recalls afterward. This is\nespecially possible when the recall immediately follows the event.\nThat is, some content was retained and the experience was not truly\nempty, even if the content is only a nondual consciousness.\nTherefore, it should be possible for a mystic who undergoes a PCE to\nrecall immediately afterward the awareness that was present in the\nPCE, even though that awareness was not an object of consciousness at\nthe time of the PCE. \n\n\nDefenders of PCEs can champion their epistemological significance,\nalthough PCEs are not experiences of anything. The\nnoetic quality of a mystical experience can come from an acquaintance\nof states of affairs involving an insight directly, without\nsupervening on acquaintance of any reality. Nor need the insight be\nsimultaneous with the occurrence of the experience but may arise\nlater. Hence, a person could undergo a PCE that granted acquaintance\nof states of affairs by a direct insight. The PCE plus the insight\nwould constitute a complex mystical experience that afforded awareness\nof a state of affairs not otherwise accessible. \n\n7.3 Hard Constructivism Against Essentialism\n\nHard constructivism’s main argument against essentialism and\nPCEs is as follows (Katz 1978):\n\n\nPremise A: The conceptual scheme a mystic possesses completely\ndetermines the nature and content of the mystical experience.\n\nPremise B: Mystics from different mystical traditions possess\npervasively different conceptual schemes.\n\nConclusion: Therefore, there cannot be a common experience across\ncultural traditions. That is, essentialism is false.\n\n\nRegarding Premise B, Katz (2013) has edited a massive volume on\nmysticism with the aim of displaying the stark differences between\nmystical experiences of different traditions, due to linguistic,\ncultural, religious, and sociological factors.\n\nSo too, theistic experiences are theory-laden and even their\ninterpretation as theistic is the result of being embedded in a\npropensity to think theistically. That is why, allegedly, such\nexperiences are rarely reported by those not already theists or in\ntheistic communities. Such experiences, then, are “polluted” by\ntheory (Oppy 2006, 350).\n7.4 Criticism of Hard Constructivism\n\nSome objections to hard constructivism are not objections to soft\nconstructivism:\n\n\n\nIt seems quite possible for subjects in the first instance to apply\n“thin” descriptions to experiences, involving only a small\npart of their conceptual schemes. Perhaps only on second thought will\nthey elaborate on their experience in terms of the richness of their\nhome culture. This would be like a physician with a headache, who\nexperiences pain in the first instance just like ordinary folk and\nonly subsequently applies medical terminology to the headache (compare\nKing 1988). If so, there is a possibility of common\nfirst-instance mystical experiences across cultures, contrary to\nPremise A. \n\n\nPremise A is thrown into further doubt by expressions of surprise by\nmystics-in-training about what they experience (Gellman\n1997, 145–146 and Barnard 1997, 127–130).\nSo too, constructivists have trouble accounting for why some mystics\nbecome heretics (Stoeber 1992, 112–113) — under\nconstructivism, their mystical experiences should reinforce\ntheir orthodoxy. These illustrate the possibility of getting out from\nunder one’s cultural background to have new experiences.\nLikewise, hard constructivism’s inherently conservative take on\nmysticism will struggle to explain transformations within mystical\ntraditions, and cannot easily account for innovative geniuses within\nmystical traditions.  \n\n\nTwo people walk together down the street and see an approaching dog.\nOne experiences the dog as “Jones’s pet black\nterrier” while the other experiences it as “a stray mutt that the\ndog-catchers should take away.” Because of the excessive\nconceptual differences in their experiencing, constructivist must\ninsist that there was no worthwhile sense in which both observers had\nthe same experience. However, there is a valuable sense in which\nthey are having the same experience: seeing that black dog at that\nplace and time. Similarly, there might exist a\nvaluable commonality of experiences across mystical traditions\ndespite conceptual disparity. The conceptual differences might not be\nsufficient to deny this important commonality (Wainwright 1981,\n25). \n\n\nCultural conditioning does not influence everyone to the same degree\nand in the same way. Individuals have rich and varied personal\nhistories that influence their experiences in their lives in\nwidely differing ways. Some accept cultural restraints\ngladly, others rebel against them, others are blessed with a\ncreative spirit, and so on. \n\n\nMystical traditions characteristically involve disciplines aimed at\nloosening the hold of one’s conceptual scheme on subsequent\nexperience. Meditative techniques promote a pronounced inhibition\nof ordinary cognitive processes — what Arthur Deikman (1980)\nlabelled “deautomization.” This plausibly restricts the influence\nof one’s cultural background on one’s mystical\nexperiences, in turn making possible identical experiences across\nmystical traditions to the extent that our neurology is the same in\nrelevant respects. \n\n\nHard constructivists also fail to account well for widely\ndiffering mystical understandings of the same religious text. For\nexample, the metaphysics of the Upanishads and Brahma\nSutra is an absolute nondualism for Shankara (c.\neighth century CE), a “qualified dualism” for Ramanuja (c.\n1055–1137), and a strict dualism for Madhva\n(1199–1278). (See Radhakrishnan 1968,\nintroduction.) Likewise, the teaching of emptiness in the\nBuddhist Heart Sutra receives disparate unpacking in\ndifferent streams of Buddhism. It is plausible to conclude that\ndistinct mystical experiences were responsible, at least in part, for\nthese differences. If so, the experience control the mystics’\nunderstanding of their basic scriptures rather than vice\nversa. \n\n\nMore generally, hard constructivists overemphasize the influence\nof pre-mystical religious teaching on the mystic’s experience.\nMystical experiences can cause a mystic to reinvent the meaning of\ndoctrines. An example is the Jewish Kabbalistic transformation of the\nnotion of mitzvah (“commandment”) to that of\n“joining” or “connection” with God. Starting\nwith “commandment,” the mystic ends up with\n“clinging” (devekut) to God. \n\n8. Inherentists and Attributionists\n\n“Inherentists” believe that there are experiences that are\ninherently religious or mystical. “Attributionists” believe that there\nare no inherently religious or mystical experiences (see Proudfoot\n1985) — experiences are only deemed religious by\nthe subject or a group. Ann Taves contends that people or\ngroups have experiences of what afterward strikes them\nas “special.” Only then, depending on various factors, will\nthey attribute a religious or mystical meaning to\nthem (Taves 2009). Some neuropsychological\nresearch seems to support this position (Azari et\nal. 2001). Taves also rejects constructivism: constructivists\nsee religious or mystical experiences to be constituted from the\nvery start by cultural conditioning, but attributionists\ndeny this in favor of a tiered or\n“block-building” approach from experiencing something\n“special” to a religious or mystical conclusion.\n\nWilliam Forgie (1984 and 1994) argues, as would an\nattributionist, that there could not be an “experience of God” if\nwe understand “experience of God” to mean that it is\nphenomenologically given in the experience itself that\nan experience is in fact of God. He argues that phenomenological\ncontent can consist only of general features and not features\nspecifically identifying God as the object of experience. He compares\nthis to seeing one of two identical twins. Which one of the two you\nperceive cannot be a phenomenological given. Likewise, that\nsomeone experiences precisely God and not something else cannot\nbe a phenomenological datum. Pike (1992, chap. 7) argues,\nagainst Forgie, that the individuation of an object can be a component\nof the phenomenological content of an experience, drawing on examples\nfrom sense-perception.\n\nWe can distinguish “inherently religious” from “inherently\nmystical.” Today it is increasingly becoming apparent that\nmystical experiences are real: there is evidence of distinctive\nconfigurations of brain activity uniquely associated with mystical\nexperiences (e.g., Newberg, d’Aquili, and Rause\n2001, 143; Yaden et al. 2017, 60). However, by\n“real,” neuroscientists mean only that mystical experiences\ninvolve distinct neurological events and are not merely ordinary\nexperiences interpreted as mystical or products of the imagination,\nnot that they are necessarily cognitive. If unique patterns of\nbrain activity do underlie different mystical experiences,\nthen it may be that there are some experiences that are inherently\nmystical even though their significance varies\nbetween different religious and nonreligious experiencers and\nthus these experiences are not inherently\nreligious. \n9. Epistemology\n\nWilliam James asked: “Do mystical states establish the truth\nof those theological affections in which the saintly life has its\nroots?” (1958, 415). This question can be divided into two: (Q1)\nIs a mystic warranted in thinking that his or her experiences are\nveridical or have evidential value? A mystical experience may be\npsychologically compelling for the person who had it, but is it also\ncognitively authoritative? And (Q2), are those who have not\nundergone any mystical experience, upon examining the evidence\npresented by mystics, warranted in thinking them veridical or endowed\nwith evidential value? The major philosophical reply in the\naffirmative to Q1 is called the “Doxastic Practice Approach.” The\nmajor defense of an affirmative reply to Q2 is called the\n“Argument from Experience.”\n9.1 The Doxastic Practice Approach\n\nWilliam Alston has defended the beliefs that\npeople form from their mystical and numinous experiences,\nspecifically of a theistic kind, based on their “doxastic\npractice.” He defines a “doxastic practice” as consisting of\nsocially established ways of forming and epistemically evaluating\nbeliefs (the “output”) from a certain kind of content from various\ninputs, such as cognitive and perceptual ones (Alston 1991, 100;\nalso see Alston 2005, chap. 9–11). The practice is beholden to\nan “over-rider system” which is a background system of beliefs\nagainst which beliefs supported by the practice are checked for\npossible over-riders. The practice of forming physical-object beliefs\nbased on sense-perception is an example of a doxastic practice;\ndrawing deductive conclusions from premises is another. Alston (1993)\nargues that the justification of every doxastic practice is\n“epistemically circular” — i.e., its reliability cannot be\nestablished in any way independent of the practice itself. This\nincludes sense-perception practice. However, we cannot avoid\nengaging in doxastic practices. Therefore, Alston contends, it is\na matter of practical rationality to engage in the doxastic\npractices we do engage in providing there is no good reason to think\nthey are unreliable.\n\nThere are also doxastic practices consisting of forming beliefs about\nGod, God’s purposes for us, and the like, grounded on religious\nand mystical experiences such as “God is now appearing to\nme.” The Christian doxastic practice has an over-rider\nsystem consisting of scriptures, Christian dogma, and guidelines\nresulting from the past history of the mystical Christian doxastic\npractice. It follows from Alston’s argument that it is rational\nfor a person engaged in such a practice to take its belief\noutputs as true unless the practice is shown to be unreliable. Thus we\nhave an affirmative answer to question Q1.\n\nMost objections to Alston are equally objections to the Argument from\nExperience or come from general epistemological complaints.\nObjections that apply specifically to Alston include Jonathan\nKvanvig’s (1994) faulting of Alston for a loose employment of\n“rationality.” He argues that no one meaning of that term can do\nthe work Alston does with it. Another objection is that Alston moves\nfrom “It is practically rational to engage in a Christian doxastic\npractice” to “It is rational for me to believe the Christian\ndoxastic practice is reliable.” Others argue that there is a\nproblem with the construction of the over-rider system of the\nChristian mystical practice since the guidelines gleaned from the\nhistory of the practice, so it is argued, were compromised by\nandrocentric bias and outdated scientific beliefs. (See Section 10.)\nThese detract from the practice’s epistemic legitimacy\n(Gellman 2011).\n\nIt is also a question whether the Christian doxastic practice approach\nis able to justify conversion experiences since in such experiences\nthe subject is not yet Christian and cannot employ the Christian\nover-rider system when becoming convinced to accept the Christian\npractice and its over-rider system.\n9.2 The Argument from Experience\n\nVarious philosophers have defended the evidential value, to one degree\nor another, of some religious and mystical experiences, principally\nwith regard to experiences of God (see Baillie 1939,\nBroad 1953, Davis 1989, Gellman 1997 and 2001a,\nGutting 1982, Swinburne 1991 and 1996, Wainwright 1981,\nYandell 1993). These philosophers have stressed the\n“perceptual” nature of experiences of God. This approach can be\nsummarized as follows:\n\n\n\nExperiences of God have a subject/object structure with a\nphenomenological content allegedly representing the object of the\nexperience. Subjects are also moved to make truth claims based on such\nexperiences. Furthermore, there are mystical procedures for getting\ninto position for a mystical experience of God (see Underhill 1911 [1945,\n90–94]), and others can take up a suitable mystical path to try\nto check on the subject’s claims (see Bergson 1977, 210). In all\nthese ways, experiences of God are perceptual in nature. \n\n\nSuch experiences count as at least some evidence in favor of\ntheir own validity. That a person seems to experience some object is\nsome reason to think he or she really does have experiential contact\nwith it. Thus, experiences of God count as at least some evidence\nin favor of their own validity. \n\n\nAgreement between experiences of people in different places, times,\nand traditions enhances the evidence in favor of their validity\n(see Broad 1953). Hence, agreement about experiences of God in\ndiverse circumstances enhances the evidence in their favor. (But see\nSection 9.6.) \n\n\nFurther enhancement of the validity of a mystical experience can come\nfrom appropriate consequences in the life of the person who had the\nexperience, such as increased saintliness (see Wainwright 1981,\n83–88). William James proposed a pragmatic\n“fruit” test for determining true mystical doctrines (James\n1958, 368): if a mystical experience produces positive results in\nhow one leads one’s life, then the experience is authentic and\nthe way of life one follows is vindicated, and so the teachings\nleading to the positive life are correct. In short, the\n“truth” of one’s beliefs are shown by one’s\nlife as a whole. (But what is considered positive fruit in one\nmystical tradition may not be considered so in another.) \n\n\n(1)–(4) yield initial evidence in favor of the validity of\n(some) experiences of God.\n\nKai-Man Kwan has developed this type of argument further by specifying\ntheistic experience, in particular, as a “well-established type\nof experience.” The tokens of such a type of experience occur to\nmany people and on repeated occasions, have a common ontology, and are\ncommunicable in a coherent conceptual framework. This strengthens an\nargument from experience for theistic experience (Kwan 2011,\n511).\n\nKwan (2011 and 2013) has also significantly expanded the Argument from\nExperience in a way that avoids focusing only on experiential\nepisodes. He argues for what he calls a “holistic\nempiricism” that considers an array of dimensions of human\nexperience: the noetic (consisting of epistemic seemings), the\nqualitative (the feel of what it is like to have the\nexperience), and the volitional (action, choice, deliberation,\nand the like). Kwan argues that when judging the credentials of\nreligious experience we should take into account the following\nexperiences, in addition to narrowly selected religious experiences:\nexperiences of the natural world and of the self, existential\nexperience, interpersonal experience, moral experience, aesthetic\nexperience, and intellectual experience. Kwan argues that the\nintegration, in the appropriate way, of these types of experience\ncoherently and fruitfully constitutes a defeasible justification for\nrelying on the product of religious belief. Kwan argues in this way\nfor theistic belief in particular. A similar argument can be presented\nfor judging narrowly construed mystical experience. The unit of\njustification of believing a proposition when having had a mystical\nexperience would be the entire holistic complex of all of the\nmystic’s experiences. Going beyond, but including, discrete\nmystical episodes, the mystic is able to fashion a cumulative case for\nmystical conclusions.\n\nKwan’s argument avoids the objection based on dissimilarities\nbetween mystical experiences and sense-experience. The unit of\njustification then encompasses far more than the mystical experience\nitself. Kwan’s argument also neutralizes objections based on\nneuroscience against the validity of mystical experiences: belief in\nthe import of mystical experience will seek justification far beyond\nwhat can be possibly identified as a brain state\naccompanying a mystical experience.\n\nWhether any experiences of God are veridical in the end will depend on\nthe strength of the initial evidential case, on other favorable\nevidence, and on the power of counter-considerations against validity.\nDefenders of the Argument from Experience differ over the strength of\nthe initial evidential case and have defended the Argument\nagainst counter-evidence to varying degrees.\n9.3 Disanalogies to Sense-Experience\n\nSeveral philosophers have argued against either the Doxastic Practice\nApproach or the Argument from Experience, or both (see Bagger\n1999; Fales 1996a, 1996b, and 2001; Gale 1991,\n1994, and 1995; C.B. Martin\n1955; M. Martin 1990; Proudfoot 1985; Rowe 1982). Philosophers\nhave disputed the Argument from Experience on the grounds of alleged\ndisanalogies between experiences of God and sense-perception. Two\nissues must be examined: whether the disanalogies exist, and if\nthey do exist, whether they are epistemologically significant.\n9.3.1 Lack of Checkability\n\nThe analogy allegedly breaks down over the lack of appropriate\ncross-checking procedures for experiences of God. With\nsense-perception, we can cross-check by employing inductive methods to\ndetermine causally relevant antecedent conditions; we can\n“triangulate” an event by correlating it with other\neffects of the same purported cause; and we can discover causal\nmechanisms connecting a cause to its effects. These are not available\nfor checking on experiences of God. Evan Fales (2001 and 2010)\nargues that cross-checkability is an integral part of any\nsuccessful perceptual epistemic practice. Therefore, the perceptual\nepistemic practice in which mystical experiences of God are embedded\nis severely defective. Moreover, Richard Gale (1991) argues that\nin experiences of God there is missing agreement between perceivers as\nwell as missing the possibility of checking whether the perceiver was\nin the “right” position and psychological and\nphysiological state for a veridical experience. For similar reasons,\nC.B. Martin (1955) concludes that claims to have experienced God are\n“very close” to subjective claims like “I seem to\nsee a piece of paper” rather than to objective claims like “I\nsee a piece of paper.”\n\nWilliam Rowe (1982) observes that God may choose to reveal himself to\none person and not to another. Thus, unlike with sense-perception, the\nfailure of others to have an experience of God under conditions\nsimilar to those in which one person did, does not impugn the validity\nof the experience. Therefore, we have no way of determining when an\nexperience of God is delusory. If so, neither can we credit an\nexperience as authentic.\n9.3.2 God’s Lack of Space-Time Coordinates\n\nSome philosophers have argued that there could never be evidence for\nthinking a person had perceived God (Gale 1994 and\n1995; Byrne 2001). For there to be evidence that a person\nexperienced an object O, and did not merely have an\n“O-ish-impression,” it would have to be possible for there\nto be evidence that O was the common object of different perceptions.\nIn turn, this would be possible only if it were possible to\ndistinguish perceptions of O specifically from possible\nperceptions of other objects that might be perceptually similar to O.\nThis latter requirement is possible only if O exists in both space and\ntime. Only space-time coordinates make it possible to distinguish O\nfrom objects of similar appearance existing in other space-time\ncoordinates. God, however, does not exist in space and time.\nTherefore, there could never be evidence that a person had experienced\nGod.\n9.4 Evaluation of the Disanalogy Arguments\n\nAlthough Alston defends the perceptual character of mystical\nexperiences of God for his Doxastic Practice Approach, there is no\nrestriction that the experiential input of a doxastic\npractice must be perceptual in nature. Any cognitive input will do.\nHence, disanalogies between experiences of God and sense-perception,\neven if great, would not be directly harmful to this approach\n(Alston 1994).\n\nRegarding the bearing of the alleged disanalogies on the Argument from\nExperience, the disanalogists take the evidential credentials of\nsense-perception as paradigmatic for epistemology. They equate\nconfirming and disconfirming evidence only when evidence strongly\nanalogous to the kind for sensory perception is available. However,\nthe evidential requirement should be only “confirming\nexperiential evidence,” be what it may. If God-sightings have\nconfirming evidence, even if different from the kind available for\ndualistic sense-perception, they will then be evidentially\nstrengthened. If God-sightings do not have much confirming empirical\nevidence, be it what it may, they will remain unjustified for that\nreason, and not because they lack cross-checks appropriate to\nsense-perception.\n\nPerhaps the justification of physical-object claims should not be\nour evidential standard since our ordinary physical-object\nbeliefs are far over-supported by confirming evidence. We have\nextremely large constellations of confirming networks there.\nHence, it does not follow that were mystical claims justified to a\nlesser degree than that, or not by similar procedures, that they would\nbe unjustified at all.\n\nA problem with the argument from God’s lack of dimensionality is\nthat the practice of identifying physical objects proceeds by way of\nan interplay between qualitative features and relative positions to\ndetermine both location and identity. The judgments we make reflect a\nholistic practice of making identifications of place and identity\ntogether. There is no obvious reason why the identification of God\ncannot take place within its own holistic practice, with its own\ncriteria of identification, not beholden to the holistic practice\ninvolved in identifying physical objects. (See Gellman 2001a,\nchap. 3.)\n9.5 The Argument from Experience as Dependent on the Doxastic Practice Approach\n\nIn the end, the Argument from Experience might have to yield to the\nDoxastic Practice Approach (Gellman 2010). One reason is that it is\ndoubtful if many experiencers of God make truth claims solely on the\nbasis of their mystical experiences, rather than within a doxastic\npractice. For example, Teresa of Avila said that one can tell if an\nexperience comes from God or from the Devil by its fruits in actions\nand personality, the vividness of the memory of the experience,\nconformity to Christian scripture, and confirmation by church\nsuperiors. Mystical experiences as such were given no special\nauthority. Classical mystics in general did not take their mystical\nexperiences as verifying the doctrines of their basic scriptures but\nvice versa — the fundamental scriptures vouched\nfor the validity of genuine mystical experiences.\n\nIn addition, if identification of God takes place in\na holistic practice (see Sections 9.2, 9.4), then quite plausibly\nthis is a social practice in which one judges one’s mystical\nexperiences to be of God.\n\nFinally, it is an open question to what extent alleged God-experiences\nare sufficiently detailed to provide grounds to the subject that they\nare of God. Hence, a subject’s judgment that a\nparticular encounter is with God might well be a matter of\nassimilating the event into a larger social practice.\n9.6 The Problem of Religious Diversity\n\nEssentialists and others often rely on the alleged uniformity of\nclaims of mystics around the world. In William James’s words,\nthere is an alleged “eternal unanimity” among mystics\n(James 1958, 321). But as he also realized, “if we take the\nlarger mass as seriously as religious mysticism has historically taken\nitself, we find that the supposed unanimity largely\ndisappears” (James 1958, 325). Constructivists in particular\nemphasize the diversity of mystical experiences, indeed for\nthem each mystical experience is utterly unique.\n\nDiversity of claims, and especially any genuinely conflicting claims,\nwould impact the Argument from Experience for the epistemic value of\nmystical experiences. In the history of religions, we find innumerable\ngods, with different characteristics. Shall we say they all exist? Can\nbelief in all of them be rational? In addition, there are experiences\nof non-personal ultimate realities, such as the Brahman of Advaita\nVedanta. Brahman cannot be an ultimate reality if God is\n(Hick 1984, 234–235) since it is devoid of all personal\nfeatures. Furthermore, different theistic faiths claim experience of\nthe one and only God, ostensibly justifying beliefs that are in\ncontradiction with one another (see Flew 1966, 126). If theistic\nmystical experiences lead to such contradictory results,\nthey cannot provide evidence in favor of their validity\nas experiences of God.\n\nConflicting mystical claims thus lead to the issue of the\nreliability of mystical experiences as a source of\nknowledge: whatever the correct understanding of each type of mystical\nexperience is, many (perhaps most) mystics have\nmisunderstood their own experiences. Mystical experiences may put\nmystics in contact with a previously unrealized reality, but\nmystics’ diverse and conflicting understandings of that reality\ndamaged their claim to have gained actual knowledge. Once mystics are\naware of competing claims, whether the experiences can be\nauthoritative even for the experiencers themselves, as James believed\n(James 1958, 324, 414), becomes an issue.\n\nIn reply, many discount experiences of polytheistic gods straight away\nbecause of their being embedded in settings we today take to be\nbizarre, and because of the relative paucity of reports of actual\nexperiences of such beings. Regarding clashing experiences within\ntheistic settings, Richard Swinburne (1991, 266) has proposed an\nascent to generality as a harmonizing mechanism. He believes that\nconflicting descriptions of the objects of religious experience pose a\nchallenge only to detailed doctrinal claims, not to general claims of\nhaving experienced a supernal being.\n\nPhilosophers and theologians may rank different types of mystical\nexperiences according to their cognitive importance. For example,\nMichael Stoeber ranks theistic experiences occurring after a mystical\nexperience empty of all differentiated content to be higher in\nimportance, calling them “theo-monistic” experiences (Stoeber\n1994). But Advaitins would discount all theistic\nexperiences as instances in which the mind is not yet clear of\nillusory content.\n\nJohn Hick (1984, chap. 14) has proposed a pluralistic\nhypothesis to deal with the problem. According to this\nhypothesis, the great world faiths embody different perceptions and\nconceptions of one reality that Hick christens “the Real.” The\nReal itself is indescribable and is never experienced\ndirectly but has “masks” or “faces” that depend on\nhow a particular culture or religion thinks of the Real that are\nexperienced. The Real itself is, therefore, neither personal nor\nnonpersonal, these categories being imposed upon the Real by different\ncultural contexts. Hence, the typical experiences of the major faiths\nare to be taken as validly of the Real through mediation by the\nlocal face of the Real.\n\nHick has been criticized for infidelity to the world’s religious\ntraditions (d’Costa 1987). However, Hick is providing\na second-order philosophical theory about the nature of\nreligions rather than an exposition of religions themselves that\nmembers necessarily would endorse.\n\nSome propose harmonizing some conflicting experiences by reference to\nGod’s “inexhaustible fullness” (Gellman 1997, chap.\n4). In at least some mystical experiences of God, a subject\nexperiences what is presented as proceeding from an intimation of\ninfinite plenitude. Given this feature, a claim to experience a\npersonal ultimate (God) can be squared with an experience of a\nnonpersonal ultimate (e.g., the “unspeakable” Dao): the same one\nreality can be experienced in its personal attributes or in its\nnonpersonal attributes from out of its inexhaustible plenitude\n— e.g., nontheists experience the sheer being of the reality\nwhile theists experience its personal nature.\n\nWhether any of these solutions succeed, the body of experiential data\nis too large to simply scrap on the grounds of contradictory\nclaims. We should endeavor to retain as much of the conflicting data\nas possible by seeking some means of conciliation.\n\nBut it must be noted that religious theorists are just as willing\nas naturalists to tell mystics that they are mistaken about the\ncontent of their experiences. For example, Caroline Franks Davis has\nto twist the Advaitins’ and Buddhists’ accounts to show\nthat mystical experiences really support a “broad theism” —\ni.e., Shankara was really experiencing God although he explicitly\nargued that the nonpersonal and non-loving Brahman alone is real, and\nthe Buddha was totally unaware that he was experiencing a god. She\nclaims that all mystics, despite what they say, really experience “a\nloving presence . . . with whom individuals can have a personal\nrelationship” (Franks Davis 1989, 191). That is just what\none would expect someone raised a Christian to see as the true\n“common core” of all mystical experiences. But the same\nprocess, mutatis mutandis, would be available for nontheists\nraised in other traditions for their claims. \n\nAs things stand, the diversity problem raises the issue of how much is\ngiven in mystical experiences and how much is a matter of\ninterpretation based on a tradition’s beliefs. This limits how much\nactual knowledge mystics can claim.\n9.7 Scientific Studies: Meditation and Psychedelics\n\nVarious psychological explanations of mystical experiences, both their\nnature and their causes, have been offered. These include\npathological conditions such as hyper-suggestibility, severe\ndeprivation, severe sexual frustration, intense fear of death,\ninfantile regression, pronounced maladjustment, and mental illness, as\nwell as non-pathological conditions, including the inordinate\ninfluence of a religious mental “set” (see\nWulff 2000). In addition, some have advanced a sociological\nexplanation for some mysticism in terms of the socio-political\npower available to an accomplished mystic (Fales 1996a\nand 1996b).\n\nIn the 1990’s, interest revived in studying meditation and psychedelic\ndrugs to see what they may reveal about how the brain works. Different\nmeditative techniques (especially mindfulness meditations) are now\nbeing studied through neuroimaging to gain data on the brain activity\noccurring during these experiences and practices. (For an overview,\nsee Schjoedt 2009.) Losing a sense of a phenomenal “self”\nnecessarily alters our ordinary ego-driven state of consciousness.\n(See Millière et al. 2018 for an overview on different senses\nof “loss of self” and their phenomenological\ndifferences.) Thus, the phenomenology of mystical\nexperiences also has become an important subject for the\nstudy of consciousness. As noted in Section 8, neuroscientists are\nfinding unique patterns of brain activity during mystical\nexperiences. Different neurophysiological effects and unique\npatterns of brain activity have also been detected in mindfulness\npractices and in introvertive concentration practices (Hood 1997\nand 2001; Dunn, Hartigan, and Mikulas 1999). The\nneurological effects of concentration differ from those\nof mindfulness meditation (Valentine and Sweet 1999). This\nsuggests as strongly as neuroscience can that the\nmystical experiences enabled by meditation differ from more\nordinary experiences and our normal waking state of consciousness and\nthat the effects of different types of meditations are\ndistinguishable. Possible neural correlates of different mystical\nfeatures — a loss of a sense of self, a sense of connectedness\nto others, a feeling of certainty, feeling the experience has great\nsignificance, loss of a sense of time — have been identified.\nFor example, a loss of a sense of self is correlated to the decrease\nof activity in the brain connected to a sense of self and a sense of\nseparation from the world.\n\nThe study of the mystical experiences enabled by psychedelics (in\nparticular, psilocybin and LSD) is now also a major topic (Barlett and\nGriffiths 2018). Psychedelics are reported to occasion some of the\nmost spiritually significant experiences in the life of the\nparticipants (Doblin 1991). There is also the clinical study of\npsychedelics in therapy for such conditions as depression\nand addiction that are resistant to more conventional forms of\ntherapy. An important issue is whether the positive effects of a\npsychedelic drug on a patient’s well-being are the result solely of\nthe chemical effect of the drug on the brain or whether the\nmystical experiences enabled by the drugs are also a necessary part of\nthe treatment. \n\nThis research leads to philosophical issues. Does brain activity\nalone cause these experiences, or does meditation or a\npsychedelic drug merely disrupt our normal state of\nconsciousness thereby enabling new experiences to arise that\nare not caused by brain activity itself? If the former, can the\nalleged cognitive content of mystical experiences be discounted\nbecause mystical experiences are reduced to “merely brain events”? If\nthe latter, does the same brain state underlie different\nmeditation and psychedelic-enabled experiences? If so, the\nsituation is the opposite of the “multiple realization” problem in\nphilosophy of mind: multiple experiences are connected to the same\nbrain state. So too, the question remains of whether\nneuroscientists are actually studying mystical experiences at all by\nstudying neural activity correlated with them. (See Jones 2018, 2016,\nchap. 9.) Concerning psychedelics, the most\nimportant question is whether the mystical experiences\nenabled by psychedelics are mere hallucinations that are no more\ncognitive than the LSD-induced distortions of perception.\nAnother important question is whether the experiences enabled by\nthe drugs are the same as “natural” mystical experiences\nor only pale copies. And does the fact that such experiences can\nbe touched off fairly consistently by drugs with the proper dosage and\na conducive “set and setting” for the participant\nmean that the experiences are only products of the brain? Or\ndo the drugs only set up new conditions in the brain\nenabling new experiences to occur that are not caused by brain\nactivity? (See Smith 1964 and 2005; Letheby 2021;\nJones 2019.)\n9.8 A Critique of Naturalist Explanations\n\nBertrand Russell (1935, 188) once quipped that “We can make no\ndistinction between the man who eats little and sees heaven and the\nman who drinks much and sees snakes. Each is in an abnormal physical\ncondition, and therefore has abnormal perceptions.” C.D. Broad (1935,\n164) wrote, to the contrary, “One might need to be slightly\n‘cracked’ in order to have some peep-holes into the\nsuper-sensible world.” Thus, the issue is engaged whether we can\nexplain away religious and mystical experiences by reference to\nnatural causes. Can science “explain away” mystical\nexperiences by showing that “It’s all in the head”?\n\nIf all mystics had a demonstrable pathology or brain-defect, a\nnaturalist explanation would carry great weight. However, that is\nnot the case. Naturalist proposals often exaggerate the scope and\ninfluence of the cited factors, sometimes choosing to highlight what\nis eye-catching at the expense of the more common\noccurrences.\n\nFor an example of the overreach and problem of simple reductive\nexplanations, consider a popular pathological explanation: temporal\nlobe epileptic seizures (e.g., Persinger 1987, 111).\nHowever, ecstatic experiences of well-being, self-transcendence, and\ncertainty from temporal lobe epileptic seizures are very rare (1% to\n2% of patients) (Devinsky and Lai 2008). That may be\nsignificantly less common than in the general population. Nor are all\nmystical experiences “ecstatic” in the emotional sense —\nserenity and calm characterize many mystical experiences. The\nepileptic experiences usually last only a few seconds out of a larger\nepisode and usually are not a matter of joy but fear and anxiety\n(Kelly and Grosso 2007, 531–534). If seizures were the cause,\nwhy the vast majority of patients do not have mystical experiences\nwould have to be explained. Moreover, visions and voices are more\ncommon than mystical experiences for these patients. Mystical\nexperiences have a different phenomenological content, but studies\naligned with the temporolimbic model truncate and misrepresent the\n“felt” phenomenological features of mystical experiences (Bradford\n2013, 113).\n\nNor can we simply assume that mystics in the past must have had some\npathology despite their lack of observable symptoms —\na study of medieval Christian mystics and ascetics did not turn\nup evidence of any major forms of mental illness such as schizophrenia\nor manic-depressive disorder (Kroll and Bachrach 2005).\nToday mystical experiences have been correlated with healthy\nindices of personality and adjustment (Hood and Byrom 2010, Griffiths\net al. 2011). Mystical experiences also more often correlate with\npositive changes in family life, reduced fear of death, better health,\nand a greater sense of purpose, although some patients do require\ntherapeutic care, than do pathological experiences (Yaden et al.\n2017, 59). The loss of a sense of self outside of mystical experiences\nis associated with maladaptive outcomes such as a sense of\ndisconnection to other people and a loss of empathy (Yaden et al.\n2017, 59). The pathology model does not explain any of this. It also\nmakes emotion, rather than cognition, the central feature of mystical\nexperiences, and this does not jibe with the historical record\n(Bradford 2013).\n\nIn sum, these pathologies may be one possible trigger, but they are\nnot a total explanation. Secondly, at least some of the proposals are\nperfectly compatible with the validity of claims that mystics\nexperience a transcendent reality. For example, a person’s\nreligious mental set can just as well be a condition for enjoying and\nbeing capable of recognizing an experience of God as it can\nbe a cause of delusion. However, there might be\nnaturalist explanations that would make it implausible that God\nwould appear in just certain ways.\n9.8.1 Evaluation of Neuropsychological Explanations\n\nIn principle, neuroscience can give as complete an account of brain\nactivity during a mystical experience as it can for any conscious\nevent or state. But a neuropsychological theory can do no more\nthan relate what happens in the brain when a mystical experience\noccurs, and merely identifying the activity does not discredit\nmystical claims any more than a neurological account of perception\ndiscredits sense-experience as cognitive — all human\nexperiences have some grounding in neural activity.\nNeurology cannot tell us that the ultimate cause of brain events\nis altogether internal to the organism. True, there may not\nbe “God-receptors” in the body, analogous to those\nfor sensory perception, and this might reinforce a suspicion that\nit’s all in the head. However, such receptors are neither to be\nexpected nor required with non-physical stimuli, as in mystical\nexperiences. For example, God, Brahman, or the Dao would not\nexist at a physical distance from the brain. Thus, God could act\ndirectly upon the brain to bring about the relevant processes for a\nsubject to perceive God or otherwise use a natural medium\n(see Wainwright 1981, chap. 2). In sum, simply identifying and\nexplaining what is occurring in the brain while a mystical experience\nis occurring is neutral to whether that is all there is to producing\nthe experience.\n\nPlausible natural explanations would tend to discredit religious\nexplanations of mystical experiences only if people with pathologies\nor negative psychological conditions had mystical experiences.\nBut as noted in the last section, that is not the\ncase. Nevertheless, plausible natural explanations do\nweaken the religious case by offering a reasonable\nalternative — there is competition for the best explanation\nwhere before there was none.\n9.8.2 The Claimed Superiority of Naturalist Explanation\n\nSome philosophers have argued that because the “modern\ninquirer” assumes everything is ultimately explicable in\nnaturalist terms, we should in principle reject any supernatural\nexplanation of mystical experience (see Bagger 1999). Invoking\nGod to explain mystical experiences is like invoking miracles to\nexplain natural phenomena. We should match our elimination of miracles\nfrom our explanatory vocabulary with an elimination of a supernatural\nexplanation of mystical experiences of God. Hence, we do not have to\nwait until we discover a live alternative explanation to the theistic\nexplanation of mystical experiences of God. We should resist any\ntheistic explanation in the name of our epistemic standards.\n\nThis argument raises the important question of the relationship\nbetween theistic explanation and a naturalist program of\nexplanation. Arguments have been presented for the compatibility of\nreligion and natural science (e.g., Swinburne 1989 and Plantinga\n2011). Of course, a person for whom supernatural explanations\nare not a live option would have reason to reject the Argument\nfrom Experience and refuse to engage in a doxastic practice of\nidentifying valid God-experiences. However, most defenders of the\nArgument from Experience advance it as at best a defensible line of\nreasoning rather than as a proof of valid experiences of God that\nshould convince anyone, and the Doxastic Practice Approach is not\nmeant to convince everybody to participate in a theistic doxastic\npractice (see Gellman 2001b). The bar is lowered from advancing\nassent-compelling proofs to establishing merely the\nrationality of participation in a doxastic practice that\nwould justify belief.\n10. Gender and the Study of Mysticism\n\nSome feminist philosophers have criticized what they perceive as the\nandrocentric bias of male philosophers of mysticism. There are three\nmain objections:\n\n\n\nContemporary male philosophers treat mysticism as centered\non private psychological episodes of a solitary person. They\nbelieve these private experiences reveal the meaning and value of\nmysticism (Jantzen 1994 and 1995; also see Turner 1996). Instead,\nphilosophers should be studying the socio-cultural dimensions of\nmysticism, including its patriarchal failings. Sarah Coakley (2009)\nmaintains that the focus of mysticism should be on the ongoing\ncontemplative practice and all that entails. \n\n\nAt times. scholars of mysticism have systematically ignored or\nmarginalized much of women’s mysticism. Closer attention to\nwomen would reveal the androcentric bias in mystical\nstudies (Jantzen 1995). Nancy Caciola (2000 and 2003)\nargues that the criteria the Christian church developed for authentic\nmystical experiences curtailed the power of women in the church. For\nexample, on the basis of theories about female physiology, women were\ndeemed more vulnerable to devil possession than men and so their\nexperiences were more suspect. Coakley (2009) also notes that while\nsome analytic philosophers attend to the mysticism of Teresa of Avila,\nthey do not do justice to the full content of her mystical writings,\npicking out experiences only. \n\n\nThe traditional male construction of God has determined the way male\nphilosophers think of theistic experiences. Thus, theistic experiences\nare conditioned from the outset by patriarchal conceptualizations\nand values, and by sex-role differentiation in the practice of\nreligion (Raphael 1994). \n\n\nUnder this view, men typically understand theistic\nexperience as a human subject encountering a being wholly distinct,\ndistant, and overpowering. A paradigm of this approach is the numinous\nexperience of a “wholly other” reality that is unfathomable\nand overpowering, engendering a sense of dread and fascination in\nwhich the mystic is “submerged and overwhelmed” by his own\nnothingness (Otto 1957). Otto claims that this is the\nfoundational experience of religion. This approach, it is claimed, is\nmediated by the androcentrism of Otto’s worldview, entrapped in\nissues of domination, atomicity, and submission. Some feminist\nthinkers deny the dichotomy between the holy and the creaturely that\nmakes Otto’s analysis possible\n(Daly 1973, Goldenberg 1979). Feminist theologians\nstress the immanent nature of the object of theistic experiences, and\nbring to prominence women’s experience of the holy in their\nfleshly embodiment, denigrated by androcentric attitudes.\n\nFeminists have also supported the constructivist position in the\nname of anti-essentialism and diversity of experience\n(Lanzetta 2005, chap. 1). Thinking that there is a\ncommon unconstructed essence to mystical experience has worked\nagainst the recognition of women’s experiences as properly\nmystical.\n\nThe feminist critique poses a valuable corrective to unperceived\nandrocentric biases in mysticism and mystical studies. This critique\nshould help neutralize the conception of mysticism and mystical\nexperience as completely private, introduced to philosophy largely by\nWilliam James. Objection (2) has begun to produce scholarship\ndedicated to women’s mysticism and its significance (e.g.,\nHurcombe 1987, Brunn and Epiney-Burgard 1989,\nBeer 1993, Borchert 1994, Hollywood 2002). Several\ncollections on women mystics have helped change the over-emphasis on\nmale mystics (in particular, Furlong 2013). Regarding (3):\nthe rich variegation of religious and mystical experience\namong men throughout history must also be considered. This\nincludes men’s experiences of God’s immanent closeness as\nwell as mystical “union” with God, unlike Otto’s dualistic\nnuminous experiences. \n\nThe principal impact of the feminist critique on philosophy of\nmysticism would be to give more reasons to expand the consideration of\nmysticism to more than episodic experiences.\n11. Mysticism and Morality\n\nSome scholars maintain that there is an intrinsic connection between\nmysticism and moral behavior, or even that mystical experiences are\nthe source and only justification of a moral concern for others. This\nis because mystical experiences blur or erase the\ndistinction between the subject and others (Stace 1960) and so\nremove the barrier to moral motivation, or because one’s sense of\na “self” disappears entirely. Several scholars have argued, to the\ncontrary, that at least some mystical doctrines are\nincompatible with morality (Danto 1987, Kripal 2002). Monistic\nmystical metaphysics eliminates all distinctions between one person\nand others — all is one — and so there is no recognition\nof real persons distinct from oneself toward whom one can exercise a\nmoral concern. Hence, monistic mysticism precludes morality. Morality\nmust be between “independently real persons” (Wainwright\n1983, 211–212). David Loy (2002) argues that even if monistic\nmorality is not incompatible with morality, it fails to reveal the\nbest way to help people with compassion. Others argue that morality\ncan get off the ground with the ability to conceptualize “the\nwelfare of others” without the need to recognize others as\nontologically distinct beings (Zelinski 2007).\n\nOthers maintain that there is no intrinsic connection between mystical\nexperience and moral behavior: one can empty oneself of all\nself-centeredness and self-interest without necessarily adopting a\nconcern for others. Enlightened mystics may no longer be\nself-centered, but they can be either moral or indifferent to others\n(Jones 2016, chap. 9). We need look no further than to Christian\ncomplaints about mystical antinomian excesses of the “Free\nSpirits,” the Mahayana Buddhist rejection of the alleged\nselfishness of the Arhat ideal in Theravada Buddhism, or the moral\nscandals of some Eastern mysticism in the West today (Kripal 2002). If\nmoral behavior is part of a mystical way of life, it does not issue\nfrom mystical experiences but from a mystic’s cultural\nbackground and training. The normative behavioral standards of the\ngroup are not derivable from mystical experiences. Mystical\nexperiences, so the claim goes, in themselves are nonmoral. Thus,\nmuch will depend on the moral or nonmoral orientation of the mystical\npractices meant to lead to mystical experiences. The resulting\nbehavior will be a consequence of both the practices undertaken to\nreach mystical experience and the resulting detachment of the selfless\nmystical state (Jones 2004).\n12. Secular Mysticism\n\nThe new scientific interest in meditation (especially mindfulness),\nthe new cultural interest in meditating for limited psychological or\nphysiological benefits rather than transforming one’s entire\ncharacter, and the utilization of psychedelics in psychotherapy have\ngiven rise today to a new phenomenon — “secular mysticism.” Awe\nand wonder at nature is prominent, but this mysticism is not a matter\nof “nature mysticism” or of aesthetic experiences as possible\ntriggers of mystical experiences. Rather, the interest is in the\npsycho-physiological effects of meditation and psychedelics, with\nmystical experiences understood within a naturalist framework.\nNeuroscience appears to validate the positive effects of meditation\nand psychedelics on our well-being. Secular forms of meditation for\nlimited benefits, such as Jon Kabat-Zinn’s\nmindfulness-based stress reduction program. Secularists can disconnect\ntraditional practices from a mystical tradition (e.g.,\nBatchelor’s “secular Buddhism” [2015]) or focus only on\nlimited practices (e.g., Harris 2014, Letheby 2017).\n\nMysticism becomes “naturalized.” It is reduced from a full way of life\nto eliciting mystical experiences for limited benefits or as mere\nrecreation. Mystical experiences break the sense of a narrow\n“self’” and makes one feel connected to others and the rest of\nthe world, and secularists see this in terms of the natural world\nalone. This naturalist spirituality appears more tied to mystical\nexperiences than other psychedelic experiences (Letheby 2021, 200).\nPatients often attach great spiritual importance to mystical\nexperiences even if their metaphysics remains naturalist (see\nGriffiths 2011). Mystical experiences often touch off awe and wonder\nat the universe and being alive and also an interest in the “big\nquestions” of philosophy and science even if the experiences\nthemselves are not taken to be cognitive. That mystical\nexperiences may involve transcendent realities or may give knowledge\nof reality is either denied in favor of a naturalist metaphysics,\nor the issue is simply ignored. In fact, while mystical experiences\nare normally seen in terms of transcendent realities, these\nexperiences may lead those inclined toward naturalism to becoming\nconvinced that there is no god or life after death and to abandoning\nreligion entirely (Newberg and Waldman 2016, 60, 67–81).\n\nSecular mysticism raises three central philosophical questions. First,\nit impacts the epistemological question of whether mystical\nexperiences give any insight into reality or other knowledge. If the\nexperiences do not necessarily lead to cognitive claims, we have to\nask whether mystics’ knowledge-claims come only from their\ntradition and ask what role mystical experiences actually play. The\nissue of whether mystical experiences have any epistemic or\nontological implications becomes clearer. Second, it highlights\nthe issue of the role of cultural interpretation in understanding\nmystical experiences and the constructivist claim that cultural\ninfluences penetrate some or all mystical experiences. Third, can the\neffect of mystical experiences lead to a meaningful or purposeful life\nwithout reference to transcendent realities?\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Almond, Philip C. 1982. <em>Mystical Experience and\nReligious Doctrine</em>, Berlin: Mouton Press.",
                "Alston, William. 1991. <em>Perceiving God: The\nEpistemology of Religious Experience</em>, Ithaca: Cornell University\nPress.",
                "–––. 1992. “Literal and\nNonliteral in Reports of Mystical Experience,” in <em>Mysticism\nand Language</em>, Steven T. Katz (ed.), New York and Oxford: Oxford\nUniversity Press, 80–102.",
                "–––. 1993. <em>The Reliability of\nSense Perception</em>, Ithaca: Cornell University Press.",
                "–––. 1994. “Reply to\nCommentators,” <em>Philosophy and Phenomenological\nResearch</em>, 54: 891–899.",
                "–––. 2005. <em>Beyond\n“Justification”: Dimensions of Epistemic Evaluation</em>,\nIthaca: Cornell University Press.",
                "Augustine. 1958. <em>On Christian Doctrine</em>, D. W. Robertson,\nJr. (trans.), Indianapolis: Bobbs-Merrill.",
                "Azari, Nina P. et al. 2001. “Neural\nCorrelates of Religious Experience,” <em>European Journal\nof Neural Science</em>, 13: 1649–52.",
                "Bagger, Matthew C. 1999. <em>Religious Experience,\nJustification, and History</em>, Cambridge: Cambridge University\nPress.",
                "Baillie, John. 1939. <em>Our Knowledge of God</em>,\nLondon: Oxford University Press.",
                "Barnard, G. William. 1997. <em>Exploring Unseen\nWorlds: William James and the Philosophy of Mysticism</em>,\nAlbany: SUNY Press.",
                "Barrett, Frederick S. and Roland R. Griffiths. 2018.\n“Classic Hallucinogens and Mystical Experiences: Phenomenology\nand Neural Correlates,” in Adam L. Halberstadt, Franz X. Vollenweider,\nand David E. Nichols (eds.), <em>Behavioral Neurobiology of\nPsychedelic Drugs</em>, New York: Springer, 393–430.",
                "Batchelor, Stephen. 2015. <em>After Buddhism: Rethinking the\nDharma for a Secular Age</em>, New Haven: Yale University Press.",
                "Beer, Frances. 1993. <em>Women and Mystical Experience\nin the Middle Ages</em>, Woodbridge: Boydell Press.",
                "Bergson, Henri, 1977 [1935]. <em>The Two Sources of Morality\nand Religion</em>, R. A. Audra and C. Berenton (trans.), Notre\nDame: University of Notre Dame, 1977.",
                "Borchert, Bruno.1994. <em>Mysticism, Its History and\nChallenge</em>, York Beach, Maine: Samuel Weiser.",
                "Bradford, David T. 2013. “Emotion in Mystical\nExperience,” <em>Religion, Brain &amp; Behavior</em>, 3(2):\n103–118.",
                "Broad, C.D. 1939. “Arguments for the Existence of\nGod, II,” <em>The Journal of Theological Studies</em>, 40:\n156–67.",
                "–––. 1953. <em>Religion, Philosophy,\nand Psychical Research</em>, London: Routledge, and Kegan Paul.\n1939. “Arguments for the Existence of God, II,”\n<em>The Journal of Theological Studies</em>, 40:\n156–67.",
                "Brunn, Emilie Zum and Epiney-Burgard,\nGeorgette. 1989. <em>Women Mystics in Medieval\nEurope</em>, Sheila Hughes (trans.), New York: Paragon\nHouse.",
                "Bucke, Richard M. 1901. <em>Cosmic Consciousness: A Study in the\nEvolution of the Human Mind</em>, New York: Dutton.",
                "Byrne, Peter. 2001. “Perceiving God and\nRealism,” <em>Philo</em>, 3: 74–88.",
                "Caciola, Nancy. 2000. “Mystics, Demoniacs, and the\nPhysiology of Spirit Possession in Medieval Europe,”\n<em>Comparative Studies in Society and History</em>, 42:\n268–306.",
                "–––. 2003. <em>Discerning\nSpirits: Divine and Demonic Possession in the Middle Ages</em>,\nIthaca: Cornell University Press.",
                "Coakley, Sarah. 2009. “Dark Contemplation and Epistemic\nTransformation: The Analytic Theologian Re-meets Teresa of\nAvila,” in <em>Analytic Theology, New Essays in the Philosophy\nof Theology</em>, Oliver D. Crisp and Michael C. Rea (eds.), Oxford:\nOxford University Press.",
                "Daly, Mary. 1973. <em>Beyond God the Father: Toward\na Philosophy of Women’s Liberation</em>, Boston: Beacon\nPress.",
                "Danto, Arthur. 1987. <em>Mysticism and Morality:\nOriental Thought and Moral Philosophy</em>, New York: Columbia\nUniversity Press.",
                "d’Aquili, Eugene and Andrew Newberg. 1999. <em>The\nMystical Mind: Probing the Biology of Religious Experience</em>,\nMinneapolis: Fortress Press.",
                "D’Costa, Gavin. 1987. <em>John Hick’s\nTheology of Religions: A Critical Evaluation</em>, Lanham: University\nPress of America.",
                "Deikman, Arthur. 1980. “Deautomatization and the\nMystic Experience,” in <em>Understanding Mysticism</em>,\nRichard Woods (ed.), Garden City: Doubleday, 240–69.",
                "Devinsky, Orrin and George C. Lai. 2008. “Spirituality and\nReligion in Epilepsy,” <em>Epilepsy &amp; Behavior</em>, 12(4):\n636–643.",
                "Doblin, Rick. 1991. “Pahnke’s ‘Good Friday\nExperiment’: A Long-Term Follow-Up and Methodological\nCritique,” <em>Journal of Transpersonal Psychology</em>, 23(1):\n1–28.",
                "Dogen. 1986. <em>Shobogenzo: Zen Essays by\nDogen</em>, Thomas Cleary (trans.), Honolulu: University of\nHawai‘i Press.",
                "Dunn, Bruce R., Judith A. Hartigan, and William L. Mikulas. 1999.\n“Concentration and Mindfulness: Unique Forms of\nConsciousness,” <em>Applied Psychophysiology and\nBiofeedback</em>, 24(3): 147–165.",
                "Eckhart, Meister. 2009. <em>The Complete Mystical Works of Meister\nEckhart</em>, Maurice O’C. Walshe (ed. and trans); rev. by\nBernard McGinn, New York: Crossroad.",
                "Evans, Donald. 1989. “Can Philosophers Limit What Mystics\nCan Do? A Critique of Steven Katz,” <em>Religious Studies</em>\n25(1): 53–60. ",
                "Fales, Evan. 1996a. “Scientific Explanations of\nMystical Experiences, Part I: The Case of St\nTeresa,” <em>Religious Studies</em>, 32:\n143–163.",
                "–––. 1996b. “Scientific\nExplanations of Mystical Experiences, Part II,” <em>Religious\nStudies</em>, 32: 297–313.",
                "–––. 2001. “Do Mystics See\nGod?” in <em>Contemporary Debates in the Philosophy of\nReligion</em>, Michael L. Peterson (ed.), Oxford: Blackwell.",
                "–––. 2010. <em>Divine Intervention:\nMetaphysical and Epistemological Puzzles</em>, New York:\nRoutledge.",
                "Flew, Antony. 1966. <em>God and Philosophy</em>, London:\nHutchinson.",
                "Forgie, William.1984. “Theistic Experience and the\nDoctrine of Unanimity,” <em>International Journal of the\nPhilosophy of Religion</em>, 15: 13–30.",
                "–––. 1994. “Pike’s Mystic Union\nand the Possibility of Theistic Experience,” <em>Religious\nStudies</em>, 30: 231–242.",
                "Forman, Robert K. C. 1989. “Paramartha and Modern\nConstructivists on Mysticism: Epistemological Monomorphism versus\nDuomorphism,” <em>Philosophy East and West</em>, 39:\n393–418.",
                "––– (ed.). 1990. <em>The Problem of Pure\nConsciousness, Mysticism and Philosophy</em>, New York: Oxford\nUniversity Press.",
                "–––. 1999. <em>Mysticism, Mind,\nConsciousness</em>, Albany, NY: State University of New\nYork Press.",
                "Franke, William. 2007. <em>On What Cannot be\nSaid: Apophatic Discourses in Philosophy, Religion, Literature,\nand the Arts</em>, 2 vols., Notre Dame: Notre Dame University\nPress.",
                "Franks, Carolyn Davis. 1989. <em>The Evidential\nForce of Religious Experience</em>, Oxford: Clarendon Press.",
                "Furlong, Monica. 2013. <em>Visions &amp;\nLongings: Medieval Women Mystics</em>, Boston: Shambhala\nPublications.",
                "Gale, Richard M. 1960. “Mysticism and\nPhilosophy,” <em>Journal of Philosophy</em>, 57:\n471–481.",
                "–––. 1991. <em>On the Nature and\nExistence of God</em>, Cambridge: Cambridge Press.",
                "–––, 1994. “Why Alston’s\nMystical Doxastic Practice is Subjective,” <em>Philosophy and\nPhenomenological Research</em>, 54: 869–875.",
                "Gallope, Michael. 2017. <em>Deep Refrains: Music,\nPhilosophy, and the Ineffable</em>, Chicago: University of Chicago\nPress.",
                "Gellman, Jerome. 1997. <em>Experience of God and the\nRationality of Theistic Belief</em>, Ithaca: Cornell University\nPress.",
                "–––. 2001a. <em>Mystical Experience of\nGod: A Philosophical Enquiry</em>, London: Ashgate Publishers.",
                "–––. 2001b. “Review of Matthew\nBagger, <em>Religious Experience, Justification, and\nHistory</em>,” <em>Faith and Philosophy</em>, 18(4): 345–364.",
                "–––. 2010. “A Problem for the Christian\nMystical Doxastic Practice,” <em>Philo</em>, 13(1):\n23–28.",
                "–––. 2011. “Credulity and\nExperience of God,” <em>Philo</em>, 10(2):\n114–124.",
                "Goldenberg, Naomi. 1979. <em>The Changing of the\nGods</em>, Boston: Beacon Press.",
                "Griffiths, Paul J. 1993. “Pure Consciousness and\nIndian Buddhism,” in <em>The Problem of Pure Consciousness,\nMysticism and Philosophy</em>, Robert Forman (ed.), New York: Oxford\nUniversity Press, 121–159.",
                "Griffiths, Roland R. et al. 2011. “Psilocybin\nOccasioned Mystical-Type Experiences: Immediate and Persisting\nDose-related Effects,” <em>Psychopharmacology</em>, 218(4):\n649–665.",
                "Gutting, Gary. 1982, <em>Religious Belief and Religious\nSkepticism</em>, Notre Dame, IN.: University of Notre Dame.",
                "Harris, Sam. 2014. <em>Waking Up: A Guide to Spirituality Without\nReligion</em>, New York: Simon &amp; Schuster.",
                "Hick, John. 1989. <em>An Interpretation of Religion:\nHuman Responses to the Transcendent</em>, London: Macmillan.",
                "Hollywood, Amy. 2002. <em>Sensible Ecstasy: Mysticism, Sexual\nDifference and the Demands of History</em>, Chicago: Univ. of\nChicago.",
                "Hood, Ralph W., Jr. 1997. “The Empirical Study of\nMysticism,” in <em>The Psychology of Religion: Theoretical\nApproaches</em>, Bernard Spilka and Daniel N. McIntosh (eds.),\n222–232. Boulder, CO: Westview Press.",
                "–––. 2001. <em>Dimensions of Mystical\nExperiences: Empirical Studies and Psychological\nLinks</em>, Amsterdam: Rodopi.",
                "–––. 2006. “The Common Core Thesis in\nthe Study of Mysticism,” in <em>Where God and Science Meet</em>\n(Volume 3: The Psychology of Religious Experience), Patrick McNamara\n(ed.), 119–38, Westport CT: Praeger.",
                "–––. 2017. “Self-Loss in Indigenous\nand Cross-Cultural Psychologies: Beyond Dichotomies?”\n<em>Research in the Social Scientific Study of Religion</em>\n28: 112–132.",
                "Hood, Ralph W., Jr. and G. N. Byrom. 2010. “Mysticism,\nMadness, and Mental Health,” in <em>The Healing Power of\nSpirituality: How Faith Helps Humans Thrive</em>, vol. 3, J. Harold\nEllens (ed.), Santa Barbara, CA: Praeger, 171–191.",
                "Hurcombe, Linda (ed.). 1987. <em>Sex and\nGod: Varieties of Women’s Religious Experience</em>, New\nYork: Routledge &amp; Kegan Paul.",
                "Huxley, Aldous. 1945. <em>The Perennial Philosophy</em>,\nNew York: Harper &amp; Bros.",
                "Idel, Moshe. 1988. <em>Kabbalah: New Perspectives</em>,\nNew Haven: Yale University Press.",
                "Idel, Moshe and Bernard McGinn (eds.). 1996. <em>Mystical\nUnion in Judaism, Christianity, and Islam: An Ecumenical\nDialogue</em>. New York: Continuum.",
                "James. William. 1958 [1902]. <em>The Varieties of\nReligious Experience</em>, New York: Mentor Books.",
                "Jantzen, Grace M. 1994. “Feminists, Philosophers,\nand Mystics,” <em>Hypatia</em>, 9: 186–206.",
                "–––. 1995. <em>Power, Gender, and\nChristian Mysticism</em>, Cambridge: Cambridge University Press.",
                "Jones, Richard H. 2004. <em>Mysticism and Morality: A\nNew Look at Old Questions</em>, Lanham, MD: Lexington Books.",
                "–––. 2016. <em>Philosophy of\nMysticism: Raids on the Ineffable</em>, Albany: State University\nof New York Press.",
                "–––. 2018. “Limitations on the Neuroscientific\nStudy of Mystical Experiences,” <em>Zygon: Journal of Science\nand Religion</em>, 53(4): 992–1017.",
                "–––. 2019. “Limitations on the\nScientific Study of Drug-Enabled Mystical Experiences,”\n<em>Zygon: Journal of Science and Religion</em>, 54(3):\n756–792.",
                "–––. 2020. “On Constructivism in the\nPhilosophy of Mysticism,” <em>Journal of Religion</em>, 100 (no.\n1): 1–41.",
                "Jones, Rufus M. 1909. <em>Studies in Mystical\nReligion</em>, London: Macmillan.",
                "Katz, Steven T. 1978. “Language, Epistemology, and\nMysticism,” in <em>Mysticism and Philosophical Analysis</em>,\nSteven T. Katz (ed.), New York: Oxford University Press,\n22–74.",
                "––– (ed.). 1983. <em>Mysticism and\nReligious Traditions</em>, Oxford: Oxford University Press.",
                "–––. 1988. “Responses and\nRejoinders,” <em>Journal of the American Academy of\nReligion</em>, 56: 751–757.",
                "––– (ed.). 2013. <em>Comparative\nMysticism: An Anthology of Original Sources</em>, Oxford: Oxford\nUniversity Press.",
                "Kelly, Edward F. and Michael Grosso. 2007. “Mystical\nExperience,” in Edward F. Kelly et al., <em>Irreducible\nMind: Toward a Psychology for the 21st Century</em>, Lanham, MD:\nRowman &amp; Littlefield, 495–575.",
                "King, Sallie B. 1988. “Two Epistemological Models\nfor the Interpretation of Mysticism,” <em>Journal of the\nAmerican Academy of Religion</em>, 56: 257–279.",
                "Kripal, Jeffery. 2002. “Debating the Mystical as\nthe Ethical: An Ideological Map,” in <em>Crossing Boundaries:\nEssays on the Ethical Status of Mysticism</em>, W. Barnard and J.\nKripal (eds.), New York: Seven Bridges Press.",
                "Kroll, Jerome and Bernard Bachrach. 2005. <em>The Mystic Mind: The\nPsychology of Medieval Mystics and Ascetics</em>, New York:\nRoutledge.",
                "Kvanvig, Jonathan. 1994. “A Critical Notice of\nAlston’s Perceiving God,” <em>Faith and Philosophy</em>, 11(April): 311–321.",
                "Kwan, Kwai-Man. 2011, <em>The Rainbow of Experiences, Critical\nTrust, and God</em>, New York: Continuum International Publishing\nGroup.",
                "–––. 2013. “The Argument from\nReligious Experience,” in <em>The Blackwell Companion to Natural\nTheology</em>, W. L. Craig and J. P. Moreland (eds.), Oxford:\nWiley-Blackwell Publishers.",
                "Lanzetta, Beverly. 2005. <em>Radical Wisdom: A\nFeminist Mystical Theology</em>, Minneapolis: Augsburg Fortress.",
                "Letheby, Chris. 2017. “Naturalizing Psychedelic Spirituality,”\n<em>Zygon: Journal of Science and Religion</em>, 52(3):\n623–642.",
                "–––. 2021. <em>Philosophy of Psychedelics</em>,\nNew York: Oxford University Press.",
                "Louth, Andrew. 2012. “Apophatic and Cataphatic\nTheology,” in <em>The Cambridge Companion to Christian\nMysticism</em>, Amy Hollywood and Patricia Z. Beckman (eds.),\nCambridge: Cambridge University Press.",
                "Loy, David. 2002. “The Lack of Ethics and the\nEthics of Lack in Buddhism,” in W. Barnard and J. Kripal (eds.),\n<em>Crossing Boundaries: Essays on the Ethical Status of\nMysticism</em>, New York: Seven Bridges Press.",
                "Marshall, Paul. 2005. <em>Mystical Encounters with the\nNatural World</em>, Oxford: Oxford University Press.",
                "Martin, C.B. 1955. “A Religious Way of\nKnowing,” in <em>New Essays in Philosophical Theology</em>,\nAntony Flew and Alasdair MacIntyre (eds.), London: SCM Press,\n76–95.",
                "Martin, Michael. 1990. <em>Atheism: A Philosophical\nJustification</em>, Philadelphia: Temple University Press.",
                "Matt, Daniel C. 1997. “Varieties of Mystical\nNothingness: Jewish, Christian, and Buddhist Perspectives,” in\n<em>Wisdom and Logos: Studies in Jewish Thought in Honor of David\nWinston</em>, David T. Runia and Gregory E. Sterling (eds.), <em>The\nStudia Philonica Annual</em> (Studies in Hellenistic Judaism), 9:\n316–331, Atlanta: Scholars Press.",
                "McGinn, Bernard. 1994. <em>The Foundations of Mysticism:\nOrigins to the Fifth Century</em>, New York: Crossroad.",
                "––– (ed.). 2006. <em>The Essential\nWritings of Christian Mysticism</em>, New York: Random House.",
                "Merkur, Dan. 1999. <em>Mystical Moments and Unitive\nThinking</em>, Albany: State University of New York Press.",
                "Millière, Raphaël et al. 2018. “Psychedelics,\nMeditation, and Self-Consciousness,” <em>Frontiers in\nPsychology</em>, 9 (September): 1–29 (Article 1475). ",
                "Mommaers, Paul. 2009. <em>Jan Van Ruusbroec: Mystical\nUnion with God</em>, Leuven: Peters Publishers.",
                "Moore, Peter. 1973. “Recent Studies of Mysticism: A\nCritical Survey,” <em>Religion</em>, 3: 146–156.",
                "Newberg, Andrew B. and Mark R. Waldman. 2016. <em>How\nEnlightenment Changes Your Brain: The New Science of\nTransformation</em>, New York, NY: Penguin Random House.",
                "Nhat Hanh, Thich. 1994. <em>Zen Keys: A Guide to\nZen Practice</em>, New York: Doubleday.",
                "Oppy, Graham. 2006. <em>Arguing Against Gods</em>,\nCambridge: Cambridge University Press.",
                "Otto, Rudolf. 1932. <em>Mysticism East and West: A Comparative\nAnalysis of the Nature of Mysticism</em>, Bertha L. Bracy and Richenda\nC. Payne (trans.), New York: Macmillan. ",
                "–––. 1957 [1917]. <em>The Idea of the\nHoly</em>, Second Edition, Oxford: Oxford University Press.",
                "Persinger, Michael A. 1987. <em>Neuropsychological Bases of God\nBeliefs</em>, New York: Praeger.",
                "Pike, Nelson. 1992. <em>Mystic Union: An Essay in the\nPhenomenology of Mysticism</em>, Ithaca: Cornell University\nPress.",
                "Plantinga, Alvin. 1980. <em>Does God have a\nNature?</em> Milwaukee: Marquette University Press.",
                "–––. 2011. <em>Where the Conflict\nReally Lies: Science, Religion, and Naturalism</em>, Oxford:\nOxford University Press.",
                "Proudfoot, Wayne. 1985. <em>Religious Experience</em>,\nBerkeley/Los Angeles: University of California Press.",
                "Radhakrishnan, Sarvepalli (trans.). 1968. <em>The\nBrahma Sutra: The Philosophy of Spiritual Life</em>, New York:\nGreenwood Press.",
                "Raphael, Melissa. 1994. “Feminism, Constructivism,\nand Numinous Experience,” <em>Religious Studies</em>, 30:\n511–526.",
                "Rose, Kenneth. 2016. <em>Yoga, Meditation, and Mysticism:\nContemplative Universals and Meditative Landmarks</em>, New York:\nBloomsbury Academic.",
                "Rowe, William. 1982. “Religious Experience and the\nPrinciple of Credulity,” <em>International Journal for\nPhilosophy of Religion</em>, 13: 85–92.",
                "Russell, Bertrand. 1935. <em>Religion and Science</em>,\nLondon: Oxford University Press.",
                "Schimmel, Annemarie. 1975. <em>Mystical Dimensions of\nIslam</em>, Chapel Hill: University of North Carolina Press.",
                "Schjoedt, Uffe. 2009. “The Religious Brain: A General\nIntroduction to the Experimental Neuroscience of\nReligion,” <em>Method &amp; Theory in the Study of\nReligion</em>, 21(3): 310–339.",
                "Schleiermacher, Friedrich. 1963. <em>The Christian\nFaith</em>, H. R. Mackintosh and J. S. Stewart (trans.), New York:\nHarper &amp; Row.",
                "Schuon, Frithjof. 1975. <em>The Transcendent Unity of\nReligions</em>, New York: Harper.",
                "Sells, Michael A. 1994. <em>Mystical Languages of\nUnsaying</em>, Chicago: Chicago University Press.",
                "Shaw, Gregory. 1995. <em>Theurgy and the Soul: The\nNeoplatonism of Iamblichus</em>, University Park: Penn State\nPress.",
                "Smart, Ninian. 1958. <em>Reasons and Faiths</em>,\nLondon: Routledge and Kegan Paul.",
                "–––. 1965. “Interpretation and\nMystical Experience,” <em>Religious Studies</em>, 1(1):\n75–87.",
                "–––. 1978. “Understanding\nReligious Experience,” in <em>Mysticism and Philosophical\nAnalysis</em>, Steven T. Katz (ed.), London: Sheldon Press.",
                "Smith, Huston. 1964. “Do Drugs Have Religious Import?”\n<em>Journal of Philosophy</em>, 61(18): 517–30.",
                "–––. 1976. <em>Forgotten Truth: The Primordial\nTradition</em>, New York: Harper &amp; Row.",
                "–––. 1987. “Is There a Perennial Philosophy?”\n<em>Journal of the American Academy of Religion</em>, 55 (Autumn):\n553–566.",
                "–––. 2000. <em>Cleansing the Doors of Perception: The Religious\nSignificance of Entheogenic Plants and Chemicals</em>, New York:\nPenguin Putnam.",
                "–––. 2005. “Do Drugs Have Religious Import? A Forty Year\nFollow-Up,” in Roger Walsh and Charles S. Grob (eds.),\n<em>Higher Wisdom: Eminent Elders Explore the Continuing Impact of\nPsychedelics</em>, Albany: SUNY Press, 223–239.",
                "Staal, Frits. 1975. <em>Exploring Mysticism</em>,\nLondon: Penguin.",
                "Stace, Walter T. 1960, <em>Mysticism and Philosophy</em>,\nLondon: Macmillan.",
                "Stoeber, Michael. l992. “Constructivist\nEpistemologies of Mysticism: A Critique and a Revision,”\n<em>Religious Studies</em> 28: 107–116.",
                "–––. 1994. <em>Theo-Monistic Mysticism: A Hindu-Christian\nComparision</em>, New York: St. Martin’s Press.",
                "Suso, Henry. 1953. <em>Little Book of Eternal Wisdom and\nLittle Book of Truth</em>, J. M. Clark (trans.), London: Faber\n&amp; Faber.",
                "Swinburne, Richard. 1991. <em>The Existence of God</em>,\nRevised Edition, Oxford: Clarendon Press.",
                "–––. 1996. <em>Is There a\nGod?</em> Oxford: Oxford University Press.",
                "Taves, Ann. 2009. <em>Religious Experience\nReconsidered: A Building-Block Approach to the Study of Religion\nand Other Special Things</em>, Princeton: Princeton University\nPress.",
                "Taylor, Steve. 2017. “The Return of Perennial\nPerspectives? Why Transpersonal Psychology Should Remain Open to\nEssentialism,” <em>International Journal of Transpersonal\nStudies</em> 36(2): 75–92.",
                "Teresa of Avila. 1957. <em>The Life of Saint Teresa of\nAvila</em>, J. M. Cohen (trans.), New York: Penguin Books.",
                "Turner, Denys. 1996. <em>The Darkness of God: Negativity\nin Christian Mysticism</em>, Cambridge: Cambridge University\nPress.",
                "Underhill, Evelyn. 1945 [1911]. <em>Mysticism: A\nStudy in the Nature and Development of Man’s Spiritual\nConsciousness</em>, London: Methuen.",
                "Valentine, Elizabeth R. and Philip G. Sweet. 1999.\n“Meditation and Attention: A Comparison of the Effects of\nConcentrative and Mindfulness Meditation on Sustained\nAttention,” <em>Mental Health, Religion &amp; Culture</em> 2\n(1): 59–70.",
                "Wainwright, William J. 1981. <em>Mysticism: A Study\nof its Nature, Cognitive Value, and Moral Implications</em>, Madison:\nUniversity of Wisconsin Press.",
                "Wulff, David M. 2000. “Mystical Experience,”\nin <em>Varieties of Anomalous Experience: Examining the Scientific\nEvidence</em>, Etzel Cardena, Steven Jay Lynn, and Stanley Krippner\n(eds.), Washington, D.C.: American Psychological Association,\n397–440.",
                "Yaden, David B. et al. 2017. “The Noetic Quality: A\nMultimethod Exploratory Study.” <em>Psychology of Consciousness:\nTheory, Research, and Practice</em> 4(1): 54–62.",
                "Yandell, Keith. 1975. “Some Varieties of\nIneffability,” <em>International Journal for Philosophy of\nReligion</em> 6: 167–179.",
                "–––. 1993. <em>The Epistemology of\nReligious Experience</em>, New York: Cambridge University Press.",
                "Zaehner, R. C. 1957. <em>Mysticism, Sacred and\nProfane</em>, New York: Oxford University Press.",
                "Zelinski, Daniel. 2007. “From Prudence to\nMorality,” in <em>Religion, Mysticism, and Ethics: A\nCross-Traditional Anthology</em>, Jan Assman et al. (eds.),\nBerlin: Walter de Gruyter, 144–169."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Almond, Philip C. 1982. <em>Mystical Experience and\nReligious Doctrine</em>, Berlin: Mouton Press.</li>\n<li>Alston, William. 1991. <em>Perceiving God: The\nEpistemology of Religious Experience</em>, Ithaca: Cornell University\nPress.</li>\n<li>–––. 1992. “Literal and\nNonliteral in Reports of Mystical Experience,” in <em>Mysticism\nand Language</em>, Steven T. Katz (ed.), New York and Oxford: Oxford\nUniversity Press, 80–102.</li>\n<li>–––. 1993. <em>The Reliability of\nSense Perception</em>, Ithaca: Cornell University Press.</li>\n<li>–––. 1994. “Reply to\nCommentators,” <em>Philosophy and Phenomenological\nResearch</em>, 54: 891–899.</li>\n<li>–––. 2005. <em>Beyond\n“Justification”: Dimensions of Epistemic Evaluation</em>,\nIthaca: Cornell University Press.</li>\n<li>Augustine. 1958. <em>On Christian Doctrine</em>, D. W. Robertson,\nJr. (trans.), Indianapolis: Bobbs-Merrill.</li>\n<li>Azari, Nina P. et al. 2001. “Neural\nCorrelates of Religious Experience,” <em>European Journal\nof Neural Science</em>, 13: 1649–52.</li>\n<li>Bagger, Matthew C. 1999. <em>Religious Experience,\nJustification, and History</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Baillie, John. 1939. <em>Our Knowledge of God</em>,\nLondon: Oxford University Press.</li>\n<li>Barnard, G. William. 1997. <em>Exploring Unseen\nWorlds: William James and the Philosophy of Mysticism</em>,\nAlbany: SUNY Press.</li>\n<li>Barrett, Frederick S. and Roland R. Griffiths. 2018.\n“Classic Hallucinogens and Mystical Experiences: Phenomenology\nand Neural Correlates,” in Adam L. Halberstadt, Franz X. Vollenweider,\nand David E. Nichols (eds.), <em>Behavioral Neurobiology of\nPsychedelic Drugs</em>, New York: Springer, 393–430.</li>\n<li>Batchelor, Stephen. 2015. <em>After Buddhism: Rethinking the\nDharma for a Secular Age</em>, New Haven: Yale University Press.</li>\n<li>Beer, Frances. 1993. <em>Women and Mystical Experience\nin the Middle Ages</em>, Woodbridge: Boydell Press.</li>\n<li>Bergson, Henri, 1977 [1935]. <em>The Two Sources of Morality\nand Religion</em>, R. A. Audra and C. Berenton (trans.), Notre\nDame: University of Notre Dame, 1977.</li>\n<li>Borchert, Bruno.1994. <em>Mysticism, Its History and\nChallenge</em>, York Beach, Maine: Samuel Weiser.</li>\n<li>Bradford, David T. 2013. “Emotion in Mystical\nExperience,” <em>Religion, Brain &amp; Behavior</em>, 3(2):\n103–118.</li>\n<li>Broad, C.D. 1939. “Arguments for the Existence of\nGod, II,” <em>The Journal of Theological Studies</em>, 40:\n156–67.</li>\n<li>–––. 1953. <em>Religion, Philosophy,\nand Psychical Research</em>, London: Routledge, and Kegan Paul.\n1939. “Arguments for the Existence of God, II,”\n<em>The Journal of Theological Studies</em>, 40:\n156–67.</li>\n<li>Brunn, Emilie Zum and Epiney-Burgard,\nGeorgette. 1989. <em>Women Mystics in Medieval\nEurope</em>, Sheila Hughes (trans.), New York: Paragon\nHouse.</li>\n<li>Bucke, Richard M. 1901. <em>Cosmic Consciousness: A Study in the\nEvolution of the Human Mind</em>, New York: Dutton.</li>\n<li>Byrne, Peter. 2001. “Perceiving God and\nRealism,” <em>Philo</em>, 3: 74–88.</li>\n<li>Caciola, Nancy. 2000. “Mystics, Demoniacs, and the\nPhysiology of Spirit Possession in Medieval Europe,”\n<em>Comparative Studies in Society and History</em>, 42:\n268–306.</li>\n<li>–––. 2003. <em>Discerning\nSpirits: Divine and Demonic Possession in the Middle Ages</em>,\nIthaca: Cornell University Press.</li>\n<li>Coakley, Sarah. 2009. “Dark Contemplation and Epistemic\nTransformation: The Analytic Theologian Re-meets Teresa of\nAvila,” in <em>Analytic Theology, New Essays in the Philosophy\nof Theology</em>, Oliver D. Crisp and Michael C. Rea (eds.), Oxford:\nOxford University Press.</li>\n<li>Daly, Mary. 1973. <em>Beyond God the Father: Toward\na Philosophy of Women’s Liberation</em>, Boston: Beacon\nPress.</li>\n<li>Danto, Arthur. 1987. <em>Mysticism and Morality:\nOriental Thought and Moral Philosophy</em>, New York: Columbia\nUniversity Press.</li>\n<li>d’Aquili, Eugene and Andrew Newberg. 1999. <em>The\nMystical Mind: Probing the Biology of Religious Experience</em>,\nMinneapolis: Fortress Press.</li>\n<li>D’Costa, Gavin. 1987. <em>John Hick’s\nTheology of Religions: A Critical Evaluation</em>, Lanham: University\nPress of America.</li>\n<li>Deikman, Arthur. 1980. “Deautomatization and the\nMystic Experience,” in <em>Understanding Mysticism</em>,\nRichard Woods (ed.), Garden City: Doubleday, 240–69.</li>\n<li>Devinsky, Orrin and George C. Lai. 2008. “Spirituality and\nReligion in Epilepsy,” <em>Epilepsy &amp; Behavior</em>, 12(4):\n636–643.</li>\n<li>Doblin, Rick. 1991. “Pahnke’s ‘Good Friday\nExperiment’: A Long-Term Follow-Up and Methodological\nCritique,” <em>Journal of Transpersonal Psychology</em>, 23(1):\n1–28.</li>\n<li>Dogen. 1986. <em>Shobogenzo: Zen Essays by\nDogen</em>, Thomas Cleary (trans.), Honolulu: University of\nHawai‘i Press.</li>\n<li>Dunn, Bruce R., Judith A. Hartigan, and William L. Mikulas. 1999.\n“Concentration and Mindfulness: Unique Forms of\nConsciousness,” <em>Applied Psychophysiology and\nBiofeedback</em>, 24(3): 147–165.</li>\n<li>Eckhart, Meister. 2009. <em>The Complete Mystical Works of Meister\nEckhart</em>, Maurice O’C. Walshe (ed. and trans); rev. by\nBernard McGinn, New York: Crossroad.</li>\n<li>Evans, Donald. 1989. “Can Philosophers Limit What Mystics\nCan Do? A Critique of Steven Katz,” <em>Religious Studies</em>\n25(1): 53–60. </li>\n<li>Fales, Evan. 1996a. “Scientific Explanations of\nMystical Experiences, Part I: The Case of St\nTeresa,” <em>Religious Studies</em>, 32:\n143–163.</li>\n<li>–––. 1996b. “Scientific\nExplanations of Mystical Experiences, Part II,” <em>Religious\nStudies</em>, 32: 297–313.</li>\n<li>–––. 2001. “Do Mystics See\nGod?” in <em>Contemporary Debates in the Philosophy of\nReligion</em>, Michael L. Peterson (ed.), Oxford: Blackwell.</li>\n<li>–––. 2010. <em>Divine Intervention:\nMetaphysical and Epistemological Puzzles</em>, New York:\nRoutledge.</li>\n<li>Flew, Antony. 1966. <em>God and Philosophy</em>, London:\nHutchinson.</li>\n<li>Forgie, William.1984. “Theistic Experience and the\nDoctrine of Unanimity,” <em>International Journal of the\nPhilosophy of Religion</em>, 15: 13–30.</li>\n<li>–––. 1994. “Pike’s Mystic Union\nand the Possibility of Theistic Experience,” <em>Religious\nStudies</em>, 30: 231–242.</li>\n<li>Forman, Robert K. C. 1989. “Paramartha and Modern\nConstructivists on Mysticism: Epistemological Monomorphism versus\nDuomorphism,” <em>Philosophy East and West</em>, 39:\n393–418.</li>\n<li>––– (ed.). 1990. <em>The Problem of Pure\nConsciousness, Mysticism and Philosophy</em>, New York: Oxford\nUniversity Press.</li>\n<li>–––. 1999. <em>Mysticism, Mind,\nConsciousness</em>, Albany, NY: State University of New\nYork Press.</li>\n<li>Franke, William. 2007. <em>On What Cannot be\nSaid: Apophatic Discourses in Philosophy, Religion, Literature,\nand the Arts</em>, 2 vols., Notre Dame: Notre Dame University\nPress.</li>\n<li>Franks, Carolyn Davis. 1989. <em>The Evidential\nForce of Religious Experience</em>, Oxford: Clarendon Press.</li>\n<li>Furlong, Monica. 2013. <em>Visions &amp;\nLongings: Medieval Women Mystics</em>, Boston: Shambhala\nPublications.</li>\n<li>Gale, Richard M. 1960. “Mysticism and\nPhilosophy,” <em>Journal of Philosophy</em>, 57:\n471–481.</li>\n<li>–––. 1991. <em>On the Nature and\nExistence of God</em>, Cambridge: Cambridge Press.</li>\n<li>–––, 1994. “Why Alston’s\nMystical Doxastic Practice is Subjective,” <em>Philosophy and\nPhenomenological Research</em>, 54: 869–875.</li>\n<li>Gallope, Michael. 2017. <em>Deep Refrains: Music,\nPhilosophy, and the Ineffable</em>, Chicago: University of Chicago\nPress.</li>\n<li>Gellman, Jerome. 1997. <em>Experience of God and the\nRationality of Theistic Belief</em>, Ithaca: Cornell University\nPress.</li>\n<li>–––. 2001a. <em>Mystical Experience of\nGod: A Philosophical Enquiry</em>, London: Ashgate Publishers.</li>\n<li>–––. 2001b. “Review of Matthew\nBagger, <em>Religious Experience, Justification, and\nHistory</em>,” <em>Faith and Philosophy</em>, 18(4): 345–364.</li>\n<li>–––. 2010. “A Problem for the Christian\nMystical Doxastic Practice,” <em>Philo</em>, 13(1):\n23–28.</li>\n<li>–––. 2011. “Credulity and\nExperience of God,” <em>Philo</em>, 10(2):\n114–124.</li>\n<li>Goldenberg, Naomi. 1979. <em>The Changing of the\nGods</em>, Boston: Beacon Press.</li>\n<li>Griffiths, Paul J. 1993. “Pure Consciousness and\nIndian Buddhism,” in <em>The Problem of Pure Consciousness,\nMysticism and Philosophy</em>, Robert Forman (ed.), New York: Oxford\nUniversity Press, 121–159.</li>\n<li>Griffiths, Roland R. et al. 2011. “Psilocybin\nOccasioned Mystical-Type Experiences: Immediate and Persisting\nDose-related Effects,” <em>Psychopharmacology</em>, 218(4):\n649–665.</li>\n<li>Gutting, Gary. 1982, <em>Religious Belief and Religious\nSkepticism</em>, Notre Dame, IN.: University of Notre Dame.</li>\n<li>Harris, Sam. 2014. <em>Waking Up: A Guide to Spirituality Without\nReligion</em>, New York: Simon &amp; Schuster.</li>\n<li>Hick, John. 1989. <em>An Interpretation of Religion:\nHuman Responses to the Transcendent</em>, London: Macmillan.</li>\n<li>Hollywood, Amy. 2002. <em>Sensible Ecstasy: Mysticism, Sexual\nDifference and the Demands of History</em>, Chicago: Univ. of\nChicago.</li>\n<li>Hood, Ralph W., Jr. 1997. “The Empirical Study of\nMysticism,” in <em>The Psychology of Religion: Theoretical\nApproaches</em>, Bernard Spilka and Daniel N. McIntosh (eds.),\n222–232. Boulder, CO: Westview Press.</li>\n<li>–––. 2001. <em>Dimensions of Mystical\nExperiences: Empirical Studies and Psychological\nLinks</em>, Amsterdam: Rodopi.</li>\n<li>–––. 2006. “The Common Core Thesis in\nthe Study of Mysticism,” in <em>Where God and Science Meet</em>\n(Volume 3: The Psychology of Religious Experience), Patrick McNamara\n(ed.), 119–38, Westport CT: Praeger.</li>\n<li>–––. 2017. “Self-Loss in Indigenous\nand Cross-Cultural Psychologies: Beyond Dichotomies?”\n<em>Research in the Social Scientific Study of Religion</em>\n28: 112–132.</li>\n<li>Hood, Ralph W., Jr. and G. N. Byrom. 2010. “Mysticism,\nMadness, and Mental Health,” in <em>The Healing Power of\nSpirituality: How Faith Helps Humans Thrive</em>, vol. 3, J. Harold\nEllens (ed.), Santa Barbara, CA: Praeger, 171–191.</li>\n<li>Hurcombe, Linda (ed.). 1987. <em>Sex and\nGod: Varieties of Women’s Religious Experience</em>, New\nYork: Routledge &amp; Kegan Paul.</li>\n<li>Huxley, Aldous. 1945. <em>The Perennial Philosophy</em>,\nNew York: Harper &amp; Bros.</li>\n<li>Idel, Moshe. 1988. <em>Kabbalah: New Perspectives</em>,\nNew Haven: Yale University Press.</li>\n<li>Idel, Moshe and Bernard McGinn (eds.). 1996. <em>Mystical\nUnion in Judaism, Christianity, and Islam: An Ecumenical\nDialogue</em>. New York: Continuum.</li>\n<li>James. William. 1958 [1902]. <em>The Varieties of\nReligious Experience</em>, New York: Mentor Books.</li>\n<li>Jantzen, Grace M. 1994. “Feminists, Philosophers,\nand Mystics,” <em>Hypatia</em>, 9: 186–206.</li>\n<li>–––. 1995. <em>Power, Gender, and\nChristian Mysticism</em>, Cambridge: Cambridge University Press.</li>\n<li>Jones, Richard H. 2004. <em>Mysticism and Morality: A\nNew Look at Old Questions</em>, Lanham, MD: Lexington Books.</li>\n<li>–––. 2016. <em>Philosophy of\nMysticism: Raids on the Ineffable</em>, Albany: State University\nof New York Press.</li>\n<li>–––. 2018. “Limitations on the Neuroscientific\nStudy of Mystical Experiences,” <em>Zygon: Journal of Science\nand Religion</em>, 53(4): 992–1017.</li>\n<li>–––. 2019. “Limitations on the\nScientific Study of Drug-Enabled Mystical Experiences,”\n<em>Zygon: Journal of Science and Religion</em>, 54(3):\n756–792.</li>\n<li>–––. 2020. “On Constructivism in the\nPhilosophy of Mysticism,” <em>Journal of Religion</em>, 100 (no.\n1): 1–41.</li>\n<li>Jones, Rufus M. 1909. <em>Studies in Mystical\nReligion</em>, London: Macmillan.</li>\n<li>Katz, Steven T. 1978. “Language, Epistemology, and\nMysticism,” in <em>Mysticism and Philosophical Analysis</em>,\nSteven T. Katz (ed.), New York: Oxford University Press,\n22–74.</li>\n<li>––– (ed.). 1983. <em>Mysticism and\nReligious Traditions</em>, Oxford: Oxford University Press.</li>\n<li>–––. 1988. “Responses and\nRejoinders,” <em>Journal of the American Academy of\nReligion</em>, 56: 751–757.</li>\n<li>––– (ed.). 2013. <em>Comparative\nMysticism: An Anthology of Original Sources</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Kelly, Edward F. and Michael Grosso. 2007. “Mystical\nExperience,” in Edward F. Kelly et al., <em>Irreducible\nMind: Toward a Psychology for the 21st Century</em>, Lanham, MD:\nRowman &amp; Littlefield, 495–575.</li>\n<li>King, Sallie B. 1988. “Two Epistemological Models\nfor the Interpretation of Mysticism,” <em>Journal of the\nAmerican Academy of Religion</em>, 56: 257–279.</li>\n<li>Kripal, Jeffery. 2002. “Debating the Mystical as\nthe Ethical: An Ideological Map,” in <em>Crossing Boundaries:\nEssays on the Ethical Status of Mysticism</em>, W. Barnard and J.\nKripal (eds.), New York: Seven Bridges Press.</li>\n<li>Kroll, Jerome and Bernard Bachrach. 2005. <em>The Mystic Mind: The\nPsychology of Medieval Mystics and Ascetics</em>, New York:\nRoutledge.</li>\n<li>Kvanvig, Jonathan. 1994. “A Critical Notice of\nAlston’s Perceiving God,” <em>Faith and Philosophy</em>, 11(April): 311–321.</li>\n<li>Kwan, Kwai-Man. 2011, <em>The Rainbow of Experiences, Critical\nTrust, and God</em>, New York: Continuum International Publishing\nGroup.</li>\n<li>–––. 2013. “The Argument from\nReligious Experience,” in <em>The Blackwell Companion to Natural\nTheology</em>, W. L. Craig and J. P. Moreland (eds.), Oxford:\nWiley-Blackwell Publishers.</li>\n<li>Lanzetta, Beverly. 2005. <em>Radical Wisdom: A\nFeminist Mystical Theology</em>, Minneapolis: Augsburg Fortress.</li>\n<li>Letheby, Chris. 2017. “Naturalizing Psychedelic Spirituality,”\n<em>Zygon: Journal of Science and Religion</em>, 52(3):\n623–642.</li>\n<li>–––. 2021. <em>Philosophy of Psychedelics</em>,\nNew York: Oxford University Press.</li>\n<li>Louth, Andrew. 2012. “Apophatic and Cataphatic\nTheology,” in <em>The Cambridge Companion to Christian\nMysticism</em>, Amy Hollywood and Patricia Z. Beckman (eds.),\nCambridge: Cambridge University Press.</li>\n<li>Loy, David. 2002. “The Lack of Ethics and the\nEthics of Lack in Buddhism,” in W. Barnard and J. Kripal (eds.),\n<em>Crossing Boundaries: Essays on the Ethical Status of\nMysticism</em>, New York: Seven Bridges Press.</li>\n<li>Marshall, Paul. 2005. <em>Mystical Encounters with the\nNatural World</em>, Oxford: Oxford University Press.</li>\n<li>Martin, C.B. 1955. “A Religious Way of\nKnowing,” in <em>New Essays in Philosophical Theology</em>,\nAntony Flew and Alasdair MacIntyre (eds.), London: SCM Press,\n76–95.</li>\n<li>Martin, Michael. 1990. <em>Atheism: A Philosophical\nJustification</em>, Philadelphia: Temple University Press.</li>\n<li>Matt, Daniel C. 1997. “Varieties of Mystical\nNothingness: Jewish, Christian, and Buddhist Perspectives,” in\n<em>Wisdom and Logos: Studies in Jewish Thought in Honor of David\nWinston</em>, David T. Runia and Gregory E. Sterling (eds.), <em>The\nStudia Philonica Annual</em> (Studies in Hellenistic Judaism), 9:\n316–331, Atlanta: Scholars Press.</li>\n<li>McGinn, Bernard. 1994. <em>The Foundations of Mysticism:\nOrigins to the Fifth Century</em>, New York: Crossroad.</li>\n<li>––– (ed.). 2006. <em>The Essential\nWritings of Christian Mysticism</em>, New York: Random House.</li>\n<li>Merkur, Dan. 1999. <em>Mystical Moments and Unitive\nThinking</em>, Albany: State University of New York Press.</li>\n<li>Millière, Raphaël et al. 2018. “Psychedelics,\nMeditation, and Self-Consciousness,” <em>Frontiers in\nPsychology</em>, 9 (September): 1–29 (Article 1475). </li>\n<li>Mommaers, Paul. 2009. <em>Jan Van Ruusbroec: Mystical\nUnion with God</em>, Leuven: Peters Publishers.</li>\n<li>Moore, Peter. 1973. “Recent Studies of Mysticism: A\nCritical Survey,” <em>Religion</em>, 3: 146–156.</li>\n<li>Newberg, Andrew B. and Mark R. Waldman. 2016. <em>How\nEnlightenment Changes Your Brain: The New Science of\nTransformation</em>, New York, NY: Penguin Random House.</li>\n<li>Nhat Hanh, Thich. 1994. <em>Zen Keys: A Guide to\nZen Practice</em>, New York: Doubleday.</li>\n<li>Oppy, Graham. 2006. <em>Arguing Against Gods</em>,\nCambridge: Cambridge University Press.</li>\n<li>Otto, Rudolf. 1932. <em>Mysticism East and West: A Comparative\nAnalysis of the Nature of Mysticism</em>, Bertha L. Bracy and Richenda\nC. Payne (trans.), New York: Macmillan. </li>\n<li>–––. 1957 [1917]. <em>The Idea of the\nHoly</em>, Second Edition, Oxford: Oxford University Press.</li>\n<li>Persinger, Michael A. 1987. <em>Neuropsychological Bases of God\nBeliefs</em>, New York: Praeger.</li>\n<li>Pike, Nelson. 1992. <em>Mystic Union: An Essay in the\nPhenomenology of Mysticism</em>, Ithaca: Cornell University\nPress.</li>\n<li>Plantinga, Alvin. 1980. <em>Does God have a\nNature?</em> Milwaukee: Marquette University Press.</li>\n<li>–––. 2011. <em>Where the Conflict\nReally Lies: Science, Religion, and Naturalism</em>, Oxford:\nOxford University Press.</li>\n<li>Proudfoot, Wayne. 1985. <em>Religious Experience</em>,\nBerkeley/Los Angeles: University of California Press.</li>\n<li>Radhakrishnan, Sarvepalli (trans.). 1968. <em>The\nBrahma Sutra: The Philosophy of Spiritual Life</em>, New York:\nGreenwood Press.</li>\n<li>Raphael, Melissa. 1994. “Feminism, Constructivism,\nand Numinous Experience,” <em>Religious Studies</em>, 30:\n511–526.</li>\n<li>Rose, Kenneth. 2016. <em>Yoga, Meditation, and Mysticism:\nContemplative Universals and Meditative Landmarks</em>, New York:\nBloomsbury Academic.</li>\n<li>Rowe, William. 1982. “Religious Experience and the\nPrinciple of Credulity,” <em>International Journal for\nPhilosophy of Religion</em>, 13: 85–92.</li>\n<li>Russell, Bertrand. 1935. <em>Religion and Science</em>,\nLondon: Oxford University Press.</li>\n<li>Schimmel, Annemarie. 1975. <em>Mystical Dimensions of\nIslam</em>, Chapel Hill: University of North Carolina Press.</li>\n<li>Schjoedt, Uffe. 2009. “The Religious Brain: A General\nIntroduction to the Experimental Neuroscience of\nReligion,” <em>Method &amp; Theory in the Study of\nReligion</em>, 21(3): 310–339.</li>\n<li>Schleiermacher, Friedrich. 1963. <em>The Christian\nFaith</em>, H. R. Mackintosh and J. S. Stewart (trans.), New York:\nHarper &amp; Row.</li>\n<li>Schuon, Frithjof. 1975. <em>The Transcendent Unity of\nReligions</em>, New York: Harper.</li>\n<li>Sells, Michael A. 1994. <em>Mystical Languages of\nUnsaying</em>, Chicago: Chicago University Press.</li>\n<li>Shaw, Gregory. 1995. <em>Theurgy and the Soul: The\nNeoplatonism of Iamblichus</em>, University Park: Penn State\nPress.</li>\n<li>Smart, Ninian. 1958. <em>Reasons and Faiths</em>,\nLondon: Routledge and Kegan Paul.</li>\n<li>–––. 1965. “Interpretation and\nMystical Experience,” <em>Religious Studies</em>, 1(1):\n75–87.</li>\n<li>–––. 1978. “Understanding\nReligious Experience,” in <em>Mysticism and Philosophical\nAnalysis</em>, Steven T. Katz (ed.), London: Sheldon Press.</li>\n<li>Smith, Huston. 1964. “Do Drugs Have Religious Import?”\n<em>Journal of Philosophy</em>, 61(18): 517–30.</li>\n<li>–––. 1976. <em>Forgotten Truth: The Primordial\nTradition</em>, New York: Harper &amp; Row.</li>\n<li>–––. 1987. “Is There a Perennial Philosophy?”\n<em>Journal of the American Academy of Religion</em>, 55 (Autumn):\n553–566.</li>\n<li>–––. 2000. <em>Cleansing the Doors of Perception: The Religious\nSignificance of Entheogenic Plants and Chemicals</em>, New York:\nPenguin Putnam.</li>\n<li>–––. 2005. “Do Drugs Have Religious Import? A Forty Year\nFollow-Up,” in Roger Walsh and Charles S. Grob (eds.),\n<em>Higher Wisdom: Eminent Elders Explore the Continuing Impact of\nPsychedelics</em>, Albany: SUNY Press, 223–239.</li>\n<li>Staal, Frits. 1975. <em>Exploring Mysticism</em>,\nLondon: Penguin.</li>\n<li>Stace, Walter T. 1960, <em>Mysticism and Philosophy</em>,\nLondon: Macmillan.</li>\n<li>Stoeber, Michael. l992. “Constructivist\nEpistemologies of Mysticism: A Critique and a Revision,”\n<em>Religious Studies</em> 28: 107–116.</li>\n<li>–––. 1994. <em>Theo-Monistic Mysticism: A Hindu-Christian\nComparision</em>, New York: St. Martin’s Press.</li>\n<li>Suso, Henry. 1953. <em>Little Book of Eternal Wisdom and\nLittle Book of Truth</em>, J. M. Clark (trans.), London: Faber\n&amp; Faber.</li>\n<li>Swinburne, Richard. 1991. <em>The Existence of God</em>,\nRevised Edition, Oxford: Clarendon Press.</li>\n<li>–––. 1996. <em>Is There a\nGod?</em> Oxford: Oxford University Press.</li>\n<li>Taves, Ann. 2009. <em>Religious Experience\nReconsidered: A Building-Block Approach to the Study of Religion\nand Other Special Things</em>, Princeton: Princeton University\nPress.</li>\n<li>Taylor, Steve. 2017. “The Return of Perennial\nPerspectives? Why Transpersonal Psychology Should Remain Open to\nEssentialism,” <em>International Journal of Transpersonal\nStudies</em> 36(2): 75–92.</li>\n<li>Teresa of Avila. 1957. <em>The Life of Saint Teresa of\nAvila</em>, J. M. Cohen (trans.), New York: Penguin Books.</li>\n<li>Turner, Denys. 1996. <em>The Darkness of God: Negativity\nin Christian Mysticism</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Underhill, Evelyn. 1945 [1911]. <em>Mysticism: A\nStudy in the Nature and Development of Man’s Spiritual\nConsciousness</em>, London: Methuen.</li>\n<li>Valentine, Elizabeth R. and Philip G. Sweet. 1999.\n“Meditation and Attention: A Comparison of the Effects of\nConcentrative and Mindfulness Meditation on Sustained\nAttention,” <em>Mental Health, Religion &amp; Culture</em> 2\n(1): 59–70.</li>\n<li>Wainwright, William J. 1981. <em>Mysticism: A Study\nof its Nature, Cognitive Value, and Moral Implications</em>, Madison:\nUniversity of Wisconsin Press.</li>\n<li>Wulff, David M. 2000. “Mystical Experience,”\nin <em>Varieties of Anomalous Experience: Examining the Scientific\nEvidence</em>, Etzel Cardena, Steven Jay Lynn, and Stanley Krippner\n(eds.), Washington, D.C.: American Psychological Association,\n397–440.</li>\n<li>Yaden, David B. et al. 2017. “The Noetic Quality: A\nMultimethod Exploratory Study.” <em>Psychology of Consciousness:\nTheory, Research, and Practice</em> 4(1): 54–62.</li>\n<li>Yandell, Keith. 1975. “Some Varieties of\nIneffability,” <em>International Journal for Philosophy of\nReligion</em> 6: 167–179.</li>\n<li>–––. 1993. <em>The Epistemology of\nReligious Experience</em>, New York: Cambridge University Press.</li>\n<li>Zaehner, R. C. 1957. <em>Mysticism, Sacred and\nProfane</em>, New York: Oxford University Press.</li>\n<li>Zelinski, Daniel. 2007. “From Prudence to\nMorality,” in <em>Religion, Mysticism, and Ethics: A\nCross-Traditional Anthology</em>, Jan Assman et al. (eds.),\nBerlin: Walter de Gruyter, 144–169.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Ghazali",
            "Arabic and Islamic Philosophy, special topics in: mysticism",
            "Buddha",
            "Chinese Philosophy: Chan Buddhism",
            "consciousness",
            "feminist philosophy",
            "Gorampa [go rams pa]",
            "Ibn ‘Arabî",
            "James, William",
            "Laozi",
            "Madhyamaka",
            "Meister Eckhart",
            "Nāgārjuna",
            "Neo-Daoism",
            "perception: the problem of",
            "Philo of Alexandria",
            "Plotinus",
            "Pseudo-Dionysius the Areopagite",
            "religious experience",
            "Śāntideva",
            "Śaṅkara",
            "Tsongkhapa",
            "Vasubandhu",
            "Zhuangzi"
        ],
        "entry_link": [
            {
                "../al-ghazali/": "al-Ghazali"
            },
            {
                "../arabic-islamic-mysticism/": "Arabic and Islamic Philosophy, special topics in: mysticism"
            },
            {
                "../buddha/": "Buddha"
            },
            {
                "../buddhism-chan/": "Chinese Philosophy: Chan Buddhism"
            },
            {
                "../consciousness/": "consciousness"
            },
            {
                "../feminist-philosophy/": "feminist philosophy"
            },
            {
                "../gorampa/": "Gorampa [go rams pa]"
            },
            {
                "../ibn-arabi/": "Ibn ‘Arabî"
            },
            {
                "../james/": "James, William"
            },
            {
                "../laozi/": "Laozi"
            },
            {
                "../madhyamaka/": "Madhyamaka"
            },
            {
                "../meister-eckhart/": "Meister Eckhart"
            },
            {
                "../nagarjuna/": "Nāgārjuna"
            },
            {
                "../neo-daoism/": "Neo-Daoism"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../philo/": "Philo of Alexandria"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../pseudo-dionysius-areopagite/": "Pseudo-Dionysius the Areopagite"
            },
            {
                "../religious-experience/": "religious experience"
            },
            {
                "../shantideva/": "Śāntideva"
            },
            {
                "../shankara/": "Śaṅkara"
            },
            {
                "../tsongkhapa/": "Tsongkhapa"
            },
            {
                "../vasubandhu/": "Vasubandhu"
            },
            {
                "../zhuangzi/": "Zhuangzi"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=mysticism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/mysticism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=mysticism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/mysticism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=mysticism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/mysticism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=mysticism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/mysticism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://etext.lib.virginia.edu/toc/modeng/public/JamVari.html\" target=\"other\"><em>Varieties of Religious Experience</em></a>,\n by William James (Electronic Text Center, University of\nVirginia).",
            "Alston, William, 2005\n <a href=\"https://www.youtube.com/playlist?list=PLays6_PnPtMKPObcAAIwqQsbzHTnII-9Z\" target=\"other\"><em>Divine Mystery and Our Knowledge of God</em></a>\n (The Taylor Lectures), Yale Divinity School. [YouTube]",
            "<a href=\"http://www.edepot.com/tao7.html\" target=\"other\"><em>Tao Te Ching</em></a>,\n Taoism Information Page (University of Florida), web page listing\nvarious translations."
        ],
        "listed_links": [
            {
                "http://etext.lib.virginia.edu/toc/modeng/public/JamVari.html": "Varieties of Religious Experience"
            },
            {
                "https://www.youtube.com/playlist?list=PLays6_PnPtMKPObcAAIwqQsbzHTnII-9Z": "Divine Mystery and Our Knowledge of God"
            },
            {
                "http://www.edepot.com/tao7.html": "Tao Te Ching"
            }
        ]
    }
}