{
    "url": "nothingness",
    "title": "Nothingness",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Roy Sorensen\n<roy.sorensen@austin.utexas.edu>",
        "author_links": [
            {
                "mailto:roy%2esorensen%40austin%2eutexas%2eedu": "roy.sorensen@austin.utexas.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nRoy Sorensen\n&lt;<a href=\"mailto:roy%2esorensen%40austin%2eutexas%2eedu\"><em>roy<abbr title=\" dot \">.</abbr>sorensen<abbr title=\" at \">@</abbr>austin<abbr title=\" dot \">.</abbr>utexas<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Aug 28, 2003",
        "substantive revision Mon Feb 28, 2022"
    ],
    "preamble": "\n\nSince metaphysics is the study of what exists, one might expect\nmetaphysicians to have little to say about the limit case in which\nnothing exists. But around the fifth century BCE in China, India, and\nGreece, philosophers turned from what is, to what is not (Sorensen 2022).\nEver since, there has been commentary on omissions, holes, vacuums,\nand the possibility of an empty world.\n\nThis survey starts with nothingness at a global scale and then\nexplores local pockets of nothingness. Let’s begin with a\nquestion that Martin Heidegger famously characterized as the most\nfundamental issue of philosophy.\n",
    "toc": [
        {
            "#WhyTheSomRatThaNot": "1. Why is there something rather than nothing?"
        },
        {
            "#TheMosOneEmpWor": "2. Is there at most one empty world?"
        },
        {
            "#TheExpFraForQue": "3. Can there be an explanatory framework for the question?"
        },
        {
            "#ResConEnt": "4. The restriction to concrete entities"
        },
        {
            "#ConDil": "5. The contingency dilemma"
        },
        {
            "#IntPriPosTru": "6. The intuitive primacy of positive truths"
        },
        {
            "#SubArg": "7. The subtraction argument"
        },
        {
            "#OntNeu": "8. Ontological neutrality"
        },
        {
            "#ProMulNot": "9. The problem of multiple nothings"
        },
        {
            "#TheAnyNot": "10. Is there any nothingness?"
        },
        {
            "#ExiAspNot": "11. Phenomenological aspects of nothingness"
        },
        {
            "#AniCogAbs": "12. Animal Cognition of Absences"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Why is there something rather than nothing?\n\nWell, why not? Why expect nothing rather than something? No experiment\ncould support the hypothesis ‘There is nothing’ because\nany observation obviously implies the existence of an observer.\n\nIs there any a priori support for ‘There is\nnothing’? One might respond with a methodological principle that\npropels the empty world to the top of the agenda. For instance, many\nfeel that whoever asserts the existence of something has the burden of\nproof. If an astronomer says there is water at the south pole of the\nMoon, then it is up to him to provide data in support of the lunar\nwater. If we were not required to have evidence to back our\nexistential claims, then a theorist who fully explained the phenomena\nwith one set of things could gratuitously add an extra entity, say, a\npebble outside our light cone. We recoil from such add-ons. To prevent\nthe intrusion of superfluous entities, one might demand that\nmetaphysicians start with the empty world and admit only those\nentities that have credentials. This is the entry requirement imposed\nby René Descartes. He clears everything out and then only lets\nback in what can be proved to exist.\n\nSt. Augustine had more conservative counsel: we should not start at\nthe beginning, nor at the end, but where we are, in the middle. We\nreach a verdict about the existence of controversial things by\nassessing how well these entities would harmonize with the existence\nof better established things. If we start from nothing, we lack the\nbearings needed to navigate forward. Conservatives, coherentists and\nscientific gradualists all cast a suspicious eye on ‘Why is\nthere something rather than nothing?’.\n\nMost contemporary philosophers feel entitled to postulate whatever\nentities are indispensable to their best explanations of well accepted\nphenomena. They feel the presumption of non-existence is only\nplausible for particular existence claims. Since the presumption only\napplies on a case by case basis, there is no grand methodological\npreference for an empty world. Furthermore, there is no burden of\nproof when everybody concedes the proposition under discussion. Even a\nsolipsist agrees there is at least one thing!\n\nA more popular way to build a presumption in favor of nothingness is\nto associate nothingness with simplicity and simplicity with\nlikelihood. The first part of this justification is plausible.\n‘Nothing exists’ is simple in the sense of being an easy\nto remember generalization. Consider a test whose questions have the\nform ‘Does x exist?’. The rule ‘Always\nanswer no!’ is unsurpassably short and comprehensive.\n\nIn Les Misérables, Victor Hugo contrasts universal\nnegation with universal affirmation:\n\nAll roads are blocked to a philosophy which reduces everything to the\nword ‘no.’ To ‘no’ there is only one answer\nand that is ‘yes.’ Nihilism has no substance. There is no\nsuch thing as nothingness, and zero does not exist. Everything is\nsomething. Nothing is nothing. Man lives more by affirmation than by\nbread. (1862, 439).\n\n\nAs far as simplicity is concerned, there is a tie between the\nnihilistic rule ‘Always answer no!’ and the inflationary\nrule ‘Always answer yes!’. Neither rule makes for serious\nmetaphysics.\n\nEven if ‘Nothing exists’ were the uniquely simplest\npossibility (as measured by memorability), why should we expect that\npossibility to be actual? In a fair lottery, we assign the same\nprobability of winning to the ticket unmemorably designated 4,169,681\nas to the ticket memorably labeled 1,111,111.\n\nIndeed, the analogy with a lottery seems to dramatically reverse the\npresumption of non-existence. If there is only one empty world and\nmany populated worlds, then a random selection would lead us to expect\na populated world.\n\nPeter van Inwagen (1996) has nurtured this statistical argument. In an\ninfinite lottery, the chance that a given ticket is the winner is 0.\nVan Inwagen reasons that since there are infinitely many populated\nworlds, the probability of a populated world is equal to 1. Although\nthe empty world is not impossible, it is as improbable as anything can\nbe!\n\nFor the sake of balanced reporting, van Inwagen should acknowledge\nthat, by his reasoning, the actual world is also as improbable as\nanything can be. What really counts here is the probability of\n‘There is something’ as opposed to ‘There is\nnothing’.\n\nIs this statistical explanation scientific? Scientists stereotypically\noffer causal explanations. These are not feasible given the\ncomprehensive reading of ‘Why is there something rather than\nnothing?’. However, scientists also accept equilibrium\nexplanations (Sperry-Taylor 2019). These explain the actual situation\nas the outcome of most or all of the possible initial states. There is\nno attempt to trace the path by which the actual initial state\ndeveloped into the present situation. It suffices that the result is\ninvariant. Why do I have enough oxygen to breathe even though all the\noxygen molecules could have congregated in one corner of my room? The\nphysicist explains that while this specific arrangement is just as\nlikely as any other, the overwhelming majority of arrangements do not\nsegregate oxygen.\n2. Is there at most one empty world?\n\nMost philosophers would grant Peter van Inwagen’s premise that\nthere is no more than one empty world. They have been trained to model\nthe empty world on the empty set. There can be no more than one empty\nset because distinct sets require a difference in their members.\n\nHowever, medieval philosophers differentiated empty worlds by the\npower of places within those worlds (Grant 1981). The Condemnation of\n1277 forced Aristotelian philosophers to acknowledge the possibility\nof a void (to respect God’s omnipotence and the Christian\ndoctrine of creation from nothing). Most thinkers retained\nAristotle’s assumption that there was a unique center of the\nuniverse. If rocks were introduced into such a world, they would all\nhead toward their natural location at the center of the universe.\n(Aristotle used this point to provide a spectacular explanation of why\nthere are not two earths; they would have collided!) However, Nicole\nOresme imagined a world without any center. He predicted the rocks\nwould head toward each other. Since air, fire, earth, and water each\nhad their own places in Aristotle’s physics, fourteenth century\nphilosophers could imagine worlds that differed as to which of these\nplaces to retain. The void was rarely pictured as homogeneous.\n\nAristotle’s world is self-governed. Objects have powers that\ncollectively explain the order of the universe. Thinkers in the\nAbrahamic tradition replaced Aristotle’s invisible hand\nexplanation with God’s hidden hand. God dictated laws of nature\nto which He made periodic adjustments (like clockmakers who regularly\nserviced their creations, correcting the accumulating errors). Focus\non God’s perfection made attributions of divine intervention\nresemble left-handed compliments to God’s Intelligence. After\nthe attributions of miracles were retracted, God Himself was retired.\nWhat was left were relic “laws of nature”. Since a\nNecessary Being no longer guided the legislation, the actual world\nemerged as highly contingent. At first blush, this vindicates van\nInwagen’s probabilistic argument. But the contingency of laws\nalso raises the possibility of individuating empty worlds by their\nlaws (Carroll 1994, 64). For instance, Isaac Newton’s first law\nof motion says an undisturbed object will continue in motion in a\nstraight line. Some previous physicists suggested that such an object\nwill slow down and tend to travel in a circle. This empty world\ndiffers from the Newtonian empty world because different\ncounterfactual statements are true of it.\n\nIf variation in empty worlds can be sustained by differences in the\nlaws that apply to them, there will be infinitely many empty worlds.\nThe gravitational constant of an empty world can equal any real number\nbetween 0 and 1, so there are more than countably many empty worlds.\nIndeed, any order of infinity achieved by the set of populated\npossible worlds will be matched by the set of empty worlds.\n\nJohn Heil (2013) is bemused by this War of the Possible Worlds. Having\ndispensed with the Law Maker, we should repudiate the Laws of Nature.\nOnce we return to a self-governed world, there will be no worry about\nthe world as a lucky accident. As Immanuel Kant emphasized in his\nexplanation of why science cannot establish necessary truths, we do\nnot literally see actual states of affairs as being contingent rather\nthan necessary. Contingency, unlike color or shape, is not\nperceptible. Nor is there any presumption for regarding states of\naffairs as contingent.\n\nSubjective chance does not suffice for objective chance. To\ndemonstrate the impossibility of long-term prediction, Daniel\nKahneman, Oliver Sibony and Cass Sunstein invite the reader to\n“consider the fact that at the instant of conception, there was\nan even chance that every significant figure in history (and also the\ninsignificant onces) would be born with a different gender”.\n(2021, 141) Those who believe in the necessity of origins will\ndisagree. According to Saul Kripke (1990, 112–113), Socrates\ncould not have originated from a sperm-egg combination other than the\none from which he actually originated. Since the Y chromosome of his\nfather dictated Socrates’ biological gender, Socrates is as\nessentially male as he is essentially human. When we imagine\nSophroniscus siring a daughter with Phaenarete in 469 BC, we are\nimagining Socrates failing to exist. Kripke’s metaphysics also\nprecludes the consolation Richard Dawkins offers in Unweaving the\nRainbow: “We are going to die, and that makes us the lucky\nones. Most people are never going to die because they are never going\nto be born. The potential people who could have been here in my place\noutnumber the sand grains of Arabia.” (1998, 1). From\nKripke’s perspective, the number of non-existent people is zero.\nWhen we speak of those who are never conceived, we are imagining a\npossible world with a population originating from alternative\nsperm-egg combinations. They would have existed but do not exist. \n\nNotoriously, the modal realist David Lewis (1986) contends that people\nin other possible worlds exist just as much as actual people. These\npeople have no more reason to envy us than we have for envying them.\nRelative to the world of these potential people, we are the\nnon-actual people. ‘Actual’ is an indexical term on a par\nwith ‘here’ and ‘now’. I can pity my freezing\nfriends in Canada for not being here now in the mild winter of Austin,\nTexas. But that is because the Canadians could travel to Austin. There\nis no travel between possible worlds. According to Lewis, no object\nexists in more than one possible world. When you imagine yourself not\nexisting, you are thinking about a possible world that resembles the\nactual world except there is no counterpart of you. Your\nexistence in the actual world is not a matter of luck. The feeling\nthat you've won the lottery for existence arises from the striking\nresemblance between the actual world and a possible world in which\nsome other child is conceived by counterparts of your parents.\n\nSurprise that something exists is just as metaphysically laden as\nsurprise that you exist. According to Heil, ‘Why is there\nsomething rather than nothing?’ owes its urgency to a partisan\nbackground theory, not a neutral arbiter such as perception or\nmethodology.\n\nAlthough possible worlds became popular among analytic philosophers\nafter revolutionary advances in modal logic in the 1960s, possible\nworlds receive little attention from existentialists. Their discussion\nof objects is more in line with powers ontology advocated by Heil.\nIndeed, some existentialists picture nothingness as a kind of force\nthat impedes each object’s existence. Since there is something\nrather than nothing, any such nihilating force cannot have actually\ngone unchecked. What could have blocked it? Robert Nozick (1981, 123)\ntoys with an interpretation of Heidegger in which this nihilating\nforce is self-destructive. This kind of double-negation is depicted in\nthe Beatles’s movie Yellow Submarine. There is a\ncreature that zooms around like a vacuum cleaner, emptying everything\nin its path. When this menace finally turns on itself, a richly\npopulated world pops into existence.\n\nSome cultures have creation myths reminiscent of Yellow\nSubmarine. Heidegger would dismiss them as inappropriately\nhistorical. ‘Why is there something rather than nothing?’\nis not about the origin of the world. Increasing the scientific\nrespectability of the creation story (as with the Big Bang hypothesis)\nwould still leave Heidegger objecting that the wrong question is being\naddressed.\n3. Can there be an explanatory framework for the question?\n\nSome disagree with Peter van Inwagen’s assumption that each\npossible world is as likely as any other (Kotzen 2013). There have\nbeen metaphysical systems that favor less populated worlds.\n\nIndeed, the original purveyor of possible worlds, Gottfried Leibniz,\npictured possible things as angling to become actual. The more a thing\ncompetes with other things, the more likely that there will be\nsomething that stops it from becoming real. The winners in\nLeibniz’s struggle for existence are cooperative. They uniquely\nfit the niche formed by other things. This key hole into existence\nimplicitly conveys information about everything. The little bit that\nis not, tells us about all that there is.\n\nOn the one hand, this metaphysical bias in favor of simplicity is\nheartening because it suggests that the actual world is not too\ncomplex for human understanding. Scientists have penetrated deeply\ninto the physical world with principles that emphasize parsimony and\nuniformity: Ockham’s razor, the least effort principle, the\nanthropic principle, etc.\n\nOn the other hand, Leibniz worried that the metaphysical bias for\nsimplicity, when driven to its logical conclusion, yields the\nembarrassing prediction that there is nothing. After all, an empty\nworld would be free of objects trying to elbow each other out. It is\nthe world that requires the least effort to produce (Just do nothing!)\nand sustain (Continue doing nothing!). So why is there something\nrather than nothing? Even if there were previously something, why is\nthere still something? Why is so much still going on? To\navoid an answer that assigns us a special position in history, we\nwould have to model the universe as a perpetual motion machine. \n\nWhen worried by the bias in favor of simplicity, Leibniz pictures each\nnominee for existence as in a limbo between being and non-being. The\nleast complicated election is for none of the nominees to win a post.\nAny other election is arbitrary. But this election is superfluous if\nthere are no degrees of being. Given that existence is discrete, there\nis no boundary between non-existent things and existent things. \n\nLeibniz’s limbo illustrates an explanatory trap. To explain why\nsomething exists, we standardly appeal to the existence of something\nelse. There are mountain ranges on Earth because there are plates on\nits surface that slowly collide and crumple up against each other.\nThere are rings around Saturn because there is an immense quantity of\nrubble orbiting that planet. This pattern of explanation is not\npossible for ‘Why is there something rather than\nnothing?’. For instance, if we answer ‘There is something\nbecause the Universal Designer wanted there to be something’,\nthen our explanation takes for granted the existence of the Universal\nDesigner. Someone who poses the question in a comprehensive way will\nnot grant the existence of the Universal Designer as a starting\npoint.\n\nIf the explanation cannot begin with some entity, then it is hard to\nsee how any explanation is feasible. Some philosophers conclude\n‘Why is there something rather than nothing?’ is\nunanswerable. They think the question stumps us by imposing an\nimpossible explanatory demand, namely, Deduce the existence of\nsomething without using any existential premises. Logicians\nshould feel no more ashamed of their inability to perform this\ndeduction than geometers should feel ashamed at being unable to square\nthe circle.\n\nDavid Hume offers a consolation prize: we might still be able to\nexplain the existence of each event even if it is impossible to\nexplain everything all together. Suppose that the universe is\npopulated with an infinite row of dominoes. The fall of each domino\ncan be explained by the fall of its predecessor.\n\nBut what is responsible for the arrangement to begin with? Why is\nthere anything in our domain of discourse? This kind of comprehensive\nquestioning has long been alleged to commit the fallacy of\ncomposition. Questions that can be asked of elements within a system\nneed not be questions that can be asked of the system itself. Taking a\nstep back to the bigger picture is fine. But when the philosopher\nsteps back to get the biggest picture, he loses his footing. According\nto Immanuel Kant, the fall is misgauged as deep inquiry. \n\nIn the twentieth century, Russell’s set paradox raised another\nchallenge. If there is a set for every property, there should be a set\nthat contains all only those sets that do not contain themselves as a\nmember. But the existence of such a set would imply a contradiction.\nSo set theory needed to preclude this universal set. This raises\nconcern about other totalities. The universe is, well, universal. When\nthe monist says there is exactly one thing, he imposes an endogenous\ndemand on that thing (Do not be two things!) and an exogenous demand\non everything else (Do not exist!). This exogenous demand involves\nabsolute generality. Normally, quantification is restricted to a\ndomain of discourse. If this normal relativity is actually mandatory,\nwe cannot ask the question that the monist seeks to answer: How many\nthings are there? Any number, including zero, would require\nunrestricted quantification. \n\n‘How many things are there?’ also seems viciously\nabstract. A sortal such as KITTEN tells us the nature of a thing,\nthereby supplying criteria for counting and persistence. THING is a\ndummy sortal. How many things do you have when you have a capped pen?\nThe question cannot be answered because you have not been given\ncriteria governing whether the cap and the pen count as separate\nobjects. All questions about existence must be relativized to sorts.\nConsequently, the question of why there is something rather than\nnothing is incomplete. Once we remedy the incompleteness with a\nsortal, the question will be answered by science.\n\nEmpiricists such as Hume deny that the existence of anything could be\nproved by reason alone. Rationalists have been more optimistic. Many\nhave offered a priori proofs of God’s existence. Such a\nproof would double as an explanation of why there is something. If God\nexists, then something exists. After all, God is something.\n\nBut would God be the right sort of something? If we are only seeking\nan a priori proof of something (anything at all!),\nthen why not rest content with a mathematical demonstration that there\nexists an integer between a square and a cube? There must exist\nsuch an integer because 25 is a square and 27 is a cube and only one\ninteger can be between 25 and 27. Therefore, something exists.\nWhy does this come off as a mathematical joke?\n4. The restriction to concrete entities\n\nVan Inwagen’s answer is that we are actually interested in\nconcrete things. A grain of sand, a camel, and an oasis are\neach concrete entities. Each is part of the causal order. In contrast,\nabstract entities (numbers, sets, possible worlds) do not cause\nanything. Those who adopt the principle that only causes are real will\nbecome nominalists; everything is concrete.\n\nA second characterization of concrete entities is in terms of\nlocatability; a concrete entity has a position in space or time. Since\nconcrete entities are situated, they have boundaries with their\nenvironment. (The only exception would be an entity that took up all\nspace or all time, say the perfect animal described in Plato’s\nTimaeus.)\n\nAdmittedly, points in space and time have locations. But concrete\nentities are only accidentally where and when they are. All concrete\nentities have intrinsic properties (which make their boundaries\nnatural rather than conventional, say Efird and Stoneham (2005, 314)).\nTheir natures are not exhausted by their relationships with other\nthings. Max Black imagines twin iron spheres in an otherwise empty\nuniverse. The spheres are distinct yet have the same relationships and\nthe same intrinsic properties.\n\nAll material things are concrete but some concrete things might be\nimmaterial. Shadows and holes have locations and durations but they\nare not made of anything material. There is extraneous light in\nshadows and extraneous matter in holes; but these are contaminants\nrather than constituents. Cracks can spread, be counted, and\nconcealed. Once we acknowledge the existence of cracks, we get an\nunexpected transcendental explanation of why there is something:\nIf there is nothing then there is an absence of anything.\nTherefore, there exists something (either a positive concrete entity\nor an absence).\n\nOntological pluralists do not dismiss this proof as sophistry. Kris\nMcDaniel (2013, 277) thinks the proof is trivially correct. To address\na more interesting question, McDaniel follows Aristotle’s\nprinciple that there are many ways of being. From the\npluralist’s perspective, debate over whether holes exist is\nequivocal. The friends of absences use a broad sense of\n‘being’. The enemies of holes speak from a higher link in\nthe chain of being. From this altitude, holes depend on their hosts\nand so cannot be as real. Alexius Meinong’s talk of subsistence\nalludes to the lowest level of being. “Why does anything\nsubsist?” is a perfectly legitimate question, according to\nMcDaniel.\n\nIf there are souls or Cartesian minds, then they will also qualify as\nimmaterial, concrete entities. Although they do not take up space,\nthey take up time. An idealist such as George Berkeley could ask\n‘Why is there something rather than nothing?’ even though\nhe was convinced that material things are not possible.\n\nWilliam James denied that his defense of parapsychology provided a\nresource for answering, ‘How comes the world to be here at all\ninstead of the non-entity which might be imagined in its place?’\nPhilosophy, be it natural or supernatural, can make no progress on\nthis issue “for from nothing to being there is no logical\nbridge” (1911, 40). James concludes: “The question of\nbeing is the darkest in all philosophy. All of us are beggars here,\nand no school can speak disdainfully of another or give itself\nsuperior airs” (1911, 46).\n\nAlthough all concrete things are in space or time, neither space nor\ntime are concrete things. Where would space be? When would time occur?\nThese questions can only be answered if space were contained in\nanother higher space. Time would be dated within another time. Since\nthe same questions can be posed for higher order space and higher\norder time, we would face an infinite regress.\n\nThere is no tradition of wondering ‘Why is there space and\ntime?’. One reason is that space and time seem like a framework\nfor there being any contingent things.\n\nAbsolutists think of the framework as existing independently of what\nit frames. For instance, Newton characterized space as an eternal,\nhomogeneous, three dimensional container of infinite extent. He\nbelieved that the world was empty of objects for an infinite period\nprior to creation (setting aside an omnipresent God). An empty world\nwould merely be a continuation of what creation interrupted.\n\nOthers think the framework depends on what it frames. Like Leibniz,\nAlbert Einstein pictured (or “pictured”) space as an\nabstraction from relations between objects. Consequently, space can be\ndescribed with the same metaphors we use for family trees. Maybe space\ngrows bigger. Maybe space is curved or warped or has holes. There is\nmuch room to wonder why space has the properties that it has. But\nsince space is an abstraction from objects, answers to any riddles\nabout space reduce to questions about objects. One can wonder why\nthere is space. But this is only to wonder why there are objects.\n5. The contingency dilemma\n\nEarth would not have existed had the matter which now constitutes our\nsolar system formed, as usual, two stars instead of one. If no\nconcrete thing is a necessary being, then no concrete thing can\nexplain the existence of concrete things.\n\nEven if God is not concrete, proof of His existence would raise hope\nof explaining the existence of concrete things. For instance, the\nGenesis creation story suggests that God made everything\nwithout relying on any antecedent ingredients. The story also suggests\nthat God had a reason to create. If this account could be corroborated\nwe would have an explanation of why there are some concrete\nthings.\n\nThis divine explanation threatens to over-explain the data. Given that\nGod is a necessary being and that the existence of God necessitates\nthe existence of Earth, then Earth would be a necessary being rather\nthan a contingent being.\n\nThe dilemma was generalized by William Rowe (1975). Consider all the\ncontingent truths. The conjunction of all these truths is itself a\ncontingent truth. On the one hand, this conjunction cannot be\nexplained by any contingent truth because the conjunction already\ncontains all contingent truths; the explanation would be circular. On\nthe other hand, this conjunction cannot be explained by a necessary\ntruth because a necessary truth can only imply other necessary truths.\nThis dilemma suggests that ‘Why are there any contingent\nbeings?’ is impossible to answer.\n\nRowe presupposes that an answer would have to be a deductive\nexplanation. If there are ‘inferences to the best\nexplanation’ or inductive explanations, then there might be a\nway through the horns of Rowe’s dilemma.\n\nThere also remains hope that Rowe’s dilemma can be bypassed by\nshowing that the empty world is not a genuine possibility. Then the\nretort to ‘Why is there something rather than nothing?’ is\n‘There is no alternative to there being something!’.\n\n‘There might be nothing’ is false when read epistemically.\n(Roughly, a proposition is epistemically possible if it is consistent\nwith everything that is known.) For we know that something\nactually exists and knowledge of actuality precludes all\nrival epistemic possibilities. But when read metaphysically,\n‘There might be nothing’ seems true. So ‘Why is\nthere something rather than nothing?’ is, so far, a live\nquestion.\n\nThe question is not undermined by the a priori status of\nknowledge that something exists. (I know a priori that\nsomething exists because I know a priori that I exist and\nknow this entails ‘Something exists’.) Knowledge, even\na priori knowledge, that something is actually true is\ncompatible with ignorance as to how it could be true.\n\nResidual curiosity is possible even when the proposition is known to\nbe a necessary truth. A reductio ad absurdum proof that 1\n− 1/3 + 1/5 − 1/7 + … converges to π/4 might\npersuade one that there is no alternative without illuminating how it\ncould be true. For this brute style of proof does not explain how π\nwandered into the solution. (Reductio ad absurdum just shows\na contradiction would follow if the conclusion were not true.) This\nraises the possibility that even a logical demonstration of the\nmetaphysical necessity of ‘Something exists’ might still\nleave us asking why there is something rather than nothing (though\nthere would no longer be the wonder about the accidentality of there\nbeing something). This leads Andrew Brenner (2016) to deny that\n‘Why is there something rather than nothing?’ is\nrestricted to contingent entities. Brenner argues the question is\nhighly ambiguous. At best there is only a family resemblance between\nthe questions under discussion. What appears to be disagreement is too\noften a verbal dispute.\n6. The intuitive primacy of positive truths\n\nHenri Bergson maintained that the positive nature of reality pre-empts\nnothingness (Sorensen 2022, 283). The absence of green mammals is not\na brute fact. ‘There are no green mammals’ is made true by\na positive fact that all mammals are hairy and there are only two\npigments for hair - one producing black or brown hair, the other\nyellow or reddish orange. No mixture of those pigments yields green.\nOnce we have the positive facts and the notion of negation, we can\nderive all the negative facts. ‘There is nothing’ would be\na contingent, negative fact. But then it would have to be grounded on\nsome positive reality. That positive reality would ensure that there\nis something rather than nothing.\n\nHuman beings have a strong intuition that positive truths, such as\n‘Elephants are huge’ are more fundamental than negative\ntruths such as ‘Elephants do not jump’. The robustness of\nthis tendency makes negative things objects of amusement. Consider the\nProfessor’s remark during his chilly banquet in Lewis\nCarroll’s Sylvie and Bruno Concluded.\n\n“I hope you’ll enjoy the dinner—such as it is; and\nthat you won’t mind the heat—such as it\nisn’t.”\n\n\nThe sentence sounded well, but somehow I couldn’t quite\nunderstand it … (chapter 22)\n\n\nHow can we perceive absences? They seem causally inert and so not the\nsort of thing that we could check empirically. Negative truths seem\nredundant; there are no more truths than those entailed by the\nconjunction of all positive truths. The negative truths seem\npsychological; we only assert negative truths to express a frustrated\nexpectation. When Jean Paul Sartre (1969, 41) arrives late for his\nappointment with Pierre at the cafe, he sees the absence of Pierre but\nnot the absence of the Duke of Wellington.\n\nPhilosophers have had much trouble vindicating any of these\nintuitions. They still try to preserve as much of the positivity as\nthey can. For instance, Stephen Mumford (2021) characterizes himself\nas a “soft Parmenidean”. His 21st century willingness to\ntolerate some negativity is informed by Bertrand Russell’s 20th\ncentury failure to reduce negative truths to positive truths. Russell\n(1985) tried paraphrasing ‘The cat is not on the mat’ as\n‘There is a state of affairs incompatible with the cat being on\nthe mat’. But this paraphrase is covertly negative; it uses\n‘incompatible’ which means not compatible. He\ntried modeling ‘Not p’ as an expression of\ndisbelief that p. But ‘disbelief’ means believing\nthat something is not the case. Is it even clear that\nabsences are causally inert? Trapped miners are killed by the absence\nof oxygen. In the end Russell surrendered his intuition that reality\nis positive. In a famous lecture at Harvard, Russell concluded that\nirreducibly negative facts exist. He reports this nearly caused a\nriot.\n\nWere it not for the threat to social order, one might stand the\nintuition on its head: Negative truths are more fundamental than\npositive truths. From a logical point of view, there is greater\npromise in a reduction of positive truths to negative truths. Positive\ntruths can be analyzed as the negations of negative truths or perhaps\nas frustrated disbelief. Positive truths would then be the redundant\nhanger-ons, kept in circulation by our well-documented difficulty in\ncoping with negative information. Think of photographic negatives.\nThey seem less informative than positive prints. But since the prints\nare manufactured from the negatives, the negatives must be merely more\ndifficult for us to process.\n\nAs difficult as negation might be psychologically, it is easier to\nwork with than the alternatives suggested by Henry Sheffer. In 1913,\nhe demonstrated that all of the logical connectives can be defined in\nterms of the dual of conjunction, now known as NAND (short for NOT\nAND). Sheffer translates ‘p NAND q’ as\n‘either not p or not q’. ‘Not\np’ is defined as ‘p NAND\np’. Sheffer notes that the dual of disjunction, NOR\n(short for NOT OR), can also define all the connectives. Sheffer\ntranslates ‘p NOR q’ as ‘neither\np nor q’. From a logical point of view,\nnegation is dispensable. This raises hope that all of\nParmenides’ paradoxes of negation can be translated away.\n\nBertrand Russell quickly incorporated NAND into Principia\nMathematica. Sheffer’s functions have also been a great\neconomy to the assembly line symbol manipulation of computers (as\nwitnessed by the popularity of NAND gates and NOR gates). However,\nhuman beings have trouble achieving fluency with Sheffer’s\nconnectives. Even Sheffer translates them negatively. Psychologically,\nthe phrases ‘either not p or not q’ and\n‘neither p nor q’ are each heard as a\ndouble dose of negation rather than as an alternative to negation.\n\nBut we could let computers do our metaphysics just as we let them do\nour taxes. The only serious objection is that the problems of negation\ndo not really go away when we translate into artificial languages. For\ninstance, the challenge posed by negative existential sentences such\nas ‘Pegasus does not exist’ persists when translated as\n‘Pegasus exists NAND Pegasus exists’. Any desire to make\n‘Pegasus does not exist’ come out true warrants a desire\nto make ‘Pegasus exists NAND Pegasus exists’ come out\ntrue. (Since classical logic does not permit empty names, the NAND\nexistential sentence will not be true.)\n\nThe more general concern is that the problems which are naturally\ncouched in terms of negation persist when they are translated into a\ndifferent logical vocabulary. Given that the translation preserves the\nmeaning of the philosophical riddle, it will also preserve its\ndifficulty.\n\nWe engage in negative thinking to avoid highly complicated positive\nthinking. What is the probability of getting at least one head in ten\ntosses of a coin? Instead of directly computing the probability of\nthis highly disjunctive positive event, we switch to a negative\nperspective. We first calculate the probability of a total absence of\nheads and then exploit the complement rule: Probability (at least one\nhead) = 1 − Probability (no heads). An apt anagram of NEGATIVISM\nis TIMESAVING.\n\nSome possible worlds are easier to contemplate negatively. Thales said\nthat all is water. Suppose he was nearly right except for the\nexistence of two bubbles. These two absences of water become the\ninteresting players (just as two drops of water in an otherwise empty\nspace become interesting players in the dual of this universe). How\nwould these bubbles relate to each other? Would the bubbles repel each\nother? Would the bubbles be mutually unaffected? Deep thinking about\ngravity yields the conclusion that the bubbles would attract each\nother! (Epstein 1983, 138–9)\n\nThe hazard of drawing metaphysical conclusions from psychological\npreferences is made salient by caricatures. We know that caricatures\nare exaggerated representations. Despite the flagrant distortion (and\nactually because of it) we more easily recognize people from moderate\ncaricatures rather than from faithful portraits.\n\nFor navigational purposes, we prefer schematic subway maps over ones\nthat do justice to the lengths and curves of the track lines. But this\nis not a basis for inferring that reality is correspondingly\nschematic.\n\nOur predilection for positive thinking could reflect an objective\nfeature of our world (instead of being a mere anthropocentric\nprojection of one style of thought). But if this objective\npositiveness is itself contingent, then it does not explain why there\nis something rather than nothing. For Bergson’s explanation to\nsucceed, the positive nature of reality needs to be a metaphysically\nnecessary feature.\n7. The subtraction argument\n\nThomas Baldwin (1996) reinforces the possibility of an empty world by\nrefining the following thought experiment: Imagine a world in which\nthere are only finitely many objects. Suppose each object vanishes in\nsequence. Eventually you run down to three objects, two objects, one\nobject and then Poof! There’s your empty world.\n\nWhat can be done temporally can be done modally. There is only a small\ndifference between a possible world with a hundred objects and a\npossible world with just ninety-nine, and from there …. well,\njust do the arithmetic!\n\nCan the subtraction be completed if there necessarily are infinitely\nmany things? Penelope Maddy (1990) claims that unit sets are concrete\nentities, sharing the location of their members. The existence of one\nconcrete entity would guarantee the existence of infinitely many.\nConsequently, there would be no finite worlds.\n\nBaldwin avoids this issue with a different definition. Concrete\nentities are violators of Leibniz’s principle of the identity of\nindiscernibles. Concrete things may have exact duplicates. For\ninstance, Cameron Winklevoss could have a twin who perfectly\nresembles him (unlike his homozygotic twin Tyler Winklevoss). In\ncontrast, the unit set comprised of Cameron Winklevoss cannot have a\nperfect twin. All sets obey Leibniz’s principle of the identity\nof indiscernibles and so Baldwin counts sets as abstract entities.\n\nGeraldine Coggins (2010, chapter 4) objects that Baldwin’s\ndefinition of concreteness is inferior to the customary spatiotemporal\ndefinition. She deems the distinction between intrinsic and extrinsic\nproperties as too problematic to ground the distinction between\nconcrete and abstract objects.\n\nAnother concern is that infinite proliferation can be precipitated by\nthe constitution relation. Assume that each part of a concrete entity\nis itself concrete. Also assume that concrete entities are infinitely\ndivisible (as seems natural given that space is dense). An infinitely\ncomplex object cannot be nibbled away with any number of finite\nbites.\n\nGonzalo Rodriguez-Pereyra (2013) suggests that we instead take big,\ninfinite bites. Instead of subtracting entity by entity, subtract by\nthe chunk (of infinitely composite entities).\n\nOur metaphysical calculations are subliminally influenced by how we\npicture possible worlds (Coggins 2010, chapter 3). If possible worlds\nare envisaged as containers, then they can be completely emptied.\nSimilarly, if possible worlds are pictured as stories (say maximally\nconsistent ways things could have been), then our library will contain\na tale lacking any concrete entities as characters. But if possible\nworlds are pictured mereologically, as giant conglomerates of concrete\nobjects (Lewis 1986), our subtraction falters before we reach zero.\nSimilarly, if possible worlds require an active construction (say,\nimaginary rearrangements of objects drawn from the actual world), then\nthe very process of construction ensures that there are some concrete\nobjects in every possible world.\n\nSome kind of background theory of possible worlds is needed. For\nwithout this substantive guidance, the subtraction argument seems\ninvalid. More specifically, from a metaphysically neutral perspective,\nthe fact that it is possible for each object to not exist seems\ncompatible with it being necessary that at least one object\nexists.\n\nThe founder of modal logic, Aristotle, has special reason to deny that\n‘Necessarily (p or q)’ entails\n‘Necessarily p or necessarily q’.\nAristotle believed that all abstract entities depend on concrete\nentities for their existence. Yet he also believed that there are\nnecessary truths. The existence of any particular individual is\ncontingent but it is necessary that some individuals exist.\n\nScience textbooks teem with contingent abstract entities: the equator,\nJupiter’s center of gravity, the European Space Agency’s\nbudget, etc. Twentieth century mathematics made sets central. Sets are\ndefined in terms of their members. Therefore, any set that contains a\ncontingent entity is itself a contingent entity. Any set that contains\nCameron Winklevoss is an abstract entity that has no weight or color\nor electric charge. But it still depends on Cameron Winklevoss for its\nexistence.\n\nMathematics can be reconstructed in terms of sets given the assumption\nthat something exists. From Cameron Winklevoss, set theorists can\nderive the set containing him, then the set containing that set, then\nthe set containing that larger set, and so on. Through arachnophilic\ncraftiness, all of mathematics can be reconstructed from sets. But\nfounding all of mathematics on Cameron Winklevoss would fail to\nreflect the necessary status of mathematical truth. Founding\nmathematics on a necessary being such as God would alienate atheists.\nSo ecumenical set theorists instead spin this amazing structure from\nonly the set that does not depend on the existence of anything: the\nempty set. This is the closest mathematicians get to creation from\nnothing!\n\nThis does not avoid all controversy. Early set theorists and an array\nof contemporary metaphysicians reject the empty set. Yet the\nloveliness of the construction makes many of their colleagues\nreceptive to Wesley Salmon’s ontological argument: “The\nfool saith in his heart that there is no empty set. But if that were\nso, then the set of all such sets would be empty, and hence\nit would be the empty set.” (Gardner 1977, 32).\n\nE. J. Lowe (2013, 192) argues on behalf of the fool: Two sets are\nidentical exactly if they have the same members. So the identity of a\nset is grounded on the identity conditions of its members. In the\nabsence of members, the set is ill-defined. Mathematicians may wield\nit as a useful fiction. But utility should not be confused with truth.\nSince mathematical statements such as ‘The first prime number\nafter 1,000,000 is 1,000,003’ are necessary truths and can only\nbe rendered true by the existence of a contingent being, such as\nCameron Winklevoss, Lowe concludes that there necessarily exists at\nleast one contingent being. Consequently, the empty world is\nimpossible even if there are no necessary beings.\n\nThere are other metaphysical systems that make the existence of some\nconcrete entities necessary without implying that there are any\nnecessarily existing concrete things. In his Tractatus phase,\nLudwig Wittgenstein takes a world to be a totality of facts. A fact\nconsists of one or more objects related to each other in a certain\nway. By an act of selective attention, we concentrate on just the\nobjects or just the relations. But objects and relations are always\ninextricably bound up with each other. Since every fact requires at\nleast one object, a world without objects would be a world without\nfacts. But a factless world is a contradiction in terms. Therefore,\nthe empty world is impossible.\n\nNevertheless, the persuasiveness of the subtraction argument is not\nentirely hostage to background theories about the nature of possible\nworlds. Even those with metaphysical systems that guarantee the\nexistence of some concrete entities feel pressure to revise those\nsystems to accommodate the empty world, or at least to look for some\nloophole that would make their system compatible with Baldwin’s\nthought experiment.\n\nConsider the combinatorialist David Armstrong. He eventually\nacquiesced to the empty world by relaxing his account of truthmakers.\nA truthmaker is a piece of reality that makes a statement true.\nArmstrong believes that every contingent truth is made true by a\ntruthmaker and has wielded the principle forcefully against analytical\nbehaviorists, phenomenalists, nominalists, and presentists. Since\nthere can be no truthmaker for an empty world, Armstrong appears to\nhave a second objection to the empty world (supplementing the\nobjection based on his combinatorial conception of a possible world).\nYet Armstrong (2004, 91) instead claims that the empty world could\nborrow truthmakers from the actual world. His idea is that the\ntruthmakers for possibilities are actual objects and that these actual\nobjects could serve as the truthmakers for the empty world. David\nEfird and Tom Stoneham (2009) object that cross-world truthmakers\nwould be equally handy to the analytical behaviorists, phenomenalists\nand their ilk. Whether or not Armstrong has contradicted himself, he\nhas illustrated the persuasiveness of the subtraction argument.\n8. Ontological neutrality\n\nAristotle assumes that universal generalizations have existential\nimport; ‘All gods are immortal’ implies that there are\ngods. Contemporary logicians agree that universal quantifiers have\nexistential import: pantheism, ‘All is god’, entails\ntheism, ‘There is a god’ . However, contemporary logicians\ndiffer from Aristotle in analyzing universal generalizations as\nconditionals. They think ‘All gods are immortal’ has the\nform ‘For each thing, if it is a god, then it is\nimmortal’. So if there are no gods, the conditional is vacuously\ntrue. This explains why the atheist can consistently argue: All gods\nare immortal. Immortality is impossible. Therefore, there are no\ngods.\n\nContemporary logicians are also impressed by the intuitive equivalence\nbetween ‘All men are mortal’ and its contrapositive\n‘All immortals are non-men’. This equivalence is predicted\nby the hypothesis that universal generalizations are conditionals.\n\nTolerance of vacuously true generalizations does not stop contemporary\nclassical logic from precluding an empty world. Since its universal\nquantifier has existential import, each of its logical laws imply that\nsomething exists. For instance, the principle of identity,\nEverything is identical to itself entails There exists\nsomething that is identical to itself. Many attractive inferences\nare jeopardized by the empty world.\n\nLogicians do not treat their intolerance of the empty world as a\nresource for metaphysicians. They do not want to get involved in\nmetaphysical disputes. They feel that logic should be neutral with\nrespect to the existence of anything. They yearn to rectify this\n“defect in logical purity” (Russell 1919, 203).\n\nThe ideal of ontological neutrality has led some philosophers to\nreject classical logic. A direct response would be to challenge the\nexistential import of the classical quantifiers.\n\nProponents of “free logic” prefer to challenge the\nexistential presupposition of singular terms (Lambert 2003, 124). In\nclassical logic, names must have bearers. Free logic lacks this\nrestriction and so countenances empty names as in ‘Sherlock\nHolmes is a detective’ and negative existentials such as\n‘Pegasus does not exist’. Proponents of free logic suggest\nthat these departures are a necessary condition for not trivially\nimplying an existential proposition. Jan Heylen (2017) agrees but\ncontends that free logic trivially implies other existential\nsentences. He concludes that any deductive answer to the question will\nbeg the question. The background logic will always intrude.\n\nIn any case, the changes recommended by free logicians would certainly\nundermine W. V. O. Quine’s (1953a) popular criterion for\nontological commitment. Quine says that we can read off our ontology\nfrom the existentially quantified statements constituting our\nwell-accepted theories. For instance, if evolutionary theory says that\nthere are some species that evolved from other species, and if we have\nno way to paraphrase away this claim, then biologists are committed to\nthe existence of species. Since philosophers cannot improve on the\ncredentials of a scientific commitment, metaphysicians would also be\nobliged to accept species.\n\nSo how does Quine defend his criterion of ontological commitment from\nthe menace looming from the empty domain? By compromise. Normally one\nthinks of a logical theorem as a proposition that holds in all\ndomains. Quine (1953b, 162) suggests that we weaken the requirement to\nthat of holding in all non-empty domains. In the rare circumstances in\nwhich the empty universe must be considered, there is an easy way of\ntesting which theorems will apply: count all the universal\nquantifications as true, and all the existential quantifications as\nfalse, and then compute for the remaining theorems.\n\nIs Quine being ad hoc? Maybe. But exceptions are common for\nnotions in the same family as the empty domain. For instance,\ninstructors halt their students’ natural pattern of thinking\nabout division to forestall the disaster that accrues from permitting\ndivision by zero. If numbers were words, zero would be an irregular\nverb.\n9. The problem of multiple nothings\n\nMany of the principles used to rule out total emptiness also preclude\nsmall pockets of emptiness. Leibniz says that the actual world must\nhave something rather than nothing because the actual world must be\nthe best of all possible worlds, and something is better than nothing.\nBut by the same reasoning, Leibniz concludes there are no vacuums in\nthe actual world: more is better than less.\n\nLeibniz also targets the possibility of there being more than one\nvoid. If there could be more than one void, then there could be two\nvoids of exactly the same shape and size. These two voids would be\nperfect twins; everything true of one void would be true of the other.\nThis is precluded by the principle of the identity of indiscernibles:\nif everything true of x is true of y, then\nx is identical to y.\n\nA second problem with multiple voids arises from efforts to paraphrase\nthem away. From the time of Melissus, there have been arguments\nagainst the possibility of a void existing in the manner that an\nobject exists: “Nor is there any void, for void is nothing, and\nnothing cannot be.” (Guthrie 1965, 104) If you say there is a\nvacuum in the flask, then you are affirming the existence of something\nin the flask—the vacuum. But since ‘vacuum’ means an\nabsence of something, you are also denying that there is something in\nthe flask. Therefore, ‘There is a vacuum in the flask’ is\na contradiction.\n\nSome react to Melissus’s argument by analyzing vacuums as\nproperties of things rather than things in their own right. According\nto C. J. F. Williams (1984, 383), ‘There is a vacuum in the\nflask’ should be rendered as ‘The flask noths’. He\ndoes this in the same spirit that he renders ‘There is fog in\nWinchester’ as ‘Winchester is foggy’ and\n‘There is a smell in the basement’ as ‘The basement\nsmells’.\n\nIf this paraphrase strategy works for vacuums, it ought to work for\nthe more prosaic case of holes. Can a materialist believe that there\nare holes in his Swiss cheese? The holes are where the matter is not.\nSo to admit the existence of holes is to admit the existence of\nimmaterial objects!\n\nOne response is to paraphrase ‘There is a hole in the\ncheese’ as ‘The cheese holes’ or, to be a bit easier\non the ear, as ‘The cheese is perforated’. What appeared\nto be a wild existential claim has been domesticated into a comment on\nthe shape of the cheese.\n\nBut how are we to distinguish between the cheese having two holes as\nopposed to one? (Lewis and Lewis 1983, 4) Well, some cheese is singly\nperforated, some cheese is doubly-perforated, yet other cheese is\nn-perforated where n equals the number of holes in\nthe cheese.\n\nWhoa! We must be careful not to define\n‘n-perforation’ in terms of holes; that would\nre-introduce the holes we set out to avoid.\n\nCan holes be evaded by confining ourselves to the process of\nperforation? Single-hole punchers differ from triple-hole punchers by\nhow they act; singlely rather than triply.\n\nThe difficulty with this process-oriented proposal that the product, a\nhole, is needed to distinguish between successful and merely attempted\nperforation. Furthermore, the paraphrase is incomplete because it does\nnot extend to holes that arise from processes such as looping. If the\nuniverse popped into existence five minutes ago, then most holes\nformed without any process.\n\nCan we just leave expressions of the form\n‘n-perforated’ as primitive, unanalyzed shape\npredicates? David and Stephanie Lewis (1983) note that this strands us\nwith an infinite list of primitive terms. Such a list could never have\nbeen memorized. The Lewises do not see how\n‘n-perforated’ can be recursively defined without\nalluding to holes.\n\nThe paraphrase prospects seem equally bleak for being\n‘n-vacuumed’. Big meteorites pass through the\natmosphere in about one second leaving a hole in the\natmosphere—a vacuum in “thin air”. The air cannot\nrush in quickly enough to fill the gap. This explains why rock vapor\nfrom the impact launches back up into the atmosphere and later rains\ndown widely on the surface. During a meteorite shower, the atmosphere\nis multiply vacuumed. But this is just to say that there are many\nvacuums in the atmosphere.\n10. Is there any nothingness?\n\nThe trouble sustaining multiple voids may push us to the most extreme\nanswer to ‘Why is there something rather than nothing?’,\nnamely, ‘There must not only be something but there must not be\nany emptiness at all!’.\n\nParmenides maintained that it is self-defeating to say that something\ndoes not exist. The linguistic rendering of this insight is the\nproblem of negative existentials: ‘Atlantis does not\nexist’ is about Atlantis. A statement can be about something\nonly if that something exists. No relation without relata! Therefore,\n‘Atlantis does not exist’ cannot be true. Parmenides and\nhis disciples elaborated conceptual difficulties with negation into an\nincredible metaphysical monolith.\n\nThe Parmenideans were opposed by the atomists. The atomists said that\nthe world is constituted by simple, indivisible things moving in empty\nspace. They self-consciously endorsed the void to explain empirical\nphenomena such as movement, compression, and absorption.\n\nParmenides’s disciple, Zeno of Elea, had already amassed an\namazing battery of arguments to show motion is impossible. Since these\nimply that compression and absorption are also impossible, Zeno\nrejects the data of the atomists just as physicists reject the data of\nparapsychologists.\n\nLess radical opponents of vacuums, such as Aristotle, re-explained the\ndata within a framework of plenism: although the universe is full,\nobjects can move because other objects get out of the way. Compression\nand absorption can be accommodated by having things pushed out of the\nway when other things jostle their way in.\n\nIn the Timaeus, Aristotle’s teacher Plato attempted to\ncombine atomism with plenism as a “likely story”. The\natoms are the Platonic solids (regular, convex polyhedra), each having\na distinctive role in the composition of objects. Aristotle objects\nthat the Platonic solids cannot fill space. Every arrangement of\nPlatonic solids yields the sort of gaps that one can more readily\npredict in a universe composed solely of spherical atoms.\n\nAristotle agrees that atoms could fill space if they were all cubes.\nPressing his luck, Aristotle goes on to claim that tetrahedra can also\ncomplete space. It is testament to Aristotle’s subsequent\nauthority that this claim was accepted for seventeen hundred\nyears—despite being easily refutable by anyone trying to snugly\ncombine tetrahedral blocks. Almost any choice of shapes guarantees\ninterstitial vacua. This geometrical pressure for tiny vacua creates a\nprecedent for the cosmic void (which surrounds the material cosmos)\nand the intermediate empty spaces that provide a promising explanation\nof how motion is possible.\n\nYet Aristotle denied the void can explain how things move. Movement\nrequires a mover that is pushing or pulling the object. An object in a\nvacuum is not in contact with anything else. If the object did move,\nthere would be nothing to impede its motion. Therefore, any motion in\na vacuum would be at an unlimited speed. This conflicts with the\nprinciple that no object can be in two separate places at the same\ntime.\n\nAristotle’s refutation of the void persuaded most commentators\nfor the next 1500 years. There were two limited dissenters to his\nthesis that vacuums are impossible. The Stoics agreed that terrestrial\nvacuums are impossible but believed there must be a void surrounding\nthe cosmos. Hero of Alexandria agreed that there are no naturally\noccurring vacuums but believed that they can be formed artificially.\nHe cites pumps and siphons as evidence that voids can be created. Hero\nbelieved that bodies have a natural horror of vacuums and struggle to\nprevent their formation. You can feel the antipathy by trying to open\na bellows that has had its air hole plugged. Try as you might, you\ncannot separate the sides. However, unlike Aristotle, Hero thought\nthat if you and the bellows were tremendously strong, you could\nseparate the sides and create a vacuum.\n\nHero’s views became more discussed after the Church’s\nanti-Aristotelian condemnation of 1277 which required Christian\nscholars to allow for the possibility of a vacuum. The immediate\nmotive was to preserve God’s omnipotence. God could have chosen\nto create the world in a different spot. He could have made it bigger\nor smaller. God could have also chosen to make the universe a\ndifferent shape. These possibilities entail the possibility of a\nvacuum.\n\nA second motivation is a literal reading of Genesis 1:1. This opening\npassage of the Bible describes God as creating the world from nothing.\nSuch a construction seems logically impossible. Commitment to an\nillogical miracle jeopardized the Christian’s overarching\ncommitment to avoid outright irrationality. If creation out of nothing\nwere indeed a demonstrable impossibility, then faith would be forced\nto override an answer given by reason rather than merely answer a\nquestion about which reason is silent.\n\nAll Greek philosophy had presupposed creation was from something more\nprimitive, not nothing. Consistently, the Greeks assumed destruction\nwas disassembly into more basic units. (If destruction into\nnothingness were possible, the process could be reversed to get\ncreation from nothing.) The Christians were on their own when trying\nto make sense of creation from nothing. (Ancient Chinese philosophers\nare sometimes translated as parallel believers in creation from\nnothing. JeeLoo Liu (2014) cautions that both the Daoist and\nConfucians are speaking about formlessness rather than\nnothingness.)\n\nCreation out of nothing presupposes the possibility of total\nnothingness. This in turn implies that there can be some nothingness.\nThus Christians had a motive to first establish the possibility of a\nlittle nothingness. Their strategy was to start small and scale\nup.Accordingly, scholars writing in the aftermath of the condemnation\nof 1277 proposed various recipes for creating vacuums (Schmitt 1967).\nOne scheme was to freeze a sphere filled with water. After the water\ncontracted into ice, a vacuum would form at the top.Aristotelians\nreplied that the sphere would bend at its weakest point. When the\nvacuists stipulated that the sphere was perfect, the rejoinder was\nthat this would simply prevent the water from turning into ice.\n\nNeither side appears to have tried out the recipe. If either had, then\nthey would have discovered that freezing water expands rather than\ncontracts. To contemporary thinkers, this dearth of empirical testing\nis bizarre. The puzzle is intensified by the fact that the medievals\ndid empirically test many hypotheses, especially in optics.\n\nHero was eventually refuted by experiments conducted by Evangelista\nTorricelli and Blaise Pascal. In effect, they created a barometer\nconsisting of a tube partially submerged, upside down, in bowl of\nmercury. What keeps the mercury suspended in the tube? Is there an\nunnatural vacuum that causes the surrounding glass to pull the liquid\nup? Or is there no vacuum at all but rather some rarefied and\ninvisible matter in the “empty space”? Pascal answered\nthat there really was nothing holding up the mercury. The mercury\nrises and falls due to variations in the weight of the atmosphere. The\nmercury is being pushed up the tube, not pulled up by\nanything.\n\nWhen Pascal offered this explanation, Descartes wrote Christian\nHuygens (8 December 1647) that the hasty young man had the vacuum too\nmuch on his mind. (A more amusing translation of the letter has\nDescartes complaining that Pascal had too much vacuum in his head;\nalas, Descartes’ writing loses something in the original.)\nDescartes identified bodies with extension and so had no room for\nvacuums. If there were nothing between two objects, then they would be\ntouching each other. And if they are touching each other, there is no\ngap between them.\n\nWell maybe the apparent gap is merely a thinly occupied region of\nspace. On this distributional model, there is no intermediate\n“empty object” that separates the two objects. There is\nmerely unevenly spread matter. This model is very good at eliminating\nvacuums in the sense of empty objects. However, it is also rather good\nat eliminating ordinary objects. What we call objects would just be\nrelatively thick deposits of matter. There would be only one natural\nobject: the whole universe. This may have been the point of\nSpinoza’s attack on vacuums (Bennett 1980). (Indian philosophers\nassociate nothingness with lack of differentiation. They may prefer to\ndescribe Spinoza’s world as a realm of nothingness dominated by\na single overarching unity.)\n\nDescartes was part of a tradition that denied action at a distance.\nThis orthodoxy included Galileo. He was distressed by Johannes\nKepler’s hypothesis that the moon influences the tides because\nthe hypothesis seems to require causal chains in empty space. How\ncould the great Kepler believe something so silly? After Isaac Newton\nresurrected Kepler’s hypothesis he eventually capitulated to\northodoxy and stuffed the space between the moon and the Earth with\nether.\n\nIndeed, the universality of Newton’s law of gravitation seems to\nrequire that the whole universe be filled with a subtle substance. How\nelse could the universe be bound together by causal chains? Hunger for\nether intensified as the wave-like features of light became\nestablished. It is tautologous that a wave must have a medium.\n\nOr is it? As the theoretical roles of the ether proliferated,\nphysicists began to doubt there could be anything that accomplished\nsuch diverse feats. These doubts about the existence of ether were\nintensified by the emergence of Einstein’s theory of relativity.\nHe presented his theory as a relational account of space; if there\nwere no objects, there would be no space. Space is merely a useful\nabstraction.\n\nEven those physicists who wished to retain substantival space broke\nwith the atomist tradition of assigning virtually no properties to the\nvoid. They re-assign much of ether’s responsibilities to space\nitself. Instead of having gravitational forces being propagated\nthrough the ether, they suggest that space is bent by mass. To explain\nhow space can be finite and yet unbounded, they characterize space as\nspherical. When Edwin Hubble discovered that heavenly bodies are\ntraveling away from each other (like ants resting on an expanding\nballoon), cosmologists were quick to suggest that space may be\nexpanding. “Expanding into what?” wondered bewildered\nlaymen, “How can space bend?”, “How can space have a\nshape?”, ….\n\nHistorians of science wonder whether the ether that was loudly pushed\nout the front door of physics is quietly returning through the back\ndoor under the guise of “space” (Kuhn 1962, 109). Quantum\nfield theory provides especially fertile ground for such speculation.\nParticles are created with the help of energy present in\n“vacuums”. To say that vacuums have energy and energy is\nconvertible into mass, is to deny that vacuums are empty. Many\nphysicists revel in the discovery that vacuums are far from empty.\n\nFrank Wilczek (1980), Stephen Hawking and Leonard Mlodinow (2010, 180)\nas well as Lawrence Krauss (2012) explicitly claim that this answers\nthe question of why there is something rather than nothing. The basic\nidea goes back to an issue raised by the symmetry of matter and\nanti-matter. Given that the symmetry implies equality, matter and\nanti-matter should have annihiliated each other. Creation should have\nbeen aborted. Why is there NOW something (particles) rather than\nnothing (mere energy in a quantum field)? This question was answered\nby calculations suggesting that there was about a billionth more\nmatter than anti-matter. Although it is still possible for the\nuniverse to be without particles, the slight numeric imbalance biases\nthe universe toward states in which there are many particles. A small\nrandom change can trigger a phase transition analogous to the\ntransformation of very cold liquid beer into solid beer when the cap\nof the bottle is popped (suddenly reducing the pressure in the\nbottle).\n\nA proud physicist is naturally tempted to announce these insights\nthrough the bullhorn of metaphysics. But philosophers interested in\nthe logic of questions will draw attention to the role of emphasis in\nframing requests for explanations. ‘Why did Eve eat the\napple?’, ‘Why did Eve eat the apple?’, and\n‘Why did Eve eat the apple?’ are different\nquestions because they specify different contrast classes (van\nFraassen 1980, 127–130). Philosophers read ‘Why is there\nsomething rather than nothing?’ tenselessly as in ‘Why is\nπ an irrational number?’. The philosophers also read\n‘something’ as a quantifier ranging over any concrete\nentity. The quantum vacuum is a concrete entity (in the sense\ndescribed in sections 4 and 7) and so is in the philosopher’s\ndomain of discourse. But for rhetorical effect, physicists\nanachronistically back-date their domain of discourse to the things of\nnineteenth century physics. Thus the physicists wind up addressing\n‘Why is there some thing rather than\nnothing?’.\n\nPhilosophers complain of misleading advertising. They asked one\nquestion and the proud physicists answered a different question.\nLawrence Krauss defends the switch as an improvement. Often scientists\nmake progress by altering the meaning of key terms. Why stick with an\nintractable (and arguably meaningless) question? We should wriggle\nfree from the dead hand of the past and rejuvenate our curiosity with\nthe vocabulary of contemporary cosmology.\n\nThe physicist turned philosopher, Rudolf Carnap (1950), recalls how\nthermodynamicists explicated “heat” into the more\nprecise concepts of temperature, thermal energy, and heat transfer.\nAlthough the new terms are not synonymous with the old, they bear\nenough similarity to disarm the objection that the physicists are\nmerely changing the topic. Our questions, like our children, can\nmature without losing their identity over time. (The idea of there\nbeing two different questions being asked is pursued in Carroll 2012,\nOther Internet Resources.)\n\nDavid Albert is open to the possibility of old questions being\nimproved by new interests and discoveries. However, he denies that\nLawrence Krauss’s particular change of meaning constitutes an\nimprovement (2012, Other Internet Resources):\n\nRelativistic-quantum-field-theoretical vacuum states—no less\nthan giraffes or refrigerators or solar systems—are particular\narrangements of elementary physical stuff. The true\nrelativistic-quantum-field-theoretical equivalent to there not being\nany physical stuff at all isn’t this or that particular\narrangement of the fields—what it is (obviously, and\nineluctably, and on the contrary) is the simple absence of\nthe fields! The fact that some arrangements of fields happen to\ncorrespond to the existence of particles and some don’t is not a\nwhit more mysterious than the fact that some of the possible\narrangements of my fingers happen to correspond to the existence of a\nfist and some don’t. And the fact that particles can pop in and\nout of existence, over time, as those fields rearrange themselves, is\nnot a whit more mysterious than the fact that fists can pop in and out\nof existence, over time, as my fingers rearrange themselves. And none\nof these poppings—if you look at them aright—amount to\nanything even remotely in the neighborhood of a creation from nothing.\n\n11. Phenomenological aspects of nothingness\n\nAfter a mystical experience in 1654, Blaise Pascal’s interest in\nnothingness passed from its significance to science to the\nsignificance of nothingness to the human condition. Pascal thinks\nhuman beings have a unique perspective on their finitude. His\nPensées is a roller coaster ride surveying the human\nlot. Pascal elevates us to the level of angels by exalting in our\ngrasp of the infinite, and then runs us down below the beasts for\nwittingly choosing evil over goodness. From this valley of depravity\nPascal takes us up again by marveling at how human beings tower over\nthe microscopic kingdom, only to plunge us down toward insignificance\nby having us dwell on the vastness of space, and the immensity of\neternity.\n\nHe who regards himself in this light will be afraid of himself, and\nobserving himself sustained in the body given him by nature between\nthose two abysses of the Infinite and Nothing, will tremble at the\nsight of these marvels; and I think that, as his curiosity changes\ninto admiration, he will be more disposed to contemplate them in\nsilence than to examine them with presumption.\n\n\nFor in fact what is man in nature? A Nothing in comparison with the\nInfinite, an All in comparison with the Nothing, a mean between\nnothing and everything. Since he is infinitely removed from\ncomprehending the extremes, the end of things and their beginning are\nhopelessly hidden from him in an impenetrable secret; he is equally\nincapable of seeing the Nothing from which he was made, and the\nInfinite in which he is swallowed up. (Pensées sect.\nII, 72)\n\n\nPascal’s association of nothingness with insignificance and\nmeaninglessness was amplified by the Romantics. Their poetry\nde-emphasized salvation, seeking to immerse the reader in a raw\napprehension of nature, unmediated by reason. Kant further obscured\nGod by casting Him into the noumenal abyss, available only through\npractical faith rather than theoretical reason.\n\nAs among the first forthright atheists, Arthur Schopenhauer faced the\nfull force of ‘Why is there something rather than\nnothing?’. According to Schopenhauer, religion and rationalism\naim to reassure us that the universe has a design. Our astonishment\nthat there is anything betrays awareness that it is all a meaningless\naccident.\n\nReaders of Schopenhauer were presented with the awesome contingency as\nan actuality rather than a terrible possibility. The experience\ncaptured the attention of William James (who experimented with nitrous\noxide to understand the oceanic philosophy of Georg Hegel and, in\n1882, published this phenomenological investigation in Mind).\nJames provides a simple recipe for eliciting the emotion:\n\n\nOne need only shut oneself in a closet and begin to think of the fact\nof one’s being there, of one’s queer bodily shape in the\ndarkness … of one’s fantastic character and all, to have\nthe wonder steal over the detail as much as over the general fact of\nbeing, and to see that it is only familiarity that blunts it. Not only\nthat anything should be, but that this very thing\nshould be, is mysterious! (1911, 39)\n\n\nAnother emotional reader of Schopenhauer, Ludwig Wittgenstein,\ncharacterizes this unsettling phenomenology as exhausting the thrust\nof the riddle of existence. Instead of expressing a well-formed\nquestion, ‘Why is there something rather than nothing?’ is\na brute expression of awe.\n\n\n6.44 It is not how things are in the world that is mystical, but that\nit exists.\n\n6.45 To view the world sub specie aeterni is to view it as a\nwhole—as a limited whole. Feeling the world as a limited\nwhole—it is this that is mystical.\n\n6.5 When an answer cannot be put into words, neither can the\nquestion—the riddle does not exist. (From Tractatus\nLogico-Philosophicus)\n\n\nThis visceral characterization persists into Wittgenstein’s\nlater philosophy. In Lectures on Ethics, Wittgenstein uses\nthe language of seeing-as. ‘Why is there something rather than\nnothing?’ is a prompt to see the world as a miracle. This\ngestalt switch is not a mistake. Nor is it an insight. Even the\nlogical positivists were willing to grant the question has emotive\nmeaning (just not cognitive meaning).\n\nThe characteristic phenomenology of the question has also been\nsuggested as a resource in explaining why we fail to recognize the\nradical ambiguity of the question. Andrew Brenner (2016, 1319)\nconjectures that the multiplicity of interpretations is masked by the\nemotional unity.\n\nThinkers in the tradition of Phenomenology retained\nSchopenhauer’s conviction that the emotion harbors a\nmetaphysical insight. Instead of tossing the question into the\nemotivist waste basket, like the logical positivists, or lapsing into\nquietism, like Wittgenstein, existentialists provide detailed\ntreatments of the awe expressed by the ultimate question. They built\non Schopenhauer’s literary approach to philosophy, depicting the\nemotion in plays and novels such as Jean-Paul Sartre’s\nNausea. Like the arch-pessimist Schopenhauer, Sartre’s\nprotagonist experiences our crowded world as de trop,\nover-stuffed with accidental beings. Sartre himself, after an\nunpleasant experiment with mescaline, was chronically creeped out by\nthe country-side vegetation edging its way into Paris.\n\nIn The Concept of Dread, Søren Kierkegaard (1844)\nclaims that nothingness wells up into our awareness through moods and\nemotions. Emotions are intentional states; they are directed toward\nsomething. If angered, I am angry at something. If amused,\nthere is something I find amusing. Free floating anxiety is often\ncited as a counterexample. But Kierkegaard says that in this case the\nemotion is directed at nothingness.\n\nAccording to Heidegger, we have several motives to shy away from the\nsignificance of our emotional encounters with nothingness. They are\npremonitions of the nothingness of death. They echo the groundlessness\nof human existence.\n\nSome have hoped that our recognition of our rootlessness would rescue\nmeaning from the chaos of nothing. But Heidegger denies us such\nsolace.\n\nHeidegger does think freedom is rooted in nothingness. He also says we\nderive our concept of logical negation from this experience of\nnothing. This suggests a privileged perspective for human beings. We\ndiffer from animals with respect to nothing.\n12. Animal Cognition of Absences\n\nSince Heidegger thinks that animals do not experience nothingness, he\nis committed to skepticism about animal reasoning involving negation.\nConsider the Stoic example of a dog that is following a trail. The dog\nreaches a fork in the road, sniffs at one road and then, without a\nfurther sniff, proceeds down the only remaining road. The Stoics took\nthis as evidence that the dog has performed a disjunctive syllogism:\n“Either my quarry went down this road or that road.\nSniff—he did not go down this road. Therefore, he went\ndown that road.” Heidegger must discount this as\nanthropomorphism.\n\nMany biologists and psychologists side with the Stoic’s emphasis\non our continuity with animals. They deny that human beings have a\nmonopoly on nothingness. A classic anomaly for the stimulus-response\nbehaviorist was the laboratory rat that responds to the absence of a\nstimulus:\n\nOne rather puzzling class of situations which elicit fear are those\nwhich consist of a lack of stimulation. Some members of this\nclass may be special instances of novelty. An anesthetised chimpanzee\ncould be described as a normal chimpanzee with the added novelty of\n‘no movement’; solitude could be the novelty of ‘no\ncompanions’. This is not simply quibbling with words; for there\nis very good evidence (see Chapter 13) that the failure of a stimulus\nto occur at a point in time or space where it usually occurs acts like\nany other kind of novel stimulus. However, the intensity of the fear\nevoked by the sight of a dead or mutilated body is so much greater\nthan that evoked by more ordinary forms of novelty that we perhaps\nought to seek an alternative explanation of the effects of this\nstimulus. Fear of the dark is also difficult to account for in terms\nof novelty, since by the time this fear matures darkness is no less\nfamiliar than the light. (Gray 1987, 22)\n\n\nThese anomalies for behaviorism fill rationalists with mixed emotions.\nOn the one hand, the experiments refute the empiricist principle that\neverything known about the world is learned from experience. On the\nother hand, the experiments also constitute a caution against\nover-intellectualizing absences. A correct explanation of emotional\nengagement with absences must be more general and cognitively less\ndemanding than rationalists tend to presuppose. Even mosquito larvae\nsee shadows. Doubts about whether they have consciousness do not make\nus doubt that they see shadows. So the perception of absences cannot\ndepend on consciousness or any other advanced mental state. Perhaps\nthe earliest form of vision was of these absences of light. So instead\nof being a pinnacle of intellectual sophistication, cognition of\nabsences may be primal.\n\nExistentialists endorse the high standards assumed by rationalists.\nTheir disagreement with the rationalists is over whether the standards\nare met. The existentialists are disappointed by the contrast between\nour expectations of how reality ought to behave and how it in fact\nperforms.\n\nThis sense of absurdity makes existentialists more accepting of\nparadoxes than rationalists. Whereas rationalists nervously view\nparadoxes as a challenge to the authority of reason, existentialists\nwelcome them as opportunities to correct unrealistic hopes.\nExistentialists are fond of ironies and do not withdraw reflexively\nfrom the pain of contradiction. They Stoically introspect upon the\ninconsistency in the hope of achieving a resolution that does justice\nto the three dimensionality of deep philosophical problems. For\ninstance, Heidegger is sensitive to the hazards of saying that nothing\nexists. Like an electrician who must twist and bend a wire to make it\ntravel through an intricate hole, the metaphysician must twist and\nbend a sentence to probe deeply into the nature of being.\n\nRudolf Carnap thinks Heidegger’s contorted sentences\nmalfunction. To illustrate, Carnap quotes snippets from\nHeidegger’s What is Metaphysics?:\n\nWhat is to be investigated is being only and—nothing else; being\nalone and further—nothing; solely being, and beyond\nbeing-nothing. What about this Nothing? … Does the Nothing\nexist only because the Not, i.e. the Negation, exists? Or is it the\nother way around? Does Negation and the Not exist only because the\nNothing exists? … We assert: the Nothing is prior to the Not\nand the Negation…. Where do we seek the Nothing? How do we find\nthe Nothing…. We know the Nothing…. Anxiety reveals the\nNothing…. That for which and because of which we were anxious,\nwas ‘really’—nothing. Indeed: the Nothing\nitself—as such—was present…. What about this\nNothing?—The Nothing itself nothings. (Heidegger as\n“quoted” by Carnap 1932, 69)\n\n\nThis paragraph, especially the last sentence, became notorious as a\nspecimen of metaphysical nonsense.\n\nThe confusion caused by Heidegger’s linguistic contortions is\nexacerbated by separating them from their original text and herding\nthem into a crowded pen. There is a difference between a failure to\nunderstand and an understanding of failure. The real test for whether\nHeidegger’s sentences are meaningless is to see what can be made\nof them in action, applied to the questions they were designed to\nanswer.\n\nCarnap also needs to consider the possibility that Heidegger’s\nsentences are illuminating nonsense. After all, Carnap was patient\nwith the cryptic Wittgenstein. In the Tractatus, Wittgenstein\nspeaks like an oracle. He even characterized his carefully enumerated\nsentences as rungs in a ladder that must be cast away after we have\nmade the ascent and achieved an ineffable insight. And Wittgenstein\nmeant it, quitting philosophy to serve as a lowly schoolmaster in a\nrural village.\n\nOther critics deny that What is Metaphysics? suffers from an\nabsence of meaning. Just the reverse: they think Heidegger’s\npassages about nothing involve too many meanings. When\nHeidegger connects negation with nothingness and death, these\nlogicians are put in mind of an epitaph that toys with the principle\nof excluded middle: Mrs Nott was Nott Alive and is Nott Dead.\nAccording to these critics, Heidegger’s writings can only be\nunderstood in the way we understand the solution to equivocal\nriddles:\n\nWhat does a man love more than life?\n\nHate more than death or mortal strife?\n\nThat which contented men desire,\n\nThe poor have, the rich require,\n\nThe miser spends, the spendthrift saves,\n\nAnd all men carry to their graves?\n\n\n(Leeming, 1953, 201)\n\n\nThe answer, Nothing, can only be seen through a kaleidoscope\nof equivocations.\n\nSome of the attempts to answer ‘Why is there something rather\nthan nothing?’ equivocate or lapse into meaninglessness. The\ncomedic effect of such errors is magnified by the fundamentality of\nthe question. Error here comes off as pretentious error.\n\nThose who ask the question ‘Why is there something rather than\nnothing?’ commonly get confused. But the question itself appears\nto survive tests for being merely a verbal confusion.\n\nIn any case, the question (or pseudo-question) has helped to hone the\ndiagnostic tools that have been applied to it. As the issue gets\nshaped and re-shaped by advances in our understanding of\n‘is’, quantification and explanatory standards, it becomes\nevident that the value of these diagnostic tools is not exhausted by\ntheir service in exposing pseudo-questions. For genuine questions\nbecome better understood when we can discriminate them from their\nspurious look-alikes.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Armstrong, David, 1989, <em>A Combinatorial Theory of\nPossibility</em>, Cambridge: Cambridge University Press.",
                "–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.",
                "Baldwin, Thomas, 1996, “There might be nothing”,\n<em>Analysis</em>, 56: 231–38.",
                "Beebee, Helen, 2004, “Causing and Nothingness”, in\n<em>Causation and Counterfactuals</em>, John Collins, Ned Hall, and L.\nA. Paul (eds.), Cambridge: MIT Press, 291–308.",
                "Bennett, Jonathan, 1980, “Spinoza’s Vacuum\nArgument”, <em>Midwest Studies in Philosophy</em> (Volume 5),\nMinneapolis: University of Minnesota Press.",
                "Bergson, Henri, 1944, <em>Creative Evolution</em>, trans. A.\nMitchell, New York: The Modern Library.",
                "Brenner, Andrew, 2016, “What do we mean when we ask\n‘Why is there something rather than nothing?’”,\n<em>Erkenntnis</em>, 81: 1305–1322.",
                "Carlson, Erik and Erik J. Olsson, 2001, “The Presumption of\nNothingness”, <em>Ratio</em>, 14: 203–221.",
                "Carnap, Rudolf, 1932, “The Elimination of Metaphysics\nThrough Logical Analysis of Language,” trans. Arthur Pap, in A.\nJ. Ayer (ed.), <em>Logical Positivism</em>, New York: The Free Press,\n60–81. Originally published in German in <em>Erkenntnis</em>,\nVolume 2.",
                "–––, 1950, <em>Logical Foundations of\nProbability</em>, Chicago: University of Chicago Press.",
                "Carroll, John W., 1994, <em>Laws of Nature</em>, Cambridge:\nCambridge University Press.",
                "Casati, Filippo &amp; Naoya Fujikawa, 2015, “Better Than\nZilch?” <em>Logic and Logical Philosophy</em> 24(2):\n255–264.",
                "Chen, Ellen Marie, 1969, “Nothingness and the mother\nprinciple in early Chinese Taoism”, <em>International\nPhilosophical Quarterly</em>, 9: 391–405.",
                "Coggins, Geraldine, 2010, <em>Could There Have Been Nothing?\nAgainst Metaphysical Nihilism</em>, London: Palgrave Macmillan.",
                "Dallmayr, Fred, 1992, “Nothingness and\n<em>Śūnyatā</em>: A Comparison of Heidegger and\nNishitani”, <em>Philosophy East and West</em>, 42/1:\n37–48. doi:10.2307/1399690",
                "Dawkins, Richard, 1998, <em>Unweaving the Rainbow </em>Boston:\nHoughton Mifflin.",
                "Efird, D. and Stoneham, T., 2005, “The Subtraction Argument\nfor Metaphysical Nihilism”, <em>Journal of Philosophy</em>, 102:\n303–325.",
                "–––, 2009, “Is Metaphysical Nihilism\nInteresting?”, <em>Pacific Philosophical Quarterly</em>, 90(2):\n210–231.",
                "Epstein, Lewis C., 1983, <em>Thinking Physics is Gedanken\nPhysics</em>, San Francisco: Insight Press.",
                "Gale, Richard, 1976, <em>Negation and Non-Being</em>, <em>American\nPhilosophical Quarterly</em> (Monograph Series No. 10).",
                "Gardner, Martin, 1977, <em>Mathematical Magic Show</em>, New York:\nAlfred A. Knopf.",
                "Grant, E., 1981, <em>Much ado about Nothing. Theories of Space and\nVacuum from the Middle Ages to the Scientific Revolution</em>,\nCambridge: Cambridge University Press.",
                "Gray, Jeffrey Alan, 1987, <em>The Psychology of Fear and\nStress</em>, Cambridge: Cambridge University Press.",
                "Grossmann, Reinhardt, 1992, <em>The Existence of the World</em>,\nLondon: Routledge.",
                "Guthrie, W. K. C., 1965, <em>A History of Greek Philosophy</em>\n(Volume 2), Cambridge: Cambridge University Press.",
                "Hawking, Stephen and Leonard Mlodinow, 2010, <em>The Grand\nDesign</em>, New York: Bantam Books.",
                "Heidegger, Martin, 1959, <em>Introduction to Metaphysics</em>,\nTrans. R. Manheim. New Haven: Yale University Press.",
                "–––, 1962, <em>Being and Time</em>, trans. J.\nMacquarrie and E. Robinson, New York: Harper &amp; Row.",
                "Heil, John, 2013, “Contingency”, in <em>The Puzzle of\nExistence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n167–181.",
                "Heylen, Jan, 2017, “Why is there something rather than\nnothing? A logical investigation”, <em>Erkenntnis</em>, 82:\n531–559.",
                "Hugo, Victor, 1862, <em>Les Misérables</em>, translated by\nCharles Wilbour, New York: Random House.",
                "James, William 1882, “On Some Hegelisms”,\n<em>Mind</em>, 7: 186–208.",
                "–––, 1911, <em>Some Problems of Philosophy</em>\nNew York: Longmans, Green and Co.",
                "Kahneman, Daniel, Olivier Sibony, and Cass R. Sunstein, 2021,\n<em>Noise: A Flaw in Human Judgment</em>, New York: Little Brown.",
                "Kierkegaard, Søren (1944) <em>The Concept of Dread</em>\ntranslated by Walter Lowie, Princeton, New Jersey: Princeton\nUniversity Press.",
                "Kotzen, Matthew, 2013, “The Probabilistic Explanation of Why\nThere is Something Rather Than Nothing”, in <em>The Puzzle of\nExistence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n215–234.",
                "Krauss, Lawrence M., 2012, <em>A Universe from Nothing</em>, New\nYork: Free Press.",
                "Kripke, Saul, 1980, <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.",
                "Kuhn, Thomas, 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: Chicago University Press.",
                "Lambert, Karel, 2003, <em>Free Logic</em>, New York: Cambridge\nUniversity Press.",
                "Leeming, Joseph, 1953, <em>Riddles, Riddles, Riddles</em>, New\nYork: Franklin Watts, Inc.",
                "Leslie, John and Robert Lawrence Kuhn, 2013, <em>The Mystery of\nExistence</em>, Oxford: Wiley &amp; Sons.",
                "Lewis, David, 2004, “Void and Object”, in\n<em>Causation and Counterfactuals</em>, John Collins, Ned Hall, and L.\nA. Paul (eds.), Cambridge, MA: MIT Press, 277–290.",
                "–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Blackwell.",
                "Lewis, David and Stephanie Lewis, 1983, “Holes”, in\nDavid Lewis, <em>Philosophical Papers</em>, vol. 1 Oxford: Oxford\nUniversity Press, 3–9.",
                "Liu, JeeLoo, 2014, “Was There Something in Nothingness? The\nDebate on the Primordial State between Daoism and\nNeo-Confucianism”, in <em>Nothingness in Asian Philosophy</em>,\nJeeLoo Liu and Douglas Berger (eds.), London: Routledge Press,\n181–196.",
                "Lowe, E. J., 1996, “Why is There Anything at All?”,\n<em>Proceedings of the Aristotelian Society</em>, 70:\n111–120.",
                "–––, 2013, “Metaphysical Nihilism\nRevisited”, in <em>The Puzzle of Existence</em>, Tyron\nGoldschmidt (ed.), New York: Routledge, 182–196.",
                "–––, 2002, “Metaphysical nihilism and the\nsubtraction argument”, <em>Analysis</em>, 62: 62–73.",
                "Maddy, Penelope, 1990, <em>Realism in Mathematics</em>, Oxford:\nClarendon Press.",
                "Maitzen, Stephen, 2012, “Stop Asking ‘Why\nThere’s Anything’”, <em>Erkenntnis</em>, 77:\n51–63.",
                "Martin, Richard M., 1965, “Of Time and the Null\nIndividual”, <em>Journal of Philosophy</em>, 62(24):\n723–736.",
                "McDaniel, Kris, 2013, “Ontological Pluralism, the Gradation\nof Being, and the Question ‘Why is there Something Rather Than\nNothing?’”, in <em>The Puzzle of Existence</em>, Tyron\nGoldschmidt (ed.), New York: Routledge, 272–286.",
                "Mumford, Stephen 2021, <em>Absence and Nothing: the Philosophy of\nWhat There is Not </em>Clarendon: Oxford University Press.",
                "Munitz, M. K., 1965, <em>The Mystery of Existence</em>, New York:\nAppleton-Century-Crofts.",
                "Nozick, Robert, 1981, <em>Philosophical Explanations</em>\nCambridge: Harvard University Press.",
                "Parfit, Derek, 1998, “The Puzzle of Reality: Why does the\nUniverse Exist?”, in <em>Metaphysics: The Big Questions</em>,\ned. Peter Van Inwagen and D. W. Zimmerman, Malden, Massachusetts:\nBlackwell, 418–426.",
                "Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven:\nYale University Press.",
                "Pascal, Blaise, 1669, <em>Pensées</em>, trans. W. F.\nTrotter, The Harvard Classics, Volume XCVIII, Part 1, New York: P. F.\nCollier &amp; Sons, 1909–14.",
                "Paseau, Alexander, 2003, “Why the subtraction argument does\nnot add up”, <em>Analysis</em>, 62: 73–75.",
                "Priest, Graham, 2014, <em>One: Being an Investigation Into the\nUnity of Reality and of its Parts, Including the Singular Object Which\nis Nothingness</em>, Oxford: Oxford University Press.",
                "Quine, W. V. O., 1953a, “On What There Is”, <em>From a\nLogical Point of View</em>, New York: Harper &amp; Row.",
                "–––, 1953b, “Meaning and Existential\nInference”, <em>From a Logical Point of View</em>, New York:\nHarper &amp; Row.",
                "–––, 1954, “Quantification and the Empty\nDomain”, <em>The Journal of Symbolic Logic</em>, 19(3):\n177–179.",
                "–––, 1959, <em>Methods of Logic</em>, New York:\nHolt, Rinehart and Winston.",
                "Rayo, A., 2020, “Absolute Generality”, in <em>The\nRoutledge Handbook of Metametaphysics</em>, ed. Ricki Bliss and J. T.\nMiller, London and New York: Routledge, Taylor, and Francis, pp.\n130–142.",
                "Rodriguez-Pereyra, Gonzalo, 1997, “There might be nothing:\nthe subtraction argument improved”, <em>Analysis</em>, 57(3):\n159–166.",
                "–––, 2013, “The Subtraction Arguments for\nMetaphysical Nihilism: Compared and Defended”, in <em>The Puzzle\nof Existence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n197–214.",
                "Rowe, William, 1975, <em>The Cosmological Argument</em>,\nPrinceton: Princeton University Press.",
                "Rundle, Bede, 2004, <em>Why There is Something Rather than\nNothing?</em>, Oxford: Oxford University Press.",
                "Russell, Bertrand, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: George Allen and Unwin.",
                "–––, 1985, <em>The Philosophy of Logical\nAtomism</em>, La Salle, Illinois: Open Court.",
                "Sartre, Jean Paul, 1969, <em>Being and Nothingness</em>, trans. H.\nE. Barnes, New York: Washington Square Press.",
                "Schmitt, Charles, 1967, “Experimental Evidence for and\nAgainst a Void: the Sixteenth-Century Arguments”, <em>Isis</em>,\n58: 352–366.",
                "Schopenhauer, Arthur, 1819, <em>The World as Will and\nRepresentation</em> (Volume 2), E. F. J. Payne (trans.), Colorado: The\nFalcon Wing Press, 1958.",
                "Sgaravatti, Daniele &amp; Giuseppe Spolaore, 2018, “Out of\nNothing”, <em>Thought: A Journal of Philosophy</em>, 7(2):\n132–138. doi:10.1002/tht3.274",
                "Sorensen, Roy, 2008, <em>Seeing Dark Things: The Philosophy of\nShadows</em>, New York: Oxford University Press.",
                "–––, 2022, <em>Nothing: A Philosophical\nHistory</em>, New York: Oxford University Press.",
                "Sperry-Taylor, Ashton T., 2019, “Reassessing Equilibrium\nExplanations: When are They Causal Explanations?”,\n<em>Synthese</em> 198(6): 5577–5598.",
                "Van Fraassen, Bas, 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.",
                "Van Inwagen, Peter, 1996. “Why Is There Anything at\nAll?”, <em>Proceedings of the Aristotelian Society</em>, 70:\n95–110.",
                "Vecsey, Zoltán, 2020, “Talking about nothing”,\n<em>Logic and Logical Philosophy</em> 29(2): 311–321.",
                "Wilczek, Frank, 1980, “The Cosmic Asymmetry Between Matter\nand Antimatter” <em>Scientific American</em>, 243(6):\n82–90.",
                "Williams, C. J. F., 1984, “The Ontological Disproof of the\nVacuum”, <em>Philosophy</em>, 59: 382–384.",
                "Wittgenstein, Ludwig, 1921, <em>Tractatus\nLogico-Philosophicus</em>, D. F. Pears and B. F. McGuinness (trans.),\nNew York: Humanities Press, originally published in 1961."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Armstrong, David, 1989, <em>A Combinatorial Theory of\nPossibility</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.</li>\n<li>Baldwin, Thomas, 1996, “There might be nothing”,\n<em>Analysis</em>, 56: 231–38.</li>\n<li>Beebee, Helen, 2004, “Causing and Nothingness”, in\n<em>Causation and Counterfactuals</em>, John Collins, Ned Hall, and L.\nA. Paul (eds.), Cambridge: MIT Press, 291–308.</li>\n<li>Bennett, Jonathan, 1980, “Spinoza’s Vacuum\nArgument”, <em>Midwest Studies in Philosophy</em> (Volume 5),\nMinneapolis: University of Minnesota Press.</li>\n<li>Bergson, Henri, 1944, <em>Creative Evolution</em>, trans. A.\nMitchell, New York: The Modern Library.</li>\n<li>Brenner, Andrew, 2016, “What do we mean when we ask\n‘Why is there something rather than nothing?’”,\n<em>Erkenntnis</em>, 81: 1305–1322.</li>\n<li>Carlson, Erik and Erik J. Olsson, 2001, “The Presumption of\nNothingness”, <em>Ratio</em>, 14: 203–221.</li>\n<li>Carnap, Rudolf, 1932, “The Elimination of Metaphysics\nThrough Logical Analysis of Language,” trans. Arthur Pap, in A.\nJ. Ayer (ed.), <em>Logical Positivism</em>, New York: The Free Press,\n60–81. Originally published in German in <em>Erkenntnis</em>,\nVolume 2.</li>\n<li>–––, 1950, <em>Logical Foundations of\nProbability</em>, Chicago: University of Chicago Press.</li>\n<li>Carroll, John W., 1994, <em>Laws of Nature</em>, Cambridge:\nCambridge University Press.</li>\n<li>Casati, Filippo &amp; Naoya Fujikawa, 2015, “Better Than\nZilch?” <em>Logic and Logical Philosophy</em> 24(2):\n255–264.</li>\n<li>Chen, Ellen Marie, 1969, “Nothingness and the mother\nprinciple in early Chinese Taoism”, <em>International\nPhilosophical Quarterly</em>, 9: 391–405.</li>\n<li>Coggins, Geraldine, 2010, <em>Could There Have Been Nothing?\nAgainst Metaphysical Nihilism</em>, London: Palgrave Macmillan.</li>\n<li>Dallmayr, Fred, 1992, “Nothingness and\n<em>Śūnyatā</em>: A Comparison of Heidegger and\nNishitani”, <em>Philosophy East and West</em>, 42/1:\n37–48. doi:10.2307/1399690</li>\n<li>Dawkins, Richard, 1998, <em>Unweaving the Rainbow </em>Boston:\nHoughton Mifflin.</li>\n<li>Efird, D. and Stoneham, T., 2005, “The Subtraction Argument\nfor Metaphysical Nihilism”, <em>Journal of Philosophy</em>, 102:\n303–325.</li>\n<li>–––, 2009, “Is Metaphysical Nihilism\nInteresting?”, <em>Pacific Philosophical Quarterly</em>, 90(2):\n210–231.</li>\n<li>Epstein, Lewis C., 1983, <em>Thinking Physics is Gedanken\nPhysics</em>, San Francisco: Insight Press.</li>\n<li>Gale, Richard, 1976, <em>Negation and Non-Being</em>, <em>American\nPhilosophical Quarterly</em> (Monograph Series No. 10).</li>\n<li>Gardner, Martin, 1977, <em>Mathematical Magic Show</em>, New York:\nAlfred A. Knopf.</li>\n<li>Grant, E., 1981, <em>Much ado about Nothing. Theories of Space and\nVacuum from the Middle Ages to the Scientific Revolution</em>,\nCambridge: Cambridge University Press.</li>\n<li>Gray, Jeffrey Alan, 1987, <em>The Psychology of Fear and\nStress</em>, Cambridge: Cambridge University Press.</li>\n<li>Grossmann, Reinhardt, 1992, <em>The Existence of the World</em>,\nLondon: Routledge.</li>\n<li>Guthrie, W. K. C., 1965, <em>A History of Greek Philosophy</em>\n(Volume 2), Cambridge: Cambridge University Press.</li>\n<li>Hawking, Stephen and Leonard Mlodinow, 2010, <em>The Grand\nDesign</em>, New York: Bantam Books.</li>\n<li>Heidegger, Martin, 1959, <em>Introduction to Metaphysics</em>,\nTrans. R. Manheim. New Haven: Yale University Press.</li>\n<li>–––, 1962, <em>Being and Time</em>, trans. J.\nMacquarrie and E. Robinson, New York: Harper &amp; Row.</li>\n<li>Heil, John, 2013, “Contingency”, in <em>The Puzzle of\nExistence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n167–181.</li>\n<li>Heylen, Jan, 2017, “Why is there something rather than\nnothing? A logical investigation”, <em>Erkenntnis</em>, 82:\n531–559.</li>\n<li>Hugo, Victor, 1862, <em>Les Misérables</em>, translated by\nCharles Wilbour, New York: Random House.</li>\n<li>James, William 1882, “On Some Hegelisms”,\n<em>Mind</em>, 7: 186–208.</li>\n<li>–––, 1911, <em>Some Problems of Philosophy</em>\nNew York: Longmans, Green and Co.</li>\n<li>Kahneman, Daniel, Olivier Sibony, and Cass R. Sunstein, 2021,\n<em>Noise: A Flaw in Human Judgment</em>, New York: Little Brown.</li>\n<li>Kierkegaard, Søren (1944) <em>The Concept of Dread</em>\ntranslated by Walter Lowie, Princeton, New Jersey: Princeton\nUniversity Press.</li>\n<li>Kotzen, Matthew, 2013, “The Probabilistic Explanation of Why\nThere is Something Rather Than Nothing”, in <em>The Puzzle of\nExistence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n215–234.</li>\n<li>Krauss, Lawrence M., 2012, <em>A Universe from Nothing</em>, New\nYork: Free Press.</li>\n<li>Kripke, Saul, 1980, <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Kuhn, Thomas, 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: Chicago University Press.</li>\n<li>Lambert, Karel, 2003, <em>Free Logic</em>, New York: Cambridge\nUniversity Press.</li>\n<li>Leeming, Joseph, 1953, <em>Riddles, Riddles, Riddles</em>, New\nYork: Franklin Watts, Inc.</li>\n<li>Leslie, John and Robert Lawrence Kuhn, 2013, <em>The Mystery of\nExistence</em>, Oxford: Wiley &amp; Sons.</li>\n<li>Lewis, David, 2004, “Void and Object”, in\n<em>Causation and Counterfactuals</em>, John Collins, Ned Hall, and L.\nA. Paul (eds.), Cambridge, MA: MIT Press, 277–290.</li>\n<li>–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Blackwell.</li>\n<li>Lewis, David and Stephanie Lewis, 1983, “Holes”, in\nDavid Lewis, <em>Philosophical Papers</em>, vol. 1 Oxford: Oxford\nUniversity Press, 3–9.</li>\n<li>Liu, JeeLoo, 2014, “Was There Something in Nothingness? The\nDebate on the Primordial State between Daoism and\nNeo-Confucianism”, in <em>Nothingness in Asian Philosophy</em>,\nJeeLoo Liu and Douglas Berger (eds.), London: Routledge Press,\n181–196.</li>\n<li>Lowe, E. J., 1996, “Why is There Anything at All?”,\n<em>Proceedings of the Aristotelian Society</em>, 70:\n111–120.</li>\n<li>–––, 2013, “Metaphysical Nihilism\nRevisited”, in <em>The Puzzle of Existence</em>, Tyron\nGoldschmidt (ed.), New York: Routledge, 182–196.</li>\n<li>–––, 2002, “Metaphysical nihilism and the\nsubtraction argument”, <em>Analysis</em>, 62: 62–73.</li>\n<li>Maddy, Penelope, 1990, <em>Realism in Mathematics</em>, Oxford:\nClarendon Press.</li>\n<li>Maitzen, Stephen, 2012, “Stop Asking ‘Why\nThere’s Anything’”, <em>Erkenntnis</em>, 77:\n51–63.</li>\n<li>Martin, Richard M., 1965, “Of Time and the Null\nIndividual”, <em>Journal of Philosophy</em>, 62(24):\n723–736.</li>\n<li>McDaniel, Kris, 2013, “Ontological Pluralism, the Gradation\nof Being, and the Question ‘Why is there Something Rather Than\nNothing?’”, in <em>The Puzzle of Existence</em>, Tyron\nGoldschmidt (ed.), New York: Routledge, 272–286.</li>\n<li>Mumford, Stephen 2021, <em>Absence and Nothing: the Philosophy of\nWhat There is Not </em>Clarendon: Oxford University Press.</li>\n<li>Munitz, M. K., 1965, <em>The Mystery of Existence</em>, New York:\nAppleton-Century-Crofts.</li>\n<li>Nozick, Robert, 1981, <em>Philosophical Explanations</em>\nCambridge: Harvard University Press.</li>\n<li>Parfit, Derek, 1998, “The Puzzle of Reality: Why does the\nUniverse Exist?”, in <em>Metaphysics: The Big Questions</em>,\ned. Peter Van Inwagen and D. W. Zimmerman, Malden, Massachusetts:\nBlackwell, 418–426.</li>\n<li>Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven:\nYale University Press.</li>\n<li>Pascal, Blaise, 1669, <em>Pensées</em>, trans. W. F.\nTrotter, The Harvard Classics, Volume XCVIII, Part 1, New York: P. F.\nCollier &amp; Sons, 1909–14.</li>\n<li>Paseau, Alexander, 2003, “Why the subtraction argument does\nnot add up”, <em>Analysis</em>, 62: 73–75.</li>\n<li>Priest, Graham, 2014, <em>One: Being an Investigation Into the\nUnity of Reality and of its Parts, Including the Singular Object Which\nis Nothingness</em>, Oxford: Oxford University Press.</li>\n<li>Quine, W. V. O., 1953a, “On What There Is”, <em>From a\nLogical Point of View</em>, New York: Harper &amp; Row.</li>\n<li>–––, 1953b, “Meaning and Existential\nInference”, <em>From a Logical Point of View</em>, New York:\nHarper &amp; Row.</li>\n<li>–––, 1954, “Quantification and the Empty\nDomain”, <em>The Journal of Symbolic Logic</em>, 19(3):\n177–179.</li>\n<li>–––, 1959, <em>Methods of Logic</em>, New York:\nHolt, Rinehart and Winston.</li>\n<li>Rayo, A., 2020, “Absolute Generality”, in <em>The\nRoutledge Handbook of Metametaphysics</em>, ed. Ricki Bliss and J. T.\nMiller, London and New York: Routledge, Taylor, and Francis, pp.\n130–142.</li>\n<li>Rodriguez-Pereyra, Gonzalo, 1997, “There might be nothing:\nthe subtraction argument improved”, <em>Analysis</em>, 57(3):\n159–166.</li>\n<li>–––, 2013, “The Subtraction Arguments for\nMetaphysical Nihilism: Compared and Defended”, in <em>The Puzzle\nof Existence</em>, Tyron Goldschmidt (ed.), New York: Routledge,\n197–214.</li>\n<li>Rowe, William, 1975, <em>The Cosmological Argument</em>,\nPrinceton: Princeton University Press.</li>\n<li>Rundle, Bede, 2004, <em>Why There is Something Rather than\nNothing?</em>, Oxford: Oxford University Press.</li>\n<li>Russell, Bertrand, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: George Allen and Unwin.</li>\n<li>–––, 1985, <em>The Philosophy of Logical\nAtomism</em>, La Salle, Illinois: Open Court.</li>\n<li>Sartre, Jean Paul, 1969, <em>Being and Nothingness</em>, trans. H.\nE. Barnes, New York: Washington Square Press.</li>\n<li>Schmitt, Charles, 1967, “Experimental Evidence for and\nAgainst a Void: the Sixteenth-Century Arguments”, <em>Isis</em>,\n58: 352–366.</li>\n<li>Schopenhauer, Arthur, 1819, <em>The World as Will and\nRepresentation</em> (Volume 2), E. F. J. Payne (trans.), Colorado: The\nFalcon Wing Press, 1958.</li>\n<li>Sgaravatti, Daniele &amp; Giuseppe Spolaore, 2018, “Out of\nNothing”, <em>Thought: A Journal of Philosophy</em>, 7(2):\n132–138. doi:10.1002/tht3.274</li>\n<li>Sorensen, Roy, 2008, <em>Seeing Dark Things: The Philosophy of\nShadows</em>, New York: Oxford University Press.</li>\n<li>–––, 2022, <em>Nothing: A Philosophical\nHistory</em>, New York: Oxford University Press.</li>\n<li>Sperry-Taylor, Ashton T., 2019, “Reassessing Equilibrium\nExplanations: When are They Causal Explanations?”,\n<em>Synthese</em> 198(6): 5577–5598.</li>\n<li>Van Fraassen, Bas, 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.</li>\n<li>Van Inwagen, Peter, 1996. “Why Is There Anything at\nAll?”, <em>Proceedings of the Aristotelian Society</em>, 70:\n95–110.</li>\n<li>Vecsey, Zoltán, 2020, “Talking about nothing”,\n<em>Logic and Logical Philosophy</em> 29(2): 311–321.</li>\n<li>Wilczek, Frank, 1980, “The Cosmic Asymmetry Between Matter\nand Antimatter” <em>Scientific American</em>, 243(6):\n82–90.</li>\n<li>Williams, C. J. F., 1984, “The Ontological Disproof of the\nVacuum”, <em>Philosophy</em>, 59: 382–384.</li>\n<li>Wittgenstein, Ludwig, 1921, <em>Tractatus\nLogico-Philosophicus</em>, D. F. Pears and B. F. McGuinness (trans.),\nNew York: Humanities Press, originally published in 1961.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abstract objects",
            "condemnation of 1277",
            "existence",
            "existentialism",
            "holes",
            "Japanese Philosophy: Kyoto School",
            "nonexistent objects",
            "Parmenides",
            "Zeno of Elea: Zeno’s paradoxes"
        ],
        "entry_link": [
            {
                "../abstract-objects/": "abstract objects"
            },
            {
                "../condemnation/": "condemnation of 1277"
            },
            {
                "../existence/": "existence"
            },
            {
                "../existentialism/": "existentialism"
            },
            {
                "../holes/": "holes"
            },
            {
                "../kyoto-school/": "Japanese Philosophy: Kyoto School"
            },
            {
                "../nonexistent-objects/": "nonexistent objects"
            },
            {
                "../parmenides/": "Parmenides"
            },
            {
                "../paradox-zeno/": "Zeno of Elea: Zeno’s paradoxes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=nothingness\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/nothingness/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=nothingness&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/nothingness/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=nothingness": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/nothingness/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=nothingness&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/nothingness/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Albert, David, 2012,\n “<a href=\"http://www.nytimes.com/2012/03/25/books/review/a-universe-from-nothing-by-lawrence-m-krauss.html?_r=0\" target=\"other\">On the Origin of Everything</a>”,\n review of L. Krauss, <em>A Universe from Nothing</em>, in New York\nTimes, March 23.",
            "<a href=\"http://www.philosophypages.com/hy/7b.htm#nothing/\" target=\"other\">Heidegger on Nothingness</a>\n (from Philosophy Pages by Garth Kemerling, a site which “offers\nhelpful information for students of Western philosophical\ntradition.”)",
            "<a href=\"https://www.poetryfoundation.org/poems/53720/upon-nothing\" target=\"other\">John Wilmot’s poem Upon Nothing</a>",
            "<a href=\"https://iep.utm.edu/parmenid/\" target=\"other\">Parmenides of Elea</a>,\n article at <em>Internet Encyclopedia of Philosophy</em>"
        ],
        "listed_links": [
            {
                "http://www.nytimes.com/2012/03/25/books/review/a-universe-from-nothing-by-lawrence-m-krauss.html?_r=0": "On the Origin of Everything"
            },
            {
                "http://www.philosophypages.com/hy/7b.htm#nothing/": "Heidegger on Nothingness"
            },
            {
                "https://www.poetryfoundation.org/poems/53720/upon-nothing": "John Wilmot’s poem Upon Nothing"
            },
            {
                "https://iep.utm.edu/parmenid/": "Parmenides of Elea"
            }
        ]
    }
}