{
    "url": "personalism",
    "title": "Personalism",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Thomas D. Williams\n<tdw2000@gmail.com>\nJan Olof Bengtsson\n<janolof.bengtsson@outlook.com>",
        "author_links": [
            {
                "mailto:tdw2000%40gmail%2ecom": "tdw2000@gmail.com"
            },
            {
                "https://janolofbengtsson.com/publications/": "Jan Olof Bengtsson"
            },
            {
                "mailto:janolof%2ebengtsson%40outlook%2ecom": "janolof.bengtsson@outlook.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nThomas D. Williams\n&lt;<a href=\"mailto:tdw2000%40gmail%2ecom\"><em>tdw2000<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"https://janolofbengtsson.com/publications/\" target=\"other\">Jan Olof Bengtsson</a>\n&lt;<a href=\"mailto:janolof%2ebengtsson%40outlook%2ecom\"><em>janolof<abbr title=\" dot \">.</abbr>bengtsson<abbr title=\" at \">@</abbr>outlook<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Nov 12, 2009",
        "substantive revision Wed Apr 27, 2022"
    ],
    "preamble": "\nAlthough it was only in the first half of the twentieth century\nthat the term ‘personalism’ became known as a designation\nof philosophical schools and systems, personalist thought had\ndeveloped throughout the nineteenth century as a reaction to perceived\ndepersonalizing elements in Enlightenment rationalism, pantheism,\nHegelian absolute idealism, individualism as well as collectivism in\npolitics, and materialist, psychological, and evolutionary\ndeterminism. In its various strains, personalism always underscores\nthe centrality of the person as the primary locus of investigation for\nphilosophical, theological, and humanistic studies. It is an approach\nor system of thought which regards or tends to regard the person as\nthe ultimate explanatory, epistemological, ontological, and\naxiological principle of all reality, although these areas of thought\nare not stressed equally by all personalists and there is tension\nbetween idealist, phenomenological, existentialist, and Thomist\nversions of personalism.\n",
    "toc": [
        {
            "#WhaPer": "1. What is personalism?"
        },
        {
            "#PerHisAnt": "2. Personalism’s historical antecedents"
        },
        {
            "#EurPer": "3. European personalism"
        },
        {
            "#AmePer": "4. American personalism"
        },
        {
            "#EasPer": "5. Eastern personalism"
        },
        {
            "#ChaPerTho": "6. Characteristics of personalist thought"
        },
        {
            "#HumBeiAniNat": "6.1 Human beings, animals, and nature"
        },
        {
            "#DigPer": "6.2 The dignity of the person"
        },
        {
            "#IntSub": "6.3 Interiority and subjectivity"
        },
        {
            "#SelDet": "6.4 Self-determination"
        },
        {
            "#RelCom": "6.5 Relationality and communion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriLit": "Primary Literature"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is personalism?\n\n\nPersonalism exists in many different versions, and this makes it\nsomewhat difficult to define as a philosophical and theological\nmovement. Many philosophical schools have at their core one particular\nthinker or even one central work which serves as a canonical\ntouchstone. Personalism is a more diffused and eclectic movement and\nhas no such common reference point. It is, in point of fact, more\nproper to speak of many\npersonalisms than one personalism. In 1947 Jacques Maritain\ncould write that there are at least “a dozen personalist\ndoctrines, which at times have nothing more in common than the word\n‘person.’” Moreover, because of their emphasis on\nthe subjectivity of the person, some of the more important exponents\nof personalism have not undertaken systematic treatises of their\ntheories.\n\n\nIt is perhaps more proper to speak of personalism as a\n“current” or a broader “worldview”, since it\nrepresents more than one school or one doctrine while at the same time\nthe most important forms of personalism do display some central and\nessential commonalities. Most important of the latter is the general\naffirmation of the centrality of the person for philosophical\nthought. Personalism posits ultimate reality and value in personhood\n– human as well as (at least for most personalists) divine. It\nemphasizes the significance, uniqueness and inviolability of the\nperson, as well as the person’s essentially relational or\nsocial dimension. The title “personalism” can\ntherefore legitimately be applied to any school of thought that\nfocuses on the centrality of persons and their unique status among beings\nin general, and personalists normally acknowledge the indirect\ncontributions of a wide range of thinkers throughout the history of\nphilosophy who did not regard themselves as personalists. Personalists\nbelieve that the person should be the ontological and\nepistemological starting point of philosophical reflection. Many are\nconcerned to investigate the experience, the status, and the dignity\nof the human being as person, and regard this as the starting-point\nfor all subsequent philosophical analysis.\n\n\nPersonalists regard personhood (or “personality”) as the\nfundamental notion, as that which gives meaning to all of reality and\nconstitutes its supreme value. Personhood carries with it an\ninviolable dignity that merits unconditional respect. Personalism has\nfor the most part not been primarily a theoretical philosophy of the\nperson. Although it does defend a unique theoretical understanding of\nthe person, this understanding is in itself such as to support the\nprioritization of practical or moral philosophy, while at the same\ntime the moral experience of the person is such as to decisively\ndetermine the theoretical understanding. For personalists, a person\ncombines subjectivity and objectivity, causal activity and\nreceptivity, unicity and relation, identity and creativity. Stressing\nthe moral nature of the person, or the person as the subject and\nobject of free activity, personalism tends to focus on practical,\nmoral action and ethical questions.\n\n\nSome personalists are idealists, believing that reality and its sense\nis constituted by consciousness, while others espouse philosophical\nrealism and argue that the natural order is independent of human\nconsciousness. For taxonomic convenience, the many strains of\npersonalism can be grouped into two fundamental categories:\npersonalism in a strict sense and personalism in a broader\nsense. Strict personalism places the person at the center of a\nphilosophical system that originates from an “intuition”\nof the person himself, and then goes on to analyse the personal\nreality and the personal experience that are the objects of this\nintuition. The method of the main twentieth-century European version\nof this strict personalism draws extensively from phenomenology and\nexistentialism, departing from traditional metaphysics and\nconstituting a separate philosophical system. In the idealistic\nversion of personalism, it becomes more obvious, however, that the\ndeeper sources of strict personalism are often to be found in the\nearly critical reception of German idealism and in some aspects of\nmoral sense philosophy. The original intuition is really that of\nself-awareness, by which one grasps not least values and essential\nmeanings through unmediated experience. The knowledge produced by\nreflecting on this experience is nothing more than an explicitation of\nthe original intuition, which in turn generates an awareness of a\nframework for moral action. The intuition of the person as the center\nof values and meaning is not exhausted, however, in phenomenological\nor existential analyses. These analyses often point beyond themselves,\nindicating a constitutive transcendence of the person himself,\nirreducible either to its specific manifestations or to the sum-total\nof those manifestations. Despite their differences, both the American\nschool of Bowne and his first followers and the European personalism\nof Emmanuel Mounier represent personalism in this strict sense.\n\n\nPersonalism in the broader sense does not consider the person as the\nobject of an original intuition, nor does it conceive of philosophical\nresearch as beginning with an analysis of immediate personal\nexperience and its context.  Rather, in the scope of a general\nmetaphysics the person manifests his singular value and essential\nrole. Thus the person occupies the central place in philosophical\ndiscourse, but this discourse is not reduced to an explicitation or\ndevelopment of an original intuition of the person.  The person does\nnot justify metaphysics but rather metaphysics justifies the person\nand his various operations. Instead of constituting an autonomous\nmetaphysics, personalism in the broader sense offers an\nanthropological-ontological shift in perspective within an existing\nmetaphysics and draws out the ethical consequences of this\nshift. Perhaps the best known strain of personalism in the broad sense\nis so-called “Thomistic personalism.” Represented by such\nfigures as Jacques Maritain, Yves Simon, Étienne Gilson, Robert\nSpaemann, and Karol Wojtyła, Thomistic personalism draws on\nprinciples of Thomas Aquinas’s philosophical and theological\nanthropology in what it sees as a coherent development of inchoate\nelements of Aquinas’s thought.\n\n\nAs a philosophical school, personalism finds its foundations in\nhuman reason and experience, though historically personalism has\nnearly always been united to Biblical theism. Von Balthasar suggests\nthat “Without the biblical background it [personalism] is\ninconceivable.” Yet while most personalists are theists, belief\nin God is not necessary to all personalist philosophies, and some\nprofess an atheist personalism.\n\n\n Though generally\nconsidered a philosophical school, the personalist approach is often\napplied to other disciplines as well, yielding a plethora of titles\nsuch as theological personalism, economic personalism, ecological\npersonalism and psychological personalism (along with their inversions:\n“personalistic theology,” “personalistic\neconomics,” “personalistic psychology”) and so\nforth.\n2. Personalism’s historical antecedents\n\n\nThe term “personalism” made its world debut in Germany,\nwhere “der Personalismus” was first used by F. D. E.\nSchleiermacher (1768–1834) in his book Über die\nReligion in 1799. Amos Bronson Alcott seems to have been the\nfirst American to use the term, calling it in an 1863 essay “the\ndoctrine that the ultimate reality of the world is a Divine Person who\nsustains the universe by a continuous act of creative will.” The\nterm “American personalism” was coined by Walt Whitman\n(1819–1892) in his essay “Personalism,” which was\npublished in The Galaxy in May 1868. In 1903 Charles\nRenouvier published Le Personnalisme, thereby introducing the\nword into the French as well. The word “personalism” first\nappeared as an encyclopedic entry in Volume IX of Hastings’s\nEncyclopedia of Religion and Ethics in 1915 in an article by\nRalph T. Flewelling.\n\n\nAccording to Albert C. Knudson, personalism is “the ripe fruit\nof more than two millenniums of intellectual toil, the apex of a\npyramid whose base was laid by Plato and Aristotle.”\nCatholic personalists emphasize more specifically\nthe decisive role of medieval thought, and in particular scholasticism,\nfor the development of personalism. Étienne Gilson, for\ninstance, has observed that where Plato locates the center of reality\nin ideas with concrete instantiations of these being merely accidental,\nand Aristotle places emphasis not on numerical individuals but on the\nuniversal specific form, Thomas Aquinas saw the individual person as\nunique among beings because of reason and self-mastery. Though none\ngoes so far as to call Aquinas a personalist, some suggest that he\nfurnished the necessary soil in which personalistic theory could take\nroot. In this regard, Karol Wojtyła wrote that Aquinas\n“provided at least a point of departure for personalism in\ngeneral.”\n\n\nThe term\nperson comes from the Latin persona, whose origins\nare traceable to Greek drama, where the\nπρόσωπον, or mask,\nbecame identified with the role an actor would assume in a given\nproduction. Such usage is carried over today in the word\n“persona,” referring to characters in fictional literature\nor drama, or second identities which people adopt for behavior in given\nsocial contexts. Its introduction into the mainstream of intellectual\nparlance, however, came with theological discourse during the patristic\nperiod, notably the attempts to clarify or define central truths of the\nChristian faith. These discussions focused primarily on two\ndoctrines: the Trinity (three “persons” in one God) and the\nincarnation of the second person of the Trinity (the\n“hypostatic” union of two natures – divine and\nhuman – in one “person”). Confusion marred these\ndiscussions because of ambiguities in the philosophical and theological\nterminology, such that, for example, the thesis – ascribed to Sabellius\n– would be advanced that in God there was one\nύπόστασις and\nthree πρόσωπα, where\nύπόστασις\nconveyed the meaning of “person” and\nπρόσωπα bore the sense of\n“roles” or “modes” of being. In order to\npresent these mysteries with precision, the concept of person and the\nrelationship of person to nature needed clarification. The debates\nculminated in the First Council of Nicaea (325) and the First Council\nof Constantinople (381), and in the drafting and propagation of the\nNicene-Constantinopolitan creed.\n\n\nThough the philosophical concept of person first developed in this theological\ncontext, with reference to the persons of the Trinity, the general\nGreek philosophical concepts involved in these Trinitological origins\nfacilitated its application to human beings as well. Philosophical\npersonalism may or may not appropriate the theological suppositions\nwith which the early usage of the term “person” is\nladen. The classic, basic, and purely philosophical definition which\nis still accepted by personalists, as far as it goes, was given early\non by Boethius (ca. 480–524): “persona est naturae\nrationalis individua substantia.” This definition consists of\ntwo parts. The essential starting point is a subsistent individual: a\nsingular, existing suppositum or\nύπόστασις. Here the\nadjective “individual” distinguishes an existing substance\nfrom common or second substance. The second element of the\ndefinition – naturae rationalis – qualifies the\nnotion of individual substance: the person is an individual possessing\na\nrational nature. It is this rational, spiritual nature that\ngives rise to the different qualities that distinguish the person,\nqualities to which personalists attach decisive importance.\n\n\nThe Trinitological concept of the person was far from the modern\nmeaning that the term assumes in personalism, and Boethius’\ndefinition too indicates only in the barest abstract outline the deep\nand comprehensive signification that personalism ascribes to it. As\naccepted by personalism, it is the result of a long and complex\ncumulative development, resulting in a rich, if somewhat elusive,\nconcept which in some respects wholly inverts the original\nconnotations of exteriority in the early meanings of\n“mask” and “role”: person comes rather to\ndenote the innermost spiritual and most authentic kernel of the unique\nindividual, while retaining a radical openness to the\nexternal. Already in the course of the Middle Ages, further\ndefinitions were provided, and not just by Aquinas. Not least the\nAugustinian example of experienced interiority and reflexivity, the\nidea of form as the principle of individuation, and the late medieval\nand Franciscan emphasis on will and singularity entered into early\nmodern thinking about the person, and combined with the stronger focus\non human personality that was characteristic of Renaissance\nhumanism.\n\n\nAlong these lines, the early modern concepts of subjectivity and\nself-consciousness added new elements to the definition and\nunderstanding of the central concept in personalism, or even\nsubstantially altered it. Immanuel Kant’s epistemic dualism,\nunderscoring the importance of both subject and object in knowledge,\nopened the door both to the idealistic form of personalism and to the\nphenomenology and existentialism that became so important for\ntwentieth-century personalism. Kant also contributed significantly to\nthe personalist understanding of human dignity. Unlike Hobbes, for\nwhom “the worth of a man” is “his price,” and\ndignity is “the publique worth of a man,” Kant regarded\ndignity as “intrinsic worth”. He posited a dichotomy\nbetween price and dignity, whereby “something that has a price\ncan be exchanged for something else of equal value; whereas that which\nexceeds all price and therefore admits of no equivalent, has a\ndignity.” His celebrated practical categorical\nimperative – Act so as to treat humanity, whether in your own\nperson or in that of another, always as an end and never as a means\nonly – was incorporated nearly verbatim into Karol\nWojtyła’s “personalist principle.”\n\n\nPersonalism in the sense of a distinct philosophy or worldview\nfocusing on the full, accumulated import of the concept of the person,\nhowever, emerged only in the context of the broad critical reaction\nagainst what can be called the various impersonalistic\nphilosophies which came to dominate the Enlightenment and Romanticism\nin the form of rationalistic and romantic forms of pantheism and\nidealism, from Spinoza to Hegel.  Key figures in this reaction were\nFriedrich Heinrich Jacobi (1743–1819), the initiator of the\nso-called Pantheismusstreit in the 1780s, and\nF. W. J. Schelling (1775–1854), who in his later work rejected\nthe impersonalist positions of his early idealist systems. But these\nwere only the most important figures in a broad movement that included\nmany other philosophers, primarily the so-called speculative theists,\nas well as theologians, both Catholic and Protestant. The modified\nidealistic, theistic personalism developed in this counter-movement\nbecame decisive, not least via its late German representative, Rudolph\nHermann Lotze (1817–81), not only for the American, idealistic\npersonalism of Bowne, but also for the parallel, British idealistic\npersonalism whose leading representative was Andrew Seth\nPringle-Pattison (1856–1931). Although the continental European\npersonalists of the twentieth century would reject Hegelian idealism and turn\ninstead to phenomenology, existentialism, and Thomism, the outline of\nthe personalistic criticism of impersonal modes of thought was already\nclearly and consistently developed by the thinkers here mentioned,\never since the last decades of the eighteenth century.\n\n\n\nPersonalism thus arose as a reaction to impersonalist modes of thought\nwhich were perceived as dehumanizing. The impersonal dynamic of modern\npantheism and monism in both their rationalistic and Romantic forms\nunderlie many of the modern philosophies that personalism turns\nagainst, idealistic as well as materialistic. The radical idealism of\nG. W. F. Hegel (1770–1831) held that Kant’s noumenal reality is\nnot an unknowable substratum of appearances, but a dynamic process,\nwhich in thought and in reality passes from thesis to antithesis, and\nfinally resolves itself in synthesis. This process is absolute mind,\nthe state, religion, philosophy. Hegel’s idealism saw history as an\nunfolding of absolute spirit through a necessary dialectical process,\nand this framework left little room for the freedom or significance of\nindividual persons. Through the Young Hegelians, this impersonalist\nform of idealism was soon transformed into equally impersonalist forms\nof materialism, culminating in Marxism, which regards the essence of\nman as his true collectivity; impersonalist determinism, in the form\nof Communism, decisively determined twentieth-century political\ntotalitarianism. In other thinkers, idealism tended to merge with\nincreasingly naturalistic forms of nationalism and racialism, giving\nrise to other new political movements in the twentieth century that\nelevated alternative collectivities above the person, such as national\nsocialism. Personalism always resisted the absorption of the\nindividual into the collectivity by asserting the inherent worth of\nthe singular person. The person should never be a mere means to an\nend, subordinated to the will and purposes of another. The state\nexists for persons, and not persons for the state. In this regard,\npersonalism stands as a foil to totalitarianisms that value persons\nonly for their worth to the community, and insists instead on their\ninherent dignity. Thus R. T.  Flewelling could write that “the\nperson is the supreme essence of democracy and hostile to\ntotalitarianisms of every sort.” Personalism’s insistence on\npersonal freedom and responsibility, self-determination, creativity,\nand subjectivity all bear out this deep-seated resistance to\ncollectivism.\n\n\nParallel to the development and transformation of Hegelianism, other\ntheories of human nature were developed in the course of the\nnineteenth century that blurred or cancelled the distinction between\nman and the rest of nature, and downplayed or denied man’s unique\nindividual value, spiritual nature, and free will. These theories too,\ndirectly or indirectly, contributed to twentieth-century\ntotalitarianism. The philosophical positivism of Auguste Comte\n(1798–1857) affirmed as a historical law that every science (and\nthe human race itself) passes through three successive stages, the\ntheological, the metaphysical, and the positive, each superior to the\nlast. Comte insisted so much on the reality and predominance of\nsociety that this became for him the true subject, while the\nindividual was regarded as an abstraction.  Darwinism, in particular,\nuprooted the classical understanding of human beings as essentially\nsuperior to the rest of creation by offering a theory whereby man\nwould be simply the most advanced life form along an unbroken\ncontinuum, and the difference between man and irrational animals would\nmerely be one of degree, not of kind.\n\n\nThe emerging personalist philosophy, however, rejected impersonalism\nnot only in the form of idealistic or materialistic determinism and\ncollectivism, but also in the form of the radical individualism that\nwas equally a product of modern rationalism and romanticism, and\nwhich, through, for instance, certain forms of liberalism and\nanarchism, was also characteristic of the nineteenth century. From the\nbeginning, personalism proclaimed in its own way the communitarian\nvalues of solidarity and inter-relation. In their insistence on\ninviolable dignity, personalists resisted a utilitarianism which would\nmake one person merely “useful” for another. Whereas\nindividualism tends to seek the self above all and often views others as means to\none’s own profit, personalism seeks to make of the self a gift to\nanother.  “Thus,” Emmanuel Mounier later wrote, “if\nthe first condition of individualism is the centralization of the\nindividual in himself, the first condition of personalism is his\ndecentralization, in order to set him in the open perspectives of\npersonal life.” Where individualism hopes to find personal\nrealization in self-interest, personalism asserts the need\nfor relational openness to others, even as a condition for one’s own\nrealization.\n\n\nKarol Wojtyła characterized the two extremes of individualism and\ncollectivism in the following way: “On the one hand, persons may\neasily place their own individual good above the common good of the\ncollectivity, attempting to subordinate the collectivity to themselves\nand use it for their individual good. This is the error of\nindividualism, which gave rise to liberalism in modern history and to\ncapitalism in economics. On the other hand, society, in aiming at the\nalleged good of the whole, may attempt to subordinate persons to\nitself in such a way that the true good of persons is excluded and\nthey themselves fall prey to the collectivity. This is the error of\ntotalitarianism, which in modern times has borne the worst possible\nfruit.”\n\n\nThe existentialism that gave such important impulses to much\ncontinental European personalism in the twentieth century developed in\ncertain respects in the line of the later Shelling’s philosophy, and\ntraces even of Jacobi’s criticism of impersonal pantheism can be found\nin it.  With Schelling, Søren Kierkegaard (1813–1855)\nopposed Hegel’s idealism and underscored the value of the individual\nperson, both for philosophy and for life in general. He accused\nidealism of emptying life of meaning by neglecting the reality of\nhuman existence. Whereas Kierkegaard and some later existentialists\n(Marcel, Sartre, Camus, Blondel) focused on issues central to the\nmeaning of human existence (love, marriage, death, faith, morality,\netc.), other thinkers continued to focus on the more direct\nexploration of the meaning and nature of the person himself, and it\nwas these thinkers that came to be known as, and to call themselves,\npersonalists.\n\n\nThe philosophy of Friedrich W. Nietzsche (1844–1900) gave its\nown, distinct expression to these themes, showing, as many of the\nromantic poets and philosophers had done before him, and despite his\ncriticism of romanticism, that the new individualism was in reality\nclosely interrelated with the general impersonalism of the dominant\nstrain of romanticism: from the exaltation of the individualist ego,\nthe step was never far to its extinction in a larger impersonal whole\nof any of the many available varieties. Modern individualism\nrepresented no real challenge to the intellectual environment in which\nman tended to be seen as a mere phenomenal being, easily assimilated\ninto nature, the impersonal principle of idealism, the unconscious,\nthe cosmic will, or the collectivities of the family, the state, the\nnation, the social class.  Man was a product of external forces, an\ninsignificant piece in a cosmic puzzle, without dignity, freedom,\nresponsibility, or fundamental existential significance. It was this\noverall, many-faceted intellectual climate and development that\nproduced the personalist counter-movement throughout the nineteenth\ncentury, a movement which, by drawing on other, alternative resources\nin the thought of the Enlightenment and Romanticism as well as on the\nclassical, medieval Christian, and early modern legacy, sought to\nrescue the unique position and status of the singular human\nperson.\n\n\nThe personalist Jean Lacroix is justified in declaring personalism to be an\n“anti-ideology,” awoken by social and political situations\nthat are alienating to the human person; in the face of such\nimpersonalist forces, personalism reaffirms the absolute dignity and\ninterrelationality of the human person. Maritain, too, wrote of\npersonalism as “a phenomenon of reaction” against the\n“two opposite errors” of totalitarianism and\nindividualism.  Contrary to Hegelian collectivism and the fierce\nindividualism of Nietzsche’s superman, these thinkers stressed both\nthe inviolable dignity of the individual person and at the same time\nhis social nature and essential relationality.\n3. European personalism\n\n\nIn the twentieth century personalists gathered especially around three\nEuropean centers of higher learning: Paris, Munich, and Lublin. Until\nrecently, the best known and most prolific of these three schools was\nthe Parisian group.  Between the First and Second World Wars the\nFrench personalist movement revolved around a monthly\njournal, Esprit, founded by Emmanuel Mounier\n(1905–1950) and a group of friends in 1932. In the face of\neconomic collapse and political and moral disorientation, these French\npersonalists proposed the human person as the criterion according to\nwhich a solution to the crisis was to be fashioned. The new,\nirreducible key to thought, especially regarding social organization,\nwas to be the human person. In his programmatic essay Refaire la\nRenaissance, which appeared in the first issue\nof Esprit, Mounier proposed the need to disassociate the\nspiritual world from the debased, materialistic bourgeoisie. In\nsubstance much in line with the late eighteenth- and early\nnineteenth-century origins of personalism, Mounier, before the Second\nWorld War, turned sharply against the impersonalistic development of\nindividualistic, parliamentary democracy and the mass culture that had\ncome to shape the countries of Western Europe. Both personalism’s\nnineteenth-century background and this fact about the leading\ntwentieth-century European personalist indicate that for personalism,\na simple, uncritical endorsement of liberal democracy is not a\nsufficient guarantee against totalitarianism, since liberal democracy\ntoo tends to absorb the impersonalist ideas and the deep, historical\nimpersonalist dynamic clearly perceived and analysed by personalistic\nthinkers long before Mounier.\n\n\nPolitical and traditionalist religious reaction was not an alternative\nfor Mounier.  There had to be a real revolution, consisting in the\ncreation of a new humanism, where the bourgeois ideal of\n“having” would yield to Christian “being,” a\nbeing in communion with others. The spiritual revolution envisioned by\nMounier was to be above all the work of committed witnesses to the\ntruth, who through their own interior renewal and living faith would\ngalvanize the masses into a new communal structure. Such a revolution\nentailed a triple commitment: denunciation, meditation, and technical\nplanning. Underlying this program was Mounier’s bold conception of\nChristian experience, an experience of “tragic optimism,”\ncolored both by the drama of Christian existence and by the certainty\nof eschatological victory.  The Christian’s most important virtue is\nthat of the heroic witness, far from the evasiveness or sentimentality\nof other, eviscerated strains of Christianity. Thus Mounier’s idea of\nthe Christian as the watchful athlete engaged in spiritual combat\nprovided a stark response to Nietzsche’s criticism of Christianity as\na religion of the weak. His assertion that there is no true progress\nwithout the dimension of transcendence countered the Marxist search\nfor an earthly paradise through class struggle. His acceptance of the\nimportance of psychology while reemphasizing man’s freedom and\nresponsibility furnished an answer to Freud’s instinct-centered\npsychoanalysis.\n\n\nMounier’s work attracted the attention of important French thinkers\nsuch as Gabriel Marcel, Denis de Rougemont, and Jacques Maritain, who\nthrough their research, lectures, and writings helped develop French\npersonalist thought. Maritain, who worked with Mounier for a number of\nyears, was responsible for bringing French personalism to the United\nStates. After the war, European personalism, led by Mounier himself,\nadapted to and took a more uncritical view of liberal democracy, and\nMaritain played a role in drafting the 1948 United Nations Universal\nDeclaration of Human Rights. Like other Thomistic personalists,\nMaritain criticized the frailty of certain widespread strains of\nScholasticism, and appealed to the important role of intuitive\nexperience in philosophy.\n\n\nThe French philosopher Paul Ricoeur (1913–2005), whose\nphilosophy was profoundly influenced by Husserlian phenomenology,\nwhile never identifying himself as a personalist, shared many of the\nconcerns and interests dear to personalists, and both benefited from\nand contributed to the development of personalistic thought in\nFrance. Gabriel Marcel was one of Ricoeur’s philosophical\nmentors, and Ricoeur was also deeply influenced by his contact with\nEmmanuel Mounier, especially in the postwar years, 1946–1951. He\ncontributed essays to Esprit as well as the journal Le\nChristianisme social. Ricoeur drew on many of the themes most\nprecious to Mounier, such as the nature of human freedom and the\ncentrality of the human person vis-à-vis the state, though his\nown later development of these themes departed considerably from\nMounier’s. He also shared personalism’s rejection of\nmaterialism and of Cartesian dualism, and a rejection of abstractions\nin favor of concrete human reality. Perhaps the single greatest\nelement of Mounier’s personalism adopted by Ricoeur, in fact,\nwas the impermissibility of withdrawal from political and social\nengagement.\n\n\nPersonalism in Germany was closely wedded to another philosophical\nschool, phenomenology, developed by Austrian-born Edmund Husserl\n(1859–1938).  Like existentialism and French personalism,\nphenomenological realism was partly a response to German idealism,\nthough it bore a distinctive focus on epistemological questions. In\nhis Logische Untersuchungen, published in 1900, as well as\nhis later Ideen zu einer reinen Phänomenologie und\nphänomenologischen Philosophie (1913), Husserl laid out his\nphenomenological method, and through it he attracted the first\nstudents of his school. The distinguishing characteristic of\nphenomenology is not doctrinal, but methodological. Seeking to avoid\nthe imposition of preconceived notions or structures on reality,\nphenomenology goes “back to the thing” (zurück\nzum Gegenstand) by bracketing (epoché) all\nphilosophical presuppositions about the world, man, and the rest of\nreality. This direct observation and consultation of reality eschews\nthe problems of deductive reasoning by focusing on the intellectual\nact of intuition, or direct apprehension of reality. The eidetic\nreduction focuses on the essential structures of what appears\n(phenomenon), so that one is dealing neither with empirical\nobservation nor with a description of Platonic forms, but with the\nphenomenon’s meaning. Phenomenologists identified the object of\nintuition as the essences of things, ideal objects, and structures of\nintentionality and consciousness. In so doing, they sought to overcome\nthe Kantian noumenon/phenomenon dichotomy as well as the errors of\npositivism and nominalism.\n\n\nThough in his later life Husserl leaned toward philosophical idealism,\nin his earlier life and in Logische Untersuchungen he embraced\nphilosophical realism. A realist phenomenology stresses\nphenomenology’s contribution to perennial philosophy, and seeks to\nexplore through experience the ultimate structures of being. By going\nback to the thing itself, phenomenology aimed at eluding the errors of\nboth empiricism (reducing reality to the measurable) and idealism\n(rarefying reality into abstraction and subjectivism). Among Husserl’s\nstudents were Max Scheler (1874–1928), Dietrich von Hildebrand\n(1889–1977), Roman Ingarden (1893–1970) and Edith Stein\n(1891–1942), all of whom influenced the development of\npersonalist thought. Husserl’s later turn to Idealism, which came\nabout in the 1920s, precipitated a break with many of his disciples,\nwho came to believe that he had abandoned his original commitment to\nreconnect philosophical reflection and objective reality. They\ntherefore struck out on their own, each creating an original body of\nwork in pursuit of Husserl’s original intention. Stein, for instance,\nlooked to phenomenological method as a complement to Thomism, and von\nHildebrand introduced phenomenology into ethics in a personalistic\nsynthesis.\n\n\nThe third and youngest of the three centers of European personalistic\nthought grew up around the Catholic University of Lublin. After\nstudying with Husserl, Roman Ingarden took phenomenology and interest\nin personalist topics back to his native Poland in the early 1940s,\nand there he met a young priest by the name of Karol Wojtyła,\nwhom he encouraged to read Max Scheler. Wojtyła became interested\nin Scheler’s phenomenology and ended up doing his doctoral\ndissertation on Scheler’s ethics of values, which he presented in\n1953. Having previously received an Aristotelian-Thomistic formation,\nWojtyła drew from his studies of the phenomenological method to\ndevelop a creative and original personalistic synthesis, complementing\nThomistic metaphysics and anthropology with insights from\nphenomenology. He subsequently took a post as professor of ethics at\nthe Theological Faculty of Krakow and Lublin’s Catholic University,\nwhere he founded the Polish personalist school. Wojtyła, who was\nalso influenced by the writings of another of Husserl’s disciples, von\nHildebrand, produced two significant personalist books, Love and\nResponsibility (1960) and The Acting Person (1962), as\nwell as numerous essays, lectures and articles. His later election as\npope contributed strongly to the spread of personalist thought,\nespecially among Catholic thinkers. As Pope he continued to employ\npersonalist arguments in his magisterial teaching, and spurred new\ninterest in personalist theories. John Paul called for\n“theological renewal based on the personalistic nature of\nman” and explicitly invoked the personalist argument in his\nencyclical letters Laborem Exercens (1981) and Ut Unum\nSint (1995) as well as his 1994 Letter to Families.\n\n\nPersonalism has also been represented, to varying degrees, in many\nother European countries.\n4. American personalism\n\n\nAmerican personalism, best known as represented by such figures as\nBorden Parker Bowne (1847–1910), George H. Howison\n(1834–1916), and Edgar Sheffield Brightman (1884–1953),\ntook a different tack from continental European personalism in that\ninstead of a reaction to idealism, it is often actually a form of\nidealism, wherein being is defined as personal consciousness. Howison\npreferred the term “personal idealism.” Contrary to\ntwentieth-century continental European personalism, American\npersonalism, in particular in its early representatives, is a direct\ncontinuation of the development of more or less personalistic\nphilosophy and theology in nineteenth-century Europe and its analysis\nand refutation of various impersonalistic forms of thought. The\nAmerican and the stricter personalist twentieth-century school in\nEurope agreed in taking the person as their point of departure for\nunderstanding the world and in referring all moral truth to the\nabsolute value of the person, but while the latter derived these\ninsights primarily from existentialism, phenomenology, and Thomism,\nthe American school, while in some respects adding to them and\ndeveloping them further, basically took them over from the European\n“speculative theists”.\n\n\nBoston University was long considered the hub of American personalism,\nunder the auspices of philosophy professor Borden Parker Bowne.  Bowne\nwas a Methodist minister who had studied under Rudolf Hermann Lotze in\nGermany. Lotze, a student of the speculative theist Christian Hermann\nWeisse (1801–66) who assimilated much of the later\nSchelling’s criticism of Hegel, sought, like the speculative\ntheists, to modify Hegelian idealism by maintaining that the real is\nalways concrete and individual, transforming Hegel’s absolute\nidealism into a personal idealism. Adding elements also from recent\ntrends in psychology, Bowne developed a distinct and explicitly\npersonalist position, which assumed the character of a philosophical\nschool. His late book Personalism, published in 1908, is a\npopular summary of his philosophy which introduced the term\n‘personalism’ into American philosophical and theological\ndiscourse.\n\n\nBowne gathered a group of talented disciples who carried on his work\nin a second generation. The most important among these were Edgar\nSheffield Brightman, Albert C. Knudson (1873–1953), Francis\nJ. McConnell (1871–1953), George Albert Coe (1861–1951),\nand Ralph T. Flewelling (1871–1960). While Howison had established\nthe personalist tradition at the University of California, Berkeley,\nFlewelling took personalism to the University of Southern California,\nwhich became the second important twentieth-century center of\npersonalist thought in the United States.  Flewelling also\nfounded The Personalist, the journal that would serve as the\nforum for American personalism. In 1915, he published Personalism\nand the Problems of Philosophy: An Appreciation of the Work of Borden\nParker Bowne. At Boston University, Brightman continued the\nstudies in personalism, in time holding the Borden Parker Bowne chair\nof philosophy, while Knudson, having first taught classes in the Old\nTestament, moved into personalist theology. Meanwhile Walter George\nMuelder (1907–), professor of social ethics and Christian theology at\nBoston University and the University of Southern California, helped\nbridge the gap between the Bostonian and Californian schools, calling\nhis doctrine “Communitarian Personalism.”\n\nThe Boston personalist school has continued to influence American\nculture, sometimes in unexpected ways. A third generation of American\npersonalists, represented by such figures as Peter A. Bertocci\n(1910–1989) and W. Gordon Allport of Harvard, a student of William\nStern, further developed the psychological dimension of\npersonalism. Martin Luther King studied under the personalists at\nBoston University, and credited the experience with shaping his\nworldview: “I studied philosophy and theology at Boston\nUniversity under Edgar S. Brightman and L. Harold DeWolf…It was\nmainly under these teachers that I studied Personalistic\nphilosophy – the theory that the clue to the meaning of ultimate\nreality is found in personality. This personal idealism remains today\nmy basic philosophical position. Personalism’s insistence that only\npersonality – finite and infinite – is ultimately real\nstrengthened me in two convictions: it gave me metaphysical and\nphilosophical grounding for the idea of a personal God, and it gave me\na metaphysical basis for the dignity and worth of all human\npersonality.”\n\nIt is important to note, however, that American personalism cannot be\nreduced to the Boston University school. It flourished also at Harvard\nUniversity. Not only is this where Howison came from, but the work of\nleading Harvard philosophers such as William James (1842–1910),\nJosiah Royce (1855–1916), William Ernest Hocking\n(1873–1966), and Charles Hartshorne (1897–2000) displays\nstrong personalist elements. All of them, with the sole exception of\nRoyce, even called themselves personalists. \n5. Eastern personalism\n\n\nIn some respects close parallels to or equivalents of Western\npersonalism are present in Islamic, Buddhist, Vedantic, and Chinese\nthought, although comparative work in this field is confronted with\noften formidable problems of translation and interpretation.\n\n\nWith regard to Islam, it should first of all be pointed out that\nclassic Islamic philosophy, with its roots in classical Greek\nphilosophy, is not Eastern in the same sense as Buddhist, Vedantic,\nChinese, and Japanese thought. It shares roots with Augustinianism and\nThomism, and thus with some of the traditions that have been central\nto the development of personalism in the West. On the other hand, it\nhas been observed that there is no conceptual equivalent of the\nWestern philosophical concept of “person” in Arabic and in\nclassic Islamic philosophy, something which would seem to confirm the\nimportance of the specifically Christian, to a considerable extent\nTrinitological, terminological and conceptual origins of the term. But\nas there are other sources of personalism than the Trinitological\nthought that was decisive for the early formation of the concept\n(when, it should also be remembered, it was not yet fully\npersonalistic in the modern sense), and as these sources have also\nproduced Jewish versions of personalism, the historical absence of a\nconceptual equivalent in Arabic has not precluded the development of\nIslamic personalism. Themes with regard to the self and the nature of\nGod which are very similar to those of Western personalists are found\nin a modern Muslim thinker like Muhammad Iqbal\n(1877–1938). Mohammed Aziz Lahbabi (1922–1993) explicitly\nsought to develop a Muslim version of personalism, and was influenced\nnot least by Mounier.\n\n\nNo precise conceptual counterpart of “person” is found in\nthe more properly Eastern traditions of thought either, traditions\nwhich do not share the Greek philosophical roots. When we speak of\npersonalism in the case of these traditions, it is in the sense of\nthemes and positions, elaborated in terms of other concepts, closer to\nsuch Western ones as “self” and “individual”,\nwhich are part of Western personalism and enter into the definition of\nthe modern concept of person.\n\n\nThe term ‘personalism’ has, for instance, been applied to\nthe early Buddhist school called puggalavada, which takes\npositions with regard to the identity and continuity of the individual\nself which differ from what has traditionally been considered the\northodox ones of Theravada Buddhism. Other versions of these positions\nare found later in some of the currents of Mahayana thought.\n\n\nMore unambiguous parallels are found, however, in\nVedanta. The vishishtadvaita (qualified non-dualism) school\nturned against advaita’s radical non-dualism, and insisted\nnot only on what in English works by representatives of this school\nand later schools which are similarly critical of advaita, is\noften explicitly termed the personal concept of brahman or\nthe absolute, but also on a personal understanding of the individual\nbeings that are conceived as fragmentary selves (jivatmas)\nthat are “parts” – at the same time one with and\ndistinct transformations – of\nbrahman. As the different classical darshanas of\nIndian thought are not wholly isolated and receive influences\nfrom each other, elements of Samkhya thought are also taken up in\npersonalistic Vedanta, as are still further elements of Yoga, and of\nthe traditional Hindu scriptural legacy. It is the clarity, the\ntraditional primordiality, and the fundamental nature of the teaching\nof the permanent self, the atman, in Vedanta, and not least in\nthe schools critical of advaita, which make this personalism\nmore unambiguous than puggalavada’s in Buddhism.\n\n\nA striking feature of the debates within Vedanta between the\nnon-dualist, impersonalist schools and the theistic, personalist ones\nis the partial similarities with and parallels to the opposition\nbetween nineteenth-century representatives absolute idealism and\npersonalistic idealism in the West, despite the distance between them\nin time and space, the mutual independence, and the different\nconceptual contexts. But while there is a long-standing scholarly\ntradition of comparative work on advaita Vedanta and absolute\nidealism (not least in F. H. Bradley’s version), only very\nlittle such work has as yet been done on the vishishtadvaita\nand similar personalist Vedantic schools and the early, idealistic\npersonalists in the West.\n\n\nWhat most clearly distinguishes Vedantic personalism from Western\npersonalism is that the former builds on the fundamental teaching\nof all Vedanta that the true self exists beyond the\nlimitations of the transient body and the mind, and beyond the\ntendency – called in Sanskrit the ahamkara, literally,\nthe “I-maker” – to identify with these, whereas\nWestern personalism is often characteristically defined in terms which\nfrom the perspective of Vedanta must be seen as pertaining to the\nmental level, or sometimes, in particular in the twentieth century, to\nthe physical body.\n\n\nThis does not mean, however, that according to personalistic Vedanta\nthe body should be ignored or devalued. It is from its perspective\nprimarily the erroneous identification with the mind that is harmful\nto the body, as it indeed is to the proper use of the mind itself. The\nactualization of our true and higher nature as consciousness, as\nthe sat-cit-ananda (being/eternity, knowledge, and bliss)\nthat are the nature of the atman-brahman, brings light to\nboth the body and the mind, including all the faculties so closely\nanalysed by Western personalists, like will, imagination, and\nreason. Thus it at least indirectly supports, to the extent it is\nneeded, the moral character-formation on the humanistic level which is\nemphasized by Western personalism.\n\n\nMost traditional Chinese and Japanese thought shares with personalism\nan emphasis on the need for concrete, practical transformation of\ncharacter as a prerequisite for insight. In the Chinese and Japanese\nversions of Buddhism, the Indian tradition of devising specific\npractices and exercises for this purpose was continued, but gradually\ndisconnected from the parallel and very strong theoretical and\nmetaphysical legacy of India. This development can be said to\nculminate in Zen. But the emphasis on the practical is found also in\nTaoism, which contributed to the development of Zen. At the same time\nall of these schools share an understanding of the ultimate or true\nreality as rather impersonal than personal, which makes them further\nremoved from personalism than Vedanta.\n\n\nConfucianism shares with the other Chinese and Japanese traditions the\nemphasis on the practical. Contrary to them, however, it is focused\nmuch more exclusively on the “humanistic” level, on moral\ncharacter-formation, and the requirements of the social order. While\nits humanistic orientation is in line with personalism, Confucianism\nis, however, more concerned with the practical attainment of the\ngeneral ideals of true humanity and gentlemanliness as understood in\ntraditional China, than with the personal individuality and uniqueness\nwhich Western personalists stress as related to, and often indeed as\ninseparable from, a true understanding and affirmation of universal\nvalues. Neo-Confucianism, as developed by Chu Hsi (1130–1200),\nintroduced strong metaphysical elements, but the understanding of the\nmetaphysical principles or laws, li, was still a generalist\none. Other Neo-Confucians differed to some extent in this respect,\nand, as Confucianism is a living tradition in today’s China, new\nthinkers keep developing versions of it which are closer to\npersonalism. This, and the importance of humanist character-formation,\nspeaks in favour of the designation of Confucianism in general as a\npersonalistic philosophy. But there are also some considerations that\nspeak against it, both general ones regarding some aspects of\nhistorical Chinese society, and, in view of Chu Hsi’s version of\nNeo-Confucianism, metaphysical ones.\n6. Characteristics of personalist thought\n\n\nThough personalism comprises many different forms and emphases,\ncertain distinctive characteristics can be discerned that generally\nhold for personalism as such. These include an insistence on the\nradical difference between persons and non-persons and on the\nirreducibility of the person to impersonal spiritual or material\nfactors, an affirmation of the dignity of persons, a concern for the\nperson’s subjectivity and self-determination, and particular emphasis\non the intersubjective (relational) nature of the person.\n6.1 Human beings, animals, and nature\n\n\nPersonalists have generally insisted on the falsity of Darwin’s claim\nthat man’s difference from other terrestrial beings is one of degree\nand not of kind. Human exceptionalism has defined most personalist\nthought. Obviously, such exceptionalism is not exclusive to\npersonalism, but represents, rather, a standard assumption of\nclassical philosophical anthropology. In 1625, for instance, Grotius\nwrote: “Man is, to be sure, an animal, but an animal of a\nsuperior kind, much farther removed from all other animals than the\ndifferent kinds of animals are from one another” (De iure\nbelli ac pacis, Prolegomena, 11).\n\n\nAccording to a typical personalist conception, the fundamental\nclassification of all beings is the distinction between persons and\nnon-persons. For many personalists, what makes man\n“unlike” other animals is different from what makes a\nbaboon different from a giraffe, or even from what makes a baboon\ndifferent from a rock. Thus, in the words of Jacques Maritain:\n“Whenever we say that man is a person, we mean that he is more\nthan a mere parcel of matter, more than an individual element in\nnature, such as is an atom, a blade of grass, a fly or an\nelephant…Man is an animal and an individual, but unlike other\nanimals or individuals.” Or as William Stern wrote, in his\nintroduction to Person und Sache (vol. 2): “Despite any\nsimilarities by which persons are identified as members of humankind,\na particular race or gender, etc., despite any broad or narrow\nregularities which are involved in any personal events, a primal\nuniqueness always remains, through which every person is a world of\nits own with regard to other persons.”\n\n\nHere personalists react not only to the main forms of idealism, the\nmaterialism, and the determinism of the nineteenth century, but even\nto the objectivism of Aristotle. Following his methodology for\ndefining a species in terms of its proximate genus and specific\ndifference, Aristotle had defined man as a rational animal (ho\nanthropos zoon noetikon) (Aristotle, Hist. Anim. I, 1:\n488a7; Nichomachean Ethics I, 5: 1097b11; VIII, 12: 1162a16;\nIX, 9: 1169b18; Politics, I, 2: 1253a3). Personalists, while\naccepting this definition, as far as it goes, see such a construction\nas an unacceptable reduction of the human person to the objective\nworld. This objective, cosmological view of man as an animal with the\ndistinguishing feature of reason – by which man is primarily an\nobject alongside other objects in the world to which he physically\nbelongs – would be only partly valid, and insufficient. In an\neffort to interpret the subjectivity that is proper to the person,\npersonalism expresses a belief in both the non-material dimension and\nthe primordial uniqueness of the human being, and thus in the basic\nirreducibility of the human being to the natural world.\n\n\nMany personalists see human beings as dealing with all other realities\nas objects (something related intentionally to a subject), but affirm\na substantive difference between the human person and all other\nobjects.  The person alone is “somebody” rather than\nmerely “something”, and this sets him apart from every\nother entity in the visible world. No precise and general position\nspecific to personalists with regard to the nature of animals can be\ndiscerned.  But the sharp distinction between “somebody”\nand “something,” in particular as applied to such other\nsentient beings, reflects both the influence on personalism of the\nJudaeo-Christian tradition and at least some of the general impact or\nspirit of distinctly modern, Cartesian rationalism, which latter is of\ncourse not unaffected by inherited Christian dualisms. Only the human\nbeing is typically conceived by personalism as simultaneously object\nand subject, while at the same time this is held to be true for all\npersons, irrespective of age, intelligence, qualities, etc. For\npersonalists, personal subjectivity assures that the human being’s\nproper essence cannot be reduced to and exhaustively explained by the\nproximate genus and specific difference. Subjectivity becomes, then, a\nkind of synonym for the irreducible in the human being.\n\n\nBut the broader, realist personalism does posit, in the classical and\nscholastic tradition, the essential difference between man and all\nother objects on man’s ability to reason (and its corollary of\nlanguage), which differentiates a person from the whole world of\nobjective entities. Since it is precisely his intellectual and\nspiritual nature that makes subjectivity possible, one can say that in\nthe subjectivity of the human person is also something objective. Yet\nthese personalists insist on the clear separation between non-personal\nbeings and this subjectivity of the person which is derivative of his\nrational nature in a broader or higher sense.  Regardless of how, more\nprecisely, animals are to be understood, the person differs from even\nthe most advanced among them by a specific kind of inner self, an\ninner life, which, ideally, revolves around his pursuit of truth and\ngoodness, and generates person-specific theoretical and moral\nquestions and concerns.\n\n\nOther strains of personalism, such as that represented by the\ndialogical philosophy of Martin Buber, pay less attention to the\ndifference between persons and non-persons and underscore instead the\nway one relates to all of reality. Buber separates the way of dealing\nwith other realities into two, which he terms “I-Thou” and\n“I-It” relationships, the first reflecting a fundamental\nopenness to the reality of the other and the latter reflecting an\nobjectivization and subordination of the other to oneself. According to\nBuber, we engage others either as an It, forming an\nI-It primary word, or as a Thou, forming the\nI-Thou primary word. Yet whereas some personalists would\nassert that such an I-Thou relationship is the only\nappropriate way of dealing with persons, and the I-It\nrelationship the only appropriate way of dealing with things,\nBuber presents the I-Thou relationship as the ideal for the\nhuman person’s dealing with all reality, personal and\nnon-personal alike. And though this I-Thou relation will\ntake on different characteristics according to the sphere in which the\nrelation arises (nature, men, spiritual beings), for Buber the\nfundamental difference lies within the human person himself and in the\nattitude with which he engages reality.\n\n\nSome personalists have come to take a critical view of the starkly\nformulated human exceptionalism, and to go further than Buber in not\njust reconsidering the attitude of the human being, but also the rigid\ndualism involved in the view of everything that is not human (and\ndivine) persons as just soulless, impersonal “objects”. The\nCzech philosopher Erazim Kohák is an example of an in important\nrespects personalist thinker who has tried to rethink both our attitude\nto and our understanding of nature in this respect. The various effort\nto overcome the impersonal objectification of nature and other\nlife-forms, and to conceive of a more thoroughgoingly personal\nuniverse, partly resemble the positions of some of the early idealistic\npersonalists in the nineteenth century. Just like these personalists\nhad sometimes incorporated the accumulated and interrelated insights of\nself-consciousness, subjectivity, interiority,\nindividuality/singularity, will, imagination, and historicity in a way\nwhich the still in some respects often somewhat one-sidedly generalist\nThomistic currents of personalism had not, they also came closer to a\nview of nature that rectifies the overly rigid dualisms of a created\nworld at such distance from its creator as to be almost independent,\nand man as almost equally sharply separated from the rest of creation.\nThe human form of life is clearly exceptional in that it allows a\nmuch higher degree of development of personality in every respect, but\nto regard as a corollary of this insight the position that plants and\neven animals are mere impersonal objects, without consciousness and\ntheir own kind of subjectivity, seems to be regarded as increasingly\nproblematic among personalists.\n\n\nA not unimportant part of personalism’s human\nexceptionalism reflects these cleavages of a world in which the\npresence of the divine is no longer sensed and perceived in nature. The\nmodern desacralized world, as articulated\nby Cartesianism but prepared by Ockham and even in some respects by\nAquinas, is also in reality in important respects an impersonalized\nworld. While guarding against the new impersonalism and moral ambiguity\nof the romantic pantheists, the early personalists of the nineteenth\ncentury at least perceived clearly the problems with the stark dualisms\nof much Christian theology as well as of modern rationalism, the\nEnlightenment, and scientism.\n6.2 The dignity of the person\n\n\nIn stressing the uniqueness of persons vis-à-vis all other\nentities, personalists influenced by Thomism designate the essential\ndividing line of reality as that which separates personal and\nnon-personal being. Dealings with persons, therefore, require a\ndifferent ethical paradigm from that used to describe dealings with\nnon-personal realities. The “rules” of dealing with\nnon-personal reality do not hold when dealing with persons, and\nvice-versa. This radical dichotomy between persons and non-persons is\nessentially ontological, or transcendental-constitutive, but produces immediate consequences on the\nethical level.\n\n\nAt the center of this personalism stands an affirmation of the dignity\nof the person, the quality, insisted on already by medieval thinkers,\nwhich constitutes the unique excellence of personhood and which gives\nrise to specific moral requirements. Dignity refers to the inherent\nvalue of the person, as a “someone” and not merely\n“something,” and this confers an absoluteness not found in\nother beings. Here classical-realist personalists reject the Hobbesian\nnotion of dignity as the price set on an individual by the\ncommonwealth, and ally themselves rather with Kant in his assertion\nthat dignity is inherent and sets itself beyond all price. The\nlanguage of dignity rules out the possibility of involving persons in\na trade-off, as if their worth were a function of their utility. Every\nperson without exception is of inestimable worth, and no one is\ndispensable or interchangeable. The person can never be lost or\nassimilated fully into the collectivity, because his interrelatedness\nwith other persons is defined by his possession of a unique,\nirreplaceable value. The agreement with Kant in this regard can be\nsaid to constitute a bridge between personalism in the broader sense\nand personalism in the narrow sense.\n\n\nAttributing a unique dignity or worth to the human person also throws\nlight on the cardinal virtue of justice. Rendering “to each his\ndue” hinges on one’s understanding of what each deserves, and\nthis cannot be correctly ascertained without taking into account the\ndignity and worth that are at the same time general qualities of all\npersons, and inseparable from the singularity of each of\nthem. Personalists in the broader sense therefore lay special stress\non what persons deserve by the very fact of their personhood, and on\nthe difference between acting toward a person and acting toward any\nother reality. When the person is the object of one’s action, a whole\nethical structure enters into play that is absent when the object of\none’s action is a thing.  How persons should be treated forms an\nindependent ethical category, separate in essence and not only in\ndegree from how non-persons (things) are to be treated. Whereas\ntraditional ethical systems stress the internal mechanisms of the\nmoral agent (conscience, obligation, sin, virtue, etc.) and the effect\nthat free actions have on moral character, personalists add to this a\nparticular concern for the transcendent character of human action and\nthe dignity of the one being acted upon. The person’s absolute\ncharacter provides for the possibility of absolute moral norms when\ndealing with persons.\n\n\nFor personalists, human dignity as such does not depend on variables\nsuch as native intelligence, athletic ability or social prowess. Nor\ncan it result merely from good conduct or moral merit. It must rather\nbe rooted in human nature itself, so that on the deepest level,\ndespite the variations of moral conduct and the resultant differences\nin moral character, all members of the species share this dignity. The\ndifference between being something and someone has been seen as so\nradical that it does not admit of degrees. Most personalists have\ndenied that personhood is something that can be gradually attained. It\nis like a binary function (1 or 0) or a toggle switch (on or off),\nthat admits no middle ground.\n\n\nBut as we have seen, these positions can be related to a not wholly\nunproblematic view of non-human nature. Personalists in the narrow\nsense accept, as far as it goes, the view of the dignity of man as\nfound in Kant’s ethics or practical philosophy, but modify and add to\nit not least from the perspective of a more thoroughgoingly\npersonalist understanding of the importance of individual\nuniqueness. And since they do not merely emphasize the importance of\nthe person within the framework of a pre-existing metaphysics and a\nphilosophical and theological anthropology, there is available to them\na theoretical space for conceiving of the non-human world of\n“somethings” in a less objectifying and exploitative\nmanner. The early, idealistic personalists were much more inclined to\nsee external nature too as ultimately expressive of personal reality,\nand to account for its impersonal appearance in terms of the\nlimitations of finite perception.\n6.3 Interiority and subjectivity\n\n\nPersonalists assert that only persons are truly\n“subjects.” This is not to say that in the syntactic sense\nother entities do not “act” or “produce” or\n“cause,” but properly speaking they do not possess\nsubjectivity. In the modern sense, subjectivity depends primarily on\nthe unity of self-consciousness, and on interiority, freedom, and\npersonal autonomy. Though non-personal beings may “act” in\nthe syntactic sense, they are not truly subjects of action since the\ncause of their action is extrinsic to them. Despite the difference\nwith regard to the ultimate nature of the “non-personal”\nbetween some personalists in the narrow sense and personalists in the\nbroader sense, there is in this area a considerable overlap between\nthe two forms of personalism. For theistic personalists, personal subjectivity embraces the moral\nand religious dimensions, which are part and parcel of the person’s\nnature as a conscious, intelligent, free, willing subject in relation\nwith God and others. As free, thinking subjects, persons also exercise\ncreativity through their thought, imagination, and action, a\ncreativity which affects both the surrounding world and the person\nhimself. Furthermore, personalists have observed that the lived\nexperience of the human person, as a conscious and self-conscious\nbeing, discloses not only actions but also\ninner happenings that depend upon the self. These\nexperiences, lived in a conscious way, go into the makeup and\nuniqueness of the person as well. As regards the ethical question, not\nonly are persons free and responsible moral subjects, but their\nsubjectivity also conditions others’ ethical responsibility toward\nthem.\n\n\nWhat we perceive as “things” can be examined and known\nfrom the outside, as what is regarded as “objects”. In a\nsense, they stand in front of us, they present themselves to us, but\nalways as outside of us. They can be described, qualified, and\nclassified. Classical-realist personalists accept the legitimacy, even\nnecessity, of knowing man too in this way. From this objective\nviewpoint it is possible to discern some of the superiority of the\nhuman being to the rest of reality. Yet in the human person, a\nthoroughly unique dimension presents itself, a dimension not found in\nthe rest of reality. Human persons experience themselves first of all\nnot as objects but as subjects, not from the outside but from the\ninside, and thus they are present to themselves in a way that no other\nreality can be present to them. But here the influence and value of\nthe phenomenological method, as well as of aspects of the earlier\nidealistic tradition, often makes itself especially felt in\npersonalism and adds to the classical-realist analysis. The essence of\nthe person is explored as an intuition from the inside, rather than as\na deduction from a system of thought or through empirical observation\nin the ordinary sense. The human being must be treated as a subject,\nmust be understood in terms of the modern view of specifically human\nsubjectivity as determined by consciousness.  But this contribution is\nnot conceived by personalists as simply replacing in every respect\nearlier, more objectivist notions of man, but quite as much as\ncomplementing them.\n\n\nThis conscious self-presence is the interiority of the human person,\nand it is so central to the meaning of the concept of person that one\ncan say that personality signifies interiority to self. Because of the\nperson’s subjectivity, he is not only acted upon and moved by external\nforces, but also acts from within, from the core of his own\nsubjectivity. Since he is the author of his actions, he possesses an\nidentity of his own making, which cannot be reduced to objective\nanalysis and thus resists definition. This resistance to definition,\nthis irreducibility, do not mean that the person’s subjectivity and\nlived experience are unknowable, but rather that we must come to know\nthem differently, by a method that merely reveals and discloses their\nessence. In lived experience of self-possession and self-governance,\none experiences that one is a person and a subject, and through\nsympathy and empathy one experiences the personhood of\nothers. To apply the early terminology with some added modern\nmeanings, the person comprises both an objective subsistence\n(ύπόστασις) and a\nsubjective subsistence\n(πρόσωπον).\n\n\nA conclusion of personalism is that the experience of the human being\ncannot be derived by way of cosmological reduction. We must pause at\nthe irreducible, at that which is unique and unrepeatable in each\nhuman being, that by virtue of which he or she is not just a particular\nhuman being – an individual of a certain species – but a\npersonal subject. This is the only way to come to a true understanding\nof the human being.  Obviously the framework of the irreducible is not\nexhaustive of the human condition, and such an understanding must be\nsupplemented by a cosmological perspective. Nevertheless, personalists\nwould say it is impossible to come to a true understanding of the\nperson while neglecting his subjectivity.\n\n\nThe focus on the subjectivity of persons explains many personalists’\ninsistence on the difference between the concept of\n“person” and that of “individual.” Gilson\nwrote that “every human person is first an individual, but he is\nmuch more than an individual, since one only speaks of a person, as of\na personage, when the individual substance under consideration\npossesses in his own right a certain dignity.” The major\ndistinction is that an individual represents a single unit in\na homogenous set, interchangeable with any other member of the set,\nwhereas a person is characterized by his uniqueness and\nirreplaceability.\n\n\nVon Balthasar, for example, wrote: “Few words have as many\nlayers of meaning as\nperson. On the surface it means just any human being, any\ncountable individual. Its deeper senses, however, point to the\nindividual’s uniqueness which cannot be interchanged and\ntherefore cannot be counted.” In this deeper sense persons\ncannot, properly speaking, be counted, because a single person is not\nmerely one in a series within which each member is identical to the\nrest for all practical purposes and thus exchangeable for any other.\nOne can count apples, because one apple is as good as another (i.e.,\nwhat matters is not that it is this apple, but simply that it\nis an apple), but one cannot count persons in this\nway. One could count human beings, as individuals of the same species,\nbut the word person emphasizes the uniqueness of each member\nof the human species, his incommensurability and incommunicability. Von\nBalthasar goes on to say: “If one distinguishes between\nindividual and person (and we should for the sake of\nclarity), then a special dignity is ascribed to the person, which the\nindividual as such does not possess…We will speak of a\n‘person’…when considering the uniqueness, the\nincomparability and therefore irreplaceability of the\nindividual.”\n\n\nAs valid as these philosophical distinctions are, whether one speaks\nof a human individual or a human person, these are simply two names\napplied to the same reality. Personalists are quick to assert that\npersonality is not superadded to humanity, but is inherent to the\nessence of every human being, since it is rooted in human nature\nitself. “Human person” and “human individual,”\nwhile underscoring different dimensions of a human being, are\nsynonymous in everyday language and have the same referent. Some\nthinkers have proposed a real distinction between a human person and a\nhuman individual. From their perspective, personhood would be an\nacquired “extra” for a human being, a status reached not\nsimply by being an individual of the species, but by entering into\ncertain relationships with other persons in a conscious, intentional\nway. In other words, while all human persons would be human\nindividuals, the reverse would not be true.\n\n\nPersonalists typically reject this, and insist that each living human\nbeing normally possesses – actually and not merely potentially,\nalthough the importance of further development or actualization is\nstrongly stressed – the definitional and constitutive\nconsciousness, intentionality, will etc., the radical capacity to\nreason, laugh, love, and choose. These are not just some abstractly\nconceivable common characteristics of a species, but aspects of the\nunique, individual, organic functioning of every human being. In this\nway, personalists see personhood as subsisting even while its\noperations come and go with many changing factors such as immaturity,\ninjury, sleep, and senility.\n6.4 Self-determination\n\n\nMan’s intellectual nature, which according to Boethius is the\ndistinguishing characteristic of personhood, is also the font of\nfreedom, subjectivity, immortality, and man’s cognitive and moral\nlife. It is as a rational being, and therefore as a person, that the\nindividual can distinguish true from false and good from\nevil. Therefore science and morality are proper to persons. Because\nthe person possesses a spiritual nature, the source of its action is\ninternal to itself and not extrinsic.\n\n\nPersonalists insist that in his contact with the world the human\nperson acts not in a purely mechanical or deterministic way, but from\nthe inner self, as a subjective “I,” with the power of\nself-determination.  Possession of free will means that the human\nperson is his own master (sui iuris). Self-mastery and\nfreedom characterize personal beings; a free being is a person. The\nperson’s power of self-determination explains the non-transferable\nnature of personality.  His incommunicability does not only refer to\nthe person’s uniqueness and unrepeatability. What is incommunicable or\ninalienable in a person is intrinsic to that person’s inner self and\nto the power of self-determination. No one can substitute his act of\nwill for another’s.\n\n\nIn what does self-determination consist? A classic distinction\nseparates “human acts” (actus humani) from\nso-called “acts of man” (actus hominis). An act\nof man describes something that “happens” in the subject\nwhereas a properly human act ascribes free and responsible authorship\nof the act to the subject. The element of interior causality is\nreferred to as self-determination. This self-determination involves a\nsense of efficacy on the part of the acting subject, who recognizes\nthat “I act” means that “I am the efficient\ncause” of my action. One’s sense of efficacy as an acting person\nin relation to the action performed is in turn closely connected to\none’s sense of responsibility for the activity. This experience on the\nphenomenological level draws attention to the will as the person’s\npower of self-determination, while at the same time making clear that\nself-determination is a property of the person himself, and not just\nof the will. It is the freedom of the person as such, through his\nwill.\n\n\nYet self-determination does not only describe the causality of the\naction, but also of the one acting. In acting, the person not only\ndirects himself toward a value, he determines himself as\nwell. He is not only the efficient cause of his actions, but is also\nin some sense the creator of himself, especially his moral self. By\nchoosing to carry out good or bad actions, man makes himself a morally\ngood or bad human being. Action is organically linked to becoming. By\nfree moral action the personal subject becomes good or bad as a human\nbeing. When a person acts, he acts intentionally toward an object, a\nvalue which attracts the will to itself. At the same time,\nself-determination points inward toward the subject himself. As a\nresult of this, the human being is capable of existing and acting\n“for itself,” or is capable of a\ncertain autoteleology. This means that the person determines\nnot only his own ends but also becomes an end for himself. The person\nis not only responsible for his actions, he is also responsible for\nhimself, for his moral character and identity. Freedom means that one\nis responsible for one’s choices but also for one’s self.\n\n\nFreedom and self-determination also bear a close relation to another\ncharacteristic of the person’s spiritual nature: creativity. Freedom\nas a property of the person allows the person to create through\nthought and action. The will is not simply the executor of the\nintellect’s reasoned conclusions. The intellect presents a variety of\ngoods to be realized, none of which imposes itself in such a way as to\nbe necessarily desired or chosen above the others. The person himself\ndecides spontaneously and freely, and thus determines his own moral\nvalue and identity. “This particular good I am choosing has\nvalue for me according to the ‘me’ that I freely desire\nand choose to be.”\n6.5 Relationality and communion\n\n\nPersonalists stress the person’s nature as a social being. According\nto personalists, the person never exists in isolation, and moreover\npersons find their human perfection only in communion with other\npersons. Interpersonal relations are never superfluous\nor optional to the person, but are indicated by his nature and an essential component of his fulfillment.\n\n\nRelation is proper only to the person. Personalism has endeavored to\nhighlight this aspect of personhood and bring it to the fore. It is\ncentral to personalism’s reaction against and endeavor to overcome the\npolarization of individualism on the one hand and collectivism on the\nother. Personalists consider human beings as a “beings for\nothers” or “beings with\nothers.” Relationship is not an optional accessory for the human\nperson, but is essential to his personhood. He is a\nbeing-for-relation.\n\n\nPersonalists recognize that as much as he may strive for independence,\nthe human person necessarily relies on others. He depends on other\npersons for his survival and development, and this interdependence is\na hallmark of human existence. Beyond this, the human person also\ntends toward society as a basic human value. Such society is not only\na matter of utility or convenience but reflects an innate tendency of\nthe person to seek out his fellows and enter into spiritual\nassociation with them.  The trait of sociableness has been observed\nsince the earliest philosophers, and reflects both man’s dependence on\nother people for his subsistence and development and his natural tendency to\ndeeper communion.\n\n\nSome personalists note that man’s social nature and his vocation\nto inter-personal communion are not the same thing. Their capacity for\nrational community and friendship is one of the things that make human\nbeings social. But the person’s capacity for communion is\naccording to these personalists deeper than mere\nsociability. “Society,” in fact, is sometimes analogously\napplied to non-personal beings that live and interact as a group\nrather than in isolation from one another, whereas the word\n‘communion’ could never be understood in this way.\nCommunio does not simply refer to something common, but rather\nto a mode of being and acting in common through which the persons\ninvolved mutually confirm and affirm one another, a mode of being and\nacting that promotes the personal fulfillment of each of them by virtue\nof their mutual relationship. This mode of being and acting is an\nexclusive property of persons.\n\n\nPersonalists see the human person’s vocation to communion as rooted in\nrational nature, through the person’s subjectivity and\nself-determination.  Far from closing the person in on himself, these\ncharacteristics of the person’s spiritual nature dispose him to\ncommunication with other persons. For most personalists, the\nsubjectivity of the person has nothing in common with the isolated\nunity of the Leibnizian monad but requires the communication of\nknowledge and love.\n\n\nThis communication, in turn, depends on the person’s\nself-determination with its distinctive structure of self-possession\nand self-governance. As a free, willing subject, the person cannot be\npossessed by another, unless he chooses to make a gift of himself to\nanother. Personalists assert that the person belongs to himself in a\nway that no other thing or animal can. Self-possession does not imply\nisolation. On the contrary, both self-possession and self-governance\nimply a special disposition to make “a gift of oneself.”\nOnly if one possesses oneself can one give oneself and do this in a\ndisinterested way. And only if one governs oneself can one make a\ndisinterested gift of oneself. This vocation to self-giving is so\nessential to the constitution of the person that it is precisely when\none becomes a gift for others that one most fully becomes\noneself. Without a disinterested gift of self man cannot achieve the\nfinality that is proper to a human being by virtue of his being a\nperson, and cannot fully discover his true self.\n\n\nFor personalists, this “law of the gift” shows that the\nrelation and the society of which the person alone is capable, and\nwhich are necessary for his realization as a person, consist not only\nin association, but in love. They consist in a love which gives and\ngives itself, which receives not only things but other persons as\nwell. Only persons can give love and only persons can receive\nlove.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriLit\">Primary Literature</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriLit\">Primary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Bowne, Borden Parker, 1908, <em>Personalism</em>, Boston: Houghton\nMifflin Company.",
                "Brightman Edgar S., 1932, <em>Is God a Person?</em>, New York:\nAssociation Press.",
                "–––, 1943, <em>Personalism in Theology: A\nSymposium in Honor of Albert Cornelius Knudson</em>, Boston: Boston\nUniversity Press.",
                "–––, 1952, <em>Persons and Values</em>, Boston:\nBoston University Press.",
                "Buber, Martin, 1923, <em>Ich und Du</em> (<em>I and Thou</em>),\nRonald Gregor Smith (trans.), second edition, Edinburgh: T &amp; T\nClark, 1987.",
                "Flewelling, Ralph Tyler, 1926, <em>Creative Personality</em>,\nIntroduction by H. Wildon Carr, New York: Macmillan Co.",
                "Flewelling, Ralph Tyler and Rudolf Eucken, 1915, <em>Personalism and the\nProblems of Philosophy: An Appreciation of the Work of Borden Parker\nBowne</em>, New York/Cincinnati: The Methodist Book Concern.",
                "Gilson, Étienne, 1932, <em>L’esprit de la philosophie\nmédiéva</em><em>le</em>, Paris: Librairie philosophique\nJ. Vrin. (See especially ch. 10, “Le personnalisme\nchrétien”: 195–215.)",
                "Guardini, Romano, 1955, <em>Welt und Person</em>, <em>Versuche\nzur christlichen Lehre vom Menschen</em>, Würzburg:\nWerkbund-Verlag.",
                "Hart, James G., 1992, <em>The Person and the Common Life: Studies\nin a Husserlian Social Ethics</em>, New York: Springer.",
                "–––, 2009a, <em>Who One is. Book 1: A Meontology of the\n‘I’</em>, New York: Springer.",
                "–––, 2009b, <em>Who One is. Book 2: Existenz and\nTranscendental Phenomenology</em>, New York: Springer.",
                "Knudson, Albert Cornelius, 1927, <em>The Philosophy of Personalism</em>.\nNew York: The Abingdon Press.",
                "Kohák, Erazim, 1984, <em>The Embers and the Stars. A Philosophical\nInquiry into the Moral Sense of Nature</em>, Chicago: The University of\nChicago Press.",
                "Lahbabi, Mohammed Aziz, 1964, <em>Le personnalisme musulman</em>, Paris:\nPresses Universitaires de France.",
                "Macmurray, John, 1961a, <em>Persons in Relation</em>, London: Faber\nand Faber.",
                "–––, 1961b, <em>The Self As Agent</em>, London: Faber\nand Faber.",
                "Marcel, Gabriel, 1963, <em>The Existential Background of Human\nDignity</em>, Cambridge, MA: Harvard University Press.",
                "Maritain, Jacques, 1947, <em>La personne et le bien commun</em>\n(<em>The Person and the Common Good</em>), John J. Fitzgerald\n(trans.), Notre Dame, IN: University of Notre Dame Press, 1985.",
                "–––, 1945, <em>The Rights of Man and Natural Law</em>.\nGlasgow: Robert Maclehose and Co./The University Press.",
                "Mounier, Emmanuel, 1950, <em>Le personnalisme</em>\n(<em>Personalism</em>), Philip Mairet (trans.), Notre Dame: University\nof Notre Dame Press, 1952.",
                "–––, 1938, <em>A Personalist Manifesto</em>,\ntrans. from the French by the monks of St. John’s Abbey. New\nYork: Longmans, Green and Co.",
                "Renouvier, Charles B., 1903, <em>Le personnalisme</em>, Paris:\nF. Alcan.",
                "Scheler, Max, 1913 [1916], <em>Der Formalismus in der Ethik und\ndie materiale Wertethik</em>, in <em>Gesammelte Werke</em>, Volume 2,\nBern (Francke) 5, 1966; <em>Formalism in Ethics and Non-Formal Ethics\nof Values: A New Attempt Toward A Foundation of An Ethical\nPersonalism</em>, Manfred S. Frings and Roger L. Funk (trans.),\nEvanston, IL: Northwestern University Press, 1973.",
                "Sokolowski, Robert, 2008, <em>Phenomenology of the Human\nPerson</em>, New York: Cambridge.",
                "Stern, William, 1906, <em>Person und Sache. System der\nphilosophischen Weltanschauung</em> (Volume I), <em>Ableitung und\nGrundlehre</em>. Leipzig: J. A. Barth.",
                "–––, 1923/1924, <em>Person und Sache: System des\nkritischen Personalismus</em>, Leipzig: J. A. Barth.",
                "Tillich, Paul, 1955, <em>Biblical Religion and the Search\nfor Ultimate Reality</em>, Chicago: The University of Chicago\nPress.",
                "Wojtyła, Karol, 1969 [1979], <em>Osoba i czyn</em> (<em>The\nActing Person</em>), Andrzej Potocki (trans.), Dordrecht:\nD. Reidel Publishing Company.",
                "–––, 1960 [1995], <em>Milosc I\nOdpowiedzialnosc</em> (<em>Love and Responsibility</em>), H. T.\nWilletts (trans.), New York: Farrar, Straus, &amp; Giroux.",
                "–––, 1993a, “The Personal Structure of\nSelf-Determination,” Theresa Sandok (trans.), in\n<em>Person and Community: Selected Essays</em> (<em>Catholic Thought\nfrom Lublin</em>: Volume 4), Andrew N. Woznicki (ed.), New York: Peter\nLang, 187–95.",
                "–––, 1993b, “Subjectivity and the\nIrreducible in the Human Being,” Theresa Sandok (trans.),\nin <em>Person and Community: Selected Essays</em> (<em>Catholic\nThought from Lublin</em>: Volume 4), Andrew N. Woznicki (ed.), New\nYork: Peter Lang, 209–17.",
                "–––, 1993c, “Thomistic Personalism,”\nTheresa Sandok (trans.), in <em>Person and Community: Selected\nEssays</em> (<em>Catholic Thought from Lublin</em>: Volume 4), Andrew\nN. Woznicki (ed.), New York: Peter Lang, 165–75.\n</ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Balthasar, Hans Urs von, 1986, “On the Concept of\nPerson,” trans. Peter Verhalen, <em>Communio: International\nCatholic Review</em>, 13 (Spring): 18–26.",
                "Beabout, Gregory R., Ricardo F. Crespo, Stephen J. Grabill, Kim\nPaffenroth, and Kyle Swann, 2001, <em>Beyond Self-Interest: A\nPersonalist Approach to Human Action</em>, Lanham, MD: Lexington\nBooks.",
                "Beauregard, James, Giusy Gallo, Claudia Stancati (eds.), 2020,\n<em>The Person at the Crossroads: A Philosophical Approach</em>,\nWilmington, DE: Vernon Press.",
                "Bengtsson, Jan Olof, 2006, <em>The Worldview of Personalism: Origins and\nEarly Development</em>, Oxford: Oxford University Press.",
                "Berti, Enrico, <em>et al</em>., 1992, <em>Persona e\npersonalismo. Aspetti filosofici e teologici</em>, Progetti 3. Padova:\nEditrice Gregoriana.",
                "Buford, Thomas O. and Harry H. Oliver (eds), 2002, <em>Personalism\nRevisited: Its Proponents and Critics</em>, Amsterdam and New York:\nEditions Rodopi.",
                "Burgos, Juan Manuel, 2000, <em>El personalismo</em>, Madrid:\nEdiciones Palabra.",
                "–––, 2018, <em>An Introduction to Personalism</em>.\nWashington, D.C.: The Catholic University of America Press.",
                "Burrow, Rufus, 1999, <em>Personalism: A Critical Introduction</em>, St.\nLouis, MO: Chalice Press.",
                "Calcagno, Anthony, 2007, <em>The Philosophy of Edith Stein</em>,\nPittsburgh: Duquesne University Press.",
                "Calcagno, Anthony (ed.), 2016, <em>Edith Stein: Woman,\nSocial-Political Philosophy, Theology, Metaphysics and Public\nHistory</em>, Dordrecht: Springer.",
                "Cañas Fernández, José Luis,\n2001, <em>¿Renacimiento del Personalismo?</em>, Madrid:\nUniversidad Complutense.",
                "Carr, David, 1999, <em>The Paradox of Subjectivity: The Self in\nthe Transcendental Tradition</em>, Oxford: Oxford University\nPress.",
                "Cowburn, John, 2005, <em>Personalism and Scholasticism</em>,\nMilwaukee: Marquette University Press.",
                "Crosby, John F., 2004, <em>Personalist Papers</em>, Washington,\nD.C.: Catholic University of America Press.",
                "–––, 1996, <em>The Selfhood of the Human\nPerson</em>. Washington, D.C.: The Catholic University of America\nPress.",
                "–––, 2014, <em>The Personalism of John Henry\nNewman</em>. Washington, D.C.: The Catholic University of America\nPress.",
                "Deats, Paul, and Carol Robb, 1986, <em>The Boston Personalist\nTradition in Philosophy, Social Ethics and Theology</em>, Macon, GA:\nMercer University Press.",
                "Evans, Joseph W., 1952, “Jacques Maritain’s\nPersonalism,”\n<em>The Review of Politics</em>, 14 (2): 166–177.",
                "Gacka, Bogumił, 1994, <em>Bibliography of American\nPersonalism</em>. Lublin: Oficyna Wydawnicza “Czas”.",
                "–––, 1999, <em>Bibliography of The Personalist</em>,\nLublin: Oficyna Wydawnicza Czas.",
                "Galeazzi, Giancarlo, 1998, <em>Personalismo</em>, Milano: Editrice\nBibliografica.",
                "Goto, Hiroshi, 2004, <em>Der Begriff der Person in der\nPhänomenologie Edmund Husserl</em>, Würzburg: Köninhausen &amp;\nNeumann.",
                "Häring, Bernhard, 1968, <em>Personalismus in Philosophie und\nTheologie</em>, Munich: Wewel.",
                "Lacroix, Jean, 1972, <em>Le personalisme comme anti-idéologie</em>,\nParis: Presses Universitaires de France.",
                "Lebech, Mette, 2015, <em>The Philosophy of Edith Stein: From\nPhenomenology to Metaphysics</em>, Bern: Peter Lang.",
                "Liebman, Charles S. and Stephen M. Cohen, 1990, <em>Two Worlds of\nJudaism: The Israeli and American Experiences</em>, New Haven: Yale\nUniversity Press.",
                "Luft, Sebastian, 2011, <em>Subjectivity and Lifeworld in\nTranscendental Phenomenology</em>, Evanston: Northwestern University\nPress.",
                "Moran, Dermot, 2009, “The Phenomenology of Personhood:\nCharles Taylor and Edmund Husserl,” in <em>Colloquium</em>\n3 (1): 80–104.",
                "Ricoeur, Paul, 1990, <em>Soi-même comme un autre</em>,\nParis: Seuil.",
                "Rigobello, Armando, 1978, <em>Il Personalismo</em>, Rome: Città\nNuova.",
                "Rigobello Armando, 1958, <em>Introduzione a una logica del\npersonalismo</em>, Padova: Liviana.",
                "Spader, Peter H., 2002, <em>Scheler’s Ethical Personalism. Its Logic,\nDevelopment, and Promise</em>, New York: Fordham University Press.",
                "Snead, O. Carter, 2020, <em>What It Means to Be Human: The Case\nfor the Body in Public Bioethics</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Spaemann, Robert, 1996, <em>Personen: Versuche über den Unterschied\nzwischen ‘etwas’ und ‘jemand’</em>,\nStuttgart: Klett-Cotta. (See especially chapter 18 entitled\n“Sind alle Menschen Personen?”: 252–64.)",
                "Waldschütz, Erwin, 1993, “Was ist\n‘Personalismus’?,” <em>Die\nPresse</em>, <em>Spectrum</em>, December 24, XII.",
                "Waldstein, Michael, 2006, <em>Man and Woman He Created Them: A\nTheology of the Body</em>, Boston: Pauline Books &amp; Media.",
                "Werkmeister, William H., 1949, “The Personalism of\nBowne,” in\n<em>A History of Philosophical Ideas in America</em>, New York: Ronald\nPress, 103–121.",
                "Williams, Thomas D., 2005, <em>Who Is My Neighbor? Personalism and\nthe Foundations of Human Rights</em>, Washington, D.C.: The Catholic\nUniversity of America Press.",
                "–––, 2004, “What is Thomistic Personalism?,”\n<em>Alpha Omega</em>, 7(2): 163–197.",
                "Yannaras, Christos, 1987 [2007], <em>To prosopo kai o eros</em>,\n(<em>Person and Eros</em>), Norman Russell (trans.),\nBrookline, MA: Holy Cross Orthodox Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriLit\">Primary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Bowne, Borden Parker, 1908, <em>Personalism</em>, Boston: Houghton\nMifflin Company.</li>\n<li>Brightman Edgar S., 1932, <em>Is God a Person?</em>, New York:\nAssociation Press.</li>\n<li>–––, 1943, <em>Personalism in Theology: A\nSymposium in Honor of Albert Cornelius Knudson</em>, Boston: Boston\nUniversity Press.</li>\n<li>–––, 1952, <em>Persons and Values</em>, Boston:\nBoston University Press.</li>\n<li>Buber, Martin, 1923, <em>Ich und Du</em> (<em>I and Thou</em>),\nRonald Gregor Smith (trans.), second edition, Edinburgh: T &amp; T\nClark, 1987.</li>\n<li>Flewelling, Ralph Tyler, 1926, <em>Creative Personality</em>,\nIntroduction by H. Wildon Carr, New York: Macmillan Co.</li>\n<li>Flewelling, Ralph Tyler and Rudolf Eucken, 1915, <em>Personalism and the\nProblems of Philosophy: An Appreciation of the Work of Borden Parker\nBowne</em>, New York/Cincinnati: The Methodist Book Concern.</li>\n<li>Gilson, Étienne, 1932, <em>L’esprit de la philosophie\nmédiéva</em><em>le</em>, Paris: Librairie philosophique\nJ. Vrin. (See especially ch. 10, “Le personnalisme\nchrétien”: 195–215.)</li>\n<li>Guardini, Romano, 1955, <em>Welt und Person</em>, <em>Versuche\nzur christlichen Lehre vom Menschen</em>, Würzburg:\nWerkbund-Verlag.</li>\n<li>Hart, James G., 1992, <em>The Person and the Common Life: Studies\nin a Husserlian Social Ethics</em>, New York: Springer.</li>\n<li>–––, 2009a, <em>Who One is. Book 1: A Meontology of the\n‘I’</em>, New York: Springer.</li>\n<li>–––, 2009b, <em>Who One is. Book 2: Existenz and\nTranscendental Phenomenology</em>, New York: Springer.</li>\n<li>Knudson, Albert Cornelius, 1927, <em>The Philosophy of Personalism</em>.\nNew York: The Abingdon Press.</li>\n<li>Kohák, Erazim, 1984, <em>The Embers and the Stars. A Philosophical\nInquiry into the Moral Sense of Nature</em>, Chicago: The University of\nChicago Press.</li>\n<li>Lahbabi, Mohammed Aziz, 1964, <em>Le personnalisme musulman</em>, Paris:\nPresses Universitaires de France.</li>\n<li>Macmurray, John, 1961a, <em>Persons in Relation</em>, London: Faber\nand Faber.</li>\n<li>–––, 1961b, <em>The Self As Agent</em>, London: Faber\nand Faber.</li>\n<li>Marcel, Gabriel, 1963, <em>The Existential Background of Human\nDignity</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Maritain, Jacques, 1947, <em>La personne et le bien commun</em>\n(<em>The Person and the Common Good</em>), John J. Fitzgerald\n(trans.), Notre Dame, IN: University of Notre Dame Press, 1985.</li>\n<li>–––, 1945, <em>The Rights of Man and Natural Law</em>.\nGlasgow: Robert Maclehose and Co./The University Press.</li>\n<li>Mounier, Emmanuel, 1950, <em>Le personnalisme</em>\n(<em>Personalism</em>), Philip Mairet (trans.), Notre Dame: University\nof Notre Dame Press, 1952.</li>\n<li>–––, 1938, <em>A Personalist Manifesto</em>,\ntrans. from the French by the monks of St. John’s Abbey. New\nYork: Longmans, Green and Co.</li>\n<li>Renouvier, Charles B., 1903, <em>Le personnalisme</em>, Paris:\nF. Alcan.</li>\n<li>Scheler, Max, 1913 [1916], <em>Der Formalismus in der Ethik und\ndie materiale Wertethik</em>, in <em>Gesammelte Werke</em>, Volume 2,\nBern (Francke) 5, 1966; <em>Formalism in Ethics and Non-Formal Ethics\nof Values: A New Attempt Toward A Foundation of An Ethical\nPersonalism</em>, Manfred S. Frings and Roger L. Funk (trans.),\nEvanston, IL: Northwestern University Press, 1973.</li>\n<li>Sokolowski, Robert, 2008, <em>Phenomenology of the Human\nPerson</em>, New York: Cambridge.</li>\n<li>Stern, William, 1906, <em>Person und Sache. System der\nphilosophischen Weltanschauung</em> (Volume I), <em>Ableitung und\nGrundlehre</em>.  Leipzig: J. A. Barth.</li>\n<li>–––, 1923/1924, <em>Person und Sache: System des\nkritischen Personalismus</em>, Leipzig: J. A. Barth.</li>\n<li>Tillich, Paul, 1955, <em>Biblical Religion and the Search\nfor Ultimate Reality</em>, Chicago: The University of Chicago\nPress.</li>\n<li>Wojtyła, Karol, 1969 [1979], <em>Osoba i czyn</em> (<em>The\nActing Person</em>), Andrzej Potocki (trans.), Dordrecht:\nD. Reidel Publishing Company.</li>\n<li>–––, 1960 [1995], <em>Milosc I\nOdpowiedzialnosc</em> (<em>Love and Responsibility</em>), H. T.\nWilletts (trans.), New York: Farrar, Straus, &amp; Giroux.</li>\n<li>–––, 1993a, “The Personal Structure of\nSelf-Determination,” Theresa Sandok (trans.), in\n<em>Person and Community: Selected Essays</em> (<em>Catholic Thought\nfrom Lublin</em>: Volume 4), Andrew N. Woznicki (ed.), New York: Peter\nLang, 187–95.</li>\n<li>–––, 1993b, “Subjectivity and the\nIrreducible in the Human Being,” Theresa Sandok (trans.),\nin <em>Person and Community: Selected Essays</em> (<em>Catholic\nThought from Lublin</em>: Volume 4), Andrew N. Woznicki (ed.), New\nYork: Peter Lang, 209–17.</li>\n<li>–––, 1993c, “Thomistic Personalism,”\nTheresa Sandok (trans.), in <em>Person and Community: Selected\nEssays</em> (<em>Catholic Thought from Lublin</em>: Volume 4), Andrew\nN. Woznicki (ed.), New York: Peter Lang, 165–75.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Balthasar, Hans Urs von, 1986, “On the Concept of\nPerson,” trans. Peter Verhalen, <em>Communio: International\nCatholic Review</em>, 13 (Spring): 18–26.</li>\n<li>Beabout, Gregory R., Ricardo F. Crespo, Stephen J. Grabill, Kim\nPaffenroth, and Kyle Swann, 2001, <em>Beyond Self-Interest: A\nPersonalist Approach to Human Action</em>, Lanham, MD: Lexington\nBooks.</li>\n<li>Beauregard, James, Giusy Gallo, Claudia Stancati (eds.), 2020,\n<em>The Person at the Crossroads: A Philosophical Approach</em>,\nWilmington, DE: Vernon Press.</li>\n<li>Bengtsson, Jan Olof, 2006, <em>The Worldview of Personalism: Origins and\nEarly Development</em>, Oxford: Oxford University Press.</li>\n<li>Berti, Enrico, <em>et al</em>., 1992, <em>Persona e\npersonalismo. Aspetti filosofici e teologici</em>, Progetti 3. Padova:\nEditrice Gregoriana.</li>\n<li>Buford, Thomas O. and Harry H. Oliver (eds), 2002, <em>Personalism\nRevisited: Its Proponents and Critics</em>, Amsterdam and New York:\nEditions Rodopi.</li>\n<li>Burgos, Juan Manuel, 2000, <em>El personalismo</em>, Madrid:\nEdiciones Palabra.</li>\n<li>–––, 2018, <em>An Introduction to Personalism</em>.\nWashington, D.C.: The Catholic University of America Press.</li>\n<li>Burrow, Rufus, 1999, <em>Personalism: A Critical Introduction</em>, St.\nLouis, MO: Chalice Press.</li>\n<li>Calcagno, Anthony, 2007, <em>The Philosophy of Edith Stein</em>,\nPittsburgh: Duquesne University Press.</li>\n<li>Calcagno, Anthony (ed.), 2016, <em>Edith Stein: Woman,\nSocial-Political Philosophy, Theology, Metaphysics and Public\nHistory</em>, Dordrecht: Springer.</li>\n<li>Cañas Fernández, José Luis,\n2001, <em>¿Renacimiento del Personalismo?</em>, Madrid:\nUniversidad Complutense.</li>\n<li>Carr, David, 1999, <em>The Paradox of Subjectivity: The Self in\nthe Transcendental Tradition</em>, Oxford: Oxford University\nPress.</li>\n<li>Cowburn, John, 2005, <em>Personalism and Scholasticism</em>,\nMilwaukee: Marquette University Press.</li>\n<li>Crosby, John F., 2004, <em>Personalist Papers</em>, Washington,\nD.C.: Catholic University of America Press.</li>\n<li>–––, 1996, <em>The Selfhood of the Human\nPerson</em>.  Washington, D.C.: The Catholic University of America\nPress.</li>\n<li>–––, 2014, <em>The Personalism of John Henry\nNewman</em>.  Washington, D.C.: The Catholic University of America\nPress.</li>\n<li>Deats, Paul, and Carol Robb, 1986, <em>The Boston Personalist\nTradition in Philosophy, Social Ethics and Theology</em>, Macon, GA:\nMercer University Press.</li>\n<li>Evans, Joseph W., 1952, “Jacques Maritain’s\nPersonalism,”\n<em>The Review of Politics</em>, 14 (2): 166–177.</li>\n<li>Gacka, Bogumił, 1994, <em>Bibliography of American\nPersonalism</em>.  Lublin: Oficyna Wydawnicza “Czas”.</li>\n<li>–––, 1999, <em>Bibliography of The Personalist</em>,\nLublin: Oficyna Wydawnicza Czas.</li>\n<li>Galeazzi, Giancarlo, 1998, <em>Personalismo</em>, Milano: Editrice\nBibliografica.</li>\n<li>Goto, Hiroshi, 2004, <em>Der Begriff der Person in der\nPhänomenologie Edmund Husserl</em>, Würzburg: Köninhausen &amp;\nNeumann.</li>\n<li>Häring, Bernhard, 1968, <em>Personalismus in Philosophie und\nTheologie</em>, Munich: Wewel.</li>\n<li>Lacroix, Jean, 1972, <em>Le personalisme comme anti-idéologie</em>,\nParis: Presses Universitaires de France.</li>\n<li>Lebech, Mette, 2015, <em>The Philosophy of Edith Stein: From\nPhenomenology to Metaphysics</em>, Bern: Peter Lang.</li>\n<li>Liebman, Charles S. and Stephen M. Cohen, 1990, <em>Two Worlds of\nJudaism: The Israeli and American Experiences</em>,  New Haven: Yale\nUniversity Press.</li>\n<li>Luft, Sebastian, 2011, <em>Subjectivity and Lifeworld in\nTranscendental Phenomenology</em>, Evanston: Northwestern University\nPress.</li>\n<li>Moran, Dermot, 2009, “The Phenomenology of Personhood:\nCharles Taylor and Edmund Husserl,” in <em>Colloquium</em>\n3 (1): 80–104.</li>\n<li>Ricoeur, Paul, 1990, <em>Soi-même comme un autre</em>,\nParis: Seuil.</li>\n<li>Rigobello, Armando, 1978, <em>Il Personalismo</em>, Rome: Città\nNuova.</li>\n<li>Rigobello Armando, 1958, <em>Introduzione a una logica del\npersonalismo</em>, Padova: Liviana.</li>\n<li>Spader, Peter H., 2002, <em>Scheler’s Ethical Personalism. Its Logic,\nDevelopment, and Promise</em>, New York: Fordham University Press.</li>\n<li>Snead, O. Carter, 2020, <em>What It Means to Be Human: The Case\nfor the Body in Public Bioethics</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Spaemann, Robert, 1996, <em>Personen: Versuche über den Unterschied\nzwischen ‘etwas’ und ‘jemand’</em>,\nStuttgart: Klett-Cotta. (See especially chapter 18 entitled\n“Sind alle Menschen Personen?”: 252–64.)</li>\n<li>Waldschütz, Erwin, 1993, “Was ist\n‘Personalismus’?,” <em>Die\nPresse</em>, <em>Spectrum</em>, December 24, XII.</li>\n<li>Waldstein, Michael, 2006, <em>Man and Woman He Created Them: A\nTheology of the Body</em>, Boston: Pauline Books &amp; Media.</li>\n<li>Werkmeister, William H., 1949, “The Personalism of\nBowne,” in\n<em>A History of Philosophical Ideas in America</em>, New York: Ronald\nPress, 103–121.</li>\n<li>Williams, Thomas D., 2005, <em>Who Is My Neighbor? Personalism and\nthe Foundations of Human Rights</em>, Washington, D.C.: The Catholic\nUniversity of America Press.</li>\n<li>–––, 2004, “What is Thomistic Personalism?,”\n<em>Alpha Omega</em>, 7(2): 163–197.</li>\n<li>Yannaras, Christos, 1987 [2007], <em>To prosopo kai o eros</em>,\n(<em>Person and Eros</em>),  Norman Russell (trans.),\nBrookline, MA: Holy Cross Orthodox Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Buber, Martin",
            "communitarianism",
            "determinism: causal",
            "existentialism",
            "Hartshorne, Charles",
            "idealism",
            "individualism, methodological",
            "Ingarden, Roman",
            "James, William",
            "Lotze, Hermann",
            "Marcel, Gabriel (-Honoré)",
            "Maritain, Jacques",
            "Muhammad Iqbal",
            "personal identity",
            "phenomenology",
            "Ricoeur, Paul",
            "Royce, Josiah",
            "self-consciousness",
            "self-consciousness: phenomenological approaches to"
        ],
        "entry_link": [
            {
                "../buber/": "Buber, Martin"
            },
            {
                "../communitarianism/": "communitarianism"
            },
            {
                "../determinism-causal/": "determinism: causal"
            },
            {
                "../existentialism/": "existentialism"
            },
            {
                "../hartshorne/": "Hartshorne, Charles"
            },
            {
                "../idealism/": "idealism"
            },
            {
                "../methodological-individualism/": "individualism, methodological"
            },
            {
                "../ingarden/": "Ingarden, Roman"
            },
            {
                "../james/": "James, William"
            },
            {
                "../hermann-lotze/": "Lotze, Hermann"
            },
            {
                "../marcel/": "Marcel, Gabriel (-Honoré)"
            },
            {
                "../maritain/": "Maritain, Jacques"
            },
            {
                "../identity-personal/": "personal identity"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../ricoeur/": "Ricoeur, Paul"
            },
            {
                "../royce/": "Royce, Josiah"
            },
            {
                "../self-consciousness/": "self-consciousness"
            },
            {
                "../self-consciousness-phenomenological/": "self-consciousness: phenomenological approaches to"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=personalism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/personalism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=personalism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/personalism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=personalism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/personalism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=personalism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/personalism/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Bowne, Borden Parker, \n <a href=\"http://www.archive.org/stream/personalism00bownuoft#page/n1/mode/2up\" target=\"other\"><em>Personalism</em></a>.",
            "Buford, Thomas O. and Harold H. Oliver, \n <a href=\"http://books.google.it/books?id=w8C6MsXnmM8C&amp;printsec=frontcover&amp;hl=en&amp;source=gbs_v2_summary_r&amp;cad=0#v=onepage&amp;q=&amp;f=false\" target=\"other\"><em>Personalism Revisited: Its Proponents and Critics</em></a>.",
            "Burrow, Rufus Jr.,  \n <a href=\"http://books.google.com/books?id=QZ26UpzbcrgC&amp;pg=PP1&amp;dq=personalism&amp;ei=I23gSuSmEpK0NoCCyaEC#v=onepage&amp;q=&amp;f=false\" target=\"other\"><em>Personalism: A Critical Introduction</em></a>.",
            "Chazarreta Rourke, Rosita A., \n <a href=\"http://books.google.com/books?id=KHOsv-sPDQ8C&amp;printsec=frontcover&amp;source=gbs_v2_summary_r&amp;cad=0#v=onepage&amp;q=&amp;f=false\" target=\"other\"><em>A Theory of Personalism</em></a>.",
            "McLean, George F. (ed.),\n <a href=\"http://books.google.com/books?id=VJg6QsO3KXgC&amp;printsec=frontcover&amp;source=gbs_v2_summary_r&amp;cad=0#v=onepage&amp;q=&amp;f=false\" target=\"other\"><em>Personalist Ethics and Human Subjectivity</em></a>.",
            "Williams, Thomas D.,  \n <a href=\"http://books.google.it/books?id=ldVpoPNxIEQC&amp;pg=PA105&amp;dq=thomistic+personalism&amp;hl=en&amp;sa=X&amp;ei=03ybUerzIofLOOfxgOAD&amp;ved=0CDEQ6AEwAA#v=onepage&amp;q&amp;f=false\" target=\"other\"><em>Who Is My Neighbor? Personalism and the Foundations of Human Rights</em></a>.",
            "Berdyaev, N.A., <a href=\"https://web.archive.org/web/20221014000501/http://www.berdyaev.com/berdiaev/berd_lib/1935_400.html\" target=\"other\">Personalism and Marxism</a>, manuscript.",
            "Buford, Thomas O., \n <a href=\"http://www.american-philosophy.org/events/documents/Buford_Personalism.pdf\" target=\"other\">Personalism</a>,\n manuscript in PDF. ",
            "Cole, Graham and Michael Schluter, \n <a href=\"http://www.jubilee-centre.org/personalism-relationism-commonalities-distinctives-g-cole-m-schluter/\" target=\"other\">From Personalism to Relationism: Commonalities and Distinctives</a>,\n  manuscript in PDF.",
            "DeMarco, Donald, \n <a href=\"http://www.ewtn.com/library/THEOLOGY/FR91201.HTM\" target=\"other\">The Christian Personalism of Jacques Maritain</a>,\n  manuscript.",
            "<a href=\"http://www.britannica.com/EBchecked/topic/452990/personalism\" target=\"other\">Personalism</a>,\n entry in the <em>Encyclopædia Britannica Online</em>.",
            "<a href=\"http://www.iep.utm.edu/personal/\" target=\"other\">Personalism</a>,\n entry by Thomas Buford, in  the <em>Internet Encyclopedia of Philosophy</em>.",
            "De Tavernier, Johan, \n<a href=\"http://www.ethical-perspectives.be/viewpic.php?LAN=E&amp;TABLE=EP&amp;ID=1208\" target=\"other\">The Historical Roots of Personalism</a>,\n paper (PDF) in <em>Ethical Perspectives</em>, 16(3) (2009): \n361–392.",
            "Williams, Thomas D., \n<a href=\"https://pdfs.semanticscholar.org/9ac5/c203acaabbaf9e3f438fa8490a653fbdc54f.pdf?_ga=2.189116331.1222629154.1570032856-1204823184.1570032856\" target=\"other\">What Is Thomistic Personalism?</a>,\n paper (PDF) in <em>Alpha Omega</em>, VII/2 (2004): \n163–197."
        ],
        "listed_links": [
            {
                "http://www.archive.org/stream/personalism00bownuoft#page/n1/mode/2up": "Personalism"
            },
            {
                "http://books.google.it/books?id=w8C6MsXnmM8C&printsec=frontcover&hl=en&source=gbs_v2_summary_r&cad=0#v=onepage&q=&f=false": "Personalism Revisited: Its Proponents and Critics"
            },
            {
                "http://books.google.com/books?id=QZ26UpzbcrgC&pg=PP1&dq=personalism&ei=I23gSuSmEpK0NoCCyaEC#v=onepage&q=&f=false": "Personalism: A Critical Introduction"
            },
            {
                "http://books.google.com/books?id=KHOsv-sPDQ8C&printsec=frontcover&source=gbs_v2_summary_r&cad=0#v=onepage&q=&f=false": "A Theory of Personalism"
            },
            {
                "http://books.google.com/books?id=VJg6QsO3KXgC&printsec=frontcover&source=gbs_v2_summary_r&cad=0#v=onepage&q=&f=false": "Personalist Ethics and Human Subjectivity"
            },
            {
                "http://books.google.it/books?id=ldVpoPNxIEQC&pg=PA105&dq=thomistic+personalism&hl=en&sa=X&ei=03ybUerzIofLOOfxgOAD&ved=0CDEQ6AEwAA#v=onepage&q&f=false": "Who Is My Neighbor? Personalism and the Foundations of Human Rights"
            },
            {
                "https://web.archive.org/web/20221014000501/http://www.berdyaev.com/berdiaev/berd_lib/1935_400.html": "Personalism and Marxism"
            },
            {
                "http://www.american-philosophy.org/events/documents/Buford_Personalism.pdf": "Personalism"
            },
            {
                "http://www.jubilee-centre.org/personalism-relationism-commonalities-distinctives-g-cole-m-schluter/": "From Personalism to Relationism: Commonalities and Distinctives"
            },
            {
                "http://www.ewtn.com/library/THEOLOGY/FR91201.HTM": "The Christian Personalism of Jacques Maritain"
            },
            {
                "http://www.britannica.com/EBchecked/topic/452990/personalism": "Personalism"
            },
            {
                "http://www.iep.utm.edu/personal/": "Personalism"
            },
            {
                "http://www.ethical-perspectives.be/viewpic.php?LAN=E&TABLE=EP&ID=1208": "The Historical Roots of Personalism"
            },
            {
                "https://pdfs.semanticscholar.org/9ac5/c203acaabbaf9e3f438fa8490a653fbdc54f.pdf?_ga=2.189116331.1222629154.1570032856-1204823184.1570032856": "What Is Thomistic Personalism?"
            }
        ]
    }
}