{
    "url": "principia-mathematica",
    "title": "Principia Mathematica",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Bernard Linsky\n<bernard.linsky@ualberta.ca>\nAndrew David Irvine",
        "author_links": [
            {
                "https://www.ualberta.ca/arts/about/people-collection/bernard-linsky": "Bernard Linsky"
            },
            {
                "mailto:bernard%2elinsky%40ualberta%2eca": "bernard.linsky@ualberta.ca"
            },
            {
                "http://phil.ok.ubc.ca/faculty/irvine.html": "Andrew David Irvine"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://www.ualberta.ca/arts/about/people-collection/bernard-linsky\" target=\"other\">Bernard Linsky</a>\n&lt;<a href=\"mailto:bernard%2elinsky%40ualberta%2eca\"><em>bernard<abbr title=\" dot \">.</abbr>linsky<abbr title=\" at \">@</abbr>ualberta<abbr title=\" dot \">.</abbr>ca</em></a>&gt;<br/>\n<a href=\"http://phil.ok.ubc.ca/faculty/irvine.html\" target=\"other\">Andrew David Irvine</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Tue May 21, 1996",
        "substantive revision Wed Jun 23, 2021"
    ],
    "preamble": "\n\nThis entry briefly describes the history and significance of Alfred\nNorth Whitehead and Bertrand Russell’s monumental but little\nread classic of symbolic logic, Principia Mathematica (PM),\nfirst published in 1910–1913. The content of PM is described in\na section by section synopsis, stated in modernized logical notation\nand described following the introductory notes from each of the three\nvolumes. The original notation is presented in a companion article of\nthis Encyclopedia,\n The Notation of Principia Mathematica.\n The content of PM is described so as to facilitate a comparison with\nGottlob Frege’s Basic Laws of Arithmetic which\nwas subject to Russell’s Paradox. To avoid the paradox Whitehead\nand Russell introduced a complex system now called “the ramified\ntheory of types”. After the introduction of a theory of sets, or\n“classes” early in the first volume, however, the system\nof PM can be compared with both Frege and the early development of set\ntheory and found to contain rival accounts, free of contradiction, but\ndiffering from the now standard theories in as yet understudied\nways.\n",
    "toc": [
        {
            "#Over": "1. Overview"
        },
        {
            "#HistSignPrinMath": "2. History of and Significance of Principia Mathematica"
        },
        {
            "#HistPrinMath": "2.1 History of Principia Mathematica"
        },
        {
            "#SignPrinMath": "2.2 Significance of Principia Mathematica"
        },
        {
            "#ContPrinMath": "3. Contents of Principia Mathematica"
        },
        {
            "#VoluI": "3.1 Volume I"
        },
        {
            "#VoluII": "3.2 Volume II"
        },
        {
            "#VoluIII": "3.3 Volume III"
        },
        {
            "#VoluI_1": "4. Volume I"
        },
        {
            "#PartIMathLogi": "4.1 Part I: Mathematical Logic"
        },
        {
            "#PropLogiPM": "4.1.1 Propositional Logic in PM"
        },
        {
            "#RamiTheoType": "4.1.2 The “Ramified” Theory of Types"
        },
        {
            "#PartIIProlCardArit": "4.2 Part II: Prolegomena to Cardinal Arithmetic"
        },
        {
            "#VoluII_1": "5. Volume II"
        },
        {
            "#PrefStatSymbConv": "5.1 Prefatory Statement of Symbolic Conventions"
        },
        {
            "#PartIIICardArit": "5.2 Part III: Cardinal Arithmetic"
        },
        {
            "#PartIVRelaArit": "5.3 Part IV: Relation-Arithmetic"
        },
        {
            "#PartVSeri": "5.4 Part V: Series"
        },
        {
            "#VoluIII_1": "6. Volume III"
        },
        {
            "#PartVSeriCont": "6.1 Part V: Series (continued)"
        },
        {
            "#PartVIQuan": "6.2 Part VI: Quantity"
        },
        {
            "#Meas": "6.2.1 Measurement"
        },
        {
            "#TherNoConcEndPM": "6.2.2 There is no “Conclusion” at the end of PM"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimLite": "Primary Literature"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Overview\n\nPrincipia Mathematica, the landmark work in formal logic\nwritten by\n Alfred North Whitehead\n and\n Bertrand Russell,\n was first published in three volumes in 1910, 1912 and 1913. A second\nedition appeared in 1925 (Volume I) and 1927 (Volumes II and III). In\n1962 an abbreviated issue (containing only the first 56 chapters)\nappeared in paperback.\n\nWritten as a defense of logicism (the thesis that mathematics\nis in some significant sense reducible to logic), the book was\ninstrumental in developing and popularizing modern mathematical logic.\nIt also served as a major impetus for research in the foundations of\nmathematics throughout the twentieth century. Along with\nAristotle’s Organon and Gottlob Frege’s\nBasic Laws of Arithmetic, it remains one of the most\ninfluential books on logic ever written.\n\nThis entry includes a presentation of the main definitions and\ntheorems used in the development of the logicist project in PM. The\nentry indicates a path through the whole work presenting the basic\nresults proved in Principia Mathematica (PM) in a somewhat\nmore contemporary notation, so as to make it easy to compare the\nsystem of Whitehead and Russell with that of Frege, the other most\nprominent advocate of logicism in the foundations of mathematics. The\naim of that program, as described by Russell in the opening lines of\nthe preface to his 1903 book The Principles of Mathematics,\nnamely to define mathematical notions in terms of logical notions, and\nto derive mathematical principles, so defined, from logical principles\nalone:\n\n\nThe present work has two main objects. One of these, the proof that\nall pure mathematics deals exclusively with concepts definable in\nterms of a very small number of fundamental concepts, and that all its\npropositions are deducible from a very small number of fundamental\nlogical principles, is undertaken in Parts II–VII of this work,\nand will be established by strict symbolic reasoning in Volume\nII.…The other object of this work, which occupies Part I., is\nthe explanation of the fundamental concepts which mathematics accepts\nas indefinable. This is a purely philosophical task…. (1903:\nxv)\n\n\nThough Frege’s system was subject to Russell’s Paradox,\nsubsequent examination of his system shows how much of the development\nof arithmetic is possible independently of the paradoxical elements of\nthe system. In particular, recent interest in Frege’s system has\nled to the isolation of what is called “Frege’s\nTheorem” as possible in a consistent fragment of Frege’s\noriginal system, and from it the goal of deriving arithmetic, as\nformalized in Peano’s Postulates. See the entry\n Frege’s theorem and foundations for arithmetic,\n which presents this aspect of Frege’s system in contemporary\nnotation.\n\nRussell had written The Principles of Mathematics (PoM),\nwhich presents the basic elements of his logicist program, before\ndiscovering Frege’s similar work in Foundations of\nArithmetic and Basic Laws of Arithmetic, in\nJune of 1902. As he describes in the Preface, Russell intended a\nformal presentation of his account in a “Volume II” of\nPoM. In 1903 he enlisted Alfred North Whitehead to join him in the\nwriting of this second volume, but soon the project turned into a new\nwork, Principia Mathematica, a massive three volume work,\nthat was not to be published until 1910 (Volume I), 1912 (Volume II)\nand 1913 (Volume III).\n\nThe system of PM differed significantly from Frege’s system, in\na large part because of the introduction of the theory of\ntypes whose purpose was to avoid the paradox that had affected\nFrege in a principled fashion. A second important difference from\nFrege’s system is that PM is based on a logic of relations of\nvarious numbers of arguments, whereas Frege’s system was based\non the notions of function and object, with even his distinctively\nlogical concepts being seen as functions (from a number of\nobjects to the truth values T and F, which are also objects in\nFrege’s system.) So, it might be said that PM is based on a\ntheory of ramified types of relations, in contrast to Frege’s\nsecond order predicate calculus with concepts. The most important step\nis to define set expressions in terms of higher-order functions. Thus\nthe paradoxical “Russell set”, the set of all sets which\nare not members of themselves, \\(\\{ x \\mid x \\notin x\\}\\), is defined by\nan expression involving functions that will violate the theory of\ntypes. The expression for the offending class is ruled out on the\nbasis of the theory of types, as is its seeming innocuous complement,\nthe set of all sets that are members of themselves, \\(\\{ x\n\\mid x \\in x\\}\\). In contemporary set theory \\(\\{ x \\mid x \\notin\nx\\}\\) is the universe of sets, which is not itself a set, and because\nno set is an element of itself, \\(\\{ x \\mid x \\in x\\}\\) is just the\nempty set. An additional cost of this method is that while for Frege\nsets are objects of the lowest types, there will be sets in the PM\ntheory in a simple theory of types, which distinguishes\nindividuals and sets of individuals and sets of sets of individuals,\netc. Even to derive a hierarchy of sets in the simple theory the\naxiom of reducibility is needed to guarantee that more\ncomplex “impredicative” definitions pick out sets of the\nsame simple type. Thus the “least upper bound” of a closed\ninterval of real numbers will identify a member of that set of a\nhigher order in the ramified theory. That this least upper bound will\nbe of the same simple type requires the axiom of reducibily. The cost\nof adopting the theory of types to avoid the paradox extends to\ndifficulties in constructing the natural numbers. While Russell\nfollows Frege in many important details, in particular in using\nFrege’s notion of the ancestral of the successor relation to\ndefine the natural numbers, other parts of the construction are\nimportantly different. Frege was able to define the successor of a\nnumber by using the set of its predecessors.  The number 2 is the set\ncontaining 0 and 1, and thus it has two members. They will, however,\nbe of different types in the hierarchy of simple types, and so the\nwhole set of natural numbers cannot be defined within the theory of\nsimple types. Since each step from 0 to 1, to 2, etc, raises the\nsimple types from 0 to 1 to 2, there will be no simple type of all the\nnatural numbers, so defined. Instead PM adopts the axiom of\ninfinity which assures the existence of an infinite number of\nindividuals, allowing for the construction of the natural numbers for\neach type above a lower bound of 3 or so (as numbers will be sets of\nequinumerous sets of individuals…).\n\nWith this turn to the ramified theory of types, along with the extra\naxioms of reducibility, and infinity, it is possible for PM to define\na version of Frege’s construction of the Natural Numbers so that\nthe “Peano axioms” can be proved from logic alone. This\ntakes up to section ∗120, well into Volume II. At\nthis point the alternative to “Frege’s Theorem” is\ncompleted, in the sense that we are presented with a consistent\ndevelopment of the natural numbers, based on a theory of higher-order\nlogic with a number of additional axioms. Philosophers soon followed\nLudwig Wittgenstein (1922) and disputed the idea that these additional\naxioms, the axioms of reducibility and infinity, are really logical\ntruths, and so denied that the logicist program of reducing arithmetic\nto logic was any more successful than Frege’s attempt had\nbeen.\n\nThe survey of PM will proceed through the remainder of Volume II and\nthrough Volume III, where the theories of rational and real numbers\nare developed. The contrast intended here is not with Frege’s\ntheories of rational and real numbers, which are present in\nGrundgesetze but are not seen as a natural extension of the\ntheory of natural numbers. Instead the contemporary account of natural\nnumbers and real numbers is seen as an elementary extension of the\naxiomatic Zermelo-Frankel set theory. A contemporary textbook in\naxiomatic set theory, such as Enderton (1977) or Suppes (1960), shows\nhow to construct rational numbers (and negative integers) as pairs of\nnatural numbers, thus 3/4 is constructed as the pair with the\noperations of addition and multiplication defined as operations on\npairs; thus \\(1/2 + 1/3 = 10/12 = 5/6\\). These positive rational\nnumbers are extended to the whole set by adding negative integers, and\nthen real numbers are defined as Dedekind cuts in the rational\nnumbers, i.e., the set of partitions of sets of rational numbers. The\narithmetic of real numbers is then defined for these constructions,\nand so with sets of real numbers the whole of analysis can be reduced\nto arithmetic. PM, however, avoids this “arithmetization”\nof analysis, but instead defines rational, real and in fact a huge\nclass of “relation numbers” as sets of isomorphic sets of\nrelations. Russell says later that he regrets that the theory of\nrelation numbers was not picked up by later set theorists, even though\nthis was some of his most original work in PM. The brief summary of\nthese later topics that we include below, can therefore be seen as a\nsummary of the interesting consequences of taking a different route to\nthe definition of natural numbers based on a logic of relations and\nproperties, rather than the set theory of contemporary foundations of\nmathematics. This entry is thus aimed at an explication of the unusual\norder of presentation of these results, in comparison with both Frege\nand contemporary set theory, and to illustrate these aspects of the\ntheory of relations that are not investigated by contemporary\nresearchers.\n2. History of and Significance of Principia Mathematica\n2.1 History of Principia Mathematica\n\nLogicism is the view that (some or all of) mathematics can be reduced\nto (formal) logic. It is often explained as a two-part thesis. First,\nit consists of the claim that all mathematical truths can be\ntranslated into logical truths or, in other words, that the vocabulary\nof mathematics constitutes a proper subset of the vocabulary of logic.\nSecond, it consists of the claim that all mathematical proofs can be\nrecast as logical proofs or, in other words, that the theorems of\nmathematics constitute a proper subset of the theorems of logic. As\nRussell writes, it is the logicist’s goal “to show that\nall pure mathematics follows from purely logical premises and uses\nonly concepts definable in logical terms” (1959: 74).\n\nThe logicist thesis appears to have been first advocated in the late\nseventeenth century by Gottfried Leibniz. Later, the idea was defended\nin much greater detail by Gottlob Frege. During the critical movement\nof the 1820s, mathematicians such as Bernard Bolzano, Niels Abel,\nLouis Cauchy, and Karl Weierstrass succeeded in eliminating much of\nthe vagueness and many of the contradictions present in the\nmathematics of their day. By the mid- to late-1800s, William Hamilton\nhad gone on to introduce ordered couples of reals as the first step in\nsupplying a logical basis for the complex numbers and Karl\nWeierstrass, Richard Dedekind, and Georg Cantor had all developed\nmethods for founding the irrationals in terms of the rationals. Using\nwork done by H.G. Grassmann and Richard Dedekind, Guiseppe Peano had\nthen gone on to develop a theory of the rationals based on his now\nfamous axioms for the natural numbers. By Frege’s day, it was\nthus generally recognized that large parts of mathematics could be\nderived from a relatively small set of primitive notions.\n\nEven so, it was not until 1879, when Frege developed the necessary\nlogical apparatus, that logicism could finally be said to have become\ntechnically plausible. After another five years’ work, Frege\narrived at the definitions necessary for logicising arithmetic and\nduring the 1890s he worked on many of the essential derivations.\nHowever, with the discovery of paradoxes such as\n Russell’s paradox\n at the turn of the century, it appeared that additional resources\nwould need to be developed if logicism were to succeed.\n\nBy 1902, both Whitehead and Russell had reached this same conclusion.\nBoth men were in the initial stages of preparing second volumes to\ntheir earlier books on related topics: Whitehead’s 1898 A\nTreatise on Universal Algebra and Russell’s 1903 The\nPrinciples of Mathematics. Since their research overlapped\nconsiderably, they began collaborating on what would eventually become\nPrincipia Mathematica. By agreement, Russell worked primarily\non the philosophical parts of the project, including the book’s\nphilosophically rich Introduction, the theory of\n descriptions,\n and the no-class theory (in which set or class terms become\nmeaningful only when placed in well-defined contexts), all of which\ncan still be read fruitfully even by non-specialists. The two men then\ncollaborated on the technical derivations. As Russell writes,\n\n\nAs for the mathematical problems, Whitehead invented most of the\nnotation, except in so far as it was taken over from Peano; I did most\nof the work concerned with series and Whitehead did most of the rest.\nBut this only applies to first drafts. Every part was done three times\nover. When one of us had produced a first draft, he would send it to\nthe other, who would usually modify it considerably. After which, the\none who had made the first draft would put it into final form. There\nis hardly a line in all the three volumes which is not a joint\nproduct. (1959: 74)\n\n\nInitially, it was thought that the project might take a year to\ncomplete. Unfortunately, after almost a decade of difficult work on\nthe part of the two men, Cambridge University Press concluded that\npublishing Principia would result in an estimated loss of 600\npounds. Although the press agreed to assume half this amount and the\nRoyal Society agreed to donate another 200 pounds, this still left a\n100-pound deficit. Only by each contributing 50 pounds were the\nauthors able to see their work through to publication. (Whitehead,\nRussell, & James 1910)\n\nPublication involved the enormous job of type-setting all three\nvolumes by hand. In 1911, the printing of the second volume was\ninterrupted when Whitehead discovered a difficulty with the symbolism.\nThe result was the insertion (on roman numeral pages) of a long\n“Prefatory Statement of Symbolic Conventions” at the\nbeginning of Volume II.\n\nThe initial print run of 750 copies of Volume I and 500 copies of each\nof Volumes II and II from Cambridge University Press had been sold by\n1922 when Rudolf Carnap wrote to Russell asking for a copy. Russell\nresponded by sending Carnap a 35 page handwritten summary of the\ndefinitions and some important theorems in the work (Linsky 2011:\n14–15). As no plates were available for a second printing,\nRussell began the work of preparing a second edition that appeared in\n1925–27. The first was reset along with a new introduction and\nthree appendices, and Volume II was reset as well. Volume III was\nreproduced by a photographic process, and so the page numbers from the\nfirst edition are the same in this volume. Principia\nMathematica is still in print with Cambridge University Press.\nAs\nwith many works in mathematics, the later progress of the field of\nsymbolic logic led to numerous improvements. Work in the\nschool of logic started by David Hilbert at Göttingen and in the\nPolish school of logicians led by S. Leśniewski and his most famous student, Alfred Tarski, began with correcting\nwhat they saw as defects and gaps in PM. See Kahle (2013) and Wolenski (2013). The criticisms were immediate,\nbegun by Chwistek (1912) soon after the first volume had been\npublished. A series of important new presentations of mathematical\nlogic, in particular Hilbert and Ackermann (1928), Hilbert and Bernays\n(1934), and Kleene (1952), were adopted as text books by successive\ngenerations of logicians. As pointed out in Urquhart (2013) this lead\nto a slow decline in the number of references to PM in technical work\nin logic, as well as its gradual replacement by other texts for the\nIntroduction to Symbolic Logic courses that soon became a staple\noffering of university departments of philosophy. By the 1950s PM was\nno longer used as a textbook, even in graduate courses. PM’s\ninfluence, then, was enormous from 1910 to 1950, with it now having\nthe status of a recognized classic that is unfamiliar to students of\nlogic, and even unreadable because of its superseded notation. This\nentry, together with the entry on \n the notation in Principia Mathematica,\n are intended to make the contributions of this monumental work\navailable, and to enable further research on some of the ideas hidden\nin those three long volumes.\n2.2 Significance of Principia Mathematica\n\nAchieving Principia’s main goal proved to be a\nchallenge. An initial response among mathematicians and logicians in\nGermany and Poland was to decry the decline in standards of formal\nrigor set by Frege. This complaint was voiced by Frege himself, in a\nletter to Philip Jourdain in 1912:\n\n\n…I do not understand the English language well enough to be\nable to say definitely that Russell’s theory (Principia\nMathematica I, 54ff) agrees with my theory of functions of the\nfirst, second, etc. levels. It does seem so. But I do not understand\nall of it. It is not quite clear to me what Russell intends with his\ndesignation \\(\\phi \\bang \\hat{x}\\). I never know for sure whether he\nis speaking of a sign or of its content. (Frege 1980: 78)\n\n\nThis claim that the notion of “propositional function” is\nsubject to use-mention confusions has persisted to this day. This\nentry will present a modernized version of the syntax of PM, combined\nwith an account of the notation for types in the works of Alonzo\nChurch (1974, 1976). Modern theories of types allow for a coherent\nsyntax for higher-order languages which many find adequate to meet\nthese objections. The complaint about the formulation of the syntax of\nPM was repeated and a further difficulty was expressed by Gödel\n(1944) in his influential survey of PM:\n\n\nIt is to be regretted that this first comprehensive and thorough-going\npresentation of a mathematical logic and the derivation of mathematics\nfrom it [is] so greatly lacking in formal precision in the foundations\n(contained in ∗1–∗21 of\nPrincipia) that it presents in this respect a considerable step\nbackwards as compared with Frege. What is missing, above all, is a\nprecise statement of the syntax of the formalism. Syntactical\nconsiderations are omitted even in cases where they are necessary for\nthe cogency of the proofs, in particular in connection with the\n“incomplete symbols”. These are introduced not by explicit\ndefinition, but by rules describing how sentences containing them are\nto be translated into sentences not containing them. To be sure,\nhowever, that (or for what expressions) this translation is possible\nand uniquely determined and that (or to what extent) the rules of\ninference apply to the new kind of expressions, it is necessary to\nhave a survey of all possible expressions, and this can be furnished\nonly by syntactical considerations. (Gödel 1944 [1951: 126])\n\n\nThe issue with respect to defined expressions, including the\n“incomplete symbols” for classes and definite descriptions\nwhich are explained below, is still problematic for interpreting PM.\nThe difficulty is that certain defined expressions such as the\nnotation for definite descriptions, class abstracts and even the\nidentity symbol ‘\\(=\\)’, are not specified in the initial\ndescription of the syntax of the theory, nor are they shown to be\nvalidly used as instances of the axioms with their apparent syntax.\nThe method of “contextual definition” used in PM is\ndifficult to formulate rigorously and is not used in contemporary\nlogical theories. The modern presentation of PM in this entry includes\nthe symbols for descriptions and classes, thus differing from the\ncompletely rigorous presentations of Church (1976), for example, who\navoids both definite descriptions and class expressions, and takes\nidentity as an undefined primitive.\n\nDespite these reactions to the rigor of the presentation, PM\nnevertheless was studied carefully by those interested in the new\nsymbolic logic including David Hilbert and those in his school in\nGöttingen (see Ewald & Sieg 2013: 3 and Chwistek 1912).\nPrimarily at issue were the kinds of assumptions Whitehead and Russell\nneeded to complete their project. Although Principia\nsucceeded in providing detailed derivations of many major theorems in\nfinite and transfinite arithmetic, set theory, and elementary measure\ntheory, three axioms in particular were arguably non-logical in\ncharacter: the axioms of infinity, reducibility and the\n“multiplicative axiom” or Axiom of Choice. The axiom of\ninfinity in effect states that there exists an infinite number of\nobjects. Arguably it makes the kind of assumption generally thought to\nbe empirical rather than logical in nature. The multiplicative axiom,\nlater added to Zermelo’s axioms as the Axiom of Choice, asserts\nthe existence of a certain set containing one element from each member\nof a given set. Russell objected that without a rule guiding the\nchoice, such an axiom was not a logical principle. The axiom of\nreducibility was introduced as a means of overcoming the not\ncompletely satisfactory effects of the\n theory of types,\n the mechanism Russell and Whitehead used to restrict the notion of a\nwell-formed expression, thereby avoiding Russell’s paradox.\nAlthough technically feasible, many critics concluded that the axiom\nwas simply too ad hoc to be justified philosophically.\nInitially at least, Leon Chwistek (1912) believed that it led to a\ncontradiction. Kanamori sums up the sentiment of many readers: \n\n\nIn traumatic reaction to his paradox Russell had built a complex\nsystem of orders and types only to collapse it with his Axiom of\nReducibility, a fearful symmetry imposed by an artful dodger. (2009:\n411) \n\n\nIn the minds of many, the issue of whether mathematics could be\nreduced to logic, or whether it could be reduced only to set theory,\nthus remained open.\n\nIn response, Whitehead and Russell argued that both axioms were\ndefensible on inductive grounds. As they tell us in the Introduction\nto the first volume of Principia,\n\n\nself-evidence is never more than a part of the reason for accepting an\naxiom, and is never indispensable. The reason for accepting an axiom,\nas for accepting any other proposition, is always largely inductive,\nnamely that many propositions which are nearly indubitable can be\ndeduced from it, and that no equally plausible way is known by which\nthese propositions could be true if the axiom were false, and nothing\nwhich is probably false can be deduced from it. If the axiom is\napparently self-evident, that only means, practically, that it is\nnearly indubitable; for things have been thought to be self-evident\nand have yet turned out to be false. And if the axiom itself is nearly\nindubitable, that merely adds to the inductive evidence derived from\nthe fact that its consequences are nearly indubitable: it does not\nprovide new evidence of a radically different kind. Infallibility is\nnever attainable, and therefore some element of doubt should always\nattach to every axiom and to all its consequences. In formal logic,\nthe element of doubt is less than in most sciences, but it is not\nabsent, as appears from the fact that the paradoxes followed from\npremisses which were not previously known to require limitations.\n(1910: 62 [1925: 59])\n\n\nWhitehead and Russell were also disappointed by the book’s\nlargely indifferent reception on the part of many working\nmathematicians. As Russell writes,\n\n\nBoth Whitehead and I were disappointed that Principia\nMathematica was only viewed from a philosophical standpoint.\nPeople were interested in what was said about the contradictions and\nin the question whether ordinary mathematics had been validly deduced\nfrom purely logical premisses, but they were not interested in the\nmathematical techniques developed in the course of the\nwork.…Even those who were working on exactly the same subjects\ndid not think it worth while to find out what Principia\nMathematica had to say on them. I will give two illustrations:\nMathematische Annalen published about ten years after the\npublication of Principia a long article giving some of the\nresults which (unknown to the author) we had worked out in Part IV of\nour book. This article fell into certain inaccuracies which we had\navoided, but contained nothing valid which we had not already\npublished. The author was obviously totally unaware that he had been\nanticipated. The second example occurred when I was a colleague of\nReichenbach at the University of California. He told me that he had\ninvented an extension of mathematical induction which he called\n‘transfinite induction’. I told him that this subject was\nfully treated in the third volume of the Principia. When I\nsaw him a week later, he told me that he had verified this. (1959:\n86)\n\n\nDespite such concerns, PM proved to be remarkably influential in at\nleast three ways. First, it popularized modern mathematical logic to\nan extent undreamt of by its authors. By using a notation more\naccessible than that used by Frege, Whitehead, and Russell managed to\nconvey the remarkable expressive power of modern predicate logic in a\nway that previous writers had been unable to achieve. Second, by\nexhibiting so clearly the deductive power of the new logic, Whitehead\nand Russell were able to show how powerful the idea of a modern formal\nsystem could be, thus opening up new work in what soon was to be\ncalled metalogic. Third, Principia Mathematica re-affirmed\nclear and interesting connections between logicism and two of the main\nbranches of traditional philosophy, namely\n metaphysics \n and epistemology,\nthereby initiating new and interesting work in both of these\nareas.\n\nAs a result, not only did Principia introduce a wide range of\nphilosophically rich notions (including\n propositional function,\n logical construction, and\n type theory),\n it also set the stage for the discovery of crucial metatheoretic\nresults (including those of Kurt Gödel, Alonzo Church, Alan\nTuring and others). Just as importantly, it initiated a tradition of\ncommon technical work in fields as diverse as philosophy, mathematics,\nlinguistics, economics and computer science.\n\nToday a lack of agreement remains over the ultimate philosophical\ncontribution of Principia, with some authors holding that,\nwith the appropriate modifications, logicism remains a feasible\nproject. Others hold that the philosophical and technical\nunderpinnings of the project remain too weak or too confused to be of\ngreat use to the logicist. (For more detailed discussion, readers\nshould consult Quine 1963, 1966a, 1966b; Landini 1998, 2011; Linsky\n1999, 2011; Hale and Wright 2001; Burgess 2005; Hintikka 2009; and\nGandon 2012.)\n\nThere is also lack of agreement over the importance of the second\nedition of the book, which appeared in 1925 (Volume I) and (Volumes II\nand III were directly reprinted from the first edition in 1927). The\nrevisions were done by Russell, although Whitehead was given the\nopportunity to advise. In addition to the correction of minor errors\nthroughout the original text, changes to the new edition included a\nnew Introduction and three new appendices. (The appendices discuss the\ntheory of quantification, mathematical induction and the axiom of\nreducibility, and the principle of extensionality respectively.) The\nbook itself was reset more compactly, making page references to the\nfirst edition obsolete. Russell continued to make corrections as late\nas 1949 for the 1950 printing, the year he and Whitehead's widow\nfinally began to receive royalties.\n\nToday there is still debate over the ultimate value, or even the\ncorrect interpretation, of some of the revisions, revisions that were\nmotivated in large part by the work of some of Russell’s\nbrightest students, including Ludwig Wittgenstein and Frank\nRamsey. Appendix B has been notoriously problematic. The appendix\npurports to show how mathematical induction can be justified without\nuse of the axiom of reducibility; but as Alasdair Urquhart\nreports,\n\n\nThe first indication that something was seriously wrong appeared in\nGödel’s well known essay of 1944, “Russell’s\nMathematical Logic”. There, Gödel points out that line (3)\nof the demonstration of Russell’s proposition\n∗89·16 is an elementary logical blunder, while the\ncrucial ∗89·12 also appears to be highly questionable.\nIt still remained to be seen whether anything of Russell’s proof\ncould be salvaged, in spite of the errors, but John Myhill provided\nstrong evidence of a negative verdict by providing a model-theoretic\nproof in 1974 that no such proof as Russell’s can be given in\nthe ramified theory of types without the axiom of reducibility.\n(Urquhart 2012)\n\n\nLinsky (2011) provides a discussion, both of the Appendix itself and\nof the suggestion that by 1925 Russell may have been out of touch with\nrecent developments in the quickly changing field of mathematical\nlogic. He also addresses the suggestion, made by some commentators,\nthat Whitehead may have been opposed to the revisions, or at least\nindifferent to them, concluding that both charges are likely without\nfoundation. (Whitehead’s own comments, published in 1926 in\nMind, shed little light on the issue.)\n3. Contents of Principia Mathematica\n\nPrincipia Mathematica originally appeared in three volumes.\n\n\n\n\n\n\n\n\nTitle page of the first edition of Principia Mathematica, Volume I (1910)\n\n\n\n\n\nCover of the first paperback issue of Principia Mathematica to ∗56 (1962)\n\n\n\n\n\n\n\nTogether, the three volumes are divided into six parts. The commentary\nthat follows will go through the sections in order, indicating in\nthe early parts where a reader can skip ahead to study the unique\nfeatures of the development of mathematics in the PM system as\ncontrasted with that of Frege and contemporary set theory.\n3.1 Volume I\n\nVolume I is divided into a lengthy Introduction in three\nsections, followed by two major Parts I (divided into Sections\nA–E) and II (also divided into Sections A–E):\n\nPreliminary Explanations of Ideas and Notations\nThe Theory of Logical Types\nIncomplete Symbols\nPart I: Mathematical Logic\n\n\nA. The Theory of Deduction\n∗1–∗5\nB. Theory of Apparent Variables\n∗9–∗14\nC. Classes and Relations\n∗20–∗25\nD. Logic of Relations\n∗30–∗38\nE. Products and Sums of Classes\n∗40–∗43\n\nPart II: Prolegomena to Cardinal Arithmetic\n\n\nA. Unit Classes and Couples\n∗50–∗56\nB. Sub-Classes, Sub-Relations, and Relative Types\n∗60–∗65\nC. One-Many, Many-One and One-One Relations\n∗70–∗74\nD. Selections ∗80–∗88\nE. Inductive Relations\n∗90–∗97\n\n\n3.2 Volume II\n\nVolume II begins with a preliminary section on notational conventions\nfollowed by Parts III (divided into Sections A–C), IV (divided\ninto Sections A–D), and the first half of Part V (Sections\nA–C):\n\nPrefatory Statement of Symbolic Conventions\nPart III: Cardinal Arithmetic\n\n\nA. Definition and Logical Properties of Cardinal Numbers\n∗100–∗106\nB. Addition, Multiplication and Exponentiation\n∗110–∗117\nC. Finite and Infinite\n∗118–∗126\n\nPart IV: Relation-Arithmetic\n\n\nA. Ordinal Similarity and Relation-Numbers\n∗150–∗155\nB. Addition of Relations, and the Product of Two Relations\n∗160–∗166\nC. The Principle of First Differences, and the Multiplication and\nExponentiation of Relations\n∗170–∗177\nD. Arithmetic of\nRelation-Numbers∗180–∗186\n\nPart V: Series\n\n\nA. General Theory of Series\n∗200–∗208\nB. On Sections, Segments, Stretches, and Derivatives\n∗210–∗217\nC. On Convergence, and the Limits of Functions\n∗230–∗234\n\n\n3.3 Volume III\n\nVolume III contains the remainder of Part V (Sections D–F) and\nconcludes with Part VI (divided into Sections A–D):\n\nPart V: Series (continued)\n\n\nD. Well-Ordered Series\n∗250–∗259\nE. Finite and Infinite Series and Ordinals\n∗260–∗265\nF. Compact Series, Rational Series, and Continuous Series\n∗270–∗276\n\nPart VI: Quantity\n\n\nA. Generalization of Number\n∗300–∗314\nB. Vector-Families ∗330–∗337\nC. Measurement ∗350–∗359\nD. Cyclic Families ∗370–∗375\n\n\n\nA fourth volume on geometry was begun but never completed (Russell\n1959: 99).\n\nOverall, the three volumes not only represent a major leap forward\nwith regard to modern logic, they are also rich in early\ntwentieth-century mathematical developments. To give one example,\nWhitehead and Russell were the first to define a series as a set of\nterms having the properties of being asymmetrical, transitive and\nconnected (1912 [1927: 497]). To give another, it is in\nPrincipia that we find the first detailed development of a\ngeneralized version of Cantor’s transfinite ordinals, which the\nauthors call “relation-numbers”. The resulting\n“relation-arithmetic” in turn led to significant\nimprovements in our understanding of the general notion of structure\n(1912: Part IV).\n\nAs T.S. Eliot points out, the book also did a great deal to promote\nclarity in the use of ordinary language in the early part of the\ntwentieth century:\n\n\nhow much the work of logicians has done to make of English a language\nin which it is possible to think clearly and exactly on any subject.\nThe Principia Mathematica are perhaps a greater contribution\nto our language than they are to mathematics. (1927: 291)\n\n\nThe book is also not without some self-deprecating humour. As\nBlackwell points out (2011: 158, 160), the authors twice poke fun at\nthe length and tedium of the project’s many logical derivations.\nIn Volume I, the authors explain that one cannot list all the\nnon-intensional functions of \\(\\phi \\bang \\hat{z}\\) “because\nlife is too short” (1910 [1925: 73]); and in Volume 3, after\nover 1,800 pages of dense symbolism, the authors end Part IV, Section\nD, on Cyclic Families, with the comment,\n\n\nWe have given proofs rather shortly in this Section, particularly in\nthe case of purely arithmetical lemmas, of which the proofs are\nperfectly straightforward, but tedious if written out at length. (1913\n[1927: 461])\n\n\nEvidence that the humour originates more with Russell than with\nWhitehead is perhaps found in not dissimilar remarks that appear in\nRussell’s other writings. Russell’s comment when\ndiscussing the axiom of choice, to the effect that given a collection\nof sets, it is possible to “pick out a representative\narbitrarily from each of them, as is done in a General Election”\n(1959: 92), is perhaps a case in point.\n\nReaders today (i.e., those who have learned logic in the last few\ndecades of the twentieth century or later) will find the book’s\nnotation somewhat antiquated. Readers wanting assistance are advised\nto consult the entry on the\n notation in Principia Mathematica.\n Even so, the book remains one of the great scientific documents of\nthe twentieth century.\n4. Volume I\n4.1 Part I: Mathematical Logic\n4.1.1 Propositional Logic in PM\n\nThe system of propositional logic of PM, can be seen as a\nsystem of sentential logic consisting of a language, and\nrules of inference. PM contains the first presentation of symbolic\nlogic that deals with propositional logic as a separate theory. Frege\nhad involved quantification from the beginning, while Peano’s\nsystem was interpretable as about propositions and classes with some\ndifferent principles holding for each interpretation. The\npropositional logic of PM is unusual for modern readers, for various\nreasons having to do with its origins in Russell’s earlier work\non logic. One is that the axioms of propositional logic are not stated\nusing only the primitive connectives of the logic, which are \\(\\lnot\\)\nand \\(\\lor\\), but instead only use \\(\\lor\\), and \\(\\supset\\) which is\na defined connective.\n\nIn this section we will use A, B, etc as meta-linguistic\nvariables for formulas. The formulas constructed from atomic\npropositions with the connectives are said to express elementary\npropositions to distinguish them from propositions involving\nquantifiers and propositional functions. The system is organized\naxiomatically, the axioms, called “primitive propositions”\nor “Pp”, are presented with the characteristic\n‘\\(\\supset\\)’ of material implication, which is defined\nwith \\(\\lnot\\) and \\(\\lor\\). The connectives \\(\\amp\\) and \\(\\equiv\\)\nare also defined, but not needed in the statements of the axioms. This\npeculiarity has its origins in Russell’s view from 1903 that\n\n\n\nThe propositional calculus is characterized by the fact that all its\npropositions have as hypothesis and as consequent the assertion of a\nmaterial implication. (1903: 13) \n\n\nAll of the “primitive propositions” of PoM are stated with\nonly material implication as a primitive connective. The connectives\n\\(\\amp\\),\\(\\lor\\) and \\(\\equiv\\), are defined as might be expected.\nThe notion of negation, expressed by \\(\\lnot\\), is defined using a\nnotion of quantification over propositions ( \\(\\lnot A\\) means that\nA implies all propositions). By 1906 Russell had decided to use\n\\(\\lnot\\) as a primitive connective, and no longer used propositional\nquantifiers, allowing \\(\\supset\\) to be defined, while the primitive\npropositions were still stated with \\(\\supset\\) and \\(\\lor\\). That the\nsystem of propositional logic in PM was the result of an evolution of\nchanges in choices of primitives is mirrored in the choice of theorems\nthat are proved in the first chapters. While most are proved because\nthey will be used later in PM, some remain simply as remants of the\nearlier systems. In particular PM contains several theorems that were\nprimitive propositions in earlier systems, though not used in what\nfollows. In fact one primitive proposition of PoM, known as\n“Peirce’s Law (\\([(p \\supset q )\\supset p ] \\supset p\\))\nappears to have been proved in an early version of PM as\n∗2·7 but simply deleted (and its number not\nreassigned to another theorem) simply to save space (see Linsky\n2016).\n\nThe notion of truth-functional semantics for propositional\nlogic, using the familiar truth tables, and the notion of\ncompleteness of an axiom system, was not developed until soon\nafter the publication of PM by Bernays (1926). As a result there is no\nattempt to find a short list of axioms that will be complete, and so\nat later stages of the work there is no simple appeal to\n“tautological consequences” which might be easily\njustified by semantic considerations.\n\nThe language of propositional logic in PM consists of a vocabulary\nconsisting of:\n\nAtomic proposition variables: p, q, r,\n\\(p_1\\), … (There are no proposition constants.)\nSentential connectives. Primitive: \\(\\lnot\\) and \\(\\lor\\).\nDefined: \\(\\supset\\), \\(\\amp\\), \\(\\equiv\\).\nPunctuation: \\((\\), \\()\\), \\([\\), \\(]\\), \\(\\{\\), \\(\\}\\), etc.\n\n\nThe well formed formulas (wffs) are defined as follows:\n\nAtomic proposition variables are wffs.\nIf A and B are wffs then so are: \\(\\lnot\nA\\) and \\(A \\lor B\\)\n\n\nThe other familiar connectives are defined:\n\nDefinitions \n\n\\[\\begin{align}\n\\tag*{∗1·01} {A \\supset B} & \\eqdf \\lnot {A  \\lor B}\\\\\n\\tag*{∗3·01} {A \\amp B}   & \\eqdf {\\lnot(\\lnot  A  \\lor \\lnot B})\\\\\n\\tag*{∗4·01}({A \\equiv B}  & \\eqdf  {(A \\supset B)  \\amp (B \\supset A)}\\\\\n  \\end{align}\n  \\]\n\n \n\nAxioms \n\n\\[\\begin{align}\n\\tag*{Pp ∗1·2} (p \\lor p )  & \\supset  p\\\\\n\\tag*{Pp ∗1·3} q  & \\supset  (p  \\lor q )\\\\\n\\tag*{Pp ∗1·4} (p   \\lor  q )   & \\supset   (q   \\lor  p)\\\\\n\n\\tag*{Pp ∗1·5} [p \\lor ( q \\lor r )] & \\supset [q\n\\lor ( p \\lor r )]\\\\\n\n\\tag*{Pp ∗1·6} ( q \\supset r ) & \\supset [ (p \\lor q\n) \\supset (p \\lor r ) ]\\\\ \\end{align}\\]\n\n \n\n\nIn 1926 Paul Bernays showed that this could be reduced by one, as\naxiom 4 (∗1·5) can be proved from the\nothers.\n\nRules of inference:\n\n\nModus ponens (∗1·1): From\n\\(\\vdash A \\supset B\\) and \\(\\vdash A\\), derive \\(\\vdash B\\)\nSubstitution: From \\(\\vdash A\\) derive \\(\\vdash A'\\)\nwhere \\(A'\\) is the result of substituting some formula B\nuniformly for any atomic proposition variable that occurs in\nA.\n\n\n\nThere is no explicit statement of a rule of substitution in PM. The\nfree variables in the propositional logic of PM may be interpreted as\nschematic letters, and so the system will require a rule of\nsubstitution of formulas. In this article they are to be interpreted as\nreal variables ranging over propositions, in which case instances\nwould be derived by instantiation from generalizations over all\npropositions. The announcement in the Introduction that propositions\nare not necessary in what follows and so will be avoided suggests the\nschematic interpretation of the variables. We follow the variable\ninterpretation in this article, however, in part to allow our notation\nto follow PM, with p’s and q’s rather than a\nnew vocabulary of schematic letters A, B, etc. This\ninterpretation of the letters as variables will also assist in the\npresentation of quantificational logic in PM below.\n\nAs is standard for an axiomatic formulation of logic, a\nderivation of a formula of sentential logic in PM will\nconsist of an instance of one of the six axioms, the result of a\nsubstitution in a preceding line, or the application of modus ponens\nto two preceding lines. Theorems of PM will be proved in order,\nallowing the use of (instances of) preceding theorems as lines in\nlater derivations.\n\nThe resulting system is complete, in the sense that all and only\ntruth-functionally valid sentences are derivable in the system. This\ndespite the seeming defects of the system by modern standards,\nincluding the redundancy of one of the axioms, the use of defined\nsymbols in expressions to which the rules of inference apply, and the\nuse of defined symbols in the axioms. The derivations in\n∗2 to ∗5 are abbreviated, but\nwith an indication on the side of each line of what justifies it, and\nhow any abbreviation can be undone. Theorems are proved primarily as\nneeded in later numbers, but some were axioms, or important theorems\nof earlier versions of propositional logic, going back to The\nPrinciples of Mathematics. Aside from historical interest in\ntheir actual choices, however, the system of PM can be viewed as based\non any standard system of propositional logic.\n4.1.2 The “Ramified” Theory of Types\n\nThe theory of types in the initial chapters of PM is\nramified, so that within a given type, of propositions, or of\nfunctions of individuals, and functions of functions of individuals,\nthere will be finer subdivisions. This ramification is necessary for\nthe application of the logic of PM to what what are called\n“epistemological” paradoxes in the Introduction to PM. The\nmost prominent of these is the (propositional) Liar paradox created by\nthe proposition that all propositions of a certain sort, say asserted\nby Epimenides, are false, when that very proposition is of that sort,\nthat is the only proposition that Epimenides asserted. The solution in\nthe ramified theory of types requires that a proposition about a sort\nof first level propositions, say that they are all false, will itself\nbe of the next order.\n\nThe paradoxes of the theory of sets are resolved by reducing\nassertions about sets to assertions about propositional functions. The\nrestriction that a function of one type cannot apply to a function of\nthe same type is enough to block the paradoxes. Thus the distinction\nbetween individuals, functions of individuals, and functions of such\nfunctions, categorized by what came to be called “simple theory\nof types” is enough for the purposes of reducing mathematics to\nclasses, and so to logic. The idea that the full theory of types was\nnot needed to resolve the mathematical or set theoretical paradoxes\nwas proposed by Chwistek (1921) and Ramsey (1931), and led to the\nlater introduction of the terms “ramified theory of types”\nand “simple theory of types” that will be used in this\nentry.\n\nIn the Introduction to PM terminology is introduced for the two ways\nthat variables may appear in formulas. The “apparent\nvariables” are bound variables, whereas “real\nvariables” are free variables. The proper\ninterpretation of higher-order variables in PM is the subject of\ncontemporary dispute among scholars of PM. Landini (1998) and Linsky\n(1999) offer two rival accounts. Landini holds that higher-order free\nvariables should be interpreted as schematic letters, replaceable by\nformulas, and that the bound variables are to be interpreted\n“substitutionally”. The logic of the theory of types in PM\ncan be seen as an extension of a theory of a standard first order\nlogic developed in ∗10. Then the more distinctive\nnotions of PM that depend on the theory of types can be explained.\nThese include the Axiom of Reducibility, in ∗12\nwhich underlies the so called ramification of the theory of\ntypes, the division into orders of predicates true of a\nsingle type of argument. The Axiom of Reducibility asserts that for an\narbitrary function of any order there is an equivalent\npredicative function, that is, one true of exactly the same\nrange of arguments. This will be explained below. Identity is defined,\nin ∗13, with a version of Leibniz’ notion of\nthe identity of indiscernibles that is consistent with the theory of\ntypes. Replacing Leibniz’ notion that x and y are\nidentical just in case they share the same properties, in PM, x\nand y are identical if and only if they share the same\npredicative functions.  Then using the notion of identity so defined,\nPM presents Russell’s theory of definite descriptions, precisely\nas it was defined in “On Denoting” (1905). This article\nwill use the notation for “r-types” due to Alonzo\nChurch 1976, which is explained in the accompanying article “The\nNotation of Principia Mathematica” in this\nEncyclopedia.\n\nAlthough PM does not single out first order logic from the whole\nramified theory of types, the actual deductive apparatus on the page\nlooks exactly like a system of first order logic, and the\ncomplications of the logic of higher types can be expressed with an\nadditional apparatus of type indices. In what follows we will use the\nsystem of r-types in Church (1976) for type indices, and the\nuse of lambda operators for propositional functions.\n\n\n\nChurch’s (1976) formulation of the logic of PM with\nr-types The language of the higher-order\nquantificational logic of PM is called ramified type theory,\nand the system of types, following Church (1976) will be called\nr-types. Note that there are two kinds of variables, but they\nare all assigned to an r-type. Individual variables behave as a\nspecial case of propositional function variables.\n\n(argument) variables: \\(x_{\\mathbf{\\tau}}\\),\n\\(y_{\\mathbf{\\tau}}\\), \\(z_{\\mathbf{\\tau}}\\), …for each type\n\\(\\tau\\)\nn-place propositional function variables:\n\\(\\phi_{\\tau}^{n}, \\psi_{\\tau}^{n}\\), …(\\(n \\geq 1\\)), where\n\\(\\tau\\) is a type symbol. (\\(R^n,S^n, \\ldots\\) (\\(n \\geq 1\\)) for\nrelations in extension.) \\(\\chi\\) is used for a higher-order\nfunction of functions, as in \\(\\chi (\\phi)\\), and \\(\\Phi\\) for the\nnext order, as in \\(\\Phi (\\chi)\\)\nconnectives: \\(\\lnot\\), \\(\\lor\\)\npunctuation: \\((\\), \\()\\), \\([\\), \\(]\\), \\(\\{\\), \\(\\}\\), etc.\nthe quantifier symbols: \\(\\forall\\) and \\(\\exists\\).\nthe lambda symbol: \\(\\lambda\\)\n\n\nThe system of symbols for r-types and the assignment of\nr-types to variables for different entities (individuals and\nfunctions) is as follows:\n\n\\(\\iota\\) is the r-type for an individual.\nWhere \\(\\tau_1 , \\ldots, \\tau_m\\) are any r-types, then\n\\((\\tau_1 , \\ldots, \\tau_m) / n\\) is the r-type of a\npropositional function of level n; this is the r-type\nof any m-ary propositional function of level n,\nwhich has arguments of r-types \\(\\tau_1 , \\ldots, \\tau_m\\),\nrespectively.\n\n\nThe order of an entity is defined as follows:\n\nthe order of an individual (of r-type \\(\\iota\\))\nis 0\nthe order of a function of r-type \\( (\\tau_1,  \\ldots,\n\\tau_m  ) / n  \\) is \\(n+N\\) where N is the greatest of the orders of\nthe arguments \\(\\tau_1 \\ldots, \\tau_m\\)\n\n\nThere are no predicate or individual names in this language. There\nare, however complex terms for propositional functions, defined\ntogether with formulas (with the usual notion of bound and free\nvariables):\n\nLet the expressions \\(\\phi_{\\tau}\\) be  variables ranging over propositional\nfunctions of type \\(\\tau\\). We read \\(x_{\\tau}\\) as a metalinguistic\nvariable ranging over variables of r-type \\(\\tau\\). The\nsubscript \\(\\tau\\) will be indicated only with the initial quantifier\nwhich governs the variable.\n\nWe then can define the well formed formulas (wffs) and\nterms of quantificational logic as follows:\n\nVariables (for individuals and propositional functions) are\nterms.\n\n\nIf \\(\\phi_{\\tau}^{n}\\) is an n-place propositional function\nvariable of r-type \\((\\tau_1 \\ldots, \\tau_n) /k\\) and\n\\(x_{i} \\) for \\( ( 0 \\leq i \\leq n ) \\) are terms of of r-types \\(\\tau_1 \\ldots,\n\\tau_n\\), respectively, then \\(\\phi (x_1, \\ldots x_n)\\) is a\nwff.\n\n(The variables \\(x_n\\) are called “argument” variables.\nThey will include individual variables of r-type\n\\(\\iota\\), but also variables of higher types. The variable \\(\\phi\\)\ncan occur as a predicate in \\(\\phi(x)\\) and as an argument in \\(\\Psi\n(\\phi)\\), and cannot be of type \\(\\iota\\) to occur in a\nwff.)\n\n\nIf x is a variable of type \\( \\tau \\) and A is\na wff then \\(\\lambda x A\\) is a term\nof r-type \\((\\tau)/n\\) (where n is one more than the\nhighest order of any bound variable in A and at least as high\nas the order of any free variable in A).\n\n\nIf x is an individual variable of type \\(\\tau\\) and A is\na wff in which x occurs \\(free\\) then \\(\\forall x A\\) and\n\\(\\exists x A\\) are wffs.\n\n\nIf A and B are wffs, then so are \\(\\lnot A\\), \\(A \\amp\nB\\), \\(A \\lor B\\), \\(A \\supset B\\), and \\(A \\equiv B\\).\n\nThe conventional precedence ordering of connectives will allow for\nfewer punctuation signs to indicate scope of connectives, thus \\(A\n\\lor B \\supset C\\) is read as \\(( A \\lor B) \\supset C\\)\n\n\nThe comprehension principle for a system of higher-order logic, or set\ntheory, states which formulas express a property or set. Within a type\ntheory this allows for what looks like an “unrestricted”\ncomprehension principle, in that for every well formed expression\nA with a free variable, x, there is a property which is\nsatisfied by precisely the entities satisfying the formula. It is the\nrestrictions of types that block the paradoxes, as the problematic\nformulas “is not a member of itself” and “does not\napply to itself” are ruled out by the system of types. The\ncomprehension principle then is characterized by an infinite set of\nsentences of the form of:\n\n\nComprehension:  \n\n\\[\\exists \\phi \\forall x_{\\tau} [ \\phi (x) \\equiv A], \\quad (\\phi \\textrm{  not free in } A)\\]\n\n\nwhere \\(\\phi\\) is a functional variable of r-type \\((\\tau)/n\\)\nand x is a variable of r-type \\(\\tau\\), and the bound\nvariables of A are all of order less than the order of \\(\\phi\\)\nand the free variables of A are all of order not greater than\nthe order of \\(\\phi\\).\n\n\n\n\nAs presented here Church’s seemingly straightforward\ncomprehension principle, with its restrictions on the types of\nvariables, is for Quine a glaring manifestation of the confusion of\nuse and mention of language that he sees infecting PM:\n\n\n…there is a characteristic give and take between sign and\nobject: the propositional function gets its order from the abstractive\nexpression, and the order of the variable is the order of the values.\nExposition is eased by allowing the word ‘order’ a double\nsense, attributing orders at once to the notations and, in parallel,\nto their objects. (Quine 1963: 245)\n\n\nThe offense comes from attributing orders (r-types) to\npropositional functions on the basis of the variables with which they\nare defined, but also to the functions themselves, as simply values of\nbound higher-order variables. In response, the defender of type theory\nmust say that any semantic intrepretation of the notion of\npropositional function will have to attribute to functions these\ndistinctions that are marked in linguistic expressions of some of\nthem, and in particular, the variables involved in their\ndefinition.\n\nWhat follows in PM up to ∗12 is a presentation of\nquantificational logic in the ramified theory of types. The\ncomplications are due to the decision of the authors (surely on\nRussell’s insistence) to add a new section\n∗9 which allows the earlier theory of\npropositional logic to be incorporated directly into a\nquantificational logic as is done in contemporary logic. This shows\nthe extent to which the earlier theory is indeed a theory of\npropositions, not an account of a fragment of\nquantificational logic allowing open sentences containing free\nvariables.\nQuantificational Logic in PM\n\nSection ∗10 formulates quantificational logic as\nit is currently formulated, namely the axioms and theorems of\npropositional logic are assumed to hold for all formulas, and not just\nthe elementary propositions of ∗1–5. It\nappears that Russell became concerned about this assumption, and so a\nnew section ∗9 was introduced to derive the\nprinciples of quantification theory from elementary propositions\nalone. While of interest to scholars of PM, the upshot is the same for\nlater uses of quantificational logic in PM.\n\nAgain, the reader interested in what distinguishes the logicist\nproject in PM can skip this section, although passing attention may be\npaid to the system of higher-order logic that is used, as based here\non the ramified theory of types. \n\nThe extension to functions of more than one variable is obvious, and\nbelow, some applications will employ this extension.\n\nThe existential quantifier and the other familiar connectives\n\\(\\supset\\), \\(\\amp\\) and \\(\\equiv\\) are defined as for propositional\nlogic. (In what follows A is now an arbitrary (possibly\nquantificational) formula): \n\n\\[\n\\tag*{∗10·01} \\exists x A  \\eqdf  \\lnot \\forall x \\lnot  A\n\\]\n\n\nAxioms of ∗10: All instances of propositional\ntheorems where wffs are uniformly substituted for propositional\nvariables.\n\n\nThe system of PM uses a rule of Universal Generalization and an Axiom\nwhich amounts to a rule of Instantiation. \n\n\\[\n\\tag*{∗10·1} \n\\vdash \\forall x_{\\tau} A  \\supset  A'\n\\]\n\n\nwhere \\(A'\\) is like A except for having a term y of\ntype \\(\\tau\\) substituted for \\(x_{\\tau}\\) in A.\n\n(Note: The notion of suitable “substitution” is much more\ncomplicated for logic of higher types than it is for first order\nlogic. In part this is because of the application to an argument of\nlambda expressions for a propositional function, e.g., \\([\\lambda x\n\\phi (x)] (\\nu)\\) where \\(\\nu\\) may be a complex term involving\nvariables and quantifiers in other lambda expressions.)\n\n\\[\n\\tag*{∗10·11}\n \\textrm{If } \\vdash A \\textrm{ then } \\vdash \\forall x_{\\tau} A'\n\\]\n\n\nwhere \\(A'\\) is like A except for having a term y of\ntype \\(\\tau\\) substituted for x in A\n\nOther quantifier principles, which govern the move of a quantifier\nfrom the inside of a formula to governing the entire formula, so\ncalled “quantifier containment principles” are also\nderived as theorems in ∗10. Some that are often used in later\nnumbers are: \n\n\\[\n\\begin{align}\n\n\\tag*{∗10·12} \\forall x_{\\tau} ( A \\lor \\phi (x ) )\n& \\supset (A \\lor \\forall x_{\\tau} \\phi (x ))\\\\\n\n\\tag*{∗10·21} \\forall x_{\\tau} [ A \\supset \\phi (x ) ]\n& \\equiv [A \\supset \\forall x_{\\tau} \\phi (x)]\\\\ \n\n\\end{align}\\]\n\n\nThe introduction to ∗10 in PM begins with:\n\n\nThe chief purpose of the propositions of this number\n[∗10] is to extend to formal implications\n(i.e. to propositions of the form \\(\\forall x (\\phi x \\supset\n\\psi x)\\) as many as possible of the propositions proved previously\nfor material implications, i.e. for propositions of the form\n\\(p \\supset q\\). (notation updated)\n\n\nIn other words, this section introduces the logic of quantification,\nin a way that is familiar to contemporary logic. The propositional\nlogic of the preceding sections is interpreted as true only of\nelementary, first order propositions, and so extended to higher-order\nlogic by showing how sentences can be presented in “prenex\nform”, that is with quantifers in intial position preceding a\nquantifier free matrix. These theorems are familiar now as\n“quantifier confinement” theorems, of the form of:\n\n\\[\n\\tag*{∗10·23} \\forall x_{\\tau} [ \\phi (x ) \\supset A ] \\equiv [ \\exists x_{\\tau} \\phi (x)]  \\supset A \n\\]\n\nThe Axiom of Reducibility\n\nGiven that the system of PM contains a ramified theory of types,\nhowever, the move to discussion of classes for the remainder of the\nwork after ∗20 requires a further axiom, the axiom\nof reducibility, in order to allow a simple theory of types of\nclasses. Consider the fundamental notion from the theory of real\nnumbers of the least upper bound (l.u.b.) of a\nbounded class of real numbers. Consider the class of all real numbers\nwhose square is less than or equal to 2, i.e., \\(\\{ x \\mid x^2 \\leq\n2\\}\\). A class of reals S has an upper bound if and\nonly if \\(\\exists r \\forall s ( s \\in S \\supset s \\leq r)\\). If a\nbounded class S of real numbers has members of some\nr-type \\(\\tau\\), then the least upper bound must belong to an\nr-type \\(\\tau / 1\\) because of the quantifier in the definition\nranging over the elements s of S. We say that the\ndefinition of S is “impredicative” because it\ninvolves quantification over a totality to which it is intended to\nbelong. The theory of real numbers, however, requires that sometimes\nthe least upper bound of a class is a member of that class, in this\ncase, the least upper bound of S, namely \\(\\sqrt{2}\\), is an\nelement of S.\n\nThe resolution of this in the system of PM is to adopt an axiom which\nguarantees that any class defined in terms of another class will be of\nthe same type. Thus impredicative definitions of classes are allowed,\nand do not introduce a class of a higher type. This is accomplished by\nadopting the Axiom of Reducibility, in ∗12, which\nguarantees that for any function \\(\\phi\\), there will be a\nco-extensive predicative function. More precisely, the Axiom\nof Reducibility asserts that for any function of any number of\narguments of an arbitrary level, there is an equivalent function of\nlevel 1, ie. one true of the same entities:\n\n\nAxiom of Reducibility,  \n\n  \\[\n  \\tag*{Pp ∗12·1}\n  \\forall \\psi \\exists \\phi \\forall x_{\\tau} [\\psi (x) \\equiv \\phi \\bang(x) ]\n  \\]\n\n\nwhere \\(\\phi \\bang\\) is a predicative function.\n\n\nThe exclamation mark “\\(\\bang\\)” is used in PM to indicate\npredicative functions. In Church’s system of\nr-types this is expressed by saying that the variable x\nis of r-type \\(\\tau\\) and \\(\\phi\\) is of r-type \\((\\tau\n)/1\\) and \\(\\psi\\) is of r-type \\((\\tau) /n\\). In other words,\n\\(\\phi\\) is of the lowest order compatible with its arguments. This\nnotion of predicative functions is taken from the Introduction. In\n∗12 Whitehead and Russell propose a narrower\nconception of predicative function, by which \\(\\phi\\) must be a\nmatrix, or function in the definition of which no quantifiers\nat all appear. See the accompanying entry on \n the notation in Principia Mathematica.\n\n\nIt has seemed to some, beginning with Chwistek (1912) and continuing\nthrough Copi (1950) that the Axiom of Reducibility is technically\nfaulty, leading to an inconsistency, or at least redundancy in the\nsystem of PM. Ramsey (1931) early on argued that the supposed\ncontradiction in fact demonstrated that certain predicative functions\nare indefinable. Church (1976), confirms this assessment, and uses the\npresentation of r-types we describe here to show rigorously the\nlimitations on what functions are definable in the system of PM.\n\nThe interaction of this Axiom with the theory of classes in PM will be\nexplained below in connection with ∗20 on\nclasses.\nIdentity in PM\n\nContemporary logic follows Frege in treating identity,\nrepresented by \\(=\\), as a logical notion. In PM the notion of\nidentity is defined following Leibniz as indiscernibility, namely\nindiscernible objects are identical. That is, \\(\\forall \\phi ( \\phi x\n\\equiv \\phi y) \\supset x = y\\). But since the axiom of reducibility\nguarantees that if there is any type of function on which x and\ny differ, they will differ on some predicative function, PM\nuses the following definition of identity: \n\n\\[\n\\tag*{∗13·01}\nx_{\\tau} = y_{\\tau} \\eqdf  \\forall \\phi [ \\phi \\bang (x) \\supset \\phi \\bang(y) ],\n\\]\n\n\nfor \\(\\phi \\bang\\) a predicative function.\n\nIn contemporary systems of logic an axiom or rule of inference allows\nthat if \\(x = y\\), then for any predicate \\(\\phi\\), \\(\\phi x \\equiv\n\\phi y\\). In other words, identicals are indiscernible. The given\ndefinition of identity only suffices if it is not possible that\nentities x and y which share all predicative properties,\ncannot be distinguished by some property of a higher order. The axiom\nof reducibility guarantees that x and y sharing\nproperties of any given higher order will entail sharing predicative\nproperties, and so by the definition of identity, \\(x =\ny\\).\n\nIn the appendix B to the second edition of PM, which was written by\nRussell, there is a technical discussion of the consequences of\nabandoning the axiom of reducibility. A faulty proof is proposed to\nshow that the principle of Induction can be derived without using the\naxiom of reducibilty in a modified theory of types (see Linsky 2011).\nAs Russell points out, however, it is not possible to define real numbers using “Dedekindian” classes\nof rational numbers without assuming the axiom of reducibility. (The\nthesis that every class of reals with an upper bound has a real number\nas its least upper bound, discussed above, would not be provable.) As\na result, Russell says “analysis would collapse”. In all\nof this discussion, however, Russell does not indicate what would\nreplace the definition of Identity in ∗13, which\nso crucially depends on the axiom of reducibility.\nDefinite Descriptions\n\nRussell presented his theory of definite descriptions in “On\nDenoting” (1905) and it has probably been the most widely\ndiscussed application of the logic of PM. The role of the theory of\ndefinite desciptions in PM, however, is exhausted by its use in\n∗30 to define what are called “Descriptive\nfunctions”. In contemporary logic it is routine to show how the\nnotion of a “functional relation” can be used to justify\nthe introduction of function symbols into a language with only\nn-place predicates. The theory of definite descriptions is\nessential for this argument. After ∗30 there are\nonly a handful of occurrences of description operators in PM. What is\nperhaps Russell’s most valuable contribution to philosophical\nlogic and the philosophy of language, is, here, only a device used for\na technical, though programatically important, purpose. The technical\npurpose, however, does indicate an important distinction between the\nlogicism of Frege and Russell. Frege’s logic is based on the\nnotion of concept, which is a case of a function from objects to truth\nvalues. Russell’s logic can be seen as further reducing the\nmathematical notion of function to his logical notion of\npropositional function. Some logicians firmly in the\ntradition of mathematical logic do not find this to be an advance, but\nit does indicate a significant difference between the approaches of\nFrege and Russell (see Linsky 2009).\n\nDefinite descriptions are expressions of the form “the\n\\(\\phi\\)” which occur in the position of terms apparently as the\narguments of functions. Russell’s example from “On\nDenoting” (1905) is the expression “The present King of\nFrance” which apparently occurs as an argument to the function\n“is bald” in the sentence “The present King of\nFrance is bald”. In general the expression “the \\(\\phi\\)\nis \\(\\psi\\)” is defined as equivalent to the expression\n“There is exactly one \\(\\phi\\) and it is \\(\\psi\\)”:\n\n\nContextual definition of Definite Descriptions \n\n\n\n\\[ \n \\tag*{∗14·01}\n \\psi ( \\imath x  \\phi (x) ) \\eqdf  \\exists x \\forall y \\{ [  \\phi ( y)  \\equiv y = x ] \\amp  \\psi (x)\\}\n\\]\n\n\n\nThe use of the expression \\(\\eqdf\\) which makes it appear that both\nflanking expressions are terms, disguises the fact that in this case\nof a “contextual definition” what occurs on each side \nare formulas, the right hand side replacing the left hand side, thus\n“eliminating” the definite description.\n\nTo distinguish the two readings of the expression “The present\nKing of France is not bald”, according to the\n“scope” of the description (with respect to negation), PM\nuses a “scope indicator” \\( [ \\imath x \\phi ( x )]\\) before\nthe formula from which the description is to be eliminated by the\ndefinition above. Symbolize “The present King of France”\nas \\(\\imath x K(x)\\) and “x is bald” as \\( B(x)\\), the two\nreadings will be symbolized as: \n\n\\[[\\imath x K(x)] \\lnot B(\\imath x K(x)),\\] \n\n\nwhich, eliminating the description by definition, becomes: \n\n\\[ \\exists x \\forall y  \\{ [K(x)  \\equiv y = x ] \\amp \\lnot   B(x) \\} \\]\n\n\nwhich is the reading on which there is exactly one present King of\nFrance and he is not bald, and: \n\n\\[\\lnot [\\imath x K(x)]B(\\imath x K(x)),\\]\n\n\nwhich, eliminating the description by definition, becomes:\n\n \\[ \\lnot ( \\exists x \\forall y  \\{ [K(x)  \\equiv y = x ] \\amp B(x) \\} )\\]\n\n\nThe latter is the reading on which it is not the case that there is\none and only one present King of France and he is bald. That may be\ntrue if there is not exactly one present King of France, as is\nactually the case, as France has no King. In such a case the\ndescription is not “proper”, which is expressed with a\nspecial symbol in PM, \\(E\\bang\\), defined as:\n\n\nproper description \n\n\\[\n\\tag*{∗14·02}\nE\\bang (\\imath x \\phi (x))  \\eqdf  \\exists x \\forall y [ \\phi (y)  \\equiv y = x ]\n\\]\n\n\n\n\n\n\nIn theorem ∗14·3 we find one of the rare\noccurrences of bound variables ranging over propositions p and\nq of functions that are not predicative. (Suppose that p\nand q are of some r-type \\(()/n\\) and f is a\nfunction of those propositions, f might have r-type\n\\((()/n)/m\\) for \\(m, n > 1\\)). Here we also see an occurrence of a\nformula \\(\\imath x \\phi (x)\\) in subject position expressing a proposition as\nan argument of such a function. These expressions do not figure in\ntheorems later in PM and only occasionally in the introductory\nmaterial of some sections. Theorem ∗14·3\nasserts that in truth-functional contexts the scope of a (proper)\ndescription does not effect the truth value of a proposition in which\nit occurs: \n\n\\[\n\\tag*{∗14·3}\n\\begin{align}\n\\{  \\forall p \\forall q [ ( p \\equiv q ) \\supset (\\Phi(p) \\equiv \\Phi(q) )] \\amp E\\bang ( \\imath x \\phi(x) ) \\} \n\\supset  \\\\\n\\{  \\Phi [\\imath x \\phi (x) ]\\chi(\\imath x \\phi (x) )\\equiv [\\imath x \\phi (x)]  \\Phi(\\chi(\\imath x \\phi (x ))) \\}\n\\end{align}\n\\]\n\n\nThis theorem is another indication of the way in which the\nphilosophical basis of PM, with its propositional functions that are\nintensional is left behind as the mathematical content of PM is\nintroduced with the definition of classes in the next sections.\nThe “No-Classes” Theory of Classes\n\nThe theory of sets (classes) in PM is based on a number of\ncontextual definitions, similar in some ways to the theory of\ndescriptions. In what follows we will occasionally use the expression\n“class” for the PM notion, to remind the reader of the\ndifferences between this and an axiomatic theory of sets, such as ZF,\nnot to indicate that these are “proper classes” in the\nsense used in ZF or VGB class theory, to indicate an expression that\ndoes not define a set, such as \\(\\{ x \\mid x = x \\}\\), which is true\nof the universe \\(\\rV\\) and so too “large” to be\na set.\n\nThe basic definition eliminates terms for classes from contexts in\nwhich they occur, just as the theory of definite descriptions\neliminates descriptions occuring in the positions of terms:\n\n\nContextual definition of classes \n\n\\[\n \\phi \\{x \\mid  \\psi (x) \\}  \\eqdf   \\exists \\chi \n\\left [ \n\\begin{split}\n\\forall x [ \\chi \\bang (x) \\equiv \\psi (x) ] \\\\\n{} \\amp  \\phi (\\lambda x \\chi (x))\n\\end{split}\n\\right] \n\\tag*{∗20·01}\n\\]\n\n\nfor \\(\\chi \\bang\\) a predicative function\n\n\nIn other words, an expression seeming to attribute the property\n\\(\\phi\\) to a class \\(\\{x \\mid \\psi (x) \\}\\) is true if and only if\nthere is some predicative property \\(\\chi\\), which is co-extensive\nwith \\(\\psi\\), which really has the property \\(\\phi\\).\n\nThe notion of membership (\\(\\in\\)) which is the one non-logical\nrelation symbol of ZF, is defined in the PM system:\n\n\nDefinition of \\(\\in\\)  \n\n\\[\n\\tag*{∗20·02}\nx  \\in  \\phi \\eqdf  \\phi \\bang (x)\n\\]\n\n\nfor \\(\\phi\\) a predicative function.\n\n\nThe principal role of this “no-classes” theory of classes,\nas it is called, is to show how the theory of types resolves the\nparadoxes that had afflicted the naive theory of classes in The\nPrinciples of Mathematics and was seen by Russell to afflict\nFrege’s theory. After these foundational sections, all the\nindividual variables that appear in PM should be seen as ranging over\nclasses, (and, as will be explained below, the relation symbols are to\nbe interpreted as ranging over relations in extension). The paradoxes\nappear in different forms, as seen in the Introduction to PM, but the\nresolution of the paradox of “the class of all classes which do\nnot belong to themselves”, which appears in Russell’s\nintial letter to Frege, will be used as our example. This class, which\nleads directly to a contradiction, would appear in contemporary\nnotation as \\(\\{ x \\mid x \\notin x \\}\\). The paradox arises when one\nasks whether that class is a member of iteself or not. The expression\nthat it is a member of itself \\(\\{ x \\mid x \\notin x \\} \\in \\{ x \\mid\nx \\notin x \\}\\) will have two class expressions to be eliminated by\nthe first definition, and then several uses of the relation symbol\n\\(\\in\\) which will also be eliminated. In the end there will be an\nexpression \\(\\lnot (\\phi_{\\tau} \\in \\psi_{\\tau})\\), which is not\nlegitimate, since this is not well-formed for any \\({\\tau}\\). A\nfunction must be of a higher order than its arguments.\n\nThe effect of these two definitions is to demonstrate that classes\nfall into a simple theory of types, and while subject to these type\nrestrictions, all of the inferences involving class expressions\nobserve classical quantification theory as stated in\n∗10 above. The definitions of existential and\nuniversal quantification are simple. Note that Russell uses Greek\nletters (\\(\\alpha\\), \\(\\beta\\),…) to range over classes:\n\n\nDefinition of quantification over “all classes”\n\n\\[\n\\tag*{∗20·07}\n\\forall \\alpha  \\chi (\\alpha) \\eqdf  \\forall \\phi  \\chi ( \\{ x \\mid   \\phi \\bang(x) \\})\\]\n\n\nfor \\(\\phi \\bang\\) a predicative function.\n\nDefinition of quantification over “some classes” \n\n\\[\n\\tag*{∗20·071}\n\\exists \\alpha  \\chi ( \\alpha ) \\eqdf \\exists \\phi  \\chi \\{ x \\mid  \\phi \\bang(x) \\}\\] \n\n\nfor \\(\\phi \\bang\\) a predicative function.\n\n\nThe definition of \\(\\in\\) is extended to classes without change:\n\n\nDefinition of membership of a class in a function \n\n\\[ \n\\tag*{∗20·07}\n\\alpha  \\in  \\psi \\eqdf  \\psi \\bang ( \\alpha)\n\\]\n\n\nfor \\(\\psi \\bang\\) a predicative function.\n\n\nThe remainder of ∗20 consists of theorems proving\nthat the theorems of quantificational logic developed in\n∗10 apply as well to expressions about classes,\nwith the “Greek” variables \\(\\alpha, \\beta, \\ldots\\) in\nthe place of individual variables \\(x, y, \\ldots\\). Because formulas\nwith Greek variables look and behave the same as individual variables\nwith respect to quantificational logic, it is possible to overlook the\ninteraction of the theory of classes with the theory of types. As\nGödel points out in the passage quoted above (Gödel 1944\n[1951: 126]), the “contextual definitions” of class\nvariables \\(\\alpha\\), \\(\\beta\\), etc., does not specify the\nelimination of class abstracts from all possible contexts, and in\nparticular those that talk about classes. Linsky (2004) argues that PM\nhas no notation for classes of propositional functions to distinguish\nthem from classes of classes, although one could be added. This is\nanother indication of the turn in PM after the intial sections (up to\n∗21) to an extensional system of classes and\nrelations.\n\nIn effect the class variables can be seen as propositional function\nvariables, restricted to r-types in which only predicative\nfunctions appear, in arguments as well, leading to what might be seen\nas “hereditarily predicative functions”. In other words,\nthe class variables can be replaced with propositional function\nvariables in which the r-type of the function, and of all the\narguments are of the form \\((\\beta_1, \\beta_2, \\ldots, \\beta_m )/1\\)\nand the same applies to \\(\\beta_1, \\beta_2, \\ldots, \\beta_m\\) as well.\nThis means that variables and terms for classes will obey the\nsimple theory of types. These can be contrasted with\nr-types by presenting an alternative system of simple types or\n“s-types”.\n\n\nChurch’s (1974) “Simple” Theory of\nTypes\n\n\\(\\iota\\) is the s-type for an individual.\nWhere \\(\\tau_1 \\ldots, \\tau_m\\) are any s-types, then\n\\((\\tau_1 \\ldots, \\tau_m)\\) is the s-type of a propositional\nfunction of a m-ary propositional function which has arguments\nof s types \\(\\tau_1 \\ldots, \\tau_m\\), respectively.\n\n\nThe order of an entity in the system of s-types is\ndefined as follows:\n\nthe order of an individual (of r-type \\(\\iota\\))\nis 0\nthe order of a function of r-type \\(\\tau_1 \\ldots,\n\\tau_m\\) is \\(n+1\\) where n is the greatest of the order of the\narguments \\(\\tau_1 \\ldots, \\tau_m\\)\n\n\nChurch’s notion of “order” is not quite one that is\nfamiliar from talk of “first order logic” and\n“second order logic”. First order logic will have bound\nvariables of s-type 0, and a logic which quantifies over\nvariables of s-type 1, thus the familiar notion of\n“order” is one more than the highest order of any of the\nbindable variables in the s-type system.\n\n\nIt should be noted that every s-type is also an\nr-type, namely one that is hereditarily predicative. Thus it\nmight seem that the expressions of the theory of classes are all\nsimply a special case of formulas of the full system of the ramified\ntheory of types. This will be true of the assignment of types to\nvariables, but it must be remembered that the entire formula \\(\\phi\n\\{x \\mid \\psi (x) \\}\\) about a class is by definition \n\n \\[\\exists \\chi [ \\forall x [ \\chi (x) \\equiv \\psi (x)] \\amp  \\phi (\\chi)].\\]\n\n\nAll we have discussed so far is the relative types of \\(\\phi\\) and\n\\(\\chi\\). The Axiom of Reducibility guarantees that there is a\npredicative \\(\\chi\\) co-extensive with any \\(\\psi\\) in the defining\ncondition of a class. To justify use of the class term \\(\\{x \\mid \\psi\n(x) \\}\\) one must then just show that there is some function\nthat has the higher-order property \\(\\phi\\). This is the step\ncomparable to the proof that a definite description is proper, i.e.,\ntrue of exactly one thing, that justifies using that description as a\nsingular term.\nComparison of the Classes of PM with Axiomatic Set Theory\n\nIt is widely thought that the system of PM offers a very different\napproach to the solution of the paradoxes than that of axiomatic set\ntheory as formulated in the Zermelo-Fraenkel system ZF. While the\ntheory of types is thought of as a desperate attempt to save the\nlogicist program by artifically introducing types in order to resolve\nthe paradoxes, axiomatic set theory seems to simply postulate sets as\nentities and adopts axioms in a first order language with\n“\\(\\in\\)” for membership as its one non-logical symbol.\nThis view has been forcefully expressed by Quine:\n\n\nWhatever the inconveniences of type theory, contradictions such as\n[the Russell paradox] show clearly enough that the previous naive\nlogic needs reforming.…There have been other proposals to the\nsame end—one of them coeval with the theory of types. [Quine\ncites Zermelo 1908.] But a striking circumstance is that none of these\nproposals, type theory included, has any intuitive foundation. None\nhas the backing of common sense. Common sense is bankrupt, for it\nwound up in contradiction. (Quine 1951: 153)\n\n\nHowever, both the view that type theory lacks intuitive support, and\nthat type theory and axiomatic set theory are based on the same\nintuitions dates back to Gödel in 1933, referring to set theory\nas the “theory of aggregates”:\n\n\nAt least hitherto only one solution which meets these two requirements\n[of avoiding the paradoxes while retaining mathematics and the theory\nof aggregates] has been found.…This solution consists in the\ntheory of [simple] types.…It may seem as if another solution\nwere afforded by the system of axioms for the theory of aggregates, as\npresented by Zermelo, Fraenkel and von Neumann; but it turns out that\nthis system of axioms is nothing else but a natural generalization of\nthe theory of types, or rather, it is what it becomes of the theory of\ntypes if certain superfluous restrictions are removed. (Gödel\n1933 [1995: 45–46])\n\n\nThe two “restrictions” that Gödel intends are the\nrestriction that types are not cumulative and that the levels\nof types are limited to the natural numbers 0, 1,…\nn,…. Gödel suggests that one adopt a cumulative\nsystem of types in which a given type includes functions of all lower\ntypes (or orders), and the types extend beyond \\(\\omega\\),\n\\(\\omega\\) + 1, …\\(\\omega^{\\omega}\\), …, through all the\nordinals. Such a “natural generalization” of the theory of\ntypes, he asserts, amounts to the same as Zermelo-Fraenkel set theory\n(ZF). Gödel’s claim is spelled out by George Boolos (1971)\nas the “iterative conception” of sets, which can be\nexpressed formally. If one thinks of sets as built up in stages, with\neach stage adding all sets of members of the last stage, and the\nprocess extending endlessly, then the axioms of ZF\nset theory are indeed provable from the axioms of the theory of the\n“iterative conception” of sets. In turn the\n“iterative conception” relies on a strong intuition,\ncontrary to what Quine says. It is the same intuition that underlies\nthe hierarchy of types.\n\nFollowing Boolos’ presentation of the “iterative\nconception of set” it seems that axiomatic set theory and PM do\nnot differ widely, and express the similar intuitive notions of set\nthat provide the same solution to the paradoxes.\n\nStrictly as presented in PM, however, the no-classes theory differs\nsignificantly from ZF. The sentences of the PM theory are expressed in\nthe theory of types, as opposed to the first order theory of ZF. ZF\nand PM cannot simply be compared in terms of their theorems. Not only\nare there different axioms in the two theories, but the very languages\nin which they are expressed differ in logical power. If we follow\nGödel and Boolos, however, the two are seen to be based on the\nsame intuitive basis, and the differences are seen as the same,\nbarring certain “superfluous restrictions” on the theory\nof PM.\nRelations in PM\n\n∗21 extends the notion of class which is the\nextension of a one place propositional function to the comparable\nnotion of a “Relation” for functions of two arguments with\nthe analagous contextual definition.\n\n\nContextual definition of a relation in extension  \n\n\\[\n\\phi \\{x ; y   \\mid    \\psi (x,y) \\}  \\eqdf  \\exists \\chi \n\\left[\n\\begin{split}\n \\forall x \\forall y [\n \\chi \\bang (x,y) \\equiv \\psi (x,y)] \\\\\n{} \\amp  \n\\phi ( \\lambda x \\lambda y  \\:  \\chi (x,y))\n\\end{split}\n\\right ]\n\\tag*{∗20·01}\n\\]\n\n\n\n(Note: The use of this unusual notation \\(\\phi \\{x; y \\mid \\psi (x,y)\n\\}\\) in this one definition is meant to avoid the implication that a\nrelation is interpreted as a set of ordered pairs, that would be\nrepresented by the contemporary notation \\(\\phi \\{\\langle x,y \\rangle\n\\mid \\psi (x,y) \\}\\). The PM notation for propositional functions, as\nin \\(\\phi \\hat{x}\\) uses a caret over the variable where we would\nwrite \\(\\lambda x \\phi(x)\\). The PM notation for a class is \\(\\hat{x}\n\\phi (x)\\). A two-place propositional function is identified with\nvariables also with carets: \\(\\phi (\\hat{x} \\hat{y})\\) and the\ncorresponding relation \\(\\hat{x} \\hat{y} \\phi (x,y)\\). This notation\ndoes not identify relations as classes of ordered pairs, and that is\nhow our blend of PM and contemporary notation in \\(\\phi \\{x ; y \\mid\n\\psi (x,y) \\}\\) is to be taken.)\n\nThe introduction of Greek letters for classes in\n∗20 and the use of “Roman letters” R,\nS, …in ∗21 for relations, marks a change in\nthe notation used in PM. After ∗21 the letters\n\\(\\phi, \\psi, \\ldots\\) rarely appear. As Quine remarks in his study of\nthe logic of Whitehead and Russell, it would seem that after a certain\npoint the body of PM makes use of extensional higher-order logic in a\nsimple theory of types:\n\n\nIn any case there are no specific attributes [propositional functions]\nthat can be proved in Principia to be true of just the same\nthings and yet to differ from one another. The theory of attributes\nreceives no application, therefore, for which the theory of classes\nwould not have served. Once classes have been introduced, attributes\nare scarcely mentioned again in the course of the three volumes.\n(Quine 1951: 148)\n\n\nQuine here hints at the view of PM that is widely shared among\nmathematical logicians, who see the ramified theory of types, with its\naccompanying Axiom or Reducibility, as a digression taking logic into\na realm of obscure intensional notions, when instead logic, even if\nexpressed in a theory of types, is extensional and is comparable to\naxiomatic set theory presented with a simple hierarchy of sets of\nindividuals, sets of sets individuals, and so on.\n\nIt is certainly true that the the remainder of PM is devoted to the\ntheory of individuals, classes, and relations (in extension) between\nthose entities. Thus the ontology of these later portions is a\nhierarchy of predicative functions arranged in a simple theory of\ntypes. This has led one interpreter, Gregory Landini (1998), to argue\nthat only predicative functions are values of bound variables in PM.\nWhat we have interpreted as variables ranging over possibly\nnon-predicative propositional functions, \\(\\phi\\), \\(\\psi\\),…\nare for Landini only schematic letters, and are not bindable\nvariables. The only bound variables in PM, he asserts, range over\npredicative functions. This is a strong version of a view that others\nsuch as Kanamori (2009) have expressed, going back to Ramsey (1931),\nnamely that the introduction of the Axiom of Reducibility has the\neffect of undoing the ramification of the theory of types, at least\nfor a theory of classes, and so a higher-order logic used for the\nfoundations of mathematics ought to have only a simple type\nstructure.\n\nOur interpretation of this change in attention to classes and\nrelations indicated by the shift in notation is that it indicates the\nextent to which the solution to the paradoxes, which required a\nramified theory of (possibly intensional) propositional functions, may\nhave superseded a logic based on an unproblematic notion of class and\nmathematical functions and relations between them, that appeared in\nthe body of The Principles of Mathematics before\nRussell’s attention was drawn to the paradoxes. In the summary\nof the later sections of PM that follows below, it will appear that in\nfact the symbolic development follows very closely that of PoM from\nten years earlier. While we do not know much about the order in which\nsections of PM were composed, it will appear from this change of\nattention from propositional functions to classes and relations, that\nthe later parts are in fact an earlier stratum in the conceptual\ndevelopment of the project that started out as a symbolic\n“Volume II” to follow PoM.\n\nTo remind the reader of the change from talking of propositional\nfunctions to relations in extension, two further notational\nalterations are introduced. Greek letters such as \\(\\alpha\\),\n\\(\\beta\\), etc. , will be used\nas variables for ranging over classes as well. The individual\nvariables which are ambiguous with respect to type, “typically\nambiguous”, will now also range over classes. A function\n\\(\\phi\\) of two variables x and y is indicated with the\narguments in parentheses after the function variable: \\(\\phi(x, y)\\).\nA two place relation R holding between x and y is\nwritten \\(x \\relR y\\), with the R in “infix”\nposition. The obvious limitation of this notation is that it is not\nreadily extended to three place relations, adding a third variable,\nsay z. We will follow the practice in PM and write \\(x \\relR\ny\\) for binary relations. PM only requires binary relations for most\nof the three volumes, although the projected volume IV on geometry\nwould need a notation for “x is between y and\nz”, as can be seen from Henry Sheffer’s unpublished notes from Russell’s lectures on\ngeometry from 1910 at Cambridge. There he uses the notation\n\\(y\\rels{B}(x,y)\\) which blends the two styles.\nThe Algebra of Classes\n\nThe notions of the subset relation and the intersection and union of\nsets are defined in PM exactly as they are now (albeit with different\nterminology). The complement of a set and the universal class \\(\\rV\\)\nare not allowed in set theory, and rejected as “proper\nclasses”. In PM, as they only are a set of entities of a given\ntype \\(\\tau\\), they form a set of the next higher type, \\((\\tau)/1\\).\nThe complement of a set of a given type is the set of all entities (of\nthat type) that are not in the set. Each empty set will be the\ncomplement of the universal set (of a given type \\(\\tau\\) ) and so\nthere will be the empty set of type \\(\\tau\\). \n\n\\[\n\\begin{align}\n\\alpha \\subseteq \\beta & \\eqdf   \\forall x (x  \\in \\alpha  \\supset  x \\in  \\beta) \\tag*{∗22·01}\\\\\n\\alpha  \\cap   \\beta  & \\eqdf  \\{x \\mid  ( x \\in  \\alpha \\amp  x \\in  \\beta ) \\tag*{∗22·02}\\\\\n\\alpha  \\cup   \\beta  & \\eqdf  \\{ x \\mid  (x \\in  \\alpha  \\lor x \\in  \\beta ) \\tag*{∗22·03}\\\\\n\\end{align}\n\\]\n\n\nThe type subscript \\(\\tau\\) is added below as a reminder that the\nnotions of universal set \\(\\rV\\) and complement are each with regard to a given type (and\nso an empty set \\(\\emptyset\\) will recur in each type.)\n\n\\[\n\\begin{align}\n- \\alpha &\\eqdf  \\{ x_{\\tau} \\mid  \\lnot (x \\in  \\alpha )\\}\\tag*{∗22·04}\\\\\n{\\alpha - \\beta} & \\eqdf  {\\alpha  \\cap   {- \\beta}}\\tag*{∗22·05}\\\\\n\\end{align}\n\\]\n\nThe Universal Class and the Empty Class \n\n\\[\\tag*{∗24·01}\n\\rV_{\\tau + 1} \\eqdf  \\{ x_{\\tau} \\mid  (x = x) \\}\n\\]\n\n\nThe subscript on ‘\\(\\rV\\)’ indicates that the universe of\nclasses of a given (simple) type \\(\\tau\\) will be a member of the next\ntype. There is no class of all classes of whatever type. This is in\ncommon with axiomatic set theory which holds that there is no set of\nall sets. \n\n\\[\\tag*{∗24·02}\n\\emptyset_{\\tau} \\eqdf  - \\rV_{\\tau}\n\\]\n\nMathematical functions in PM\n\nThe logic of PM is based on propositions, propositional\nfunctions and relations in extension, unlike\nFrege’s which deals with objects, in particular, truth values,\nand functions, with the special case of concepts, which are functions\nfrom objects to truth values. PM reduces mathematical functions to\n“functional relations” in a way that is familiar from\nelementary courses. If there is a binary relation which has a unique\nsecond argument for each first argument, i.e.,  \n\n \\[\\forall x \\exists y [x \\relR y \\amp  \\forall z (x \\relR z \\supset z = y)]\\] \n\n\nthen one can introduce a new function symbol \\(f_R\\), such that\n\n  \\[\\forall x \\forall y (x\\relR y \\equiv f_R(x) = y).\\]\n\n\nSimilarly for an \\(n+1\\) place relation for each \\(x_1\\), …,\n\\(x_n\\) there is a unique y such that \\(R(x_1, \\ldots, x_n,\ny)\\), then one can introduce an n-place function g\nmapping \\(x_1, \\ldots, x_n\\) onto y. In PM the expressions for\nmathematical functions are definite descriptions, referring to the\nlast argument of a relation as the “value” of the function\ndescribed by that relation. We will use the expression \\(f_R\\) to\nrefer to the functional term referring to the function derived from a\nrelation R. PM uses the explicit definite description “the\nR of y” (written \\( R`y \\) ) where we would use the functional\nexpression \\(f_R\\). The definition of a monadic functional\nterm then is: \n\n\\[\n\\tag*{∗30·01} f_Ry \\eqdf  (\\imath x)(x \\relR y)\n\\]\n\n\nwith the general form for an n-place functional term g\nderived from an \\(n+1\\) place relation S (following\nRussell’s notation in lectures): \n\n \\[g_S(x_1, \\ldots, x_n) \\eqdf   (\\imath y )(x_1 S x_2, \\ldots, x_n, y)\\]\n\n\n(The diligent reader will find that this presentation does not follow\nPM exactly. The example “the father of” based on a\nrelation R expressing “x is the father of\ny” would make “the R of\nx” actually refer to the unique x which is the\nfather of y, and so what has been explained above is\nappropriate to the converse of that relation, \\(\\relbR\\). The\npractice of reading the argument of a relational function as the\nx and the value as the y is so well established that we\nhave taken a liberty with the actual definitions in PM.)\n\nRecall that from this point on in PM, the relations are to be\nconsidered as “relations in extension” and so it is easy\nto see how one can treat the relations as ordered \\(n+1\\)-tuples of\nwhich the last member is unique given the first n arguments. In\nparticular, a monadic function f can be seen in the familiar\nway as a set of ordered pairs (of \\(\\langle x, f_R(x) \\rangle\\)) for\neach argument x in the domain of the function.\n\nGiven the treatment of “relations” as “relations in\nextension” it is no accident that the development of the logic\nof relations in ∗30–∗38\nlooks familiar to contemporary logicians, with even some of the\nnotation from PM surviving into contemporary usage. A series of\nnotions are defined in a way quite familiar to the modern treatment of\nrelations as sets of n-tuples:\nThe Converse of a Relation \n\n\\[\n\\tag*{∗31·02} {\\relbR} = \\{\\lambda x \\lambda y (y \\relR x)\\}\n\\]\n\n\nor, in terms of pairs:  \n\n\\[{\\relbR} = \\{ \\langle x, y \\rangle \\mid  (y \\relR x) \\}\\]\n\nDomains, Ranges and Fields of Relations\n\nThe notions of the domain, range, and field of a relation\nare also given a contemporary definition (and so also the notions of\nthe domain, range and  field of a function).\n\n\\[\n\\begin{align}\n\\tag*{∗33·11} \\Domain \\; R &\\eqdf  \\{x \\mid   \\exists y  ( x \\relR y ) \\}\\\\\n\\tag*{∗33·111} \\Range \\; R &\\eqdf  \\{y \\mid    \\exists x (x \\relR y) \\}\\\\\n\\tag*{∗33·112} Field \\; R  &\\eqdf  \\{x \\mid    \\exists y (x \\relR y \\vee y \\relR x ) \\} \\\\\n\\end{align}\n\\]\n\n\nNote that it is possible that a relation can have its domain in one type\nand range in another. This adds complications in the theory of\ncardinal numbers when a relation of similarity (equinumerousity) holds\nbetween classes of different types. (See the discussion of ∗100\nbelow.)\nThe Product of Two Relations\n\nThe composition of relations R and S is called\ntheir relative product and uses a different symbol \\(R\\mid\nS\\) where we write \\(R \\circ S\\): \n\n\\[\n\\tag*{∗34·01} R \\circ S \\eqdf  \\lambda x \\lambda z   \\{ \\exists y ( x \\relR y \\amp  y \\relS z ) \\}\n\\]\n\nRestricted Relations\n\nIn the case of the restriction of (the  range  of) a relation R to a\nparticular class \\(\\beta\\), is given\n this definition, with the symbol now used instead for the restriction of the  domain  : \n\n\\[\n\\tag*{∗35·02} R \\upharpoonright  \\beta \\eqdf  \\lambda x \\lambda y   (x \\relR y \\amp  y \\in \\beta)\n\\]\n\n\nIn his survey of PM, Quine (1951: 155) complains that this last 100\npages of Part I is occupied with proving theorems relating redundant\ndefinitions of the same notions. Thus PM defines the notion of domain\nand range and then introduces notions that again define the same\nclasses, which are proved to be equivalent. PM defines the notation \nof ‘\\(R\\pmdq\\beta\\)’\nto be read as “the terms\nwhich have the relation R to members of \\(\\beta\\)” and\nuses the example:\n\n\nIf \\(\\beta\\) is the class of great men, and R is the relation\nof wife to husband, \\(R\\pmdq\\beta\\) will mean “wives of great\nmen”. (PM, 278)\n\n\nIn contemporary logic with the notation of set theory used above,\nthere is no need for a special symbol for this notion, as it is\nwritten as: \n\n\\[\n\\tag*{∗37·01} R\\pmsq \\pmsq \\beta \\eqdf  \\{ x \\mid    \\exists y   (y   \\in   \\beta) \\amp  x \\relR y \\}\n\\]\n\nProducts and Sums of Classes of Classes \n\n\\[\n\\tag*{∗40·01} {} \\cap   \\alpha \\eqdf  \\{ x   \\mid    \\forall \\beta   (\\beta   \\in   \\alpha   \\supset   x   \\in   \\beta) \\}\n\\]\n\n\nThis is the intersection of \\(\\alpha\\). \n\n\\[\n\\tag*{∗40·02} {} \\cup   \\alpha \\eqdf  \\{ x   \\mid    \\exists \\beta   (\\beta   \\in   \\alpha \\amp  x   \\in   \\beta) \\}\n\\]\n\n\nis the union of \\(\\alpha\\).\n4.2 Part II: Prolegomena to Cardinal Arithmetic\nThe Cardinal Number 1 \n\n\\[\n\\tag*{∗52·01} 1 \\eqdf  \\{ \\alpha \\mid  \\exists x  ( \\alpha = \\{x \\} ) \\}\n\\]\n\n\nSo the cardinal number 1 is the class of all singletons. There will be\na different number 1 for each type of x. Frege, by contrast,\ndefines the natural number 1 as the extension of a certain concept,\nnamely being identical with the number 0, which itself is the\nextension of the (empty) concept of not being self identical. In\naxiomatic set theory the natural numbers are particular finite\nordinals, in particular the series with 0 as the empty set \\(\\emptyset\\), 1 is \\(\\{\n0 \\}\\), 2 is \\(\\{0, 1 \\}\\), and so on. This construction\nis named the von Neumann ordinals.\nPairs \n\n\\[\n\\tag*{∗54·02} 2 \\eqdf  \\{ \\alpha \\mid   \\exists x \\exists y   (x \\neq y \\amp  \\alpha = \\{y \\}   \\cup    \\{ x \\} ) \\}\n\\]\n\n\nSimilarly, the number 2 is the class of all pairs, rather than a\nparticular pair. In the type theory of PM there will be distinct\ncouples for the types of y and x. When they are of the\nsame type the couple is called “homogenous”. Even with\nhomogenous pairs there will be distinct classes of pairs for each\ntype, and thus a different number 2 for each type. The same notion\napplies to relations.\nOrdered Pairs\n\nThe notion of an ordered pair, called an “ordinal\ncouple” is defined as: \n\n\\[\n\\tag*{∗55·01} \\langle x, y \\rangle \\eqdf \\textrm{ the extension of } \\lambda x \\lambda y (x   \\in \\{x \\} \\amp  y  \\in \\{y\\})\n\\]\n\n\nThe idea is that the order of the relation \\(\\lambda x \\lambda y (x\n\\in \\{x\\} \\amp y \\in \\{y\\})\\) determines the first and second element\nof the ordered pair. It is a relation in extension, which is the\nanalogue of a property in extension or class. A relation in extension\nhas a distinction between the first and second elements due to the\norder of the defining relation. The closest in contemporary language\nwould be: \n\n\\[\\phi \\langle x, y \\rangle  \\eqdf   \\exists \\psi \\forall u \\forall v   ( \\psi (u, v) \\equiv \\lambda x \\lambda y [ x \\in \\{x\\} \\amp  y \\in \\{y\\} ] (u, v) \\amp  \\phi (\\psi) ) \\]\n\n\nGiven the definition of extensions of relations this is the version of\nthe no-classes theory for relations. After attending classes of\nRussell the year before, and having several discussions, Norbert\nWiener (1914) proposed the following definition (in modern\nnotation): \n\n\\[\\langle x, y \\rangle \\eqdf  \\{\\{\\{ x\\}, \\emptyset \\}, \\{\\{ y\\}\\}\\} \\textrm{ where } \\emptyset \\textrm{ is the empty set.}\\]\n\n\nWiener’s accomplishment was to capture the ordering of the pair\nwhich in PM is captured by the ordering of the arguments of relations\nwith the unordered notion of set membership.\nThe end of PM to ∗56\n\nThe paperback abridged edition of PM to\n∗56 only goes this far, so the remaining\ndefinitions have only been available to those with access to the full\nthree volumes of PM.\nRelative Types\n\nThis section presents a discussion of relations between individuals of\ndistinct types, introducing a notation for types, \\(t\\pmsq x\\) for the\ntype to which x belongs. This section is little used in Volume\nI. The special consequences for this notion when dealing with relative\ntypes of cardinal numbers is the topic of the Preface to Volume II,\nwhich was added after the first volume was already in print. The delay\ndue to working out these details partially explains the three year gap\nbetween the publication of Volume I in 1910, and the remaining volumes\nII and III in 1913. Section ∗65 (On the Typical\nDefinition of Ambiguous Symbols), is a discussion of typical\nambiguity, the ambiguity of variables with respect to type.\n\n\\[\n\\tag*{∗70·01} f: \\alpha \\rightarrow \\beta \\eqdf\n\\] \n\n\nThe functions f from \\(\\alpha\\) onto \\(\\beta\\), that is, the\n\\(\\Domain \\; f = \\alpha\\) and \\(\\Range \\; f = \\beta\\)\nSimilarity of Classes \n\n\\[\n\\tag*{∗73·01} \\alpha \\approx \\beta \\eqdf  (\\exists f) f : \\alpha \\stackrel{1-1}{\\longrightarrow} \\beta.\n\\]\n\n\nThere is a one-one function mapping \\(\\alpha\\) onto \\(\\beta\\)\n(similarity of \\(\\alpha\\) and \\(\\beta\\)). Contemporary\ndiscussions say that \\(\\alpha\\) and \\(\\beta\\) are\nequinumerous. Difficulties arise with respect to the\ndefinition of cardinal numbers when the relation of similarity they\ninvolve is one that has a domain and range in different types. See\n∗100 below.\n\nThe main theorem in this chapter is a proof of the Cantor-Bernstein\ntheorem, that if a set \\(\\alpha\\) is similar to a subset z of\nanother set \\(\\beta\\) and \\(\\beta\\) is similar to a subset \\(\\delta\\)\nof \\(\\alpha\\) then \\(\\alpha\\) and \\(\\beta\\) are themselves\nsimilar: \n\n\\[\n \\forall \\alpha \\forall \\beta \\forall \\gamma \\forall \\delta   \n\\left[\\left (\n\\begin{split}\n\\alpha \\approx \\gamma & {}\\amp  \\beta \\approx \\delta \\\\\n&{} \\amp  \\gamma \\subseteq \\beta \\\\\n&{} \\amp  \\delta \\subseteq \\alpha \\\\\n\\end{split}\n\\right) \\supset \\alpha \\approx \\beta \\right] \n\\tag*{∗73·88}\n\\]\n\n\nThe proof here explicitly follows the proof by Ernst Zermelo from\n1908. Whitehead and Russell call this the\n“Schröder-Bernstein” theorem.\nThe Axiom of Choice (Multiplicative Axiom)\n\nThe Multiplicative Axiom, or “Axiom” of Choice, is not an\naxiom of PM, what is termed a “primitive proposition”, but\nis instead a defined expression that is added as an hypothesis to\ntheorems for which it is used. This reflects the emerging awareness at\nthe time of the role of the Axiom of Choice in various proofs, in\nparticular, Zermelo’s proof  that every class can be\nwell-ordered.\n\n\\[{}\\\n\\begin{aligned}&\\textrm{Multiplicative}\\\\&\\textrm{Axiom}\\end{aligned} \\eqdf \n\\forall \\alpha \\left\\{ \n\\begin{split}\n&\\forall \\beta (\\beta \\in \\alpha \\supset \\beta \\neq \\emptyset ) \\amp {}\\\\\n&\\;\\;\\forall \\beta \\forall \\delta \\left [\n\\left(\n\\begin{split}\n\\beta   & \\in   \\alpha \\amp {}\\\\\n \\delta   & \\in   \\alpha \\amp {}\\\\\n\\beta & \\neq \\delta\n\\end{split}\n\\right) \n\\supset \n(\\beta \\cap \\delta = \\emptyset) \n\\right] \n\\supset \\\\\n&\\;\\;\\;\\; \\exists \\beta \\forall \\delta \\exists \\gamma\n\\left[\n\\begin{split}\n& \\delta  \\in  \\alpha \\supset  \\\\\n& \\delta \\cap {} \\beta = \\{\\gamma\\} \n\\end{split}\n\\right]\n\\end{split}\n\\right\\}\n\\tag*{∗88·03}\n\\]\n\n\nIf \\(\\alpha\\) is a class of mutually exclusive, non-empty, classes, then there is\na (“choice”) set \\(\\beta\\) such that the intersection of\n\\(\\beta\\) with each member of \\( \\delta   \\) of \\(\\alpha\\) is  a unique (chosen)  member   of\n\\(\\delta \\).\n\\(\\Rast\\) The Ancestral Relation \n\n\\[\n\\quad\\Rast  \\eqdf\n\\left \\{\n\\begin{split}\n&  \\langle x, y \\rangle \\mid   (\\exists u  x\\relR u  \\lor \\exists u  uRx ) \\amp {} \\\\\n& \\forall \\alpha   \n\\left [ \n\\left[\n\\begin{split}\n& x  \\in  \\alpha \\amp  {}\\\\\n&\\forall z \\forall w (z   \\in   \\alpha \\amp  zRw \\supset w   \\in   \\alpha ) \n\\end{split}\n\\right] \\supset y  \\in   \\alpha \n\\right] \n\\end{split}\\right \\}\n\\tag*{∗90·01}\n\\]\n\n\nThis follows Frege’s definition, namely, that y is in all\nthe R-hereditary classes that contain x or (x is\nin the field of R ).\nThe Powers of a Relation\n\nThe “powers” of a relation \\(R (\\textrm{Pot}\\pmsq R)\\) are\nthe relations R, \\(R^2\\), \\(R^3\\), …where\n\n\\[{R^2 \\eqdf  R \\circ R},\\quad {R^{n+1} \\eqdf  R \\circ R^n},\\quad \\ldots\\]\n\n\nThese definitions begin with ∗91·03, using the notion of\nthe ancestral of a higher-order relation between relations defined\nbeginning with R.\n\nThe main result of this section is another proof of the\nCantor-Bernstein theorem: “This proof is essentially the same as\nBernstein’s published originally by Borel [1898: Note 1, pp.\n102–7]” (PM I, 589). In this proof the one-one relation\nbetween the sets \\(\\alpha\\) and \\(\\beta\\) is constructed from the\npowers of two relations R that maps \\(\\alpha\\) into \\(\\beta\\),\nand S that maps \\(\\beta\\) into \\(\\alpha\\). The one-one mapping\nis constructed in stages. First all of \\(\\alpha\\) is mapped onto\n\\(\\beta\\) by R. Those elements in \\(\\beta\\) not in the range of\nR are mapped onto \\(\\alpha\\) by S. But some elements in\nthe range of S will have already been mapped by R. They\nneed to be shifted to a new image in \\(\\beta\\), again by R.\nThis process is iterated through all of the powers of R, and\nthen it is shown that the resulting relation is one to one from\n\\(\\alpha\\) onto \\(\\beta\\). See Hinkis (2013) for a history of the many\ndifferent proofs of this theorem.\n5. Volume II\n5.1 Prefatory Statement of Symbolic Conventions\n\nThe writing of this preface delayed the publication of the second\nvolume of PM, as Whitehead and Russell struggled over the\ncomplications it raised. The difficulties arise from the typical\nambiguity of terms and formulas of the theory of types. Every\nconstant, such as those for the numbers \\(0,1, \\ldots, \\aleph_0\\) will\nhave a definition relative to each type. Without assuming the Axiom of\nInfinity for individuals, there is no guarantee that a given constant\ndesignates a non-empty class in a given type. The preface introduces\nthe notion of “formal numbers”, which are to be\ninterpreted as belonging to a type that makes them not identical with\nthe \\(\\emptyset\\) for that type. Volume II begins with Part III,\n“Cardinal Arithmetic”. The notions of cardinal numbers are\ndeveloped in full generality, extending to infinite cardinals.\nConsequently the theory of natural numbers, which are called\n“Inductive Cardinals” in PM, is introduced with a series\nof definitions of special cases of notions that are first introduced\nin a general form applying to any numbers or classes. For example,\naddition of natural numbers, as in the famous proof that \\(1 + 1 = 2\\)\nin ∗110·04 is proved  for the special\ncase of the addition of classes that applies to cardinal numbers,\n‘\\(+_c\\)’. The Summary to section A introduces the notion\nof homogenous cardinals, which are classes of similar classes\nwhose members are all of the same type. It is possible to define\nsimilarity between two classes \\(\\alpha\\) and \\(\\beta\\) of distinct\ntypes say \\(\\tau\\) and \\(\\tau '\\), and cardinals are classified as\ndescending and ascending as the domain of the\nrelevant similarity relation is of a higher type than the range, and\nwhen of a lower type, respectively. The theory of cardinal numbers is\nstraightforward with homogenous cardinals, however the exceptions must\nbe kept in mind, as is evidenced in ∗100.\n5.2 Part III: Cardinal Arithmetic\nDefinition of cardinal numbers \n\n\\[\n\\tag*{∗100·01} \n\\rN_c \\eqdf  \\{ x \\mid  \\forall y (y \\in x \\leftrightarrow \\forall z \\forall w (z,w \\in y \\leftrightarrow z \\approx w) \\}\n\\]\n\n\nCardinal Numbers are classes of equinumerous (similar)\nclasses. We can add a notion of the number of a class to\nallow for a direct comparison with Frege:  \n\n\\[\\# \\{x \\mid \\phi ( x) \\} \\eqdf  \\{ y \\mid  y \\approx \\{x \\mid  \\phi (x) \\} \\}.\\] \n\n\n(In set theory of course this is too large to be a set, and so is just\na “proper class”.)\nHume’s Principle in PM\n\nHume’s Principle which is described in Frege (1884:\n§63) as asserting that the content of the proposition that\n“the number which belongs to the concept F is the same as the\nnumber which belongs to the concept G” is equivalent to\n“the concept F is similar to the concept G”. In terms of\nclasses this becomes \\(\\alpha \\approx \\beta \\equiv \\# \\alpha = \\#\n\\beta\\). Hume’s principle is the focus of much of the discussion\nof “Neo-Logicism”, the doctrine that Frege’s\nconstruction of the numbers can be built on a consistent foundation\n(see the entry on \n Frege’s theorem).\n\nOnly one direction of this equivalence is provable in PM:\n\n\\[\n\\tag*{∗100·321}\n\\alpha \\approx \\beta   \\supset   \\# \\alpha = \\# \\beta\n\\]\n\n\nThe failure of the other direction, the implication from right to\nleft, is due to the possibility that \\(\\alpha\\) and \\(\\beta\\) are of\ndifferent types, so that any similarity relation between them will\nhave its domain and range in different types. Suppose there are\n\\(\\aleph_0\\) individuals, and consider two higher types with the\ncardinals in them of even larger, but distinct, cardinalities, say\n\\(\\alpha\\) in some high type has cardinality \\(\\aleph_1\\) and that\n\\(\\beta\\) in an even higher type and has cardinality \\(\\aleph_2\\).\nThere are no sets of individuals similar to \\(\\alpha\\) or \\(\\beta\\),\nso no similarity relation with a domain in \\(\\alpha\\) or \\(\\beta\\)\nwill hold with respect to any set in the type of individuals. Suppose\nthat \\(\\#\\) is defined in terms of such descending relation.\nTherefore \\(\\# \\alpha = \\{ \\Lambda \\} = 0\\) and \\(\\# \\beta = \\{\n\\Lambda \\} = 0\\) so \\(\\# \\alpha = \\# \\beta\\), yet \\(\\alpha \\not\\approx\n\\beta\\) on any similarity relation of whatever domain and range,\nbecause their cardinalities differ. Whitehead and Russell assert that\nthe case of \\(\\alpha\\) and \\(\\beta\\) being in different types is the\nonly way to construct an exception to this direction of Hume’s\nprinciple, and offer as a restricted version: \n\n\\[\n\\tag*{∗100·34}\n\\exists \\gamma   [\\gamma \\in (\\alpha \\cap \\beta) ]  \\supset   ( \\alpha \\approx \\beta   \\equiv   \\# \\alpha = \\# \\beta )\n\\]\n\n\nThe antecedent guarantees that \\(\\alpha\\) and \\(\\beta\\) are of the\nsame type, and so the cardinal numbers involved are homogenous\ncardinals. (Landini (2016) argues that this section of PM is\nconfused.)\n0 Defined \n\n\\[\n\\tag*{∗101·1} 0 \\eqdf  \\# \\emptyset\n\\]\n\n\nThe class of all classes equinumerous with the empty set is just the\nsingleton containing the empty set, so \\(0 = \\{ \\emptyset \\}\\).\nThe Arithmetical Sum of Classes and Cardinals \n\n\\[\n\\tag*{∗110·01}  \n\\alpha + \\beta \\eqdf  [\\{ \\beta \\cap \\emptyset \\}  \\times \\{\\alpha \\}]   \\cup    [ \\{ \\alpha \\times \\{ \\beta \\} ] \n\\] \n\n\n(If \\( \\alpha, \\beta \\neq \\emptyset \\) , otherwise \\( \\alpha +\n\\emptyset = \\alpha, \\emptyset + \\beta = \\beta \\) ). This qualification\nis hidden in PM by the use of expressions for functional relations\nthat are sometimes undefined.  The arithmetic sum of\n\\(\\alpha\\) and \\(\\beta\\) is the union of \\(\\alpha\\) and \\(\\beta\\)\nafter they are made disjoint by summing the pairing the elements of\n\\(\\beta\\) with elements of \\(\\{ \\alpha \\}\\) and the elements of\n\\(\\alpha\\) with the elements of \\(\\{ \\beta \\}\\). (The Cartesian\nproduct of \\( \\gamma \\) and \\( \\delta \\), \\( \\gamma \\times \\delta\n\\) is \\( \\{ \\langle x, y \\rangle | x \\in \\gamma \\; \\amp \\; y \\in\n\\delta \\} \\)). The The classes \\(\\alpha\\) and \\(\\beta\\) are\nintersected with the empty class, \\(\\emptyset\\), to adjust the type of\nthe elements of the sum. It is more recognizable to contemporary set\ntheory by the equivalent definition (subject to the same exception\nwhen\n\n\n:  \n\n\\[\\alpha + \\beta \\eqdf  \\{ \\langle \\emptyset, x \\rangle | x \\in \\alpha \\}  \\cup    \\{ \\langle y, \\emptyset \\rangle | y \\in \\beta \\} \\]\n\n\nThe cardinal sum of y and x \n\n\\[\n\\tag*{∗110·02}\n{}\\quad y +_c x = \\{ z   \\mid    \\exists \\alpha   \\exists \\beta [( y = \\# \\alpha \\amp  x = \\# \\beta) \\amp   z \\approx \\alpha + \\beta ] \\} \n\\]\n\n\n\\(y +_c x\\) expresses the cardinal addition of cardinals\ny and x. It is the arithmetical sum of\n“homogeneous cardinals”, cardinals of a uniform type, to\nwhich \\(\\alpha\\) and \\(\\beta\\) are related by \\(\\rN_0 c\\) (itself\ndefined at [∗103·01]). The notation indicating that\n\\(\\alpha\\) is a homogenous cardinal \\(\\alpha\\) is \\(\\rN_0\nc\\pmsq\\alpha\\), which we might write as \\(\\#_0\\) in an extension of\nour contemporary notation replacing \\(\\#\\) above.\n\nThe reader can now appreciate the notorious fact that \\(1 +1=2\\), the\nmost elementary truth of arithmetic, is not proved until page 83 of\nVolume II of Principia Mathematica, and even then, almost as\nan afterthought: \n\n\\[\n\\tag*{∗110·643} 1 +_c 1 = 2\n\\]\n\n\nWhitehead and Russell remark that “The above proposition is\noccasionally useful. It is used at least three times,\nin…”. This witticism reminds us that the theory of\nnatural numbers, so central to Frege’s works, appears in PM as\nonly a special case of a general theory of cardinal and ordinal\nnumbers and even more general classes of isomorphic structures.\nExponentiation\n\nExponentiation for cardinals is defined in such a way that it\ncoincides with Cantor’s notion that the cardinality of the\npowerset of a class \\(\\alpha\\) is 2 raised to the power of the\ncardinality of \\(\\alpha\\): \n\n\\[\n\\tag*{∗116·72}\n\\lvert\\lvert \\wp \\alpha \\rvert\\rvert  = 2^{\\lvert\\lvert  \\alpha \\rvert\\rvert }\n\\]\n\nGreater and Less\n\nCantor’s Theorem: \n\n\\[\n\\tag*{∗117·661} 2^{y} > y\n\\]\n\n\nThis is Cantor’s theorem that the if a set \\(\\alpha\\) has a\ncardinal number y then the cardinal number \\(2^{y}\\) of the\npowerset of \\(\\alpha\\) is greater than y.\nThe Natural Numbers\n\nThe most direct comparison with Frege’s development of the\nnatural numbers comes with the notion of Inductive Cardinal\nby which PM means the natural numbers 0, 1, 2,…, and the theory\nof these numbers including the principle of induction. Although the\nnumbers 0 and 1, as well as addition of natural numbers \\(+_c\\) is has\nbeen defined earlier, they are defined as cardinal numbers and\naddition will apply to all cardinal numbers, finite and transfinite.\nFor the finite natural numbers, special notions need to be defined\nfirst. For the proof of the Peano Postulates it is necessary not only\nto define 0, but also the notion of successor. For Frege the\nnotion of (weak) predecessor of a number is defined, thus 0 and 1 are\nthe predecessors of 1, while 0, 1 and 2 are the predecessors of 2,\netc. The successor of n is then defined by counting the\npredecessors of a number, in terms of the definition of number, it is\nthe number of the class of predecessors. This definition would not\nwork for PM, where each number would be of a higher type, as it is\ndefined as a set containing that number. There will in fact be natural\nnumbers for each type, thus a set of all pairs of individuals of type\n0, a set of pairs of sets of type 1, etc., for each type. There is no\none type, however, at which there are all of the natural numbers (sets\nof equinumerous sets of that type) without an assumption that there\nare infinitely many members of some one type.\n\nThe solution in PM is to guarantee that for each finite set of\nn individuals of type 0, there will be some object not in that\nset, which can be included in the set defining the successor. That such a\nnew individual can be found is guaranteed by the Axiom of Infinity,\nwhich in effect asserts the existence of distinct individuals of any\nfinite number. It is interesting to note the the “Axiom”\nof Infinity is not a primitive proposition of the logic of\nPM. Instead it is an additional hypothesis, to be used as an\nantecedent to mathematical assertions upon which it depends. The issue\nof whether the system of PM succeeds as logicism is thus not\nsettled by noting that an Axiom of Infinity has to be assumed, but by\ndetermining whether that “Axiom” is derivable from logical\nprinciples alone.\n\nIn axiomatic set theory the “Axiom of Infinity” guarantees\nthe existence of a particular set, the ordinal \\(\\omega\\):\n\n \\[\n\\exists x [ \\emptyset   \\in   x \\amp  \\forall y ( y   \\in   x \\supset y \\cup \\{ y\\}   \\in   x ) ]\n\\]\n\n\nThe inductive cardinals (natural numbers) are defined as the\nnumbers bearing the ancestral of the \\(+_1\\) relation to 0. Given that\nthe \\(+_1\\) relation is the PM account of successor this is\nthe same definition as for Frege.\n\nInductive Cardinals N \n\n\\[\n\\tag*{∗120·01}\n\\rN  \\eqdf  \\{x\\mid  0 \\relSast x \\}\n\\]\n\n\nThe inductive cardinals N are the familiar natural\nnumbers, namely 0 and all those cardinal numbers that are related\nto 0 by the ancestral of the “successor relation”\nS, where \\(x\\relS y\\) just in case \\(y = x +1\\). \n\n\\[\n\\tag*{∗120·03}\n\\textrm{Axiom of Infinity} \\eqdf    \\forall y ( y \\in  \\{x\\mid  0\\relSast x \\} \\supset y \\neq \\emptyset )\n\\]\n\n\nThis Axiom of Infinity asserts that all inductive cardinals are\nnon-empty. (Recall that \\(0 = \\{\\emptyset \\}\\), and so 0 is not\nempty.) The axiom is not a “primitive proposition” but\ninstead to be listed as an “hypothesis” where used, that\nis as the antecedent of a conditional, where the consequent will be\nsaid to depend on the axiom. Technically is not an axiom of\nPM as ∗120·03 is a definition, so this is just\nfurther defined notation in PM!\n\nWhitehead and Russell do carry out the step of the logicist program of\nderiving Peano’s Postulates based on the prior definitions of\nthe notions of Natural number, 0, and successor, as Russell describes\nthe project later, in (1919). This is in fact what is done in\n∗120 “Inductive Cardinals” of PM, but\nis not described as such, either there or in introductory material.\nThe results are not proved separately, but as they appear in a\ndevelopment of various results about natural numbers. Indeed some, such as ∗120·31, can only be seen to be versions of a Peano axiom with a bit of work.\n\n0 is a natural number. \n\n  \\[\n  \\tag*{∗120·12} 0   \\in  \\rN\n  \\]\n\n \nThe successor of any number is a number. \n\n  \\[\n  \\tag*{∗120·121} n   \\in \\rN \\supset n +_c 1   \\in  \\rN\n  \\]\n\n \nNo two numbers have the same successor (assuming the axiom of\nInfinity). \n\n  \\[\n  \\tag*{∗120·31}\n\n\\  \\textrm{Axiom of Infinity} \\supset (n +_{c} 1 = m +_{c} 1 \\supset n = m)\n  \\]\n Given the way that the successor\noperation is defined, it is not a matter of logic that there is an\nextra individual to add to a set of size n to give one of size\n\\(n +_{c} 1\\). This is guaranteed by adding the Axiom of Infinity as\nan hypothesis to the theorem.\n0 is not the successor of any number. \n\n  \\[\n  \\tag*{∗120·124} n +_{c} 1 \\neq 0\n  \\]\nAny property \\(\\phi\\) which belongs to 0, and belongs to the\nsuccessor of m provided that it belongs to m, belongs to\nall natural numbers n. \n\n  \\[\n  \\tag*{∗120·13}\n  \\forall n \\{ [ n   \\in  \\rN \\; \\amp  \\; \\forall m( \\phi m \\supset \\phi (m +_c 1)) \\;  \\amp \\; \\phi    \\: 0] \\supset \\phi n \\}\n  \\]\n\n \n\n\nIn contemporary set theory the notion of the successor of a number is\ndefined directly for the ordinals as \\(s(x) =  x \\cup \\{x \\} \\)\nrather than by adding 1, and addition is defined using the familiar\nrecursive definition: \n\n\\[\n\\begin{align}\nx + 0 & = x\\\\\nx + s(y) & = s (x + y)\n\\end{align}\n\\]\n\n\nThe use of recursive definitions is justified by a theorem proving\nthat they describe a unique function. The induction axiom is justified\nby showing that any class that contains 0, and for any number n\ncontains \\(s(n)\\) will contain all of the numbers in \\(\\omega\\). The\nexistence of \\(\\omega\\) is guaranteed by the ZF axiom of infinity.\n\nAt this point, after 225 pages in Volume II, the reader will see how\nto compare the logicist reduction of arithmetic in PM with rival\naccounts of Frege and of contemporary set theory.\n\nFrege completes his development of the natural numbers at page 68 of the Volume II of his\nBasic Laws of Arithmetic published in 1903, which follows the\n250 pages of Volume I that had been published in 1893. So both Frege\nand the authors of PM took great pains to prove more advanced theorems\nonly after a chain of closely argued lemmas based on their own\nformalized symbolic logic.\n\nFrege ends his deductions of the laws of arithemtic with results about\nthe notions of 0, Successor, and the principle of Induction which\ninclude the Peano Axioms. He does not consider arithmetical functions,\nsuch as addition or multiplication, and thus does not define the\nsuccessor of a number n as the result of adding 1 to\nn.\n\nFrege’s account is streamlined in other ways as well. He had\nalways considered the analysis of simple identity sentences to be\nimportant to his logicism, dating back to the Begriffsschrift\n(1879), on through his Foundations of Arithmetic (1884) and\nhis “On Sense and Reference” (1892), and even in the\nappearance of the example “\\(2^2 = 2 + 2\\)” in the forward\nto the Basic Laws of Arithmetic. Indeed the analysis of\nidentity sentences is the starting point of his introduction of the\ntheory of sense and reference in 1879,\nyet Frege does not diverge from\nhis project enough to show how such an identity would be proved. So\nWhitehead and Russell might well have wanted to include their proof of\n\\(1+1 = 2\\) at ∗110·643 as a reminder of\nthe analysis of mathematical equations in PM using the\n“descriptive functions” of ∗30 and\nthen the account of definite descriptions in\n∗14.\n\nFrege also does not construct the general theory of the arithmetic of\ncardinal and ordinal numbers that occupies PM for much of Part III.\nIndeed, after the theorems on Arithmetic in §54 which concludes\nPart II of Basic Laws of Arithmetic, Frege jumps directly to\nthe topic of Real Numbers for the remainder of Volume II. Judging\nsimply on the amount of theorems that had to be proved in leading to\nthe account of Peano Arithmetic, PM does not differ wildly from\nFrege’s earlier attempt.\n\nAdmittedly the system of PM is an indirect and cumbersome system to\ndevelop if the theory of Arithmetic were the only goal in mind.\nFirstly, however, the system of the ramified theory of types is\nindependently interesting for the foundations of logic that it\nprovides. After ∗20 the theory of classes, and\ndevelopment of general notions of arithmetic for relations which\nfollows, does present the arithmetic of the natural numbers as a\nspecial case which can be generalized to the arithmetic of ordinal and\ncardinal numbers all in a logic with a simple hierarcy of types. The\nsurvey below of what follows in Volume II and Volume III shows the\nparticular way of developing the theory of rational and then real\nnumbers that PM follows. The results in set theory will seem\nprimitive, as the results are dated to around 1908, at just the point\nwhen axiomatic set theory began its extraordinary development.\nWhitehead and Russell were not active contributors to set theory and\nso PM should not be studied for later technical results that may have\nbeen anticipated here. Russell summarized results in PM from the\ncurrent state of the study of infinite cardinals and ordinals in a\npaper he give in Paris in a paper called “On the Axioms of the\nInfinite and Transfinite” (Russell 1911). There is, however, one\nresult concerning two notions of infinity that appears to originate\nwith PM.\nDedekind Infinity\n\nIn PM a class is a finite “inductive” class if\nand only if it can be put into a one to one correspondence with the\nNatural Numbers less than or equal to some natural number \\(n\\). It will\nbe infinite if and only if it is not inductive.\n\nA class is Dedekind Infinite (Reflexive) if and only\nif it can be put in a one to one correspondence with a proper subset\nof itself.\n\nThe key theorem in this section is: \n\n\\[\n\\tag*{∗124·57}\n\\textrm{If } y \\textrm{ is not inductive then } 2^{2^y} \\textrm{ is reflexive.}\n\\]\n\n\nThe Inductive and Reflexive notions of infinity coincide if one\nassumes that axiom of Choice. This result does not assume the axiom of\nChoice.\n\nGeorge Boolos (1994: 27) describes the details of this argument and\nquotes J.R. Littlewood as saying:\n\n\nHe [Russell] has a secret craving to have proved some\nstraight mathematical theorem. As a matter of fact there is\none: “\\(2^{2^{\\alpha}} > \\aleph_0\\) if \\(\\alpha\\) is\ninfinite”. Perfectly good mathematics.\n\n\nAs use of the Axiom of Choice is explicitly indicated, and many\nresults do not use it, the unique contribution to set theory of PM may\nbe in its indication of what can be proved without assuming\nChoice.\n5.3 Part IV: Relation-Arithmetic\n\nRelation Arithmetic is the study of the generalization of\ncardinal and ordinal numbers to classes of similar classes where\nsimilarity is based on an arbitrary relation. A relation P is\nsimilar to a relation Q, if there is a one to one relation\nS (a correlator) relating the domain of P to\nthe domain of Q so that if \\(x\\relP y\\) for some x and\ny then if \\(x\\relS w\\) and \\(w\\relQ z\\) then \\(z \\relbS y\\).\nThe mapping S is an isomorphism between the relations P\nand Q. A relation number will then be a class of\nrelations that are similar to each other. Relation Arithmetic then\ngeneralizes the notions of cardinal arithmetic,  such as sum and\nproduct, to arbitrary relation numbers. Russell himself expressed regret that the material in\nPart IV was not more carefully studied by his contemporaries (Russell\n1959: 86). If a series \\( \\relP \\) is well-ordered, then the class of relations ordinally similar to \\( \\relP \\)  will be an ordinal number. The sums of ordinal numbers are are studied in Tarski (1956), but there has been little interest in the more general notion of Relation Arithmetic presented in these sections of PM. See Solomon (1989).\nOrdinal Similarity\n\n∗151·01P\nand Q are similar ordinally\n\n\\[ \\eqdf \\exists S [S: \\Domain \\; P \\stackrel{1-1}{\\longrightarrow}\n\\Domain \\; Q \\amp P = S \\circ Q \\circ {\\relbS} ] \\]\n\n\n\nP and Q are similar ordinally, written \\(P\n\\smor Q\\), just in case there is a one to one mapping \\( \\relS \\) of\nthe domain of P into the domain of Q such if \\(x\\relP\ny\\), \\(x \\relS z\\), and \\( z \\relQ w \\) then \\(w \\relbS y\\).\n\nThe sum of series P and Q, \\(P \\oplus Q\\),\nis defined as: \n\n\\[\\begin{align} \\tag*{∗160·01} &\\ P \\oplus Q \\eqdf\n\\\\ &\\quad\\{ \\langle x, y \\rangle | \\; x\\relP y \\lor x \\relQ y \\lor\n[ \\exists z (z\\relP x \\lor x\\relP z)\\; \\amp \\; \\exists z (z\\relQ y\n\\lor y\\relQ z ) ] \\} \\end{align}\\]\n\n\nAs it is put in the headnote to ∗160: \n\n\n…we may regard the sum of P and Q as a relation\nwhich holds between x and y when either x\nprecedes y in the P series, or x precedes\ny in the Q series, or x belongs to the\nP-series and y belongs to the Q-series.\n\n\nThe product of series P and Q, \\(Q \\otimes\nP\\), relates pairs of members of the  field  of P to members of the  field   of Q as follows. ( This should not be confused with the more familiar notion of  relative product which was defined in ∗34.) \n\nAs it is put in the headnote to ∗166: \n\n The product \\( \\relQ \\otimes P \\) is … a relation which has for\nits field all the couples that can be formed by choosing a the\nreferent in \\(C ‘ P \\) and the relatum in \\(C ‘ Q \\).\nThese couples are arranged by \\( \\relQ \\otimes \\relP \\) on the\nfollowing principle: If the relatum of the one couple has the relation\n\\( \\relQ \\) to the relatum of the other, we put the one before the\nother, and if the relata of the two couples are equal while the\nreferent of the one has the relation \\( \\relP \\) to the referent of\nthe other, we put the one before the other. \n\n\n\\[\\begin{align}\n\\tag*{∗166·112}\n&\\ \\langle x, z \\rangle Q  \\otimes P \\langle y, w \\rangle {}\\\\\n&\\quad\\equiv [ ( x,y \\in Field \\; P \\;  \\amp \\; z,w \\in Field \\; Q ) \\; \\amp \\; zQw ] \\lor ( z = w \\; \\amp \\; xPy )\n\\end{align}\\]\n\n\n(Notice that while the \\( sum \\) of two binary relations is a binary relation, their \\( product \\) is a relation between pairs. This is the generalization from classes to relations of the fact that the cardinality of the relative product of two classes is the cardinality of the class of ordered pairs of elements taken one from each.) It is possible to prove results that show the differences between products and sums of\nrelations and of numbers. The product of relations is associative:\n\n\n\\[\n\\tag*{∗166·42} \n(P \\otimes Q) \\otimes R \\text{ is ordinally similar to }  P \\otimes (Q \\otimes R)\n\\]\n\n\nThe relations distribute in one way: \n\n\\[\n\\tag*{∗166·45} \n(Q \\oplus R) \\otimes P = (Q \\otimes P) \\oplus (R \\otimes P)\n\\]\n\n\nHowever, it does not hold in general that: \n\n \\[P \\otimes (Q \\oplus R) = (P \\otimes Q) \\oplus (P \\otimes R).\\]\n\n\n\n\n\nFor the purposes of defining rational and real numbers as relations\nbetween relations, it is necessary to define the ordering relation\nbetween individuals related by the relation, that is, in the domain or\nrange (the field) of the relations. This is described in the\nsummary of ∗170 and a theorem as follows:\n\n\n…\\(\\alpha\\) is said to precede \\(\\beta\\)…if we consider\nthe two classes \\(\\alpha - \\beta\\) and \\(\\beta - \\alpha\\), there are\nmembers of \\(\\alpha - \\beta\\) which are not preceded by any members of\n\\(\\beta - \\alpha\\). (Vol. II, 1912: 411 and 1927: 399)\n\n\n∗170·01\n\\(\\alpha \\) precedes \\( \\beta \\) in the relation \\(P \\)\n\n\\[\n\\alpha P_{lc}\\beta \\equiv  \\exists x \\{ x \\in ( \\alpha - \\beta) \\amp \\lnot [ \\exists y\n(y \\in \\beta - \\alpha \\amp y\\relP x)] \\}\n\\]\n\n\n\nThe notions of the sum and product of relation numbers is defined as\nthe relation number of the sum and product of the relations, with\nadjustments made so that the types of the relations are uniform, and\nthe numbers contain disjoint relations, as was seen in the definition\nof sum for cardinal numbers in ∗110 above. If\nx and y are relation numbers, their sum is \\(x \\dot{+}\ny\\) and the product is \\(x \\dot{\\times} y\\).\n\nIt is proved that the operation of sum for relation numbers is associative\nand other properties that directly follow from the corresponding\nproperties of the sums and products of relations. Among the many\ntheorems is the fact that sum for relation numbers is associative:\n\n\\[\n\\tag*{∗180·56}\n( y \\dot{+} x ) \\dot{+} \\rho = y \\dot{+} ( x \\dot{+} \\rho)\n\\]\n\n\nThe distribution of product of relation numbers over sum for relation\nnumbers holds in one form: \n\n\\[\n\\tag*{∗184·42} \n( x \\dot{+} \\rho) \\dot{\\times} y = (x \\dot{\\times} y) \\dot{+} ( \\rho \\dot{\\times} y )\n\\]\n\n5.4 Part V: Series\n\nA series (linear ordering) is defined as a relation\nthat is irreflexive \\(\\forall x (\\lnot x\\relR x)\\),\ntransitive \\(\\forall x \\forall y \\forall z (x\\relR y \\amp\ny\\relR z \\supset x\\relR z)\\), and connected \\(\\forall x\n\\forall y (x\\relR y \\lor y\\relR x)\\).\n(∗204·01) (These properties are restricted\nto a specific domain for each relation. Thus a connected relation will\nhold between any two members of a given domain.) This is now called a\nlinear ordering of a given set.\nSequents\n\n\nThus sequents of \\(\\alpha\\) are its immediate successors. If\n\\(\\alpha\\) has a maximum, the sequents are the immediate successors of\nthe maximum; but if \\(\\alpha\\) has no maximum, there will be no one\nterm of \\(\\alpha\\) which is immediately succeeded by a sequent of\n\\(\\alpha\\); in this case, if \\(\\alpha\\) has a single sequent, the\nsequent is the “upper limit” of \\(\\alpha\\). (PM Vol. II,\n“Summary of ∗205”, 1912: 577 or 1927: 559)\n\nDedekindian Relations\n\n\nWe call a relation “Dedekindian” when it is such that\nevery class [bounded from above] has either a maximum or a sequent with respect to it. (PM\nVol. II, “Summary of ∗214”, 1912: 684 or 1927: 659)\n\n\n\nIn other words, when the relation \\(R\\) such as \\( \\pmlt \\) is Dedekindian when every class \\(\\alpha \\) has either a maximum or a sequent with respect to \\( R \\). This is the standard definition by which every segment with an upper bound\nhas a least upper bound. That least upper bound will either be the\nmaximum of the set or the least individual greater than all members of\nthe set.\n6. Volume III\n6.1 Part V: Series (continued)\nElementary properties of well ordered series.\n\nAt ∗250·51 we find a proof that the Axiom of Choice\nfollows from the Well-Ordering Principle, that is, that every set can\nbe well-ordered.\nThe series of Ordinals\n\nThe “Burali-Forti” paradox is described in the\nIntroduction to PM as one of the contradictions that can be resolved\nby the theory of types:\n\n\nIt can be shown that every well-ordered series has an ordinal\nnumber…and that the series of all ordinals (in order of\nmagnitude) is well-ordered. It follows that the series of all ordinals\nhas an ordinal number, \\(\\Omega\\) say. But in that case the series of\nall ordinals including \\(\\Omega\\) has the ordinal number \\(\\Omega +\n1\\), which must be greater than \\(\\Omega\\), Hence \\(\\Omega\\) is not\nthe ordinal number of all ordinals. (PM Vol. I, 1925: 61 and 1910:\n63)\n\n\nIn ∗256 we find the resolution of the Burali-Forti\ncontradiction in observing the relative types of classes of ordinals.\nOrdinal numbers, as classes of isomorphic series, will be of a higher\ntype than their members. The purported “ordinal number of all\nordinal numbers” \\(\\Omega\\) will be restricted to a type above\nthe type of the ordinals that are its members. Just as there is no\nclass of all classes (of some type or other) there is also no ordinal\nof all ordinal numbers.\n\nTheorem ∗256·56 demonstrates that “in\nhigher types there are greater ordinals than any to be found in lower\ntypes”. (PM Vol.III, 75)\nZermelo’s Theorem\n\n∗258·326\nAssuming the Axiom of Choice, every set can be\nwell-ordered.\n\n\nThis proof of Zermelo’s theorem follows Zermelo’s\n“new proof” of Zermelo (1908). Together with\n∗250·51 this shows that the Axiom of Choice\nis equivalent to the Well Ordering principle.\nThe Transfinite Ancestral Relation\n\nThe discussion of “transfinitely hereditary” properties in\n∗257 constitutes the discussion of\n“transfinite induction” that Russell pointed out to\nReichenbach in the discussion reported above from Russell (1959:\n86),\nFinite Ordinals\n\nIt is shown in ∗262 that every infinite well\nordered series consists of a series (well ordered set) of\nprogressions. (\\(\\omega\\) orderings).\nThe series of Alephs\n\nA result of Hausdorff in (1906),\nthat \\(\\omega_1\\), the first\nuncountable ordinal) is not the limit of a progression of smaller\nordinals is shown to follow if one assumes the Axiom of Choice\n(∗265·49). It is then conjectured that this\ncannot be shown without relying on the Axiom of Choice. See\nGrattan-Guinness (2000: 403) for a discussion of Hausdorff’s\ninfluence on the content of PM.\n\nDorothy Wrinch, who had been a member of Russell’s circle of\nunofficial students during the war, published in 1919 an article on\nDedekindian series of ordinal numbers. She describes the result as\ninvestigating “necessary and sufficient conditions that \\(P^Q\\)\nshould be Dedekindian or semi-Dedekindian when P and Q\nare well ordered series” (Wrinch 1919: 219). This study follows\nup the result in ∗124 that is described in Boolos\n(1994), as an investigation of the arithmetic of ordinals without\nassuming the Axiom of Choice. Wrinch’s paper  follows not only\nthe notation of PM, but also makes use of theorems up\nto the end of section V on Series, with numbers following the dot, and\nso could easily be added as ∗277. Russell intended\nto found a school of “mathematical philosophy”, and of\ncourse succeeded in attracting Ludwig Wittgenstein to the foundational\nissues in PM, but there is no other indication of logicians attempting\nto set their results in the framework of PM.\n6.2 Part VI: Quantity\n  The later portions of PM\nshould thus be studied for a hint of how the real numbers and the use\nof mathematics in measurement can be developed with this rival\nfoundation on the theory of relations. Gandon (2008, 2012) argues that\nthe application of mathematics is better explained using this logicist\naccount than by rivals.\n\nIn ∗300–∗314, positive\nand negative integers, ratios and real numbers all defined. The goal\nof the section is to begin the study of how these numbers are used in\nthe measurement of quantities in geometry and physics.\nRatios \n\n\\[ R n/m S \\eqdf \\forall x \\forall y ( x\\rels{R^n} y \\supset\nx\\rels{S^m}y) \\]\n\n\nfor n, m relatively prime.\n\nRelations R and S stand in the ratio of\nn to m when \\(x\\rels{R^n} y\\) then \\(x\\rels{S^m} y\\),\nwhere \\(R^n\\) is the n-th power of R and \\(S^m\\) is the\nm-th power of S (see ∗91). The ratio\nof two relations is represented by numbers n and m that\nare relatively prime, namely, if \n\n \\[\\forall j \\forall k \\forall l [(n = j \\times l \\amp m = k \\times l\n )\\supset l = 1].\\]\n\n\nRatios thus are relations between relations. Rational\nNumbers, in keeping with the generalized notions of all numbers\nin PM will be classes of similar ratios, and thus the work of\ndeveloping the theory of rational, and then real numbers, is carried\nout in terms of ratios and relations between ratios.\nReal Numbers\n\nThe real numbers \\(\\Theta\\) are defined as “the series of\nsegments of the series of ratios”, or the set of Dedekind cuts\nof the sequence of rational numbers, in their standard ordering.\nTechnically \\(\\Theta\\) is a relation in extension. The individuals\nthat are related in the ratios, and thus at the basis of the series of\nrational numbers must be infinite in number for the PM version of the\nreal numbers to have the structure we expect. In the introductory\nmaterial to the section they point out that while the construction of\nthe reals thus requires the Axiom of Infinity, they add it explicitly\nto the theorems where needed and try as much as possible to derive the\nresults upon which it does not rely without making that\nassumption.\n\nThe theory of real numbers in PM is closer to that of Frege than the\n“arithmetizing” accounts of Dedekind or Cantor. Dedekind\npostulated that irrational numbers are to be “created” to\nfill out the gaps in the series of rational numbers that are marked by\nDedekind cuts (Dedekind 1872 [1901: 15], while Cantor (1883: §9, para. 8\n[1996: 899]) identified real numbers with the limits of sequences of rational\nnumbers.\n\nFrege, and PM, however, see real numbers as abstracted from the\nsimiliarity of relations with a certain structure. See Gandon (2012)\nfor a fine grained comparison of the Frege and Russell\nconstructions.\n\nIt is interesting to note that the overall structure and contents of\nsections in PM and Basic Laws are similar. They both share a\nfirst section on the symbolic logic that they will use, then a series\nof definitions and theorems about the notions of number and concepts\nused in arithmetic, with a concluding section on real numbers. While\nthe range of the mathematics that is to be reduced to logic in the two\nworks is the same, Frege restricts his work more directly to natural\nand real numbers, while PM includes the theory of classes and\narithmetic of relations and relations and infinite sets. While all of\nthese topics are handled in the initial chapters of a contemporary\ntextbook in axiomatic set theory, as Urquhart (2013) suggests, this\nmay be the inevitable fate of even the most groundbreaking\nmathematical works.\n\nThe addition and multiplication of real numbers is defined in the next\nsections as they are for other numbers, but taking disjoint instances\nof each number similarity class, and performing the corresponding\noperation on them. Many results assume the Axiom of Infinity as an\nhypothesis. The operations are symbolized as \\(+_s\\) and\n\\(\\times_s\\).\n\n\nMeasurement—i.e. the application of ratios and real\nnumbers to magnitudes—will be dealt with in Section C; for the\npresent, we shall confine ourselves to those properties of magnitude\nwhich are presupposed by measurement.…\n\nWe conceive of a magnitude as a vector, i.e. as an operation,\ni.e. as a descriptive function in the sense of\n∗30. Thus for example, we shall so define our\nterms that 1 gramme would not be a magnitude, but the difference\nbetween 2 grammes and 1 gramme would be a magnitude, i.e. the\nrelation “+1 gramme” would be a magnitude. On the other\nhand a centimetre and a second would both be magnitudes according to\nour definition, because distances in space and time are\nvectors.…\n\nWe demand of a vector (1) that it shall be a one-one relation, (2)\nthat it be capable of indefinite repetition, i.e. that if the\nvector takes us from a to b, there shall always be a\npoint c such that the vector takes us from b to\nc. (PM, Vol. III, “Summary of Section B”, 1913: 339\nand 1927: 339)\n\n\nThe kinds of quantity addressed in this section and the next are\nall\n\n\nvector families that is, classes of one-one relations all\nhaving the same converse domain, and all having the domain contained\nin the converse domain. (PM Vol. III, 350)\n\n6.2.1 Measurement\n\nMeasurement in PM is based on the relations between objects that are\nthe basis for the operation of measurement, that one object is heavier\nthan another, or longer than another. Quantities are then equivalence\nclasses of objects which have the same relations to others. Operations\nare defined on quantities, so that:\n\n\n…that is to say, two-thirds of a pound of cheese ought to be\n\\((2/3 \\times_s 1/2)\\) of a pound of cheese, and similarly in every\nother case. (PM, Volume III, 407)\n\n\nPM concludes with a seemingly dangling excursion into the special case\nof the measurement of “Cyclic Families”. For “such\ncases as the angles at a point, or the elliptic straight line, we\nrequire a theory of measurement applicable to families which are not\nopen” (PM, Volume III, 457). The angles at a point will be\nmeasured from 0 to 360 degrees, and then start over again at 0 to\nmeasure an object rotating around a point. The many ratios that\nrepresent the rotations are represented by a “principal\nratio”, which is used to assign the measurement of degrees.\n6.2.2 There is no “Conclusion” at the end of PM\n\nPM ends abruptly with the proof of a theorem\n(∗375·32) concerning cyclic families,\nwithout any concluding remarks or hint of what is to come later. The\nthought is that further mathematics, including the Volume IV that\nWhitehead was to write on geometry, would have to be developed\npiecemeal. First the notions of a given branch of mathematics would\nhave to be defined in terms of earlier notions, such as classes of\nrelations with a given structure, and then the important basic results\nin that field would be proved one by one, in the style of the work so\nfar. Establishing logicism would be an ongoing project, as open-ended\nas mathematics itself.\n",
    "bibliography": {
        "categories": [
            "Primary Literature",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Russell, Bertrand, [PoM] 1903, <em>The Principles of\nMathematics</em>, Cambridge: Cambridge University Press.\n [<a href=\"https://archive.org/details/principlesmathe00russgoog/page/n5\" target=\"other\">PoM available online</a>]",
                "–––, 1905, “On Denoting”,\n<em>Mind</em>, 14(4): 479–493. doi:10.1093/mind/XIV.4.479",
                "–––, 1911, “On the Axioms of the Infinite\nand of the Transfinite”, printed in <em>Logical and\nPhilosophical Papers 1909–1913: The Collected Papers of Bertrand\nRussell, Vol. 6</em>, John G. Slater (ed.), London and New York:\nRoutledge, 1992, 41–53.",
                "–––, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: George Allen &amp; Unwin.",
                "–––, 1948, “Whitehead and <em>Principia\nMathematica</em>”, <em>Mind</em>, 57(226): 137–138.\ndoi:10.1093/mind/LVII.226.137",
                "–––, 1959, <em>My Philosophical\nDevelopment</em>, London: George Allen and Unwin, and New York: Simon\nand Schuster; reprinted London: Routledge, 1993. (Page numbers are to the 1959 edition.)",
                "–––, 1967, 1968, 1969, <em>The Autobiography of\nBertrand Russell</em>, 3 vols., London: George Allen and Unwin;\nBoston: Little Brown and Company (Vols 1 and 2), New York: Simon and\nSchuster (Volume 3).",
                "Whitehead, Alfred North, 1898, <em>A Treatise on Universal\nAlgebra</em>, Cambridge: Cambridge University Press.\n [<a href=\"https://archive.org/details/atreatiseonuniv00goog/page/n8\" target=\"other\">Whitehead 1898 available online</a>]",
                "–––, 1906, “On Mathematical Concepts of\nthe Material World”, <em>Philosophical Transactions of the Royal\nSociety A: Mathematical, Physical and Engineering Sciences</em>,\n205(387–401): 465–525. doi:10.1098/rsta.1906.0014",
                "–––, 1926, “Notes: Principia\nMathematica”, <em>Mind</em>, 35(137): 130.\ndoi:10.1093/mind/XXXV.137.130-a",
                "Whitehead, Alfred North, Bertrand Russell, and M.R. James, 1910,\nContract for the First Edition of <em>Principia Mathematica</em>,\nreprinted in “Illustrations: Manuscripts Relating to Principia\nMathematica”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 31(1): 82. doi:10.15173/russell.v31i1.2199",
                "Whitehead, Alfred North and Bertrand Russell, 1910, 1912, 1913,\n<em>Principia Mathematica</em>, 3 volumes, Cambridge: Cambridge\nUniversity Press; 2nd edition, 1925 (Vol. I), 1927 (Vols II, II);\nabridged as <em>Principia Mathematica to ∗56</em>, Cambridge:\nCambridge University Press, 1956. (Page numbers are to the second\nedition.)\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Borel, Émile, 1898, <em>Leçons Sur La Théorie\nDes Fonctions</em>, Paris.",
                "Bernays, Paul, 1926, “Axiomatische Untersuchungen des\nAussagen-Kalkuls der <em>Principia Mathematica</em>”,\n<em>Mathematische Zeitschrift</em>, 25: 305–320.\ndoi:10.1007/BF01283841",
                "Blackwell, Kenneth, 2005, “A Bibliographical Index for\n<em>Principia Mathematica</em>”, <em>Russell: The Journal of\nBertrand Russell Studies</em>, 25(1): 77–80.\ndoi:10.15173/russell.v25i1.2072",
                "–––, 2011, “The Wit and Humour of\n<em>Principia Mathematica</em>”, in Griffin, Linsky, and\nBlackwell 2011: 151–160. doi:10.15173/russell.v31i1.2198",
                "Boolos, George, 1971, “The Iterative Conception of\nSet”, <em>Journal of Philosophy</em>, 68(8): 215–231.\ndoi:10.2307/2025204",
                "–––, 1994, “The Advantages of Honest Toil\nover Theft”, <em>Mathematics and Mind</em>, Alexander George\n(ed.), Oxford: Oxford University Press, 27–44.",
                "Burgess, John P., 2005, <em>Fixing Frege</em>, Princeton:\nPrinceton University Press.",
                "Cantor, Georg, 1883 [1996], <em>Grundlagen einer allgemeinen\nMannigfaltigkeitslehre. Ein mathematisch-philosophischer Versuch in\nder Lehre des Unendlichen</em>, Teubner, Leipzig. Printed as\n“Foundations of a General Theory of Manifolds: A\nMathematico-Philosophical Investigation into the Theory of the\nInfinite” in <em>From Kant to Hilbert: A Source Book in the\nFoundations of Mathematics</em>, Vol. II, William Ewald (trans.),\nOxford: Oxford University Press, 1996, 878–920.",
                "–––, 1895 &amp; 1897 [1915],\n“Beiträge zur Begründung der transfiniten\nMengenlehre”, <em>Mathematische Annalen</em>, (1895) 46(4):\n481–512 &amp; (1897) 49(2): 207–246. Translated as\n<em>Contributions to the Founding of the Theory of Transfinite\nNumbers</em>, Philip E.B. Jourdain (trans), Chicago: Open Court, 1915.\ndoi:10.1007/BF02124929 (de) doi:10.1007/BF01444205 (de)",
                "Chihara, Charles S., 1973, <em>Ontology and the Vicious Circle\nPrinciple</em>, Ithaca, NY: Cornell University Press.",
                "Church, Alonzo, 1974, “Russellian Simple Type Theory”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 47: 21–33. doi:10.2307/3129899",
                "–––, 1976, “Comparison of Russell’s\nResolution of the Semantical Antinomies with That of Tarski”,\n<em>The Journal of Symbolic Logic</em>, 41(04): 747–760.\ndoi:10.2307/2272393",
                "Chwistek, Leon, 1912 [2017], “Zasada sprzeczności w\nświetle nowszych badań Bertranda Russella”, Rozprawy\nAkademii Umiejętności (Kraków), Wydzial  \nhistoryczno-filozoficzny, Series II. 30: 270–334. Translated by Rose Rand as\n“The Law of Contradiction in the Light of Recent Investigations\nof Bertrand Russell”, in <em>The Significance of the Lvov-Warsaw\nSchool in the European Culture</em>, Anna Brożek, Friedrich\nStadler, and Jan Woleński (eds.), Cham: Springer International\nPublishing, 2017, 227–289. doi:10.1007/978-3-319-52869-4_13",
                "–––, 1921 [1967], “Antynomie logiki\nformalnej”, <em>Przegla̧d Filozoficzny</em>, 24: 164–171.\nPrinted as “Antinomies of Formal Logic”, Z. Jordan\n(trans.), in <em>Polish Logic 1920-1939</em>, Storrs McCall (ed.),\nOxford: Clarendon Press, 1967, 338–345.",
                "Collins, Jordan E., 2012, <em>A History of the Theory of Types:\nDevelopments after the Second Edition of Principia Mathematica</em>,\nSaarbrücken: Lambert Academic Publishing.",
                "Copi, Irving M., 1950, “The Inconsistency or Redundancy of\n<em>Principia Mathematica</em>”, <em>Philosophy and\nPhenomenological Research</em>, 11(2): 190–199.\ndoi:10.2307/2103637",
                "–––, 1971, <em>The Theory of Logical Types</em>,\nLondon: Routledge and Kegan Paul.",
                "Dedekind, Richard, 1872 [1901], <em>Stetigkeit und irrationale\nZahlen</em>, Braunschweig: Vieweg. Translated 1901, “Continuity\nand Irrational Numbers”, Wooster Woodruff Beman (trans.),\nin <em>Essays on the Theory of Numbers</em> Chicago: Open Court.\ndoi:10.1007/978-3-322-98548-4",
                "Eliot, T.S., 1927, “A Commentary”, <em>The Monthly\nCriterion</em>, 6(4), 289–291.",
                "Enderton, Herbert B., 1977, <em>Elements of Set Theory</em>, New\nYork: Academic Press.",
                "Ewald, William and Wilfried Sieg (eds), 2013, <em>David\nHilbert’s Lectures on the Foundations of Arithmetic and Logic\n1917–1933</em>, Berlin: Springer Verlag. doi:\ndoi:10.1007/978-3-540-69444-1",
                "Frege, Gottlob, 1879 [1967], <em>Begriffsschrift: Eine Der\nArithmetische Nachgebildete Formelsprache des Reinen Denkens</em>,\nHalle a/S: Louis Nebert. Translated by Stefan Bauer-Mengelberg as\n“<em>Begriffsschrift</em>, A Formula Language, Modeled Upon that\nof Arithmetic, for Pure Thought” in Jean van Heijenoort (ed.),\n<em>From Frege to Gödel: A Source Book in Mathematical Logic,\n1879-1931</em>, Cambridge, MA: Harvard University Press, 1967,\n1–82.\n [<a href=\"https://gallica.bnf.fr/ark:/12148/bpt6k65658c\" target=\"other\">Frege 1879 available online (de)</a>]",
                "–––, 1884 [1950], <em>Die Grundlagen der\nArithmetik: Eine logisch mathematische Untersuchung über den\nBegriff der Zahl</em>, Breslau: Koebner, translated by J.L. Austin as\n<em>The Foundations of Arithmetic: A logico-mathematical enquiry into\nthe concept of number</em>, Oxford: Basil Blackwell, 1950.",
                "–––, 1892 [1984], “Über Sinn und\nBedeutung”, <em>Zeitschrift für Philosophie und\nphilosophische Kritik</em> 100, 25-50, translated by Max Black as\n“On Sense and Meaning” in <em>Gottlob Frege: Collected\nPapers on Mathematics, Logic, and Philosophy</em>, Brian McGuinness,\ned., Oxford: Basil Blackwell, 1984, 157–177.",
                "–––, 1893/1903 [2013], <em>Grundgesetze der\nArithmetik</em>, Band I (1893), Band II (1903), Jena: Verlag Hermann\nPohle. Translated (preserving the original pagination) by Philip A. Ebert &amp; Marcus Rossberg with\nCrispin Wright as <em>Basic Laws of Arithmetic</em>, Oxford: Oxford\nUniversity Press, 2013.",
                "–––, 1980, <em>Philosophical and Mathematical\nCorrespondence</em>, G. Gabriel, et al. (eds.), Chicago: University of\nChicago Press.",
                "Gabbay, Dov M. and John Woods (eds.), 2009, <em>Handbook of the\nHistory of Logic, Volume 5: Logic From Russell to Church</em>,\nAmsterdam: Elsevier/North Holland.",
                "Gandon, Sébastien, 2008, “Which Arithmetization for\nWhich Logicism? Russell on Relations and Quantities in The Principles\nof Mathematics”, <em>History and Philosophy of Logic</em>,\n29(1): 1–30. doi:10.1080/01445340701398530",
                "–––, 2011, “<em>Principia\nMathematica</em>, part VI: Russell and Whitehead on Quantity”,\n<em>Logique et Analyse</em>, 54(214): 225–247.\n [<a href=\"http://virthost.vub.ac.be/lnaweb/ojs/index.php/LogiqueEtAnalyse/article/view/1777/1555\" target=\"other\">Gandon 2011 available online</a>]",
                "–––, 2012, <em>Russell’s Unknown\nLogicism</em>, New York: Palgrave Macmillan.",
                "Gödel, Kurt, 1933 [1995], “The Present Situation in the\nFoundations of Mathematics”, lecture delivered to the\nMathematical Association of America and the American Mathematical\nSociety, Cambridge, MA, December 1933. Printed in <em>Kurt Gödel:\nCollected Works</em>, Vol. II, Solomon Feferman, et al. (eds.), Oxford\nand New York: Oxford University Press, 1995, 45–53.",
                "–––, 1944 [1951], “Russell’s\nMathematical Logic”, in <em>The Philosophy of Bertrand\nRussell</em>, Paul Arthur Schilpp (ed.), first edition, Chicago:\nNorthwestern University, 1944; third edition, New York: Tudor, 1951,\n123–153.",
                "Grattan-Guinness, I., 2000, <em>The Search for Mathematical Roots,\n1870-1940: Logics, Set Theories and the Foundations of Mathematics\nfrom Cantor Through Russell to Gödel</em>, Princeton and Oxford:\nPrinceton University Press.",
                "Griffin, Nicholas and Bernard Linsky (eds.), 2013, <em>The\nPalgrave Centenary Companion to Principia Mathematica</em>, London:\nPalgrave Macmillan. doi:10.1057/9781137344632",
                "Griffin, Nicholas, Bernard Linsky and Kenneth Blackwell (eds.),\n2011, <em>Principia Mathematica at 100</em>, Hamilton, ON: Bertrand\nRussell Research Centre; also published as a special issue of\n<em>Russell: The Journal of Bertrand Russell Studies</em>, 31(1).\n [<a href=\"https://mulpress.mcmaster.ca/russelljournal/issue/view/229\" target=\"other\">Griffin, Linsky, and Blackwell 2011 available online</a>]",
                "Guay, Alexandre (ed.), 2012, <em>Autour de Principia Mathematica\nde Russell et Whitehead</em>, Dijon: Editions Universitaires de\nDijon.",
                "Hale, Bob and Crispin Wright, 2001, <em>The Reason’s Proper\nStudy: Essays towards a Neo-Fregean Philosophy of Mathematics</em>,\nOxford: Oxford University Press. doi:10.1093/0198236395.001.0001",
                "Hausdorff, Felix, 1906, “Untersuchungen über\nOrdnungstypen”, <em>Berichte der Königlichen Sächsische\nAkademie der Wissenschaft</em> (Leipzig), 58: 106–169; 59:\n84–159.",
                "Hilbert, David and W. Ackermann, 1928, <em>Grundzüge der\ntheoretischen Logik</em>, Berlin: Julius Springer Verlag. Translated\nas “Principles of Mathematical Logic”, Providence:\nAmerican Mathematical Society, 1958.",
                "Hilbert, David and Paul Bernays, 1934, <em>Grundlagen der\nMathematik</em>, Berlin: Julius Springer Verlag.",
                "Hinkis, Arie, 2013, <em>Proofs of the Cantor-Bernstein Theorem: A\nMathematical Excursion</em>, New York, Dordrecht, London:\nBirkhäuser.",
                "Hintikka, Jaakko, 2009, “Logicism”, in Irvine 2009:\n271–290. doi:10.1016/B978-0-444-51555-1.50010-9",
                "Irvine, Andrew D. (ed.), 2009, <em>Philosophy of Mathematics</em>\n(Handbook of the Philosophy of Science), Amsterdam: Elsevier.\ndoi:10.1016/B978-0-444-51555-1.X0001-7",
                "Kahle, Reinhard, 2013, “David Hilbert and <em>Principia Mathematica</em> in Poland”, in\nGriffin and Linsky, 2013: 21–34.",
                "Kanamori, Akihiro, 2009, “Set Theory from Cantor to\nCohen”, in Irvine 2009: 395-459.\ndoi:10.1016/B978-0-444-51555-1.50014-6",
                "Kleene, S.C., 1952, <em>Introduction to Metamathematics</em>,\nPrinceton: Van Nostrand.",
                "Landini, Gregory, 1998, <em>Russell’s Hidden Substitutional\nTheory</em>, New York and Oxford: Oxford University Press.",
                "–––, 2011, <em>Russell</em>, London and New\nYork: Routledge.",
                "–––, 2016, “Whitehead’s\n(<em>Badly</em>) Emended <em>Principia</em>”, <em>History and\nPhilosophy of Logic</em>, 37(2): 114–169.\ndoi:10.1080/01445340.2015.1082063",
                "Link, Godehard (ed.), 2004, <em>One Hundred Years of\nRussell’s Paradox</em>, Berlin and New York: Walter de\nGruyter.",
                "Linsky, Bernard, 1990, “Was the Axiom of Reducibility a\nPrinciple of Logic?” <em>Russell</em>, 10: 125–140;\nreprinted in A.D. Irvine (ed.), 1990, <em>Bertrand Russell: Critical\nAssessments</em>, 4 vols., London: Routledge, vol. 2, 150–264.\ndoi:10.15173/russell.v10i2.1775",
                "–––, 1999, <em>Russell’s Metaphysical\nLogic</em>, Stanford: CSLI Publications.",
                "–––, 2002, “The Resolution of Russell’s\nParadox in <em>Principia Mathematica</em>”, <em>Philosophical\nPerspectives</em>, 16: 395–417.\ndoi:10.1111/1468-0068.36.s16.15",
                "–––, 2003, “Leon Chwistek on the\nNo-Classes Theory in <em>Principia Mathematica</em>”,\n<em>History and Philosophy of Logic</em>, 25(1): 53–71.\ndoi:10.1080/01445340310001614698",
                "–––, 2004, “Classes of Classes and Classes\nof Functions in <em>Principia Mathematica</em>”, in Link 2004:\n435–447.",
                "–––, 2009, “From Descriptive Functions to\nSets of Ordered Pairs”, in Alexander Hieke and Hannes Leitgeb,\n<em>Reduction-Abstraction-Analysis</em>, Vol. 11 of Publications of\nthe Austrian Ludwig Wittgenstein Society, new series, Frankfurt: Ontos\nVerlag, 259-272.",
                "–––, 2011, <em>The Evolution of Principia\nMathematica: Bertrand Russell’s Manuscripts and Notes for the\nSecond Edition</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511760181",
                "–––, 2016, “Propositional Logic from\n<em>The Principles of Mathematics</em> to <em>Principia\nMathematica</em>”, in <em>Early Analytic Philosophy: New\nPerspectives on the Tradition</em>, Sorin Costreie (ed.), Cham:\nSpringer International Publishing, 213–229.\ndoi:10.1007/978-3-319-24214-9_8",
                "Linsky, Bernard and Kenneth Blackwell, 2005, “New Manuscript\nLeaves and the Printing of the First Edition of <em>Principia\nMathematica</em>”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 25(2): 141–154.\ndoi:10.15173/russell.v25i2.2084",
                "Mares, Edwin D., 2007, “The Fact Semantics for Ramified Type\nTheory and the Axiom of Reducibility”, <em>Notre Dame Journal of\nFormal Logic</em>, 48(2): 237–251.\ndoi:10.1305/ndjfl/1179323266",
                "Mayo-Wilson, Conor, 2011, “Russell on Logicism and\nCoherence”, in Griffin, Linsky, and Blackwell 2011: 63–79.\ndoi:10.15173/russell.v31i1.2206",
                "Myhill, John, 1974, “The Undefinability of the Set of\nNatural Numbers in the Ramified <em>Principia</em>”, in\n<em>Bertrand Russell’s Philosophy</em>, George Nakhnikian (ed.),\nLondon: Duckworth, 19-27.",
                "Proops, Ian, 2006, “Russell’s Reasons for Logicism”,\n<em>Journal of the History of Philosophy</em>, 44(2): 267–292.\ndoi:10.1353/hph.2006.0029",
                "Quine, W.V.O., 1951, “Whitehead and Modern Logic”, in\n<em>The Philosophy of Alfred North Whitehead</em>, P.A. Schilpp (ed.),\nNew York: Tudor Publishing, 125-163.",
                "–––, 1960, <em>Word and Object</em>, Cambridge:\nMIT Press.",
                "–––, 1963, <em>Set Theory and Its Logic</em>,\nCambridge: Harvard University Press",
                "–––, 1966a, <em>Selected Logic Papers</em>, New\nYork: Random House.",
                "–––, 1966b, <em>Ways of Paradox</em>, New York:\nRandom House.",
                "Ramsey, Frank, 1931, “The Foundations of Mathematics”,\nin his <em>The Foundations of Mathematics and Other Essays</em>,\nLondon: Kegan Paul, Trench, Trubner, 1-61.",
                "Rodriguez-Consuegra, Francisco, 1991, <em>The Mathematical\nPhilosophy of Bertrand Russell</em>, Boston: Birkhäuser Press;\nrepr. 1993.",
                "Shapiro, Stewart (ed.), 2005, <em>The Oxford Handbook of\nPhilosophy of Mathematics and Logic</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780195325928.001.0001",
                "Sheffer, Henry M., unpublished, <em>Notes on Bertrand Russell's\nLectures</em> (Cambridge, MA 1910), in Harvard University Archives: Henry Maurice Sheffer Personal Archive [accessions], 1891–1970. For further information see URL = &lt;<a href=\"http://id.lib.harvard.edu/alma/990138368470203941/catalog\" target=\"other\">http://id.lib.harvard.edu/alma/990138368470203941/catalog</a>&gt;.",
                "Solomon, Graham 1989, “What became of Russell's ‘relation arithmetic’?”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 9(2): 168 –173.",
                "Stevens, Graham, 2011, “Logical Form in <em>Principia\nMathematica</em>”, in Griffin, Linsky, and Blackwell 2011:\n9–28. doi:10.15173/russell.v31i1.2203",
                "Suppes, Patrick, 1960, <em>Axiomatic Set Theory</em>, Princeton:\nvan Nostrand.",
                "Tarski, Alfred, 1956, <em>Ordinal Algebras</em>, Amsterdam:\nNorth Holland.",
                "Urquhart, Alasdair, 1988, “Russell’s Zigzag Path to the\nRamified Theory of Types”, <em>Russell: The Journal of Bertrand\nRussell Studies</em>, 8(1): 82–91.\ndoi:10.15173/russell.v8i1.1735",
                "–––, 2012, Review of Bernard Linsky’s\n<em>The Evolution of Principia Mathematica: Bertrand Russell’s\nManuscripts and Notes for the Second Edition</em>, <em>Notre Dame\nPhilosophical Reviews</em>,\n [<a href=\"https://ndpr.nd.edu/news/the-evolution-of-principia-mathematica-bertrand-russell-s-manuscripts-and-notes-for-the-second-edition/\">Urquhart 2012 available online</a>].",
                "–––, 2013, “<em>Principia\nMathematica</em>: The First 100 Years”, in Griffin and Linsky\n2013: 3–20.",
                "Wahl, Russell, 2011, “The Axiom of Reducibility”, in\nGriffin, Linsky, and Blackwell 2011: 45–62.\ndoi:10.15173/russell.v31i1.2205",
                "Wiener, Norbert, 1914, “A Simplification of the Logic of\nRelations”, <em>Proceedings of the Cambridge Philosophical\nSociety</em>, 17: 387–90.\n [<a href=\"https://biodiversitylibrary.org/page/30512608\" target=\"other\">Wiener 1914 available online</a>]",
                "Wittgenstein, Ludwig, 1922, <em>Tractatus\nLogico-Philosophicus</em>, C.K. Ogden (trans.), London: Routledge\n&amp; Kegan Paul.",
                "Wolenski, Jan , 2013, “<em>Principia Mathematica</em> in Poland”, in\nGriffin and Linsky, 2013: 35–55.",
                "Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.",
                "Wrinch, Dorothy, 1919, “On the Exponentiation of\nWell-Ordered Series”, <em>Proceedings of the Cambridge\nPhilosophical Society</em>, 19: 219-233.\n [<a href=\"https://biodiversitylibrary.org/page/30410144\" target=\"other\">Wrinch 1919 available online</a>]",
                "Zermelo, Ernst, 1908 [1967], “Neuer Beweis für die\nMöglichkeit einer Wohlordnung”, <em>Mathematische\nAnnalen</em>, 65(1): 107–128. Translated by Stefan\nBauer-Mengelberg as “A New Proof of the Possibility of a\nWell-Ordering”, in Jean van Heijenoort (ed.), <em>From Frege to\nGödel: A Source Book in Mathematical Logic, 1879-1931</em>,\nCambridge, MA: Harvard University Press, 1967, 183–198.\ndoi:10.1007/BF01450054 (de)\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLite\">Primary Literature</h3>\n<ul class=\"hanging\">\n<li>Russell, Bertrand, [PoM] 1903, <em>The Principles of\nMathematics</em>, Cambridge: Cambridge University Press.\n [<a href=\"https://archive.org/details/principlesmathe00russgoog/page/n5\" target=\"other\">PoM available online</a>]</li>\n<li>–––, 1905, “On Denoting”,\n<em>Mind</em>, 14(4): 479–493. doi:10.1093/mind/XIV.4.479</li>\n<li>–––, 1911, “On the Axioms of the Infinite\nand of the Transfinite”, printed in <em>Logical and\nPhilosophical Papers 1909–1913: The Collected Papers of Bertrand\nRussell, Vol. 6</em>, John G. Slater (ed.), London and New York:\nRoutledge, 1992, 41–53.</li>\n<li>–––, 1919, <em>Introduction to Mathematical\nPhilosophy</em>, London: George Allen &amp; Unwin.</li>\n<li>–––, 1948, “Whitehead and <em>Principia\nMathematica</em>”, <em>Mind</em>, 57(226): 137–138.\ndoi:10.1093/mind/LVII.226.137</li>\n<li>–––, 1959, <em>My Philosophical\nDevelopment</em>, London: George Allen and Unwin, and New York: Simon\nand Schuster; reprinted London: Routledge, 1993. (Page numbers are to the 1959 edition.) </li>\n<li>–––, 1967, 1968, 1969, <em>The Autobiography of\nBertrand Russell</em>, 3 vols., London: George Allen and Unwin;\nBoston: Little Brown and Company (Vols 1 and 2), New York: Simon and\nSchuster (Volume 3).</li>\n<li>Whitehead, Alfred North, 1898, <em>A Treatise on Universal\nAlgebra</em>, Cambridge: Cambridge University Press.\n [<a href=\"https://archive.org/details/atreatiseonuniv00goog/page/n8\" target=\"other\">Whitehead 1898 available online</a>]</li>\n<li>–––, 1906, “On Mathematical Concepts of\nthe Material World”, <em>Philosophical Transactions of the Royal\nSociety A: Mathematical, Physical and Engineering Sciences</em>,\n205(387–401): 465–525. doi:10.1098/rsta.1906.0014</li>\n<li>–––, 1926, “Notes: Principia\nMathematica”, <em>Mind</em>, 35(137): 130.\ndoi:10.1093/mind/XXXV.137.130-a</li>\n<li>Whitehead, Alfred North, Bertrand Russell, and M.R. James, 1910,\nContract for the First Edition of <em>Principia Mathematica</em>,\nreprinted in “Illustrations: Manuscripts Relating to Principia\nMathematica”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 31(1): 82. doi:10.15173/russell.v31i1.2199</li>\n<li>Whitehead, Alfred North and Bertrand Russell, 1910, 1912, 1913,\n<em>Principia Mathematica</em>, 3 volumes, Cambridge: Cambridge\nUniversity Press; 2nd edition, 1925 (Vol. I), 1927 (Vols II, II);\nabridged as <em>Principia Mathematica to ∗56</em>, Cambridge:\nCambridge University Press, 1956. (Page numbers are to the second\nedition.)</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Borel, Émile, 1898, <em>Leçons Sur La Théorie\nDes Fonctions</em>, Paris.</li>\n<li>Bernays, Paul, 1926, “Axiomatische Untersuchungen des\nAussagen-Kalkuls der <em>Principia Mathematica</em>”,\n<em>Mathematische Zeitschrift</em>, 25: 305–320.\ndoi:10.1007/BF01283841</li>\n<li>Blackwell, Kenneth, 2005, “A Bibliographical Index for\n<em>Principia Mathematica</em>”, <em>Russell: The Journal of\nBertrand Russell Studies</em>, 25(1): 77–80.\ndoi:10.15173/russell.v25i1.2072</li>\n<li>–––, 2011, “The Wit and Humour of\n<em>Principia Mathematica</em>”, in Griffin, Linsky, and\nBlackwell 2011: 151–160. doi:10.15173/russell.v31i1.2198</li>\n<li>Boolos, George, 1971, “The Iterative Conception of\nSet”, <em>Journal of Philosophy</em>, 68(8): 215–231.\ndoi:10.2307/2025204</li>\n<li>–––, 1994, “The Advantages of Honest Toil\nover Theft”, <em>Mathematics and Mind</em>, Alexander George\n(ed.), Oxford: Oxford University Press, 27–44.</li>\n<li>Burgess, John P., 2005, <em>Fixing Frege</em>, Princeton:\nPrinceton University Press.</li>\n<li>Cantor, Georg, 1883 [1996], <em>Grundlagen einer allgemeinen\nMannigfaltigkeitslehre. Ein mathematisch-philosophischer Versuch in\nder Lehre des Unendlichen</em>, Teubner, Leipzig. Printed as\n“Foundations of a General Theory of Manifolds: A\nMathematico-Philosophical Investigation into the Theory of the\nInfinite” in <em>From Kant to Hilbert: A Source Book in the\nFoundations of Mathematics</em>, Vol. II, William Ewald (trans.),\nOxford: Oxford University Press, 1996, 878–920.</li>\n<li>–––, 1895 &amp; 1897 [1915],\n“Beiträge zur Begründung der transfiniten\nMengenlehre”, <em>Mathematische Annalen</em>, (1895) 46(4):\n481–512 &amp; (1897) 49(2): 207–246. Translated as\n<em>Contributions to the Founding of the Theory of Transfinite\nNumbers</em>, Philip E.B. Jourdain (trans), Chicago: Open Court, 1915.\ndoi:10.1007/BF02124929 (de) doi:10.1007/BF01444205 (de)</li>\n<li>Chihara, Charles S., 1973, <em>Ontology and the Vicious Circle\nPrinciple</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Church, Alonzo, 1974, “Russellian Simple Type Theory”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 47: 21–33. doi:10.2307/3129899</li>\n<li>–––, 1976, “Comparison of Russell’s\nResolution of the Semantical Antinomies with That of Tarski”,\n<em>The Journal of Symbolic Logic</em>, 41(04): 747–760.\ndoi:10.2307/2272393</li>\n<li>Chwistek, Leon, 1912 [2017], “Zasada sprzeczności w\nświetle nowszych badań Bertranda Russella”, Rozprawy\nAkademii Umiejętności (Kraków), Wydzial  \nhistoryczno-filozoficzny, Series II. 30: 270–334. Translated by Rose Rand as\n“The Law of Contradiction in the Light of Recent Investigations\nof Bertrand Russell”, in <em>The Significance of the Lvov-Warsaw\nSchool in the European Culture</em>, Anna Brożek, Friedrich\nStadler, and Jan Woleński (eds.), Cham: Springer International\nPublishing, 2017, 227–289. doi:10.1007/978-3-319-52869-4_13</li>\n<li>–––, 1921 [1967], “Antynomie logiki\nformalnej”, <em>Przegla̧d Filozoficzny</em>, 24: 164–171.\nPrinted as “Antinomies of Formal Logic”, Z. Jordan\n(trans.), in <em>Polish Logic 1920-1939</em>, Storrs McCall (ed.),\nOxford: Clarendon Press, 1967, 338–345.</li>\n<li>Collins, Jordan E., 2012, <em>A History of the Theory of Types:\nDevelopments after the Second Edition of Principia Mathematica</em>,\nSaarbrücken: Lambert Academic Publishing.</li>\n<li>Copi, Irving M., 1950, “The Inconsistency or Redundancy of\n<em>Principia Mathematica</em>”, <em>Philosophy and\nPhenomenological Research</em>, 11(2): 190–199.\ndoi:10.2307/2103637</li>\n<li>–––, 1971, <em>The Theory of Logical Types</em>,\nLondon: Routledge and Kegan Paul.</li>\n<li>Dedekind, Richard, 1872 [1901], <em>Stetigkeit und irrationale\nZahlen</em>, Braunschweig: Vieweg. Translated 1901, “Continuity\nand Irrational Numbers”, Wooster Woodruff Beman (trans.),\nin <em>Essays on the Theory of Numbers</em> Chicago: Open Court.\ndoi:10.1007/978-3-322-98548-4</li>\n<li>Eliot, T.S., 1927, “A Commentary”, <em>The Monthly\nCriterion</em>, 6(4), 289–291.</li>\n<li>Enderton, Herbert B., 1977, <em>Elements of Set Theory</em>, New\nYork: Academic Press.</li>\n<li>Ewald, William and Wilfried Sieg (eds), 2013, <em>David\nHilbert’s Lectures on the Foundations of Arithmetic and Logic\n1917–1933</em>, Berlin: Springer Verlag. doi:\ndoi:10.1007/978-3-540-69444-1</li>\n<li>Frege, Gottlob, 1879 [1967], <em>Begriffsschrift: Eine Der\nArithmetische Nachgebildete Formelsprache des Reinen Denkens</em>,\nHalle a/S: Louis Nebert. Translated by Stefan Bauer-Mengelberg as\n“<em>Begriffsschrift</em>, A Formula Language, Modeled Upon that\nof Arithmetic, for Pure Thought” in Jean van Heijenoort (ed.),\n<em>From Frege to Gödel: A Source Book in Mathematical Logic,\n1879-1931</em>, Cambridge, MA: Harvard University Press, 1967,\n1–82.\n [<a href=\"https://gallica.bnf.fr/ark:/12148/bpt6k65658c\" target=\"other\">Frege 1879 available online (de)</a>]</li>\n<li>–––, 1884 [1950], <em>Die Grundlagen der\nArithmetik: Eine logisch mathematische Untersuchung über den\nBegriff der Zahl</em>, Breslau: Koebner, translated by J.L. Austin as\n<em>The Foundations of Arithmetic: A logico-mathematical enquiry into\nthe concept of number</em>, Oxford: Basil Blackwell, 1950.</li>\n<li>–––, 1892 [1984], “Über Sinn und\nBedeutung”, <em>Zeitschrift für Philosophie und\nphilosophische Kritik</em> 100, 25-50, translated by Max Black as\n“On Sense and Meaning” in <em>Gottlob Frege: Collected\nPapers on Mathematics, Logic, and Philosophy</em>, Brian McGuinness,\ned., Oxford: Basil Blackwell, 1984, 157–177.</li>\n<li>–––, 1893/1903 [2013], <em>Grundgesetze der\nArithmetik</em>, Band I (1893), Band II (1903), Jena: Verlag Hermann\nPohle. Translated (preserving the original pagination) by Philip A. Ebert &amp; Marcus Rossberg with\nCrispin Wright as <em>Basic Laws of Arithmetic</em>, Oxford: Oxford\nUniversity Press, 2013.</li>\n<li>–––, 1980, <em>Philosophical and Mathematical\nCorrespondence</em>, G. Gabriel, et al. (eds.), Chicago: University of\nChicago Press.</li>\n<li>Gabbay, Dov M. and John Woods (eds.), 2009, <em>Handbook of the\nHistory of Logic, Volume 5: Logic From Russell to Church</em>,\nAmsterdam: Elsevier/North Holland.</li>\n<li>Gandon, Sébastien, 2008, “Which Arithmetization for\nWhich Logicism? Russell on Relations and Quantities in The Principles\nof Mathematics”, <em>History and Philosophy of Logic</em>,\n29(1): 1–30. doi:10.1080/01445340701398530</li>\n<li>–––, 2011, “<em>Principia\nMathematica</em>, part VI: Russell and Whitehead on Quantity”,\n<em>Logique et Analyse</em>, 54(214): 225–247.\n [<a href=\"http://virthost.vub.ac.be/lnaweb/ojs/index.php/LogiqueEtAnalyse/article/view/1777/1555\" target=\"other\">Gandon 2011 available online</a>]</li>\n<li>–––, 2012, <em>Russell’s Unknown\nLogicism</em>, New York: Palgrave Macmillan.</li>\n<li>Gödel, Kurt, 1933 [1995], “The Present Situation in the\nFoundations of Mathematics”, lecture delivered to the\nMathematical Association of America and the American Mathematical\nSociety, Cambridge, MA, December 1933. Printed in <em>Kurt Gödel:\nCollected Works</em>, Vol. II, Solomon Feferman, et al. (eds.), Oxford\nand New York: Oxford University Press, 1995, 45–53.</li>\n<li>–––, 1944 [1951], “Russell’s\nMathematical Logic”, in <em>The Philosophy of Bertrand\nRussell</em>, Paul Arthur Schilpp (ed.), first edition, Chicago:\nNorthwestern University, 1944; third edition, New York: Tudor, 1951,\n123–153.</li>\n<li>Grattan-Guinness, I., 2000, <em>The Search for Mathematical Roots,\n1870-1940: Logics, Set Theories and the Foundations of Mathematics\nfrom Cantor Through Russell to Gödel</em>, Princeton and Oxford:\nPrinceton University Press.</li>\n<li>Griffin, Nicholas and Bernard Linsky (eds.), 2013, <em>The\nPalgrave Centenary Companion to Principia Mathematica</em>, London:\nPalgrave Macmillan. doi:10.1057/9781137344632</li>\n<li> Griffin, Nicholas, Bernard Linsky and Kenneth Blackwell (eds.),\n2011, <em>Principia Mathematica at 100</em>, Hamilton, ON: Bertrand\nRussell Research Centre; also published as a special issue of\n<em>Russell: The Journal of Bertrand Russell Studies</em>, 31(1).\n [<a href=\"https://mulpress.mcmaster.ca/russelljournal/issue/view/229\" target=\"other\">Griffin, Linsky, and Blackwell 2011 available online</a>]</li>\n<li>Guay, Alexandre (ed.), 2012, <em>Autour de Principia Mathematica\nde Russell et Whitehead</em>, Dijon: Editions Universitaires de\nDijon.</li>\n<li>Hale, Bob and Crispin Wright, 2001, <em>The Reason’s Proper\nStudy: Essays towards a Neo-Fregean Philosophy of Mathematics</em>,\nOxford: Oxford University Press. doi:10.1093/0198236395.001.0001</li>\n<li>Hausdorff, Felix, 1906, “Untersuchungen über\nOrdnungstypen”, <em>Berichte der Königlichen Sächsische\nAkademie der Wissenschaft</em> (Leipzig), 58: 106–169; 59:\n84–159.</li>\n<li>Hilbert, David and W. Ackermann, 1928, <em>Grundzüge der\ntheoretischen Logik</em>, Berlin: Julius Springer Verlag. Translated\nas “Principles of Mathematical Logic”, Providence:\nAmerican Mathematical Society, 1958.</li>\n<li>Hilbert, David and Paul Bernays, 1934, <em>Grundlagen der\nMathematik</em>, Berlin: Julius Springer Verlag.</li>\n<li>Hinkis, Arie, 2013, <em>Proofs of the Cantor-Bernstein Theorem: A\nMathematical Excursion</em>, New York, Dordrecht, London:\nBirkhäuser.</li>\n<li>Hintikka, Jaakko, 2009, “Logicism”, in Irvine 2009:\n271–290. doi:10.1016/B978-0-444-51555-1.50010-9</li>\n<li>Irvine, Andrew D. (ed.), 2009, <em>Philosophy of Mathematics</em>\n(Handbook of the Philosophy of Science), Amsterdam: Elsevier.\ndoi:10.1016/B978-0-444-51555-1.X0001-7</li>\n<li>Kahle, Reinhard, 2013, “David Hilbert and <em>Principia Mathematica</em> in Poland”, in\nGriffin and Linsky, 2013: 21–34.\n</li>\n<li>Kanamori, Akihiro, 2009, “Set Theory from Cantor to\nCohen”, in Irvine 2009: 395-459.\ndoi:10.1016/B978-0-444-51555-1.50014-6</li>\n<li>Kleene, S.C., 1952, <em>Introduction to Metamathematics</em>,\nPrinceton: Van Nostrand.</li>\n<li>Landini, Gregory, 1998, <em>Russell’s Hidden Substitutional\nTheory</em>, New York and Oxford: Oxford University Press.</li>\n<li>–––, 2011, <em>Russell</em>, London and New\nYork: Routledge.</li>\n<li>–––, 2016, “Whitehead’s\n(<em>Badly</em>) Emended <em>Principia</em>”, <em>History and\nPhilosophy of Logic</em>, 37(2): 114–169.\ndoi:10.1080/01445340.2015.1082063</li>\n<li>Link, Godehard (ed.), 2004, <em>One Hundred Years of\nRussell’s Paradox</em>, Berlin and New York: Walter de\nGruyter.</li>\n<li>Linsky, Bernard, 1990, “Was the Axiom of Reducibility a\nPrinciple of Logic?” <em>Russell</em>, 10: 125–140;\nreprinted in A.D. Irvine (ed.), 1990, <em>Bertrand Russell: Critical\nAssessments</em>, 4 vols., London: Routledge, vol. 2, 150–264.\ndoi:10.15173/russell.v10i2.1775</li>\n<li>–––, 1999, <em>Russell’s Metaphysical\nLogic</em>, Stanford: CSLI Publications.</li>\n<li>–––, 2002, “The Resolution of Russell’s\nParadox in <em>Principia Mathematica</em>”, <em>Philosophical\nPerspectives</em>, 16: 395–417.\ndoi:10.1111/1468-0068.36.s16.15</li>\n<li>–––, 2003, “Leon Chwistek on the\nNo-Classes Theory in <em>Principia Mathematica</em>”,\n<em>History and Philosophy of Logic</em>, 25(1): 53–71.\ndoi:10.1080/01445340310001614698</li>\n<li>–––, 2004, “Classes of Classes and Classes\nof Functions in <em>Principia Mathematica</em>”, in Link 2004:\n435–447.</li>\n<li>–––, 2009, “From Descriptive Functions to\nSets of Ordered Pairs”, in Alexander Hieke and Hannes Leitgeb,\n<em>Reduction-Abstraction-Analysis</em>, Vol. 11 of Publications of\nthe Austrian Ludwig Wittgenstein Society, new series, Frankfurt: Ontos\nVerlag, 259-272.</li>\n<li>–––, 2011, <em>The Evolution of Principia\nMathematica: Bertrand Russell’s Manuscripts and Notes for the\nSecond Edition</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511760181</li>\n<li>–––, 2016, “Propositional Logic from\n<em>The Principles of Mathematics</em> to <em>Principia\nMathematica</em>”, in <em>Early Analytic Philosophy: New\nPerspectives on the Tradition</em>, Sorin Costreie (ed.), Cham:\nSpringer International Publishing, 213–229.\ndoi:10.1007/978-3-319-24214-9_8</li>\n<li>Linsky, Bernard and Kenneth Blackwell, 2005, “New Manuscript\nLeaves and the Printing of the First Edition of <em>Principia\nMathematica</em>”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 25(2): 141–154.\ndoi:10.15173/russell.v25i2.2084</li>\n<li>Mares, Edwin D., 2007, “The Fact Semantics for Ramified Type\nTheory and the Axiom of Reducibility”, <em>Notre Dame Journal of\nFormal Logic</em>, 48(2): 237–251.\ndoi:10.1305/ndjfl/1179323266</li>\n<li>Mayo-Wilson, Conor, 2011, “Russell on Logicism and\nCoherence”, in Griffin, Linsky, and Blackwell 2011: 63–79.\ndoi:10.15173/russell.v31i1.2206</li>\n<li>Myhill, John, 1974, “The Undefinability of the Set of\nNatural Numbers in the Ramified <em>Principia</em>”, in\n<em>Bertrand Russell’s Philosophy</em>, George Nakhnikian (ed.),\nLondon: Duckworth, 19-27.</li>\n<li>Proops, Ian, 2006, “Russell’s Reasons for Logicism”,\n<em>Journal of the History of Philosophy</em>, 44(2): 267–292.\ndoi:10.1353/hph.2006.0029</li>\n<li>Quine, W.V.O., 1951, “Whitehead and Modern Logic”, in\n<em>The Philosophy of Alfred North Whitehead</em>, P.A. Schilpp (ed.),\nNew York: Tudor Publishing, 125-163.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge:\nMIT Press.</li>\n<li>–––, 1963, <em>Set Theory and Its Logic</em>,\nCambridge: Harvard University Press</li>\n<li>–––, 1966a, <em>Selected Logic Papers</em>, New\nYork: Random House.</li>\n<li>–––, 1966b, <em>Ways of Paradox</em>, New York:\nRandom House.</li>\n<li>Ramsey, Frank, 1931, “The Foundations of Mathematics”,\nin his <em>The Foundations of Mathematics and Other Essays</em>,\nLondon: Kegan Paul, Trench, Trubner, 1-61.</li>\n<li>Rodriguez-Consuegra, Francisco, 1991, <em>The Mathematical\nPhilosophy of Bertrand Russell</em>, Boston: Birkhäuser Press;\nrepr. 1993.</li>\n<li>Shapiro, Stewart (ed.), 2005, <em>The Oxford Handbook of\nPhilosophy of Mathematics and Logic</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780195325928.001.0001</li>\n<li>Sheffer, Henry M., unpublished, <em>Notes on Bertrand Russell's\nLectures</em> (Cambridge, MA 1910), in Harvard University Archives: Henry Maurice Sheffer Personal Archive [accessions], 1891–1970. For further information see URL =  &lt;<a href=\"http://id.lib.harvard.edu/alma/990138368470203941/catalog\" target=\"other\">http://id.lib.harvard.edu/alma/990138368470203941/catalog</a>&gt;.   </li>\n<li>Solomon, Graham 1989, “What became of Russell's ‘relation arithmetic’?”, <em>Russell: The Journal of Bertrand Russell\nStudies</em>, 9(2): 168 –173.</li>\n<li>Stevens, Graham, 2011, “Logical Form in <em>Principia\nMathematica</em>”, in Griffin, Linsky, and Blackwell 2011:\n9–28. doi:10.15173/russell.v31i1.2203</li>\n<li>Suppes, Patrick, 1960, <em>Axiomatic Set Theory</em>, Princeton:\nvan Nostrand.</li>\n<li>Tarski, Alfred, 1956, <em>Ordinal Algebras</em>, Amsterdam:\nNorth Holland.</li>\n<li>Urquhart, Alasdair, 1988, “Russell’s Zigzag Path to the\nRamified Theory of Types”, <em>Russell: The Journal of Bertrand\nRussell Studies</em>, 8(1): 82–91.\ndoi:10.15173/russell.v8i1.1735</li>\n<li>–––, 2012, Review of Bernard Linsky’s\n<em>The Evolution of Principia Mathematica: Bertrand Russell’s\nManuscripts and Notes for the Second Edition</em>, <em>Notre Dame\nPhilosophical Reviews</em>,\n [<a href=\"https://ndpr.nd.edu/news/the-evolution-of-principia-mathematica-bertrand-russell-s-manuscripts-and-notes-for-the-second-edition/\">Urquhart 2012 available online</a>].</li>\n<li>–––, 2013, “<em>Principia\nMathematica</em>: The First 100 Years”, in Griffin and Linsky\n2013: 3–20.</li>\n<li>Wahl, Russell, 2011, “The Axiom of Reducibility”, in\nGriffin, Linsky, and Blackwell 2011: 45–62.\ndoi:10.15173/russell.v31i1.2205</li>\n<li>Wiener, Norbert, 1914, “A Simplification of the Logic of\nRelations”, <em>Proceedings of the Cambridge Philosophical\nSociety</em>, 17: 387–90.\n [<a href=\"https://biodiversitylibrary.org/page/30512608\" target=\"other\">Wiener 1914 available online</a>]</li>\n<li>Wittgenstein, Ludwig, 1922, <em>Tractatus\nLogico-Philosophicus</em>, C.K. Ogden (trans.), London: Routledge\n&amp; Kegan Paul.</li>\n<li>Wolenski, Jan , 2013, “<em>Principia Mathematica</em> in Poland”, in\nGriffin and Linsky, 2013: 35–55.\n</li>\n<li>Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.</li>\n<li>Wrinch, Dorothy, 1919, “On the Exponentiation of\nWell-Ordered Series”, <em>Proceedings of the Cambridge\nPhilosophical Society</em>, 19: 219-233.\n [<a href=\"https://biodiversitylibrary.org/page/30410144\" target=\"other\">Wrinch 1919 available online</a>]</li>\n<li>Zermelo, Ernst, 1908 [1967], “Neuer Beweis für die\nMöglichkeit einer Wohlordnung”, <em>Mathematische\nAnnalen</em>, 65(1): 107–128. Translated by Stefan\nBauer-Mengelberg as “A New Proof of the Possibility of a\nWell-Ordering”, in Jean van Heijenoort (ed.), <em>From Frege to\nGödel: A Source Book in Mathematical Logic, 1879-1931</em>,\nCambridge, MA: Harvard University Press, 1967, 183–198.\ndoi:10.1007/BF01450054 (de)</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle",
            "Bolzano, Bernard",
            "Dedekind, Richard: contributions to the foundations of mathematics",
            "descriptions",
            "Frege, Gottlob",
            "Frege, Gottlob: theorem and foundations for arithmetic",
            "Gödel, Kurt",
            "Leibniz, Gottfried Wilhelm",
            "logic: classical",
            "logical constructions",
            "logicism and neologicism",
            "Principia Mathematica: notation in",
            "propositional function",
            "Russell, Bertrand",
            "Russell’s paradox",
            "set theory",
            "Turing, Alan",
            "type theory",
            "Whitehead, Alfred North",
            "Wittgenstein, Ludwig"
        ],
        "entry_link": [
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../bolzano/": "Bolzano, Bernard"
            },
            {
                "../dedekind-foundations/": "Dedekind, Richard: contributions to the foundations of mathematics"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../frege-theorem/": "Frege, Gottlob: theorem and foundations for arithmetic"
            },
            {
                "../goedel/": "Gödel, Kurt"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../logic-classical/": "logic: classical"
            },
            {
                "../logical-construction/": "logical constructions"
            },
            {
                "../logicism/": "logicism and neologicism"
            },
            {
                "../pm-notation/": "Principia Mathematica: notation in"
            },
            {
                "../propositional-function/": "propositional function"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../russell-paradox/": "Russell’s paradox"
            },
            {
                "../set-theory/": "set theory"
            },
            {
                "../turing/": "Turing, Alan"
            },
            {
                "../type-theory/": "type theory"
            },
            {
                "../whitehead/": "Whitehead, Alfred North"
            },
            {
                "../wittgenstein/": "Wittgenstein, Ludwig"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=principia-mathematica\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/principia-mathematica/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=principia-mathematica&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/principia-mathematica/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=principia-mathematica": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/principia-mathematica/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=principia-mathematica&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/principia-mathematica/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "University of Michigan Historical Math Collection:\n\n  <ul>\n<a href=\"http://name.umdl.umich.edu/AAT3201.0001.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume I</a>\n<a href=\"http://name.umdl.umich.edu/AAT3201.0002.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume II</a>\n<a href=\"http://name.umdl.umich.edu/AAT3201.0003.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume III</a>\n</ul>",
            "<a href=\"http://name.umdl.umich.edu/AAT3201.0001.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume I</a>",
            "<a href=\"http://name.umdl.umich.edu/AAT3201.0002.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume II</a>",
            "<a href=\"http://name.umdl.umich.edu/AAT3201.0003.001\" target=\"other\"><em>Principia Mathematica</em>, first edition: Volume III</a>",
            "Internet Archive:\n\n <ul>\n<a href=\"https://archive.org/details/dli.ernet.247278/page/n3/mode/2up\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume I</a>\n<a href=\"https://archive.org/details/PrincipiaMathematicaVol2\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume II</a>\n<a href=\"https://archive.org/details/PrincipiaMathematicaVol3\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume III</a>\n</ul>\n",
            "<a href=\"https://archive.org/details/dli.ernet.247278/page/n3/mode/2up\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume I</a>",
            "<a href=\"https://archive.org/details/PrincipiaMathematicaVol2\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume II</a>",
            "<a href=\"https://archive.org/details/PrincipiaMathematicaVol3\" target=\"other\"><em>Principia Mathematica</em>, second edition: Volume III</a>",
            "<a href=\"http://www.thoralf.uwaterloo.ca/htdocs/scav/principia/principia.html\" target=\"other\"><em>Principia Mathematica</em>: Whitehead and Russell</a>,\n Stanley Burris, University of Waterloo."
        ],
        "listed_links": [
            {
                "http://name.umdl.umich.edu/AAT3201.0001.001": "Principia Mathematica, first edition: Volume I"
            },
            {
                "http://name.umdl.umich.edu/AAT3201.0002.001": "Principia Mathematica, first edition: Volume II"
            },
            {
                "http://name.umdl.umich.edu/AAT3201.0003.001": "Principia Mathematica, first edition: Volume III"
            },
            {
                "https://archive.org/details/dli.ernet.247278/page/n3/mode/2up": "Principia Mathematica, second edition: Volume I"
            },
            {
                "https://archive.org/details/PrincipiaMathematicaVol2": "Principia Mathematica, second edition: Volume II"
            },
            {
                "https://archive.org/details/PrincipiaMathematicaVol3": "Principia Mathematica, second edition: Volume III"
            },
            {
                "http://www.thoralf.uwaterloo.ca/htdocs/scav/principia/principia.html": "Principia Mathematica: Whitehead and Russell"
            }
        ]
    }
}