{
    "url": "secession",
    "title": "Secession",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Allen Buchanan\n<allen.buchanan@duke.edu>\nElizabeth Levinson\n<elevinson@email.arizona.edu>",
        "author_links": [
            {
                "http://fds.duke.edu/db/aas/Philosophy/faculty/allen.buchanan": "Allen Buchanan"
            },
            {
                "mailto:allen%2ebuchanan%40duke%2eedu": "allen.buchanan@duke.edu"
            },
            {
                "mailto:elevinson%40email%2earizona%2eedu": "elevinson@email.arizona.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://fds.duke.edu/db/aas/Philosophy/faculty/allen.buchanan\" target=\"other\">Allen Buchanan</a>\n&lt;<a href=\"mailto:allen%2ebuchanan%40duke%2eedu\"><em>allen<abbr title=\" dot \">.</abbr>buchanan<abbr title=\" at \">@</abbr>duke<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nElizabeth Levinson\n&lt;<a href=\"mailto:elevinson%40email%2earizona%2eedu\"><em>elevinson<abbr title=\" at \">@</abbr>email<abbr title=\" dot \">.</abbr>arizona<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Feb 7, 2003",
        "substantive revision Tue Oct 26, 2021"
    ],
    "preamble": "\n\n\nUntil fairly recently, secession has been a neglected topic among\nphilosophers. Two factors may explain why philosophers have now begun\nto turn their attention to secession. First, in the past few decades\nthere has been a great increase not only in the number of attempted\nsecessions, but also in successful secessions, and philosophers may\nsimply be reacting to this new reality, attempting to make normative\nsense of it. The reasons for the frequency of attempts to secede are\ncomplex, but there are two recent developments that make the prospect\nof state-breaking more promising: improvement in national security and\nliberalization of trade. As the fear of forcible annexation diminishes\nand trade barriers fall, smaller states become feasible, and\nindependent statehood looks more feasible for regions within states.\nSecond, in roughly the same time period, the idea that there is a\nstrong case for some form of self-government for groups presently\ncontained within states has gained ground. Once one begins to take\nseriously the case for special group rights for\nminorities—especially if these include rights of\nself-government—it is difficult to avoid the question of whether\nsome such groups may be entitled to full independence.\n",
    "toc": [
        {
            "#PhilIssuSece": "1. Philosophical Issues of Secession"
        },
        {
            "#DistBetwMereJustHaviClaiRigh": "1.1 The distinction between a (mere) justification and having a claim-right"
        },
        {
            "#ConsTheoAbouSece": "1.2 Constitutional theorizing about secession"
        },
        {
            "#TheoRighSece": "2.  Theories of the Right to Secede"
        },
        {
            "#RemeRighOnlyTheo": "2.1 Remedial Right Only Theories"
        },
        {
            "#PlebTheo": "2.2 Plebiscitary Theories"
        },
        {
            "#AscrTheo": "2.3 Ascriptivist Theories"
        },
        {
            "#SituTheoSeceWithTheoTerrTerrJust": "2.4  Situating theories of secession within theories of territory and territorial justice"
        },
        {
            "#NarrVersWideInstTheo": "2.5. Narrowly versus Widely Institutional Theories"
        },
        {
            "#CompTheoSece": "2.6 Comparing Theories of Secession"
        },
        {
            "#SeceJustWarTheo": "3. Secession and Just War Theory"
        },
        {
            "#SecePhilInteLaw": "4. Secession and the Philosophy of International Law"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Philosophical Issues of Secession\n\n\nPolitical scientists, sociologists, and political economists attempt\nto describe and explain the causes and effects of secessionist\nmovements and of states’ reactions to them. Philosophers focus on\nthe moral issues and on clarifying the conceptual framework for\nthinking about secession. Philosophical work on secession can be\ndivided into three categories: (1) attempts to articulate the\nconditions under which a group has the moral right to secede; (2)\nexaminations of the compatibility or incompatibility of secession with\nconstitutionalism, (3) attempts to determine what position\ninternational law should take regarding secession. Thus far,\nphilosophical theories of secession have not been integrated with two\nareas of normative theorizing that are directly relevant to them. The\nfirst is just war theory. This is surprising, since part of what\nmotivates systematic thinking about secession is a realization that\nattempts to secede often involve or provoke large-scale violence. The\nsecond is theories of territorial justice. This, too, is surprising,\nbecause ideally a theory of secession would be situated within a\nbroader normative theory of a range of claims to territory, including,\nbut not limited to claims to sovereign jurisdiction of the sort now\nassociated with statehood.\n\n\nIt is useful to distinguish secession from other ways in which\n“separation” or “state-breaking” can occur. In\nwhat might be called secession in the classic sense, a group in a\nportion of the territory of a state attempt to create a new state\nthere; secessionists attempt to exit, leaving behind the original state\nin reduced form. Second, there is irredentist secession, wherein the\nattempt is not to create a new state, but to merge the seceding\nterritory with a neighboring state. This typically occurs when the\nmajority in the seceding area are of the same ethno-nationality as that\nwhich is predominant in the neighboring state. A third case,\nexemplified by the dissolution of Czechoslovakia, occurs when there is\nagreement between the populations or at least the leaders of two\nregions (which together comprise the whole territory of the state), to\nsplit the state into two new states. A fourth case is that of\nexternally imposed partition of an existing state into two or more new\nstates. In the past partition usually occurred when a deal was struck\nbetween two powerful neighboring states at the expense of the state\nthat was partitioned, as with the partitioning of Poland between Nazi\nGermany and the Soviet Union. At present, externally imposed partition\nis more likely to be considered as a last resort for dealing with\nintractable ethno-national conflict within a state. In what follows,\nthe focus is on secession in the classical sense, but with some\nattention also to irredentist secession.\n1.1 The distinction between a (mere) justification and having a claim-right\n\n\nWe begin with a distinction between unilateral and consensual\nsecession. The former is secession without the consent of the state\nfrom which a portion of territory is taken by the seceding group or\nwithout constitutional sanction. A theory of the right to unilateral\nsecession is most urgently needed, not only because unilateral\nsecession occurs more frequently than consensual secession, but also\nbecause it is both more controversial and more likely to result in\nlarge-scale violence.\n\n\nConsensual secession results either from a negotiated agreement\nbetween the state and the secessionists (as occurred when Norway\nseceded from Sweden in 1905) or through constitutional processes (as\nthe Supreme Court of Canada recently envisioned for the secession\nof\n Quebec).[1] \n Constitutionally\nsanctioned secession is achieved either by the exercise of an explicit\nconstitutional right to secede (which only a few constitutions\ncurrently contain) or by constitutional amendment.\n\n\nA second important distinction is between being justified in\nseceding unilaterally and have a (claim-) right to unilateral\nsecession. It is not always clear whether a theorist is advancing a\ntheory of the conditions under which secession is morally justified\n(that is, the conditions under which a group has a moral liberty-right\nor mere moral permission to secede), or a theory of the conditions\nunder which a group has the claim-right to secede unilaterally. Talk\nabout “the right to secede” is often ambiguous between\nthese alternatives. A claim-right includes not only a liberty-right or\nmere permission (i.e., that a group is justified in seceding in the\nsense that if they do so they do not thereby act impermissibly), but\nalso a correlative obligation on the part of others not to interfere\nwith the attempted secession.\n\n\nThe distinction between establishing that a group is morally\njustified in unilaterally seceding (in the sense of having a\nliberty-right) and establishing that the group has a moral claim-right\nto unilaterally secede is crucial, though it is rarely explicitly drawn\nby philosophers writing about secession. Having the liberty-right does\nnot imply having the claim-right: a group might be morally justified in\nseceding and yet it might not be the case that others (including the\nstate from which the group is seceding) are obligated to refrain from\ninterfering with the group’s attempt to secede.\n\n\nTherefore, an argument that suffices to establish that a group is\njustified in seceding under such and such conditions may not suffice to\nestablish that the group has a (claim-) right to secede under those\nconditions. Yet when philosophers attempt to develop a moral theory of\nsecession by appealing to intuitions about hypothetical examples of\nsecession, it is often unclear whether the intuition elicited is about\nthe moral justifiability of the secession (the mere permissibility) or\nabout the existence of a moral claim-right.\n1.2 Constitutional theorizing about secession\n\n\nSome philosophers have distinguished between the question of whether\nand, if so, under what conditions a group has a moral claim-right to\nsecede and the question of whether and, if so, under what conditions a\nconstitution ought to or may permissibly include a right to secede. For\nexample, while acknowledging that secession may sometimes be morally\njustified (where this presumably means the group in question has the\nclaim-right to secede), Cass Sunstein has argued that constitutional\nrecognition of a right to secede is incompatible with the principles of\nconstitutionalism (or at least democratic\n constitutionalism)[2]\n (Sunstein 1991). Sunstein argues\nthat a basic principle of constitutionalism is that political\ninstitutions, including the constitution itself, must be designed to\nencourage citizens to engage in the hard work of democratic politics,\nwhere this means competing in the public forum on grounds of principle,\nwith a minimum of strategic bargaining. Following Albert O. Hirschman\n(1970), he then contends that if the constitution acknowledges a right\nto secede, then discontent minorities will be tempted to shirk the hard\nwork of principled, democratic politics either by seceding when the\nmajoritarian decisions go against their preferences or by using the\nthreat of secession as a strategic bargaining tool as a de facto veto\nover majority rule. In either case, democracy will be undermined.\n\n\nHowever, as Buchanan has argued (1991: 132), Sunstein fails even to\nconsider the possibility that a constitution could so hedge the right\nto secede as to reduce the threat of exit by minorities to acceptable\nproportions. The analogy here is with the right of constitutional\namendment as found in the United States Constitution. This right is\nsignificantly hedged: two super-majorities, one in the Congress, the\nother among the States, are required for amendment. Similarly, an\nappropriately hedged right to secede is not incompatible with the\nprinciples of constitutionalism: well-designed procedural hurdles\n(super-majorities, waiting periods, etc.) can make secession\nsufficiently difficult as to avoid an unacceptable risk of premature\nexit or strategic bargaining by minorities, while still making\nsecession possible under appropriate conditions. The current Ethiopian\nConstitution in fact includes such a hedged right to secede, requiring\nnot only two super-majorities in favor of secession, but also a waiting\nperiod. So, although appropriate constitutional design regarding\nsecession must cope with the risks that secession will impair\ndemocratic processes, constitutional recognition of a right to secede\ndoes not appear to be incompatible with constitutionalism.\n\n\nWayne Norman goes further, arguing that there are significant\nadvantages to constitutionalizing conflicts over secession (Norman\n2003). The Supreme Court of Canada recently took the same position,\narguing that the potentially disruptive process of secession by Quebec\ncan be subjected to the rule of law by a process of negotiation and\nconstitutional \n amendment.[3]\n\n\nThere is yet another argument for including a right to secede in a\nconstitution. In some cases, when a new political entity is being\ncreated out of two or more independent or semi-autonomous entities,\nincluding a right to exit in the constitution of the new entity may be\nnecessary as an inducement to join the new union. Under conditions of\nuncertainty as to how the new union will work, constitutional\nrecognition of a “bail out” option may be necessary to get\nthe new union going \n (Buchanan 1991: ch. 4).[4]\n\n\nThere is much philosophical work to be done on the question of when\nand, if so, how the right to secede might be constitutionalized. It\nwill require both an account of the principles of constitutionalism and\nof the morality of secession and an empirically based knowledge of the\nconditions under which various constitutional arrangements can be\nreasonably expected to realize the principles of constitutionalism in a\nmanner that is consistent with secession.\n2.  Theories of the Right to Secede\n\n\nIn the philosophical literature a putatively exhaustive distinction\nis drawn between two theories of the right to secede (understood as a\nunilateral claim-right): Remedial right only theories and\nprimary right \n theories.[5]\n Remedial right only\ntheories analogize the right to secede to the right to revolution,\nunderstanding it as a right that a group comes to have only as a result\nof violations of other rights. On this view secession is justified only\nas a remedy of last resort for persistent and serious injustices. The\nright to unilateral secession thus understood is not primary, but\nrather derivative upon the violation of other, more basic rights; hence\nthe label “remedial right only.” Sometimes the term\n“just cause theories” is used to refer to remedial right\nonly theories and the term “choice theories” to refer to\nprimary right theories.\n\n\nDifferent versions of remedial right only theories specify different\nlists of the injustices that can ground the remedial right. Consider,\nfor example, a remedial right only theory that includes among the\ngrounds for the (unilateral) right to secede the following: (a)\nlarge-scale and persistent violations of basic human rights, (b) unjust\ntaking of the territory of a legitimate state (where secession is\nsimply the taking back of wrongly taken territory, as with the\nsecession of the Baltic Republics from the Soviet Union in 1991), and\n(c) in certain cases, the state’s persisting violation of\nagreements to accord a minority group limited self-government within\nthe state (Buchanan 2004) or perhaps even refusal to enter into\nnegotiations aimed at agreement on an intrastate autonomy regime. A\nmore austere remedial right only theory would recognize only (a),\npersistent, large-scale violations of basic human rights (in the most\nextreme case, genocide or other mass killings) as sufficient to justify\nunilateral \n secession.[6]\n\n\n\nPrimary right theories of the unilateral right to secede recognize\nthat a group can have a right to secede on remedial grounds, but they\ncontend that the (unilateral) right to secede can exist even when the\ngroup has not been subject to any injustice. This second type of theory\nthus holds that there is a right to unilateral secession over and above\nwhatever remedial and hence derivative right there may be.\n\n\nPrimary right theories are of two types: Ascriptivist\n(predominantly nationalist) theories and plebiscitary (or\nmajoritarian) theories. The former hold that certain groups whose\nmemberships are defined by what are sometimes called ascriptive\ncharacteristics, simply by virtue of being those sorts of groups, have\na unilateral (claim-)right to secede. Ascriptive characteristics are\nthose that are attributed to individuals independently of their choice\nand include being of the same nation or being a “distinct\npeople.” The most common form of ascriptivist theory holds that\nnations as such have a right of self-determination that includes the\nright to secede in order to have their own state.\n\n\nPlebiscitary theories, in contrast, hold that the (pro\ntanto) unilateral moral claim-right to secede exists if a majority\nresiding in a portion of the state chooses to have their own state\nthere, regardless of whether or not they have any common\ncharacteristics, ascriptive or otherwise, other than the desire for\nindependence. They need not be co-nationals or members of a distinct\npeople or culture. Rather, they need only constitute a group that is\ncapable of establishing an autonomous government with the capacity to\nfulfill the political functions necessary for legitimacy.\n\n\nWhat the two types of primary right theories have in common is that\nthey do not require injustice as a necessary condition for the\nexistence of a unilateral (claim-)right to secede. They are primary\nright theories because they do not make the unilateral (claim-)right to\nsecede derivative upon the violation of other, more basic rights, as\nthe remedial right only theories \n do.[7]\n No attempt will\nbe made here to provide a comprehensive comparative evaluation of these\nrival theories (see Buchanan 1997). Instead, we will only identify\ntheir major strengths and weaknesses.\n2.1 Remedial Right Only Theories\n\n\nRemedial right only theories, as their designation suggests, hold\nthat secession is justified as a remedy of last resort against\ninjustices perpetrated against the aspiring secessionist group by the\nstate. Remedial right theorists assume that a sufficiently just state\nhas legitimate jurisdiction over the people within its territory. This\nlegitimacy confers on the state permission to rule over its all\ncitizens—including those members of aspiring secessionist groups.\nMatters can change only if the state violates the conditions of its\nlegitimacy, which requires that the state commit injustices that are\nsufficiently weighty so as to undermine the state’s claim to\nlegitimate rule. Various remedial right only views have different views\nas to what types of injustices are of sufficient weightiness to ground\nthe right to secede. The most prominent view of this sort, advanced by\nAllen Buchanan, identifies three particular kinds of injustices for\nwhich secession can be a remedy: 1) genocide or other large-scale\nviolations of basic human rights; 2) unjust annexation; and 3) the\npersistent violation of intrastate autonomy agreements (Buchanan 2003:\np. 351). Recently, Buchanan has also considered the possibility of\nanother condition: failure to enter into negotiations with the possible\noutcome of an intrastate autonomy regime in the case of any group that\nhas a reasonable claim to such autonomy (Buchanan, personal\ncommunication, August 2021).\n\n\nGiven the tendency for unilateral secession to provoke massive\nviolence, the obvious strength of the remedial right only approach is\nthat it places a significant constraint on unilateral\nsecession—namely, the requirement of a serious and persistent\ngrievance of injustice suffered by the secessionists. To that extent,\nit captures the intuition that nonconsensual state-breaking, like\nrevolution, is a grave affair requiring a weighty justification. More\nspecifically, this view provides a plausible explanation of how the\nstate can come to lose its entitlement to the territory: it does so by\nfailing to do what gives states a moral claim to control territory in\nthe first place, namely, providing justice for those within its\njurisdiction.\n\n\nAnother strength of the remedial right only approach is that it\nappears to provide the right incentives: States that are just (or at\nleast do not persist in very serious injustices) are morally immune to\nunilateral secession and entitled to international support in\nmaintaining their territorial integrity. On the other hand, if, as the\ntheory recommends, a unilateral right to secede as a remedy for serious\nand persistent injustices is acknowledged, this will give states an\nincentive to act more justly.\n\n\nSome critics have objected that the remedial right only approach to\nunilateral secession is disturbingly irrelevant to the concerns of many\ngroups seeking self-determination. They say that in most cases it is\nnationalism that fuels the quest for self-determination, not grievances\nof injustice per se (Moore 1998a). An advocate of the remedial\nright only view might respond that the latter is only an account of\nunilateral secession, not a comprehensive theory of self-determination.\nThus, the remedial right only approach to unilateral secession is\ncompatible with a fairly permissive stance toward intrastate autonomy,\nincluding various forms of self-government for national minorities\nwithin the state. The point is to uncouple the unilateral (claim-)right\nto secede from the various legitimate interests that\ngroups—including national minorities—can have in various\nforms of self-determination short of statehood.\n\n\nMoreover, the remedial right only approach need not reject claims to\nindependence on the part of nations; it only rejects the much stronger\nassertion that nations as such have a unilateral right to secede. In\nmany cases the groups that suffer persistent grave injustices are in\nfact nations, and therefore would be accorded the right to secede by\nthe remedial right only theory. To that extent it is inaccurate to say\nthat this type of theory ignores the realities of national\nself-determination movements. But just as important, the remedial right\nonly theory, when integrated into a comprehensive theory of\nself-determination that includes a principled account of when\nintrastate autonomy arrangements warrant international support, will\naddress the concerns of national minorities in cases in which they do\nnot have a unilateral right to secede.\n\n\nWhat the remedial right only approach does not do is\nconcede that nations as such—independently of any persisting\npattern of grave injustices—have a unilateral right to secede.\nBut it can be argued that this is a virtue of the account, not a\ndefect. It thereby avoids the objection to which ascriptivist theories\nare vulnerable, namely, that they endorse a unilateral right to secede\nfor all nations in a world in which virtually every state contains more\nthan one nation and in which nations are not neatly sorted into\ndiscrete regions of the state’s territory, but instead claim the\nsame territories. The point is not simply that the ascriptivist view is\nunfeasible; its support for the idea of the ethnically exclusive state\nis an incitement to ethnic cleansing if not genocide. However, this\nline of argument can supply an effective reply to the objection that\nremedial right only theories neglect the importance of nationalism only\nif the account of the right to secede a remedial right only theory\nadvances is properly situated in a plausible, more comprehensive theory\nof self-determination.\n2.2 Plebiscitary Theories\n\n\nPlebiscitary (or voluntarist) theories are more permissive than\nremedial right only theories and ascriptivist theories: they permit\nunilateral secession in the absence of injustice and do not require\nthat the members of the seceding group share any characteristic other\nthan the desire to form their own state. Plebiscitary theorists ground\nthe right to secede in the right to self-determination\n(Wellman 2005: ch. 3). For them, self-determination is in\nitself of such great value that it can ground a right to complete\npolitical autonomy given certain conditions. The most prominent\nproponent of the plebiscitary view, Christopher Wellman, argues that\nthe right to self-determination generates a right to secede if and only\nif (a) any group that constitutes a majority within a portion of some\ngiven territory votes in favor of secession, (b) that group is willing\nand able to establish a well-functioning independent state, and (c) its\nsecession will not undermine the remainder state’s ability to\nfunction as well (Wellman 1995; Wellman 2005: ch. 3; Altman and Wellman\n2009: ch. 3). Let us call (a) the majority vote condition and\nthe conjunction of (b) and (c) the state viability proviso.\nSatisfying the state viability proviso is not likely to be easy in most\ncases, particularly where the establishment of a new set of\ninstitutions is concerned. The viability proviso, then, limits the\npermissiveness of the plebiscitary view.\n\n\nPlebiscitary theories have many appealing features. First, they are\nable to avoid some of the problems that afflict the other main type of\nprimary right theory, ascriptivist theories, because they do not\nrequire either an account of what constitutes a nation nor an\nexplanation of why nations have a right to their own state. In\naddition, if a plebiscitary right to secede is widely acknowledged,\nthose wishing to secede need not frame their case in nationalist terms,\nwhich can provoke sometimes violent nationalistic responses from those\nwho oppose them. Second, they are less conservative than remedial right\nonly theories, as they permit a democratic redrawing of state\nboundaries—which, in theory, allows for a greater degree of\nself-determination for the people that reside within them. This appeal\nto a democratic determination of state boundaries rather than the\nmaintenance of the status quo also advances an admirable commitment to\ndemocracy, understood as majority rule.\n\n\nThis view, like the others, faces many objections. One worry is that\nthe plebiscitary theory licenses morally problematic secessions of the\n“haves” from the “have-nots:” well-off\nmajorities in resource-rich portions of the state might divest\nthemselves of obligations to redistribute wealth to their less\nfortunate fellow citizens. In response, Wellman might appeal to the\nviability proviso: a secessionist party may not secede with the\ncommodities necessary for the continued functioning of the remainder\nstate. If they are located in a region that has the greater amount of\nnatural resources, for example, their right to secede is conditional on\ntheir willingness to share at least some of those resources with the\ncitizens of the remainder state. On this view, richer groups may secede\nfrom poorer groups—however, the poorer group’s reliance on\nthe resources held by the richer group establishes the terms by which\nthe secession may occur (Wellman 1995: p. 145).\n\n\nWhether this reply works depends on how much Wellman is willing to\npack into the requirement that the remainder state must still be able\nto “function.” Wellman’s account is somewhat vague in\nthis regard, but it appears that he only includes the requirement that\nthe state be able to perform the functions needed to secure basic\nrights and justice, maintain order, and provide essential\ninfrastructure. If that is the case, then those who worry about\nlicensing the secession of the haves from the have-nots might argue\nthat the plebiscitary view permits the destruction of the modern\nwelfare state, a form of polity that often requires significant\nredistribution of wealth from better-off regions to less well-off ones.\nThough Wellman is not clear about precisely what functions are\nnecessary for the viability of a state, it is probable that the\nfunctions of a welfare state exceed the more minimal ones\nWellman’s view likely requires. Thus, critics might argue,\nWellman’s plebiscitary view is either a) too austerely\nlibertarian or b) requires a modification and expansion of the\nviability proviso that the secession not seriously damage the welfare\nfunctions of the remainder state.\n\n\nWellman, however, takes another approach. He argues that the\ncontinued sharing of resources from a newly created independent state\nwith the remainder state need not be limited to instances in which the\npoorer region would be left unviable without the seceding\nregion’s support. Thus, his view leaves room for the possibility\nthat the people in the poorer region may still be entitled to some\nshare of the resources that is greater than what they need for mere\nviability- however that may be construed. Here, Wellman makes a\ndistinction between what he takes to be two separate questions: 1) what\ndo the citizens of the richer region owe to the citizens of the\nremainder state as a matter of justice? And 2) are the citizens of the\nricher region entitled to self-determination? As he would argue:\nwealthy spouses divorce their less wealthy spouses all the time. We\ndon’t think that this inequality prohibits them from divorcing;\nrather, it establishes the terms by which they may permissibly do\nso—and these terms more often than not require continued support\nof the less well-off spouse beyond what is minimally required for his\nsubsistence (Wellman 2005: p. 142–3).\n\n\nThe question of maintaining the wealth distribution of a welfare\nstate, then, is one of distributive justice, and does not immediately\nbear on the issue of whether or not a richer group has the right to\nsecede beyond a more minimal interpretation of the viability proviso.\nThat is to say that the richer group’s right to\nself-determination is of sufficient weight to justify their secession\n(given the satisfaction of the requisite conditions), but it does not\nnecessarily outweigh any commitment to satisfying the welfare\nexpectations of those in the remainder state. The claims of\ndistributive justice may well require continued support of the\nworse-off beyond mere subsistence or viability claims. One difficulty\nwith this response is that it appears unrealistic under current\nconditions: once a region has achieved full independence, it will have\nlittle incentive to continue to share its resources with the remainder\nstate in order to preserve its welfare functions and there is no\neffective international agency to ensure that it does so.\n\n\nCritics of the plebiscitary theory raise the further objection that\nviews like Wellman’s would result in a proliferation of\nsecessions. The domino effect objection, as it might be\ncalled, refers to the concern that, if all that is needed to establish\na potentially viable secessionist group is a mere majority vote in any\nplebiscite, then the institutionalization of this view will license the\nsecessions of increasingly numerous and subsequently smaller and\nsmaller groups. This would likely be disastrous for political and\neconomic stability in the given regions and internationally. Again,\nplebiscitary theorists refer back to the viability proviso in response.\nThe successful creation of a fully autonomous state that can both\nmaintain political legitimacy (through the satisfaction of its\npolitical functions) and that can be reasonably expected to persist\nover time is a tall order—one that many (if not most) aspiring\nsecessionist groups are not likely to meet. Indeed, Wellman argues that\nthe likelihood of a secessionist group’s ability to achieve such\nan ambitious and complex task decreases as its population and resources\ndwindle in size (Wellman 2005: p. 7–8). The viability proviso, then,\nserves as a practical limitation on the kinds of plebiscites that can\nin fact form viable secessionist groups, which significantly decreases\nthe likelihood that an international splintering of states will occur\nif the plebiscitary view were implemented.\n\n\nThe right to secede, of course, necessarily entails a right to the\nterritory on which the secessionists intend to establish their own\nindependent state. This territory will be taken, without consent, from\nthe original state. What gives the secessionists a stronger claim to\nterritory than that of the original state? How can the right to\nself-determination plus the desire of the majority for independent\nstatehood both general a territorial claim and cancel a\nlegitimate state’s claim to the same?\n\n\nInstead of asking how the separatist group gains the right\nto territory, Wellman starts by asking why the original state has\nterritorial claims in the first place (Wellman 1995). He argues that\nthe state owes us an explanation as to why it can claim unilateral\ncoercive authority over us and the territories on which we live. The\nonly plausible explanation, he concludes, is functionality. So, Wellman\nhas a distinctly functionalist view of state authority—the\nauthority of a state over its territory and people is legitimate\ninsofar and only insofar as it performs its necessary political\nfunctions to some satisfactory degree. A state’s claim to sole\nauthority over a territory is thus generated by the use of that\nterritory to the performance of its political functions (Wellman 2005:\nch. 2).\n\n\nIn the context of this view, the existence of a politically viable\nand motivated internal separatist group calls into question the\nstate’s claim to territory on which said group exists because a)\nits political viability proves that the state does not, in fact, need\ncontrol over that territory and population to maintain the requisite\ndegree of functionality (per the viability proviso); and b) the\nmajority of the people in that region prefers another political\narrangement by which they can satisfy the functionality requirements on\ntheir own. Given the fact that the original state does not need the\ncontested territory to create a politically secure and decently\nwell-functioning environment for its own citizens, the state’s\nclaim to the disputed territory is not justified on the functionalist\nview (Altman and Wellman 2009: 47). The specific scenarios in which\nthis plays out will depend on how we construe political viability, but\nthe overarching argument from functionality remains the same: if the\ndisputed territory is not necessary for the proper functioning of the\nstate, then the state’s claim to that territory and those who\nlive on it is (at the very least) vulnerable to being overridden by the\nself-determination claims of the aspiring secessionists.\n\n\nWellman’s view on the potentially opposing territorial claims\nis thus grounded in his functionalist understanding of state legitimacy\nand his strong interpretation of the right to self-determination.\nAccording to the prevalent understanding of self-determination in\nmainstream political philosophy and international law, however, the\nright to self-determination includes only two features: freedom from\nexternal interference in self-governance and some minimally democratic\nform of government such that each member of the polity enjoys equal\npolitical participation rights. On this understanding, it appears that\nthe right to self-determination could only ground a right to territory\nif possessing their own territory is the only way in which a group\ncould be free of external interference or could achieve democracy. It\ndoes not encompass a right to take a portion of the territory of a\nstate that satisfies these two requirements. To respond to these\ncriticisms, the plebiscitary theory needs to be supplemented with a\nplausible theory of territorial rights that explains how the right to\nself-determination can generate a claim to territory in a portion of a\nlegitimate state in which all citizens already enjoy some sufficient\ndegree of self-determination. More on this in §2.4.\n2.3 Ascriptivist Theories\n\n\nAscriptivist theories, like their plebiscitary counterparts, hold\nthat secession rights are ultimately grounded in the value of\nself-determination and thus need not only be conferred on those who\nhave suffered severe injustice. Unlike plebiscitary theorists, however,\nproponents of ascriptivist views do not extend the right of\nself-determination to just any group. They argue instead that\nself-determination extends only to those groups that can be\ndistinguished by certain defining features- such as nationality,\nreligion, ethnicity, or other identities shared by the individuals that\nconstitute each group (Margalit and Raz 1990; Moore 1997; Miller 1995;\nMiller 1998). Though various ascriptivist theories insist on different\ncriteria that are used define the “people” or\n“nation” in question, they share the underlying claim that\nthe right to secede is motivated by the right to some kind of\nnational self-determination grounded in the unique moral\nclaims of individuals belonging to particular identity\n groups.[8]\n\n\n\nThis approach to unilateral secession has a long pedigree, reaching\nback at least to Nineteenth Century nationalists such as Mazzini, who\nproclaimed that every nation should have its own state. Critics of the\nascriptivist variant of primary right theory (Buchanan 1991, Gellner\n2008) argue that it would legitimize virtually unlimited unilateral,\nforcible border changes because it confers an entitlement to its own\nstate on every nation (or “people” or distinct society).\nFor reasons noted above this appears to be not only unfeasible, but a\nrecipe for increasing ethno-national conflict.\n\n\nHowever, those who advocate for the ascriptivist view reply that it\ndoes not require every nation (or distinct people) to exercise its\nunilateral right to secede and have conjectured that were their theory\ngenerally accepted not every group upon which it confers this\nentitlement would choose to secede. Nevertheless, given the historical\nrecord of ethno-nationalist conflict, the worry remains that\ninstitutionalizing the principle that every nation is entitled to its\nown state would exacerbate ethno-national violence, along with the\nhuman rights violations it inevitably entails. Thus, the moral costs of\nincorporating the ascriptivist version of primary right theory into\ninternational law may appear prohibitive—especially if there are\nless risky ways to accommodate the legitimate interests of nations,\nsuch as better compliance with human rights norms and recourse to\nintrastate autonomy arrangements.\n\n\nThere are variants of the ascriptivist theory that go some distance\ntoward allaying the worry that acceptance of the theory would add fuel\nto the fires of ethno-national conflict by qualifying the unilateral\nright of secession for nations (or distinct peoples) in various ways.\nFor example, the ascriptivist may hold that there is a presumption in\nfavor of each nation or distinct people having a right to its own state\nif it so desires, or a prima facie unilateral right to secede\nfor all such groups, but acknowledge that the international legal\nsystem is justified in requiring some groups to settle for autonomy\narrangements short of full independence to avoid dangerous instability\nor to accommodate similar claims by other groups to the same territory.\nThis way of responding to the worry about adding fuel to ethno-national\nconflicts comes at a price: What was originally billed as a unilateral\nright of every nation as such to its own state now looks more like a\nhighly defeasible presumption in favor of independence for nations. And\nunless a fairly concrete account of the conditions under which the\npresumption is not defeated is provided, it is hard to know what the\npractical implications of this qualified ascriptivist view are. What is\nneeded is an account of how the putative presumption in favor of\nstatehood for nations is to be weighed against competing claims and\nvalues. So far, proponents of ascriptivist theories have not provided\nthis.\n\n\nEarlier, we observed that critics of the ascriptivist version of\nprimary right theories tend to focus on the potential costs in terms of\nexacerbated ethno-national conflict of incorporating the view into\ninternational law. However, it is not enough to note the potential\ncosts of acceptance of the ascriptivist theory and its incorporation\ninto international law. It is also necessary to understand the putative\nbenefits of having a system in which the rights of nations to their own\nstates are acknowledged. Accordingly, David Miller has usefully\ndistinguished two ways in which ascriptivist theories can be supported:\nby arguments to show that nations need states or by arguments to show\nthat states need to be mono-national (Miller 1995).\n\n\nThe first type of argument has two variants: One can argue that\nnations need to have their own states, either (1) in order to be able\nto protect themselves from destruction or from forces that threaten\ntheir distinctive character, or (2) in order for co-nationals to have\nthe institutional resources to be able to fulfill the special\nobligations they owe one another as members of an “ethical\ncommunity”, in Miller’s phrase. Both of these\nconsiderations can, under certain circumstances, weigh in favor of some\nform of political self-determination for nations, but it is not clear\nthat either is sufficient to ground a general right of all nations to\nfull independence and hence a unilateral right to secede. Indeed,\nMiller marshals them in support of a weaker conclusion: that nations\nhave a “strong claim” to self-determination but does not\nspecify when the claim constitutes a full-fledged right.\n\n\nThe second type of justification for the view that nations are\nentitled to their own states also has two variants: The first, which\ndates back at least to John Stuart Mill’s Considerations\nOn Representative Government (Mill [1861] 1991), asserts that\ndemocracy can only flourish in mono-national states, because states in\nwhich there is more than one nation will be lacking in the solidarity,\ntrust, or shared sentiments and values that democracy requires. The\nsecond, advanced by David Miller, asserts that states need to be\nmononational in order to achieve distributive justice, because\ndistributive justice requires significant redistribution of wealth\namong citizens and the better off will only be willing share their\nwealth with their less fortunate fellow citizens if they see them as\nco-nationals (Miller 1995). Both forms of the “states need to be\nmononational” argument raise very interesting questions about the\nmotivational conditions necessary if crucial state functions are to be\nsuccessfully performed.\n\n\nMill apparently based his judgment that multination states are\nincompatible with democracy on historical experience. However, some\nwould argue that there are cases of multinational democratic states:\nCanada, Belgium, and perhaps Switzerland (depending upon whether one\nregards the last as multinational or merely multi-ethnic). One might\nalso add the United States, since most Indian tribes have a legal\nstatus that approaches sovereignty.\n\n\nOf course, modern proponents of Mill’s argument would be quick\nto point out that the continued existence of Belgium and Canada are in\ndoubt due to nationalist secession movements. (However, at present the\nsecession of Quebec seems very unlikely). On the other hand, it could\nbe argued that Mill’s generalization is prematurely pessimistic:\ngenuine democracies are a very recent phenomenon and until even more\nrecently there have been almost no serious attempts, even on the part\nof democratic states, to recognize the claims of nations within states,\nthrough various forms of autonomy \n arrangements.[9]\n So as a\njustification for acknowledging a right to independent statehood for\nall nations, with the risk of instability and violence this might\nentail, Mill’s pessimism about multinational democracies may seem\nto some to be premature. The most reasonable strategy would seem to be\nto do more to ensure that states respect the human rights of their\nminorities and to encourage intrastate autonomy agreements rather than\ngiving up on the idea of multinational states.\n\n\nThe second version of the “states need to be\nmono-national” argument also faces serious objections. First,\nwhether or not nationalism will facilitate or instead block large-scale\nredistribution of wealth will depend upon the character of the\nnationalism in question. Nationalist solidarity may not extend to\nwillingness to redistribute wealth. As socialists from Marx onward have\nobserved, the privileged minority has often been quite adept at\nappealing to nationalism to counteract the redistributive impulse.\nSecond, even in cases where nationalist sentiment facilitates\nredistribution, one must ask: what else does it facilitate? Miller\nappears to argue from the fact that a morally pristine, highly\nidealized nationalism would facilitate distributive justice (or\ndemocracy) to the conclusion that nations as such are entitled to their\nown states or at least to a presumption thereof. But there are many\nhistorical instances in which the national unity that Miller assumes\nwill be harnessed for the pursuit of distributive justice has been\nferociously directed toward conquest and against non-nationals and\ndissenting members of the nation itself.\n2.4  Situating theories of secession within theories of territory and territorial justice\n\n\nAs Lea Brilmayer has rightly stressed, secession is not simply the\nformation of a new political association among individuals or the\nrepudiation by a group of persons of their obligation to obey the\nstate’s laws (Brilmayer 1991). It is the taking of a part of the\nterritory claimed by an existing state. Accordingly, rival theories of\nsecession must be understood as providing alternative accounts of what\nit takes for a group to come to have a claim to territory that is at\nthe time included in the territory of an existing state.\n\n\nThe remedial right only approach to unilateral secession recognizes\nat least two ways a group can have the requisite valid claim to\nterritory: (a) by reclaiming territory over which they were sovereign\nbut which was unjustly taken from them (as with the Baltic\nRepublics’ secession from the Soviet Union in 1991); or (b) by\ncoming to have a claim to sovereignty over the territory as a result of\navailing themselves of a last resort remedy against serious and\npersistent injustices in the form of violations of basic human rights.\nA more expansive reading of (b) would include among the injustices that\ncan ground a unilateral right to secede, not only the violation of\nbasic human rights, but also the state’s major violations of, or\nunilateral revocation of, intrastate autonomy agreements (as with\nMilosovic’s destruction of Kosovo’s autonomy in 1989) and\nperhaps also refusal to negotiate regarding intrastate autonomy with\ngroups that have a reasonable claim to it.\n\n\nWith respect to (a), the basis of the secessionists’ claim to\nterritory is straightforward: they are simply reclaiming what was\nrecognized by international law as theirs. With respect to (b), the\nremedial right only theory begins with the presumption that existing\nstates that are accorded legitimacy under international law have valid\nclaims to their territories but then argues that such claims can be\noverridden or extinguished in the face of persistent patterns of\nserious injustices towards groups within the state. The idea is that\nthe validity of the state’s claim to the territory cannot be\nsustained when secession is the only remedy for serious injustices.\n\n\nWhile primary theorists like Christopher Wellman have not yet\npublished their own replies to the objections that his plebiscitary\nview lacks a much-needed theory of territory, some developments in the\nliterature on territorial rights might be used in defense of the\nplebiscitary view (though the way in which they do so is considerably\nless straightforward than is the case with remedial right only\ntheories). Anna Stilz argues that a state has territorial rights if and\nonly if it protects basic rights and claims of justice and reflects the\nshared will of the population within that territory (Stilz 2019, p.\n90). She calls these the values of basic justice and\ncollective self-determination. Stilz also claims that a state\ncan gain the right to rule over a particular territory\nthat is not already subject to the territorial rights of another\nentity when it is able and willing to satisfy these values.\nWellman could use this combination of basic justice and collective\nself-determination to claim that a separatist group driven by majority\nvote that is willing and able to satisfy basic rights and justice for\nits members can gain rights to the territory it needs to form its own\nindependent state—while denying the original state’s\nterritorial claim at the same time. Whether this appropriation of\nStilz’s view works depends on whether the conditions that enable\nthe initial acquisition of territorial rights—the establishment\nof a valid claim to territory over a region that at the time is not the\nobject of a valid claim by any other entity—are the same as those\nwhich establish a claim to territory over which some entity has\nhitherto held valid territorial rights. One might argue that the\nconditions for the latter are more demanding than for the former.\n\n\nStilz’s conception of the value of basic justice can be\nsatisfied by Wellman’s viability proviso, and his simple majority\nvote requirement bears directly on the way in which she conceives the\nvalue of collective self-determination, namely, in terms of a shared\nwill. Wellman could say that a group that has voted to leave the state\nand be independently self-determining no longer shares the relevant\npolitical will with the broader citizenry of the original state. Stilz\nholds that an important part of the political will is a willingness\nand/or desire to engage (or continue engaging) in a political project\nwith members of the greater state. A vote in favor of secession is a\nclear indication that such a desire is no longer shared by a majority\nof that plebiscite—they do not affirm existing institutions and\ndo not share a commitment to cooperating with them. In this way, the\noriginal state can no longer be taken to reflect the population’s\nshared will. Using Stilz’s theory of territory, then, Wellman\ncould argue that the separatist group has a clearly stronger claim to\nthe disputed territory than the original state does. Whether this\nappeal to Stilz’s view works will depend on whether the notion of\na shared will can be spelled out and shown to be of such crucial\nimportance that the absence of it on the part of some groups within the\nstate defeats a legitimate state’s claim to territory.\n\n\nThe plebiscitary view also faces the criticism that it cannot defend\nthe attribution of territorial rights to the particular group that\nseeks independence. Here, too, plebiscitary theorists might borrow from\nStilz. In addition to the values of basic justice and collective\nself-determination, she places considerable emphasis on occupancy\nrights. On her view, a group must have occupancy rights to the\nparticular territory over which they seek to claim sovereignty (Stilz\n2019, ch. 2). Wellman has previously acknowledged that his position\nrequires occupancy rights, but he has not yet elaborated on what these\noccupancy rights consist in. His view might be bolstered by emphasizing\nStilz’s notion that occupancy rights are grounded in the\nimportance of a region to the life-styles and culture of a group. Such\nan account of occupancy rights might be utilized to explain how the\nboundaries of the plebiscite on secession ought to be drawn.\n\n\nThe plebiscitary theorists appeal to occupancy rights may turn out\nto be a double-edged sword, however. Those who oppose a\nparticular secession might argue that they have occupancy rights in the\nwhole territory of the state in which they are citizens and that to\nhave occupancy rights to a particular portion of it they need not\nactually be present in it. If a state has a valid claim to a territory\nand it allows freedom of movement within its boundaries, all citizens\nare usually understood to have occupancy right to the whole extent of\nthe territory, not just that portion in which they presently\nreside.\n\n\nThe plebiscitary rights theorist could reply as follows. Even if all\nthe citizens of the state have occupancy rights regarding the seceding\nregion, surely those residing in that region have weightier occupancy\nrights, at least if being in that region is important for their\nindividual and collective projects.\n\n\nThe discussion in this entry thus far indicates that all three types\nof the most prominent theories (remedial rights only, plebiscitary, and\nascriptivist) suffer a serious incompleteness: they do not situate\ntheir views on secession within the context of a comprehensive theory\nof territorial justice. A theory of territorial justice aims to do at\nleast the following four things, all of which are relevant to theories\nof secession. First, it should provide a coherent account of\nvalid moral claims to territory of various types, from claims to full\nsovereign jurisdiction, to claims to the more limited jurisdictional\ncontrol needed for various forms of intrastate autonomy (modes of\nself-determination short of full independence), to claims to\nparticipation in various forms of joint jurisdiction. Second, and\nrelatedly, it should offer a coherent explanation of which elements of\ncontrol over territory can be justified. A theory of territory is not\nonly a theory of the geographical domain of jurisdictional authority\nbut also must the right to control resources within a territory, the\nright of defense against the taking of territory, the right to control\nover the movement of people and good across borders, and so on.\n\n\nThird, it should explain which groups are connected, in which ways,\nto which territories. That requires offering principles to guide\nthe drawing of boundaries and to adjudicate disputes over\nboundaries. Finally, it would need to have a theory of what kind\nof agent has rights over territory (a nation? – as in\nMiller’s (2007) theory; an ethno-geographic group? as argued by\nKolers (2009); a people? as in Moore (2015) and Stilz (2019)) and how\nthese groups relate to the state.\n\n\nFor each type of theory of secession, there are unanswered questions\nand potential objections regarding territorial justice. For example,\nremedial right only theories that include unjust annexations of\nterritory among the injustices that ground a unilateral (claim-)right\nto secede must provide a satisfactory solution to what has elsewhere\nbeen called the moral statute of limitations problem (Buchanan 1991:\n88): how durable are claims to independence based on past unjust\ntakings—how far back in history may a group go in making the case\nthat they are entitled to their own state because they previously had\none?\n\n\nImportantly, a remedial right only theory of the unilateral right to\nsecede will only be defensible in the end if it rests upon a plausible\naccount of what entitles a state to control over a territory in the\nfirst place. Without such an account the remedial right only view\nappears arbitrarily to privilege the status quo by requiring\nsecessionists to bear the burden of showing that they have suffered\nserious and persistent injustices in order to establish their claim to\nterritory. To answer this objection, the remedial right only theorist\nwould have to provide and defend a justice-based theory of legitimacy,\narguing that what grounds the state’s claim to territory is its\nprovision of justice, and that it is for this reason that only serious\ninjustices can void that claim (such an account of legitimacy is in\nBuchanan 2013). To avoid the charge that its theory of territorial\nrights gives short shrift to the value of self-determination, a\nremedial right theory would have to show that in some cases at least a\nsecessionist group’s claims to self-determination can be\nadequately accommodated by intrastate autonomy arrangements that do not\nerase the state’s claims to its entire territory. And it would\nhave to provide a principled account of when claims to\nself-determination are adequately satisfied through intrastate autonomy\narrangements short of full-independence.\n2.5. Narrowly versus Widely Institutional Theories\n\n\nThere is another illuminating way of sorting theories of secession.\nAs noted in subsection 2.3, some theories assume that only certain\nfacts institutions are relevant for determining when a group has the\nright to secede.. The plebiscitary theory developed by Altman and\nWellman (2009), assumes that the only institutional facts that matter\nare these: will the seceding group be able to create the institutions\nneeded for it to function and will the remainder state’s\ninstitutions allow it to continue to function. In other words, on\ntheir view, the only institutional interests relevant to determining\nwhether a right to secede exists are the interest in the functioning of\nthe new state and the remainder state. In effect, this theory treats\nsecession as strictly a two-party affair, so far as the interest\nrelevant to determining whether a group has the right to secede is\nconcerned. Buchanan’s theory, in contrast, argues that other\nparties can have legitimate interests that are relevant to determining\nwhat the rights of the primary parties are. In particular, he contends\nthat international institutional interests are relevant, including the\ninterest in preventing human rights violations that predictably occur\nin contested secessions and the interest in sustaining stable and\npeaceful relations among states.\n\n\nAltman and Wellman might reply that their State Viability Proviso\ndoes take the interests of third parties into account. More\nspecifically, the fulfillment of the Proviso serves the interests of\nthird parties in having viable states and in the provision of justice\nthat comes with the discharging of basic state functions.\n\n\nThe problem with this reply is that, while acknowledging that\nthird-party interests can be relevant to determining whether a group\nhas the right to secede, it offers no reason as to why legitimate\nthird-party interests should be thus restricted. Why aren’t the\ninterest in sustaining a stable order of states and in avoiding\nsecurity crises of the sort that secessions—especially\nirredentist secessions--can create also relevant to determining the\ncontours of the right to secede? After all, whether a group has the\n(claim-)right to secede depends on whether other parties have\nsufficient reason to refraining from trying to prevent the secession\nand that in turn can depend on whether the secession is likely to have\na negative impact on various legitimate interests, including, but not\nlimited to the interest in the remainder state and the new state being\nviable.\n\n\nThis leaves plebiscitary theories vulnerable to the following\nobjection: Suppose that a group within a legitimate, reasonably just\nstate, is a majority in a portion of the state’s territory and\nprefers to have its own state. Whether they have the right to secede\ndepends on whether there are sufficient reasons for other states to\nrefrain from interfering with their attempt at secession (because the\nright in question is a claim-right, which features a correlative\nobligation not to interfere with the secession). But whether other\nstates ought to refrain from interfering with a secession or not\ninterfere with the state’s attempt to prevent a secession can\ndepend on whether behaving in this way is likely to help establish a\nnew norm of customary international law that permits\nterritorially-concentrated majorities unilaterally to form their own\nstates without interference. In the absence of impartial institutions\nto determine when the conditions for justified secession according to\nthe plebiscitary theory are met, such a new, much more permissive norm\nof customary international law would be dangerous—it might\nencourage secessions that do not meet the plebiscitary theories’\nown criteria. So, as in the case of irredentist secessions noted above,\nit appears that in these circumstances as well, whether other states\nought to interfere with an attempted secession, and hence whether a\ngroup has the right to secede, can depend on factors other than those\nthe plebiscitary theory allows to count.\n\n\nIf it is true that a range of legitimate interests is relevant to\ndetermining the nature of the moral right to secede, and if the extent\nthat these interests are impacted by secession depends on the existing\ninstitutional resources, including not just those of the remainder\nstate and the new state, but also those of regional and international\norganizations, then it follows that a theory of the moral right to\nsecede must take into account existing institutional realities at all\nlevels. Buchanan’s latest work on secession delves into just\nthis—he argues that the moral right to secede is\ninstitution-dependent in the sense that whether a group has\nthe moral right to secede depends on the nature of existing\ninstitutions and whether or not they can adequately mitigate the risks\nthat secession would pose to various morally important interests. This\nmeans that properly theorizing the right to secede requires\nempirically-backed premises that characterize a) the range of morally\nsignificant interests at risk in various cases of secession and b) the\nability or inability of existing institutions to mitigate those risks.\nIf this is true, then it seems that both remedial right only and\nprimary right views are incomplete, as neither provide these important\nempirical premises.\n2.6 Comparing Theories of Secession\n\n\nAt present it is fair to say that none of the rival types of\ntheories is sufficiently worked out for a definitive comparative\nevaluation to be possible. For each type of theory there are unanswered\nquestions and potential objections.\n\n\nAll three types of theories must address satisfactorily what may be\ncalled the problem of authentic voice. For ascriptivist and remedial\nright only theories, this means providing a reasoned answer to the\nquestion “what counts as an authentic decision to attempt to\nsecede?” (Is there some nonarbitrary way of specifying what sort\nof majority is required in favor of secession before it can be said\nthat the group in question has chosen to exercise its right to\nsecede?). Similarly, plebiscitary right theorists must provide a\nprincipled account of how large a majority in favor of secession must\nexist, before it can be said that the right to secede exists.\n\n\nIn addition, all three types of theories must articulate a plausible\naccount of the rights of those within the seceding territory who oppose\nsecession. For example, are there circumstances in which the\nanti-secessionists should be granted dual citizenship, so that they can\npreserve their citizenship in the state from which the secession is\noccurring? Are there circumstances in which they deserve compensation\nfor losses they incur when a new state, perhaps with different property\nlaws, is created?\n\n\nFinally, as suggested earlier, the implications of each type of\ntheory for international law regarding secession should be explained.\nIn the next section, we explore briefly the relationship between views\nabout the moral (claim-)right to unilateral secession and the question\nof what position international law should take on unilateral\nsecession.\n3. Secession and Just War Theory\n\n\nA more serious lacuna in the philosophical literature on secession\nthan the failure to integrate it into a comprehensive theory of\nterritorial justice is the absence of a connection with just war\ntheory. In real-world conflicts in which a group asserts the right to\nsecede and the state denies the validity of the claim, either one or\nboth of the parties often resorts to force. But merely establishing\nthat a group has the right to secede does not settle whether it is\njustified in using force to achieve its goal of independent statehood.\n(In general, merely having a right to X does not\nentail being justified in using force to secure X).\nSimilarly, if the group does not have the right to secede, it may still\nnot be justifiable for the state to use force to prevent it from\nseceding. Remarkably, philosophical theories of secession have not\ndistinguished between having the right to secede and being justified in\nusing force to exercise the right. Nor have they discussed the\nconditions under which states have the right to use force to resist\nsecessions when the secessionists have no moral right to secede. This\nis especially surprising, given the resurgence of philosophical\ntheorizing about just war.\n\n\nThe key point here is that mainstream just war theory does not\nendorse the assertion that the violation of any right can justify force\nnor the assertion that force is justified if it is required for the\nsuccessful exercise of any right. Instead, the dominant view is that\nthe list of just causes (legitimate ends to be served by going to war)\nis more constrained than that and should reflect the conviction that\nthe use of force is only justified if it is required to remedy very\nserious injustices or for the exercise of very important rights and\nalso satisfies a proportionality requirement.\n\n\nIt is far from obvious how just war theory and the theory of\nsecession should be connected. It appears, however, the use of force by\nsecessionists would be more problematic on some theories of secession\nthan on others. Suppose, for example, that a majority of the people in\na portion of a legitimate state’s territory decide that they want\ntheir own state there, in spite of the fact that they are not victims\nof any injustices at the hands of the state. On the plebiscitary\ntheory, they have the right to secede (so long as the new unit and the\nremainder state will be able adequately to perform the basic functions\nof government). If the state refuses to vacate its facilities in that\nregion, turn over control over that portion of the border to the\nsecessionists, etc., is it justifiable for the secessionists to use\nforce against the agents of the state? Does the mere preference for\ntheir own state justify engaging in a course of action that is likely\nto result in large-scale violence? The problem here is that the purpose\nthe secessionists can invoke to justify a course of action seems not to\nfit well with the usual understandings of just cause. In contrast,\nremedial right only theories would seem to be consistent, at least in\nprinciple, with mainstream just war theory, because the latter\nrecognizes redress of serious injustices (and not the mere desire to\nhave one’s own political unit) as a just cause.\n\n\nNonetheless, a fully-developed remedial right only theory would have\nto provide an account of when injustices are sufficiently serious to\nwarrant secession under conditions in which there is a significant risk\nof large-scale violence. Regardless of which type of theory one\nembraces, one would also need an account of the conditions under which\nthe state would be justified in using force to block secession. For as\nwe have already noted, the mere fact that the group attempting to\nsecede does not have a right to secede does not imply that it is\njustifiable for the state to use force to prevent them from seceding. A\nmoral theory of secession should not be limited, then, to articulating\nand defending characterization of the moral right to secede. It should\nalso provide an account of the morality of using force in conflicts\nover secession and one that is consistent with its view of the right to\nsecede.\n4. Secession and the Philosophy of International Law\n\n\nThere is yet another desideratum for a theory of secession: As\nsuggested earlier, the implications of each type of theory for\ninternational law regarding secession should be explained. And\npresumably an account of the morality of secession should provide some\nguidance for determining what the posture of international law should\nbe regarding secession. In the next section, we explore briefly the\nrelationship between views about the moral (claim-)right to unilateral\nsecession and the question of what position international law should\ntake on unilateral secession.\n\n\nThe deficiencies of existing international law regarding secession\nmotivate the project of developing principled proposals for reform. At\npresent international law recognizes only a very narrow set of\ncircumstances under which the unilateral right to secede exists as an\ninternational legal right, namely, when a group is subject to colonial\ndomination or is the victim of an unlawful occupation by a foreign\nentity or is subjected to an Apartheid-like regime. The difficulty with\nthis conception of the international legal right to unilateral\nsecession is that, while clearly embodying the idea that serious and\npersistent injustices can generate a right to unilateral secession, it\narbitrarily restricts the injustices that generate the right.\n\n\nAnother difficulty is that while international legal doctrine with\nan arbitrarily restricted conception of the situations that generate a\nunilateral right to secede, several important international legal\ndocuments include reference to an apparently much broader “right\nof self-determination of all peoples” which is said to include\nthe right to choose full independence, and hence the right to\n secede.[10]\n One\nway to conceive of the chief task for a moral theory of international\nlaw regarding secession is that it must provide a reasoned basis for\nremoving the arbitrary restriction from which the current law suffers,\nwhile avoiding the dangerously expansive notion that all\n“peoples” are entitled to their own states, in a world in\nwhich virtually every existing state includes more than one\n“people”, in which several “peoples” claim the\nsame territory, and in which there are no international institutional\nprinciples or mechanisms for sorting out these conflicting claims.\n\n\nAn important choice for the moral theorist of international law\nregarding secession regards the scope of the right itself. On one view,\ninternational law should simply acknowledge, under certain conditions\nto be specified by the theory, a group’s right to its own state;\non the other view, international law should distinguish between (a) the\nconditions under which a group should be accorded the right to\nrepudiate the jurisdiction of the state over a portion of the\nstate’s territory and to attempt to establish its own control\nthere and (b) the conditions under which international law should\nrecognize the secessionist entity as a legitimate state, with all the\nrights, immunities, privileges, and obligations this entails.\n\n\nThe difference between these two options can be appreciated if we\ntake the example of a remedial right only approach to proposals for\nreforming international law regarding secession. For simplicity,\nsuppose that the remedial right only theory under consideration\nrecognizes only large-scale and persistent violations of basic human\nrights as grounding the unilateral right to secede, and suppose that\ngroup G has suffered such violations. On the first\nview, the proposal is that international law should simply acknowledge\nthat G has the right to its own legitimate state if\nforming a new state is the remedy of last resort for large-scale,\npersistent violations of the basic human rights of members\nof G, where this means that other states should recognize\nthe new entity as having all the rights, privileges, immunities,\npowers, and obligations this status entails. On the second view, there\nare two distinct questions the international law of secession should\naddress: First, has G suffered large-scale and\npersistent violations of basic human rights and second,\ndoes G satisfy the conditions for recognitional\nlegitimacy, for being recognized as a legitimate state? The second view\nwould maintain that although the group’s having suffered\nlarge-scale and persistent violations of basic human rights is\nsufficient for acknowledging its right to repudiate the state’s\njurisdiction and attempt to set up its own state, something more is\nrequired before international law should recognize the new entity as a\nlegitimate state; in particular, the new state should provide credible\nassurances that it will respect the rights of minorities within its\nterritory.\n\n\nMaking recognition of legitimate statehood dependent in this way\nupon satisfying basic requirements of justice coheres with the remedial\nright only theory’s approach to secession, which involves\nrewarding states that respect rights. But there is much to be said for\ndistinguishing, regardless of which theory of the right to secede is\nadopted, between the right to secede (understood as\nthe right to repudiate the state’s authority over a portion of\nits territory and to attempt to set up a new state there) and\nthe right to recognition as a legitimate state. New\nentities created through secession typically are keen to receive\nrecognition of their legitimacy because of the benefits this confers,\nincluding access to favorable trade regimes, loans and credits from\ninternational agencies such as the World Bank and International\nMonetary Fund, and the ability to participate as an equal with other\nstates in the making of international law. Distinguishing between\nwhether a group has the right to secede (to repudiate the state’s\njurisdiction and attempt to establish its own state) and whether it has\nthe right to recognition as a legitimate state enables the\ninternational legal system to impose normative conditions on\nrecognition in circumstances in which new states have strong incentives\nto satisfy them.\n\n\nA fully-developed philosophical theory of what the international law\nof secession ought to be would be quite ambitious and complex. It would\nhave to include not only an account of the connection between the right\nto secede and the right to recognition, but also a theory of justified\nintervention in support of or against secession that would cohere with\na more general position on the legitimate use of force across\nborders.\n5. Conclusion\n\n\nPhilosophical work on secession falls into three main categories:\n(1) attempts to develop an account of the moral right to secede\n(understood either as a claim-right or as a mere liberty), (2)\ninvestigations of the compatibility or incompatibility of secession\nwith constitutionalism, and (3) attempts to determine what posture\ninternational law should adopt concerning secession. In each of these\nareas of inquiry, as well as in the connections among them, exploration\nof the moral issues of secession provides a powerful lens through which\nto examine some of the most important issues of moral-political theory,\nincluding perhaps the most fundamental issue of all: what gives a state\na valid claim to its territory?\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Altman, Andrew and Christopher Heath Wellman, 2009, <em>A Liberal\nTheory of International Justice</em>, Oxford: Oxford University\nPress.",
                "Brilmayer, Lea, 1991, “Secession and Self-Determination: A\nTerritorial Interpretation”, <em>Yale Journal of International\nLaw</em>, 16: 177–202.",
                "–––, 2015, “Secession and the Two Types of\nTerritorial Claims”, <em>ILSA Journal of International and\nComparative Law</em>, 21(2): 325–332.",
                "Buchanan, Allen, 1991, <em>Secession: The Legitimacy of Political\nDivorce From Fort Sumter to Lithuania and Quebec</em>, Boulder:\nWestview Press.",
                "–––, 1997, “Theories of Secession”,\n<em>Philosophy &amp; Public Affairs</em>, 26(1): 31–61.\ndoi:10.1111/j.1088-4963.1997.tb00049.x",
                "–––, 1998a, “Democracy and\nSecession”, in Moore 1998b: 14–30.\ndoi:10.1093/0198293844.003.0002",
                "–––, 1998b, “What’s So Special About\nNations?”, in Jocelyne Couture, Kai Nielsen, and Michel Seymour\n(eds.), <em>Rethinking Nationalism</em>, Calgary: University of\nCalgary Press.",
                "–––, 2002, “Political Legitimacy and\nDemocracy”, <em>Ethics</em>, 112(4): 689–719.\ndoi:10.1086/340313",
                "–––, 2004, <em>Justice, Legitimacy, and\nSelf-Determination: Moral Foundations for International Law</em>,\nOxford: Oxford University Press. doi:10.1093/0198295359.001.0001",
                "–––, 2006, “Uncoupling Secession from\nNationalism and Intrastate Autonomy”, in <em>Negotiating\nSelf-Determination</em>, Hurst Hannum and Eileen F. Babbitt (eds),\nLanham, MD: Lexington Books.",
                "–––, 2013, <em>The Heart of Human Rights</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199325382.001.0001",
                "Catala, Amandine, 2013, “Remedial Theories of Secession and\nTerritorial Justification”, <em>Journal of Social\nPhilosophy</em>, 44(1): 74–94. doi:10.1111/josp.12011",
                "–––, 2015, “Secession and Annexation: The\nCase of Crimea”, <em>German Law Journal</em>, 16(3):\n581–607.",
                "–––, 2017, “Secession and Distributive\nJustice”, <em>Philosophical Studies</em>, 174(2): 529–552.\ndoi:10.1007/s11098-016-0695-2",
                "Cavallero, Eric, 2003, “Popular Sovereignty and the Law of\nPeoples”, <em>Legal Theory</em>, 9(3): 181–200.\ndoi:10.1017/S1352325203000089",
                "–––, 2017, “Value Individualism and the\nPopular-Choice Theory of Secession”, <em>Social Theory and\nPractice</em>, 43(1): 125–153.\ndoi:10.5840/soctheorpract20174316",
                "Copp, David, 1998, “International Law and Morality in the\nTheory of Secession”, <em>The Journal of Ethics</em>, 2(3):\n219–245.",
                "Gans, Chaim, 2003, <em>The Limits of Nationalism</em>, Cambridge:\nCambridge University Press.",
                "Gellner, Ernest, 2008, <em>Nations and Nationalism</em>, Ithaca:\nCornell University Press.",
                "Hirschman, Albert O., 1970, <em>Exit, Voice, and Loyalty</em>,\nCambridge, MA: Harvard University Press.",
                "Kolers, Avery, 2009, <em>Land, Conflict, and Justice: A Political\nTheory of Territory</em>, Cambridge: Cambridge University Press.",
                "Meisels, Tamar, 2009, <em>Territorial Rights</em>, second edition,\nBerlin: Springer.",
                "Mill, John Stuart, [1861] 1991, <em>Considerations on\nRepresentative Government</em>, New York: Prometheus Books.",
                "Miller, David, 1995, <em>On Nationality</em>, New York: Clarendon\nPress. doi:10.1093/0198293569.001.0001",
                "–––, 1997, “Secession and the Principle of\nNationality”, <em>Canadian Journal of Philosophy</em>\n(Supplement), 26: 261–282.",
                "Moore, Margaret, 1998a, “Introduction”, in Moore\n1998b: 1–13. doi:10.1093/0198293844.003.0001",
                "–––, 1998b, <em>National Self-Determination and\nSecession</em>, Margaret Moore (ed.), Oxford: Oxford University Press.\ndoi:10.1093/0198293844.001.0001",
                "–––, 2000, “The Ethics of Secession and a\nNormative Theory of Nationalism”, <em>The Canadian Journal of\nLaw and Jurisprudence</em>, 13(2): 225–250.",
                "Nine, Cara, 2012, <em>Global Justice and Territory</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199580217.001.0001",
                "Norman, Wayne, 2003, “Domesticating Secession”, in\nSteven Macedo and Allen Buchanan (eds.), <em>Secession and\nSelf-Determination</em> (NOMOS XLV), New York: New York University\nPress.",
                "–––, 2006, <em>Negotiating Nationalism:\nNation-Building, Federalism, and Secession in the Multinational\nState</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198293356.001.0001",
                "Philpott, Daniel, 1995, “A Defense of\nSelf-Determination”, <em>Ethics</em>, 105(2): 352–85.\ndoi:10.1086/293704",
                "Stilz, Anna, 2019, <em>Territorial Sovereignty</em>, New York:\nOxford University Press.",
                "Sunstein, Cass, 1991, “Constitutionalism and\nSecession”, <em>University of Chicago Law Review</em>, 58(2):\n633–70.",
                "Wellman, Christopher Heath, 2005, <em>A Theory of Secession: The\nCase for Political Self-Determination</em>, Cambridge: Cambridge\nUniversity Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Altman, Andrew and Christopher Heath Wellman, 2009, <em>A Liberal\nTheory of International Justice</em>, Oxford: Oxford University\nPress.</li>\n<li>Brilmayer, Lea, 1991, “Secession and Self-Determination: A\nTerritorial Interpretation”, <em>Yale Journal of International\nLaw</em>, 16: 177–202.</li>\n<li>–––, 2015, “Secession and the Two Types of\nTerritorial Claims”, <em>ILSA Journal of International and\nComparative Law</em>, 21(2): 325–332.</li>\n<li>Buchanan, Allen, 1991, <em>Secession: The Legitimacy of Political\nDivorce From Fort Sumter to Lithuania and Quebec</em>, Boulder:\nWestview Press.</li>\n<li>–––, 1997, “Theories of Secession”,\n<em>Philosophy &amp; Public Affairs</em>, 26(1): 31–61.\ndoi:10.1111/j.1088-4963.1997.tb00049.x</li>\n<li>–––, 1998a, “Democracy and\nSecession”, in Moore 1998b: 14–30.\ndoi:10.1093/0198293844.003.0002</li>\n<li>–––, 1998b, “What’s So Special About\nNations?”, in Jocelyne Couture, Kai Nielsen, and Michel Seymour\n(eds.), <em>Rethinking Nationalism</em>, Calgary: University of\nCalgary Press.</li>\n<li>–––, 2002, “Political Legitimacy and\nDemocracy”, <em>Ethics</em>, 112(4): 689–719.\ndoi:10.1086/340313</li>\n<li>–––, 2004, <em>Justice, Legitimacy, and\nSelf-Determination: Moral Foundations for International Law</em>,\nOxford: Oxford University Press. doi:10.1093/0198295359.001.0001</li>\n<li>–––, 2006, “Uncoupling Secession from\nNationalism and Intrastate Autonomy”, in <em>Negotiating\nSelf-Determination</em>, Hurst Hannum and Eileen F. Babbitt (eds),\nLanham, MD: Lexington Books.</li>\n<li>–––, 2013, <em>The Heart of Human Rights</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199325382.001.0001</li>\n<li>Catala, Amandine, 2013, “Remedial Theories of Secession and\nTerritorial Justification”, <em>Journal of Social\nPhilosophy</em>, 44(1): 74–94. doi:10.1111/josp.12011</li>\n<li>–––, 2015, “Secession and Annexation: The\nCase of Crimea”, <em>German Law Journal</em>, 16(3):\n581–607.</li>\n<li>–––, 2017, “Secession and Distributive\nJustice”, <em>Philosophical Studies</em>, 174(2): 529–552.\ndoi:10.1007/s11098-016-0695-2</li>\n<li>Cavallero, Eric, 2003, “Popular Sovereignty and the Law of\nPeoples”, <em>Legal Theory</em>, 9(3): 181–200.\ndoi:10.1017/S1352325203000089</li>\n<li>–––, 2017, “Value Individualism and the\nPopular-Choice Theory of Secession”, <em>Social Theory and\nPractice</em>, 43(1): 125–153.\ndoi:10.5840/soctheorpract20174316</li>\n<li>Copp, David, 1998, “International Law and Morality in the\nTheory of Secession”, <em>The Journal of Ethics</em>, 2(3):\n219–245.</li>\n<li>Gans, Chaim, 2003, <em>The Limits of Nationalism</em>, Cambridge:\nCambridge University Press.</li>\n<li>Gellner, Ernest, 2008, <em>Nations and Nationalism</em>, Ithaca:\nCornell University Press.</li>\n<li>Hirschman, Albert O., 1970, <em>Exit, Voice, and Loyalty</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Kolers, Avery, 2009, <em>Land, Conflict, and Justice: A Political\nTheory of Territory</em>, Cambridge: Cambridge University Press.</li>\n<li>Meisels, Tamar, 2009, <em>Territorial Rights</em>, second edition,\nBerlin: Springer.</li>\n<li>Mill, John Stuart, [1861] 1991, <em>Considerations on\nRepresentative Government</em>, New York: Prometheus Books.</li>\n<li>Miller, David, 1995, <em>On Nationality</em>, New York: Clarendon\nPress. doi:10.1093/0198293569.001.0001</li>\n<li>–––, 1997, “Secession and the Principle of\nNationality”, <em>Canadian Journal of Philosophy</em>\n(Supplement), 26: 261–282.</li>\n<li>Moore, Margaret, 1998a, “Introduction”, in Moore\n1998b: 1–13. doi:10.1093/0198293844.003.0001</li>\n<li>–––, 1998b, <em>National Self-Determination and\nSecession</em>, Margaret Moore (ed.), Oxford: Oxford University Press.\ndoi:10.1093/0198293844.001.0001</li>\n<li>–––, 2000, “The Ethics of Secession and a\nNormative Theory of Nationalism”, <em>The Canadian Journal of\nLaw and Jurisprudence</em>, 13(2): 225–250.</li>\n<li>Nine, Cara, 2012, <em>Global Justice and Territory</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199580217.001.0001</li>\n<li>Norman, Wayne, 2003, “Domesticating Secession”, in\nSteven Macedo and Allen Buchanan (eds.), <em>Secession and\nSelf-Determination</em> (NOMOS XLV), New York: New York University\nPress.</li>\n<li>–––, 2006, <em>Negotiating Nationalism:\nNation-Building, Federalism, and Secession in the Multinational\nState</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198293356.001.0001</li>\n<li>Philpott, Daniel, 1995, “A Defense of\nSelf-Determination”, <em>Ethics</em>, 105(2): 352–85.\ndoi:10.1086/293704</li>\n<li>Stilz, Anna, 2019, <em>Territorial Sovereignty</em>, New York:\nOxford University Press.</li>\n<li>Sunstein, Cass, 1991, “Constitutionalism and\nSecession”, <em>University of Chicago Law Review</em>, 58(2):\n633–70.</li>\n<li>Wellman, Christopher Heath, 2005, <em>A Theory of Secession: The\nCase for Political Self-Determination</em>, Cambridge: Cambridge\nUniversity Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "citizenship",
            "constitutionalism",
            "democracy",
            "federalism",
            "identity politics",
            "legal obligation and authority",
            "sovereignty"
        ],
        "entry_link": [
            {
                "../citizenship/": "citizenship"
            },
            {
                "../constitutionalism/": "constitutionalism"
            },
            {
                "../democracy/": "democracy"
            },
            {
                "../federalism/": "federalism"
            },
            {
                "../identity-politics/": "identity politics"
            },
            {
                "../legal-obligation/": "legal obligation and authority"
            },
            {
                "../sovereignty/": "sovereignty"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=secession\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/secession/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=secession&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/secession/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=secession": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/secession/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=secession&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/secession/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.princeton.edu/~lisd/\" target=\"other\">The Liechtenstein Institute on Self-Determination</a>,\n Princeton University,\n<br/>\n[This site links to numerous academic centers, think tanks,\ninternational organizations, government agencies, NGOs, journals and\nnews organizations dealing with self-determination and\nsecession.]"
        ],
        "listed_links": [
            {
                "http://www.princeton.edu/~lisd/": "The Liechtenstein Institute on Self-Determination"
            }
        ]
    }
}