{
    "url": "social-construction-naturalistic",
    "title": "Naturalistic Approaches to Social Construction",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Ron Mallon\n<rmallon@wustl.edu>",
        "author_links": [
            {
                "https://philosophy.wustl.edu/people/ron-mallon": "Ron Mallon"
            },
            {
                "mailto:rmallon%40wustl%2eedu": "rmallon@wustl.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"https://philosophy.wustl.edu/people/ron-mallon\" target=\"other\">Ron Mallon</a>\n&lt;<a href=\"mailto:rmallon%40wustl%2eedu\"><em>rmallon<abbr title=\" at \">@</abbr>wustl<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 10, 2008",
        "substantive revision Fri Jan 11, 2019"
    ],
    "preamble": "\n\nSocial “construction,” “constructionism” and\n“constructivism” are terms in wide use in the humanities\nand social sciences, and are applied to a diverse range of objects\nincluding the emotions, gender, race, sex, homo- and hetero-sexuality,\nmental illness, technology, quarks, facts, reality, and truth. This\nsort of terminology plays a number of different roles in different\ndiscourses, only some of which are philosophically interesting, and\nfewer of which admit of a “naturalistic” approach—an\napproach that treats science as a central and successful (if sometimes\nfallible) source of knowledge about the world. If there is any core\nidea of social constructionism, it is that some object or objects are\ncaused or controlled by social or cultural factors rather than natural\nfactors, and if there is any core motivation of such research, it is\nthe aim of showing that such objects are or were under our control:\nthey could be, or might have been, otherwise.\n\nDetermination of our representations of the world (including our\nideas, concepts, beliefs, and theories of the world) by factors other\nthan the way the world is may undermine our faith that any independent\nphenomena are represented or tracked, undermining the idea that there\nis a fact of the matter about which way of representing is correct.\nAnd determination of the non-representational facts of the world by\nour theories seems to reverse the “direction of fit”\nbetween representation and reality presupposed by our idea of\nsuccessful epistemic activity. For both of these reasons, proponents\nand opponents of constructionist thought have held it to embody a\nchallenge to the naturalism endemic in contemporary philosophy. But\nsocial constructionist themes can be and have been picked up by\nnaturalists who hope to accommodate the interesting and important\ncultural phenomena documented by constructionist authors while denying\nmore radical anti-scientific and anti-realist theses widely associated\nwith social constructionism.\n\nI begin by discussing social constructionism, and I then discuss some\nthreads of contemporary naturalism. I go on to consider two different\nsorts of objects of social construction—representations and\nhuman traits—and discuss naturalistic, constructionist\napproaches to them.\n",
    "toc": [
        {
            "#WhaSocCon": "1. What is Social Construction?"
        },
        {
            "#WhaCons": "1.1 What Constructs?"
        },
        {
            "#WhaCond": "1.2 What is Constructed?"
        },
        {
            "#WhaItCon": "1.3 What is it to Construct?"
        },
        {
            "#NatSocCon": "2. Naturalism and Social Construction"
        },
        {
            "#NatgSocCon": "3. Naturalizing Social Construction"
        },
        {
            "#SocConRep": "3.1 The Social Construction of Representations"
        },
        {
            "#ConHumKinHumTra": "3.2 Construction, Human Kinds and Human Traits"
        },
        {
            "#Con": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Social Construction?\n\nWhile constructionist claims often take the passive form of a\ndeclaration that “Y is socially constructed,” it\nis more useful to think of social constructionist claims as having the\nform of a two-part relation:\n\nX socially constructs Y.\n\n\nWe can then think of different accounts of social construction as\ndiffering in their accounts either of the relation itself, or of one\nor both relata.\n1.1 What Constructs?\n\nWhile philosophers have carefully engaged various constructionist\nclaims over the last several decades, much of the attention has been\npaid to various objects of construction (e.g., ideas? knowledge?\nfacts? human nature?). In contrast, comparatively little attention has\nbeen paid to distinguishing different sorts of agents of construction.\nMany of the agents in social constructionist claims can be neatly\ndivided into two groups: those that view the agents as primarily\nimpersonal agents, and those that view the agents as\npersonal agents (i.e., persons or groups).\n\nWork in the first group emphasizes a causal role for impersonal causes\nlike cultures, conventions, or institutions in producing some\nphenomenon. For example, the claim that what we perceive is determined\nby our background theories emphasizes an impersonal causal\nagent—culture—in determining some phenomena. Perhaps the\nmost influential version of this claim came in Thomas Kuhn’s\nsuggestion that, “what a man sees depends both upon what he\nlooks at and also upon what his previous visual-conceptual experience\nhas taught him to see” (1962/1970, 113), a suggestion with some\nfoundation in “New Look ” psychology (e.g. Briner,\nPostman, and Rodrigues 1951). This view was subsequently taken up by a\nrange of other authors across disciplines. For example, the historian\nThomas Laqueur writes that, “powerful prior notions of\ndifference or sameness determine what one sees and reports about the\nbody” (1990,\n 21).[1]\n Provocative claims like Kuhn’s and Laqueur’s suggest that\nperception is so dependent upon the background theories that the\nobservational data becomes compromised as an independent constraint on\nempirical inquiry. Impersonal cultural accounts of construction are\nalso found in explanations of nonrepresentational phenomena, for\nexample, of sex-differentiated behavior. Here a core claim might admit\nthat there is sex difference, but claim that the cause of difference\nis rooted in different conceptions of sex (and the practices caused by\nthose conceptions) rather than biological facts (see\n Feminist Perspectives on Sex and Gender).\n\nA second group of constructionist claims emphasizes personal\nsocial agents that construct through their choices. For example,\nAndrew Pickering’s (1984) influential work Constructing\nQuarks emphasizes the role of scientists’ judgments in a\nvariety of roles in scientific process including, e.g., theory\nselection, experiment evaluation, assessments of research fecundity,\nand so forth, and such an emphasis on apparently highly contingent\nchoices by researchers and scientific institutions is a mainstay of\nthe social studies of knowledge literature. In emphasizing personal\nchoices, some constructionist work (including some of\nPickering’s) seems primarily aimed at emphasizing the\ncontingency of the scientific theory that we come to accept (cf.\nHacking\n 1999).[2]\n Other constructionists—those we might call critical\nconstructionists—emphasize personal choices not just to\nestablish the contingency of the acceptance of some representation as\nto emphasize the role of an agent’s interests or power relations\nin determining the content of an accepted representation. For example,\nCharles Mills suggests that the borders of American racial categories\nwere determined in such a way as to “establish and maintain the\nprivileges of different groups. So, for example, the motivation for\nusing the one-drop rule to determine black racial membership is to\nmaintain the subordination of the products of\n‘miscegenation’” (1998, 48). And a range of\nconstructionist research, especially research on human classifications\nlike “race” and “gender,” documents shifts in\nhuman classification in response to shifts of interests or power.\n1.2 What is Constructed?\n\nSocial constructionist claims are made about so many different objects\nthat it is perhaps not surprising to find that such claims have\ndifferent implications depending upon the different objects at which\nthey are directed. Most uses of “construction”-talk (and\nrelated talk to the effect that that objects are, surprisingly,\n“invented” or “made up”) are directed at three\nvery different sorts of entities: representations (e.g. ideas,\ntheories, concepts, accounts, taxonomies, and so forth),\n(non-representational) facts quite generally, and a special sort of\nnon-representational fact: facts about human traits.\n\nMost philosophical discussion of social constructionism has been\nconcerned with the so-called “science wars” which means\nthat they have been concerned with evaluating the inference from the\nnumerous and complex social influences operating in the production of\nscientific theories to the social construction of the facts those\ntheories purport to represent, or to the failure of accounts of\nscientific rationality, or scientific realism, or scientific process\n(e.g. Laudan 1981, Nelson 1994, Fine 1996, Kukla 2000).\n\nBut “construction” talk has a more or less independent,\nbut equally contentious life in the “human nature wars”\nwhere it labels the position that human traits (for example the\nemotions) or human kinds (which we can think of categories whose\nmembers share traits or clusters of traits, including, especially,\ndispositions to think and behave) are produced by culture rather than\nby biology or nature. \n\nThis kind constructionist view contrasts with the view that\nhuman kinds or traits are to be explained in terms of non-cultural\nmechanisms – especially internal, biological or natural states of the\norganism. The most pronounced disputes are prima facie concerned with\nwhether the clustering of traits in, for example, sex difference,\nemotional behavior, or mental illness, are caused by a cultural\npractice of differentiating persons or are instead caused by natural\nprocesses operating in relative independence from culture.\n\nBut this kind constructionist view has also (especially in the\nphilosophy of race) come to contrast with the skeptical view that a\nkind does not exist. In the context of race, constructionism amounts\nto the positive assertion that race is real even though it is not\nconstituted by, or grounded in, biological facts such as genetic\ndifference. (See, e.g., Haslanger 2012, Taylor 2013, Sundstrom 2002,\nOutlaw 1995, and the section “Race: Do Races Exist? Contemporary\nPhilosophical Debates” in the entry on\n race.)\n\nWe consider naturalistic approaches to the construction of\nrepresentations and human traits in more detail below, but it is\nuseful to first distinguish global constructionist claims\nthat hold that every fact is a social construction, from\nlocal constructionist claims that hold that only particular\nfacts\n are.[3]\n Because of their provocative nature, many philosophers associate the\nterm “social construction” with a global thesis, and a\nstandard argument against global constructionism concerns whether such\na program is sustainable in the face of the regress such a global\nthesis engenders regarding the thesis of constructionism itself (e.g.\nBoghossian 2006, Kukla 2000). Philosophers may have focused on these\nmore radical claims in part because of the recognition that, relying\non something like the general idea of construction sketched above,\nclaims that are relatively global in scope are quite provocative and\nsurprising while claims that would count as locally socially\nconstructionist are quite familiar in many areas of philosophy,\nperhaps most importantly in meta-ethics, aesthetics, and social\nontology. The domain of social ontology is especially interesting\nbecause here many facts are widely recognized as social constructions:\nfor example, facts about being a U.S. Senator or a\nlicensed dog are social\n constructions.[4]\n Call such constructions overt\n constructions.[5]\n\nBut even local constructionist claims can be interesting to the extent\nthat they try to show some object may be produced by unacknowledged\nsocial practices—when they are covert constructions.\nThis is the role that they play in the philosophy of psychiatry\n(Hacking 1995a, Scheff 1984, Showalter 1996, cf. Murphy 2006), the\nphilosophy of the emotions (Averill 1980a, 1980b, Armon-Jones 1986,\nHarré 1986, cf. Griffiths 1997), the philosophy of race (e.g.\nOutlaw 1990, 1995; Mills 1998; Taylor 2013), and the philosophy of\ngender (see\n Feminist Theories of Sex and Gender: Gender as Socially Constructed).\n Here the local claim that some kind (for example mental\nillness, emotion, race, or gender) is\nexplained by received culture or practice retains its interest because\nit offers a metaphysical alternative to other explanations\n(biological, religious, etc.) of the differential features of the kind\nmembers as well as an alternative to skepticism about the reality of\nthe\n kind.[6]\n1.3 What is it to Construct?\n\nWe have already suggested that the core idea of constructionism is\nthat some social agent produces or controls some object. Of course,\n“construction” talk is meant to evoke a variety of\nconnotations that attend more paradigmatic construction: intentional\nactivity, engaged in step-by step fashion, producing a designed,\nartifactual product. While different objects lead constructionist talk\nto be interpreted in different ways, we can distinguish two different\nsorts of relationship: causal or\n constitutive.[7]\n On the first, X constructs Y if Y is\ncaused to come to exist, to continue to exist, or to have the\nproperties that it does by X. On the second, Y is\nconstructed if it is constituted by X’s\nconceptual or social activity (perhaps even independently of\nX’s causal influence on Y).\n\nThe first, and more straightforward idea is causal\nconstruction:\n\nX causally constructs Y if and only if\nX causes Y to exist or to persist or X\ncontrols the kind-typical properties of\n Y.[8]\n\n\nThere is no special problem posed by the claim that human social and\nlinguistic activities cause certain things to exist or persist, or\ncause certain facts to be. More obscure is the idea that\nX’s construction of Y is some sort of\nconstitutive relationship. Many constructionist claims seem\nto involve the idea that the world is itself “made up” by\nsocial and cultural activities in ways that suggest our\nsocio-linguistic behaviors are at least necessary to the object in\nquestion. This suggests a relationship such as:\n\nX constitutively constructs Y if and only\nif X’s conceptual or social activity regarding an\nindividual y is metaphysically necessary for y to be\na Y.\n\n\nConsider the ways in which causal and constitutive claims might pull\napart in a case of a socially produced artifact. Representations\nexpressing the concept watch are normally causally necessary\nfor some materials to come to have the intrinsic features of a watch,\nbut they are not metaphysically necessary. It is metaphysically\npossible, however unlikely, that we could walk across a heath and find\n(something with the intrinsic features of) a watch that had\n“always been there.”\n\nIn contrast, the best candidates for constitutive construction are\nsocial facts:\n\nFor social facts, the attitude that we take toward the phenomenon is\npartly constitutive of the phenomenon … Part of being a\ncocktail party is being thought to be a cocktail party; part of being\na war is being thought to be a war. This is a remarkable feature of\nsocial facts; it has no analogue among physical facts. (Searle 1995,\n33–34)\n\n\nOn Searle’s view, a particular gathering of persons can be a\ncocktail party only with the conceptual and social recognition of\nthose gathered. A similar idea has been influential in constructionist\ndiscussions. For example, the provocative claims that there were no\nhomosexuals before the concept homosexual came to be\nexpressed in Western culture in the nineteenth century (e.g. Foucault\n1978, Halperin 1990) or that race is a modern invention (e.g Taylor\n2004) seem to make sense if we see sexual or racial kinds as in part\nconstituted by our concepts of them.\n\nBut Searle is right that there is something remarkable here, at least\nin the case of social facts: somehow our conceptual scheme or practice\nare necessary to make it true that some event instantiates\ncocktail party or war. What is wanted is, at a\nminimum, a model of this production—a model of exactly how the\nconceptual practice constitutes the fact. Perhaps the most obvious\nmodel to explain such constitutive claims is to hold that the relevant\nnecessity is analytic, it holds in virtue of the meaning of\nthe relevant term or concept. It is a fact about the meaning of\n“cocktail party” and perhaps “homosexual” and\n“race”) that it does not apply to a thing unless it is\nrecognized to do so.\n\nWhether any such meaning claims can be accommodated has been\na contentious question since Quine (1953), but it is a question we can\nput aside for now (see\n The Analytic/Synthetic Distinction).\n Instead, we should ask whether such model of constitutivity as\nanalyticity is plausible for objects of social construction.\n\nOn the one hand, if Searle’s general account of social facts is\ncorrect, there may be many terms that operate like “cocktail\nparty” in that the participants produce them only when they\nshare certain intentional states about what they are doing. On the\nother hand, this does not seem plausible for the objects of many\nsocial constructionist claims. Remember, it is a mainstay of\nconstructionist research to claim that social influence is exercised\nin surprising and provocative ways, especially on objects that we take\nto be produced naturally. But just this feature suggests that it\ncannot be part of our ordinary concepts of covertly constructed kinds\nthat instances require our social-conceptual imprimatur to be members\nof these kinds (Machery 2014, Mallon 2017). This point is highlighted\nin a more general way by Paul Boghossian’s query:\n\nisn’t it part of the very concept of an electron, or of\na mountain, that these things were not constructed by us?\nTake electrons, for example. Is it not part of the very purpose of\nhaving such a concept that it is to designate things that are\nindependent of us? (2006, 39)\n\n\nIf this is right, constructionists who view construction as a\nconstitutive relation need another account of the necessity of our\nconceptual practice: it is implausible and inconsistent to claim that\nthe necessity arises out of concept or word meanings in cases of\ncovert construction.\n\nThere is a different model of necessity for the constructionist,\nhowever, which is to hold that the necessity in question is revealed\na posteriori by our investigations of the phenomenon in\nquestion. Saul Kripke (1980), Hilary Putnam (1975) and others defended\na causal theory of reference on which some terms (notably natural kind\nterms) referred to some sort of stuff or essence underlying the\ncentral uses of the term (see\n Reference: Causal Theories).\n Crucially, however, because the reference relation is external,\ncompetent users of a term can be radically mistaken about what the\nterm refers to and still successfully refer. In the case of water, for\nexample, Putnam suggests that “water” picks out the sort\nof stuff that bears the appropriate causal-historical relation to\nparadigmatic instances in our own causal history (viz.\nH2O), and this was true even when we did not know what sort\nof stuff that was (i.e. before we knew the chemical structure).\nKripke, Putnam, and others emphasized that claims such as\n“water=H2O” express necessary though a\nposteriori truths.\n\nWhile the causal theory of reference (and its correct interpretation)\nremains controversial, in many quarters of philosophy it has become\naccepted wisdom. It is thus an option for interpreters of social\nconstructionism to claim that certain terms—for example,\n“race”—actually refer to a kind that is produced by\nour socio-linguistic behavior, even if that fact is revealed only\na\n posteriori.[9]\n Such a constitutive constructionist could grant, then, that it is\npart of our ordinary conception of the concept (e.g. of race) that –\nlike electron – it refers to an independent, natural fact about the\nworld, but such a constructionist would insist that further\nexploration of the world reveals that conventional features of our\npractice produce the object of our study. As with the case of\n“water” before modern chemistry, the conception widely\nassociated with “race” (viz. that it is a biological kind)\nis wrong, but the term successfully refers all the same. Ideally, for\nsuch an approach to work, the constitutive constructionist would like\nan independent characterization of the sorts of social objects that\ninvestigation reveals to be identical with the kinds in question (e.g.\nÁsta 2016; Bach 2012; Mallon 2003, 2016), but they also need to\nfend off critics of applying the causal theory of reference in the\ncontext of reference to socially produced objects (e.g. Thomasson\n2003) as well as more general critiques of employing theories of\nreference as premises in arguments with philosophically significant\nconclusions (Mallon et al. 2009, Mallon 2007b). Still, if it can be\nmade to work, this strategy would make sense of constitutive\nconstructionist claims while respecting Boghossian’s idea (one\nthat is also central to constructionism) that these kinds are\nordinarily believed to be natural and independent of us. For this\nreason, this strategy has been suggested in the case of race, gender,\nand other human kinds (Haslanger 2003, 2005; Mallon 2003, 2016), and\nmore generally for scientific facts (Boyd 1992). \n\nOf course, there may well be other models of necessity available. For\nexample, it is sometimes suggested that a neo-Kantian interpretation\nof social constructionism is possible, an interpretation on which our\nsocio-linguistic activities could provide a transcendental basis for\nany knowledge of the world. Such an interpretation might allow certain\napparently radical constitutive claims, but the challenge would remain\nto reconcile the view with a naturalistic conception of ourselves,\nsomething such a proposal may fail to do (e.g. Boyd 1992, Rosen\n1994).\n2. Naturalism and Social Construction\n\nAny discussion of naturalistic approaches to social construction is\ncomplicated by the fact that “naturalism” itself has no\nvery widespread and uniform understanding (see\n Naturalism).\n Still, the prospect seems provocative, in part, because social\nconstruction has come to be associated with a critical anti-realist\nattitude towards science.\n\nAbove, we identified naturalism with a certain attitude towards\nscience, and for present purposes, we develop this idea by identifying\nthree naturalistic attitudes toward science that have been picked up\nby naturalists addressing social constructionist themes.\n\nEpistemological Fundamentalism\n\n\nAccommodating Science: Most contemporary naturalists take science\nto be an enormously successful enterprise, and so other knowledge\nclaims must either cohere with the findings of our best science or\nexplain those findings away.\nEmpiricism: Knowledge comes from careful study of the world, not a\npriori theorizing.\nCausal Modeling: The world is a set of entities related by natural\nlaws. In attempting to understand it, we produce causal models that\nidealize these relationships to varying degrees.\n\nMetaphysical Fundamentalism\n\n\nSupervenience: There are more and less fundamental entities, and\nthe less fundamental depend on the more fundamental. Naturalists\nunderstand (at least) these fundamental entities to be natural (as\nopposed to supernatural). Naturalists typically hold these fundamental\nentities to be physical entities.\nReduction: The regularities in which less fundamental entities\nparticipate are explained by natural laws governing the more\nfundamental entities upon which they supervene.\n\nHuman Naturalism:\n\n\nNonanomalism: Human beings and their products (e.g. culture or\nsociety) are natural things within the world that science explains.\nThey are not metaphysically anomalous.\nMethodological Naturalism: In studying human nature, human\nculture, and social life, the methods of the natural sciences are to\nbe employed.\n\n\n\nThese features characterize substantial threads of contemporary\nnaturalist thought—threads that arise repeatedly in discussions\nof constructionism. Still, it is worth noting that something may be\nnaturalistic in one sense but not another, and that the various\nthreads we have characterized may sometimes be at odds. For example,\nrational choice explanations in economics might count as naturalist in\nthat they attempt to reduce complex macro-level phenomena to simple,\nmicro-level phenomena at the level of individuals (exhibiting some\nvariety of metaphysical fundamentalism), and in the sense that they\nemploy idealized causal modeling to do so (as in 1c). But they seem\nnonnaturalist insofar as they offer a highly idealized account of\nhuman behavior, one that seems frequently contradicted by the\npsychological facts about human reasoning (see, e.g., Nisbett and Ross\n1980, Tversky and Kahneman, 1974) (against, perhaps, 1a and b, and\n3).\n\nWe now review various naturalistic approaches to social construction,\nconsidering different sorts of entities in turn.\n3. Naturalizing Social Construction\n\nAs we noted above, the production of facts by social agents poses no\nspecial problem for the naturalist where that production is understood\ncausally, though naturalists of many stripes may want to produce\ncausal models to show how the macro-level social phenomena of interest\nto many social theorists and social scientists are causally realized\ngiven what we know about, e.g. human nature or the causal structure of\nthe universe. In contrast, constitutive claims of construction seem\ndifficult to make sense of (except on an account of construction on\nwhich social activity involving a representation comes to produce and\ncausally sustain an object that is referred to by that\nrepresentation).\n\nIn recognition of this state of affairs, many naturalist approaches to\nconstructed phenomena have involved attempts to causally model matters\nof interest to constructionists in ways that engage more or less\ncompletely with existing scientific knowledge. By way of illustrating\nsuch naturalistic approaches, I’ll discuss the social\nconstruction of representations and of human nature in more\ndetail.\n3.1 The Social Construction of Representations\n\nIn talking about the construction of representations, we address the\nrange of mental states, group beliefs, scientific theories, and other\nrepresentations that express concepts or propositions. Such\nrepresentations are, among other things, the vehicles of our thought\nas well as the means by which we store, organize, and further our\nknowledge of the world, and we do this in virtue of their role as\nbearers of meaning. A number of commentators have noted that many\nprovocative constructionist claims are, in the first instance, claims\nthat some sort of representation is constructed (e.g. Andreasen 1998,\nHacking 1999, Haslanger 2012, Mallon 2004). Specifically, these are\nclaims that social causes produce or control the selection of some\nrepresentations with some meanings rather than others: for example,\nwhen Pickering (1984) writes of the construction of quarks or Laqueur\n(1990) suggests that sex is “made up,” they seem to be\nmost directly addressing the process by which the theories of\nthe quark or theories of sex are produced, viz. they are\nshowing how a theory with one meaning was selected or endorsed rather\nthan another theory or no theory at all. Where we limit the objects of\nconstructionist claims to representations (such as theories), the\nclaims cease to be particularly metaphysically provocative though\ndetailed constructionist accounts of how certain representations came\nto be selected may still teach us much about science (e.g. Latour and\nWoolgar 1979l Collins and Pinch 2012).\n\nIn light of this, philosophers may be wont to diagnose some\nconstructionist talk as a careless (or even an intentionally\nprovocative) error of talking about the object of construction\nusing a representation when one should be mentioning\nit (thereby expressing a view about the referent of the representation\nrather than the representation itself). When Claudius Ptolemy offered\na geo-centric theory of the universe in the second century CE, he\nthereby contributed to the social construction of something: namely,\na geocentric theory of the universe. We can talk about how\nand when that theory arose, and how it changed over time, but in doing\nso we are simply talking about a representation (or perhaps a lineage\nof related representations). It would be a mistake simply to slip from\nthose claims into saying that in constructing this theory he thereby\nconstructed a geocentric universe. Hence, charity in\ninterpretation alone may suggest attributing only the weaker claim to\na constructionist\n author.[10]\n\nStill some constructionists endorse a stronger claim as\nwell—that in constructing the theories, the facts described by\nthose theories are thereby made to be. But if we leave at least the\nglobal versions of these additional claims aside as impossible to\nreconcile with naturalism, the distinctive feature of social\nconstructionist explanations of representations is that they explain\nhow we came to have those representations not by reference to the\nfacts in the world they represent (as in realism), nor by reference to\nassociations among our sensations (as in some forms of empiricism),\nnor by reference to innate knowledge or concepts (as in rationalism),\nnor by reference to the conditions of our thought or experience (as in\ntranscendental arguments) but rather by reference to social and\ncultural background facts.\n\nNaturalist work on constructionist approaches to representations can\nbe grouped according to the debate the naturalist is addressing.\nNaturalists addressing the challenge posed by social construction to\nthe authority of science have attempted to respond to this challenge\nin a variety of ways that pit various versions of realism and\nempiricism against constructionism (e.g. Boyd 1992; see\n Social Dimensions of Scientific Knowledge).\n Because naturalists are typically committed to science as a central,\nif fallible, avenue of knowledge about the world (i.e. some variety of\nepistemic fundamentalism), naturalists will want to explain how this\ncan be if, as social constructionists about scientific representations\nnote, empirical observation is theory-laden and scientific theories\nare themselves subject to massive social influences.\n\nFor example, Jerry Fodor’s account of the modularity of\nperception (e.g. 1983, 1984, 1988) is, in part, a response to the\nimplication that perception is so theory-laden that it lacks the\nindependence required to constrain belief (see above for this\nimplication in such diverse thinkers as Kuhn 1962/1970 and Laqueur\n1990). Fodor suggests that sensory perception is modular by which he\nmeans (in part) “mandatory” and “informationally\nencapsulated” in its operations—i.e., it operates\nindependently of our will and of our background theories and\nexpectations. Fodor illustrates this effect by pointing to cases of\noptical illusions like the Muller-Lyer illusion (Fodor 1984). Here,\ntwo parallel line segments continue to appear to be different lengths\neven when one knows them be the same length, suggesting the\nindependence of the process that produces sensory phenomena from\none’s background theoretical beliefs. And while some\nphilosophers (e.g. Churchland 1988, cf. Fodor 1988) have resisted this\nconclusion, some social scientists of knowledge have attempted to\nrestate a constructionist view in ways that allow that Fodor may be\ncorrect. Barry Barnes, David Bloor and John Henry, for example, shift\nfrom emphasis on the determination of perceptual experience by culture\nto an emphasis on the underdetermination of belief by perceptual\nexperience (a view which leaves room for cultural determination of\nbelief) (1996, Ch. 1). More generally, epistemologists and\nphilosophers of science have taken up the project of accommodating\nsocial influence in the production of knowledge, and this project is\nwell underway in contemporary social epistemology and philosophy of\nscience (e.g. Boyd 1992; Kitcher 1993, 2001). These issues are taken\nup elsewhere\n (Social Epistemology)\n so we address them no further here. Instead, I focus on attempts by\nnaturalists to accommodate the cultural and personal processes at the\nheart of constructionist phenomena in naturalistic terms.\n\nIn contrast to naturalistic responses to the threat of scientific\nanti-realism, naturalistic responses to constructionist claims about\nrepresentations (including beliefs) understood as human traits have\nbeen far more sympathetic to constructionist approaches. Indeed, an\nemphasis on the cultural and social causes of belief is quite amenable\nto range of naturalists, and naturalistic approaches to these causes\nare well represented in constructionist precursors, including such\nluminaries as Karl Marx, Friedrich Nietzsche (see the section on the\ncritique of the descriptive component of MPS in\n Nietzsche’s Moral and Political Philosophy),\n and Karl Mannheim (1936). In contemporary naturalistic philosophy of\nscience and psychology, the naturalistic explanation of culturally\nproduced cognition is picked up by at least three distinct strands of\nwork taking up constructionist themes of culture. The first is\ncentered on the idea that culture can be understood by analogy with\npopulation genetics, and that cultural items might be understood to be\nmore or less successful based upon their success in spreading in a\npopulation. Various versions of this sentiment find expression in such\ndiverse thinkers as Robert Boyd and Peter Richerson (1985, 2005a,\n2005b), D.T. Campbell (1960), Luca Cavalli-Sforza and Marcus Feldman\n(1981), David Hull (1988), Jesse Prinz (2007, Ch. 6), Daniel Sperber\n(1996), and one version of it has a substantial popular following\n(Richard Dawkins’s (1976) widely read discussion of\n“memes”). While only some of these thinkers link the\nproject to the understanding of constructionist research themes, the\nproject in every case is to formally model cultural processes,\nunderstanding these complex processes as depending on simpler ones\n(See also\n Cultural Evolution.)\n \n\nThe second, overlapping strand of naturalistic inquiry also views\nculture as a system of representations upon which selection acts, but\nattempts to integrate this idea with the idea, common in evolutionary\ncognitive psychology, that the mind is comprised of a great many\ndomain-specific mental mechanisms, and uses these as the selective\nmechanisms that act as a primary mechanism of selection (so called\n“massive modularity”; see\n Evolutionary Psychology: Massive Modularity;\n cf. Carruthers 2006), and it is most firmly represented among\ncognitive anthropologists and psychologists like Scott Atran (1998),\nPascal Boyer (1994, 2001), Laurence Hirschfeld (1996), and Daniel\nSperber (1996). Such an approach represents naturalism in most (or\nperhaps all) of the above senses, and it is finding its way into the\nwork of naturalist philosophers of science and psychology (Machery and\nFaucher 2005, Mallon 2013, Nichols 2002, Prinz 2007, Sripada 2006,\nSterelny 2003).\n\nA third, philosophically underdeveloped strand naturalizes crucial\nelements of critical constructionist approaches by suggesting\nthe influence of sometimes implicit evaluations on judgments and\ntheoretical activities. For example, a growing body of empirical\nevidence on so-called “motivated cognition” (cf. Kunda\n1999) suggests mechanisms for (and some empirical validation of) the\ncritical social constructionist tradition of explaining the content of\naccepted theories in part by appeal to the interests of the theorists.\n\n3.2 Construction, Human Kinds and Human Traits\n\nAny sort of human trait could be an object of social construction, but\nmany of the most interesting and contested cases are ones in which\nclusters of traits—traits that comprise human kinds—are\npurported to co-occur and to correlate with mental states, including\ndispositions to think and behave in particular\n ways.[11]\n\n\nBecause discussion of kinds of persons with dispositions to think and\nbehave quickly gives rise to other questions about freedom of the will\nand social regulation, debates over constructionism about kinds are\ncentral to social and political debates regarding human\ncategorization, including debates over sex and gender, race, emotions,\nhetero- and homo-sexuality, mental illness, and disability. Since the\nconstructionist strategy explains a trait by appeal to highly\ncontingent factors (including culture), partisans of these debates\noften come inquire whether a trait or cluster of traits is culturally\nspecific, or can be found across cultures.\n3.2.1 The Conceptual Project\n\nThese issues can quickly come to generate more heat than light, and so\none role that philosophers in general, and naturalists in particular,\nhave played is to carefully analyze constructionist positions and\ntheir alternatives. For example, in reflecting on debates over\ncultural specificity or universality, a number of commentators have\nnoted that constructionist claims of cultural specificity often hinge\nnot on genuine empirical disagreement about what is or is not found\nthrough history and across cultures, but also on a strategy of\nindividuating the phenomena in question in ways that do or do\nnot involve contextual features that vary across cultures (Mallon and\nStich 2000; Boghossian 2006, 28; Pinker 2003, 38).\n\nPhilosophers have also distinguished claims of social construction\nfrom the possibility of cultural control (Mallon 2007a, Stein 1999),\ndisentangled claims of social construction from claims of\nvoluntariness and nonessentialism (Stein 1999), set out alternate\nforms of constructionism or anti-constructionism (Griffiths 1997,\nMallon 2007c, Andreasen 1998), disentangled questions regarding the\nneural basis of a human kind from the innate/constructed dichotomy\n(Murphy 2006, Ch. 7) and so forth.\n\nThis conceptual project is a philosophical project par\nexcellence, and it has contributed a great deal to clarifying\njust what conceptual and empirical issues are at stake in\nconstructionist work.\n3.2.2 Explaining the Development and Distribution of Human Traits\n\nNaturalist interpretations of constructionism have also taken up the\ndistinct, open-ended, empirical project of defending substantive\nclaims regarding the development and distribution of human traits via\nthe suggestions that human socio-linguistic behaviors shape human\ntraits (including behavior) via different avenues, both developmental\nand situational.\n\nOne “social role” family of theories emphasizes the way\nthat our socio-linguistic practices produce social roles that\nstructure and shape human life and behavior. Perhaps the most\ninfluential philosophical project in this area has been Ian\nHacking’s work on “making up people” (1986, 1992,\n1995a, 1995b, 1998). In a series of papers and books, Hacking argues\nthat the creation and promulgation of bureaucratic, technical, and\nmedical classifications like “child abuse,”\n“multiple personality disorder,” and “fugue”\ncreate “new ways to be a person” (1995b, p. 239). The idea\nis that the conception of a certain kind of person shapes both a\nwidespread social response (e.g. one that exculpates and perhaps\nencourages kind-typical behaviors), while at the same time, the\nconception shapes individual “performances” of the\nbehavior in question (by suggesting highly specific avenues of\nbehavior). On Hacking’s model, one he calls “the looping\neffect of human kinds,” the conception of the behavior may be\npart of an epistemic project of understanding a human kind that in\nturn gives rise to the clusters of traits that the theory represents\n(thereby providing epistemic support for the\n conception).[12]\n Much of Hacking’s own recent work has been aimed at providing\ndetailed historical and cultural evidence that suggests that looping\neffects really are a feature of (at least modern) human social life,\ne.g. for the American epidemic of multiple personality disorder that\nstarted in the 1980s (Hacking 1995) or the European epidemic of fugue\nin the late nineteenth century (Hacking 1998). Hacking makes further\nclaims about the “looping effect,” for example, that\nlooping effects mark “a cardinal difference between the\ntraditional natural and social sciences” because “the\ntargets of the natural sciences are stationary” while “the\ntargets of the social sciences are on the move” (1999, 108)\n),claims that themselves have spurred lively discussions over the\nnature of looping effects (e.g. Cooper 2004, Laimann forthcoming) and of their\nmechanisms in human groups (e.g. Mallon 2016, Kuorikoski and\nPöyhönen 2012).\n\nOthers have drawn on Hacking’s account to offer similar accounts\nof constructed kinds of person, including K. Anthony Appiah (1996) on\nracial identities, and Paul Griffiths (1997) on performed emotional\nsyndromes. Together with Hacking’s work, these accounts provide\npartial, causal interpretation of even quite radical claims about\nkinds of person. For example, Judith Butler has provocatively claimed\nthat the sex-differentiated behavior is a performance, writing,\n“That the gendered body is performative suggests that it has no\nontological status apart from the various acts which constitute its\nreality. … In other words, acts and gestures, articulated and\nenacted desires create the illusion of an interior and organizing\ngender core…” (1990, 136). Following on the work of\nHacking, Appiah, Griffiths, and others, we can naturalistically\n(re)interpret Butler’s claim as one that explains gender\ndifferences in actions, gestures, desires, and so on by reference to\nthe social role that a person occupies. Such a causal model of the way\nin which social roles might shape behavior is at least arguably\nnaturalistic in all of the above senses.\n\nThis “social role project” amounts to only one way of\ndeveloping constructionist ideas in the service of explaining the\ndevelopment of human kinds, traits, or behaviors. For example,\nconstructionist ideas find diverse manifestations in the theory of\nemotions (e.g. Armon-Jones 1986, Barrett 2017, Harré 1986, cf.\nGriffiths 1997 and Prinz 2004 for discussion). Because social\nconstructionism offers a general set of explanatory approaches,\nconstructionist approaches can be expected to reemerge in a variety of\nways in the attempt to explain a wide range of human phenomena. \n3.2.3 Formal Approaches to the Social Construction of Kinds \n\nStill a different way of developing naturalistic constructionist\naccounts of kinds involves using various formal methods to model such\nkinds. Among recent work in social ontology, Francesco Guala has\ndistinguished “rules-based” approaches to social\ninstitutions from “equilibrium-based” approaches (2016,\nxxv). The former attempts to understand social structure as emerging\nfrom the collective adoption of rules, while the latter sees it as\nemerging along with various solutions to coordination and cooperation\nproblems. As an example of the former, Searle (1995) influentially\nargues that we can understand social institutions as brought into\nbeing by collective endorsement of rules of the form:\n\nX counts as Y in C.\n\n\nHere, “X” is a specification of the individual or\ntype to which the status “Y” applies. And\n“C” specifies the context in which this imposition\noccurs. For instance, it might specify that tokens of a certain type\nproduced by the U.S. mint count as money in the United States. Such\nstatuses obtain in virtue of collective acceptance of one or more\nstatus functions. (See the entry on\n social ontology.)\n \n\nIn contrast, the latter family of approaches attempts to understand\nsocial structure by using the tools of economic and evolutionary game\ntheory to understand culture (e.g. Bicchieri 2006, 2016; Guala 2016;\nO’Connor 2017). Here, norms, behaviors, and social regularities\nare seen as produced and stabilized by the preferences of individual\nactors making decisions in a social context of other actors. For\nexample, Richard McElreath, Robert Boyd, and Peter Richerson (2003)\nhave argued that ethnic-group based “markers” (e.g. things\nlike styles of dress or other indicators of membership in an ethnic\ngroup) culturally evolved because they allowed actors to\ndifferentially interact with those who shared common norms, thus\nreaping the benefits of coordination and cooperation with greater\nefficiency.\n\nWhile rules-based approaches have been much discussed across a range\nof philosophical fields (including metaphysics, social philosophy,\nempirically-informed philosophy of mind), equilibrium-based approaches\nhave so far received comparatively little philosophical attention.\n3.2.4 Human Kinds and Normativity\n\nMany constructionist projects concerning human kinds are, or are\npursued as part of, normative projects. Thinkers interested in gender,\nrace, mental illness and disability, are often motivated not only by\nconcern with the metaphysics of these categories, but with questions\nof social morality and justice that connect with them. For instance,\nSally Haslanger’s work on the construction of gender and race\n(Haslanger 2012), or Elizabeth Barnes’s (2016) constructionist\naccount of disability seem to essentially incorporate normative\nconcepts. This connection, in turn, raises a number of further\nquestions about why they are connected, and how we ought to understand\ntheir relationship.\n\nOne answer to these questions is simply that, once we understand the\nconstructed nature of some category or phenomena, different normative\nconclusions will follow. For instance, some have emphasized that\nbecause constructionist explanations highlight the role of agents in\nthe production or the sustenance of phenomena, they make those agents\nsubject to moral evaluation (Kukla 2000; Mallon 2016,\nforthcoming).\n\nA different approach might be that normative considerations ought to\ndrive us towards certain metaphysical explanations. For instance, Esa\nDiaz-Leon (2015) has argued that constitutive constructionist\nexplanations are politically better than causal constructionist ones,\non the grounds that constitutive constructions are more tightly\nconnected to our socio-conceptual practices:\n\nrevealing the constitutive connections between instantiating a certain\ncategory and standing in a certain relation to certain social\npractices, opens a clear path for social change: just change those\nsocial practices, and social change will automatically follow. (2015,\n1145)\n\n\nIn contrast, Theresa Marques (2017) has argued that a focus on causal\nsocial construction is more relevant to projects of social justice.\nBut if we see constructionism as a kind of explanation, then this\ndebate can seem to put the cart before the horse. The correctness of\nan explanation is given by some facts in the world. Deciding what we\nwould like those facts to be, given our aims, seems to fail to\nappreciate the reality of our socio-conceptual practices and their\nconsequences.\n\nMore generally, while normative constructionist projects can be deeply\nengaged with our best scientific understanding, many naturalists will\nbe tempted to attempt to distinguish descriptive and normative\nelements in order to engage them separately.\n\nAt the same time, ongoing naturalist work on human cooperation and\ncoordination suggests the future possibility of more thoroughgoing\nnaturalist approaches to construction that integrate naturalistic\napproaches to norms and normativity (e.g., Bicchieri 2016, Sripada\n2006, and the entry on\n social norms)\n with accounts of the human kinds that our socio-conceptual behaviors\nstructure and shape.\n4. Conclusion\n\nThe metaphor of “social construction” has proven\nremarkably supple in labeling and prompting a range of research across\nthe social sciences and humanities, and the themes of personal and\ncultural causation taken up in this research are themselves of central\nconcern. While most philosophical effort has gone towards the\ninterpretation and refutation of provocative accounts of social\nconstruction arising especially out of studies in the history and\nsociology of science, social constructionist themes emerge across a\nhost of other contexts, offering philosophical naturalists a range of\nalternate ways of engaging constructionist themes. Philosophical\nnaturalists as well as working scientists have begun to take up this\nopportunity in ways that use the methods of philosophy and science to\nboth state and evaluate social constructionist hypotheses (though not\nalways under that label). Because of the powerful and central role\nculture plays in shaping human social environments, behaviors,\nidentities and development, there is ample room for continuing and\neven expanding the pursuit of social constructionist themes within a\nnaturalistic framework.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Andreasen, R. O., 1998. “A New Perspective on the Race\nDebate,” <em>British Journal of the Philosophy of Science</em>,\n49: 199–225.",
                "Appiah, K. A., 1996. “Race, Culture, Identity: Misunderstood\nConnections,” in <em>Color Conscious: The Political Morality of\nRace</em>, K. A. Appiah and A. Guttmann (eds.), Princeton, NJ:\nPrinceton University Press. pp. 30–105.",
                "Armon-Jones, C., 1986. “The Thesis of\nConstructionism,” in <em>The Social Construction of\nEmotion</em>, R. Harrè (ed.), Oxford: Blackwell. pp.\n32–55.",
                "Ásta, 2018. <em>Categories We Live By</em>, New York:\nOxford University Press.",
                "Atran, S., 1998. “Folk Biology and the Anthropology of\nScience: Cognitive Universals and Cultural Particulars,”\n<em>Behavioral and Brain Sciences</em>, 21: 547–609.",
                "Averill, J., 1980a. “A constructivist view of\nemotion,” in <em>Emotion: Theory, Research and Experience</em>\n(Vol. 1: Theories of Emotion), R. Plutchik and H. Kellerman (eds.),\nNew York: Academic Press. pp. 305–339.",
                "–––, 1980b. “Emotion and Anxiety:\nsociocultural, biological, and psychological determinants”, in\n<em>Explaining Emotions</em>, A. Rorty (ed.), Berkeley: University of\nCalifornia Press. pp. 37–72.",
                "Bach, T., 2012. “Gender Is a Natural Kind with a Historical\nEssence,” <em>Ethics</em>, 122(2): 231–272.",
                "Barnes, B., D. Bloor, et al., 1996. <em>Scientific knowledge: a\nsociological analysis</em>, London: Athlone.",
                "Barnes, E., 2016. <em>The Minority Body: a theory of\ndisability</em>, New York: Oxford University Press.",
                "Barrett, L. F., 2017. <em>How Emotions Are Made: The secret life\nof the brain</em>, New York: Houghton Mifflin.",
                "Bicchieri, C., 2016. <em>Norms in the wild : how to diagnose,\nmeasure, and change social norms</em>, New York: Oxford University\nPress.",
                "–––, 2006. <em>The Grammar of Society: the\nNature and Dynamics of Social Norms</em>, Cambridge: Cambridge\nUniversity Press.",
                "Boghossian, P., 2006. <em>Fear of Knowledge: Against Relativism\nand Constructivism</em>, New York: Oxford University Press.",
                "Boyd, R., 1992. “Constructivism, Realism, and Philosophical\nMethod,” in J. Earman (ed.), <em>Inference, Explanation, and\nOther Frustrations: Essays in the Philosophy of Science</em>, Berkeley\nand Los Angeles: University of California Press: 131–198.",
                "Boyd, R. and P. J. Richerson, 1985. <em>Culture and the\nevolutionary process</em>, Chicago: University of Chicago Press.",
                "–––, 2005. <em>The origin and evolution of\ncultures</em>, New York: Oxford University Press.",
                "Boyer, P., 1994. <em>The naturalness of religious ideas: a\ncognitive theory of religion</em>, Berkeley: University of California\nPress.",
                "–––, 2001. <em>Religion explained: the human\ninstincts that fashion gods, spirits and ancestors</em>, London:\nHeinemann.",
                "Bruner, J., L. Postman, et al., 1951. “Expectation and the\nPerception of Color,” <em>American Journal of Psychology</em>,\nLXIV: 216–227.",
                "Butler, J., 1990. <em>Gender Trouble</em>, New York:\nRoutledge.",
                "Campbell, D. T., 1960. “Blind Variation and Selective\nRetention in Creative Thought as in Other Knowledge Processes,”\n<em>Psychological Review</em>, 67: 380–400.",
                "Carruthers, P., 2006. <em>The architecture of the mind: massive\nmodularity and the flexibility of thought</em>, Oxford: Oxford\nUniversity Press.",
                "Cavalli-Sforza, L. L. and M. W. Feldman, 1981. <em>Cultural\ntransmission and evolution: a quantitative approach</em>, Princeton,\nN.J.: Princeton University Press.",
                "Churchland, P., 1988. “Perceptual Plasticity and Theoretical\nNeutrality: A Reply to Jerry Fodor,” <em>Philosophy of\nScience</em>, 55(2): 167–187.",
                "Cooper, Rachel, 2004. “Why Hacking is wrong about human\nkinds,” <em>British Journal for the Philosophy of Science</em>,\n55(1): 73–85.",
                "Diaz-Leon, E., 2015. “What Is Social Construction?”\n<em>European Journal of Philosophy</em>, 23(4): 1137–1152.",
                "Dawkins, R., 1976. <em>The selfish gene</em>, New York: Oxford\nUniversity Press.",
                "Feldman, M. and L. Cavalli-Sforza, 1989. “On the theory of\nevolution under genetic and cultural transmission with application to\nthe lactose absorption problem,” in <em>Mathematical\nEvolutionary Theory</em>, ed. M. Feldman. Princeton, NJ: Princeton\nUniversity Press. pp. 145–173.",
                "Fine, A., 1996. “Science Made Up: Constructivist Sociology\nof Scientific Knowledge,” in <em>The Disunity of Science:\nBoundaries, Contexts, and Power</em>, ed. P. Galison and D. Stump.\nStanford: Stanford University Press: 231–54.",
                "Fodor, J., 1984. “Observation Reconsidered,”\n<em>Philosophy of Science</em>, 51: 23–43.",
                "–––, 1988. “A Reply to Churchland’s\n‘Perceptual Plasticity and Theoretical Neutrality’,”\n<em>Philosophy of Science</em>, 55(2): 188–198.",
                "–––, 1983. <em>The Modularity of Mind</em>,\nCambridge, MA: MIT Press. A Bradford Book.",
                "Foucault, M., 1978. <em>The History of Sexuality, Vol. I: An\nIntroduction</em>, New York: Pantheon.",
                "Griffith, Aaron M., forthcoming. “Social Construction and\nGrounding,” <em>Philosophy and Phenomenological\nResearch</em>.",
                "Griffiths, P. E., 1997. <em>What Emotions Really Are</em>,\nChicago: The University of Chicago Press.",
                "Guala, Francesco, 2016. <em>Understanding Institutions: The\nScience and Philosophy of Living Together</em>, Princeton: Princeton\nUniversity Press.",
                "Hacking, I., 1986. “Making Up People,” in\n<em>Reconstructing Individualism: Autonomy, Individuality, and the\nSelf in Western Thought</em>, T. C. Heller, M. Sosna and D. E.\nWellbery. Stanford: Stanford University Press, 222–236.",
                "–––, 1992. “World Making by Kind Making:\nChild-Abuse for Example,” in <em>How Classification Works:\nNelson Goodman among the Social Sciences</em>, ed. M. Douglas and D.\nHull. Edinburgh: Edinburgh University Press: 180–238.",
                "–––, 1995a. <em>Rewriting the Soul: Multiple\nPersonality and the Sciences of Memory</em>, Princeton, NJ: Princeton\nUniversity Press.",
                "–––, 1995b. “The looping effects of human\nkinds,” in <em>Causal Cognition: A Multidisciplinary\nDebate</em>, ed. D. Sperber, D. Premack and A. J. Premack, New York:\nClarendon Press: 351–394.",
                "–––, 1998. <em>Mad Travelers: Reflections on the\nReality of Transient Mental Illnesses</em>, Charlottesville, VA:\nUniversity Press of Virginia.",
                "–––, 1999. <em>The Social Construction of\nWhat?</em> Cambridge, MA: Harvard University Press.",
                "Halperin, D. M., 1990. <em>One hundred years of homosexuality: and\nother essays on Greek love</em>, New York: Routledge.",
                "Harré, R., 1986. “An outline of the social\nconstructionist viewpoint,” in <em>The Social Construction of\nEmotions</em>, R. Harré, New York: Basil Blackwell:\n2–14.",
                "–––, 1986. “Emotion talk across times:\nAccidie and melancholy in the psychological context,” in <em>The\nSocial Construction of Emotions</em>, R. Harré. New York: Basil\nBlackwell: 220– 227.",
                "Haslanger, S., 1995. “Ontology and Social\nConstruction,” <em>Philosophical Topics</em>, 23(2):\n95–125.",
                "–––, 2003. “Social Construction: The\n‘Debunking’ Project,” in <em>Socializing\nMetaphysics: The Nature of Social Reality</em>, F. Schmitt. Lanham,\nMD: Rowman and Littlefield: 301–325.",
                "–––, 2005. “What Are We Talking About? The\nSemantics and Politics of Social Kinds,” <em>Hypatia</em>,\n20(4): 10–26.",
                "–––, 2012. <em>Resisting reality : social\nconstruction and social critique</em>, New York: Oxford University\nPress.",
                "Hirschfeld, L. A., 1996. <em>Race in the Making: Cognition,\nCulture, and the Child’s Construction of Human Kinds</em>,\nCambridge, MA: MIT Press.",
                "Hull, D. L., 1988. <em>Science as a process: an evolutionary\naccount of the social and conceptual development of science</em>,\nChicago: University of Chicago Press.",
                "Kitcher, P., 1993. <em>The advancement of science: science without\nlegend, objectivity without illusions</em>, New York: Oxford\nUniversity Press.",
                "–––, 2001. <em>Science, truth, and\ndemocracy</em>, Oxford, New York: Oxford University Press.",
                "Kripke, S. A., 1980. <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.",
                "Kuhn, T. S., 1962/1970. <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.",
                "Kukla, A., 2000. <em>Social constructivism and the philosophy of\nscience</em>, London: Routledge.",
                "Kunda, Z., 1999. <em>Social Cognition: Making Sense of\nPeople</em>, Cambridge, MA: MIT Press.",
                "Kuorikoski, J. and S. Pöyhönen, 2012. “Looping\nKinds and Social Mechanisms,” <em>Sociological Theory</em>,\n30(3): 187–205.",
                "Laimann, Jessica, forthcoming. “Capricious Kinds,”\n<em>British Journal for the Philosophy of Science</em>, first online\n14 March 2018. doi:10.1093/bjps/axy024",
                "Laqueur, T. W., 1990. <em>Making sex: body and gender from the\nGreeks to Freud</em>, Cambridge, MA: Harvard University Press.",
                "Laudan, L., 1981. “The pseudo-science of science?”\n<em>Philosophy of the Social Sciences</em>, 11: 173–98.",
                "Machery, E. (2014). “Social Ontology and the Objection from\nReification,” in M. Gallotti &amp; J. Michael (Eds.),\n<em>Perspectives on Social Ontology and Social Cognition</em>,\nDordrecht: Springer, pp. 87–102.",
                "Machery, E. and L. Faucher, 2005. “Social Construction and\nthe Concept of Race,” <em>Philosophy of Science</em>, 72:\n1208–1219.",
                "Mallon, R., 2003. “Social Construction, Social Roles and\nStability,” in <em>Socializing Metaphysics</em>, ed. F. Schmitt,\nLanham, MD: Rowman and Littlefield: 327–353.",
                "–––, 2004. “Passing, Traveling, and\nReality: Social Construction and the Metaphysics of Race,”\n<em>Noûs</em> 38(4): 644–673.",
                "–––, 2006. “‘Race’: Normative,\nNot Metaphysical or Semantic,” <em>Ethics</em>, 116(3):\n525–551.",
                "–––, 2007a. “A Field Guide to Social\nConstruction,” <em>Philosophy Compass</em>, 2(1):\n93–108.",
                "–––, 2007b. “Arguments from Reference and\nthe Worry About Dependence,” <em>Midwest Studies in\nPhilosophy</em>, XXXI: 160–183.",
                "–––, 2007c. “Human Categories Beyond\nNon-Essentialism,” <em>Journal of Political Philosophy</em>,\n15(2): 146–168.",
                "–––, 2016. <em>The Construction of Human\nKinds</em>, New York: Oxford University Press.",
                "–––, 2017. “Social Roles and\nReification,” <em>Routledge Handbook of Social Mind</em>, Julian\nKiverstein (ed.), London: Routledge, pp. 431–446.",
                "Mallon, R., E. Machery, S. Nichols, and S. P. Stich, 2009.\n“Against Arguments from Reference” <em>Philosophy and\nPhenomenological Research</em>, 79(2): 332–356.",
                "Mallon, R. and S. P. Stich, 2000. “The Odd Couple: The\nCompatibility of Social Construction and Evolutionary\nPsychology,” <em>Philosophy of Science</em>, 67:\n133–154.",
                "Mannheim, K., 1936. <em>Ideology and utopia; an introduction to\nthe sociology of knowledge</em>, New York: Harcourt, Brace.",
                "Marques, Teresa, 2017. “The relevance of causal social\nconstruction,” <em>Journal of Social Ontology</em>, 3(1):\n1–25.",
                "McElreath, R., Boyd, R., &amp; Richerson, P., 2003. “Shared\nnorms and the evolution of ethnic markers,” <em>Current\nAnthropology</em>, 44(1), 122–129.",
                "Mills, C., 1998. <em>Blackness Visible: Essays on Philosophy and\nRace</em>, Ithaca: Cornell University Press.",
                "Murphy, D., 2006. <em>Psychiatry in the scientific image</em>,\nCambridge, MA: MIT Press.",
                "Nelson, A., 1994. “How Could Scientific Facts be Socially\nConstructed?” <em>Studies in the History and Philosophy of\nScience</em>, 25(4): 535–547.",
                "Nichols, S., 2002. “On the Genealogy of Norms: A Case for\nthe Role of Emotion in Cultural Evolution,” <em>Philosophy of\nScience</em>, 69: 234–255.",
                "Nisbett, R. E. and L. Ross, 1980. <em>Human inference: Strategies\nand shortcomings of social judgment</em>, Englewood Cliffs, NJ:\nPrentice-Hall.",
                "O’Connor, Cailin, 2017. The cultural Red King effect,\n<em>The Journal of Mathematical Sociology</em>, 41:3, 155–171, DOI:\n10.1080/0022250X.2017.1335723",
                "Outlaw, L., 1990. “Toward a Critical Theory of\n‘Race’,” in <em>Anatomy of Racism</em>, ed. D. T.\nGoldberg, Minneapolis: University of Minnesota Press,\n58–82.",
                "Outlaw, L., 1995. “On W.E.B. Du Bois’s ‘The\nConservation of Races’,” in <em>Overcoming Racism and\nSexism</em>, L. A. Bell and D. Blumenfeld (eds.), Lanham, MD: Rowman\nand Littlefield: 79–102.",
                "Pickering, A., 1984. <em>Constructing quarks: a sociological\nhistory of particle physics</em>, Edinburgh: Edinburgh University\nPress.",
                "Pinker, S., 2002. <em>The Blank Slate: The Modern Denial of Human\nNature</em>, New York: Viking.",
                "Prinz, J. J., 2004. <em>Gut reactions : a perceptual theory of\nemotion</em>, New York ; Oxford, Oxford University Press.",
                "–––, 2007. <em>The emotional construction of\nmorals</em>, Oxford, New York: Oxford University Press.",
                "Putnam, H., 1975. “The meaning of\n‘meaning’,” <em>Mind, Language and Reality:\nPhilosophical Papers</em> (Volume 2), New York: Cambridge University\nPress, pp. 215–271.",
                "Quine, W. V. O., 1953. “Two Dogmas of Empiricism,” in\n<em>From a Logical Point of View</em>, Cambridge, MA: Harvard\nUniversity Press: 20–46.",
                "Rosen, G., 1994. “Objectivity and Modern Idealism: What is\nthe Question?” in <em>Philosophy in Mind: The Place of\nPhilosophy in the Study of Mind</em>, ed. M. Michael and J.\nO’Leary-Hawthorne, Boston: Kluwer Academic Publishers,\n277–319.",
                "Schaffer, J., 2017. “Social construction as grounding; or:\nfundamentality for feminists, a reply to Barnes and Mikkola,”\n<em>Philosophical Studies</em>, 174(10): 2449–2465.",
                "Scheff, T., 1984. <em>Being Mentally Ill: A Sociological\nTheory</em>, New York: Aldine Publishing Co.",
                "Searle, J., 1995. <em>The Construction of Social Reality</em>, New\nYork: The Free Press.",
                "Showalter, E., 1996. <em>Hystories: Hysterical Epidemics and\nModern Media</em>, New York: Columbia University Press.",
                "Sperber, D., 1996. <em>Explaining culture: a naturalistic\napproach</em>, Cambridge, MA: Blackwell.",
                "Sripada, C., 2006. “Punishment and the strategic structure\nof moral systems,” <em>Biology and Philosophy</em>, 20:\n767–789.",
                "Stein, E., 1999. <em>The mismeasure of desire: the science, theory\nand ethics of sexual orientation</em>, Oxford, New York: Oxford\nUniversity Press.",
                "Sterelny, K., 2003. <em>Thought in a hostile world: the evolution\nof human cognition</em>, Malden, MA: Blackwell.",
                "Sundstrom, R., 2002. “Race as a Human Kind,”\n<em>Philosophy and Social Criticism</em>, 28(1): 91–115.",
                "Taylor, P. C., 2013. <em>Race: a philosophical introduction</em>,\nMalden, MA: Polity Press.",
                "Thomasson, A., 2003. “Realism and Human Kinds,”\n<em>Philosophy and Phenomenological Research</em>, 67(3):\n580–609.",
                "Tversky, A. and D. Kahneman, 1974. “Judgment under\nuncertainty: Heuristics and biases,” <em>Science</em>, 185:\n1124–1131."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Andreasen, R. O., 1998. “A New Perspective on the Race\nDebate,” <em>British Journal of the Philosophy of Science</em>,\n49: 199–225.</li>\n<li>Appiah, K. A., 1996. “Race, Culture, Identity: Misunderstood\nConnections,” in <em>Color Conscious: The Political Morality of\nRace</em>, K. A. Appiah and A. Guttmann (eds.), Princeton, NJ:\nPrinceton University Press. pp. 30–105.</li>\n<li>Armon-Jones, C., 1986. “The Thesis of\nConstructionism,” in <em>The Social Construction of\nEmotion</em>, R. Harrè (ed.), Oxford: Blackwell. pp.\n32–55.</li>\n<li>Ásta, 2018. <em>Categories We Live By</em>, New York:\nOxford University Press.</li>\n<li>Atran, S., 1998. “Folk Biology and the Anthropology of\nScience: Cognitive Universals and Cultural Particulars,”\n<em>Behavioral and Brain Sciences</em>, 21: 547–609.</li>\n<li>Averill, J., 1980a. “A constructivist view of\nemotion,” in <em>Emotion: Theory, Research and Experience</em>\n(Vol. 1: Theories of Emotion), R. Plutchik and H. Kellerman (eds.),\nNew York: Academic Press. pp. 305–339.</li>\n<li>–––, 1980b. “Emotion and Anxiety:\nsociocultural, biological, and psychological determinants”, in\n<em>Explaining Emotions</em>, A. Rorty (ed.), Berkeley: University of\nCalifornia Press. pp. 37–72.</li>\n<li>Bach, T., 2012. “Gender Is a Natural Kind with a Historical\nEssence,” <em>Ethics</em>, 122(2): 231–272.</li>\n<li>Barnes, B., D. Bloor, et al., 1996. <em>Scientific knowledge: a\nsociological analysis</em>, London: Athlone.</li>\n<li>Barnes, E., 2016. <em>The Minority Body: a theory of\ndisability</em>, New York: Oxford University Press.</li>\n<li>Barrett, L. F., 2017. <em>How Emotions Are Made: The secret life\nof the brain</em>, New York: Houghton Mifflin.</li>\n<li>Bicchieri, C., 2016. <em>Norms in the wild : how to diagnose,\nmeasure, and change social norms</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2006. <em>The Grammar of Society: the\nNature and Dynamics of Social Norms</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Boghossian, P., 2006. <em>Fear of Knowledge: Against Relativism\nand Constructivism</em>, New York: Oxford University Press.</li>\n<li>Boyd, R., 1992. “Constructivism, Realism, and Philosophical\nMethod,” in J. Earman (ed.), <em>Inference, Explanation, and\nOther Frustrations: Essays in the Philosophy of Science</em>, Berkeley\nand Los Angeles: University of California Press: 131–198.</li>\n<li>Boyd, R. and P. J. Richerson, 1985. <em>Culture and the\nevolutionary process</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 2005. <em>The origin and evolution of\ncultures</em>, New York: Oxford University Press.</li>\n<li>Boyer, P., 1994. <em>The naturalness of religious ideas: a\ncognitive theory of religion</em>, Berkeley: University of California\nPress.</li>\n<li>–––, 2001. <em>Religion explained: the human\ninstincts that fashion gods, spirits and ancestors</em>, London:\nHeinemann.</li>\n<li>Bruner, J., L. Postman, et al., 1951. “Expectation and the\nPerception of Color,” <em>American Journal of Psychology</em>,\nLXIV: 216–227.</li>\n<li>Butler, J., 1990. <em>Gender Trouble</em>, New York:\nRoutledge.</li>\n<li>Campbell, D. T., 1960. “Blind Variation and Selective\nRetention in Creative Thought as in Other Knowledge Processes,”\n<em>Psychological Review</em>, 67: 380–400.</li>\n<li>Carruthers, P., 2006. <em>The architecture of the mind: massive\nmodularity and the flexibility of thought</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Cavalli-Sforza, L. L. and M. W. Feldman, 1981. <em>Cultural\ntransmission and evolution: a quantitative approach</em>, Princeton,\nN.J.: Princeton University Press.</li>\n<li>Churchland, P., 1988. “Perceptual Plasticity and Theoretical\nNeutrality: A Reply to Jerry Fodor,” <em>Philosophy of\nScience</em>, 55(2): 167–187.</li>\n<li>Cooper, Rachel, 2004. “Why Hacking is wrong about human\nkinds,” <em>British Journal for the Philosophy of Science</em>,\n55(1): 73–85.</li>\n<li>Diaz-Leon, E., 2015. “What Is Social Construction?”\n<em>European Journal of Philosophy</em>, 23(4): 1137–1152.</li>\n<li>Dawkins, R., 1976. <em>The selfish gene</em>, New York: Oxford\nUniversity Press.</li>\n<li>Feldman, M. and L. Cavalli-Sforza, 1989. “On the theory of\nevolution under genetic and cultural transmission with application to\nthe lactose absorption problem,” in <em>Mathematical\nEvolutionary Theory</em>, ed. M. Feldman. Princeton, NJ: Princeton\nUniversity Press. pp. 145–173.</li>\n<li>Fine, A., 1996. “Science Made Up: Constructivist Sociology\nof Scientific Knowledge,” in <em>The Disunity of Science:\nBoundaries, Contexts, and Power</em>, ed. P. Galison and D. Stump.\nStanford: Stanford University Press: 231–54.</li>\n<li>Fodor, J., 1984. “Observation Reconsidered,”\n<em>Philosophy of Science</em>, 51: 23–43.</li>\n<li>–––, 1988. “A Reply to Churchland’s\n‘Perceptual Plasticity and Theoretical Neutrality’,”\n<em>Philosophy of Science</em>, 55(2): 188–198.</li>\n<li>–––, 1983. <em>The Modularity of Mind</em>,\nCambridge, MA: MIT Press. A Bradford Book.</li>\n<li>Foucault, M., 1978. <em>The History of Sexuality, Vol. I: An\nIntroduction</em>, New York: Pantheon.</li>\n<li>Griffith, Aaron M., forthcoming. “Social Construction and\nGrounding,” <em>Philosophy and Phenomenological\nResearch</em>.</li>\n<li>Griffiths, P. E., 1997. <em>What Emotions Really Are</em>,\nChicago: The University of Chicago Press.</li>\n<li>Guala, Francesco, 2016. <em>Understanding Institutions: The\nScience and Philosophy of Living Together</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Hacking, I., 1986. “Making Up People,” in\n<em>Reconstructing Individualism: Autonomy, Individuality, and the\nSelf in Western Thought</em>, T. C. Heller, M. Sosna and D. E.\nWellbery. Stanford: Stanford University Press, 222–236.</li>\n<li>–––, 1992. “World Making by Kind Making:\nChild-Abuse for Example,” in <em>How Classification Works:\nNelson Goodman among the Social Sciences</em>, ed. M. Douglas and D.\nHull. Edinburgh: Edinburgh University Press: 180–238.</li>\n<li>–––, 1995a. <em>Rewriting the Soul: Multiple\nPersonality and the Sciences of Memory</em>, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>–––, 1995b. “The looping effects of human\nkinds,” in <em>Causal Cognition: A Multidisciplinary\nDebate</em>, ed. D. Sperber, D. Premack and A. J. Premack, New York:\nClarendon Press: 351–394.</li>\n<li>–––, 1998. <em>Mad Travelers: Reflections on the\nReality of Transient Mental Illnesses</em>, Charlottesville, VA:\nUniversity Press of Virginia.</li>\n<li>–––, 1999. <em>The Social Construction of\nWhat?</em> Cambridge, MA: Harvard University Press.</li>\n<li>Halperin, D. M., 1990. <em>One hundred years of homosexuality: and\nother essays on Greek love</em>, New York: Routledge.</li>\n<li>Harré, R., 1986. “An outline of the social\nconstructionist viewpoint,” in <em>The Social Construction of\nEmotions</em>, R. Harré, New York: Basil Blackwell:\n2–14.</li>\n<li>–––, 1986. “Emotion talk across times:\nAccidie and melancholy in the psychological context,” in <em>The\nSocial Construction of Emotions</em>, R. Harré. New York: Basil\nBlackwell: 220– 227.</li>\n<li>Haslanger, S., 1995. “Ontology and Social\nConstruction,” <em>Philosophical Topics</em>, 23(2):\n95–125.</li>\n<li>–––, 2003. “Social Construction: The\n‘Debunking’ Project,” in <em>Socializing\nMetaphysics: The Nature of Social Reality</em>, F. Schmitt. Lanham,\nMD: Rowman and Littlefield: 301–325.</li>\n<li>–––, 2005. “What Are We Talking About? The\nSemantics and Politics of Social Kinds,” <em>Hypatia</em>,\n20(4): 10–26.</li>\n<li>–––, 2012. <em>Resisting reality : social\nconstruction and social critique</em>, New York: Oxford University\nPress.</li>\n<li>Hirschfeld, L. A., 1996. <em>Race in the Making: Cognition,\nCulture, and the Child’s Construction of Human Kinds</em>,\nCambridge, MA: MIT Press.</li>\n<li>Hull, D. L., 1988. <em>Science as a process: an evolutionary\naccount of the social and conceptual development of science</em>,\nChicago: University of Chicago Press.</li>\n<li>Kitcher, P., 1993. <em>The advancement of science: science without\nlegend, objectivity without illusions</em>, New York: Oxford\nUniversity Press.</li>\n<li>–––, 2001. <em>Science, truth, and\ndemocracy</em>, Oxford, New York: Oxford University Press.</li>\n<li>Kripke, S. A., 1980. <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Kuhn, T. S., 1962/1970. <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.</li>\n<li>Kukla, A., 2000. <em>Social constructivism and the philosophy of\nscience</em>, London: Routledge.</li>\n<li>Kunda, Z., 1999. <em>Social Cognition: Making Sense of\nPeople</em>, Cambridge, MA: MIT Press.</li>\n<li>Kuorikoski, J. and S. Pöyhönen, 2012. “Looping\nKinds and Social Mechanisms,” <em>Sociological Theory</em>,\n30(3): 187–205.</li>\n<li>Laimann, Jessica, forthcoming. “Capricious Kinds,”\n<em>British Journal for the Philosophy of Science</em>, first online\n14 March 2018. doi:10.1093/bjps/axy024</li>\n<li>Laqueur, T. W., 1990. <em>Making sex: body and gender from the\nGreeks to Freud</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Laudan, L., 1981. “The pseudo-science of science?”\n<em>Philosophy of the Social Sciences</em>, 11: 173–98.</li>\n<li>Machery, E. (2014). “Social Ontology and the Objection from\nReification,” in M. Gallotti &amp; J. Michael (Eds.),\n<em>Perspectives on Social Ontology and Social Cognition</em>,\nDordrecht: Springer, pp. 87–102.</li>\n<li>Machery, E. and L. Faucher, 2005. “Social Construction and\nthe Concept of Race,” <em>Philosophy of Science</em>, 72:\n1208–1219.</li>\n<li>Mallon, R., 2003. “Social Construction, Social Roles and\nStability,” in <em>Socializing Metaphysics</em>, ed. F. Schmitt,\nLanham, MD: Rowman and Littlefield: 327–353.</li>\n<li>–––, 2004. “Passing, Traveling, and\nReality: Social Construction and the Metaphysics of Race,”\n<em>Noûs</em> 38(4): 644–673.</li>\n<li>–––, 2006. “‘Race’: Normative,\nNot Metaphysical or Semantic,” <em>Ethics</em>, 116(3):\n525–551.</li>\n<li>–––, 2007a. “A Field Guide to Social\nConstruction,” <em>Philosophy Compass</em>, 2(1):\n93–108.</li>\n<li>–––, 2007b. “Arguments from Reference and\nthe Worry About Dependence,” <em>Midwest Studies in\nPhilosophy</em>, XXXI: 160–183.</li>\n<li>–––, 2007c. “Human Categories Beyond\nNon-Essentialism,” <em>Journal of Political Philosophy</em>,\n15(2): 146–168.</li>\n<li>–––, 2016. <em>The Construction of Human\nKinds</em>, New York: Oxford University Press.</li>\n<li>–––, 2017. “Social Roles and\nReification,” <em>Routledge Handbook of Social Mind</em>, Julian\nKiverstein (ed.), London: Routledge, pp. 431–446.</li>\n<li>Mallon, R., E. Machery, S. Nichols, and S. P. Stich, 2009.\n“Against Arguments from Reference” <em>Philosophy and\nPhenomenological Research</em>, 79(2): 332–356.</li>\n<li>Mallon, R. and S. P. Stich, 2000. “The Odd Couple: The\nCompatibility of Social Construction and Evolutionary\nPsychology,” <em>Philosophy of Science</em>, 67:\n133–154.</li>\n<li>Mannheim, K., 1936. <em>Ideology and utopia; an introduction to\nthe sociology of knowledge</em>, New York: Harcourt, Brace.</li>\n<li>Marques, Teresa, 2017. “The relevance of causal social\nconstruction,” <em>Journal of Social Ontology</em>, 3(1):\n1–25.</li>\n<li>McElreath, R., Boyd, R., &amp; Richerson, P., 2003. “Shared\nnorms and the evolution of ethnic markers,” <em>Current\nAnthropology</em>, 44(1), 122–129.</li>\n<li>Mills, C., 1998. <em>Blackness Visible: Essays on Philosophy and\nRace</em>, Ithaca: Cornell University Press.</li>\n<li>Murphy, D., 2006. <em>Psychiatry in the scientific image</em>,\nCambridge, MA: MIT Press.</li>\n<li>Nelson, A., 1994. “How Could Scientific Facts be Socially\nConstructed?” <em>Studies in the History and Philosophy of\nScience</em>, 25(4): 535–547.</li>\n<li>Nichols, S., 2002. “On the Genealogy of Norms: A Case for\nthe Role of Emotion in Cultural Evolution,” <em>Philosophy of\nScience</em>, 69: 234–255.</li>\n<li>Nisbett, R. E. and L. Ross, 1980. <em>Human inference: Strategies\nand shortcomings of social judgment</em>, Englewood Cliffs, NJ:\nPrentice-Hall.</li>\n<li>O’Connor, Cailin, 2017. The cultural Red King effect,\n<em>The Journal of Mathematical Sociology</em>, 41:3, 155–171, DOI:\n10.1080/0022250X.2017.1335723</li>\n<li>Outlaw, L., 1990. “Toward a Critical Theory of\n‘Race’,” in <em>Anatomy of Racism</em>, ed. D. T.\nGoldberg, Minneapolis: University of Minnesota Press,\n58–82.</li>\n<li>Outlaw, L., 1995. “On W.E.B. Du Bois’s ‘The\nConservation of Races’,” in <em>Overcoming Racism and\nSexism</em>, L. A. Bell and D. Blumenfeld (eds.), Lanham, MD: Rowman\nand Littlefield: 79–102.</li>\n<li>Pickering, A., 1984. <em>Constructing quarks: a sociological\nhistory of particle physics</em>, Edinburgh: Edinburgh University\nPress.</li>\n<li>Pinker, S., 2002. <em>The Blank Slate: The Modern Denial of Human\nNature</em>, New York: Viking.</li>\n<li>Prinz, J. J., 2004. <em>Gut reactions : a perceptual theory of\nemotion</em>, New York ; Oxford, Oxford University Press.</li>\n<li>–––, 2007. <em>The emotional construction of\nmorals</em>, Oxford, New York: Oxford University Press.</li>\n<li>Putnam, H., 1975. “The meaning of\n‘meaning’,” <em>Mind, Language and Reality:\nPhilosophical Papers</em> (Volume 2), New York: Cambridge University\nPress, pp. 215–271.</li>\n<li>Quine, W. V. O., 1953. “Two Dogmas of Empiricism,” in\n<em>From a Logical Point of View</em>, Cambridge, MA: Harvard\nUniversity Press: 20–46.</li>\n<li>Rosen, G., 1994. “Objectivity and Modern Idealism: What is\nthe Question?” in <em>Philosophy in Mind: The Place of\nPhilosophy in the Study of Mind</em>, ed. M. Michael and J.\nO’Leary-Hawthorne, Boston: Kluwer Academic Publishers,\n277–319.</li>\n<li>Schaffer, J., 2017. “Social construction as grounding; or:\nfundamentality for feminists, a reply to Barnes and Mikkola,”\n<em>Philosophical Studies</em>, 174(10): 2449–2465.</li>\n<li>Scheff, T., 1984. <em>Being Mentally Ill: A Sociological\nTheory</em>, New York: Aldine Publishing Co.</li>\n<li>Searle, J., 1995. <em>The Construction of Social Reality</em>, New\nYork: The Free Press.</li>\n<li>Showalter, E., 1996. <em>Hystories: Hysterical Epidemics and\nModern Media</em>, New York: Columbia University Press.</li>\n<li>Sperber, D., 1996. <em>Explaining culture: a naturalistic\napproach</em>, Cambridge, MA: Blackwell.</li>\n<li>Sripada, C., 2006. “Punishment and the strategic structure\nof moral systems,” <em>Biology and Philosophy</em>, 20:\n767–789.</li>\n<li>Stein, E., 1999. <em>The mismeasure of desire: the science, theory\nand ethics of sexual orientation</em>, Oxford, New York: Oxford\nUniversity Press.</li>\n<li>Sterelny, K., 2003. <em>Thought in a hostile world: the evolution\nof human cognition</em>, Malden, MA: Blackwell.</li>\n<li>Sundstrom, R., 2002. “Race as a Human Kind,”\n<em>Philosophy and Social Criticism</em>, 28(1): 91–115.</li>\n<li>Taylor, P. C., 2013. <em>Race: a philosophical introduction</em>,\nMalden, MA: Polity Press.</li>\n<li>Thomasson, A., 2003. “Realism and Human Kinds,”\n<em>Philosophy and Phenomenological Research</em>, 67(3):\n580–609.</li>\n<li>Tversky, A. and D. Kahneman, 1974. “Judgment under\nuncertainty: Heuristics and biases,” <em>Science</em>, 185:\n1124–1131.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "epistemology: social",
            "evolution: cultural",
            "feminist philosophy, topics: perspectives on sex and gender",
            "innateness: and language",
            "naturalism",
            "Nietzsche, Friedrich: moral and political philosophy",
            "psychology: evolutionary",
            "race",
            "scientific knowledge: social dimensions of",
            "social norms",
            "social ontology"
        ],
        "entry_link": [
            {
                "../epistemology-social/": "epistemology: social"
            },
            {
                "../evolution-cultural/": "evolution: cultural"
            },
            {
                "../feminism-gender/": "feminist philosophy, topics: perspectives on sex and gender"
            },
            {
                "../innateness-language/": "innateness: and language"
            },
            {
                "../naturalism/": "naturalism"
            },
            {
                "../nietzsche-moral-political/": "Nietzsche, Friedrich: moral and political philosophy"
            },
            {
                "../evolutionary-psychology/": "psychology: evolutionary"
            },
            {
                "../race/": "race"
            },
            {
                "../scientific-knowledge-social/": "scientific knowledge: social dimensions of"
            },
            {
                "../social-norms/": "social norms"
            },
            {
                "../social-ontology/": "social ontology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-construction-naturalistic\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/social-construction-naturalistic/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=social-construction-naturalistic&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/social-construction-naturalistic/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-construction-naturalistic": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/social-construction-naturalistic/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=social-construction-naturalistic&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/social-construction-naturalistic/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Boghossian, Paul, \n  “<a href=\"http://paulboghossian.com/docs/Boghossian-Paul-socialconstruction1.pdf\" target=\"other\">What is Social Construction?</a>”,\n  undated, online manuscript."
        ],
        "listed_links": [
            {
                "http://paulboghossian.com/docs/Boghossian-Paul-socialconstruction1.pdf": "What is Social Construction?"
            }
        ]
    }
}