{
    "url": "social-norms",
    "title": "Social Norms",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Cristina Bicchieri\n<cb36@sas.upenn.edu>\nRyan Muldoon\n<ryan.muldoon@gmail.com>\nAlessandro Sontuoso\n<sontuoso@sas.upenn.edu>",
        "author_links": [
            {
                "mailto:cb36%40sas%2eupenn%2eedu": "cb36@sas.upenn.edu"
            },
            {
                "mailto:ryan%2emuldoon%40gmail%2ecom": "ryan.muldoon@gmail.com"
            },
            {
                "mailto:sontuoso%40sas%2eupenn%2eedu": "sontuoso@sas.upenn.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nCristina Bicchieri\n&lt;<a href=\"mailto:cb36%40sas%2eupenn%2eedu\"><em>cb36<abbr title=\" at \">@</abbr>sas<abbr title=\" dot \">.</abbr>upenn<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nRyan Muldoon\n&lt;<a href=\"mailto:ryan%2emuldoon%40gmail%2ecom\"><em>ryan<abbr title=\" dot \">.</abbr>muldoon<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\nAlessandro Sontuoso\n&lt;<a href=\"mailto:sontuoso%40sas%2eupenn%2eedu\"><em>sontuoso<abbr title=\" at \">@</abbr>sas<abbr title=\" dot \">.</abbr>upenn<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Mar 1, 2011",
        "substantive revision Tue Dec 19, 2023"
    ],
    "preamble": "\n\nSocial norms, the informal rules that govern behavior in groups and\nsocieties, have been extensively studied in the social sciences.\nAnthropologists have described how social norms function in different\ncultures (Geertz 1973), sociologists have focused on their social\nfunctions and how they motivate people to act (Durkheim 1895 [1982],\n1950 [1957]; Parsons 1937; Parsons & Shils 1951; James Coleman\n1990; Hechter & Opp 2001), and economists have explored how\nadherence to norms influences market behavior (Akerlof 1976; Young\n1998a). More recently, also legal scholars have touted social norms as\nefficient alternatives to legal rules, as they may internalize\nnegative externalities and provide signaling mechanisms at little or\nno cost (Ellickson 1991; Posner 2000).\n\nWith a few exceptions, the social science literature conceives of\nnorms as exogenous variables. Since norms are mainly seen as\nconstraining behavior, some of the key differences between moral,\nsocial, and legal norms—as well as differences between norms and\nconventions—have been blurred. Much attention has instead been\npaid to the conditions under which norms will be obeyed. Because of\nthat, the issue of sanctions has been paramount in the social\nscience literature. Moreover, since social norms are seen as central\nto the production of social order or social coordination, research on\nnorms has been focused on the functions they perform. Yet\neven if a norm may fulfill important social functions (such as welfare\nmaximization or the elimination of externalities), it cannot be\nexplained solely on the basis of the functions it performs. The\nsimplistic functionalist perspective has been rejected on several\naccounts; in fact, even though a given norm can be conceived as a\nmeans to achieve some goal, this is usually not the reason why it\nemerged in the first place (Elster 1989a, 1989b). Moreover, although a\nparticular norm may persist (as opposed to emerge) because of some\npositive social function it fulfills, there are many others that are\ninefficient and even widely unpopular.\n\nPhilosophers have taken a different approach to norms. In the\nliterature on norms and conventions, both social constructs are seen\nas the endogenous product of individuals’ interactions (Lewis\n1969; Ullmann-Margalit 1977; Vandershraaf 1995; Bicchieri 2006). Norms\nare represented as equilibria of games of strategy, and as such they\nare supported by a cluster of self-fulfilling expectations. Beliefs,\nexpectations, group knowledge and common knowledge have thus become\ncentral concepts in the development of a philosophical view of social\nnorms. Paying attention to the role played by expectations in\nsupporting social norms has helped differentiate between social norms,\nconventions, and descriptive norms: an important distinction often\noverlooked in the social science accounts, but crucial when we need to\ndiagnose the nature of a pattern of behavior in order to intervene on\nit.\n",
    "toc": [
        {
            "#GeneIssu": "1. General Issues"
        },
        {
            "#EarlTheoSoci": "2. Early Theories: Socialization"
        },
        {
            "#EarlTheoSociIden": "3. Early Theories: Social Identity"
        },
        {
            "#EarlTheoCostBeneMode": "4. Early Theories: Cost-Benefit Models"
        },
        {
            "#GameTheoAcco": "5. Game-Theoretic Accounts"
        },
        {
            "#ExpeEvid": "6. Experimental Evidence"
        },
        {
            "#EvolMode": "7. Evolutionary Models"
        },
        {
            "#Conc": "8. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. General Issues\n\nSocial norms, like many other social phenomena, are the unplanned\nresult of individuals’ interaction. It has been argued that\nsocial norms ought to be understood as a kind of grammar of social\ninteractions. Like a grammar, a system of norms specifies what is\nacceptable and what is not in a society or group. And, analogously to\na grammar, it is not the product of human design. This view suggests\nthat a study of the conditions under which norms come into\nbeing—as opposed to one stressing the functions fulfilled by\nsocial norms—is important to understand the differences between\nsocial norms and other types of injunction (such as hypothetical\nimperatives, moral codes, or legal rules).\n\nAnother important issue often blurred in the literature on norms is\nthe relationship between normative beliefs and behavior. Some authors\nidentify norms with observable, recurrent patterns of behavior. Others\nonly focus on normative beliefs and expectations. Such accounts find\nit difficult to explain the complexity and heterogeneity of\nnorm-driven behaviors, as they offer an explanation of conformity that\nis at best partial.\n\nSome popular accounts of why social norms exist are the following.\nNorms are efficient means to achieve social welfare (Arrow 1971;\nAkerlof 1976), prevent market failures (Jules Coleman 1989), or cut\nsocial costs (Thibaut & Kelley 1959; Homans 1961); norms are\neither Nash equilibria of coordination games or cooperative equilibria\nof prisoner’s dilemma-type games (Lewis 1969; Ullmann-Margalit\n1977), and as such they solve collective action problems.\n\nAkerlof’s (1976) analysis of the norms that regulate land\nsystems is a good example of the tenet that “norms are efficient\nmeans to achieve social welfare”. Since the worker is much\npoorer and less liquid than the landlord, it would be more natural for\nthe landlord rather than the tenant to bear the risk of crop failure.\nThis would be the case if the landlord kept all the crops, and paid\nthe worker a wage (i.e., the case of a “wage system”).\nSince the wage would not directly depend on the worker’s effort,\nthis system leaves no incentive to the worker for any effort beyond\nthe minimum necessary. In sharecropping, on the contrary, the worker\nis paid both for the effort and the time he puts in: a more efficient\narrangement in that it increases production.\n\nThibaut and Kelley’s (1959) view of norms as substitutes for\ninformal influence has a similar functionalist flavor. As an example,\nthey consider a repeated battle of the sexes game. In this game, some\nbargaining is necessary for each party to obtain, at least\noccasionally, the preferred outcome. The parties can engage in a\ncostly sequence of threats and promises, but it seems better to agree\nbeforehand on a rule of behavior, such as alternating between the\nrespectively preferred outcomes. Rules emerge because they reduce the\ncosts involved in face-to-face personal influence.\n\nLikewise, Ullman-Margalit (1977) uses game theory to show that norms\nsolve collective action problems, such as prisoner’s\ndilemma-type situations; in her own words, “… a norm\nsolving the problem inherent in a situation of this type is generated\nby it” (1977: 22). In a collective action problem, self-centered\nrational choices produce a Pareto-inefficient outcome.\nPareto-efficiency is restored by means of norms backed by sanctions.\nJames Coleman (1990), too, believes that norms emerge in situations in\nwhich there are externalities, that is, in all those cases in which an\nactivity produces negative (positive) effects on other parties,\nwithout this being reflected in direct compensation; thus the producer\nof the externality pays no cost for (reaps no benefit from) the\nunintended effect of their activity. A norm solves the problem by\nregulating the externality-producing activity, introducing a system of\nsanctions (rewards).\n\nAlso Brennan, Eriksson, Goodin, and Southwood (2013) argue that norms\nhave a function. Norms function to hold us accountable to each other\nfor adherence to the principles that they cover. This may or may not\ncreate effective coordination over any given principle, but they place\nus in positions where we may praise and blame people for their\nbehaviors and attitudes. This function of accountability, they argue,\ncan help create another role for norms, which is imbuing practices\nwith social meaning. This social meaning arises from the expectations\nthat we can place on each other for compliance, and the fact that\nthose behaviors can come to represent shared values, and even a sense\nof shared identity. This functional role of norms separates it from\nbare social practices or even common sets of desires, as those\nnon-normative behaviors don’t carry with them the social\naccountability that is inherent in norms. The distinctive feature of\nthe Brennan et al. account of norms is the centrality of\naccountability: this feature is what distinguishes norms from other\nsocial practices.\n\nAll of the above are examples of a functionalist explanation\nof norms. Functionalist accounts are sometimes criticized for offering\na post hoc justification for the existence of norms (i.e., the mere\npresence of a norm does not justify inferring that that norm exists to\naccomplish some social function). Indeed, a purely functionalist view\nmay not account for the fact that many social norms are harmful or\ninefficient (e.g., discriminatory norms against women and minorities),\nor are so rigid as to prevent the fine-tuning that would be necessary\nto accommodate new cases. There, one would expect increasing social\npressure to abandon such norms.\n\nAccording to some authors, we can explain the emergence of norms\nwithout any reference to the functions they eventually come to\nperform. Since the norms that are most interesting to study are those\nthat emerge naturally from individuals’ interactions (Schelling\n1978), an important theoretical task is to analyze the conditions\nunder which such norms come into being. Because norms often provide a\nsolution to the problem of maintaining social order—and social\norder requires cooperation—many studies on the emergence and\ndynamics of norms have focused on cooperation. Norms of honesty,\nloyalty, reciprocity and promise-keeping are indeed important to the\nsmooth functioning of social groups. One hypothesis is that such\ncooperative norms emerge in close-knit groups where people have\nongoing interactions with each other (Hardin 1982). Evolutionary game\ntheory provides a useful framework for investigating this hypothesis,\nsince repeated games serve as a simple approximation of life in a\nclose-knit group (Axelrod 1984, 1986; Skyrms 1996; Gintis 2000). In\nrepeated encounters people have an opportunity to learn from each\nother’s behavior, and to secure a pattern of reciprocity that\nminimizes the likelihood of misperception. In this regard, it has been\nargued that the cooperative norms likely to develop in close-knit\ngroups are simple ones (Alexander 2000, 2005, 2007); in fact, delayed\nand disproportionate punishment, as well as belated rewards, are often\ndifficult to understand and hence ineffective. Although norms\noriginate in small, close-knit groups, they often spread well beyond\nthe narrow boundaries of the original group. The challenge thus\nbecomes one of explaining the dynamics of the norm propagation from\nsmall groups to large populations.\n\nIf norms can thrive and spread, they can also die out. A poorly\nunderstood phenomenon is the sudden and unexpected change of\nwell-established patterns of behavior. For example, smoking in\npublic without asking for permission has become unacceptable, and only\na few years ago nobody would have worried about using gender-laden\nlanguage. One would expect inefficient norms (such as discriminatory\nnorms against women and minorities) to disappear more rapidly and with\ngreater frequency than more efficient norms. However, Bicchieri (2016)\npoints out that inefficiency is not a sufficient condition for a\nnorm’s demise. This can be seen by the study of crime and\ncorruption: corruption results in huge social costs, but such\ncosts—even when they take a society to the brink of\ncollapse—are not enough to generate an overhaul of the system.\nMuldoon (2018a, 2018b, 2020) has argued that social norms are a\nchallenging form of social regulation precisely because there is no\nsimple way to intentionally modify a social norm, as one can with a\nlaw or institutional rule. Social norms can even shape one's\nunderstanding of how much agency one has (Muldoon 2017).\n\nAn influential view of norms considers them as clusters of\nself-fulfilling expectations (Schelling 1960), in that some\nexpectations often result in behavior that reinforces them. A related\nview emphasizes the importance of conditional preferences in\nsupporting social norms (Sugden 2000). In particular, according to\nBicchieri’s (2006) account, preferences for conformity to social\nnorms are conditional on “empirical expectations” (i.e.,\nfirst-order beliefs that a certain behavior will be followed) as well\nas “normative expectations” (i.e., second-order beliefs\nthat a certain behavior ought to be followed). Thus, norm compliance\nresults from the joint presence of a conditional preference for\nconformity and the belief that other people will conform as well as\napprove of conformity.\n\nNote that characterizing norms simply as clusters of expectations\nmight be misleading; similarly, a norm cannot simply be identified\nwith a recurrent behavioral pattern either. If we were to adopt a\npurely behavioral account of norms there would be no way to\ndistinguish shared rules of fairness from, say, the collective morning\nhabit of tooth brushing. After all, such a practice does not depend on\nwhether one expects others to do the same; however, one would not even\ntry to ask for a salary proportionate to one’s education, if one\nexpected compensation to merely follow a seniority rule. In fact,\nthere are behavioral patterns that can only be explained by the\nexistence of norms, even if the behavior prescribed by the norm in\nquestion is currently unobserved. For example, in a study of the Ik\npeople, Turnbull (1972) reported that starved hunters-gatherers tried\nhard to avoid situations where their compliance with norms of\nreciprocity was expected. Thus they would go out of their way not to\nbe in the position of gift-taker, and hunted alone so that they would\nnot be forced to share their prey with anyone else. Much of the\nIk’s behavior could be explained as a way of eluding existing\nreciprocity norms.\n\nThere are many other instances of discrepancies between\nexpectations and behavior. For example, it is remarkable to\nobserve how often people expect others to act selfishly, even when\nthey are prepared to act altruistically themselves (Miller &\nRatner 1996). Studies have shown that people’s willingness to\ngive blood is not altered by monetary incentives, but typically those\nvery people who are willing to donate blood for free expect others to\ndonate blood only in the presence of monetary rewards. Similarly, all\nthe interviewed landlords answered positively to a question about\nwhether they would rent an apartment to an unmarried couple; however,\nthey estimated that only 50% of other landlords would accept unmarried\ncouples as tenants (Dawes 1972). Such cases of pluralistic ignorance\nare rather common; what is puzzling is that people may expect a given\nnorm to be upheld in the face of personal evidence to the contrary\n(Bicchieri & Fukui 1999). Furthermore, there is evidence\nsuggesting that people who donate blood, tip on a foreign trip, give\nmoney to beggars or return a lost wallet often attempt to downplay\ntheir altruistic behavior (by supplying selfish motives that seemingly\nalign their actions with a norm of self-interest; Wuthnow 1991, 77).\n\nIn a nutshell, norms refer to actions over which people have control,\nand are supported by shared expectations about what should or should\nnot be done in different types of social situations. However, norms\ncannot be identified just with observable behavior, nor can they\nmerely be equated with normative beliefs.\n\nThe varying degrees of correlation between normative beliefs and\nactions are an important factor researchers can use to differentiate\namong various types of norms. Such a correlation is also a key element\nto consider when critically assessing competing theories of norms: we\nbegin by surveying the socialized actor theory, the social identity\ntheory, and some early rational choice (cost-benefit) models of\nconformity.\n2. Early Theories: Socialization\n\nIn the theory of the socialized actor (Parsons 1951), individual\naction is intended as a choice among alternatives. Human action is\nunderstood within a utilitarian framework as instrumentally oriented\nand utility maximizing. Although a utilitarian setting does not\nnecessarily imply a view of human motives as essentially egoistic,\nthis is the preferred interpretation of utilitarianism adopted by\nTalcott Parsons and much contemporary sociology. In this context, it\nbecomes crucial to explain through which mechanisms social order and\nstability are attained in a society that would otherwise be in a\npermanent Hobbesian state of nature. In short, order and stability are\nessentially socially derived phenomena, brought about by a common\nvalue system—the “cement” of society. The\ncommon values of a society are embodied in norms that, when conformed\nto, guarantee the orderly functioning and reproduction of the social\nsystem. In the Parsonian framework norms are exogenous: how such a\ncommon value system is created and how it may change are issues left\nunexplored. The most important question is rather how norms get to be\nfollowed, and what prompts rational egoists to abide by them. The\nanswer given by the theory of the socialized actor is that people\nvoluntarily adhere to the shared value system, because it is\nintrojected to form a constitutive element of the personality itself\n(Parsons 1951).\n\nIn Parsons’ own words, a norm is\n\n\na verbal description of a concrete course of action, … ,\nregarded as desirable, combined with an injunction to make certain\nfuture actions conform to this course. (1937: 75)\n\n\nNorms play a crucial role in individual choice since—by shaping\nindividual needs and preferences—they serve as criteria for\nselecting among alternatives. Such criteria are shared by a given\ncommunity and embody a common value system. People may choose what\nthey prefer, but what they prefer in turn conforms to social\nexpectations: norms influence behavior because, through a process of\nsocialization that starts in infancy, they become part of one’s\nmotives for action. Conformity to standing norms is a stable, acquired\ndisposition that is independent of the consequences of conforming.\nSuch lasting dispositions are formed by long-term interactions with\nsignificant others (e.g., one’s parents): through repeated\nsocialization, individuals come to learn and internalize the common\nvalues embodied in the norms. Internalization is conceived as the\nprocess by which people develop a psychological need or motive to\nconform to a set of shared norms. When norms are internalized\nnorm-abiding behavior will be perceived as good or appropriate, and\npeople will typically feel guilt or shame at the prospect of behaving\nin a deviant way. If internalization is successful external sanctions\nwill play no role in eliciting conformity and, since individuals are\nmotivated to conform, it follows that normative beliefs and actions\nwill be consistent.\n\nAlthough Parsons’ analysis of social systems starts with a\ntheory of individual action, he views social actors as behaving\naccording to roles that define their identities and actions (through\nsocialization and internalization). The goal of individual action is\nto maximize satisfaction. The potential conflict between individual\ndesires and collective goals is resolved by characterizing the common\nvalue system as one that precedes and constrains the social actor. The\nprice of this solution is the disappearance of the individual actor as\nthe basic unit of analysis. Insofar as individuals are role-bearers,\nin Parsons’ theory it is social entities that act: entities that\nare completely detached from the individual actions that created them.\nThis consideration forms the basis for most of the criticisms raised\nagainst the theory of the socialized actor (Wrong 1961); such\ncriticisms are typically somewhat abstract as they are cast in the\nframework of the holism/individualism controversy.\n\nOn the other hand, one may easily verify whether empirical predictions\ndrawn from the socialized actor theory are supported by experimental\nevidence. For instance, the following predictions can be derived from\nthe theory and easily put to test. (a) Norms will change very slowly\nand only through intensive social interaction. (b) Normative beliefs\nare positively correlated to actions; whenever such beliefs change,\nbehavior will follow. (c) If a norm is successfully internalized,\nexpectations of others’ conformity will have no effect on an\nindividual’s choice to conform.\n\nSome of the above statements are not supported by empirical evidence\nfrom social psychology. For example, it has been shown that there may\nnot be a relation between people’s normative beliefs (or\nattitudes) and what people in fact do. In this respect, it should be\nnoted that experimental psychologists have generally focused on\n“attitudes”, that is, “evaluative feelings of pro or\ncon, favorable or unfavorable, with regard to particular\nobjects” (where the objects may be “concrete\nrepresentations of things or actions, or abstract concepts”;\nInsko & Schopler 1967: 361–362). As such, the concept of\nattitude is quite broad: it includes normative beliefs, as well as\npersonal opinions and preferences. That said, a series of field\nexperiments has provided evidence contrary to the assumption that\nattitudes and behaviors are closely related. LaPiere (1934) famously\nreported a sharp divergence between the widespread anti-Chinese\nattitudes in the United States and the tolerant behavior he witnessed.\nOther studies have pointed to inconsistencies between an\nindividual’s stated normative beliefs and her actions (Wicker\n1969): several reasons may account for such a discrepancy. For\nexample, studies of racial prejudice indicate that normative beliefs\nare more likely to determine behavior in long-lasting relationships,\nand least likely to determine behavior in the transient situations\ntypical of experimental studies (Harding et al. 1954 [1969]; Gaertner\n& Dovidio 1986). Warner and DeFleur (1969) reported that the main\nvariable affecting discriminatory behavior is one’s belief about\nwhat society (e.g., most other people) says one should do, as\nopposed to what one personally thinks one should do.\n\nIn brief, the social psychology literature provides mixed evidence in\nsupport of the claim that an individual’s normative beliefs and\nattitudes influence her actions. Such studies, however, do not\ncarefully discriminate among various types of normative beliefs. In\nparticular, one should distinguish between “personal normative\nbeliefs” (i.e., beliefs that a certain behavior ought to be\nfollowed) and “normative expectations” (i.e., what one\nbelieves others believe ought to be done, that is, a second-order\nbelief): it then becomes apparent that oftentimes only such\nsecond-order beliefs affect behavior.\n\nThe above constitutes an important criticism of the socialized actor\ntheory. According to Parsons, once a norm is internalized, members of\nsociety are motivated to conform by an internal sanctioning system;\ntherefore, one should observe a high correlation among all orders of\nnormative beliefs and behavior. However, experimental\nevidence does not support such a view (see also: Fishbein 1967;\nCialdini et al. 1991). Another indication that the socialized actor\ntheory lacks generality is the observation that norms can change\nrather quickly, and that new norms often emerge in a short period of\ntime among complete strangers (Mackie 1996). Long-term or close\ninteractions do not seem to be necessary for someone to acquire a\ngiven normative disposition, as is testified by the relative ease with\nwhich individuals learn new norms when they change status or group\n(e.g., from single to married, from student to faculty, etc.).\nMoreover, studies of emergent social and political groups have shown\nthat new norms may form rather rapidly, and that the demise of old\npatterns of behavior is often abrupt (Robinson 1932; Klassen et al.\n1989; Prentice & Miller 1993; Matza 1964). Given the\naforementioned limitations, Parsons’ theory might perhaps be\ntaken as an explanation of a particular conception of moral norms (in\nthe sense of internalized, unconditional imperatives), but it cannot\nbe viewed as a general theory of social norms.\n3. Early Theories: Social Identity\n\nIt has been argued that behavior is often closely embedded in a\nnetwork of personal relations, and that a theory of norms should not\nleave the specific social context out of consideration (Granovetter\n1985). Critics of the socialized actor theory have called for an\nalternative conception of norms that may account for the often weak\nrelation between beliefs and behavior (Deutscher 1973). This\nalternative approach takes social relations to be crucial in\nexplaining social action, and considers social identity as a key\nmotivating factor. (A strong support for this view among\nanthropologists is to be found in the work of Cancian 1975.)\n\nSince the notion of social identity is inextricably linked to that of\ngroup behavior, it is important to clarify the relation between these\nconcepts. By “social identity” we refer, in Tajfel’s\nown words, to\n\n\nthat part of an individual’s self-concept which derives from his\nknowledge of his membership of a social group (or groups) together\nwith the value and emotional significance attached to that membership.\n(Tajfel 1981: 255)\n\n\nNote that a crucial feature of social identity is that one’s\nidentification with the group is in some sense a conscious choice: one\nmay accidentally belong to a group, but we can meaningfully talk of\nsocial identification only when being a group-member becomes (at least\nin part) constitutive of who one is. According to Tajfel’s\ntheory, when we categorize ourselves as belonging to a particular\ngroup, the perception and definition of the self—as well as our\nmotives—change. That is, we start perceiving ourselves and our\nfellow group-members along impersonal, “typical”\ndimensions that characterize the group to which we belong. Such\ndimensions include specific roles and the beliefs (or actions) that\naccompany them.\n\nTurner et al.’s (1987) “self-categorization theory”\nprovides a more specific characterization of self-perception, or\nself-definition, as a system of cognitive self-schemata that filter\nand process information. Such schemata result in a representation of\nthe social situation that guides the choice of appropriate action.\nThis system has at least two major components, i.e., social and\npersonal identity. Social identity refers to self-descriptions related\nto group memberships. Personal identity refers to self-descriptions\nsuch as individual character traits, abilities, and tastes. Although\npersonal and social identities are mutually exclusive levels of\nself-definition, this distinction must be taken as an approximation\n(in that there are many interconnections between social and personal\nidentities). It is, however, important to recognize that we often\nperceive ourselves primarily in terms of our relevant group\nmemberships rather than as differentiated, unique individuals.\nSo—depending on the situation—personal or group identity\nwill become salient (Brewer 1991).\n\nFor example, when one makes interpersonal comparisons between oneself\nand other group-members, personal identity will become salient;\ninstead, group identity will become salient in situations in which\none’s group is compared to another group. Within a group, all\nthose factors that lead members to categorize themselves as different\n(or endowed with special characteristics and traits) will enhance\npersonal identity. If a group has to solve a common task, but each\nmember is to be rewarded according to her contribution, personal\nabilities are highlighted and individuals will perceive themselves as\nunique and different from the rest of the group. Conversely, if all\ngroup-members are to equally share the reward for a jointly performed\ntask, group identification will be enhanced. When the difference\nbetween self and fellow group-members is accentuated, we are likely to\nobserve selfish motives and self-favoritism against other\ngroup-members. When instead group identification is enhanced, in-group\nfavoritism against out-group members will be activated, as well as\nbehavior contrary to self-interest.\n\nAccording to Turner, social identity is basically a cognitive\nmechanism whose adaptive function is to make “group\nbehavior” possible. Whenever social identification becomes\nsalient, a cognitive mechanism of categorization is activated in such\na way to produce perceptual and behavioral changes. Such\ncategorization is called a stereotype, the prototypical description of\nwhat members of a given category are (or are believed to be). It is a\ncluster of physical, mental and psychological characteristics\nattributed to a “typical” member of a given group.\nStereotyping, like any other categorization process, activates scripts\nor schemata, and what we call group behavior is nothing but scripted\nbehavior. For example, the category “Asian student” is\nassociated with a cluster of behaviors, personality traits, and\nvalues: we often think of Asian students as respectful, diligent,\ndisciplined, and especially good with technical subjects. When\nthinking of an Asian student solely in terms of group membership, we\nattribute her the stereotypical characteristics associated with her\ngroup, so she becomes interchangeable with other group-members. When\nwe perceive people in terms of stereotypes, we depersonalize them and\nsee them as “typical” members of their group. The same\nprocess is at work when we perceive ourselves as group-members:\nself-stereotyping is a cognitive shift from “perceiving oneself\nas unique” to “perceiving oneself in terms of the\nattributes that characterize the group”. It is this cognitive\nshift that mediates group behavior.\n\nGroup behavior (as opposed to individual behavior) is characterized by\nfeatures such as a perceived similarity between group-members,\ncohesiveness, a tendency to cooperate to achieve common goals, shared\nattitudes or beliefs, and conformity to group norms. Once an\nindividual self-categorizes as member of a group, she will perceive\nherself as “depersonalized” and similar to other\ngroup-members in the relevant stereotypical dimensions. Insofar as\ngroup-members perceive their interests and goals as\nidentical—because such interests and goals are stereotypical\nattributes of the group—self-stereotyping will induce a\ngroup-member to embrace such interests and goals as her own. It is\nthus predicted that pro-social behavior will be enhanced by group\nmembership, and diluted when people act in an individualistic mode\n(Brewer 1979).\n\nThe groups with which we happen to identify ourselves may be very\nlarge (as in the case in which one self-defines as Muslim or French),\nor as small as a friends’ group. Some general group identities\nmay not involve specific norms, but there are many cases in which\ngroup identification and social norms are inextricably connected. In\nthat case group-members believe that certain patterns of behavior are\nunique to them, and use their distinctive norms to define\ngroup membership. Many close-knit groups (such as the Amish or the\nHasidic Jews) enforce norms of separation proscribing marriage with\noutsiders, as well as specific dress codes and a host of other\nprescriptive and proscriptive norms. There, once an individual\nperceives herself as a group-member, she will adhere to the group\nprototype and behave in accordance with it. Hogg and Turner (1987)\nhave called the process through which individuals come to conform to\ngroup norms “referent informational influence”.\n\nGroup-specific norms have (among other things) the twofold function of\nminimizing perceived differences among group-members and maximizing\ndifferences between the group and outsiders. Once formed, such norms\nbecome stable cognitive representations of appropriate behavior as a\ngroup-member. Social identity is built around group characteristics\nand behavioral standards, and hence any perceived lack of conformity\nto group norms is seen as a threat to the legitimacy of the group.\nSelf-categorization accentuates the similarities between one’s\nbehavior and that prescribed by the group norm, thus causing\nconformity as well as the disposition to control and punish\ntransgressors. In the social identity framework, group norms are\nobeyed because one identifies with the group, and conformity is\nmediated by self-categorization as an in-group member. A telling\nhistorical example of the relationship between norms and group\nmembership was the division of England into the two parties of the\nRoundheads and Cavaliers. Charles Mackay reports that\n\n\nin those days every species of vice and iniquity was thought by the\nPuritans to lurk in the long curly tresses of the monarchists, while\nthe latter imagined that their opponents were as destitute of wit, of\nwisdom, and of virtue, as they were of hair. A man’s locks were\na symbol of his creed, both in politics and religion. The more\nabundant the hair, the more scant the faith; and the balder the head,\nthe more sincere the piety. (Mackay 1841: 351)\n\n\nIt should be noted that in this framework social norms are defined by\ncollective—as opposed to personal—beliefs about\nappropriate behaviors (Homans 1950, 1961). To a certain extent, this\ncharacterization of social norms is closer to recent accounts than it\nis to Parsons’ socialized actor theory. On the other hand, a\ndistinct feature of the social identity framework is that\npeople’s motivation to conform comes from their desire to\nvalidate their identity as group-members. In short, there are several\nempirical predictions one can draw from such a framework. Given the\ntheory’s emphasis on identity as a motivating factor, conformity\nto a norm is not assumed to depend on an individual’s\ninternalization of that norm; in fact, a change in social status or\ngroup membership will bring about a change in the norms relevant to\nthe new status/group. Thus a new norm can be quickly adopted without\nmuch interaction, and beliefs about identity validation may change\nvery rapidly under the pressure of external circumstances. In this\ncase, not just norm compliance, but norms themselves are potentially\nunstable.\n\nThe experimental literature on social dilemmas has utilized the\n“priming of group identity” as a mechanism for promoting\ncooperative behavior (Dawes 1980; Brewer & Schneider 1990). The\ntypical hypothesis is that a pre-play, face-to-face communication\nstage may induce identification with the group, and thus promote\ncooperative behavior among group-members. In effect, rates of\ncooperation have been shown to be generally higher in social dilemma\nexperiments preceded by a pre-play communication stage (Dawes 1991).\nHowever, it has been argued that face-to-face communication may\nactually help group-members gather relevant information about one\nanother: such information may therefore induce subjects to trust each\nother’s promises and act cooperatively, regardless of any group\nidentification. In this respect, it has been shown that communication\nper se does not foster cooperation, unless subjects are allowed to\ntalk about relevant topics (Bicchieri & Lev-On 2007). This\nprovides support for the view that communication does not enhance\ncohesion but rather focuses subjects on relevant rules of behavior,\nwhich do not necessarily depend on group identification.\n\nCooperative outcomes can thus be explained without resorting to the\nconcept of social identity. A social identity explanation appears to\nbe more appropriate in the context of a relatively stable environment,\nwhere individuals have had time to make emotional investments (or at\nleast can expect repeated future interactions within the same group).\nIn artificial lab settings, where there are no expectations of future\ninteractions, the concept of social identity seems less persuasive as\nan explanation of the observed rates of cooperation. On the other\nhand, we note that social identity does appear to play a role in\nexperimental settings in which participants are divided into separate\ngroups. (In that case, it has been shown that participants categorize\nthe situation as “we versus them”, activating in-group\nloyalty and trust, and an equal degree of mistrust toward the\nout-group; Kramer & Brewer 1984; Bornstein & Ben-Yossef\n1994.)\n\nEven with stable environments and repeated interactions, however, a\ntheory of norm compliance in terms of social identity cannot avoid the\ndifficulty of making predictions when one is simultaneously committed\nto different identities. We may concurrently be workers, parents,\nspouses, friends, club members, and party affiliates, to name but a\nfew of the possible identities we embrace. For each of them there are\nrules that define what is appropriate, acceptable, or good behavior.\nIn the social identity framework, however, it is not clear what\nhappens when one is committed to different identities that may involve\nconflicting behaviors.\n\nFinally, there is ample evidence that people’s perceptions may\nchange very rapidly. Since in this framework norms are defined as\nshared perceptions about group beliefs, one would expect\nthat—whenever all members of a group happen to believe that\nothers have changed their beliefs about core membership\nrules—the very norms that define membership will change. The\nstudy of fashion, fads and speculative bubbles clearly shows that\nthere are some domains in which rapid (and possibly disruptive)\nchanges of collective expectations may occur; it is, however, much\nless clear what sort of norms are more likely to be subject to rapid\nchanges (think of dress codes rather than codes of honor). The social\nidentity view does not offer a theoretical framework for\ndifferentiating these cases: although some norms are indeed related to\ngroup membership, and thus compliance may be explained through\nidentity-validation mechanisms, there appear to be limits to the\nsocial identity explanation.\n4. Early Theories: Cost-Benefit Models\n\nEarly rational choice models of conformity maintained that, since\nnorms are upheld by sanctions, compliance is merely a\npayoff-maximizing strategy (Rommetveit 1955; Thibaut & Kelley\n1959): when others’ approval and disapproval act as external\nsanctions, we have a “cost-benefit model” of compliance\n(Axelrod 1986; James Coleman 1990). Rule-complying strategies are\nrationally chosen in order to avoid negative sanctions or to attract\npositive sanctions. This class of rational choice models defines norms\nbehaviorally, equating them with patterns of behavior (while\ndisregarding expectations or values). Such approach relies heavily on\nsanctions as a motivating factor. According to Axelrod (1986), for\nexample, if we observe individuals to follow a regular pattern of\nbehavior and to be punished if they act otherwise, then we have a\nnorm. Similarly, Coleman (1990) argues that a norm coincides with a\nset of sanctions that act to direct a given behavior.\n\nHowever, it has been shown that not all social norms involve sanctions\n(Diamond 1935; Hoebel 1954). Moreover, sanctioning works generally\nwell in small groups and in the context of repeated interactions,\nwhere the identity of participants is known and monitoring is\nrelatively easy. Still, even in such cases there may be a so-called\nsecond-order public goods problem. That is, imposing negative\nsanctions on transgressors is in everybody’s interest, but the\nindividual who observes a transgression faces a dilemma: she is to\ndecide whether or not to punish the transgressor, where punishing\ntypically involves costs; besides, there is no guarantee that other\nindividuals will also impose a penalty on transgressors when faced\nwith the same dilemma. An answer to this problem has been to assume\nthat there exist “meta-norms” that tell people to punish\ntransgressors of lower-level norms (Axelrod 1986). This solution,\nhowever, only shifts the problem one level up: upholding the meta-norm\nitself requires the existence of a higher-level sanctioning\nsystem.\n\nAnother problem with sanctions is the following: a sanction, to be\neffective, must be recognized as such. Coleman and Axelrod typically\ntake the repeated prisoner’s dilemma game as an example of the\nworking of sanctions. However, in a repeated prisoner’s dilemma\nthe same action (“C” or “D”) must serve as\nboth the sanctioning action and the target action. By simply looking\nat behavior, it is unclear whether the action is a function of a\nsanction or a sanction itself. It thus becomes difficult to determine\nthe presence of a norm, or to assess its effect on choice as distinct\nfrom the individual strategies of players.\n\nA further consideration weakens the credibility of the view that norms\nare upheld only because of external sanctions. Often we keep\nconforming to a norm even in situations of complete anonymity, where\nthe probability of being caught transgressing is almost zero. In this\ncase fear of sanctions cannot be a motivating force. As a consequence,\nit is often argued that cases of “spontaneous” compliance\nare the result of internalization (Scott 1971): people who have\ndeveloped an internal sanctioning system feel guilt and shame at\nbehaving in a deviant way. Yet, we have seen that the Parsonian view\nof internalization and socialization is inadequate, as it leads to\npredictions about compliance that often run counter to empirical\nevidence.\n\nIn particular, James Coleman (1990) has argued in favor of reducing\ninternalization to rational choice, insofar as it is in the interest\nof a group to get another group to internalize certain norms. In this\ncase internalization would still be the result of some form of\nsocialization. This theory faces some of the same objections raised\nagainst Parsons’ theory: norms that are passed on from parents\nto children, for example, should be extremely resistant to change;\nhence, one should expect a high degree of correlation between such\nnorms and behavior, especially in those cases where norms prescribe\nspecific kinds of actions. However, studies of normative beliefs about\nhonesty—which one typically acquires during childhood—show\nthat such beliefs are often uncorrelated with behavior (Freeman &\nAtaöv 1960).\n\nBicchieri (1990, 1997) has presented a third, alternative view about\ninternalization. This view of internalization is cognitive, and is\ngrounded on the assumption that social norms develop in small,\nclose-knit groups where ongoing interactions are the rule. Once an\nindividual has learned to behave in a way consistent with the\ngroup’s interests, she will tend to persist in the learned\nbehavior unless it becomes clear that—on average—the cost\nof upholding the norm significantly outweighs the benefits. Small\ngroups can typically monitor their members’ behavior and\nsuccessfully employ retaliation whenever free-riding is observed. In\nsuch groups an individual will learn, maybe at some personal cost, to\ncooperate; she will then uphold the cooperative norm as a\n“default rule” in any new encounter, unless it becomes\nevident that the cost of conformity has become excessive. The idea\nthat norms may be “sluggish” is in line with well-known\nresults from cognitive psychology showing that, once a norm has\nemerged in a group, it will tend to guide the behavior of its members\neven when they face a new situation (or are isolated from the original\ngroup; Sherif 1936).\n\nEmpirical evidence shows that norm-abiding behavior is not, as the\nearly rational choice models would have it, a matter of cost/benefit\ncalculation. Upholding a norm that has led one to fare reasonably well\nin the past is a way of economizing on the effort one would have to\nexert to devise a strategy when facing a new situation. This\nkind of “bounded rationality” approach explains why people\ntend to obey norms that sometimes put them at a disadvantage, as is\nthe case with norms of honesty. This does not mean, however, that\nexternal sanctions never play a role in compliance: for example, in\nthe initial development of a norm sanctions may indeed play an\nimportant role. Yet, once a norm is established, there are several\nmechanisms that may account for conformity.\n\nFinally, the view that one conforms only because of the\nthreat of negative sanctions does not distinguish norm-abiding\nbehavior from an obsession or an entrenched habit; nor does that view\ndistinguish social norms from hypothetical imperatives enforced by\nsanctions (such as the rule that prohibits naked sunbathing on public\nbeaches). In these cases avoidance of the sanctions associated with\ntransgressions constitutes a decisive reason to conform, independently\nof what others do. In fact, in the traditional rational choice\nperspective, the only expectations that matter are those about the\nsanctions that follow compliance or non-compliance. In those\nframeworks, beliefs about how other people will act—as opposed\nto what they expect us to do—are not a relevant explanatory\nvariable: however, this leads to predictions about norm compliance\nthat often run counter to empirical evidence.\n5. Game-Theoretic Accounts\n\nThe traditional rational choice model of compliance depicts the\nindividual as facing a decision problem in isolation: if there are\nsanctions for non-compliance, the individual will calculate the\nbenefit of transgression against the cost of norm compliance, and\neventually choose so as to maximize her expected utility. Individuals,\nhowever, seldom choose in isolation: they know the outcome of their\nchoice will depend on the actions and beliefs of other individuals.\nGame theory provides a formal framework for modeling strategic\ninteractions.\n\nThomas Schelling (1960), David Lewis (1969), Edna Ullmann-Margalit\n(1977), Robert Sugden (1986) and, more recently, Peyton Young (1993),\nCristina Bicchieri (1993), and Peter Vanderschraaf (1995) have\nproposed a game-theoretic account according to which a norm is broadly\ndefined as an equilibrium of a strategic interaction. In\nparticular, a Nash equilibrium is a combination of strategies (one for\neach individual), such that each individual’s strategy is a best\nreply to the others’ strategies. Since it is an equilibrium, a\nnorm is supported by self-fulfilling expectations in the sense that\nplayers’ beliefs are consistent, and thus the actions that\nfollow from players’ beliefs will validate those very beliefs.\nCharacterizing social norms as equilibria has the advantage of\nemphasizing the role that expectations play in upholding norms. On the\nother hand, this interpretation of social norms does not prima\nfacie explain why people prefer to conform if they expect others\nto conform.\n\nTake for example conventions such as putting the fork to the\nleft of the plate, adopting a dress code, or using a particular sign\nlanguage. In all these cases, my choice to follow a certain rule is\nconditional upon expecting most other people to follow it. Once my\nexpectation is met, I have every reason to adopt the rule in question.\nIn fact, if I do not use the sign language everybody else uses, I will\nnot be able to communicate. It is in my immediate interest to follow\nthe convention, since my main goal is to coordinate with other people.\nIn the case of conventions, there is a continuity between the\nindividual’s self-interest and the interests of the community\nthat supports the convention. This is the reason why David Lewis\nmodels conventions as equilibria of coordination games. Such\ngames have multiple equilibria, but once one of them has been\nestablished, players will have every incentive to keep playing it (as\nany deviation will be costly).\n\nTake instead a norm of cooperation. In this case, the expectation that\nalmost everyone abides by it may not be sufficient to induce\ncompliance. If everyone is expected to cooperate one may be tempted,\nif unmonitored, to behave in the opposite way. The point is that\nconforming to social norms, as opposed to conventions, is\nalmost never in the immediate interest of the individual. Often there\nis a discontinuity between the individual’s self-interest and\nthe interests of the community that supports the social norm.\n\nThe typical game in which following a norm would provide a better\nsolution (than the one attained by self-centered agents) is a\nmixed-motive game such as the prisoner’s dilemma or the\ntrust game. In such games the unique Nash equilibrium represents a\nsuboptimal outcome. It should be stressed that—whereas a\nconvention is one among several equilibria of a coordination\ngame—a social norm can never be an equilibrium of a mixed-motive\ngame. However, Bicchieri (2006) has argued that when a norm exists it\ntransforms the original mixed-motive game into a coordination\none. As an example, consider the following prisoner’s dilemma\ngame\n (Figure 1),\n where the payoffs are B=Best, S=Second, T=Third, and W=Worst. Clearly\nthe only Nash equilibrium is to defect (D), in which case both players\nget (T,T), a suboptimal outcome. Suppose, however, that society has\ndeveloped a norm of cooperation; that is, whenever a social dilemma\noccurs, it is commonly understood that the parties should privilege a\ncooperative attitude. Should, however, does not imply\n“will”, therefore the new game generated by the existence\nof the cooperative norm has two equilibria: either both players defect\nor both cooperate.\n\n\n\nFigure 1\n\n\nNote that, in the new coordination game (which was created by the\nexistence of the cooperative norm), the payoffs are quite different\nfrom those of the original prisoner’s dilemma. Thus there are\ntwo equilibria: if both players follow the cooperative norm they will\nplay an optimal equilibrium and get (B,B), whereas if they both choose\nto defect they will get the suboptimal outcome (S,S). Players’\npayoffs in the new coordination game differ from the original payoffs\nbecause their preferences and beliefs will reflect the existence of\nthe norm. More specifically, if a player knows that a cooperative norm\nexists and has the right kind of expectations, then she will have a\npreference to conform to the norm in a situation in which she can\nchoose to cooperate or to defect. In the new game generated by the\nnorm’s existence, choosing to defect when others cooperate is\nnot a good choice anymore (T,W). To understand why, let us look more\nclosely to the preferences and expectations that underlie the\nconditional choice to conform to a social norm.\n\nBicchieri (2006) defines the expectations that underlie norm\ncompliance, as follows:\n\n(a)\nEmpirical expectations: individuals believe that a\nsufficiently large subset of the relevant group/population conforms to\nthe norm in situations of type S and either\n(b)\nNormative expectations: individuals believe that a\nsufficiently large subset of the relevant group/population expects\nthem to conform to the norm in situations of\ntype S;\n\n\nor\n\n(b′)\nNormative expectations with sanctions: individuals\nbelieve that a sufficiently large subset of the relevant\ngroup/population expects them to conform to the norm in situations of\ntype S, prefers them to conform and may sanction\nbehavior.\n\n\nNote that universal compliance is not usually needed for a norm to\nexist. However, how much deviance is socially tolerable will depend on\nthe norm in question. Group norms and well-entrenched social norms\nwill typically be followed by almost all members of a group or\npopulation, whereas greater deviance is usually accepted when norms\nare new or they are not deemed to be socially important. Furthermore,\nas it is usually unclear how many people follow a norm, different\nindividuals may have different beliefs about the size of the group of\nfollowers, and may also have different thresholds for what\n“sufficiently large” means. What matters to conformity is\nthat an individual believes that her threshold has been reached or\nsurpassed. For a critical assessment of the above definition of\nnorm-driven preferences, see Hausman (2008).\n\nBrennan et al. (2013) also argue that norms of all kinds share in an\nessential structure. Norms are clusters of normative attitudes in a\ngroup, combined with the knowledge that such a cluster of attitudes\nexists. On their account, “A normative principle P is a\nnorm within a group G if and only if:\n\nA significant proportion of the members of G\nhave P-corresponding normative attitudes; and\nA significant proportion of the members of G\nknow that a significant proportion of the members of G have\nP-corresponding attitudes” (Brennan et al. 2013:\n29)\n\n\nOn this account, a “P-corresponding normative\nattitude” is understood to be a judgment, emotional state,\nexpectation, or other properly first personal normative belief that\nsupports the principle P (e.g., Alice thinking most people\nshould P would count as a normative attitude).\n Condition (i)\n is meant to reflect genuine first personal normative commitments,\nattitudes or beliefs.\n Condition (ii)\n is meant to capture those cases where individuals know that a large\npart of their group also shares in those attitudes. Putting conditions\n(i) and (ii) together offers a picture that the authors argue allows\nfor explanatory work to be done on a social-level normative concept\nwhile remaining grounded in individual-level attitudes.\n\nConsider again the new coordination game of\n Figure 1:\n for players to obey the norm, and thus choose C, it must be the case\nthat each expects the other to follow it. In the original\nprisoner’s dilemma, empirical beliefs would not be sufficient to\ninduce cooperative behavior. When a norm exists, however, players also\nbelieve that others believe they should obey the norm, and may even\npunish them if they do not. The combined force of empirical and\nnormative expectations makes norm conformity a compelling choice, be\nit because punishment may follow or just because one recognizes the\nlegitimacy of others’ expectations (Sugden 2000).\n\nIt is important to understand that conformity to a social norm is\nalways conditional on the expectations of what the relevant other/s\nwill do. We prefer to comply with the norm as we have certain\nexpectations. To make this point clear, think of the player who is\nfacing a typical one-shot prisoner’s dilemma with an unknown\nopponent. Suppose the player knows a norm of cooperation exists and is\ngenerally followed, but she is uncertain as to whether the opponent is\na norm-follower. In this case the player is facing the following\nsituation\n (Figure 2).\n\n\n\nFigure 2\n\n\nWith probability p, the opponent is a norm-following type,\nand with probability \\(1 - p\\) she is not. According to Bicchieri,\nconditional preferences imply that having a reason to be fair,\nreciprocate or cooperate in a given situation does not entail\nhaving any general motive or disposition to be fair, reciprocate or\ncooperate as such. Having conditional preferences means that one may\nfollow a norm in the presence of the relevant expectations, but\ndisregard it in its absence. Whether a norm is followed at a given\ntime depends on the actual proportion of followers, on the\nexpectations of conditional followers about such proportion, and on\nthe combination of individual thresholds.\n\nAs an example, consider a community that abides by strict norms of\nhonesty. A person who, upon entering the community, systematically\nviolates these norms will certainly be met with hostility, if not\nutterly excluded from the group. But suppose that a large group of\nthieves makes its way into this community. In due time, people would\ncease to expect honesty on the part of others, and would find no\nreason to be honest themselves in a world overtaken by crime. In this\ncase, probably norms of honesty would cease to exist, as the strength\nof a norm lies in its being followed by many of the members of the\nrelevant group (which in turn reinforces people’s expectations\nof conformity).\n\nWhat we have discussed is a “rational reconstruction” of\nwhat a social norm is. Such a reconstruction is meant to capture some\nessential features of norm-driven behavior; also, this analysis helps\nus distinguish social norms from other constructs such as conventions\nor personal norms. A limit of this account, however, is that it does\nnot indicate how such equilibria are attained or, in other terms, how\nexpectations become self-fulfilling.\n\nWhile neoclassical economics and game theory traditionally conceived\nof institutions as exogenous constraints, research in political\neconomy has generated new insights into the study of endogenous\ninstitutions. Specifically, endogenous norms have been shown to\nrestrict the individual’s action set and drive preferences over\naction profiles (Bowles 1998; Ostrom 2000). As a result, the\n“standard” economic framework positing exogenous (and in\nparticular self-centered) preferences has come under scrutiny. Widely\ndocumented deviations from the predictions of models with\nself-centered agents have informed alternative accounts of individual\nchoice (for one of the first models of “interdependent\npreferences”, see Stigler & Becker 1977).\n\nSome alternative accounts have helped reconcile insights about\nnorm-driven behavior with instrumental rationality (Elster 1989b).\nMoreover, they have contributed to informing the design of laboratory\nexperiments on non-standard preferences (for a survey of early\nexperiments, see Ledyard 1995; more recent experiments are reviewed by\nFehr & Schmidt 2006 and Kagel & Roth 2016). In turn,\nexperimental findings have inspired the formulation of a wide range of\nmodels aiming to rationalize the behavior observed in the lab (Camerer\n2003; Dhami 2016).\n\nIt has been argued that the upholding of social norms could simply be\nmodeled as the optimization of a utility function that includes the\nothers’ welfare as an argument. For instance, consider some of\nthe early “social preference” theories, such as Bolton and\nOckenfels’ (2000) or Fehr and Schmidt’s (1999) models of\ninequity aversion. These frameworks can explain a good wealth of\nevidence on preferences for equitable income distributions; they\ncannot however account for conditional preferences like those\nreflecting principles of reciprocity (e.g., I will keep the common\nbathroom clean, if I believe my roommates do the same). As noted\nabove, the approach to social norms taken by philosophically-inclined\nscholars has emphasized the importance of conditional preferences in\nsupporting social norms. In this connection, we note that some of the\nsocial preference theories do account for motivations conditional on\nempirical beliefs, whereby a player upholds a principle of\n“fair” behavior if she believes her co-players will uphold\nit too (Rabin 1993; Dufwenberg & Kirchsteiger 2004; Falk &\nFischbacher 2006; Charness & Rabin 2002). These theories\npresuppose that players are hardwired with a notion of fair or kind\nbehavior, as exogenously defined by the theorist. Since they\nimplicitly assume that all players have internalized a\nunique—exogenous—normative standpoint (as reflected in\nsome notion of fairness or kindness), these theories do not explicitly\nmodel normative expectations. Hence, players’\npreferences are assumed to be conditional solely on their empirical\nbeliefs; that is, preferences are conditional on whether others will\nbehave fairly (according to an exogenous principle) or not.\n\nThat said, we stress that social preferences should not be conflated\nwith social norms. Social preferences capture stable\ndispositions toward an exogenously defined principle of conduct\n(Binmore 2010). By contrast, social norms are better studied as\ngroup-specific solutions to strategic problems (Sugden 1986;\nBicchieri 1993; Young 1998b). Such solutions are brought about by a\nparticular class of preferences (“norm-driven\npreferences”), conditional on the relevant set of empirical\nbeliefs and normative expectations. In fact, we stress that\n“what constitutes fair or appropriate behavior” often\nvaries with cultural or situational factors (Henrich et al. 2001;\nCappelen et al. 2007; Ellingsen et al. 2012). Accounting for\nendogenous expectations is therefore key to a full understanding of\nsocial norms.\n\nRelatedly, Guala (2016) offers a game-theoretic account of\ninstitutions, arguing that institutions are sets of rules in\nequilibrium. Guala’s view incorporates insights from two\ncompeting accounts of institutions: institutions-as-rules (perhaps\nbest rendered by North 1990), and institutions-as-equilibria. From the\nfirst account, he captures the idea that institutions create rules\nthat help to guide our behaviors and reduce uncertainty. With rules in\nplace, we more or less know what to do, even in new situations. From\nthe second, he captures the idea that institutions are solutions to\ncoordination problems that arise from our normal interactions. The\ninstitutions give us reasons to follow them. The function of the\nrules, then, is to point to actions that promote coordination and\ncooperation. Because of the equilibrium nature of the rules, each\nindividual has an incentive to choose those actions, provided others\ndo too. Guala relies on a correlated equilibrium concept to unite the\nrules and equilibria accounts. On this picture, an institution is\nsimply a correlated equilibrium in a game, where other correlated\nequilibria would have been possible.\n\nThrasher (2018) offers a comparative-functional analysis of norms that\nbroadly aligns with the Bicchieri (2006) framework to help understand\nthe durability of “bad norms.” Abbink et al. (2017) use\npublic goods-like experiments to show how peer punishment can hold\ninefficient norms in place. This general framework can be helpful to\nunderstand why duels and honor killings can become stable (e.g.\nThrasher and Handfield 2018, Handfield and Thrasher 2019). This work\nexplores the signaling function of socially costly norms.\n\nAn alternative class of models explains norm compliance in terms of\nsocial image or self-image concerns (e.g., Andreoni and Bernheim 2009;\nBénabou and Tirole 2006, 2011). These models assume that one\ntries to signal (to others or to one’s future self) that one has\ngood “personal traits”, with such type-specific traits\nbeing imperfectly observed. More precisely, Bénabou and Tirole\n(2006) model the individual’s utility from contributing to a\npublic good as a function of (i) material payoffs, (ii) intrinsic\nrewards from behaving altruistically, and (iii) reputational returns;\nin particular, the authors assume that reputational returns depend on\nthe observers’ posterior expectations of the individual’s\ntype. Bénabou and Tirole then consider (a refinement of)\nsignaling equilibria, thereby allowing for multiple solutions to occur\nas a result of the interplay of individual motivations and of the\nlevel of observability of the actions. While models with reputational\nconcerns do not explicitly define normative expectations, they\ngenerally posit that players care about their reputation under the\nassumption that acting altruistically is good or appropriate. Looking\nahead, there is still work to do to fully formalize the interplay of\n(endogenous) normative expectations and empirical beliefs within a\ngeneral model that is applicable to any game setting. Such a\nmodel should probably build on the “psychological game\ntheory” framework (for discussion, see Battigalli and Dufwenberg\n2022, p. 857; see also Bicchieri and Sontuoso 2015).\n6. Experimental Evidence\n\nIn what follows we focus on lab experiments that identify social norms\nby explicitly measuring both empirical and normative expectations.\n\nXiao and Bicchieri (2010) designed an experiment to investigate the\nimpact on trust games of two potentially applicable—but\nconflicting—principles of conduct, namely, equality and\nreciprocity. Note that the former can be broadly defined as a\nrule that recommends minimizing payoff differences, whereas the latter\nrecommends taking a similar action as others (regardless of payoff\nconsiderations). The experimental design involved two trust game\nvariants: in the first one, players started with equal endowments; in\nthe second one, the investor was endowed with twice the money that the\ntrustee was given. In both cases, the investor could choose to\ntransfer a preset amount of money to the trustee or keep it all. Upon\nreceiving the money, the trustee could in turn keep it or else\ntransfer back some of it to the investor: in the equal endowment\ncondition (“baseline treatment”), both equality and\nreciprocity dictate that the trustee transfer some money back to the\ninvestor; by contrast, in the unequal endowment condition\n(“asymmetry treatment”), equality and reciprocity dictate\ndifferent actions as the trustee could guarantee payoff equality only\nby making a zero back-transfer. Xiao and Bicchieri elicited\nsubjects’ first- and second-order empirical beliefs\n(“how much do you think other participants in your role will\ntransfer to their counterpart?”; “what does your\ncounterpart think you will do?”) and normative\nexpectations (“how much do you think your counterpart\nbelieves you should transfer to her?”). The experimental results\nshow that a majority of trustees returned a positive amount whenever\nreciprocity would reduce payoff inequality (in the baseline\ntreatment); by contrast, a majority of trustees did not reciprocate\nthe investors’ transfer when doing so would increase payoff\ninequality (in the asymmetry treatment). Moreover, investors correctly\nbelieved that less money would be returned in the asymmetry treatment\nthan in the baseline treatment, and most trustees correctly estimated\ninvestors’ beliefs in both treatments. However, in the asymmetry\ntreatment empirical beliefs and normative expectations conflicted:\nthis highlights that, when there is ambiguity as to which principle of\nconduct is in place, each subject will support the rule of behavior\nthat favors her most.\n\nReuben and Riedl (2013) examine the enforcement of norms of\ncontribution to public goods in homogeneous and heterogeneous groups,\nsuch as groups whose members vary in their endowment, contribution\ncapacity, or marginal benefits. In particular, Reuben and Riedl are\ninterested in the normative appeal of two potentially applicable\nrules: the efficiency rule (prescribing maximal contributions\nby all) and the class of relative contribution rules\n(prescribing a contribution that is “fair” relative to the\ncontributions of others; e.g., equality and equity rules). Reuben and\nRiedl’s results show that, in the absence of punishment, no\npositive contribution norm emerged and all groups converged toward\nfree-riding. By contrast, with punishment, contributions were\nconsistent with the prescriptions of the efficiency rule in a\nsignificant subset of groups (irrespective of the type of group\nheterogeneity); in other groups, contributions were consistent with\nrelative contribution rules. These results suggest that even in\nheterogeneous groups individuals can successfully enforce a\ncontribution norm. Most notably, survey data involving third parties\nconfirmed well-defined yet conflicting normative views about the\naforementioned contribution rules; in other words, both efficiency and\nrelative contribution rules are normatively appealing, and are indeed\npotential candidates for emerging contribution norms in different\ngroups.\n\nBicchieri and Chavez (2010) designed an experiment to investigate norm\ncompliance in ultimatum games. Specifically, their experiment involved\na variant of the ultimatum game whereby the proposer could choose one\nof the following three options: ($5, $5), ($8, $2),\nor Coin (in which case one of the other two allocations would\nbe selected at random). This design allows for two plausible notions\nof fairness: as an equal outcome ($5, $5) or as a fair\nprocedure (Coin). The experimenters elicited subjects’\nnormative expectations about the actions they thought would be\nconsidered fair by most participants: proposers and responders showed\na remarkable degree of agreement in their notions of fairness, as most\nsubjects believed that a majority of participants deemed both ($5, $5)\nand Coin to be appropriate. Further, the experimenters had subjects\nplay three instances of the above ultimatum game under different\ninformation conditions. In the “full information”\ncondition, all participants knew that the Coin option was available,\nand that responders would know if their respective proposer had chosen\nCoin. In the “private information” condition, responders\ndid not know that Coin was available to proposers, and proposers were\naware of responders’ ignorance. In the “limited\ninformation” condition, participants knew that the Coin option\nwas available, but responders would not be able to distinguish whether\ntheir respective proposer had implemented one of the two allocations\ndirectly or had chosen Coin instead. The experimental results show\nthat when normative expectations supporting the Coin option were\neither absent (in the private condition) or could be defied\nwithout consequence (in the limited condition), the frequency\nof choice of ($5, $5) and ($8, $2), respectively, were considerably\nhigher than those of Coin. Moreover, the frequency of Coin choices was\nhighest in the public information condition, where such\noption was common knowledge and its outcome transparent: this shows\nthat there proposers followed the rule of behavior that favored them\nmost, and that such a rule was effectively a social norm. On the other\nhand, substantial norm evasion characterized proposers’ behavior\nin the limited information condition, where ($8, $2) was the most\nfrequent choice.\n\nIn a subsequent study, Chavez and Bicchieri (2013) measured empirical\nand normative expectations (as well as behavior) of third parties who\nwere given the opportunity to add to or deduct from the payoffs of\nsubjects who had participated in an ultimatum game. Third parties\ntended to reward subjects involved in equal allocations and to\ncompensate victims of unfair allocations (rather than punish unfair\nbehavior); on the other hand, third parties were willing to punish\nwhen compensation was not an available option. The experimental\nresults further show that third parties shared a notion of fairness\n(as indicated by their normative expectations), and that such notion\nwas sensitive to contextual differences.\n\nKrupka and Weber (2013) introduced an interesting procedure for\nidentifying social norms by means of pre-play coordination games. In\nbrief, using alternative (between-subjects) variants of the dictator\ngame, Krupka and Weber had participants assess the extent to which\ndifferent actions were collectively perceived as socially appropriate:\nsubjects providing these ratings effectively faced a coordination\ngame, as they were incentivized to match the modal response given by\nothers in the same situation (such a pre-play coordination game was\nintended to verify the presence of shared normative expectations).\nKrupka and Weber went on to use these elicited assessments to predict\nother subjects’ compliance with the relevant social norm in each\ndictator game variant (for another application of the same elicitation\nprocedure, see Gächter et al. 2013).\n\nSimilarly, Schram and Charness’ (2015) proposed a procedure for\ninducing a shared understanding of the relevant rule of behavior, in\nthe lab. In short, Schram and Charness had participants in dictator\ngames receive advice from a group of third parties. The information\nreceived simply revealed what a group of uninvolved subjects thought\ndictators ought to do: as such, the information received\ngenerated an exogenous variation in the dictators’ normative\nexpectations. Schram and Charness’ results show that choices are\nindeed affected by this information.\n\nBicchieri and Xiao (2009) designed an experiment to investigate what\nhappens when empirical and normative expectations conflict. To that\nend, participants in a dictator game were exposed to different pieces\nof information. Specifically, two groups of dictators were given some\n“descriptive information”; that is, they were told what\nother subjects had done in another session (i.e., one group\nwas told that previous participants had made for the most part a\ngenerous offer, while the other group was told that most participants\nhad made a selfish offer). Further, another two groups of dictators\nwere given some “normative information”; that is, they\nwere told what previous subjects said ought to be done (i.e.,\none group was told that most previous participants thought that one\nshould make a generous offer, while the other group was told that most\nparticipants thought that one should make a selfish offer). Other\ngroups were given both descriptive and normative information. The\nexperimental results show that—whenever such information did not\nconflict—both descriptive and normative messages had a\nsignificant influence on dictators’ own expectations and\nsubsequent choices. When messages conflicted in that one indicated\ngenerosity and the other indicated selfishness, only the descriptive\ninformation affected dictators’ behavior. This suggests that if\npeople recognize that others are breaching the norm, then they will no\nlonger feel compelled to follow the relevant rule of behavior\nthemselves.\n\nTo conclude, the studies surveyed here provide evidence of the role\nplayed by expectations in affecting behavior in a variety of social\ndilemmas. In this regard, we note that in contrast to the vast\nliterature on empirical beliefs, the number of lab studies that\ndirectly measure normative expectations is relatively limited: more\nresearch is clearly needed to investigate the interplay of empirical\nand normative information about applicable rules of behavior.\n7. Evolutionary Models\n\nThus far we have examined accounts of social norms that take for\ngranted that a particular norm exists in a population. However, for a\nfull account of social norms, we must answer two questions related to\nthe dynamics of norms. First, we must ask how a norm can emerge. Norms\nrequire a set of corresponding beliefs and expectations to support\nthem, and so there must be an account of how these arise. Second, we\nmust investigate the conditions under which a norm is stable under\nsome competitive pressure from other norms. Sometimes, multiple\ncandidate norms vie for dominance in a population. Even if one norm\nhas come to dominate the population, new norms can try to\n“invade” the existing norm’s population of\nadherents.\n\nLet us now turn to the question of norm emergence. Here we can see\nthree classes of models: first, a purely biological approach, second,\na more cognitive approach, and third, a structured interactions\napproach. The most famous of the biological approaches to norms seek\nto explain cooperative behavior. The simplest models are kin selection\nmodels (Hamilton 1964). These models seek to explain altruistic\ntendencies in animals by claiming that, as selection acts on genes,\nthose genes have an incentive to promote the reproductive success of\nother identical sets of genes found in other animals. This mode of\nexplanation can provide an account of why we see cooperative behaviors\nwithin families, but being gene-centered, cannot explain cooperative\nbehavior toward strangers (as strangers should not be sufficiently\ngenetically related to merit altruistic behavior).\n\nModels of “reciprocal altruism” (Trivers 1971, 1985), on\nthe other hand, tell us that cooperative behavior has no chance of\nevolving in random pairings, but will evolve in a social framework in\nwhich individuals can benefit from building reputations for being nice\nguys. Reciprocal altruism, however, does not require an evolutionary\nargument; a simple model of learning in ongoing close-knit groups will\ndo, and has the further advantage of explaining why certain types of\ncooperative behavior are more likely to emerge than others. All that\nmatters in these models is that agents can properly identify other\nagents, such that they can maintain a record of their past behavior.\nThis allows for the possibility of reputations: people who have the\nreputation of being cooperative will be treated cooperatively, and\nthose who have a reputation of being unfair will be treated\nunfairly.\n\nA variation on the idea of reciprocal altruism can be seen in Axelrod\n(1986). Axelrod presents a “norms game” in which agents\nprobabilistically choose to comply with the norm, or deviate from it,\nand then other agents can probabilistically choose to punish any\ndeviations at some cost to them. Agents can choose over time to be\nmore or less “bold”, which determines the rate at which\nthey attempt defections, and they can likewise choose to be more or\nless “vengeful”, which determines how often they punish.\nAxelrod noted that if the game is left like this, we find that the\nstable state is constant defection and no punishment. However, if we\nintroduce a meta-norm—one that punishes people who fail to\npunish defectors—then we arrive at a stable norm in which there\nis no boldness, but very high levels of vengefulness. It is under\nthese conditions that we find a norm emerge and remain stable.\nAxelrod’s model aims to illustrate that norms require\nmeta-norms. That is, failure to retaliate against a defection must be\nseen as equivalent to a defection itself. What Axelrod does not\nanalyze is whether there is some cost to being vigilant. Namely,\nwatching both defectors and non-punishers may have a cost that, though\nnominal, might encourage some to abandon vigilance once there has been\nno punishment for some time.\n\nBicchieri, Duffy and Tolle (2004) present an alternative model of norm\nemergence to explain how a norm of impersonal trust/reciprocity can\nemerge and survive in a heterogeneous population. This model does not\nrely on a meta-norm of punishment; instead, it is purely driven by\nrepeated interactions of conditional strategies. In their model,\nagents play anywhere from 1 to 30 rounds of a trust game for 1,000\niterations, relying on the 4 unconditional strategies, and the 16\nconditional strategies that are standard for the trust game. After\neach round, agents update their strategies based on the replicator\ndynamic. As the number of rounds grows, a norm of impersonal\ntrust/reciprocity emerges in the population. Most interestingly,\nhowever, the norm is not associated with a single strategy, but it is\nsupported by several strategies behaving in similar ways. This model\nsuggests that Trivers’ basic model works well in normal social\ncontexts, but we can further enrich the story by allowing a social\nnorm to supervene on several behavioral strategies.\n\nMuldoon et al. (2012) explore a simpler approach to norm emergence that\nrelies on individual reasoners weighing their individual interests\nagainst their social sensitivity. This is done across a number of\nmodel variants based on a simple standing ovation. A striking finding\nof their “symmetric” model is that norm emergence is\nfairly rare, but can also be distinguished from merely common\nbehaviors. A more cognitively demanding approach was taken by Muldoon,\nLisciandra and Hartmann (2012), in which bayesian reasoners can learn\nto “discover” norms that were not present, and have no\nparticular value. This can happen when agents think there might be a\nsocial rule, and then over-interpret social evidence. These models\ncombine to suggest that we should expect many arbitrary norms, rather\nthan a functionalist argument for the presence of norms.\n\nThe third prominent model of norm emergence comes from Brian Skyrms\n(1996, 2004) and Jason Alexander (2007). In this approach, two\ndifferent features are emphasized: relatively simple cognitive\nprocesses and structured interactions. Both have explored a variety of\ngames (such as the prisoner’s dilemma, the stag hunt, divide the\ndollar, and the ultimatum game) as exemplars of situations that offer\nthe possibility of the emergence of a moral norm. Though Skyrms\noccasionally uses the replicator dynamic, both tend to emphasize\nsimpler mechanisms in an agent-based learning context. In particular,\nlearning rules like “imitate the best” or best response\nare used, as they are much less cognitively demanding. Alexander\njustifies the use of these simpler rules on the grounds that, rather\nthan fully rational agents, we are cognitively limited beings who rely\non fairly simple heuristics for our decision-making. Rules like\nimitation are extremely simple to follow. Best response requires a bit\nmore cognitive sophistication, but is still simpler than a fully\nBayesian model with unlimited memory and computational power. These\nsimpler learning rules provide the same function as the replicator\ndynamic: in between rounds of play, agents rely on their learning rule\nto decide what strategy to employ. Note that both Skyrms and Alexander\ntend to treat norms as single strategies.\n\nThe largest contribution of this strain of modeling comes not from the\nassumption of boundedly rational agents, but rather the careful\ninvestigation of the effects of particular social structures on the\nequilibrium outcomes of various games. Much of the previous literature\non evolutionary games has focused on the assumptions of infinite\npopulations of agents playing games against randomly-assigned\npartners. Skyrms and Alexander both rightly emphasize the importance\nof structured interaction. As it is difficult to uncover and represent\nreal-world network structures, both tend to rely on examining\ndifferent classes of networks that have different properties, and from\nthere investigate the robustness of particular norms against these\nalternative network structures. Alexander (2007) in particular has\ndone a very careful study of the different classical network\nstructures, where he examines lattices, small world networks, bounded\ndegree networks, and dynamic networks for each game and learning rule\nhe considers. A final feature of Skyrms and Alexander’s work is\na refinement on this structural approach: they separate out two\ndifferent kinds of networks. First, there is the interaction\nnetwork, which represents the set of agents that any given agent\ncan actively play a game with. Second is the update network,\nwhich is the set of agents that an agent can “see” when\napplying her learning rule. The interaction network is thus\none’s immediate community, whereas the update network is all\nthat the agent can see. To see why this is useful, we can imagine a\ncase not too different from how we live, in which there is a fairly\nlimited set of other people we may interact with, but thanks to a\nplethora of media options, we can see much more widely how others\nmight act. This kind of situation can only be represented by clearly\nseparating the two networks.\n\nThus, what makes the theory of norm emergence of Skyrms and Alexander\nso interesting is its enriching the set of idealizations that one must\nmake in building a model. The addition of structured interaction and\nstructured updates to a model of norm emergence can help make clear\nhow certain kinds of norms tend to emerge in certain kinds of\nsituation and not others, which is difficult or impossible to capture\nin random interaction models.\n\nNow that we have examined norm emergence, we must examine what happens\nwhen a population is exposed to more than one social norm. In this\ninstance, social norms must compete with each other for adherents.\nThis lends itself to investigations about the competitive dynamics of\nnorms over long time horizons. In particular, we can investigate the\nfeatures of norms and of their environments, such as the populations\nthemselves, which help facilitate one norm becoming dominant over\nothers, or becoming prone to elimination by its competitors. An\nevolutionary model provides a description of the conditions under\nwhich social norms may spread. One may think of several environments\nto start with. A population can be represented as entirely\nhomogeneous, in the sense that everybody is adopting the same type of\nbehavior, or heterogeneous to various degrees. In the former case, it\nis important to know whether the commonly adopted behavior is stable\nagainst mutations. The relevant concept here is that of an\nevolutionarily stable strategy (ESS; Maynard Smith &\nPrice 1973; Taylor & Jonker 1978): when a population of\nindividuals adopts such a strategy, it cannot be successfully invaded\nby isolated mutants, since the mutants will be at a disadvantage with\nrespect to reproductive success. An evolutionarily stable strategy is\na refinement of the Nash equilibrium in game theory. Unlike standard\nNash equilibria, evolutionarily stable strategies must either be\nstrict equilibria, or have an advantage when playing against\nmutant strategies. Since strict equilibria are always superior to any\nunilateral deviations, and the second condition requires that the ESS\nhave an advantage in playing against mutants, the strategy will remain\nresistant to any mutant invasion. This is a difficult criterion to\nmeet, however. For example, a classic Tit-For-Tat strategy in the\nprisoner’s dilemma is not an ESS. Many strategies perform\nequally well against it, including the very simple “Always\nCooperate” strategy, let alone Tit-For-Two-Tats, and any number\nof variations. Tit-For-Tat is merely an evolutionarily neutral\nstrategy relative to these others. If we only consider strategies that\nare defection-oriented, then Tit-For-Tat is an ESS, since it will do\nbetter against itself, and no worse than defection strategies when\npaired with them.\n\nA more interesting case, and one relevant to a study of the\nreproduction of norms of cooperation, is that of a population in which\nseveral competing strategies are present at any given time. What we\nwant to know is whether the strategy frequencies that exist at a time\nare stable, or if there is a tendency for one strategy to become\ndominant over time. If we continue to rely on the ESS solution\nconcept, we see a classic example in the hawk-dove game. If we assume\nthat there is no uncorrelated asymmetry between the players, then the\nmixed Nash equilibrium is the ESS. If we further assume that there is\nno structure to how agents interact with each other, this can be\ninterpreted in two ways: either each player randomizes her strategy in\neach round of play, or we have a stable polymorphism in the\npopulation, in which the proportion of each strategy in the population\ncorresponds to the frequency with which each strategy would be played\nin a randomizing approach. So, in those cases where we can assume that\nplayers randomly encounter each other, whenever there is a mixed\nsolution ESS we can expect to find polymorphic populations.\n\nIf we wish to avoid the interpretive challenge of a mixed solution\nESS, there is an alternative analytic solution concept that we can\nemploy: the evolutionarily stable state. An evolutionarily stable\nstate is a distribution of (one or more) strategies that is robust\nagainst perturbations, whether they are exogenous shocks or mutant\ninvasions, provided the perturbations are not overly large.\nEvolutionarily stable states are solutions to a replicator dynamic.\nSince evolutionarily stable states are naturally able to describe\npolymorphic or monomorphic populations, there is no difficulty with\nintroducing population-oriented interpretations of mixed strategies.\nThis is particularly important when random matching does not occur, as\nunder those conditions, the mixed strategy can no longer be thought of\nas a description of population polymorphism.\n\nNow that we have seen the prominent approaches to both norm emergence\nand norm stability, we can turn to some general interpretive\nconsiderations of evolutionary models. An evolutionary approach is\nbased on the principle that strategies with higher current payoffs\nwill be retained, while strategies that lead to failure will be\nabandoned. The success of a strategy is measured by its relative\nfrequency in the population at any given time. This is most easily\nseen in a game theoretic framework. A game is repeated a finite number\nof times with randomly selected opponents. After each round of the\ngame, the actual payoffs and strategies of the players become public\nknowledge; on the basis of this information, each player adjusts her\nstrategy for the next round. The payoff to an individual player\ndepends on her choice as well as on the choices of the other players\nin the game, and players are rational in the sense that they are\npayoff-maximizers. In an evolutionary model, however, players learn\nand adapt in a non-Bayesian way, that is, they do not condition on\npast experience using Bayes’ Rule. In this sense, they are not\ntypical rational learners (Nachbar 1990; Binmore & Samuelson\n1992).\n\nIn an evolutionary approach behavior is adaptive, so that a strategy\nthat did work well in the past is retained, and one that fared poorly\nwill be changed. This can be interpreted in two ways: either the\nevolution of strategies is the consequence of adaptation by individual\nagents, or the evolution of strategies is understood as the\ndifferential reproduction of agents based on their success rates in\ntheir interactions. The former interpretation assumes short timescales\nfor interactions: many iterations of the game over time thus represent\nno more than a few decades in time in total. The latter interpretation\nassumes rather longer timescales: each instance of strategy adjustment\nrepresents a new generation of agents coming into the population, with\nthe old generation dying simultaneously. Let us consider the\nramifications of each interpretation in turn.\n\nIn the first interpretation, we have agents who employ learning rules\nthat are less than fully rational, as defined by what a Bayesian agent\nwould have, both in terms of computational ability and memory. As\nsuch, these rules tend to be classified as adaptive strategies: they\nare reacting to a more limited set of data, with lower cognitive\nresources than what a fully rational learner would possess. However,\nthere are many different adaptive mechanisms we may attribute to the\nplayers. One realistic adaptive mechanism is learning by trial and\nerror; another plausible mechanism is imitation: those who do best are\nobserved by others who subsequently emulate their behavior (Hardin\n1982). Reinforcement learning is another class of adaptive behavior,\nin which agents tweak their probabilities of choosing one strategy\nover another based on the payoffs they just received.\n\nIn the second interpretation, agents themselves do not learn, but\nrather the strategies grow or shrink in the population according to\nthe reproductive advantages that they bestow upon the agents that\nadhere to them. This interpretation requires very long timescales, as\nit requires many generations of agents before equilibrium is reached.\nThe typical dynamics that are considered in such circumstances come\nfrom biology. A standard approach is something like the replicator\ndynamic. Norms grow or shrink in proportion to both how many agents\nadhere to them at a given time, and their relative payoffs. More\nsuccessful strategies gain adherents at the expense of less-successful\nones. This evolutionary process assumes a constant-sized (or infinite)\npopulation over time. This interpretation of an evolutionary dynamic,\nwhich requires long timescales, raises the question of whether norms\nthemselves evolve slowly. Norms can rapidly collapse in a very short\namount of time. This phenomenon could not be represented within a\nmodel whose interpretation is generational in nature. It remains an\nopen question, however, as to whether such timescales can be\nappropriate for examining the emergence of certain kinds of norms.\nWhile it is known that many norms can quickly come into being, it is\nnot clear if this is true of all norms.\n\nAnother challenge in using evolutionary models to study social norms\nis that there is a potential problem of representation. In\nevolutionary models, there is no rigorous way to represent innovation\nor novelty. Whether we look at an agent-based simulation approach, or\na straightforward game-theoretic approach, the strategy set open to\nthe players, as well as their payoffs, must be defined in advance. But\nmany social norms rely on innovations, whether they are technological\nor social. Wearing mini-skirts was not an option until they were\ninvented. Marxist attitudes were largely not possible until Marx. The\nage at which one gets married and how many children one has are highly\nlinked to availability of and education about birth control\ntechnologies. While much of the study of norms has focused on more\ngeneric concepts such as fairness, trust, or cooperation, the full\nbreadth of social norms covers many of these more specific norms that\nrequire some account of social innovation.\n\nThis representational challenge has broad implications. Even when we\ncan analytically identify evolutionarily stable states in a particular\ngame, which is suggestive of norms that will be converged upon, we now\nhave a problem of claiming that this norm has prospects for long-term\nstability. Events like the publication of the Kinsey report can\ndramatically shift seemingly stable norms quite rapidly. As the\nunderlying game changes in the representation, our previous results no\nlonger apply. In the face of this representational problem, we can\neither attempt to develop some metric of the robustness of a given\nnorm in the space of similar games, or more carefully scope the claims\nthat we can make about the social norms that we study with this\nmethodology.\n\nAlthough some questions of interpretation and challenges of\nrepresentation exist, an important advantage of the evolutionary\napproach is that it does not require sophisticated strategic reasoning\nin circumstances, such as large-group interactions, in which it would\nbe unrealistic to assume it. People are very unlikely to engage in\nfull Bayesian calculations in making decisions about norm adherence.\nAgents often rely on cognitive shortcuts to determine when norms ought\nto be in effect given a certain context, and whether or not they\nshould adhere to them. Evolutionary models that employ adaptive\nlearning strategies capture these kinds of cognitive constraints, and\nallow the theorist to explore how these constraints influence the\nemergence and stability of norms.\n8. Conclusion\n\nThe study of social norms can help us understand a wide variety of\nseemingly puzzling behaviors. According to some accounts, a social\nnorm results from conditional preferences for conforming to a relevant\nbehavioral rule. Such preferences are conditional on two different\nkinds of beliefs: empirical and normative expectations.\n\nThis and other accounts of social norms still leave much to be\ninvestigated. Explaining how normative expectations come to exist\nremains an open question. Another open question to consider is how one\ncould intervene to change socially harmful norms. While there have\nbeen initial investigations into these questions (Bicchieri 2016,\nMuldoon 2018a, 2018b), there is much more work to be done. One\nfrontier in this area is in deploying behavioral tools such as nudging\nfor fostering norm changes (Bicchieri 2022, 2023).\n\nFinally, we stress that different contextual factors (such as\nthe framing and characteristics of the strategic problem, the role one\nis assigned, the social category with which one identifies, as well as\nhistorical and chance events) often come to be associated with\ndifferent notions of “appropriate behavior”. Accounting\nfor endogenous expectations is therefore key to a full understanding\nof norm-driven behavior. More research—both theoretical and\nexperimental—is needed to further illuminate the impact of\nexpectations on strategic decisions.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abbink, K., Gangadharan, L., Handfield, T., <em>et al., 2017,\n</em> Peer punishment promotes enforcement of bad social norms.\n<em>Nat Commun</em> 8(609). doi:10.1038/s41467-017-00731-0",
                "Akerlof, George A., 1976, “The Economics of Caste and of the\nRat Race and Other Woeful Tales”, <em>Quarterly Journal of\nEconomics</em>, 90(4): 599–617. doi:10.2307/1885324",
                "Alexander, Jason McKenzie, 2000, “Evolutionary Explanations\nof Distributive Justice”, <em>Philosophy of Science</em>, 67(3):\n490–516. doi:10.1086/392792",
                "–––, 2005, “The Evolutionary Foundations\nof Human Altruism”, <em>Analyse &amp; Kritik</em>, 27(1):\n106–113.\n [<a href=\"http://www.analyse-und-kritik.net/Dateien/56c1d48f66a49_ak_mckenzie_2005.pdf\" target=\"other\">Alexander 2005 available online</a>]",
                "–––, 2007, <em>The Structural Evolution of\nMorality</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511550997",
                "Andreoni, James and B. Douglas Bernheim, 2009, “Social Image\nand The 50–50 Norm: A Theoretical and Experimental Analysis of\nAudience Effects”, <em>Econometrica</em>, 77(5):\n1607–1636. doi:10.3982/ECTA7384",
                "Arrow, Kenneth J., 1971, “A Utilitarian Approach to the\nConcept of Equality in Public Expenditure”, <em>Quarterly\nJournal of Economics</em>, 85(3): 409–15.\ndoi:10.2307/1885930",
                "Axelrod, Robert, 1984, <em>The Evolution of Cooperation</em>, New\nYork: Basic Books.",
                "–––, 1986, “An Evolutionary Approach to\nNorms”, <em>American Political Science Review</em>, 80(4):\n1095–1111. doi:10.1017/S0003055400185016",
                "Battigalli, Pierpaolo &amp; Dufwenberg, Martin, 2009,\n“Dynamic Psychological Games”, <em>Journal of Economic\nTheory</em>, 144(1): 1–35. doi:10.1016/j.jet.2008.01.004",
                "–––, 2022, “Belief-Dependent Motivations\nand Psychological Game Theory”, <em>Journal of Economic\nLiterature</em>, 60(3): 833–882. doi:10.1257/jel.20201378",
                "Bénabou, Roland and Jean Tirole, 2006, “Incentives\nand Prosocial Behavior”, <em>American Economic Review</em>,\n96(5): 1652–1678. doi:10.1257/aer.96.5.1652",
                "–––, 2011, “Identity, Morals, and Taboos:\nBeliefs as Assets”, <em>Quarterly Journal of Economics</em>,\n126(2): 805–855. doi:10.1093/qje/qjr002",
                "Bicchieri, Cristina, 1990, “Norms of Cooperation”,\n<em>Ethics</em>, 100(4): 838–861. doi:10.1086/293237",
                "–––, 1993, <em>Rationality and\nCoordination</em>, Cambridge: Cambridge University Press. Second\nEdition, 1996.",
                "–––, 1997, “Learning to Cooperate”,\nin Cristina Bicchieri, Richard C. Jeffrey, and Brian Skyrms, <em>The\nDynamics of Norms</em>, Cambridge: Cambridge University Press.",
                "–––, 2002, “Covenants Without Swords:\nGroup Identity, Norms, and Communication in Social Dilemmas”,\n<em>Rationality and Society</em>, 14(2): 192–228.\ndoi:10.1177/1043463102014002003",
                "–––, 2006, <em>The Grammar of Society: The\nNature and Dynamics of Social Norms</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511616037",
                "–––, 2016, <em>Norms in the Wild: How to\nDiagnose, Measure, and Change Social Norms</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780190622046.001.0001",
                "–––, 2022, “Norm Nudging: How to Measure\nWhat We Want to Implement” in <em>Behavioral Science in the\nWild</em> (pp. 82–107). University of Toronto Press.",
                "–––, 2023, “Norm nudging and twisting\npreferences”, <em>Behavioural Public Policy</em>,\n1–10.",
                "Bicchieri, Cristina and Alex Chavez, 2010, “Behaving as\nExpected: Public Information and Fairness Norms”, <em>Journal of\nBehavioral Decision Making</em>, 23(2): 161–178.\ndoi:10.1002/bdm.648",
                "Bicchieri, Cristina, John Duffy, and Gil Tolle, 2004, “Trust\nAmong Strangers”, <em>Philosophy of Science</em>, 71(3):\n286–319. doi:10.1086/381411",
                "Bicchieri, Cristina and Yoshitaka Fukui, 1999, “The Great\nIllusion: Ignorance, Informational Cascades and the Persistence of\nUnpopular Norms”, <em>Business Ethics Quarterly</em>, 9(1):\n127–155. doi:10.2307/3857639",
                "Bicchieri, Cristina and Azi Lev-On, 2007, “Computer-Mediated\nCommunication and Cooperation in Social Dilemmas: An Experimental\nAnalysis”, <em>Politics, Philosophy and Economics</em>, 6(2):\n139–168. doi:10.1177/1470594X07077267",
                "Bicchieri, Cristina and Alessandro Sontuoso, 2015, “I Cannot\nCheat on You After We Talk”, in <em>The Prisoner’s\nDilemma</em>, Martin Peterson (ed.), Cambridge: Cambridge University\nPress, pp. 101–114. doi:10.1017/CBO9781107360174.007",
                "–––, 2020, “Game-Theoretic Accounts of\nSocial Norms”, in M. Capra, R. Croson, T. Rosenblatt, and M.\nRigdon (eds.), <em>The Handbook of Experimental Game Theory</em>,\nCheltenham: Edward Elgar Publishing.\ndoi:10.4337/9781785363337.00017",
                "Bicchieri, Cristina and Erte Xiao, 2009, “Do the Right\nThing: But Only If Others Do So”, <em>Journal of Behavioral\nDecision Making</em>, 22(2): 191–208. doi:10.1002/bdm.621",
                "Bicchieri, Cristina and Jiji Zhang, 2012, “An Embarrassment\nof Riches: Modeling Social Preferences in Ultimatum Games”, in\n<em>Philosophy of Economics</em>, (<em>Handbook of the Philosophy of\nScience</em>, Volume 13), Uskali Mäki (ed.), Amsterdam:\nElsevier.",
                "Binmore, Ken, 2010, “Social Norms or Social\nPreferences?”, <em>Mind &amp; Society</em>, 9(2): 139–157.\ndoi:10.1007/s11299-010-0073-2",
                "Binmore, Kenneth G. and Larry Samuelson, 1992, “Evolutionary\nStability in Repeated Games Played by Finite Automata”,\n<em>Journal of Economic Theory</em>, 57(2): 278–305.\ndoI:10.1016/0022-0531(92)90037-I",
                "Bolton, Gary E. and Axel Ockenfels, 2000, “ERC: A Theory of\nEquity, Reciprocity, and Competition”, <em>American Economic\nReview</em>, 90(1): 166–193. doi:10.1257/aer.90.1.166",
                "Bornstein, Gary and Meyrav Ben-Yossef, 1994, “Cooperation in\nIntergroup and Single-Group Social Dilemmas”, <em>Journal of\nExperimental Social Psychology</em>, 30(1): 52–67.\ndoi:10.1006/jesp.1994.1003",
                "Bowles, Samuel, 1998, “Endogenous Preferences: The Cultural\nConsequences of Markets and Other Economic Institutions”,\n<em>Journal of Economic Literature</em>, 36(1): 75–111.",
                "Brennan, Geoffrey, Lina Eriksson, Robert E. Goodin, and Nicholas\nSouthwood, 2013, <em>Explaining Norms</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199654680.001.0001",
                "Brewer, Marilynn B., 1979, “In-group Bias in the Minimal\nIntergroup Situation: A Cognitive-Motivational Analysis”,\n<em>Psychological Bulletin</em>, 86(2): 307–324.\ndoi:10.1037/0033-2909.86.2.307",
                "–––, 1991, “The Social Self: On Being the\nSame and Different at the Same Time”, <em>Personality and Social\nPsychology Bulletin</em>, 17(5): 475–482.\ndoi:10.1177/0146167291175001",
                "Brewer, Marilynn B. and Sherry K. Schneider, 1990, “Social\nIdentity and Social Dilemmas: A Double-Edged Sword”, in Dominic\nAbrams and Michael A. Hogg (eds.), <em>Social Identity Theory:\nConstructive and Critical Advances</em>, Wheatsheaf, NY:\nHarvester.",
                "Camerer, Colin F., 2003, <em>Behavioral Game Theory. Experiments\nin Strategic Interaction</em>, Princeton, NJ: Princeton University\nPress.",
                "Cancian, Francesca M, 1975, <em>What are Norms? A Study of Beliefs\nand Action in a Maya Community</em>, Cambridge: Cambridge University\nPress.",
                "Cappelen, Alexander W., Astri Drange Hole, Erik Ø\nSørensen and Bertil Tungodden, 2007, “The Pluralism of\nFairness Ideals: An Experimental Approach”, <em>American\nEconomic Review</em>, 97(3): 818–827.\ndoi:10.1257/aer.97.3.818",
                "Charness, Gary and Matthew Rabin, 2002, “Understanding\nSocial Preferences with Simple Tests”, <em>Quarterly Journal of\nEconomics</em>, 117(3): 817–869.\ndoi:10.1162/003355302760193904",
                "Chavez, Alex K. and Cristina Bicchieri, 2013, “Third-Party\nSanctioning and Compensation Behavior: Findings from the Ultimatum\nGame”, <em>Journal of Economic Psychology</em>, 39:\n268–277. doi:10.1016/j.joep.2013.09.004",
                "Cialdini, Robert B. and Noah J. Goldstein, 2004, “Social\nInfluence: Compliance and Conformity”, <em>Annual Review of\nPsychology</em>, 55: 591–621.\ndoi:10.1146/annurev.psych.55.090902.142015",
                "Cialdini, Robert B., Carl A. Kallgren, and Raymond R. Reno, 1991,\n“A Focus Theory of Normative Conduct”, in <em>Advances in\nExperimental Social Psychology</em>, volume 24, Mark P. Zanna (ed.),\nNew York: Academic Press, pp. 201–234.\ndoi:10.1016/S0065-2601(08)60330-5",
                "Coleman, James S., 1990, <em>Foundations of Social Theory</em>,\nCambridge, MA: Belknap.",
                "Coleman, Jules L., 1989, “Afterword: Rational Choice\nApproach to Legal Rules”, <em>Chicago-Kent Law Review</em>,\n65(1): 177–191.\n [<a href=\"https://scholarship.kentlaw.iit.edu/cklawreview/vol65/iss1/10\" target=\"other\">Jules Coleman 1989 available online</a>]",
                "Dawes, Robyn M., 1972, <em>Fundamentals of Attitude\nMeasurement</em>, New York: Wiley.",
                "–––, 1980, “Social Dilemmas”,\n<em>Annual Review of Psychology</em>, 31: 169–193.\ndoi:10.1146/annurev.ps.31.020180.001125",
                "–––, 1991, “Social Dilemmas, Economic\nSelf-Interest, and Evolutionary Theory”, in Donald R. Brown and\nJ.E. Keith Smith (eds.), <em>Recent Research in Psychology: Frontiers\nof Mathematical Psychology: Essays in Honor of Clyde Coombs</em>, New\nYork: Springer-Verlag. doi:10.1007/978-1-4612-3088-5_2",
                "Deutscher, Irwin, 1973, “What”, in his <em>What We\nSay/What We Do: Sentiments &amp; Acts</em>, Glenview, IL: Scott\nForesman.",
                "Dhami, Sanjit S., 2016, <em>The Foundations of Behavioral Economic\nAnalysis</em>, New York: Oxford University Press.",
                "Diamond, A.S., 1935, <em>Primitive Law</em>, London: Watts.",
                "Dufwenberg, Martin and Georg Kirchsteiger, 2004, “A Theory\nof Sequential Reciprocity”, <em>Games and Economic\nBehavior</em>, 47(2): 268–298.\ndoi:10.1016/j.geb.2003.06.003",
                "Durkheim, Émile, 1895 [1982], <em>Les Règles de la\nméthode sociologique</em>, Paris. Translated as <em>The Rules\nof Sociological Method</em>, W. D. Hall (trans.), Glencoe, IL: The\nFree Press.",
                "–––, 1950 [1957], <em>Leçons de\nSociologie: Physique des Moeurs et du Droit</em>, Istanbul: Cituri\nBiraderlet Basimevi. Translated as <em>Professional Ethics and Civic\nMorals</em>, Cornelia Brookfield (trans.), Glencoe, IL: The Free\nPress.",
                "Ellickson, Robert C., 1991, <em>Order Without Law: How Neighbors\nSettle Disputes</em>, Cambridge, MA: Harvard University Press.",
                "Ellingsen, Tore, Magnus Johannesson, Johanna Mollerstrom, and Sara\nMunkhammar, 2012, “Social Framing Effects: Preferences or\nBeliefs?”, <em>Games and Economic Behavior</em>, 76(1):\n117–130. doi:10.1016/j.geb.2012.05.007",
                "Elster, Jon, 1989a, <em>The Cement of Society: A Study of Social\nOrder</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511624995",
                "–––, 1989b, “Social Norms and Economic\nTheory” <em>Journal of Economic Perspectives</em>, 3(4):\n99–117. doi:10.1257/jep.3.4.99",
                "Falk, Armin and Urs Fischbacher, 2006, “A Theory of\nReciprocity”, <em>Games and Economic Behavior</em>, 54(2):\n293–315. doi:10.1016/j.geb.2005.03.001",
                "Fehr, Ernst and Klaus M. Schmidt, 1999, “A Theory of\nFairness, Competition, and Cooperation”, <em>Quarterly Journal\nof Economics</em>, 114(3): 817–868.\ndoi:10.1162/003355399556151",
                "–––, 2006, “The Economics of Fairness,\nReciprocity and Altruism—Experimental Evidence and New\nTheories”, in Serge-Christophe Kolm and Jean Mercier Ythier\n(eds.), <em>Handbook of The Economics of Giving, Altruism and\nReciprocity</em> (Volume 1), Amsterdam: North-Holland/Elsevier, pp.\n615–691. doi:10.1016/S1574-0714(06)01008-6",
                "Fishbein, Martin E., 1967, “A Consideration of Beliefs and\nTheir Role in Attitude Measurement”, in <em>Readings in Attitude\nTheory and Measurement</em>, Martin E. Fishbein (ed.), New York:\nWiley.",
                "Freeman, Linton C. and Türröz Ataöv, 1960,\n“Invalidity of Indirect and Direct Measures of Attitude Toward\nCheating”, <em>Journal of Personality</em>, 28(4):\n443–447. doi:10.1111/j.1467-6494.1960.tb01631.x",
                "Gächter, Simon, Daniele Nosenzo, and Martin Sefton, 2013,\n“Peer Effects in Pro-Social Behavior: Social Norms or Social\nPreferences?”, <em>Journal of The European Economic\nAssociation</em>, 11(3): 548–573. doi:10.1111/jeea.12015",
                "Gaertner, Samuel L. and John F. Dovidio, 1986, “The Aversive\nForm of Racism”, in John F. Dovidio and Samuel L. Gaertner\n(eds.), <em>Prejudice, Discrimination, and Racism: Theory and\nResearch</em>, Orlando, FL: Academic Press, pp. 61–89.",
                "Geanakoplos, John, David Pearce, and Ennio Stacchetti, 1989,\n“Psychological Games and Sequential Rationality”,\n<em>Games and Economic Behavior</em>, 1(1): 60–79.\ndoi:10.1016/0899-8256(89)90005-5",
                "Geertz, Clifford, 1973, “Thick Description: Toward an\nInterpretive Theory of Culture”, in <em>The Interpretation of\nCultures: Selected Essays</em>, New York: Basic Books, pp.\n3–30.",
                "Gintis, Herbert, 2000, <em>Game Theory Evolving</em>, Princeton:\nPrinceton University Press.",
                "Granovetter, Mark, 1985, “Economic Action and Social\nStructure: the Problem of Embeddedness”, <em>American Journal of\nSociology</em>, 91(3): 481–510. doi:10.1086/228311",
                "Guala, Francesco, 2016, <em>Understanding Institutions: The\nScience and Philosophy of Living Together</em>, Princeton, NJ:\nPrinceton University Press.",
                "Hamilton W.D., 1964, “The Genetical Evolution of Social\nBehaviour I and II”, <em>Journal of Theoretical Biology</em>, 7:\n1–16 and 17–52. doi:10.1016/0022-5193(64)90038-4 and\n10.1016/0022-5193(64)90039-6",
                "Handfield, T., &amp; Thrasher, J., 2019, “Two of a kind: Are\nnorms of honor a species of morality?” <em>Biol Philos</em>, 34,\n39. doi.org/10.1007/s10539-019-9693-z",
                "Hardin, Russell, 1982, <em>Collective Action</em>, New York:\nResources for the Future.",
                "Harding, John, Harold Proshansky, Bernard Kutner, and Isidor\nChein, 1954 [1969], “Prejudice and Ethnic Relations”, in\nGardner Lindzey (ed.), <em>Handbook of Social Psychology</em>, volume\n2, Reading, MA: Addison-Wesley, pp. 1021–1061. Reprinted in\nGardner Lindzey and Elliot Aronson (eds.), <em>Handbook of Social\nPsychology</em>, second edition, volume 5, Reading, MA: Addison\nWesley, 1969, pp. 1–76.",
                "Hausman, Daniel M., 2008, “Fairness and Social Norms”\n<em>Philosophy of Science</em>, 75(5): 850–860.\ndoi:10.1086/594529",
                "Hechter, Michael and Karl-Dieter Opp, 2001, <em>Social Norms</em>,\nNew York: Russel Sage Foundation.",
                "Henrich, Joseph and Robert Boyd, 2001, “Why People Punish\nDefectors: Weak Conformist Transmission Can Stabilize Costly\nEnforcement of Norms in Cooperative Dilemmas”, <em>Journal of\nTheoretical Biology</em>, 208(1): 79–89.\ndoi:10.1006/jtbi.2000.2202",
                "Henrich, Joseph, Robert Boyd, Samuel Bowles, Colin Camerer, Ernst\nFehr, Herbert Gintis, and Richard McElreath, 2001, “In Search of\nHomo Economicus: Behavioral Experiments in 15 Small-Scale\nSocieties”, <em>American Economic Review</em>, 91(2):\n73–78. doi:10.1257/aer.91.2.73",
                "Hirshmann, Albert O., 1982, <em>Shifting Involvements: Private\nInterest and Public Action</em>, Princeton: Princeton University\nPress.",
                "Hoebel, Adamson E., 1954, <em>The Law of Primitive Man</em>,\nCambridge, MA: Atheneum.",
                "Hogg, Michael A. and John C. Turner, 1987, “Social Identity\nand Conformity: A Theory of Referent Informational Influence”,\nin William Doise and Serge Moscovici (eds.), <em>Current Issues in\nEuropean Social Psychology</em>, Volume 2, Cambridge: Cambridge\nUniversity Press, pp. 139–182.",
                "Homans, George Caspar, 1950, <em>The Human Group</em>, New York:\nHarcourt, Brace &amp; Company.",
                "–––, 1961, <em>Social Behavior</em>, New York:\nHarcourt Brace and World.",
                "Insko, Chester A. and John Schopler, 1967, “Triadic\nConsistency: A Statement of Affective-Cognitive-Conative\nConsistency”, <em>Psychological Review</em>, 74(5):\n361–376. doi:10.1037/h0020278",
                "Kagel, John H. and Alvin E. Roth, 2016, <em>Handbook of\nExperimental Economics</em>, Volume 2, Princeton, NJ: Princeton\nUniversity Press.",
                "Klassen, Albert D., Colin J. Williams, and Eugene E. Levitt, 1989,\n<em>Sex and Morality in the U.S.: An Empirical Enquiry Under the\nAuspices of the Kinsey Institute</em>, Middletown, CT: Wesleyan\nUniversity Press.",
                "Kramer, Roderick M. and Marilynn B. Brewer, 1984, “Effects\nof Group Identity on Resource Use in a Simulated Commons\nDilemma”, <em>Journal of Personality and Social Psychology</em>,\n46(5): 1044–1057. doi:10.1037/0022-3514.46.5.1044",
                "Krupka, Erin L. and Roberto A. Weber, 2013, “Identifying\nSocial Norms Using Coordination Games: Why Does Dictator Game Sharing\nVary?”, <em>Journal of The European Economic Association</em>,\n11(3): 495–524. doi:10.1111/jeea.12006",
                "LaPiere, Richard T., 1934, “Attitudes vs. Actions”,\n<em>Social Forces</em>, 13(2): 230–237. doi:10.2307/2570339",
                "Ledyard, John, 1995, “Public Goods Experiments”, in\nJohn H. Kagel and Alvin E. Roth (eds.), <em>The Handbook of\nExperimental Economics</em>, Princeton, NJ: Princeton University\nPress.",
                "Lewis, David, 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, MA: Harvard University Press.\ndoi:10.1002/9780470693711",
                "–––, 1975, “Languages and Language”,\nin <em>Language, Mind, and Knowledge</em>, (<em>Minnesota Studies in\nthe Philosophy of Science</em>, 6), Keith Gunderson (ed.),\nMinneapolis: University of Minnesota Press, pp. 3–35.\n [<a href=\"http://mcps.umn.edu/assets/pdf/7.1_Lewis.pdf\" target=\"other\">Lewis 1975 available online</a>]",
                "López-Pérez, Raúl, 2008, “Aversion to\nNorm-Breaking: A Model”, <em>Games and Economic Behavior</em>,\n64(1): 237–267. doi:10.1016/j.geb.2007.10.009",
                "Mackay, Charles, 1841, <em>Extraordinary Popular Delusions and the\nMadness of Crowds</em>, N. Stone (ed.), Hertfordshire: Wordsworth,\n1995.",
                "Mackie, G., 1996, “Ending Footbinding and Infibulation: A\nConvention Account”, <em>American Sociological Review</em>,\n61(6): 999–1017. doi:10.2307/2096305",
                "Matza, David, 1964, <em>Delinquency and Drift</em>, New York:\nWiley.",
                "Maynard Smith, J. and G. R. Price, 1973, “The Logic of\nAnimal Conflict”, <em>Nature</em>, 246(5427): 15–18.\ndoi:10.1038/246015a0",
                "Miller, Dale T. and Rebecca K. Ratner, 1996, “The Power of\nthe Myth of Self-Interest”, in Leo Montada and Melvin J. Lerner\n(eds.), <em>Current Societal Concerns About Justice</em>, New York:\nPlenum Press. doi:10.1007/978-1-4757-9927-9_3",
                "Muldoon, Ryan, 2017, “Perspectives, Norms and Agency”,\n<em>Social Philosophy and Policy,</em> 34(1): 260–276.\ndoi:10.1017/S0265052517000127",
                "–––, 2018a, “Understanding Norms and\nChanging Them”, <em>Social Philosophy and Policy,</em> 35(1):\n128–148. doi:10.1017/S0265052518000092",
                "–––, 2018b, “Norms, Nudges, and\nAutonomy”, In: Boonin, D. (eds) <em>The Palgrave Handbook of\nPhilosophy and Public Policy</em>. Palgrave Macmillan, Cham.\ndoi:10.1007/978-3-319-93907-0_18",
                "–––, 2020, “Social Norms and Social\nOrder”, in: Chartier and Van Schoelandt (eds) <em>The Routledge\nHandbook of Anarchy and Anarchist Thought</em>. Routledge.",
                "Muldoon, R., Lisciandra, C., Bicchieri, C., Hartmann, S., &amp;\nSprenger, J., 2014, “On the emergence of descriptive\nnorms”, <em>Politics, Philosophy &amp; Economics</em>, 13(1):\n 3–22. doi:10.1177/1470594X12447791",
                "Muldoon, R., Lisciandra, C. &amp; Hartmann, S., 2014, “Why\nare there descriptive norms? Because we looked for them”,\n<em>Synthese</em> 191, 4409–4429.\ndoi:10.1007/s11229-014-0534-y",
                "Nachbar, J.H., 1990, “‘Evolutionary’ Selection\nDynamics in Games: Convergence and Limit Properties”,\n<em>International Journal of Game Theory</em>, 19(1): 59–89.\ndoi:10.1007/BF01753708",
                "North, Douglass C., 1990, “A Transaction Cost Theory of\nPolitics” <em>Journal of Theoretical Politics</em>, 2(4):\n355–367. doi:10.1177/0951692890002004001",
                "O’Gorman, Hubert J., 1975, “Pluralistic Ignorance and\nWhite Estimates of White Support for Racial Segregation”,\n<em>Public Opinion Quarterly</em>, 39(3): 313–330.\ndoi:10.1086/268231",
                "Olson, Mancur, 1965 [1971], <em>The Logic of Collective Action:\nPublic Goods and the Theory of Groups</em>, revised edition,\nCambridge, MA: Harvard University Press.",
                "Ostrom, Elinor, 2000, “Collective Action and The Evolution\nof Social Norms”, <em>Journal of Economic Perspectives</em>,\n14(3): 137–158. doi:10.1257/jep.14.3.137",
                "Pagel, Elaine, 2003, <em>Beyond Belief: The Secret Gospel of\nThomas</em>, New York: Vintage Books.",
                "Parsons, Talcott, 1951, <em>The Social System</em>, New York:\nRoutledge.",
                "–––, 1937 [1968], <em>The Structure of Social\nAction. A Study in Social Theory with Special Reference to a Group of\nRecent European Writers</em>, New York, London: Free Press.",
                "Parsons, Talcott and Edward A. Shils, 1951, <em>Towards a General\nTheory of Action</em>, Cambridge, MA: Harvard University Press.",
                "Posner, Eric A., 2000, <em>Law and Social Norms</em>, Cambridge,\nMA: Harvard University Press.",
                "Prentice, Deborah A. and Dale T. Miller, 1993, “Pluralistic\nIgnorance and Alcohol Use on Campus: Some Consequences of\nMisperceiving the Social Norm”, <em>Journal of Personality and\nSocial Psychology</em>, 64(2): 243–56.\ndoi:10.1037/0022-3514.64.2.243",
                "Rabin, Matthew, 1993, “Incorporating Fairness into Game\nTheory and Economics”, <em>American Economic Review</em>, 83(5):\n1281–1302.",
                "Reuben, Ernesto and Arno Riedl, 2013, “Enforcement of\nContribution Norms in Public Good Games with Heterogeneous\nPopulations”, <em>Games and Economic Behavior</em>, 77(1):\n122–137. doi:10.1016/j.geb.2012.10.001",
                "Robinson, Claude E., 1932, <em>Straw Votes: A Study of Political\nPrediction</em>, New York: Columbia University Press.",
                "Rommetveit, Ragnar, 1955, <em>Social Norms and Roles: Explorations\nin the Psychology of Enduring Social Pressures with Empirical\nContributions from Inquiries into Religious Attitudes and Sex Roles of\nAdolescents from Some Districts in Western Norway</em>, Oslo:\nAkedemisk Forlag.",
                "Schelling, Thomas C., 1960, <em>The Strategy of Conflict</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1978, <em>Micromotives and\nMacrobehavior</em>, New York: Norton.",
                "Schram, Arthur and Gary Charness, 2015, “Inducing Social\nNorms in Laboratory Allocation Choices”, <em>Management\nScience</em>, 61(7): 1531–1546. doi:10.1287/mnsc.2014.2073",
                "Scott, John Finley, 1971, <em>Internalization of Norms: A\nSociological Theory of Moral Commitment</em>, Englewood Cliffs, NJ:\nPrentice Hall.",
                "Sherif, Muzafer, 1936, <em>The Psychology of Social Norms</em>,\nNew York: Harper.",
                "Skyrms, Brian, 1996, <em>Evolution of the Social Contract</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511806308",
                "–––, 2004, <em>The Stag Hunt and the Evolution\nof Social Structure</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139165228",
                "Stigler, George J. and Gary S. Becker, 1977, “De Gustibus\nNon Est Disputandum”, <em>American Economic Review</em>, 67(2):\n76–90.",
                "Sugden, Robert, 1986 [2004], <em>The Economics of Rights,\nCo-operation and Welfare</em>, second edition, Basingstoke: Palgrave\nMacmillan, 2004.",
                "–––, 2000, “The Motivating Power of\nExpectations”, in Julian Nida-Rümelin and Wolfgang Spohn\n(eds.), <em>Practical Rationality, Rules, and Structure</em>,\nDordrecht: Kluwer. doi:10.1007/978-94-015-9616-9_7",
                "Tajfel, Henri, 1973, “The Roots of Prejudice: Cognitive\nAspects”, in <em>Psychology and Race</em>, Peter Watson (ed.),\nChicago: Aldine.",
                "–––, 1981, <em>Human Groups and Social\nCategories: Studies in Social Psychology</em>, Cambridge: Cambridge\nUniversity Press.",
                "Taylor, Peter D. and Leo B. Jonker, 1978, “Evolutionary\nStable Strategies and Game Dynamics”, <em>Mathematical\nBiosciences</em>, 40(1–2): 145–156.\ndoi:10.1016/0025-5564(78)90077-9",
                "Thibaut, John W. and Harold H. Kelley, 1959, <em>The Social\nPsychology of Groups</em>, New York: Wiley.",
                "Thrasher, John, 2018, “Evaluating bad norms”\n<em>Social Philosophy and Policy,</em> 35(1): 196–216.\ndoi:10.1017/S0265052518000055",
                "Thrasher, J., &amp; Handfield, T., 2018, “Honor and\nViolence”, <em>Hum Nat</em> 29, 371–389.\ndoi:10.1007/s12110-018-9324-4",
                "Trivers, Robert L., 1971, “The Evolution of Reciprocal\nAltruism”, <em>Quarterly Review of Biology</em>, 46(1):\n35–57. doi:10.1086/406755",
                "–––, 1985, <em>Social Evolution</em>, Menlo\nPark, CA: Benjamin/Cummings.",
                "Turnbull, C. M., 1972, <em>The Mountain People</em>, New York:\nTouchstone.",
                "Turner, John C., Michael A. Hogg, Penelope J. Oakes, Stephen D.\nReicher, and Margaret S. Wetherell, 1987, <em>Rediscovering the Social\nGroup: A Self-Categorization Theory</em>, Oxford: Blackwell.",
                "Ullmann-Margalit, Edna, 1977, <em>The Emergence of Norms</em>,\nOxford: Clarendon Press.",
                "Vanderschraaf, Peter, 1995, “Convention as Correlated\nEquilibrium”, <em>Erkenntnis</em>, 42(1): 65–87.\ndoi:10.1007/BF01666812",
                "Warner, Lyle G. and Melvin L. DeFleur, 1969, “Attitude as An\nInteractional Concept: Social Constraint and Social Distance as\nIntervening Variables Between Attitudes and Action”,\n<em>American Sociological Review</em>, 34(2): 153–169.\ndoi:10.2307/2092174",
                "Wicker, Allan W., 1969, “Attitude versus Actions: The\nRelationship of Verbal and Overt Behavioral Responses to Attitude\nObjects”, <em>A Journal of Social Issues</em>, 25(4):\n41–78. doi:10.1111/j.1540-4560.1969.tb00619.x",
                "Wrong, Dennis H., 1961, “The Oversocialized Conception of\nMan in Modern Sociology”, <em>American Sociological Review</em>,\n26(2): 183–193. doi:10.2307/2089854",
                "Wuthnow, Robert, 1991, <em>Acts of Compassion: Caring for Others\nand Helping Ourselves</em>, Princeton: Princeton University\nPress.",
                "Xiao, Erte and Cristina Bicchieri, 2010, “When Equality\nTrumps Reciprocity”, <em>Journal of Economic Psychology</em>,\n31(3): 456–470. doi:10.1016/j.joep.2010.02.001",
                "Young, H. Peyton, 1993, “The Evolution of\nConventions”, <em>Econometrica</em>, 61(1): 57–84.\ndoi:10.2307/2951778",
                "–––, 1998a, “Social Norms and Economic\nWelfare”, <em>European Economic Review</em>, 42(3–5):\n821–830. doi:10.1016/S0014-2921(97)00138-4",
                "–––, 1998b, <em>Individual Strategy and Social\nStructure: An Evolutionary Theory of Institutions</em>, Princeton, NJ:\nPrinceton University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Abbink, K., Gangadharan, L., Handfield, T., <em>et al., 2017,\n</em> Peer punishment promotes enforcement of bad social norms.\n<em>Nat Commun</em> 8(609). doi:10.1038/s41467-017-00731-0</li>\n<li>Akerlof, George A., 1976, “The Economics of Caste and of the\nRat Race and Other Woeful Tales”, <em>Quarterly Journal of\nEconomics</em>, 90(4): 599–617. doi:10.2307/1885324</li>\n<li>Alexander, Jason McKenzie, 2000, “Evolutionary Explanations\nof Distributive Justice”, <em>Philosophy of Science</em>, 67(3):\n490–516. doi:10.1086/392792</li>\n<li>–––, 2005, “The Evolutionary Foundations\nof Human Altruism”, <em>Analyse &amp; Kritik</em>, 27(1):\n106–113.\n [<a href=\"http://www.analyse-und-kritik.net/Dateien/56c1d48f66a49_ak_mckenzie_2005.pdf\" target=\"other\">Alexander 2005 available online</a>]</li>\n<li>–––, 2007, <em>The Structural Evolution of\nMorality</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511550997</li>\n<li>Andreoni, James and B. Douglas Bernheim, 2009, “Social Image\nand The 50–50 Norm: A Theoretical and Experimental Analysis of\nAudience Effects”, <em>Econometrica</em>, 77(5):\n1607–1636. doi:10.3982/ECTA7384</li>\n<li>Arrow, Kenneth J., 1971, “A Utilitarian Approach to the\nConcept of Equality in Public Expenditure”, <em>Quarterly\nJournal of Economics</em>, 85(3): 409–15.\ndoi:10.2307/1885930</li>\n<li>Axelrod, Robert, 1984, <em>The Evolution of Cooperation</em>, New\nYork: Basic Books.</li>\n<li>–––, 1986, “An Evolutionary Approach to\nNorms”, <em>American Political Science Review</em>, 80(4):\n1095–1111. doi:10.1017/S0003055400185016</li>\n<li>Battigalli, Pierpaolo &amp; Dufwenberg, Martin, 2009,\n“Dynamic Psychological Games”, <em>Journal of Economic\nTheory</em>, 144(1): 1–35. doi:10.1016/j.jet.2008.01.004</li>\n<li>–––, 2022, “Belief-Dependent Motivations\nand Psychological Game Theory”, <em>Journal of Economic\nLiterature</em>, 60(3): 833–882. doi:10.1257/jel.20201378</li>\n<li>Bénabou, Roland and Jean Tirole, 2006, “Incentives\nand Prosocial Behavior”, <em>American Economic Review</em>,\n96(5): 1652–1678. doi:10.1257/aer.96.5.1652</li>\n<li>–––, 2011, “Identity, Morals, and Taboos:\nBeliefs as Assets”, <em>Quarterly Journal of Economics</em>,\n126(2): 805–855. doi:10.1093/qje/qjr002</li>\n<li>Bicchieri, Cristina, 1990, “Norms of Cooperation”,\n<em>Ethics</em>, 100(4): 838–861. doi:10.1086/293237</li>\n<li>–––, 1993, <em>Rationality and\nCoordination</em>, Cambridge: Cambridge University Press. Second\nEdition, 1996.</li>\n<li>–––, 1997, “Learning to Cooperate”,\nin Cristina Bicchieri, Richard C. Jeffrey, and Brian Skyrms, <em>The\nDynamics of Norms</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2002, “Covenants Without Swords:\nGroup Identity, Norms, and Communication in Social Dilemmas”,\n<em>Rationality and Society</em>, 14(2): 192–228.\ndoi:10.1177/1043463102014002003</li>\n<li>–––, 2006, <em>The Grammar of Society: The\nNature and Dynamics of Social Norms</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511616037</li>\n<li>–––, 2016, <em>Norms in the Wild: How to\nDiagnose, Measure, and Change Social Norms</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780190622046.001.0001</li>\n<li>–––, 2022, “Norm Nudging: How to Measure\nWhat We Want to Implement” in <em>Behavioral Science in the\nWild</em> (pp. 82–107). University of Toronto Press.</li>\n<li>–––, 2023, “Norm nudging and twisting\npreferences”, <em>Behavioural Public Policy</em>,\n1–10.</li>\n<li>Bicchieri, Cristina and Alex Chavez, 2010, “Behaving as\nExpected: Public Information and Fairness Norms”, <em>Journal of\nBehavioral Decision Making</em>, 23(2): 161–178.\ndoi:10.1002/bdm.648</li>\n<li>Bicchieri, Cristina, John Duffy, and Gil Tolle, 2004, “Trust\nAmong Strangers”, <em>Philosophy of Science</em>, 71(3):\n286–319. doi:10.1086/381411</li>\n<li>Bicchieri, Cristina and Yoshitaka Fukui, 1999, “The Great\nIllusion: Ignorance, Informational Cascades and the Persistence of\nUnpopular Norms”, <em>Business Ethics Quarterly</em>, 9(1):\n127–155. doi:10.2307/3857639</li>\n<li>Bicchieri, Cristina and Azi Lev-On, 2007, “Computer-Mediated\nCommunication and Cooperation in Social Dilemmas: An Experimental\nAnalysis”, <em>Politics, Philosophy and Economics</em>, 6(2):\n139–168. doi:10.1177/1470594X07077267</li>\n<li>Bicchieri, Cristina and Alessandro Sontuoso, 2015, “I Cannot\nCheat on You After We Talk”, in <em>The Prisoner’s\nDilemma</em>, Martin Peterson (ed.), Cambridge: Cambridge University\nPress, pp. 101–114. doi:10.1017/CBO9781107360174.007</li>\n<li>–––, 2020, “Game-Theoretic Accounts of\nSocial Norms”, in M. Capra, R. Croson, T. Rosenblatt, and M.\nRigdon (eds.), <em>The Handbook of Experimental Game Theory</em>,\nCheltenham: Edward Elgar Publishing.\ndoi:10.4337/9781785363337.00017</li>\n<li>Bicchieri, Cristina and Erte Xiao, 2009, “Do the Right\nThing: But Only If Others Do So”, <em>Journal of Behavioral\nDecision Making</em>, 22(2): 191–208. doi:10.1002/bdm.621</li>\n<li>Bicchieri, Cristina and Jiji Zhang, 2012, “An Embarrassment\nof Riches: Modeling Social Preferences in Ultimatum Games”, in\n<em>Philosophy of Economics</em>, (<em>Handbook of the Philosophy of\nScience</em>, Volume 13), Uskali Mäki (ed.), Amsterdam:\nElsevier.</li>\n<li>Binmore, Ken, 2010, “Social Norms or Social\nPreferences?”, <em>Mind &amp; Society</em>, 9(2): 139–157.\ndoi:10.1007/s11299-010-0073-2</li>\n<li>Binmore, Kenneth G. and Larry Samuelson, 1992, “Evolutionary\nStability in Repeated Games Played by Finite Automata”,\n<em>Journal of Economic Theory</em>, 57(2): 278–305.\ndoI:10.1016/0022-0531(92)90037-I</li>\n<li>Bolton, Gary E. and Axel Ockenfels, 2000, “ERC: A Theory of\nEquity, Reciprocity, and Competition”, <em>American Economic\nReview</em>, 90(1): 166–193. doi:10.1257/aer.90.1.166</li>\n<li>Bornstein, Gary and Meyrav Ben-Yossef, 1994, “Cooperation in\nIntergroup and Single-Group Social Dilemmas”, <em>Journal of\nExperimental Social Psychology</em>, 30(1): 52–67.\ndoi:10.1006/jesp.1994.1003</li>\n<li>Bowles, Samuel, 1998, “Endogenous Preferences: The Cultural\nConsequences of Markets and Other Economic Institutions”,\n<em>Journal of Economic Literature</em>, 36(1): 75–111.</li>\n<li>Brennan, Geoffrey, Lina Eriksson, Robert E. Goodin, and Nicholas\nSouthwood, 2013, <em>Explaining Norms</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199654680.001.0001</li>\n<li>Brewer, Marilynn B., 1979, “In-group Bias in the Minimal\nIntergroup Situation: A Cognitive-Motivational Analysis”,\n<em>Psychological Bulletin</em>, 86(2): 307–324.\ndoi:10.1037/0033-2909.86.2.307</li>\n<li>–––, 1991, “The Social Self: On Being the\nSame and Different at the Same Time”, <em>Personality and Social\nPsychology Bulletin</em>, 17(5): 475–482.\ndoi:10.1177/0146167291175001</li>\n<li>Brewer, Marilynn B. and Sherry K. Schneider, 1990, “Social\nIdentity and Social Dilemmas: A Double-Edged Sword”, in Dominic\nAbrams and Michael A. Hogg (eds.), <em>Social Identity Theory:\nConstructive and Critical Advances</em>, Wheatsheaf, NY:\nHarvester.</li>\n<li>Camerer, Colin F., 2003, <em>Behavioral Game Theory. Experiments\nin Strategic Interaction</em>, Princeton, NJ: Princeton University\nPress.</li>\n<li>Cancian, Francesca M, 1975, <em>What are Norms? A Study of Beliefs\nand Action in a Maya Community</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Cappelen, Alexander W., Astri Drange Hole, Erik Ø\nSørensen and Bertil Tungodden, 2007, “The Pluralism of\nFairness Ideals: An Experimental Approach”, <em>American\nEconomic Review</em>, 97(3): 818–827.\ndoi:10.1257/aer.97.3.818</li>\n<li>Charness, Gary and Matthew Rabin, 2002, “Understanding\nSocial Preferences with Simple Tests”, <em>Quarterly Journal of\nEconomics</em>, 117(3): 817–869.\ndoi:10.1162/003355302760193904</li>\n<li>Chavez, Alex K. and Cristina Bicchieri, 2013, “Third-Party\nSanctioning and Compensation Behavior: Findings from the Ultimatum\nGame”, <em>Journal of Economic Psychology</em>, 39:\n268–277. doi:10.1016/j.joep.2013.09.004</li>\n<li>Cialdini, Robert B. and Noah J. Goldstein, 2004, “Social\nInfluence: Compliance and Conformity”, <em>Annual Review of\nPsychology</em>, 55: 591–621.\ndoi:10.1146/annurev.psych.55.090902.142015</li>\n<li>Cialdini, Robert B., Carl A. Kallgren, and Raymond R. Reno, 1991,\n“A Focus Theory of Normative Conduct”, in <em>Advances in\nExperimental Social Psychology</em>, volume 24, Mark P. Zanna (ed.),\nNew York: Academic Press, pp. 201–234.\ndoi:10.1016/S0065-2601(08)60330-5</li>\n<li>Coleman, James S., 1990, <em>Foundations of Social Theory</em>,\nCambridge, MA: Belknap.</li>\n<li>Coleman, Jules L., 1989, “Afterword: Rational Choice\nApproach to Legal Rules”, <em>Chicago-Kent Law Review</em>,\n65(1): 177–191.\n [<a href=\"https://scholarship.kentlaw.iit.edu/cklawreview/vol65/iss1/10\" target=\"other\">Jules Coleman 1989 available online</a>]</li>\n<li>Dawes, Robyn M., 1972, <em>Fundamentals of Attitude\nMeasurement</em>, New York: Wiley.</li>\n<li>–––, 1980, “Social Dilemmas”,\n<em>Annual Review of Psychology</em>, 31: 169–193.\ndoi:10.1146/annurev.ps.31.020180.001125</li>\n<li>–––, 1991, “Social Dilemmas, Economic\nSelf-Interest, and Evolutionary Theory”, in Donald R. Brown and\nJ.E. Keith Smith (eds.), <em>Recent Research in Psychology: Frontiers\nof Mathematical Psychology: Essays in Honor of Clyde Coombs</em>, New\nYork: Springer-Verlag. doi:10.1007/978-1-4612-3088-5_2</li>\n<li>Deutscher, Irwin, 1973, “What”, in his <em>What We\nSay/What We Do: Sentiments &amp; Acts</em>, Glenview, IL: Scott\nForesman.</li>\n<li>Dhami, Sanjit S., 2016, <em>The Foundations of Behavioral Economic\nAnalysis</em>, New York: Oxford University Press.</li>\n<li>Diamond, A.S., 1935, <em>Primitive Law</em>, London: Watts.</li>\n<li>Dufwenberg, Martin and Georg Kirchsteiger, 2004, “A Theory\nof Sequential Reciprocity”, <em>Games and Economic\nBehavior</em>, 47(2): 268–298.\ndoi:10.1016/j.geb.2003.06.003</li>\n<li>Durkheim, Émile, 1895 [1982], <em>Les Règles de la\nméthode sociologique</em>, Paris. Translated as <em>The Rules\nof Sociological Method</em>, W. D. Hall (trans.), Glencoe, IL: The\nFree Press.</li>\n<li>–––, 1950 [1957], <em>Leçons de\nSociologie: Physique des Moeurs et du Droit</em>, Istanbul: Cituri\nBiraderlet Basimevi. Translated as <em>Professional Ethics and Civic\nMorals</em>, Cornelia Brookfield (trans.), Glencoe, IL: The Free\nPress.</li>\n<li>Ellickson, Robert C., 1991, <em>Order Without Law: How Neighbors\nSettle Disputes</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Ellingsen, Tore, Magnus Johannesson, Johanna Mollerstrom, and Sara\nMunkhammar, 2012, “Social Framing Effects: Preferences or\nBeliefs?”, <em>Games and Economic Behavior</em>, 76(1):\n117–130. doi:10.1016/j.geb.2012.05.007</li>\n<li>Elster, Jon, 1989a, <em>The Cement of Society: A Study of Social\nOrder</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511624995</li>\n<li>–––, 1989b, “Social Norms and Economic\nTheory” <em>Journal of Economic Perspectives</em>, 3(4):\n99–117. doi:10.1257/jep.3.4.99</li>\n<li>Falk, Armin and Urs Fischbacher, 2006, “A Theory of\nReciprocity”, <em>Games and Economic Behavior</em>, 54(2):\n293–315. doi:10.1016/j.geb.2005.03.001</li>\n<li>Fehr, Ernst and Klaus M. Schmidt, 1999, “A Theory of\nFairness, Competition, and Cooperation”, <em>Quarterly Journal\nof Economics</em>, 114(3): 817–868.\ndoi:10.1162/003355399556151</li>\n<li>–––, 2006, “The Economics of Fairness,\nReciprocity and Altruism—Experimental Evidence and New\nTheories”, in Serge-Christophe Kolm and Jean Mercier Ythier\n(eds.), <em>Handbook of The Economics of Giving, Altruism and\nReciprocity</em> (Volume 1), Amsterdam: North-Holland/Elsevier, pp.\n615–691. doi:10.1016/S1574-0714(06)01008-6</li>\n<li>Fishbein, Martin E., 1967, “A Consideration of Beliefs and\nTheir Role in Attitude Measurement”, in <em>Readings in Attitude\nTheory and Measurement</em>, Martin E. Fishbein (ed.), New York:\nWiley.</li>\n<li>Freeman, Linton C. and Türröz Ataöv, 1960,\n“Invalidity of Indirect and Direct Measures of Attitude Toward\nCheating”, <em>Journal of Personality</em>, 28(4):\n443–447. doi:10.1111/j.1467-6494.1960.tb01631.x</li>\n<li>Gächter, Simon, Daniele Nosenzo, and Martin Sefton, 2013,\n“Peer Effects in Pro-Social Behavior: Social Norms or Social\nPreferences?”, <em>Journal of The European Economic\nAssociation</em>, 11(3): 548–573. doi:10.1111/jeea.12015</li>\n<li>Gaertner, Samuel L. and John F. Dovidio, 1986, “The Aversive\nForm of Racism”, in John F. Dovidio and Samuel L. Gaertner\n(eds.), <em>Prejudice, Discrimination, and Racism: Theory and\nResearch</em>, Orlando, FL: Academic Press, pp. 61–89.</li>\n<li>Geanakoplos, John, David Pearce, and Ennio Stacchetti, 1989,\n“Psychological Games and Sequential Rationality”,\n<em>Games and Economic Behavior</em>, 1(1): 60–79.\ndoi:10.1016/0899-8256(89)90005-5</li>\n<li>Geertz, Clifford, 1973, “Thick Description: Toward an\nInterpretive Theory of Culture”, in <em>The Interpretation of\nCultures: Selected Essays</em>, New York: Basic Books, pp.\n3–30.</li>\n<li>Gintis, Herbert, 2000, <em>Game Theory Evolving</em>, Princeton:\nPrinceton University Press.</li>\n<li>Granovetter, Mark, 1985, “Economic Action and Social\nStructure: the Problem of Embeddedness”, <em>American Journal of\nSociology</em>, 91(3): 481–510. doi:10.1086/228311</li>\n<li>Guala, Francesco, 2016, <em>Understanding Institutions: The\nScience and Philosophy of Living Together</em>, Princeton, NJ:\nPrinceton University Press.</li>\n<li>Hamilton W.D., 1964, “The Genetical Evolution of Social\nBehaviour I and II”, <em>Journal of Theoretical Biology</em>, 7:\n1–16 and 17–52. doi:10.1016/0022-5193(64)90038-4 and\n10.1016/0022-5193(64)90039-6</li>\n<li>Handfield, T., &amp; Thrasher, J., 2019, “Two of a kind: Are\nnorms of honor a species of morality?” <em>Biol Philos</em>, 34,\n39. doi.org/10.1007/s10539-019-9693-z</li>\n<li>Hardin, Russell, 1982, <em>Collective Action</em>, New York:\nResources for the Future.</li>\n<li>Harding, John, Harold Proshansky, Bernard Kutner, and Isidor\nChein, 1954 [1969], “Prejudice and Ethnic Relations”, in\nGardner Lindzey (ed.), <em>Handbook of Social Psychology</em>, volume\n2, Reading, MA: Addison-Wesley, pp. 1021–1061. Reprinted in\nGardner Lindzey and Elliot Aronson (eds.), <em>Handbook of Social\nPsychology</em>, second edition, volume 5, Reading, MA: Addison\nWesley, 1969, pp. 1–76.</li>\n<li>Hausman, Daniel M., 2008, “Fairness and Social Norms”\n<em>Philosophy of Science</em>, 75(5): 850–860.\ndoi:10.1086/594529</li>\n<li>Hechter, Michael and Karl-Dieter Opp, 2001, <em>Social Norms</em>,\nNew York: Russel Sage Foundation.</li>\n<li>Henrich, Joseph and Robert Boyd, 2001, “Why People Punish\nDefectors: Weak Conformist Transmission Can Stabilize Costly\nEnforcement of Norms in Cooperative Dilemmas”, <em>Journal of\nTheoretical Biology</em>, 208(1): 79–89.\ndoi:10.1006/jtbi.2000.2202</li>\n<li>Henrich, Joseph, Robert Boyd, Samuel Bowles, Colin Camerer, Ernst\nFehr, Herbert Gintis, and Richard McElreath, 2001, “In Search of\nHomo Economicus: Behavioral Experiments in 15 Small-Scale\nSocieties”, <em>American Economic Review</em>, 91(2):\n73–78. doi:10.1257/aer.91.2.73</li>\n<li>Hirshmann, Albert O., 1982, <em>Shifting Involvements: Private\nInterest and Public Action</em>, Princeton: Princeton University\nPress.</li>\n<li>Hoebel, Adamson E., 1954, <em>The Law of Primitive Man</em>,\nCambridge, MA: Atheneum.</li>\n<li>Hogg, Michael A. and John C. Turner, 1987, “Social Identity\nand Conformity: A Theory of Referent Informational Influence”,\nin William Doise and Serge Moscovici (eds.), <em>Current Issues in\nEuropean Social Psychology</em>, Volume 2, Cambridge: Cambridge\nUniversity Press, pp. 139–182.</li>\n<li>Homans, George Caspar, 1950, <em>The Human Group</em>, New York:\nHarcourt, Brace &amp; Company.</li>\n<li>–––, 1961, <em>Social Behavior</em>, New York:\nHarcourt Brace and World.</li>\n<li>Insko, Chester A. and John Schopler, 1967, “Triadic\nConsistency: A Statement of Affective-Cognitive-Conative\nConsistency”, <em>Psychological Review</em>, 74(5):\n361–376. doi:10.1037/h0020278</li>\n<li>Kagel, John H. and Alvin E. Roth, 2016, <em>Handbook of\nExperimental Economics</em>, Volume 2, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Klassen, Albert D., Colin J. Williams, and Eugene E. Levitt, 1989,\n<em>Sex and Morality in the U.S.: An Empirical Enquiry Under the\nAuspices of the Kinsey Institute</em>, Middletown, CT: Wesleyan\nUniversity Press.</li>\n<li>Kramer, Roderick M. and Marilynn B. Brewer, 1984, “Effects\nof Group Identity on Resource Use in a Simulated Commons\nDilemma”, <em>Journal of Personality and Social Psychology</em>,\n46(5): 1044–1057. doi:10.1037/0022-3514.46.5.1044</li>\n<li>Krupka, Erin L. and Roberto A. Weber, 2013, “Identifying\nSocial Norms Using Coordination Games: Why Does Dictator Game Sharing\nVary?”, <em>Journal of The European Economic Association</em>,\n11(3): 495–524. doi:10.1111/jeea.12006</li>\n<li>LaPiere, Richard T., 1934, “Attitudes vs. Actions”,\n<em>Social Forces</em>, 13(2): 230–237. doi:10.2307/2570339</li>\n<li>Ledyard, John, 1995, “Public Goods Experiments”, in\nJohn H. Kagel and Alvin E. Roth (eds.), <em>The Handbook of\nExperimental Economics</em>, Princeton, NJ: Princeton University\nPress.</li>\n<li>Lewis, David, 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, MA: Harvard University Press.\ndoi:10.1002/9780470693711</li>\n<li>–––, 1975, “Languages and Language”,\nin <em>Language, Mind, and Knowledge</em>, (<em>Minnesota Studies in\nthe Philosophy of Science</em>, 6), Keith Gunderson (ed.),\nMinneapolis: University of Minnesota Press, pp. 3–35.\n [<a href=\"http://mcps.umn.edu/assets/pdf/7.1_Lewis.pdf\" target=\"other\">Lewis 1975 available online</a>]</li>\n<li>López-Pérez, Raúl, 2008, “Aversion to\nNorm-Breaking: A Model”, <em>Games and Economic Behavior</em>,\n64(1): 237–267. doi:10.1016/j.geb.2007.10.009</li>\n<li>Mackay, Charles, 1841, <em>Extraordinary Popular Delusions and the\nMadness of Crowds</em>, N. Stone (ed.), Hertfordshire: Wordsworth,\n1995.</li>\n<li>Mackie, G., 1996, “Ending Footbinding and Infibulation: A\nConvention Account”, <em>American Sociological Review</em>,\n61(6): 999–1017. doi:10.2307/2096305</li>\n<li>Matza, David, 1964, <em>Delinquency and Drift</em>, New York:\nWiley.</li>\n<li>Maynard Smith, J. and G. R. Price, 1973, “The Logic of\nAnimal Conflict”, <em>Nature</em>, 246(5427): 15–18.\ndoi:10.1038/246015a0</li>\n<li>Miller, Dale T. and Rebecca K. Ratner, 1996, “The Power of\nthe Myth of Self-Interest”, in Leo Montada and Melvin J. Lerner\n(eds.), <em>Current Societal Concerns About Justice</em>, New York:\nPlenum Press. doi:10.1007/978-1-4757-9927-9_3</li>\n<li>Muldoon, Ryan, 2017, “Perspectives, Norms and Agency”,\n<em>Social Philosophy and Policy,</em> 34(1): 260–276.\ndoi:10.1017/S0265052517000127</li>\n<li>–––, 2018a, “Understanding Norms and\nChanging Them”, <em>Social Philosophy and Policy,</em> 35(1):\n128–148. doi:10.1017/S0265052518000092</li>\n<li>–––, 2018b, “Norms, Nudges, and\nAutonomy”, In: Boonin, D. (eds) <em>The Palgrave Handbook of\nPhilosophy and Public Policy</em>. Palgrave Macmillan, Cham.\ndoi:10.1007/978-3-319-93907-0_18</li>\n<li>–––, 2020, “Social Norms and Social\nOrder”, in: Chartier and Van Schoelandt (eds) <em>The Routledge\nHandbook of Anarchy and Anarchist Thought</em>. Routledge.</li>\n<li>Muldoon, R., Lisciandra, C., Bicchieri, C., Hartmann, S., &amp;\nSprenger, J., 2014, “On the emergence of descriptive\nnorms”, <em>Politics, Philosophy &amp; Economics</em>, 13(1):\n 3–22. doi:10.1177/1470594X12447791</li>\n<li>Muldoon, R., Lisciandra, C. &amp; Hartmann, S., 2014, “Why\nare there descriptive norms? Because we looked for them”,\n<em>Synthese</em> 191, 4409–4429.\ndoi:10.1007/s11229-014-0534-y</li>\n<li>Nachbar, J.H., 1990, “‘Evolutionary’ Selection\nDynamics in Games: Convergence and Limit Properties”,\n<em>International Journal of Game Theory</em>, 19(1): 59–89.\ndoi:10.1007/BF01753708</li>\n<li>North, Douglass C., 1990, “A Transaction Cost Theory of\nPolitics” <em>Journal of Theoretical Politics</em>, 2(4):\n355–367. doi:10.1177/0951692890002004001</li>\n<li>O’Gorman, Hubert J., 1975, “Pluralistic Ignorance and\nWhite Estimates of White Support for Racial Segregation”,\n<em>Public Opinion Quarterly</em>, 39(3): 313–330.\ndoi:10.1086/268231</li>\n<li>Olson, Mancur, 1965 [1971], <em>The Logic of Collective Action:\nPublic Goods and the Theory of Groups</em>, revised edition,\nCambridge, MA: Harvard University Press.</li>\n<li>Ostrom, Elinor, 2000, “Collective Action and The Evolution\nof Social Norms”, <em>Journal of Economic Perspectives</em>,\n14(3): 137–158. doi:10.1257/jep.14.3.137</li>\n<li>Pagel, Elaine, 2003, <em>Beyond Belief: The Secret Gospel of\nThomas</em>, New York: Vintage Books.</li>\n<li>Parsons, Talcott, 1951, <em>The Social System</em>, New York:\nRoutledge.</li>\n<li>–––, 1937 [1968], <em>The Structure of Social\nAction. A Study in Social Theory with Special Reference to a Group of\nRecent European Writers</em>, New York, London: Free Press.</li>\n<li>Parsons, Talcott and Edward A. Shils, 1951, <em>Towards a General\nTheory of Action</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Posner, Eric A., 2000, <em>Law and Social Norms</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Prentice, Deborah A. and Dale T. Miller, 1993, “Pluralistic\nIgnorance and Alcohol Use on Campus: Some Consequences of\nMisperceiving the Social Norm”, <em>Journal of Personality and\nSocial Psychology</em>, 64(2): 243–56.\ndoi:10.1037/0022-3514.64.2.243</li>\n<li>Rabin, Matthew, 1993, “Incorporating Fairness into Game\nTheory and Economics”, <em>American Economic Review</em>, 83(5):\n1281–1302.</li>\n<li>Reuben, Ernesto and Arno Riedl, 2013, “Enforcement of\nContribution Norms in Public Good Games with Heterogeneous\nPopulations”, <em>Games and Economic Behavior</em>, 77(1):\n122–137. doi:10.1016/j.geb.2012.10.001</li>\n<li>Robinson, Claude E., 1932, <em>Straw Votes: A Study of Political\nPrediction</em>, New York: Columbia University Press.</li>\n<li>Rommetveit, Ragnar, 1955, <em>Social Norms and Roles: Explorations\nin the Psychology of Enduring Social Pressures with Empirical\nContributions from Inquiries into Religious Attitudes and Sex Roles of\nAdolescents from Some Districts in Western Norway</em>, Oslo:\nAkedemisk Forlag.</li>\n<li>Schelling, Thomas C., 1960, <em>The Strategy of Conflict</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1978, <em>Micromotives and\nMacrobehavior</em>, New York: Norton.</li>\n<li>Schram, Arthur and Gary Charness, 2015, “Inducing Social\nNorms in Laboratory Allocation Choices”, <em>Management\nScience</em>, 61(7): 1531–1546. doi:10.1287/mnsc.2014.2073</li>\n<li>Scott, John Finley, 1971, <em>Internalization of Norms: A\nSociological Theory of Moral Commitment</em>, Englewood Cliffs, NJ:\nPrentice Hall.</li>\n<li>Sherif, Muzafer, 1936, <em>The Psychology of Social Norms</em>,\nNew York: Harper.</li>\n<li>Skyrms, Brian, 1996, <em>Evolution of the Social Contract</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511806308</li>\n<li>–––, 2004, <em>The Stag Hunt and the Evolution\nof Social Structure</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139165228</li>\n<li>Stigler, George J. and Gary S. Becker, 1977, “De Gustibus\nNon Est Disputandum”, <em>American Economic Review</em>, 67(2):\n76–90.</li>\n<li>Sugden, Robert, 1986 [2004], <em>The Economics of Rights,\nCo-operation and Welfare</em>, second edition, Basingstoke: Palgrave\nMacmillan, 2004.</li>\n<li>–––, 2000, “The Motivating Power of\nExpectations”, in Julian Nida-Rümelin and Wolfgang Spohn\n(eds.), <em>Practical Rationality, Rules, and Structure</em>,\nDordrecht: Kluwer. doi:10.1007/978-94-015-9616-9_7</li>\n<li>Tajfel, Henri, 1973, “The Roots of Prejudice: Cognitive\nAspects”, in <em>Psychology and Race</em>, Peter Watson (ed.),\nChicago: Aldine.</li>\n<li>–––, 1981, <em>Human Groups and Social\nCategories: Studies in Social Psychology</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Taylor, Peter D. and Leo B. Jonker, 1978, “Evolutionary\nStable Strategies and Game Dynamics”, <em>Mathematical\nBiosciences</em>, 40(1–2): 145–156.\ndoi:10.1016/0025-5564(78)90077-9</li>\n<li>Thibaut, John W. and Harold H. Kelley, 1959, <em>The Social\nPsychology of Groups</em>, New York: Wiley.</li>\n<li>Thrasher, John, 2018, “Evaluating bad norms”\n<em>Social Philosophy and Policy,</em> 35(1): 196–216.\ndoi:10.1017/S0265052518000055</li>\n<li>Thrasher, J., &amp; Handfield, T., 2018, “Honor and\nViolence”, <em>Hum Nat</em> 29, 371–389.\ndoi:10.1007/s12110-018-9324-4</li>\n<li>Trivers, Robert L., 1971, “The Evolution of Reciprocal\nAltruism”, <em>Quarterly Review of Biology</em>, 46(1):\n35–57. doi:10.1086/406755</li>\n<li>–––, 1985, <em>Social Evolution</em>, Menlo\nPark, CA: Benjamin/Cummings.</li>\n<li>Turnbull, C. M., 1972, <em>The Mountain People</em>, New York:\nTouchstone.</li>\n<li>Turner, John C., Michael A. Hogg, Penelope J. Oakes, Stephen D.\nReicher, and Margaret S. Wetherell, 1987, <em>Rediscovering the Social\nGroup: A Self-Categorization Theory</em>, Oxford: Blackwell.</li>\n<li>Ullmann-Margalit, Edna, 1977, <em>The Emergence of Norms</em>,\nOxford: Clarendon Press.</li>\n<li>Vanderschraaf, Peter, 1995, “Convention as Correlated\nEquilibrium”, <em>Erkenntnis</em>, 42(1): 65–87.\ndoi:10.1007/BF01666812</li>\n<li>Warner, Lyle G. and Melvin L. DeFleur, 1969, “Attitude as An\nInteractional Concept: Social Constraint and Social Distance as\nIntervening Variables Between Attitudes and Action”,\n<em>American Sociological Review</em>, 34(2): 153–169.\ndoi:10.2307/2092174</li>\n<li>Wicker, Allan W., 1969, “Attitude versus Actions: The\nRelationship of Verbal and Overt Behavioral Responses to Attitude\nObjects”, <em>A Journal of Social Issues</em>, 25(4):\n41–78. doi:10.1111/j.1540-4560.1969.tb00619.x</li>\n<li>Wrong, Dennis H., 1961, “The Oversocialized Conception of\nMan in Modern Sociology”, <em>American Sociological Review</em>,\n26(2): 183–193. doi:10.2307/2089854</li>\n<li>Wuthnow, Robert, 1991, <em>Acts of Compassion: Caring for Others\nand Helping Ourselves</em>, Princeton: Princeton University\nPress.</li>\n<li>Xiao, Erte and Cristina Bicchieri, 2010, “When Equality\nTrumps Reciprocity”, <em>Journal of Economic Psychology</em>,\n31(3): 456–470. doi:10.1016/j.joep.2010.02.001</li>\n<li>Young, H. Peyton, 1993, “The Evolution of\nConventions”, <em>Econometrica</em>, 61(1): 57–84.\ndoi:10.2307/2951778</li>\n<li>–––, 1998a, “Social Norms and Economic\nWelfare”, <em>European Economic Review</em>, 42(3–5):\n821–830. doi:10.1016/S0014-2921(97)00138-4</li>\n<li>–––, 1998b, <em>Individual Strategy and Social\nStructure: An Evolutionary Theory of Institutions</em>, Princeton, NJ:\nPrinceton University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "altruism",
            "belief",
            "common knowledge",
            "convention",
            "evolution",
            "game theory",
            "game theory: evolutionary",
            "morality: and evolutionary biology",
            "normative cognition, psychology of",
            "social institutions"
        ],
        "entry_link": [
            {
                "../altruism/": "altruism"
            },
            {
                "../belief/": "belief"
            },
            {
                "../common-knowledge/": "common knowledge"
            },
            {
                "../convention/": "convention"
            },
            {
                "../evolution/": "evolution"
            },
            {
                "../game-theory/": "game theory"
            },
            {
                "../game-evolutionary/": "game theory: evolutionary"
            },
            {
                "../morality-biology/": "morality: and evolutionary biology"
            },
            {
                "../psychology-normative-cognition/": "normative cognition, psychology of"
            },
            {
                "../social-institutions/": "social institutions"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-norms\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/social-norms/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=social-norms&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/social-norms/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-norms": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/social-norms/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=social-norms&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/social-norms/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Arló-Costa, Horacio and Arthur Paul Pedersen,\n “<a href=\"https://philpapers.org/rec/ARLSNR-2\" target=\"other\">Social Norms, Rational Choice and Belief Change</a>”,\n manuscript, Carnegie Mellon Research Showcase.",
            "Axelrod, Robert, 1992,\n “<a href=\"http://garfield.library.upenn.edu/classics1992/A1992JU49300001.pdf\" target=\"other\">How to Promote Cooperation</a>”,\n <em>Current Contents—Social and Behavioral Sciences</em>, 44:\n10 (November 2, 1992); this is a scan of the version that appeared in\n<em>Current Contents—Arts and Humanities</em>, 23: 16 (November\n9, 1992).",
            "Selected Papers on Social Norms at\n <a href=\"https://econpapers.repec.org/scripts/nep.pf?list=nep-soc\" target=\"other\">EconPapers</a>.",
            "<a href=\"https://en.wikipedia.org/wiki/Social_norm\" target=\"other\">Social Norm</a>,\n entry in <em>Wikipedia</em>."
        ],
        "listed_links": [
            {
                "https://philpapers.org/rec/ARLSNR-2": "Social Norms, Rational Choice and Belief Change"
            },
            {
                "http://garfield.library.upenn.edu/classics1992/A1992JU49300001.pdf": "How to Promote Cooperation"
            },
            {
                "https://econpapers.repec.org/scripts/nep.pf?list=nep-soc": "EconPapers"
            },
            {
                "https://en.wikipedia.org/wiki/Social_norm": "Social Norm"
            }
        ]
    }
}