{
    "url": "theory-bioethics",
    "title": "Theory and Bioethics",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Jennifer Flynn\n<jflynn@mun.ca>",
        "author_links": [
            {
                "https://www.mun.ca/bioethics/faculty/jenniferflynn/": "Jennifer Flynn"
            },
            {
                "mailto:jflynn%40mun%2eca": "jflynn@mun.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://www.mun.ca/bioethics/faculty/jenniferflynn/\" target=\"other\">Jennifer Flynn</a>\n&lt;<a href=\"mailto:jflynn%40mun%2eca\"><em>jflynn<abbr title=\" at \">@</abbr>mun<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Nov 25, 2020"
    ],
    "preamble": "\n\nThe relation between bioethics and moral theory is a complicated one.\nTo start, we have philosophers as major contributors to the field of\nbioethics, and to many philosophers, their discipline is almost by\ndefinition a theoretical one. So when asked to consider the role of\nmoral theorizing in bioethics, a natural position of such philosophers\nis that moral theory has a crucial, if not indispensable, role.\nAt the same time, there are those who call into question the\n“applied ethics” model of bioethics. Roughly, on this\nmodel, one moral theory or other (e.g., utilitarianism, Kantian\ndeontology, virtue theory) is imposed upon the applied ethics problem\nat hand, in the hopes of producing a resolution. Such a model,\naccording to its detractors, overplays the separation of the\ntheoretical from the applied. Still further, there are those such as\nWill Kymlicka (1993 [1996]) who hold that moral theory should not have\na place in the making of public policy on bioethical\n issues.[1]\n\nThis entry starts by addressing the complexities surrounding the very\nnotions of bioethics and moral theory. From there, we explore the\nquestion of what doing applied ethics amounts to. Moving on, the\ndiscussion centers upon the main methodological movements in\nbioethics’ relatively short history: its appeal to high moral\ntheory, the emergence of mid-level approaches to bioethics, and\napproaches to bioethics that attribute a lesser role to theoretical\ntools, or no role at all. Feminist approaches to bioethics are treated\nnext, followed by a look at the significance of moral theory to\nclinical bioethics.\n",
    "toc": [
        {
            "#WhatMoraTheoWhatBioe": "1. What is Moral Theory? What is Bioethics?"
        },
        {
            "#VaryAccoMoraTheo": "1.1 Varying Accounts of Moral Theory"
        },
        {
            "#PursBioe": "1.2 The Pursuits of Bioethics"
        },
        {
            "#WhatNatuApplEthi": "2. What is the Nature of Applied Ethics?"
        },
        {
            "#ProbApplModeApplEthi": "2.1 Problems with the “Applied Model” of Applied Ethics"
        },
        {
            "#ApplEthiDisaTheo": "2.2 Applied Ethics and Disagreement on Theory"
        },
        {
            "#ApplEthiRuleAppl": "2.3 Applied Ethics and Rule Application"
        },
        {
            "#ToulTyraPrin": "2.4 Toulmin on the Tyranny of Principles"
        },
        {
            "#BioeHighMoraTheo": "3. Bioethics and High Moral Theory"
        },
        {
            "#AttrHighTheo": "3.1 The Attractions of High Theory"
        },
        {
            "#ProbBioeConcAppeHighMoraTheo": "3.2 Problems with Bioethics Conceived as An Appeal to High Moral Theory"
        },
        {
            "#MoveMidLeveTheoPrinCentAppr": "4. The Move to Mid-Level Theorizing: a Principles-Centered Approach"
        },
        {
            "#MoveAwayDeduReflEqui": "4.1 A Move Away from Deduction, and Reflective Equilibrium"
        },
        {
            "#CommMora": "4.2 The Common Morality"
        },
        {
            "#CritPrinCentAppr": "4.3 Criticisms of the Principles-Centered Approach"
        },
        {
            "#OtheMethBioe": "5. Other Methods of Bioethics"
        },
        {
            "#Casu": "5.1 Casuistry"
        },
        {
            "#AdvaCasu": "5.1.1 Advantages of casuistry"
        },
        {
            "#CritCasu": "5.1.2 Criticisms of casuistry"
        },
        {
            "#NarrEthi": "5.2 Narrative Ethics"
        },
        {
            "#CritNarrEthi": "5.2.1 Criticisms of Narrative Ethics"
        },
        {
            "#FemiTheoBioe": "6. Feminist Theory and Bioethics"
        },
        {
            "#MoraTheoClinBioe": "7. Moral Theory and Clinical Bioethics"
        },
        {
            "#ModeClinEthiCons": "7.1 Models of Clinical Ethics Consultation"
        },
        {
            "#ClinEthiMoraTheo": "7.2 Clinical Ethics and Moral Theory"
        },
        {
            "#Conc": "8. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Moral Theory? What is Bioethics?\n\nThe question of the relation between moral theory and bioethics is\nmade difficult by a number of factors, not the least of which is the\nabsence of any one account of what constitutes philosophical theory.\nThere are, of course, the standard moral theories of introduction to\nmoral philosophy—consequentialism, deontology, and virtue\nethics. And we also speak of mid-level theories, such as moral\nprinciplism and casuistry, though the extent to which such approaches\nare strictly speaking theoretical is somewhat unsettled. What do we\nmean by moral theory? What characterizes an approach to moral\nphilosophy and bioethics as theoretical? Add to such questions the\nfact that bioethics itself is not a monolithic discipline, and our\ntopic is complicated right from the start.\n1.1 Varying Accounts of Moral Theory\n\nOn some accounts, a theoretical approach to a philosophical issue or\nproblem is defined by intellectual tendencies toward some combination\nof generalization, universality, systemization, abstraction,\nexplicitness, and the capability to generate recommendations. For\ninstance, Martha Nussbaum holds that there are certain necessary and\nsufficient criteria for ethical theory (Nussbaum 2000: 234–236).\nOn her view, ethical theory:\n\nGives recommendations about practical problems;\nShows how to test correctness of beliefs, rules, and\nprinciples;\nSystematizes and extends beliefs;\nHas some degree of abstractness and generality;\nIs universalizable;\nIs explicit.\n\n\nGeneralization, universality, and abstraction are also taken by others\nto be hallmarks of moral theory (Arras 1997: 74; 2003; Louden 1990).\nEven so, some philosophical approaches to moral and bioethical\nquestions that do not satisfy all or even any of the criteria set out\nabove are referred to as theories. For instance, moral particularism,\nwhich aspires neither to the formulation of generalizations nor to\nsystemization\n [2]\n is sometimes referred to as a moral\n theory.[3]\n Further still, one might even hold that beyond the criteria listed\nabove, moral theory employs a certain argumentative mode, with a\ncertain tone and style (Louden 1992: 156; Nussbaum 2000: 239).\n\nThere is more one could say here on agreement and disagreement on what\ncounts as theoretical within philosophy, including something about\nwhat might qualify as an anti-theoretical approach to morality and\nbioethics (Clarke 1987; Clarke & Simpson 1989; Fotion 2014; Louden\n1990). But our main point for the moment is that what counts as moral\ntheory is not perfectly clear, which complicates the question of the\nrelation between moral theory and bioethics. We need not here\nstipulate one definition of what we shall count as a theoretical\napproach to bioethical problems moving forward. Suffice it to say that\nthe question of the relation between theory and bioethics will be\napproached by canvassing various methodological approaches to treating\nproblems and questions in bioethics.\n1.2 The Pursuits of Bioethics\n\nTurning now to what counts as bioethics, the label does not indicate a\nunitary pursuit, what with bioethics’ academic, policy-oriented,\nand clinical instantiations (McMillan 2018: 11–16; Battin 2013:\n2). When it comes to bioethics as an academic or scholarly pursuit,\nthe practical constraints of clinical decision making, and the\ntimelines imposed by commissions, are non-existent, freeing the\nbioethicist of the need to reach closure on a decision or to resolve a\ncomplex issue. As it has been put, for the academic bioethicist and\nher students, it does not matter if you end the seminar more confused\nthan when you started it. It is within this academic domain that the\nrelationship between bioethics and moral theory will be most explicit,\nthe role of moral theory most intently debated, and moral theory\nprobably most welcome.\n\nLooking at policy-oriented bioethics, here the bioethicist assists in\nthe development of policies affecting large numbers of people on\nissues of bioethical relevance (such as the rationing of kidney\ndialysis services, or the availability of medical assistance in\ndying). There are challenges upfront with the bioethicist’s\ninvoking moral theory of any sort in tackling policy challenges as a\nmember of a national commission, say, or as a member of her regional\nhealth authority’s ethics committee, or as a member of any other\nsort of policy-oriented working group. For starters, there is the fact\nthat she is likely to be in the vast minority as a group member with\nphilosophical training. But that aside, there is the further challenge\nof the unlikelihood of agreement amongst working group members on\nwhich moral theory should rule the day or govern the decision at\n stake.[4]\n There is the third category of clinical ethics, a pursuit taking\nplace as health care is practiced on the ground. As we will see in\nmore detail shortly, the relevance of moral theory to clinical ethics\nturns heavily on the operative conception of clinical ethics. In\nparticular, it relies upon our conception of the goals of the clinical\nethics consultation (the main activity of clinical bioethics), and\nupon our conception of the role of the clinical ethics consultant.\n\nWhat constitutes what we call applied ethics is just as fraught a\nquestion as the one of the relationship between theory and bioethics,\nand it implicates our take on that relationship. We now turn to that\nquestion.\n2. What is the Nature of Applied Ethics?\n\nWe have briefly reviewed the variety of tasks and problems to which\nbioethics addresses itself. But we should also briefly examine the\nways in which bioethics, and its broader cousin applied ethics, is and\nhas been conceptualized. Such an examination is important within the\ncontext of this entry in that questions about the nature of applied\nethics are often implicitly questions about the relation between the\ntheoretical and the applied, or between “theory” and\n“practice”. The very term applied ethics suggests that the\ndiscipline involves an application of some sort or other moral theory\nto the practical problem or question at hand. Arthur Caplan writes\nthat many contributors to the field of bioethics take applied ethics\nto involve the application of existing theories and principles to\nmoral problem in medicine (Caplan 1980: 25–26). But what does it\nmean to apply an existing theory to a practical problem? How easily\ncan the distinction between applied ethics and ethical theory be\nsustained? As it turns out, many say that the field of applied ethics\ncannot be what the name would lead us to suppose it is.\n2.1 Problems with the “Applied Model” of Applied Ethics\n\nCaplan argues that there are problems with such a model of applied\nethics (which many call “the applied model”). To start,\nmany moral problems arise within medicine for which moral theories\nhave no answers. The applied model of applied ethics also presumes\nthat those involved in the analysis and solution of a moral problem\ntake it that the nature and description of the problem or quandary is\nnot in dispute, where in reality it is often not clear exactly what is\nthe moral issue at stake (Caplan 1980: 28; 1989; Agich 2001; and\nMagelssen, Pedersen, & Førde 2016). This model also\nimplicitly involves a naïve suggestion, argues Caplan, namely\nthat by dint of expertise in moral theory, the well-trained\nphilosopher can almost immediately solve moral dilemmas in the\nintensive care unit or the emergency department (Caplan 1980: 27).\nMoreover, adherence to such a model of applied ethics forecloses the\nopportunity for medical ethics (or other fields of applied ethics) to\ninform theory construction, as the direction of influence on that\nmodel moves only from theory to the practical.\n2.2 Applied Ethics and Disagreement on Theory\n\nFurther disruption of the application model came shortly afterwards\nfrom both Tom Beauchamp and Alasdair\n MacIntyre.[5]\n Beauchamp challenges the application model of applied ethics, defined\nlargely as above: ethical theory develops general and fundamental\nprinciples, virtues, rules, and the like, and applied ethics treats\nparticular contexts through less general, derived principles, virtues,\nand so on. In a 1984 issue of The Monist dedicated to\n“Ethics and the Modern World”, Beauchamp and MacIntyre\neach probe the relation between moral theory and applied ethics.\nBeauchamp argues for the elimination of the distinction between the\ntwo, citing the lack of significant difference between them in terms\nof philosophical activity or method. Philosophers doing applied ethics\ndo what philosophers have always done, says Beauchamp—they\nanalyze concepts, for instance, and submit to critical scrutiny\nvarious strategies that are used to justify beliefs, policies, and\nactions. The application model also problematically presumes a\nunilateral direction to the flow of ethical knowledge, from moral\ntheory to practical cases and problems. But in fact, says Beauchamp,\nmoral theory has much to learn from practical contexts (Beauchamp\n1984).\n2.3 Applied Ethics and Rule Application\n\nMacIntyre tells us that applied ethics cannot be the sort of activity\nit is commonly supposed to be. He turns our attention to the\ncomplexities surrounding the notion of what it would mean to apply a\nmoral rule. If applied ethics is in fact an application to cases of\nthe rules of morality, we should expect to find that disagreements\nover moral rules reproduce themselves within debates on matters of\npractical ethics. But in a high proportion of cases these theoretical\ndisagreements, of which there are plenty, are not in fact replicated.\nLarge disagreement on what are the rules of morality turn out to be\ncompatible with large agreement within the domain of applied ethics.\nNoting how common such situations are (situations in which clear\ndisagreement exists on what are the rules of morality, while fairly\neasy agreement can be reached on concrete moral issues), MacIntyre\nholds that it cannot be the case that we first and independently\ncomprehend the rules of morality and then secondly enquire as to their\napplication under particular circumstances.\n\nAs MacIntyre has it, no rule exists apart from its application (and he\nadmits that his argument entails the rejection of any conception of\nmoral principles or rules as timeless and ahistorical). Often times,\nhe suggests, it appears as though agreements among a group of decision\nmakers is being reached through rational argumentation, but in fact\noften group members are reopening debates about perennial\nphilosophical questions. This is particularly so in medical ethics,\nMacIntyre tells us. Our common conception of applied ethics does\nindeed rest on a mistake (MacIntyre 1984).\n2.4 Toulmin on the Tyranny of Principles\n\nStephen Toulmin, in his well-known paper “The Tyranny of\nPrinciples”, recounts his experience on the National Commission\nfor the Protection of Human Subjects of Biomedical and Behavioral\nResearch (Toulmin 1981). Agreement amongst members of the commission\nwas relatively easy to reach even on difficult cases, even in the face\nof thoroughgoing moral theoretical disagreement amongst members. His\nmain point in the paper is not to directly address the nature of\napplied ethics, but to argue for a regaining of what he calls the\n“ethics of discretion”, calling into question the role of\nmoral principles. En route, though, he undermines the application\nmodel of applied ethics, through his discussion of how much agreement\non practical problems there can be among theorists of radically\ndifferent stripes. According to Toulmin, this shows us that applied\nethics is not a matter of applying a theory to a problem, in that\nthere can be agreement on how to resolve a practical issue amongst\nthose who strongly disagree on which moral theory ought to prevail.\nAgain, we have an emphasis upon a lack of reproduction of theoretical\ndisagreement in dealing with issues in practical ethics. One might\nquestion whether such agreement on particular cases paired with\ntheoretical disagreement shows that the applied model ought to be\nabandoned. Nevertheless, Toulmin’s experience prompted him to\nwonder what final appeals to principles really achieved.\n\nOne final point for the moment on the disruption of the distinction\nbetween ethical theory and applied ethics: as will be discussed in\nmore detail in\n section 4,\n many would say there recently has been widespread adoption of\nreflective equilibrium as the method of justification in bioethics\n(Arras 2007). One important implication of this adoption is a blurring\nof the distinction between moral theory and applied ethics, what with\nthe fact that on reflective equilibrium, our responses to real cases\ninform our theorizing as much as our theories inform our handling of\ncases.\n\nWe have just seen reasons to think that we cannot neatly separate\nmoral theory and applied ethics. Even so, moral theory in some form\nplays a crucial if not indispensable role in bioethics. We will now\nlook at the relevance of high theory.\n3. Bioethics and High Moral Theory\n\nAs the discipline we now call bioethics emerged in the early 1970s,\nmoral philosophers and political theorists were primed to contribute\nto debates on any number of practical issues in areas such as law,\neconomics, the environment, business, research on human beings, and\nmedical practice. These academics were understandably hopeful both\nthat their knowledge of moral theory would prepare them to apply their\ntheoretical understanding to real-world problems, and that their\nskills in critical analysis would be appreciated. Even today, such\nconfidence in the usefulness of moral theory to the solving of\npractical problems is manifest in the introductions to bioethics\ntextbooks, many of which include discussions of at least the basics of\nconsequentialism, virtue theory, deontology, and so on.\n3.1 The Attractions of High Theory\n\nThe attractions of high theory were, and are, significant, and indeed,\nsuch moral theories have provided the groundwork for many an approach\nto bioethical issues. Examples here include Alan Donagan’s\nKantian-inspired work on informed consent (Donagan 1977), Tristram\nEngelhardt’s libertarian critique of redistribution in health\ncare (Engelhardt 1986 [1996]), and Joseph Fletcher’s utilitarian\napproach to a broad range of issues in bioethics (Fletcher 1974).\n\nWhat might explain such recourse to high moral theory? What are the\nattractions of high moral theory for the bioethicist? Let us consider\nthree important possibilities. First, in bioethics as in everyday\nlife, our routine moral coping skills work often enough. When they do\nnot, though, we need recourse to more structured and systematic moral\nguidance. On these occasions, high moral theory, such as\nconsequentialism and deontology, looks helpful and attractive. Besides\noffering guidance, such theory provides the resources for moral\njustification, especially helpful when we are pressed to explain our\nbioethical or everyday moral decisions. Second, when we appeal to\nmid-level principles (such as the principle of justice or the\nprinciple of beneficence), we sometimes need help in weighing,\nbalancing, and adjudicating between those principles. High moral\ntheory could well provide such help, by providing a form of moral\nstandard. Recall Sidgwick’s argument in support of\nutilitarianism, that it could provide guidance in resolving conflicts\namong ordinary duties that everyday (non-theoretical) moral thinking\ncannot resolve on its own (Sidgwick 1874). In a similar vein, Martha\nNussbaum defends the need for moral theory in part by emphasizing what\nshe takes to be its power in helping us weigh various rules against\neach other in varying circumstances through its setting of a normative\nstandard (Nussbaum 2000). Third, high moral theory can help us achieve\nconsistency in our moral lives, as well as a systematic perspective.\nThere is benefit, the thought goes, to bringing moral theory to bear\nupon various facets of our ordinary and bioethical lives, because of\nthe systematicity and coherence it can provide. Bernard Gert is one\nfor whom such systematization, at least within bioethics, takes\npriority (Gert, Culver, & Clauser 2006).\n3.2 Problems with Bioethics Conceived as An Appeal to High Moral Theory\n\nThe days of bioethics conceived of as high theory were short lived,\nhowever, and the reasons plentiful. For starters, there is the\nquestion of which moral theory should prevail. Even if one has no\nproblem choosing a moral theory in the first place, one is bound to\nhave difficulty in successfully defending that choice of theory\nagainst its alternatives (Magelssen, Pedersen, & Førde\n2016: 27). The intractability of the debates between utilitarians and\ndeontologists, say, should give anyone pause when staking out her\npositions on bioethical matters with the guidance of her preferred\nmoral theory. This is one thing for the academic bioethicist. But it\nis quite another for the clinical ethicist (for instance) to attempt\nto settle the moral matter at hand through recourse to (say)\nKant’s categorical imperative. Not only is she likely to be\nsurrounded by non-philosophers (where recourse to the intricacies of\nsuch high flying moral theory is liable to fall flat), but we must ask\nwhy the public to whom she might be accountable should be subject to\nher preference for Kantianism. The same would hold true for the\nbioethicist working in the public policy arena.\n\nSecond, that challenge aside, there are disagreements within the ranks\nof any given theory. Consider rule versus act utilitarianism, for\ninstance, or disagreement amongst Rawlsians. Third, some cite tensions\nbetween some versions of high theory and democracy. Publicity, many\nhold, ought to be a fundamental norm governing policy making in a\ndemocratic society (Rawls 1971). Requiring such publicity would\npreclude justifications that no one outside an elite class of\nphilosophers can understand. One need not be a theory sceptic, then,\nin order to demote the place of high theory within bioethics; one need\nonly recognize the tension between doing bioethics in a democracy, and\nrarefied moral theory (Bertram 1997; London 2001).\n\nFourth, and this is focused on the usefulness or lack thereof of high\nmoral theory within the clinical ethics context, using theories in the\nprescribed way may be very demanding for the clinical ethicist without\nhigh level philosophical training. Furthermore, the comprehensiveness\nof the justifications promised by high moral theory may be unnecessary\nwithin that context (Magelssen,, Pedersen, & Førde 2016:\n27). Fifth, and reminiscent of Caplan’s problems with the\napplied model of applied ethics earlier discussed, it is doubtful that\nany high-level philosophical theory can generate straightforward\nanswers to complicated applied problems. Norman Daniels, whose work on\njustice and access to health care was inspired by Rawls’ theory\nof justice, came to admit that philosophical theory is insufficiently\nfine-grained for actual policy making, and that it needs to be\ncomplemented by justly structured political deliberation (Daniels\n1996: 144–175; 2007: ch. 4). The general thought here is that\nhigh philosophical theory is ill-equipped to deal with practical\ndecision making on the concrete level (Gutmann & Thompson 1998).\nAfter all, one’s preferred moral theory could well, for\ninstance, endorse several possible policy options, leaving decision\nmakers wanting for further guidance.\n\nIn sum, bioethics as conceived of as an appeal to high moral theory\nhas been found to have significant limitations, despite its initial\npromise. We now to what appears to be a more promising approach.\n4. The Move to Mid-Level Theorizing: a Principles-Centered Approach\n\nThe move to what is often referred to as mid-level theorizing was\n(partly) a result of the challenges with high theory just discussed,\nand manifested most prominently by the 1979 publication of Tom\nBeauchamp and James Childress’ influential Principles\nof Biomedical Ethics (PBE). The approach set out in that book,\nand its revised versions appearing in the book’s subsequent\neditions, feature mid-level moral norms, which take the form of four\nmoral\n principles.[6]\n Beauchamp and Childress’ four principles are:\n\nthe principle of autonomy (the value of self-direction regarding\none’s life and choices),\nthe principle of beneficence (the value of enhancing the welfare\nof others),\nthe principle of nonmaleficence (the value of avoiding imposing\nharm on others), and\nthe principle of justice (the value of according each person her\ndue) (Beauchamp & Childress 2019a; Arras 2017: 5).\n\n\nComing on the heels of Joseph Fletcher and Paul Ramsey’s early\nwork in what we now call bioethics—both Fletcher and Ramsey were\nmoral theologians, whose work, while very different from one\nanother’s, was based on Christian moral theology—Beauchamp\nand Childress offered the promise of a moral framework that could\nappeal to a pluralist and secular\n society.[7]\n Beauchamp and Childress have different theoretical starting points,\nwith Beauchamp describing himself as a rule-utilitarian, and Childress\na Christian deontologist (Arras 2017: 3; Beauchamp & Childress\n1979: 40: 2019b: 9). This underlines the approach as one that refrains\nfrom promoting a single theory over all others, and as one that\nrequires no underlying theoretical or metaphysical commitments for its\nuptake.\n4.1 A Move Away from Deduction, and Reflective Equilibrium\n\nBeauchamp and Childress’ approach has evolved since the\nbook’s first edition, and one important aspect of this evolution\nis the move away from deductive reasoning, or (in other words) away\nfrom a “top down” application of principles to cases.\nTheir initial take on the relation between moral theory, principles\nand cases was that\n\n\ntheory justified principles, that principles justified moral rules,\nand that rules justified moral judgments in particular cases. (Arras\n2017: 11)\n\n\nThis, at least, was the impression given by a diagram appearing in the\nfirst edition of the book (Beauchamp & Childress 1979: 5), which\nmany took to endorse such a top down model. The approach was met with\nresistance, with those in favor of case-based reasoning (also known as\ncasuistry) objecting to what at least appeared to be a unidirectional\nmovement from principles to cases. Intuitive, case-based judgments\nseemed to be left out of the picture, and the possibility of a\ndialectical relationship between principles and our responses to cases\nignored. In fact, and as a result of an evolution of their approach,\nBeauchamp and Childress now fully ascribe to this position on the\nreciprocal relationship between our responses to cases and moral\nprinciples. This is evidenced by their current commitment to\nreflective equilibrium as the methodology of bioethics. Briefly,\nreflective equilibrium is a process by which our considered responses\nto actual cases influence our moral principles, and those\nimproved-upon principles then provide enhanced guidance for our\nresponse to further cases. This is a way of doing moral philosophy\noriginally formulated by Rawls (Rawls 1971: 48–51; Daniels 1979;\nArras 2007: 47). Cases and principles work in tandem, then, as opposed\nto moral principles being applied deductively to cases. A distinction\nis made between narrow and wide reflective equilibrium. Narrow\nreflective equilibrium involves interplay between our responses (or\nintuitions) about cases and the moral principles used to structure\nsuch intuitions, as explained above, where wide reflective equilibrium\nbrings in additional moral and social theories. Beauchamp and\nChildress endorse wide reflective equilibrium (Arras 2017: 182).\n\nThat Beauchamp and Childress take (wide) reflective equilibrium to be\nsuch a crucial component of their approach is an important aspect of\ntheir approach as it currently stands. As their view has evolved over\nsubsequent editions of PBE, reflective equilibrium has grown to have a\nmore and more prominent role. An important result of this embrace of\nreflective equilibrium is that, paired with Beauchamp and\nChildress’ appeal to the common morality, we have a hybrid\napproach to justification, hybrid in the sense of embracing both\ncoherentism and foundationalism. Reflective equilibrium is the source\nof coherentism, with the appeal to the common morality meant to\nprovide a foundation. Before moving on to a closer look at the notion\nof the common morality, we should note that this hybrid approach\ndiffers from accounts of reflective equilibrium we might find in\npolitical theory, for example, and in other areas of practical ethics.\nThose more standard accounts involve achieving moral justification by\nbringing the various elements of our moral reflection into contact\nwith one another, with none of these elements regarded as foundational\nand all of them regarded as open to revision. By contrast, Beauchamp\nand Childress accord foundational status to the common morality, and\nit is the common morality that underwrites their four principles.\n4.2 The Common Morality\n\nSince the third edition of PBE, the source of the four principles has\nbeen not high theory but the common morality. For Beauchamp and\nChildress, the common morality is what they take to be a universal\nmorality, one to which all morally serious persons are committed\n(Beauchamp & Childress 2019b). The content of the common morality\nis dictated by the primary objectives of morality, which include, for\nexample, the amelioration of human misery. It encompasses certain\nrules of obligation (tell the truth, keep promises), and endorses\ncertain standards of moral character, such as honesty and integrity\n(Arras 2017: 21–3).\n\nImportantly, this common morality is historicist, in that its\nauthority is established historically, through the success of its\nrelated norms in advancing human flourishing across time and place.\nHowever, unlike many historicist accounts, the common morality is not\nrelativist, as its norms are to be applied universally. Beauchamp and\nChildress accord the common morality a special place within their\napproach, a place shielded from the jostling involved in the quest for\ncoherence through wide reflective equilibrium. The common morality is\nthus the foundationalist aspect of their account. Moral conclusions,\nthen, are justified through both coherence (via the method of\nreflective equilibrium), and through foundationalism, being connected\nto the principles of the common morality (Arras 2017: 23; Beauchamp\n& Childress 2019b: 11).\n4.3 Criticisms of the Principles-Centered Approach\n\nThere is a pluralistic element to Beauchamp and Childress’\napproach, which is manifested, in part, by the fact that the approach\navoids a single overarching principle in favor of the short list of\nfour moral principles. This has lead some to criticize Beauchamp and\nChildress’ approach for an alleged lack of systematicity—a\nfatal flaw, according to some, in any philosophical theory (Gert,\nCulver, & Clauser 2006). Such critics claim that without a clear\nprioritizing of principles, Beauchamp and Childress’\nprinciples-centered approach lacks rigor and leaves too much room for\nintuitive judgments in cases where principles conflict. Beauchamp and\nChildress respond, first, by rejecting the very idea that they are\noffering a philosophical theory, rather than a framework or practical\nguide. But perhaps more importantly, they doubt that any priority\nranking of their principles would stand the test of time (Arras 2017:\n6–9).\n\nA fairly recent criticism comes from John McMillan, according to whom\nBeauchamp and Childress’ approach stifles careful reflection\nabout real issues. McMillan claims that principle-centered methods\ncannot lead to the formulation of what he calls “reasoned\nconvictions about moral problems”, and writes that the four\nprinciples approach hinders bringing moral reason to bear upon\npractical questions. This is because, as McMillan has it, newcomers to\nbioethics will subsume whatever issues are under consideration under\none of the four principles, and then rule that the principle of\nautonomy should trump the other three principles. While recognizing\nthat such a method is not what Beauchamp and Childress intended,\nMcMillan writes that it is in fact the way the four principles\napproach is typically employed (McMillan 2018: 51–53).\n\nTwo interesting criticisms of Beauchamp and Childress’ latest\nmoves come from the late John Arras. Arras questions the plausibility\nof Beauchamp and Childress’ hybrid account, specifically the\naccount’s reliance upon the common morality as a foundation.\nArras asks why Beauchamp and Childress distinguish the norms of the\ncommon morality from (what John Rawls called) our considered moral\njudgments, which are themselves revisable. Arras recognizes that\nBeauchamp and Childress might motivate their appeal to a foundation on\nthe ground that coherence alone cannot secure moral truth. In that\ncase, though, Arras wonders how much additional justificatory\nadvantage is leveraged by appealing to the foundational common\nmorality, as reflective equilibrium itself is maximally inclusive of\nall pieces of the moral picture (including, presumably, the common\nmorality’s norms). The problem, as Arras has it, is the\nconception of the common morality as being in its own moral sphere,\nremoved from reflective equilibrium’s dialectic. Arras is\nskeptical that the common morality is in fact untouched by the\nvicissitudes of time and the dialectics of reflective equilibrium\n(Arras 2017: 24–26).\n\nA second criticism from Arras deals with Beauchamp and\nChildress’ embrace of wide reflective equilibrium. According to\nArras, it is difficult to comprehend how moral principles can retain\ntheir priority in conceptual analysis in the face of this endorsement\nof wide reflective equilibrium (Arras 2017: 182–3). Arras asks\nus to recall that within wide reflective equilibrium, no single\ncluster of moral considerations (e.g., considered case judgments,\nbackground theories, moral principles) is privileged. What matters in\nreflective equilibrium’s revising process, in fact, is our level\nof commitment to those considerations, rather than the form of the\ncommitments themselves (Scanlon 1992; DePaul 1993: 57). Thus, our\nbeliefs about principles, just like our beliefs in background theories\nand considered case judgments, are always subject to revision. The\nprinciples-centered approach seems to have sacrificed its\nmethodological distinctiveness, so Arras’ criticism goes, given\nhow principles appear to have been robbed of their conceptual\npriority.\n\nFinally, Beauchamp and Childress themselves recently acknowledge two\nmisunderstandings of their four principles framework. The first\nmisunderstanding is that the framework represents American\nindividualism, with the principle of autonomy taking priority. Their\nresponse is, first, to contest any connection between American\nindividualism and a respect for autonomy. Further, they emphasize that\ntheir framework’s principles are all only prima facie\nbinding. The second misunderstanding is that the framework downplays\nthe virtues. It has been argued that medical ethics should be\nunderwritten by virtue-based ethics rather than by principle-based\nethics, and that that approach has a better chance of restoring\nhumanity to health care (de Zulueta 2015). Here, Beauchamp and\nChildress point to various discussions of virtue theory and moral\ncharacter appearing in various editions of PBE, including a discussion\nin the eighth edition of how virtues and principles might work\ntogether in certain practical scenarios (Beauchamp & Childress\n2019b: 11).\n5. Other Methods of Bioethics\n5.1 Casuistry\n\nThere are other approaches to bioethics that embody alternatives to\nhigh theory. The first, casuistry, can in some sense be understood as\na critical response to early versions of Beauchamp and\nChildress’ four principles approach. Recall a certain response\nto at least early versions of Beauchamp and Childress’ approach,\nnamely that that approach was too abstract and that its alleged\ndeductivism was objectionable. Advocates of casuistry, or case-based\nreasoning, objected to what they at least took to be the\nunidirectional “downward” movement from principles to\ncases (Arras 2017: 11). Instead, they argued for a more “bottom\nup” approach, which would see actual cases, rather than any one\nmoral theory, as the starting point, and would conceive of moral\nprinciples as in fact emerging from our consideration of cases.\n\nWe often speak of casuistry full-stop, and when we do we generally\nhave in mind an approach to ethics that emphasizes analogical\nreasoning with concrete actual cases (the one before us, and\nrelevantly similar past cases). When one encounters a case, one\nharkens back to a relevantly similar case from the past, recalls how\none responded in that case, and “applies” that reasoning\nto the case before one. We should, however, recognize the distinction\nbetween two versions of the approach. To start, there is casuistry\nunderstood simply as the practice of addressing particular cases,\ntreating them through the application of (abstract) principles.\nUnderstood as such, casuistry would seem to be rightly viewed as a\nlogical complement to approaches to bioethics that take moral\nprinciples to be morally binding (Arras 2017: 46). Casuists here hold\nthat principles can have an action-guiding or normative force that is\nnot reducible to our responses to cases, and that the moral knowledge\nrepresented by such principles is not reducible to responses to cases\n(Jonsen 1995). Note that when defined in this way, differences between\nthis moderate version of casuistry and a more traditional top-down\napplication of moral principles to cases might be difficult to\npinpoint.\n\nA more radical interpretation of casuistry, though, has a different\nstory to tell about the derivation of moral principles. Where on the\nmoderate version we approach cases with our moral principles already\nestablished, on this more radical version, principles develop through\nour analysis of actual cases (Arras 2017: 47). So the two different\nversions adopt different pictures of the source of our moral\nknowledge. On the radical version, it is at the level of the concrete\ncase, rather than at the level of theory, where we find the greatest\nconfidence in our moral judgments. The claim here is that moral\nprinciples are, at base, merely formalizations of our intuitive\nresponses to cases, without independent normative force (Toulmin\n1981).\n5.1.1 Advantages of casuistry\n\nAccording to its proponents, casuistry as an approach to bioethics has\nspecific advantages. One is its potential to offer chances of reaching\nagreement amongst those of different theoretical commitments,\nrendering it particularly well-suited for decision making in a\npluralistic society (Sunstein 1996). Turning to the more applied\nmedical context, casuistry is well-suited to use by health care\nworkers, whose orientation is already case-focused, and whose time for\nand interest in moral theory is likely quite limited. When it comes to\nteaching bioethics, casuistry would call for the use of richly\ndetailed case studies, which many whose teaching responsibilities\ninclude teaching those in health care would count as a strength (Arras\n2017: 55–57).\n5.1.2 Criticisms of casuistry\n\nDespite these sorts of advantages, casuistry has been met with\ncriticism. One is that the approach seems to assume a\nstraightforwardness when it comes to deciding what counts as a case.\nHowever, as some would have it, deciding what counts as a case (or\nnot) might well be underwritten by the bioethicist’s picture of\nthe sorts of problems worthy (or unworthy) of appearance on the moral\nagenda (O’Neill 1988). It has been argued that that agenda is\noverly narrow and sculpted by the interests of, for example, the\nmedical profession, and a male outlook (Carse 1991). A related but\ndistinct point concerns what counts as an adequate description of the\nissues at play in a case. Casuistry, to its detriment, seems silent on\nthis matter. Some argue that a strike against the radical version of\ncasuistry is its recourse to analogical reasoning. Such recourse, so\nthe thought goes, fails to properly recognize that such reasoning is\nnot self-standing. Analogical reasoning would seem to need\npre-established principles to give it direction, and radical casuistry\nrejects such principles. Moderate casuistry, which does use principles\nor generalizations to provide some structure in identifying what is\nmorally relevant to a case and across cases (Jonsen 1995) would not be\nsubject to this criticism.\n\nAnother concern is that given its disregard for theoretically-derived\nprinciples, radical casuistry may amount to no more than a refinement\nof our intuitive responses to cases. It might be thought to be morally\nconservative, ill-equipped for social critique, with the casuist as\nmere expositor of pre-ordained moral norms (Arras 2017: 60–67).\nFinally, the approach seems to require pre-established agreement on\nfundamental values in order to reach conclusions, agreement that may\nwell be lacking in pluralistic modern society.\n5.2 Narrative Ethics\n\nA further alternative approach to ethics in general and bioethics in\nparticular is narrative ethics. According to many commentators, it\nemerged in response to a so-called “theory-driven”\napproach to bioethics, an approach that prioritizes the Enlightenment\nideas of objectivity and universality (Arras 1997: 65). Put\ndifferently, narrative ethics emerged as a response to an impartialist\nethics, one working on the assumption that ethics is mainly a matter\nof “right conduct among strangers”. According to Hilde\nLindemann Nelson, two proposals on which narrative approaches to\nethics are based are that moral principles are not lawlike but are\nmodifiable in light of context (presumably by being made more\nspecific, or by being treated as defeasible), and that the particulars\nof a situation “either naturally take a narrative form, or must\nbe given a narrative structure if they are to have moral\nmeaning” (Lindemann Nelson 1997a: viii–ix).\n\nThough some will say narrative ethics is somewhat difficult to pin\ndown as a method, we can think of it as an approach to ethics that\nemphasizes storytelling, the importance of the voice and perspective\nof the storyteller and/or patient, and a literary sensibility on the\nbioethicist’s part. Possibilities have been proposed as to what\na narrative approach to ethics might look like, suggestions as to the\nsorts of activities in which we might engage when we adopt a narrative\napproach to bioethics. These include i) simply reading stories (which\nsharpens one’s moral sensibilities) (Nussbaum, 1992, 1995), ii)\ntelling stories (which is a way of making moral sense of an\nexperience), iii) comparing stories (which brings to mind the work of\nthe casuists), iv) conducting literary analysis in some form or other,\nand v) invoking stories (which we do when we introduce bioethics case\nstudies) (Lindemann Nelson 1997a: x–xii).\n\nAccounts vary of how narrative ethics actually functions as a tool of\nethical analysis. A first option is that a narrative approach acts as\na supplement to moral principles rather than as a replacement of them.\nOn this version of narrative ethics, we are looking at a way of doing\nbioethics that requires sensitive attention to so-called\n“narrative elements” of human experience, such as stories\ntold by patients, caregivers, and family members. There is no thought\nof doing away with a bioethics driven by theories and principles, just\na call to use those tools with a sensitive appreciation of the\nfirst-person accounts of others (Charon 1994). Another way of thinking\nabout narrative as a supplement to principles is to consider the way\nin which principles and cases share a dialectical relationship within\nthe context of reflective equilibrium. Here, the cases in response to\nwhich we develop considered judgments are themselves narratives. So\nagain, this conception is accommodating of moral theory, as moral\ntheorizing and stories are mutually interdependent.\n\nA second option has a narrative approach emphasizing the importance to\nethics of history and culture over a more universalist rationality.\nThis version of narrative ethics is sometimes known as historical\nnarrative. Here, right action is endorsed by appeal to the traditions,\nnorms, and traditional stories of a particular social group. Recourse\nis also made to one’s social role, and the foundational\nnarrative underlying that role (think of the physician’s social\nrole in Western culture as shaped by the Hippocratic Oath) (MacIntyre\n1981; Burrell & Hauerwas, 1977).\n\nA third option sees a narrative approach acting as a total substitute\nfor the process of moral justification (Arras 1997: 67– 78), and\nas a replacement of theory-driven or principle-centered bioethics. On\nthis option, which some associate with postmodernism, the emphasis is\nupon continual conversation between traditions and narratives. No one\nview (tradition or narrative) can be justified over others through\nreference to a theory of human nature, of history, and so on. The\nultimate goal here then is not the pursuit of justification for\none’s view, but the keeping open of the “moral\nspace” for continuing conversation between rival views (Rorty\n1989). A related aspect of this option is the claim that those who\nsuffer should tell their own story, without risk of being dominated\nand objectified by the case summaries typical of modern medicine\n(Frank 1995). While quite specific in their vision of how narrative\nethics might supplement or replace a more standardly theory-driven or\nprinciples-centered approach to bioethics, none of these versions seem\nto identify a unique framework for moral reasoning (in the way that,\nfor example, utilitarianism or deontology do).\n5.2.1 Criticisms of Narrative Ethics\n\nQuestions have been raised about the viability of a narrative\napproach. A general concern is that how an emphasis on narrative\nrelates to ethics in general. There is also question about how a\nnarrative approach reaches conclusions about what we are supposed to\ndo.\n\nInsofar as two central tasks of bioethics are to pass judgments on\nactions, policies, and character, and to morally justify actions,\ndecisions, and policies (or to show that justification is not\npossible), it is not clear how narrative ethics can satisfy the aims\nof bioethics, or so the concern goes. What is the relationship between\nnarrative and moral justification? What is the connection between\ntelling a story, say, and the moral decency of a particular action,\npolicy, or character?\n\nMore specific concerns about the approach track the version of\nnarrative ethics under consideration. For instance, on the historical\nnarrative picture (the second option above), some argue there is the\nrisk of falling back into either a version of ethics at least somewhat\nguided by principles, or finding oneself having to sort through\nincommensurable narratives with nothing to decide between them. A\nworry about the third option (the version on which narrative acts as a\nsubstitute for moral justification) is the threat of an objectionable\nsubjectivism, brought on by the possibility of mistaking the\nnarrator’s story for ethical truth. A related criticism is that\nthis version of narrative ethics seems to prioritize individual\ncoherence over the passing of moral judgment. Some stories, so the\nthought goes, may well be internally coherent, while at the same time\nbeing morally questionable (Arras 1997: 81–83).\n6. Feminist Theory and Bioethics\n\nAnother distinctive approach to bioethics employs the insights of\nfeminist ethics. Feminist approaches to bioethics offer a framework\nfor approaching bioethics at least in the sense of developing and\nadhering to a certain set of theoretical commitments. Some of those\ncommitments address forms of moral reasoning, some address substantive\ncommitments about how to bring about a more just social order, and\nsome address questions about which perspective should take priority in\nthe analysis of a bioethical issue. Some contend that bioethics has\nlargely ignored work in feminist ethics more broadly, making it all\nthe more crucial that a feminist approach to bioethics act as a\ncorrective to various trends (such as an inattentiveness to social\ncontext, and an emphasis on liberal individualism) (Wolf\n1996a). Suggestions abound as to how a feminist approach can, and\nin fact does, do that.\n\nTo start, a feminist approach can pay special attention to the\nexperiences of women. Further, it can subject to critical scrutiny the\nemployment of the concept of a common morality, a concept which\nallegedly entrenches bioethics as a conversation amongst experts.\nBioethics as such a conversation excludes alternative viewpoints,\nincluding the viewpoints of laypeople, and of those on the margins. A\nfeminist approach might invoke standpoint theory, which would draw\nupon the insights of the most disadvantaged in society. Finally, a\nfeminist theoretical approach could demand attention to lived\nexperience, turning the emphasis away from the abstract theorizing of\nnon-feminist moral philosophy and bioethics (Wolf 1996a).\n\nTwo further benefits of a feminist approach to bioethics have been set\nout, apart from how it might directly correct for the effects of a\nmasculinist moral philosophy and bioethics. First, a feminist approach\nboth attunes us to the effects of androcentric reasoning in the\nanalysis of bioethical issues, and mitigates those effects. Second, it\ndraws our attention to the gendered nature of many concepts key to\nbioethical analysis. For instance, in looking at the concepts of\nreason and emotion, a feminist approach helps us to see that the\nconcepts themselves seem partly to be gendered concepts. Reason is, or\nat least traditionally has been, associated with the male, and emotion\nwith the female. The same holds true with the distinction between the\npublic and private spheres, with the public domain belonging to men,\nthe private the women’s realm. But what’s more, we see\nthat that which is associated with woman (emotion, for example) tends\nto be undervalued. As Margaret Little lays it out, traditional moral\nepistemology takes reason, and not emotion, to be critical to moral\nunderstanding. It is also important to notice the dualistic nature of\nthe picture presented above. Just as men and women have traditionally\noccupied different spheres, so too have gendered concepts occupied\nfixed places on either side of a divide. The domestic sphere, for\ninstance, is taken to have nothing instructive to offer the world of\neconomic or political relations, or bioethics (Little 1996).\n\nWe can see these sorts of commitments played out in Susan\nSherwin’s approach to the abortion question. According to her, a\nrecognition of gender and sexual politics, and of women’s\nvulnerability in general and to sexual coercion in particular, are on\nher view crucial aspects of a feminist approach. Further, a feminist\napproach takes as central the moral prerogative of the women\nconcerned, rather than focusing on such questions as fetal moral\nstatus, or on the task of formulating a set of general rules as to\nwhen abortion is or is not morally justified. In keeping with this, a\nfeminist approach denies the possibility of a gender-neutral account\nof pregnancy, or of abortion decisions. From a feminist perspective,\nthe most morally salient feature of pregnancy\n\n\nis that it takes place in women’s bodies and has\nprofound effects on women’s lives (Sherwin 1992:\n363).\n\n\nWhen we look at feminist treatments of physician-assisted dying (PAS),\nwe again see certain kinds of theoretical commitments come to the\nfore. For instance, an adherence to the feminist care perspective\nleads Leslie Bender to support PAS (Bender 1992). By contrast, Susan\nM. Wolf’s application of a feminist approach as manifest by an\nemphasis upon the significance of gender leads her to conclude that\nPAS should not be legitimized. Pointing to the insidiousness of\ncertain familiar images—images of feminine self-sacrifice, for\ninstance—as well as to early prominent cases of\nphysician-assisted dying and euthanasia in which the physician was\nmale, the patient female, Wolf warns us of the dangers of the dynamic\nbetween the “powerful expert physician and the woman\nsurrendering to his care” (Wolf 1996b: 293).\n\nIn thinking about feminist approaches to bioethics in connection to\nthe relation between theory and bioethics, it is not a uniform\napproach, seeing as its proponents will not always adhere to the same\nset of commitments. (For example, in her work referenced above Bender\nadheres to a care-oriented thinking, where other feminist bioethicists\nwill be more representative of liberal feminism.) A feminist approach\nis theoretical at least in its adherence to certain (feminist\nintellectual) commitments, even if there is not agreement across the\nboard as to what those should be. Overall, feminist approaches to\nbioethics have made a significant impact and have changed the course\nof the conversation in bioethics, even if those approaches are\nsomewhat varied and represent a theoretical approach to bioethics in\nless strictly defined a way than other approaches might. The preceding\ndiscussion focuses upon scholarly contributions; feminist scholars\nhave also addressed clinical ethics (Sherwin & Baylis 2003). It is\nto the clinical realm, and moral theory’s role there, that we\nnow turn.\n7. Moral Theory and Clinical Bioethics\n\nThere are two main areas of discussion within clinical ethics that\nrelate to the relevance of moral theory to clinical bioethics. The\nfirst concerns what is the appropriate model for clinical ethics\nconsultation. This has implicit consequences for the role of moral\ntheory. The second directly examines whether clinical ethics\nconsultations should rely upon moral theory.\n7.1 Models of Clinical Ethics Consultation\n\nThe American Society for Bioethics and Humanities (ASBH) sets out\nthree possible models of clinical ethics consultation, endorsing one\nof them. Each model implicitly involves a picture of the role, or lack\nthereof, of moral theory. On the pure consensus model, the sole goal\nof ethics consultation is to forge agreement among those involved in\nthe consult (ASBH 2011: 7). It would seem that there is no role for\nmoral theory on this approach to clinical consultation, as mediation\nis the sole objective, with no eye held toward whether the consensus\nreached is morally justified through appeal to moral norms, accepted\nvalues, or moral theory. This model is generally taken to involve too\nweak a picture of the aims of clinical ethics consultation, and too\nminimal a picture of the clinical ethicist’s expertise and role.\nOn the second model, the authoritarian model, the clinical ethicist\nis, by contrast, the primary moral decision maker. This model is\ngenerally taken to involve an overblown picture of the clinical\nethicist’s authority and abilities, and of the infallibility of\nher perspective. The major downfall of this model, according to the\nASBH, is that the clinical ethicist disregards the decision-making\nauthority of others, such as a patient’s family and the health\ncare team. Here again, moral theory has no explicit role, though it\ndoes seem possible and even likely that the clinical ethicist, in\nmaking her unilateral decision, invokes some moral theory or other in\ndoing so.\n\nThe third model, the ethics facilitation approach, is the approach\nendorsed by the ASBH, and there is general consensus in the field that\nthis is the best model for clinical ethics consultation. Here, the\nconsultant helps to make clear the moral issues at play, aids in\ncommunication, integrates the viewpoints of relevant stakeholders\n(ASBH 2011: 7). Importantly for the current discussion, this approach\ninvolves two main parts: identifying and analyzing of what is the\nmoral issue at stake, and facilitating of a principled ethical\nresolution. This second task is of particular interest to us here,\nbecause one would think that the building of such a resolution would\ninvolve looking to moral theory of some type or other, in addition to\nsimply consulting the ethics literature. How else will one adjudicate\nwhether the resolution falls within clearly accepted ethical\nprinciples? After all, the clinical ethicist is tasked not only with\nfacilitating a resolution, but with suggesting a range of ethically\nacceptable options and providing a rationale for each option. In\nspecifying an acceptable range of possible options, an ethics\nconsultant will draw on a knowledge of relevant institutional\npolicies, laws, the scholarly literature, and presumably also of moral\ntheory.\n7.2 Clinical Ethics and Moral Theory\n\nTurning to the second area of discussion, we have a more explicit look\nat the role of moral theory in clinical ethics consultation. Four\nimportant roles for moral theory in clinical ethics consultation have\nbeen suggested:\n\naiding in the initial awareness and identification of the moral\nchallenges;\nassisting in the analysis of moral challenges;\ncontributing to a sound process and dialogue;\ninspiring an attitude of reflexivity and interpretation\n(Magelssen, Pedersen, & Førde 2016, 27–31).\n\n\nThe advantages of a clinical ethicist’s being familiar with\nmoral theory have also been discussed. There is some advantage not\njust in using a moral theory to help one analyze and formulate\narguments, but also in considering the variety of perspectives and\nquestions made perspicuous by various ethical theories, and the issues\nthey illuminate. As well, when it comes to the consistency of a\nclinical ethicist’s own argumentation, familiarity with moral\ntheory will help clinical ethicists spot weaknesses in their own\narguments or in those of others.\n\nHowever, matters are not quite so simple. To start, it is possible for\nthose with no training in moral philosophy to have a solid handle on\nthe moral dilemma with which they are dealing. And at the same time,\nsome say, having a philosopher, one who is an expert in moral theory,\nas a clinical ethicist does not guarantee that the ethics consult will\nbe of high quality. Knowledge of moral theory within the clinical\nethics realm is not always clearly helpful, and its possible benefits\nare not without accompanying drawbacks. First, if used too strictly,\nand adhered to too inflexibly, moral theories can hamper moral\nimagination and intuition, and obscure access to the insights of, for\nexample, common morality. Second, those in command of a wide range of\nmoral theories might be tempted to draw upon the moral theory that\nactually justifies a course of action already preferred or even\nsettled upon, rather than use what is deemed in advance to be the best\nmoral theory to work through what is the justifiable course of action\n(or what are the best action options). Third, moral theories can\nmislead, by, for instance, being used to frame cases in ways that\nemphasize irrelevancies. And fourth, without quite advanced knowledge\nand skill, ethical theories may easily be misunderstood and used\nimproperly. An example here would be taking Kantian moral theory to\nmandate no person ever being treated as a means\n(Magelssen, Pedersen, & Førde 2016). The message here\nis that knowledge of moral theory can sometimes actually be an\nimpediment to good clinical ethics.\n\nOverall, moral theory has a role to play in clinical ethics, at least\nif we accept the goals of ethics consultation as assumed by the\ngenerally accepted model of ethics consultation. The more explicit\nconversation in this area recognizes the advantages the use of moral\ntheory offers clinical ethics and the consultation process. However,\nthe discussion in the literature also cautions against a wholesale\nendorsement of the notion that those working in clinical ethics are\nalways better for having an in-depth knowledge of moral theory.\n8. Conclusion\n\nWhat is the relation between moral theory and bioethics? There is no\nstraightforward answer to this question. So much depends upon whether\nwe consider bioethics in its academic, clinical, or policy-oriented\ninstantiations. And further, there is wide variance in what we have in\nmind when we talk about moral theory. Besides this, the very\ndistinction between moral theory, on the hand, and the problems and\nissues to be addressed in the practical realm, on the other, has been\ncalled into serious question. Still and all, it is difficult to\nimagine bioethics (in any form) in the total absence of moral theory.\nEspecially if modestly conceived as a set of substantive organizing\nassumptions about morality, and a commitment to a certain approach to\nmoral reasoning, it is difficult to view moral theory as anything\nother than indispensable to bioethics.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Agich, George J., 2001, “The Question of Method in Ethics\nConsultation”, <em>American Journal of Bioethics</em>, 1(4):\n31–41. doi:10.1162/152651601317139360",
                "American Society for Bioethics and Humanities’ Core\nCompetencies Update Task Force [ASBH], 2011, <em>Core Competencies for\nHealthcare Ethics Consultation</em>, 2<sup>nd</sup> edition, Chicago,\nIL: American Society for Bioethics and Humanities.",
                "Archard, David and Kasper Lippert-Rasmussen, 2013, “Applied\nEthics”, in <em>The International Encyclopedia of Ethics</em>,\nHugh LaFollette (ed.), Oxford: Blackwell.\ndoi:10.1002/9781444367072.wbiee693",
                "Arras, John D., 1997, “Nice Story, But So What? Narrative\nand Justification in Ethics”, in Lindemann Nelson 1997b:\n65–88.",
                "–––, 2003, “The Owl and the Caduceus: Does\nBioethics Need Philosophy?”, in <em>The Nature and Prospects of\nBioethics: Interdisciplinary Perspectives</em>, Franklin G. Miller,\nJohn C. Fletcher, and James M. Humber (eds.), Totowa, NJ: Humana\nPress, 1–42. doi:10.1007/978-1-59259-370-5_1",
                "–––, 2007, “The Way We Reason Now:\nReflective Equilibrium in Bioethics”, in <em>Oxford Handbook of\nBioethics</em>, Bonnie Steinbock (ed.), New York: Oxford University\nPress, 46–71.",
                "–––, 2017, <em>Methods in Bioethics: The Way We\nReason Now</em>, James Childress and Matthew Adams (eds.), New York:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780190665982.001.0001",
                "Battin, Margaret Pabst, 2013, “Bioethics”, in <em>The\nInternational Encyclopedia of Ethics</em>, ugh LaFollette (ed.),\nOxford: Blackwell. doi:10.1002/9781444367072.wbiee782",
                "Beauchamp, Tom L., 1984, “On Eliminating the Distinction\nBetween Applied Ethics and Ethical Theory”:, <em>Monist</em>,\n67(4): 514–531. doi:10.5840/monist198467430",
                "Beauchamp, Tom L. and James F. Childress, 1979, <em>Principles of\nBiomedical Ethics</em>, New York: Oxford University Press.",
                "–––, 2019a, <em>Principles of Biomedical\nEthics</em>, eighth edition, New York: Oxford University Press.",
                "–––, 2019b, “<em>Principles of Biomedical\nEthics</em>: Marking Its Fortieth Anniversary”, <em>The American\nJournal of Bioethics</em>, 19(11): 9–12.\ndoi:10.1080/15265161.2019.1665402",
                "Bender, Leslie, 1992, “A Feminist Analysis of\nPhysician-Assisted Dying and Voluntary Active Euthanasia”,\n<em>Tennessee Law Review</em>, 59(3): 519–546.",
                "Bertram, Christopher, 1997, “Political Justification,\nTheoretical Complexity, and Democratic Community”,\n<em>Ethics</em>, 107(4): 563–583. doi:10.1086/233760",
                "Brown, Andrew, 2003, “The Practical Philosopher”,\n<em>The Guardian</em>, 19 July 2003.\n [<a href=\"https://www.theguardian.com/books/2003/jul/19/society1\" target=\"other\">Brown 2003 available online</a>]",
                "Burrell, David and Stanley Hauerwas, 1977, “From System to\nStory: An Alternative Pattern for Rationality in Ethics”, in\n<em>Knowledge, Value, and Belief</em>, H. Tristram Engelhardt Jr. and\nDaniel Callahan (eds.), Hastings-on-Hudson, NY: Hastings Center,\n111–152.",
                "Caplan, Arthur L., 1980, “Ethical Engineers Need Not Apply:\nThe State of Applied Ethics Today”, <em>Science, Technology,\n&amp; Human Values</em>, 5(4): 24–32.\ndoi:10.1177/016224398000500403",
                "–––, 1989, “Moral Experts and Moral\nExpertise: Do Either Exist?”, in <em>Clinical Ethics: Theory and\nPractice</em>, Barry Hoffmaster, Benjamin Freedman, and Gwen Fraser\n(eds.), Clifton, NJ: Humana Press: 59–87.\ndoi:10.1007/978-1-4612-3708-2_4",
                "Carse, A.L., 1991, “The ‘Voice of Care’:\nImplications for Bioethics Education”, <em>Journal of Philosophy\nand Medicine</em>, 16(1): 5–28. doi: 10.1093/jmp/16.1.5",
                "Charon, Rita, 1994, “Narrative Contributions to Medical\nEthics: Recognition, Formulation, Interpretation, and Validation in\nthe Practice of the Ethicist”, in <em>A Matter of Principles?\nFerment in U.S. Bioethics</em>, Edwin R. DuBose, Ron Hamel, and Lauren\nO’Connell (eds.), Valley Forge, PA: Trinity Press International:\n260–283.",
                "Clarke, Stanley G., 1987, “Anti-Theory in Ethics”,\n<em>American Philosophical Quarterly</em>, 24(3): 237–244.",
                "Clarke, Stanley G. and Evan Simpson (eds), 1989, <em>Anti-Theory\nin Ethics and Moral Conservatism</em>, Albany, NY: State University of\nNew York Press.",
                "Dancy, Jonathan, 1993, <em>Moral Reasons</em>, Oxford: Blackwell\nPublishers.",
                "–––, 2004, <em>Ethics Without Principles</em>,\nOxford: Clarendon Press. doi:10.1093/0199270023.001.0001",
                "Daniels, Norman, 1979, “Wide Reflective Equilibrium and\nTheory Acceptance in Ethics”, <em>The Journal of\nPhilosophy</em>, 76(5): 256–282. doi:10.2307/2025881",
                "–––, 1996, <em>Justice and Justification:\nReflective Equilibrium in Theory and Practice</em>, New York:\nCambridge University Press. doi:10.1017/CBO9780511624988",
                "–––, 2007, <em>Just Health: Meeting Health Needs\nFairly</em>, New York: Cambridge University Press.\ndoi:10.1017/CBO9780511809514",
                "DePaul, Michael R., 1993, <em>Balance and Refinement: Beyond\nCoherence Methods of Moral Inquiry</em>, London: Routledge.",
                "De Zulueta, Paquita C., 2015, “Suffering, Compassion and\n‘Doing Good Medical Ethics’”, <em>Journal of Medical\nEthics</em>, 41(1): 87–90.\ndoi:10.1136/medethics-2014-102355",
                "Donagan, Alan, 1977, “Informed Consent in Therapy and\nExperimentation”, <em>Journal of Medicine and Philosophy</em>,\n2(4): 307–329.",
                "Engelhardt, H. Tristram, 1986 [1996],\n<em>The Foundations of Bioethics</em>, New York: Oxford\nUniversity Press. Second edition, 1996.",
                "Fletcher, Joseph F., 1974, <em>The Ethics of Genetic Control:\nEnding Reproductive Roulette</em>, New York: Prometheus.",
                "Fotion, Nick, 2014, <em>Theory vs. Anti-Theory in Ethics: A\nMisconceived Conflict</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199373529.001.0001",
                "Frank, Arthur W., 1995, <em>The Wounded Storyteller: Body,\nIllness, and Ethics</em>, Chicago: University of Chicago Press.",
                "Fullinwider, Robert K., 1989, “Against Theory, or: Applied\nPhilosophy—A Cautionary Tale”, <em>Metaphilosophy</em>, 20\n(3–4): 222–234.\ndoi:10.1111/j.1467-9973.1989.tb00424.x",
                "Gert, Bernard, Charles M. Culver, and K. Danner Clouser, 2006,\n<em>Bioethics: A Systematic Approach</em>, second edition, New York:\nOxford University Press. doi:10.1093/0195159063.001.0001",
                "Gutmann, Amy and Dennis Thompson, 1998, <em>Democracy and\nDisagreement</em>, Cambridge, MA: Harvard University Press.",
                "Hooker, Brad and Margaret Olivia Little (eds), 2000, <em>Moral\nParticularism</em>, Oxford: Clarendon Press.",
                "Jonsen, Albert R., 1995, “Casuistry: An Alternative or\nComplement to Principles?”, <em>Kennedy Institute of Ethics\nJournal</em>, 5(3): 237–251. doi:10.1353/ken.0.0016",
                "Kymlicka, Will, 1993 [1996] , “Moral Philosophy and Public\nPolicy: The Case of NRTs”, <em>Bioethics</em>, 7(1): 1–26.\nSlightly revised in <em>Philosophical Perspectives on Bioethics</em>,\nL.W. Sumner and Joseph Boyle (eds.), Toronto: University of Toronto\nPress, 1996, 244–270.\ndoi:10.1111/j.1467-8519.1993.tb00268.x",
                "Lindemann Nelson, Hilde, 1997a, “Introduction: How to Do\nThings with Stories”, in Lindemann Nelson 1997b:\nvii–xx.",
                "––– (ed.), 1997b, <em>Stories and Their Limits:\nNarrative Approaches to Bioethics</em>, New York: Routledge.",
                "Little, Margaret Olivia, 1996, “Why a Feminist Approach to\nBioethics?”, <em>Kennedy Institute of Ethics Journal</em>, 6(1):\n1–18. doi:10.1353/ken.1996.0005",
                "–––, 2001, “On Knowing the\n‘Why’: Particularism and Moral Theory”, <em>The\nHastings Center Report</em>, 31(4): 32–40.\ndoi:10.2307/3527954",
                "London, Alex John, 2001, “The Independence of Practical\nEthics”, <em>Theoretical Medicine and Bioethics</em>, 22(2):\n87–105. doi:10.1023/A:1011403909450",
                "Louden, Robert B., 1990, “Virtue Ethics and\nAnti-Theory”, <em>Philosophia</em>, 20(1–2): 93–114.\ndoi:10.1007/BF02382586",
                "–––, 1992, <em>Morality and Moral Theory: A\nReappraisal and Reaffirmation</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195072921.001.0001",
                "MacIntyre, Alasdair, 1981, <em>After Virtue: a Study in Moral\nTheory</em>, Notre Dame, IN: Notre Dame University Press.",
                "–––, 1984, “Does Applied Ethics Rest on a\nMistake?”:, <em>Monist</em>, 67(4): 498–513.\ndoi:10.5840/monist198467438",
                "Magelssen, Morten, Reidar Pedersen, and Reidun Førde, 2016,\n“Four Roles of Ethical Theory in Clinical Ethics\nConsultation”, <em>The American Journal of Bioethics</em>,\n16(9): 26–33. doi:10.1080/15265161.2016.1196254",
                "McMillan, John, 2018, <em>The Methods of Bioethics: An Essay in\nMeta-Bioethics</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780199603756.001.0001",
                "McNaughton, David, 1998, <em>Moral Vision: An Introduction to\nEthics</em>, Oxford: Blackwell.",
                "Nussbaum, Martha C., 1992, <em>Love’s Knowledge: Essays on\nPhilosophy and Literature</em>, New York: Oxford University\nPress.",
                "–––, 1995, <em>Poetic Justice: The Literary\nImagination and Public Life</em>, Boston: Beacon Press.",
                "–––, 2000, “Why Practice Needs Ethical\nTheory: Particularism, Principle, and Bad Behaviour”, in Hooker\nand Little 2000: 227–255.",
                "O’Neill, Onora, 1988, “How Can We Individuate Moral\nProblems?”, in <em>Applied Ethics and Ethical Theory</em>, David\nM. Rosenthal and Fadlou Shehadi (eds), Salt Lake City, UT: University\nof Utah Press, 84–99.",
                "Ramsey, Paul, 1970, <em>Fabricated Man: The Ethics of Genetic\nControl</em>, New Haven, CT: Yale University Press.",
                "Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.",
                "Rorty, Richard, 1989, <em>Contingency, Irony, and Solidarity</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511804397",
                "Sandomir, Richard, 2019, “Mary Warnock, Who Offered Guidance\non Embryo Use, Dies at 94”, <em>New York Times</em>, 29 March\n2019.",
                "Scanlon, T. M., 1992, “The Aims and Authority of Moral\nTheory”, <em>Oxford Journal of Legal Studies</em>, 12(1):\n1–23. doi:10.1093/ojls/12.1.1",
                "Sherwin, Susan, 1992, <em>No Longer Patient: Feminist Ethics and\nHealth Care</em>, Philadelphia, PA: Temple University Press.",
                "Sherwin, Susan and Françoise Baylis, 2003, “The\nFeminist Health Care Ethics Consultant as Architect and\nAdvocate”, <em>Public Affairs Quarterly</em>, 17(2):\n141–158.",
                "Sidgwick, Henry, 1874 [1981], <em>Methods of Ethics</em>, London:\nMacmillan. Reprint of the seventh edition, Indianapolis, IN: Hackett,\n1981.",
                "Sunstein, Cass R., 1996, <em>Legal Reasoning and Political\nConflict</em>, New York: Oxford University Press.",
                "Toulmin, Stephen, 1981, “The Tyranny of Principles”,\n<em>The Hastings Center Report</em>, 11(6): 31–39.\ndoi:10.2307/3560542",
                "Veatch, Robert M., 1995, “Resolving Conflicts Among\nPrinciples: Ranking, Balancing, and Specifying”, <em>Kennedy\nInstitute of Ethics Journal</em>, 5(3): 199–218.\ndoi:10.1353/ken.0.0138",
                "Wolf, Susan M., 1996a, “Introduction: Gender and Feminism in\nBioethics”, in Wolf (ed.) 1996c: 3–43.",
                "–––, 1996b, “Gender, Feminism, and Death:\nPhysician-Assisted Suicide and Euthanasia”, in Wolf (ed.) 1996c:\n282–317 (ch. 10).",
                "––– (ed.), 1996c, <em>Feminism and Bioethics:\nBeyond Reproduction</em>, New York: Oxford University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Agich, George J., 2001, “The Question of Method in Ethics\nConsultation”, <em>American Journal of Bioethics</em>, 1(4):\n31–41. doi:10.1162/152651601317139360</li>\n<li>American Society for Bioethics and Humanities’ Core\nCompetencies Update Task Force [ASBH], 2011, <em>Core Competencies for\nHealthcare Ethics Consultation</em>, 2<sup>nd</sup> edition, Chicago,\nIL: American Society for Bioethics and Humanities.</li>\n<li>Archard, David and Kasper Lippert-Rasmussen, 2013, “Applied\nEthics”, in <em>The International Encyclopedia of Ethics</em>,\nHugh LaFollette (ed.), Oxford: Blackwell.\ndoi:10.1002/9781444367072.wbiee693</li>\n<li>Arras, John D., 1997, “Nice Story, But So What? Narrative\nand Justification in Ethics”, in Lindemann Nelson 1997b:\n65–88.</li>\n<li>–––, 2003, “The Owl and the Caduceus: Does\nBioethics Need Philosophy?”, in <em>The Nature and Prospects of\nBioethics: Interdisciplinary Perspectives</em>, Franklin G. Miller,\nJohn C. Fletcher, and James M. Humber (eds.), Totowa, NJ: Humana\nPress, 1–42. doi:10.1007/978-1-59259-370-5_1</li>\n<li>–––, 2007, “The Way We Reason Now:\nReflective Equilibrium in Bioethics”, in <em>Oxford Handbook of\nBioethics</em>, Bonnie Steinbock (ed.), New York: Oxford University\nPress, 46–71.</li>\n<li>–––, 2017, <em>Methods in Bioethics: The Way We\nReason Now</em>, James Childress and Matthew Adams (eds.), New York:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780190665982.001.0001</li>\n<li>Battin, Margaret Pabst, 2013, “Bioethics”, in <em>The\nInternational Encyclopedia of Ethics</em>, ugh LaFollette (ed.),\nOxford: Blackwell. doi:10.1002/9781444367072.wbiee782</li>\n<li>Beauchamp, Tom L., 1984, “On Eliminating the Distinction\nBetween Applied Ethics and Ethical Theory”:, <em>Monist</em>,\n67(4): 514–531. doi:10.5840/monist198467430</li>\n<li>Beauchamp, Tom L. and James F. Childress, 1979, <em>Principles of\nBiomedical Ethics</em>, New York: Oxford University Press.</li>\n<li>–––, 2019a, <em>Principles of Biomedical\nEthics</em>, eighth edition, New York: Oxford University Press.</li>\n<li>–––, 2019b, “<em>Principles of Biomedical\nEthics</em>: Marking Its Fortieth Anniversary”, <em>The American\nJournal of Bioethics</em>, 19(11): 9–12.\ndoi:10.1080/15265161.2019.1665402</li>\n<li>Bender, Leslie, 1992, “A Feminist Analysis of\nPhysician-Assisted Dying and Voluntary Active Euthanasia”,\n<em>Tennessee Law Review</em>, 59(3): 519–546.</li>\n<li>Bertram, Christopher, 1997, “Political Justification,\nTheoretical Complexity, and Democratic Community”,\n<em>Ethics</em>, 107(4): 563–583. doi:10.1086/233760</li>\n<li>Brown, Andrew, 2003, “The Practical Philosopher”,\n<em>The Guardian</em>, 19 July 2003.\n [<a href=\"https://www.theguardian.com/books/2003/jul/19/society1\" target=\"other\">Brown 2003 available online</a>]</li>\n<li>Burrell, David and Stanley Hauerwas, 1977, “From System to\nStory: An Alternative Pattern for Rationality in Ethics”, in\n<em>Knowledge, Value, and Belief</em>, H. Tristram Engelhardt Jr. and\nDaniel Callahan (eds.), Hastings-on-Hudson, NY: Hastings Center,\n111–152.</li>\n<li>Caplan, Arthur L., 1980, “Ethical Engineers Need Not Apply:\nThe State of Applied Ethics Today”, <em>Science, Technology,\n&amp; Human Values</em>, 5(4): 24–32.\ndoi:10.1177/016224398000500403</li>\n<li>–––, 1989, “Moral Experts and Moral\nExpertise: Do Either Exist?”, in <em>Clinical Ethics: Theory and\nPractice</em>, Barry Hoffmaster, Benjamin Freedman, and Gwen Fraser\n(eds.), Clifton, NJ: Humana Press: 59–87.\ndoi:10.1007/978-1-4612-3708-2_4</li>\n<li>Carse, A.L., 1991, “The ‘Voice of Care’:\nImplications for Bioethics Education”, <em>Journal of Philosophy\nand Medicine</em>, 16(1): 5–28. doi: 10.1093/jmp/16.1.5</li>\n<li>Charon, Rita, 1994, “Narrative Contributions to Medical\nEthics: Recognition, Formulation, Interpretation, and Validation in\nthe Practice of the Ethicist”, in <em>A Matter of Principles?\nFerment in U.S. Bioethics</em>, Edwin R. DuBose, Ron Hamel, and Lauren\nO’Connell (eds.), Valley Forge, PA: Trinity Press International:\n260–283.</li>\n<li>Clarke, Stanley G., 1987, “Anti-Theory in Ethics”,\n<em>American Philosophical Quarterly</em>, 24(3): 237–244.</li>\n<li>Clarke, Stanley G. and Evan Simpson (eds), 1989, <em>Anti-Theory\nin Ethics and Moral Conservatism</em>, Albany, NY: State University of\nNew York Press.</li>\n<li>Dancy, Jonathan, 1993, <em>Moral Reasons</em>, Oxford: Blackwell\nPublishers.</li>\n<li>–––, 2004, <em>Ethics Without Principles</em>,\nOxford: Clarendon Press. doi:10.1093/0199270023.001.0001</li>\n<li>Daniels, Norman, 1979, “Wide Reflective Equilibrium and\nTheory Acceptance in Ethics”, <em>The Journal of\nPhilosophy</em>, 76(5): 256–282. doi:10.2307/2025881</li>\n<li>–––, 1996, <em>Justice and Justification:\nReflective Equilibrium in Theory and Practice</em>, New York:\nCambridge University Press. doi:10.1017/CBO9780511624988</li>\n<li>–––, 2007, <em>Just Health: Meeting Health Needs\nFairly</em>, New York: Cambridge University Press.\ndoi:10.1017/CBO9780511809514</li>\n<li>DePaul, Michael R., 1993, <em>Balance and Refinement: Beyond\nCoherence Methods of Moral Inquiry</em>, London: Routledge.</li>\n<li>De Zulueta, Paquita C., 2015, “Suffering, Compassion and\n‘Doing Good Medical Ethics’”, <em>Journal of Medical\nEthics</em>, 41(1): 87–90.\ndoi:10.1136/medethics-2014-102355</li>\n<li>Donagan, Alan, 1977, “Informed Consent in Therapy and\nExperimentation”, <em>Journal of Medicine and Philosophy</em>,\n2(4): 307–329.</li>\n<li>Engelhardt, H. Tristram, 1986 [1996],\n<em>The Foundations of Bioethics</em>, New York: Oxford\nUniversity Press. Second edition, 1996.</li>\n<li>Fletcher, Joseph F., 1974, <em>The Ethics of Genetic Control:\nEnding Reproductive Roulette</em>, New York: Prometheus.</li>\n<li>Fotion, Nick, 2014, <em>Theory vs. Anti-Theory in Ethics: A\nMisconceived Conflict</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199373529.001.0001</li>\n<li>Frank, Arthur W., 1995, <em>The Wounded Storyteller: Body,\nIllness, and Ethics</em>, Chicago: University of Chicago Press.</li>\n<li>Fullinwider, Robert K., 1989, “Against Theory, or: Applied\nPhilosophy—A Cautionary Tale”, <em>Metaphilosophy</em>, 20\n(3–4): 222–234.\ndoi:10.1111/j.1467-9973.1989.tb00424.x</li>\n<li>Gert, Bernard, Charles M. Culver, and K. Danner Clouser, 2006,\n<em>Bioethics: A Systematic Approach</em>, second edition, New York:\nOxford University Press. doi:10.1093/0195159063.001.0001</li>\n<li>Gutmann, Amy and Dennis Thompson, 1998, <em>Democracy and\nDisagreement</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Hooker, Brad and Margaret Olivia Little (eds), 2000, <em>Moral\nParticularism</em>, Oxford: Clarendon Press.</li>\n<li>Jonsen, Albert R., 1995, “Casuistry: An Alternative or\nComplement to Principles?”, <em>Kennedy Institute of Ethics\nJournal</em>, 5(3): 237–251. doi:10.1353/ken.0.0016</li>\n<li>Kymlicka, Will, 1993 [1996] , “Moral Philosophy and Public\nPolicy: The Case of NRTs”, <em>Bioethics</em>, 7(1): 1–26.\nSlightly revised in <em>Philosophical Perspectives on Bioethics</em>,\nL.W. Sumner and Joseph Boyle (eds.), Toronto: University of Toronto\nPress, 1996, 244–270.\ndoi:10.1111/j.1467-8519.1993.tb00268.x</li>\n<li>Lindemann Nelson, Hilde, 1997a, “Introduction: How to Do\nThings with Stories”, in Lindemann Nelson 1997b:\nvii–xx.</li>\n<li>––– (ed.), 1997b, <em>Stories and Their Limits:\nNarrative Approaches to Bioethics</em>, New York: Routledge.</li>\n<li>Little, Margaret Olivia, 1996, “Why a Feminist Approach to\nBioethics?”, <em>Kennedy Institute of Ethics Journal</em>, 6(1):\n1–18. doi:10.1353/ken.1996.0005</li>\n<li>–––, 2001, “On Knowing the\n‘Why’: Particularism and Moral Theory”, <em>The\nHastings Center Report</em>, 31(4): 32–40.\ndoi:10.2307/3527954</li>\n<li>London, Alex John, 2001, “The Independence of Practical\nEthics”, <em>Theoretical Medicine and Bioethics</em>, 22(2):\n87–105. doi:10.1023/A:1011403909450</li>\n<li>Louden, Robert B., 1990, “Virtue Ethics and\nAnti-Theory”, <em>Philosophia</em>, 20(1–2): 93–114.\ndoi:10.1007/BF02382586</li>\n<li>–––, 1992, <em>Morality and Moral Theory: A\nReappraisal and Reaffirmation</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195072921.001.0001</li>\n<li>MacIntyre, Alasdair, 1981, <em>After Virtue: a Study in Moral\nTheory</em>, Notre Dame, IN: Notre Dame University Press.</li>\n<li>–––, 1984, “Does Applied Ethics Rest on a\nMistake?”:, <em>Monist</em>, 67(4): 498–513.\ndoi:10.5840/monist198467438</li>\n<li>Magelssen, Morten, Reidar Pedersen, and Reidun Førde, 2016,\n“Four Roles of Ethical Theory in Clinical Ethics\nConsultation”, <em>The American Journal of Bioethics</em>,\n16(9): 26–33. doi:10.1080/15265161.2016.1196254</li>\n<li>McMillan, John, 2018, <em>The Methods of Bioethics: An Essay in\nMeta-Bioethics</em>, New York: Oxford University Press.\ndoi:10.1093/oso/9780199603756.001.0001</li>\n<li>McNaughton, David, 1998, <em>Moral Vision: An Introduction to\nEthics</em>, Oxford: Blackwell.</li>\n<li>Nussbaum, Martha C., 1992, <em>Love’s Knowledge: Essays on\nPhilosophy and Literature</em>, New York: Oxford University\nPress.</li>\n<li>–––, 1995, <em>Poetic Justice: The Literary\nImagination and Public Life</em>, Boston: Beacon Press.</li>\n<li>–––, 2000, “Why Practice Needs Ethical\nTheory: Particularism, Principle, and Bad Behaviour”, in Hooker\nand Little 2000: 227–255.</li>\n<li>O’Neill, Onora, 1988, “How Can We Individuate Moral\nProblems?”, in <em>Applied Ethics and Ethical Theory</em>, David\nM. Rosenthal and Fadlou Shehadi (eds), Salt Lake City, UT: University\nof Utah Press, 84–99.</li>\n<li>Ramsey, Paul, 1970, <em>Fabricated Man: The Ethics of Genetic\nControl</em>, New Haven, CT: Yale University Press.</li>\n<li>Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Rorty, Richard, 1989, <em>Contingency, Irony, and Solidarity</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511804397</li>\n<li>Sandomir, Richard, 2019, “Mary Warnock, Who Offered Guidance\non Embryo Use, Dies at 94”, <em>New York Times</em>, 29 March\n2019.</li>\n<li>Scanlon, T. M., 1992, “The Aims and Authority of Moral\nTheory”, <em>Oxford Journal of Legal Studies</em>, 12(1):\n1–23. doi:10.1093/ojls/12.1.1</li>\n<li>Sherwin, Susan, 1992, <em>No Longer Patient: Feminist Ethics and\nHealth Care</em>, Philadelphia, PA: Temple University Press.</li>\n<li>Sherwin, Susan and Françoise Baylis, 2003, “The\nFeminist Health Care Ethics Consultant as Architect and\nAdvocate”, <em>Public Affairs Quarterly</em>, 17(2):\n141–158.</li>\n<li>Sidgwick, Henry, 1874 [1981], <em>Methods of Ethics</em>, London:\nMacmillan. Reprint of the seventh edition, Indianapolis, IN: Hackett,\n1981.</li>\n<li>Sunstein, Cass R., 1996, <em>Legal Reasoning and Political\nConflict</em>, New York: Oxford University Press.</li>\n<li>Toulmin, Stephen, 1981, “The Tyranny of Principles”,\n<em>The Hastings Center Report</em>, 11(6): 31–39.\ndoi:10.2307/3560542</li>\n<li>Veatch, Robert M., 1995, “Resolving Conflicts Among\nPrinciples: Ranking, Balancing, and Specifying”, <em>Kennedy\nInstitute of Ethics Journal</em>, 5(3): 199–218.\ndoi:10.1353/ken.0.0138</li>\n<li>Wolf, Susan M., 1996a, “Introduction: Gender and Feminism in\nBioethics”, in Wolf (ed.) 1996c: 3–43.</li>\n<li>–––, 1996b, “Gender, Feminism, and Death:\nPhysician-Assisted Suicide and Euthanasia”, in Wolf (ed.) 1996c:\n282–317 (ch. 10).</li>\n<li>––– (ed.), 1996c, <em>Feminism and Bioethics:\nBeyond Reproduction</em>, New York: Oxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "feminist philosophy, interventions: bioethics",
            "feminist philosophy, interventions: ethics",
            "moral theory",
            "reflective equilibrium"
        ],
        "entry_link": [
            {
                "../feminist-bioethics/": "feminist philosophy, interventions: bioethics"
            },
            {
                "../feminism-ethics/": "feminist philosophy, interventions: ethics"
            },
            {
                "../moral-theory/": "moral theory"
            },
            {
                "../reflective-equilibrium/": "reflective equilibrium"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theory-bioethics\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/theory-bioethics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=theory-bioethics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/theory-bioethics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theory-bioethics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/theory-bioethics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=theory-bioethics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/theory-bioethics/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Arras, John, “Theory and Bioethics,” <em>Stanford\n Encyclopedia of  Philosophy</em> (Fall 2020 Edition), Edward N. \n Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2020/entries/theory-bioethics/\" target=\"other\">https://plato.stanford.edu/archives/fall2020/entries/theory-bioethics/</a>&gt;.\n  [This was the previous entry on Theory and Bioethics in the\n <em>Stanford Encyclopedia of Philosophy</em> — see the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theory-bioethics\" target=\"other\">version history</a>.]",
            "<a href=\"https://iep.utm.edu/ethics/\" target=\"other\">Ethics</a>, \n  entry by James Fieser (University of Tennessee/Martin) in the \n<em>Internet Encyclopedia of Philosophy</em>.",
            "<a href=\"https://iep.utm.edu/bioethic/\" target=\"other\">Bioethics</a>, \n  entry by John-Steward Gordon (University of Cologne) in the \n<em>Internet Encyclopedia of Philosophy</em>."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/fall2020/entries/theory-bioethics/": "https://plato.stanford.edu/archives/fall2020/entries/theory-bioethics/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theory-bioethics": "version history"
            },
            {
                "https://iep.utm.edu/ethics/": "Ethics"
            },
            {
                "https://iep.utm.edu/bioethic/": "Bioethics"
            }
        ]
    }
}