{
    "url": "tort-theories",
    "title": "Theories of the Common Law of Torts",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Arthur Ripstein\n<arthur.ripstein@utoronto.ca>",
        "author_links": [
            {
                "mailto:arthur%2eripstein%40utoronto%2eca": "arthur.ripstein@utoronto.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nArthur Ripstein\n&lt;<a href=\"mailto:arthur%2eripstein%40utoronto%2eca\"><em>arthur<abbr title=\" dot \">.</abbr>ripstein<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jun 2, 2022"
    ],
    "preamble": "\n\nTort is a branch of private law. It focuses on interpersonal\nwrongdoing primarily between private persons. Unlike the law of\ncontract, tort obligations are not normally entered into voluntarily;\nunlike the criminal law, the state is not necessarily a party to a\ntort action. Private persons can often contract around the rights and\nobligations of tort law; those rights and obligations provide the\nbackground against which other private arrangements can be made.\nProminent examples of torts include negligent injury, battery, deceit,\nand defamation. In each case, the existence of the legal right that\nhas been violated does not depend on any prior act of the injured\nparty. Instead, everyone has rights against these types of conduct on\nthe part of others. Tort law engages with two of the most fundamental\nquestions of morality and social life: how people are permitted to\ntreat each other, and whose problem it is when things go wrong.\n\nThis entry examines philosophical accounts of tort law, distinguishing\nits obligations from other types of private legal obligation, and\ndistinguishing its characteristic remedies from the punitive responses\nof the criminal law and from administrative regulation. It focuses\nexclusively on tort law within common law systems, that is, legal\nsystems descended from English law, including Australia, Canada, New\nZealand, Singapore, the United States. Other legal systems,\noriginating in continental Europe, are usually described as\n“civilian” systems. They have detailed civil codes\ncovering many of the same issues as the common law of torts. Some\ncivilian systems share many doctrinal features with common-law system;\nothers, particularly France, offer fundamentally different ways of\ndealing with the same set of interactions and the problems to which\nthey give rise.\n",
    "toc": [
        {
            "#RangTort": "1. The Range of Torts"
        },
        {
            "#RemeStruTortLaw": "2. The Remedial Structure of Tort Law"
        },
        {
            "#TortLawHistPhil": "3. Tort Law in the History of Philosophy"
        },
        {
            "#ContPhilApprTortLaw": "4. Contemporary Philosophical Approaches to Tort Law"
        },
        {
            "#EconAnal": "4.1 Economic Analysis"
        },
        {
            "#CorrJust": "4.2 Corrective Justice"
        },
        {
            "#OtheVersCorrJustTheo": "4.3 Other Versions of Corrective Justice Theory"
        },
        {
            "#CiviReco": "4.4 Civil Recourse"
        },
        {
            "#AsseCiviRecoTheo": "4.5 Assessing Civil Recourse Theory"
        },
        {
            "#FairTheo": "4.6 Fairness Theories"
        },
        {
            "#OtheIssuCaus": "4.7 Other Issues: Causation"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#LegaCase": "Legal Cases"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Range of Torts\n\nIn common law legal systems, as well as in what are often described as\n“mixed” common law/civil law systems such as those of\nIsrael and South Africa, most of tort doctrine developed through\ndecisions made by judges addressing private disputes. In the past\ncentury and a half, the diversity of common law jurisdictions and the\nintroduction of statutes and competing regulatory regimes have\nintroduced considerable diversity into the common law, in some cases\nentirely displacing parts of it. Despite such variation, the broad\ndoctrinal structure of the law of torts is fairly clear. It addresses\ntwo fundamental questions of human social interaction.\n\nFirst, tort law lays out the minimal forms of conduct that people are\nlegally entitled to demand of each other, prior to any arrangements\nthat they have made with each other. It does so by identifying and\narticulating a range of wrongs for which one person can claim against\nanother before a court and, if successful, be awarded a remedy. The\nmost prominent of these wrongs, both in the business of courts and in\nscholarly (particularly philosophical) discussions, is the tort of\nnegligence, which involves careless injury of one person by another.\nOther wrongs include defamation, deceit, trespasses to land and\nchattel, intentional torts against persons (such as battery, false\nimprisonment and private nuisance) and liability for dangerous or\ndefective products, as well as a range of more specialized torts, such\nas public nuisance, misfeasance in public office, the tort of\nstatutory breach, and constitutional torts (cases in which a private\ncitizen sues an official for a violation of the citizen’s\nconstitutional rights).\n\nSecond, tort law addresses a question about whose problem it is when\nthings go wrong by generating and enforcing a remedial structure\nwithin which those who have been wronged can claim a remedy from the\nperson who has wronged them. In order to establish the remedial claim,\nthe complaining party (the “plaintiff”) must establish\nthat the act of the alleged wrongdoer (the “defendant”)\nsatisfies each of the elements of the tort of which they complain.\n\nTort law protects each person’s bodily integrity against both\nintentional and negligent interference; it protects each person\nagainst deceit by others; it protects each person’s mental\nhealth against intentional infliction of emotional distress and\nnegligent infliction of psychiatric injury; it protects each\nperson’s reputation against misstatements by others; it protects\nprivacy and freedom of movement against certain interferences; and it\nprotects property against various forms of interference, including\nunauthorized use, willful or careless damage and, in the special case\nof land, against unauthorized entry and loss of usefulness. No less\nsignificantly, the common law of torts declines to protect other\ninterests that might be thought equally pressing, such as the interest\nin adequate resources or a favorable context in which to pursue\none’s purposes, the interest in assistance in times of urgent\nneed, and the interest in the continued availability of objects and\npeople on which one relies. Different explanations of the principle on\nwhich tort law decides which interests to protect will be considered\nbelow. It protects the interests that it does by articulating basic\nnorms of conduct, most of which are continuous with familiar moral\nideas. For example, the basic norm of negligence requires that people\nexercise appropriate care around the bodies and property of others, a\nmoral and social norm that figures in warnings given to children at\nplaygrounds. So, too, the basic norm of battery—which in English\nlaw is characterized as “unauthorized touching” and in\nAmerican law as “harmful or offensive\ntouching”—reflects the admonition given to children to\nkeep their hands to themselves. In each case, tort law specifies and\nsystematizes these familiar ideas and makes them legal rather than\nmerely social or moral norms.\n2. The Remedial Structure of Tort Law\n\nThe remedial structure of tort law reflects its nature as a part of\nprivate law. Unlike a criminal prosecution (but like an action for\nbreach of contract) a tort action is initiated by the aggrieved party\nrather than the state. Unlike a criminal prosecution, the remedy\nsought in a tort action does not involve incarceration or the payment\nof a fine to the state, but rather either the payment of damages to\nthe aggrieved party or, in a limited range of cases, an injunction\nrequiring the defendant to cease their wrongful activity. Courts also\ngive a range of more particular damage awards, including nominal\ndamages (to recognize the existence of a wrong), “general\ndamages” for the tort of defamation (awarded for the fact of\ninjury in addition to “special damages” for clearly\nquantifiable losses), and aggravated damages for particularly\negregious instances of wrongdoing. In some instances, a court will\naward punitive damages, over and above those damages that are tied to\nthe magnitude of the wrong. As their name suggests, such damages have\na punitive dimension, but they differ in important ways from\npunishment for violation of the criminal law, both in the standard of\nproof that is applied to them and in the fact that they are awarded to\nthe injured party. The relation between punitive damages and the\nbroader structure and nature of tort law remains a matter of\ncontroversy, both in legal doctrine (punitive damages are very rare\noutside the United States) and in philosophical accounts.\n\nAs an area of private law, tort law also differs procedurally from\nother areas of law. Unlike a criminal case in which the standard of\nproof is “beyond a reasonable doubt”, the plaintiff in a\ntort action must only establish that it is more probable than not that\nthe defendant satisfied each of the elements of the tort. In the\nUnited States, tort cases are heard before civil juries. In the rest\nof the common law world, civil juries in tort actions for anything\nother than defamation are unusual; in these jurisdictions cases are\ndecided before a judge. In virtually all jurisdictions the vast\nmajority of tort litigation is settled before coming to trial.\n3. Tort Law in the History of Philosophy\n\nTort law has been an object of philosophical reflection at least since\nAristotle’s Nicomachean Ethics. It also figured in\nmedieval discussions by Thomas Aquinas and Francisco Suárez\n(Gordley 2006), as well as in early modern discussions of the law of\nobligations by writers such as Hugo Grotius and Samuel Pufendorf.\nAristotle distinguished between the role of a court in providing a\nremedy in a private dispute from the role of other public officials in\nseeing to it that some good or burden was allocated in accordance with\na specified criterion. Justinian’s Digest (533), a\ncompilation of Roman law from the sixth century, included extended\ndiscussions of tort cases and principles. Civil law jurisdictions also\ndrew heavily on the writings of legal scholars. Historically, the\ncommon law did not begin with any attempt at theoretical\nsystematization, but rather developed through the decisions of judges\nwho considered it important to limit their reasoning to the particular\ncase and pleading before them. Until the nineteenth century, English\nlaw had highly specialized “forms of action” determining\nthe ways in which the plaintiff could plead a case. The forms of\naction did not classify various specific wrongs as falling under a\ngeneral category of tort. Academic writing tended to stay close to the\ndoctrine, with only occasional general pronouncements and with little\nby way of systematic elaboration (Seavey 1942). Some writers continue\nto express doubts about whether tort law can be systematized (Weir\n2006; Murphy 2019; Stapleton 2021; for further discussion, see Thomas\n2019).\n\nPhilosophical writing about the common law of torts developed in the\ntwentieth century, largely but not exclusively in response to a series\nof seminal arguments by the legal scholar and jurist Oliver Wendell\nHolmes Jr. in his 1881 book The Common Law. Holmes set the\nstage for much of contemporary philosophy of torts by asking how we\nshould understand tort law’s apparent use of straightforward\nmoral terminology—duties, rights, wrongs, injustice, malice,\nintent. Holmes himself was concerned with responding to what he saw as\nthe excessive formalism of legal scholarship and education, as\nexemplified in the writings and introduction of methods of study by\nChristopher Columbus Langdell, Dean of Harvard Law School. A central\ntheme of Holmes’s book is captured by his famous claim that\n“the life of the law has not been logic; it has been\nexperience” (1881: 1). Throughout his discussion of the common\nlaw, Holmes aimed to bring the resources of social science to bear on\nunderstanding law in terms of the facts available to decision-makers\nand the likely consequences of legal rules. He believed that this\napproach would make the study of law more practical and useful,\nenabling lawyers to better advise their clients about the likely\nconsequences of various courses of action.\n\nTort law has a central place in this Holmesian shift of focus, not\nonly because a lawyer would want assistance in advising clients on\nwhether to settle tort claims, but also for a systematic philosophical\nreason. Holmes recognized the clear parallels between the law of torts\nand familiar parts of commonsense morality, and wanted to emphasize\nthe differences. He therefore begins his discussion of tort law by\nnoting that \n\n\nThe law of torts abounds in moral phraseology. It has much to say of\nwrongs, of malice, fraud, intent and negligence. Hence it may\nnaturally be supposed that the risk of a man’s conduct is thrown\nupon him as a result of some moral short-coming. (1881: 79) \n\n\nHolmes suggests that the appearance is misleading, and that the law is\nmuch more concerned with practical problem solving than with how a\nwrongdoer would be judged “in the courts of heaven” (1881:\n108). Much of the philosophical discussion of tort law over the past\nhalf century has been focused on understanding the role and\nsignificance of the moral vocabulary that pervades tort law.\n\nTogether with the English legal scholar Sir Frederick Pollock, with\nwhom he corresponded for many decades, Holmes also set a pair of\nquestions for tort theory. The first is whether there is a general\nprinciple of liability underlying all of tort law or simply a\nmiscellany of different causes of action. The Holmes/Pollock answer\nwas affirmative: they each argued in their own way that the basis of\nliability was causing harm without justification or excuse. As Pollock\nput it: \n\n\nAll members of a civilised commonwealth are under a general duty\ntowards their neighbors to do them no hurt without lawful cause or\nexcuse. The precise extent of the duty, as well as the nature and\nextent of the recognised exceptions, varies according to the nature of\nthe case. (1897: 1) \n\n\nThe Holmesian formulation of this idea is still a commonplace of legal\neducation in North America; Holmes’s analysis draws attention to\nmultiple factors that might serve to justify otherwise objectionable\nharms, most of which focused on the economic and social benefits of\npermitting people to harm each other in particular situations\n(1894).\n\nHolmes and Pollock raised their second question by introducing a\nclassification of bases for liability, with a distinction between\nwrongs for which liability was strict, wrongs for which liability was\npredicated on negligence, and wrongs for which intention was required\n(Stevens 2019). These classifications had an important role in shaping\nsubsequent debates, raising questions of both conceptual analysis and\nnormative justification.\n\nHolmes’s main focus was the tort of negligence. It is the tort\nthat generates the most litigation in contemporary legal systems. It\nis also the tort that has been most frequently supplanted by\nalternative systems, such as no-fault automobile insurance and\nworkplace safety regulation and compensation schemes and, in the case\nof New Zealand, a general public insurance scheme which replaced\nactions in negligence in cases of personal injury (Woodhouse Report\n1967; Price Waterhouse Cooper Report 2008). Policy debates about doing\naway with the tort of negligence give philosophical debates about its\nstructure and purpose a special urgency. If, as most scholars are\nprepared to concede, a legal system acts within its proper authority\nin introducing these alternative responses to accidental injury, is\nanything of moral significance lost when they are?\n\nHolmes’s discussion of the tort of negligence drew attention to\nanother set of philosophical questions about tort law. One of the\nelements of the tort of negligence requires that the plaintiff\nestablish that the defendant failed to exercise reasonable care. The\nstandard of care is said to be “objective” in the sense\nthat the inquiry is not about whether the defendant exercised the most\ncare of which they were capable but rather whether the defendant\nexercised the degree of care that a reasonable person would exercise\nin the circumstances. The leading case involved a farmer who was\nwarned that his hayrick was at risk of spontaneous combustion; his\nwell-meaning attempt to reduce the risk increased it, and the\nresulting fire spread to some cottages owned by his neighbor. Although\nthe court accepted his claim that he had acted to the best of his\nabilities, he was held liable anyway. Holmes marks the contrast in\nterms of the question before the court: \n\n\nSuppose that a defendant were allowed to testify that, before acting,\nhe considered carefully what would be the conduct of a prudent man\nunder the circumstances, and, having formed the best judgment he\ncould, acted accordingly. If the story was believed, it would be\nconclusive against the defendant’s negligence judged by a moral\nstandard which would take his personal characteristics into account.\nBut supposing any such evidence to have got before the jury, it is\nvery clear that the court would say, Gentlemen, the question is not\nwhether the defendant thought his conduct was that of a prudent man,\nbut whether you think it was. (1881: 107) \n\n\nHolmes points to the objectivity of the standard as evidence of the\nnon-moral character of the law’s seemingly moral vocabulary,\nwriting \n\n\nIf, for instance, a man is born hasty and awkward, is always having\naccidents and hurting himself or his neighbors, no doubt his\ncongenital defects will be allowed for in the courts of heaven, but\nhis slips are no less troublesome to his neighbors than if they sprang\nfrom guilty neglect. (1881: 108)\n\n\nThe character of the reasonable person is at once completely familiar\nand perplexing. English cases historically referred to the reasonable\nperson as the “man in[on] the Clapham Omnibus” (McQuire v\nWestern Morning News 1903), and American cases have described him as\n“the man who takes the magazines at home and in the evening\npushes the lawn mower in his shirt sleeves” (Hall v Brooklands\nAuto Racing Club 1933), using these familiar stereotypes with all of\ntheir cultural baggage as exemplars. The philosophically interesting\nquestion is why these stereotypes are held out as the standard for\npeople who differ from them: given differences in attention, strength,\nand ability, why is there a uniform standard for everyone?\n\nYet another central question in contemporary debates in tort theory\nconcerns the point of the entire practice of tort liability. In his\nclassic discussion, Holmes suggested that the point of tort liability\ncould not be compensation, because a tort action is an extremely\ninefficient mechanism for delivering compensation. Compared to such\nthings as the workplace safety compensation schemes that were being\nintroduced in Holmes’s time, the tort system is extremely\nexpensive in its delivery of compensation to injured parties, because\nit spends so much time and money litigating disputes, and only\ndelivers compensation to those who are injured by others who have been\nfound to be wrongdoers and who can afford to pay. Holmes’s own\nproposal, echoed by some in more recent decades, is to require each\nperson to carry their own insurance against injury or property damage\n(Atiyah 1997). A system of first-party private or social insurance\nwould compensate injured parties based on the seriousness of the\ninjury they suffered, rather than based on a distinction, which is\narbitrary from the point of view of compensation, between injuries\nsuffered as a result of the careless acts of others and all other\ninjuries.\n\nConsidered as a system of compensation, Holmes concluded, tort\nliability is an abject failure. In its place, Holmes proposed that the\npoint of tort liability was two-fold: to hold people responsible for\ndamage that they cause and to deter others from creating dangers. Each\nof these ideas has been important to subsequent analyses of tort law.\nThe idea of responsibility figures in Holmes’s threefold account\nof degrees of culpability. It sharpens the issue of the basis of the\nobjective standard in negligence, which holds people to a standard\nthey may be unable to meet. Various developments of this emphasis on\nresponsibility figure prominently in some contemporary accounts of\ntort liability, particularly those of Tony Honoré and those\ninfluenced by him (Honoré 1999; Perry 2001; Gardner 2001;\n2018). Holmes’s emphasis on deterrence, in turn, is the source\nof much writing seeking to show that the law of tort is a method of\nregulating safety by providing incentives for people to take\nprecautions against the risk of injury. In the second half of the last\ncentury, this aspect of Holmes’s approach shaped the development\nof the economic analysis of law, which has become a dominant force in\nlegal scholarship and education in the United States.\n\nHolmes is not always explicit about whether he is proposing to explain\nthe law as he finds it or to revise it; he suggests that the\ntraditional law may be inadequate to its tasks of providing for safety\nin an industrialized world: \n\n\n[o]ur law of torts comes from the old days of isolated, ungeneralized\nwrongs, assaults, slanders, and the like, \n\n\nwhereas \n\n\nthe torts with which our courts are kept busy today are mainly the\nincidents of certain well known businesses … railroads,\nfactories, and the like… The public really pays the damages,\nand the question of liability, if pressed far enough, is really the\nquestion how far it is desirable that the public should insure the\nsafety of those whose work it uses. (1897: 467)\n\n\nAs a judge on the US Supreme Court, Holmes decided cases in ways that\nsome have argued are at odds with his theoretical pronouncements about\nthe law of negligence, focusing on the rights of the parties rather\nthan questions of insurance. One important case concerned the question\nof whether the defendant could be liable for causing economic losses\nin the absence of damage to the plaintiff’s property. Holmes\nheld that there was no liability because no right had been violated.\nThe absence of liability in such cases is largely settled, but this\nrationale for disallowing pure economic losses continues to be\ncontested.\n\nHolmes’s efforts to treat tort law as a unified subject and to\nanalyze that unity in terms of its social and economic effects shaped\ndoctrinal scholarship in the United States of America in the middle\npart of the twentieth century. Skeptical of the ways in which legal\ndoctrine presents itself, scholars sought to analyze tort law in terms\nof how it functions to brings about certain social and economic\neffects. The rise of functionalism in tort theory interacted with the\nrise of legal realism with its more general skepticism about the\nability of legal rules to generate determinate results and its related\nemphasis on the ways in which judges sought to achieve particular\npolitical and economic purposes through legal decisions. This approach\nwas captured in the title of a prominent article, “Tort Law:\nPublic Law in Disguise” (Green 1959). Some realist-inspired\nwriters suggested that the function of tort law was to achieve both\ndeterrence and compensation; others emphasized one or the other of\nthese goals (Prosser 1941).\n4. Contemporary Philosophical Approaches to Tort Law\n4.1 Economic Analysis\n\nThe\n economic analysis of law\n treats tort law as a mechanism for regulating safety in the context\nof a broader focus on the efficient allocation of social resources.\nThis approach follows Holmes in rejecting the law’s moral\nvocabulary as misleading. Legal economists frequently point out that\nwe, as a society, have made a collective “Decision for\nAccidents” as Guido Calabresi put it in a widely discussed\narticle (1965). We allow people to travel by car and truck even though\nwe know statistically that this will lead to a certain number of\ndeaths per year. We allow major infrastructure projects that will\nimprove safety and convenience even though we know that people will be\ninjured or killed in the course of constructing them. Similar\ndecisions are made, implicitly or explicitly, in determining whether\nto permit a wide range of other activities with potential side effects\non participants or non-participants. Some level of risk is unavoidable\nand justified, but, when activities are carried out on a large scale,\nsome level of injury becomes inevitable; the economic problem is\nfinding the correct level. Rather than analyzing negligence liability\nin terms of what the defendant did to the plaintiff, legal economists\npropose to understand it in terms of a more general social decision to\ndetermine the appropriate amount of safety for which we, as a society,\nare prepared to pay. Life could be made much safer by prohibiting a\nwide range of risk-imposing conduct; economic rationality demands that\nsocieties face the question of whether safety becomes too expensive at\na certain point. For example, traffic accidents could be reduced\ndramatically by imposing speed limits of 5 mph; the cost in other\ngoods, however, including not only convenience but such things as food\nspoilage and emergency services, would be too high. Economic analysis\nproposes to treat tort law as the solution to an optimization problem\nof setting the level of safety that is worth the cost of the steps\ntaken to achieve it, and of allocating the costs of achieving such\nsafety.\n\nAnalyzed in economic terms, the amount of risk that is acceptable in\nsociety should ideally be determined in the same way that every\nquestion about the creation of a cost or benefit should ideally be\ndetermined, that is, through efficient market transactions. In a\nperfectly competitive market, with complete information and no\ntransaction costs, parties could be expected to negotiate, and\ndetermine the terms on which they exposed each other to risks (Posner\n1983). As Ronald Coase puts it in one of the foundational texts of the\neconomic analysis of law (1960), in conditions of perfect competition,\nparties concerned to advance their interests would always bargain\naround legal rules to reach an efficient result. A rational enterprise\nwill be indifferent between engaging in a profitable activity and\nreceiving equivalent payment to refrain from engaging in it. Without\ntransaction costs, legal rules would make no difference to the\nallocation of resources; the only effect of the legal rule would be to\ndetermine the direction of payments. Coase acknowledges that we live\nin a world in which transaction costs make bargaining infeasible. The\ncase of accidental injury illustrates this particularly starkly.\nNobody is in a position to negotiate with everyone who might be\ninjured through the side effects of their driving, cycling, or other\nactivities, or through products they produce; conversely, nobody could\nbe in a position to negotiate with everyone who potentially exposes\nthem to such risks. Thus, there is a problem which economists identify\nas market failure: the parties are unable to reach a mutually\nbeneficial arrangement. Economic analysis recommends the adoption of\nlegal rules that will provide people with incentives to approximate\nthe outcome that would have been achieved by market transactions with\nfull information and no transaction costs.\n\nEconomic analysts of law disagree amongst themselves about the\nappropriate structure of rules to reach the market-ideal level of\nrisk. Some advocate a rule of strict liability, according to which the\nperson carrying out an activity is made to “internalize”\nall of its costs. A rational economic actor engaged is such activities\nwho was forced to internalize is costs would be indifferent between\npaying the costs of avoiding the accident or paying the costs of the\naccident. They will therefore invest resources in avoidance costs up\nto the point at which doing so will reduce expected accident costs.\nStrict liability therefore will yield an optimal investment in safety.\nIt would give potential injurers an incentive to find innovative ways\nto make their activities safer, particularly in a world in which most\ninjuries are caused not by isolated acts but by ongoing activities\nsuch as the manufacture of consumer products or the operation of motor\nvehicles (Calabresi 1965).\n\nA second economic account, introduced by Richard Posner, analyzes the\nefficiency problem of safety differently. On this view, the negligence\nstandard is the appropriate tool to ensure that people neither\noverinvest nor underinvest in safety (Posner 1972). Economically\nrational agents will not overinvest in safety because they will not\nassume expenses from which they expect no return. Underinvestment in\nsafety is a potential problem, and so the key to an efficient level of\ninvestment in safety is to provide those imposing risks with the right\nincentive to reduce them. The appropriate level is set by making\ninjurers bear the cost of excessive risks that they impose. A\nspecific risk counts as excessive if the cost of reducing it is less\nthan the expected cost—the seriousness of the injury discounted\nby its likelihood—of allowing it to occur. If the burden of\nprecaution costs is greater than the discounted cost of the injury,\nthen it is economically rational for the law to permit the defendant\nto impose the risk. If someone is injured because it was not efficient\nto take a precaution, the injurer should not be held liable; provided\nthat the level of precaution taken was economically efficient,\ntransferring funds from the injurer to the injured party is merely\nredistributive, and does not improve the overall social allocation of\nresources. Posner contends that the only point of tort liability is to\nprovide incentives for optimal investment in safety; the fact that the\ndefendant pays the plaintiff in particular is incidental to the\naccount. Instead, Posner suggests that the plaintiff receives payment\nexclusively as an incentive to bring the lawsuit; in effect the\nplaintiff serves as a kind of private attorney general. The role of\nthe plaintiff in Posner’s analysis tracks the role of the\nplaintiff in the standard economic analysis of US antitrust law, in\nwhich damages are awarded to plaintiffs to incentivize them to bring\nsuits without those plaintiffs having been specially affected by the\npervasive negative consequences of anticompetitive behavior.\n\nSome of the ideas that inform economic accounts of tort law have been\naccepted by theorists who do not otherwise endorse such accounts. For\nexample, as part of his broader scheme of distributive justice, Ronald\nDworkin adopts one of its central claims, arguing that voluntary\ncontracting is the ideal solution to problems of social coordination,\nand that other areas of law need to be understood as attempts to\napproximate contractual results in cases of market failure. Dworkin\ndevelops this view in detail in his discussion of tort law as a\n“principle of correction” in (1986: 295), although he is\ncritical of the broader ambitions of economic analysis (Dworkin\n1980).\n\nEconomic analysis has a straightforward explanation of the objective\nstandard in the law of negligence: because tort liability is\nexclusively a matter of providing incentives for future conduct, the\nfact that the defendant was not in a position to avoid a particular\ninjury is irrelevant. Economic analysis views injuries in the past as\n“sunk costs” which can never be recovered. Making an\ninjurer pay for an injury that efficient precautions would have\navoided will provide the same incentive even if the specific injurer did\nnot realize precautions were required.\n\nEconomic analysis also proposes an explanation of why there is no\nliability for negligently causing economic loss in the absence of\nproperty damage. Posner illustrates his account with a case involving\nbusinesses on an island that customers are unable to reach because the\ndefendant negligently damaged the only bridge leading to it. Posner\nsuggests that those losses are not recoverable because the customers\nwill simply take their business elsewhere, and so there will be no net\nloss to the economy. It is not clear whether this account can be\nreconciled with the fact that the law would grant consequential losses\nto the businesses if they had owned the bridge that was damaged. In\nthat case, too, presumably the customers would have taken their\nbusiness elsewhere resulting in no net loss to the economy. (For a\ndifferent economic rationale for the law’s treatment of pure\neconomic loss, see Sharkey 2018.)\n4.2 Corrective Justice\n\nBeginning in the 1980s, a number of scholars argued that the economic\naccount of negligence fails to capture the most basic and familiar\nfeature of a tort action of any kind, the fact that it is a private\naction that one person brings against another. The core argument is\nthat instrumental accounts are unable to explain the\ncharacteristically private and transactional nature of tortious\nwrongdoing and so unable to explain the nature of the remedy\nappropriate in response to it. In a negligence action, the plaintiff\ncomes before the court complaining of a wrong that the defendant has\ndone to that plaintiff in particular. Unlike the pervasive harms of\nanticompetitive behavior that are regulated in US antitrust law, the\nplaintiff has a particular complaint against the defendant, namely,\nthat the defendant’s carelessness was a violation of that very\nplaintiff’s right to security of person and property. As Ernest\nWeinrib formulates the point, economic analysis proposes separate\nexplanations of why the defendant pays someone and why the plaintiff\nreceives payment from someone, without explaining why the defendant\nowes compensation to the plaintiff in particular; each party faces\nseparate incentives that make no reference to the other (1995). Jules\nColeman develops the same general line of argument in slightly\ndifferent terms: the familiar structural features of tort\nlaw—the fact that a particular plaintiff recovers from a\nparticular defendant for a wrong that that defendant committed against\nthat very plaintiff—cannot be adequately explained by economic\nanalysis, because it leaves out the law’s central focus on the\nfact that the defendant has wronged the plaintiff in particular,\nfocusing instead on incidental factors such as “search,\nadministrative, and transaction costs” (2001: 23).\n\nInstead of understanding the structure of the tort action in terms of\nincentives, Weinrib proposes to understand it in terms of\nAristotle’s category of corrective justice. Aristotle notes that\ncorrective justice rests on the transactional nature of wrongdoing and\nso imposes that transactional nature on the remedy. Corrective justice\nthus differs from what Aristotle calls distributive justice, which is\nconcerned with the distribution of benefits or burdens in accordance\nwith some external criteria, such as the distribution of food on the\nbasis of need or of Olympic medals on the basis of athletic\nperformance. Corrective justice is not comparative in this way. As\nAristotle implies, the wrongdoer’s wrongful deed and the injured\nperson’s suffering are a single act. If I wrongfully injure you,\nmy wrongful act and your injury are the same thing: the wrong consists\nin what I did to you, and your injury consists in what you suffered by\nme. On Weinrib’s argument, the difficulty with economic analysis\nis that it undoes this unity of the wrong. Weinrib points to the ways\nin which the unity of the wrong structures the entire determination of\nliability: for each of the “elements” of a negligence\naction, the court only considers factors that relate the defendant to\nthe plaintiff with respect to the particular transaction. Rather than\nasking whether the defendant was negligent, or imposed a higher than\nnormal risk, the court instead asks whether the defendant was\nnegligent-towards-the-plaintiff, that is, whether the\ndefendant’s carelessness was careless towards the safety of the\nplaintiff in particular; so, too, the court asks whether the kind of\nthing that happened to plaintiff was the reason that the defendant was\nsupposed to be more careful. So too, the court does not ask merely\nwhether the defendant caused the plaintiff’s injury, but rather\nwhether the aspect of the defendant’s act that made it negligent\ncaused the plaintiff’s injury. The inquiry looks only at what\ntranspired between the defendant and the plaintiff: was the defendant\nbeing careful enough in relation to the risk to the plaintiff? Did the\ndefendant owe this specific plaintiff a duty to be careful? Did the\ninjury of which the plaintiff complains fall within the scope of the\nduty that the defendant owed? Did the defendant’s carelessness\ncause the very injury of which the plaintiff complains?\nWeinrib’s argument, then, is that the factors that figure in a\ncourt’s analysis of a negligence action always relate the\nparties to each other, while the factors to which economic analysis\npoints all focus exclusively on one of the parties without reference\nto the other (1995). For economic analysis the plaintiff’s\ninjury by the defendant serves as the occasion for regulation and so\nfor liability but not as its basis. The missing element in economic\naccounts is the transaction; it alone explains why a particular\nplaintiff is entitled to recover from a particular defendant. The same\nrationale explains why there is no duty to rescue in tort law: there\nis no transaction between the parties. The failure of economic\nanalysis to attend to the transaction means that it has no principled\nexplanation of why liability is imposed only for injury but not also\nfor failure to assist where the cost of assisting another would be\nlower than the cost of that person’s anticipated loss. A focus\non providing incentives to reduce risks has no principled basis for\nlimiting its purview to incentives provided to those who have created\nthe risks themselves; the net loss in economic terms is the same\nwhether the risk is of natural or human origin. In either case, in a\nperfectly competitive market without transaction costs, people would\npay others to protect them, yet the law of negligence does not suppose\nthat there is therefore a duty (Ripstein 2016).\n\nThis emphasis on the transactional nature of the unity of the wrong\nprovides an alternative to the economic and Holmesian explanations of\nthe objective standard in a negligence action. Anything relevant to\nany of the elements of negligence must concern the relation between\nthe plaintiff and defendant; as such, no factor that is specific to\nonly one of them could be relevant to the determination of wrongdoing\nand so of liability. On this analysis, a subjective standard—the\none that Holmes contends would be relevant to the “courts of\nheaven”—focuses exclusively on the plaintiff rather than\non how things stand as between the defendant and the plaintiff. As\nsuch, it is unilateral in a way that is foreign to the structure of a\ntort action. The corrective justice account offers a parallel\nexplanation of the “ultrasensitive plaintiff rule”\naccording to which an injured person does not recover for the\ndefendant’s negligent or even knowing exposure of them to things\nfor which they have unusual sensitivities, in either nuisance or\nnegligence, even though a person of normal fortitude would recover for\nthe full extent of their injuries (Ripstein 2016). Once again, an\nunusual sensitivity is a factor that is exclusive to one of the\nparties, and so insufficient to address how things stand between the\ndefendant and the plaintiff. The corrective justice account, then,\nexplains the role of “moral phraseology” in law by drawing\nattention to the interpersonal and relational nature of the relevant\nmorality. That relational structure proposes a systematic response to\nthe Holmesian insistence that concepts of justice must be concerned\nexclusively with good faith efforts. Instead, the corrective justice\naccount focuses on the ordinary demands that ordinary people are\nentitled to make each other. The moral phraseology to which Holmes\ndrew attention is a familiar feature of the way in which people are\nentitled to demand that others be careful around them.\n\nEconomic analysts have responded to the corrective justice critique by\nsuggesting that courts engage in binary adjudication for a variety of\npragmatic reasons, including historical accidents and the beneficial\nincentive effects of putting litigation in the hands of people with\nfinancial stakes in its outcome. In addition, they point to the fact\nthat binary adjudication is a familiar feature of other legal areas\nwhere no private dispute is at issue, most notably US antitrust\nlaw.\n\nThis response arguably misunderstands the corrective justice critique:\nthe claim is not that economic analysis cannot give a functional or\ninstrumental explanation of binary adjudication. The suggestion that\nthe plaintiff receives damages in order to provide an incentive to\ncall out unsafe practices is just such a functional explanation. The\ncorrective justice critique can be put in two different ways. First,\nthe court’s analysis in a tort dispute is all grounded in the\nsingle transaction; it is exclusively backward looking rather than\nforward-looking. It is not just that the decision between the\nplaintiff and the defendant is binary, but rather that it is based\nonly on the specific transaction between them—the remedy is\nexplicable only in terms of the bipolar transactional nature of the\nwrong. Second, the economic analyst’s response represents the\ncorrective justice theory differently than its proponents do, reading\nit as the claim that binary adjudication is effective for achieving\ncorrective justice but for no other purpose. The corrective justice\naccount is not an attempt to explain remedies and court processes by\nasking what goals they best promote. It argues that tort adjudication\nis binary because the wrongs to which it responds are binary: they are\na matter of what the defendant has done to the plaintiff. The\ntransactional nature of wronging underlies the transactional nature of\ntort litigation, and so explains why the particular plaintiff recovers\nfrom the particular defendant. The plaintiff’s entitlement to\nrecover is not an attempt to achieve any other purpose.\n\nSome transaction-focused accounts of corrective justice deploy the\nKantian distinction between duties of right and duties of virtue to\ndevelop a positive account of the specific norms enforced by tort law\n(Kant 1797). On this view, the moral vocabulary to which Holmes draws\nattention is not the general moral vocabulary of virtue or the courts\nof heaven. The relational ideas of what one person does to another\napply to separate persons, each with the purposes of their own. They\nthereby reconcile the ability of separate persons to pursue those\npurposes with the means that they have, centrally their body and their\nproperty. Kantian accounts conceive of rights relationally, rather\nthan focusing on one side of the relation, such as the choices or\ninterests of the rightholder. The violation of rights to person and\nproperty does not extinguish the plaintiff’s entitlement to be\nindependent of the defendant’s choice. Instead, the\nplaintiff’s right to constrain the defendant’s conduct\nsurvives in the form of a claim to a remedy from the defendant in\nparticular (Weinrib 1995; Ripstein 2016). The person who wrongfully\ninjures another or damages the other person’s property can be\ncompelled to return things to their prior condition, that is, to pay\nthe costs of repairing or replacing the property or of enabling the\ninjured party to get on with their life in light of the injuries. In\naddition, people who wrongfully use another person’s\nbody (the tort of battery) or property (the torts of trespass and\nconversion) are required to repair any damage that they do because\nonce again there is a wrongful transaction. This Kantian account also\nhas a direct and straightforward explanation of the rules regarding\neconomic loss: if the defendant damages something on which the\nplaintiff depends but does not own, the wrongful transaction is\nbetween the defendant and the owner of the damaged thing; if the\nplaintiff does not have a right to the damaged object, then although\nthe plaintiff has suffered a loss, no right has been violated. As\nsuch, the plaintiff is not a party to the wrongful transaction, so\nthere is no wrong between the person who damaged the object and the\nplaintiff to be corrected. In the example of the damaged bridge,\nwhether the plaintiff’s right has been violated depends on\nwhether the plaintiff owns the bridge. The economic loss rule is thus\ntreated as an instance of a more general focus on rights to person and\nproperty; those who benefit from property lack the relevant form of\nright in it, and the law of negligence does require a person to\nprotect others from natural perils or the acts of third parties\n(Ripstein 2016).\n\nThe corrective justice account does not deny that tort liability has\nthe effect of deterring careless people and compensating injured\npeople. The point is rather that these effects are insufficient to\nexplain the law’s unwavering focus on the connection between the\nplaintiff and defendant: why this plaintiff is entitled to recover\nfrom this defendant and no one else, and why this defendant is liable\nto this plaintiff and no one else. Seen from the point of view of\neither deterrence or compensation, such a pairing of the defendant and\nthe plaintiff is arbitrary, as is the law’s exclusive focus on\nthe relation between them. From the standpoint of corrective justice,\nthe transaction between the parties is the locus of the wrong and the\ncourt’s exclusive concern is in addressing that wrong.\n4.3 Other Versions of Corrective Justice Theory\n\nIn the past three decades, multiple versions of corrective justice\ntheory have been proposed. On Weinrib’s formulation, corrective\njustice is a principle that is limited to transactional wrongs, which\nincludes both breaches of contract and violations of individual rights\nto person and property. On this view, the apparatus of corrective\njustice is brought to bear on only a certain class of\ntransactions.\n\nA more expansive conception of corrective justice was proposed by\nJules Coleman (2001). Coleman compares the principle of corrective\njustice to that of retributive justice. He argues that, just as the\nprinciple of retribution does not contain a complete catalogue of the\ncrimes worthy of punishment, but rather simply says that serious\ncrimes merit retributive punishment, so, too, the theory of corrective\njustice is on its own silent on the question of the types of\ninterpersonal wrongs that are its appropriate subject matter. For\nColeman, then, the principle of corrective justice is a general\nprinciple of responsive conduct, which awaits an independent theory of\ntortious wrongdoing to which it is to be applied. Coleman offered\nseveral different accounts of the principle of corrective justice: on\none version its purpose was to “annul” wrongful gains and\nlosses; a different, later version emphasized the reversal of the\neffects of wrongful acts by the particular person responsible for\nthem. On both of these accounts, the concepts of wrongdoing and\nresponsibility are placeholders, consistent with a wide variety of\nviews about which acts are wrongful and about the conditions under\nwhich someone can be responsible for an outcome.\n\nA still more expansive account of corrective justice was proposed by\nJohn Gardner (2011). For Gardner, the principle of corrective justice\nis a general principle about inappropriate conduct, according to which\nthe failure to do what one has reason to do does not mean those\nreasons come to an end; the normal response to such failure is to do\nthe next best thing. Gardner illustrates this with the example of\nkeeping a promise: having promised someone to meet them for lunch at\nnoon, the promisor who is behind schedule must still show up at 12:15.\nThe promised act of meeting at noon can no longer be done, and so, on\nGardner’s analysis, there can be no duty to arrive at noon, and\nno right that the promisor arrive by noon. Instead, there is a new\nduty, the duty to do the next best thing. Gardner applies this\nanalysis to tort liability. If I had a duty to avoid injuring you\nbecause I had sufficient reason not to injure you, and I injure you\nanyway, my duty to avoid injuring you can no longer be satisfied. But\nall of the reasons that supported the duty will normally still be in\noperation; as such, those reasons put me under a new duty, this time\nto repair the wrong that I have done. Gardner describes his view as an\naccount of corrective justice because it regulates “the reversal\nof wrongful transactions on the ground of their wrongfulness”\n(2011: 22). Correction is thus the correction of a failure to conform\nto reasons that apply to you: \n\n\nthe reasons why one must pay for the losses that one occasions are the\nvery same reasons why one must not occasion those losses in the first\nplace, when it is true that one must not occasion them. (2011: 34)\n\n\n\nGardner’s account differs significantly from Weinrib’s\nbecause of its exclusive focus on the relation between wrongdoers and\nthe reasons that apply to them, rather than the relation between the\nparties. The fact that those reasons make reference to the wronged\nparty is not essential to the operation of Gardner’s conception\nof corrective justice. (For comparisons of different versions of\ncorrective justice, see Steel 2020).\n4.4 Civil Recourse\n\nOver the past two decades, a new account of tort liability has emerged\nwith the rise of “Civil Recourse Theory”. Initially\nintroduced by Benjamin Zipursky (2003), and then developed further in\njointly authored work by John Goldberg and Zipursky (2020), as well as\nby others, civil recourse theory accepts the corrective justice\naccount of wrongdoing, but rejects its account of remedies. Civil\nrecourse writers also accept the corrective justice critique of\neconomic and other instrumental theories, arguing that tort law must\nbe understood as in the first instance as law concerned with\nwrongdoing, rather than as law governing safety incentives or as an\naccount of a privatized form of regulation. Instead, a tort is a civil\nwrong, a wrong that one person commits against another. Civil recourse\ntheory shares with corrective justice theory the idea that the wrongs\naddressed by tort law are relational, that is, it shares the view that\nthe plaintiff and defendant must be connected in the right way at\nevery stage of the analysis of wrongdoing. Civil recourse accounts\ntherefore reject instrumentalist accounts of wrongdoing, including\nwhat Goldberg and Zipursky characterize as “dual\ninstrumentalism”, the idea that the point of tort liability is\nto advance both deterrence and compensation. Civil recourse theory\nalso reject the economic analysis of tort law that focuses exclusively\non providing incentives to potential defendants, pointing to the\none-sidedness problem to which corrective justice writers also draw\nattention.\n\nCivil recourse writers have also emphasized the plurality of torts,\narguing that tort law provides a unified system, because it brings\ntogether the full range of relational wrongs, including not only\nnegligence of the sort that has occupied so much legal scholarship\nover the past century, but also defamation, battery, intentional\ninfliction of emotional distress and many other wrongs. Civil recourse\ntheory emphasizes these wrongs, not because they are the main business\nof modern legal systems, but because a focus on their relational\nstructure clarifies the ways in which torts are relational wrongs. An\nexcessive focus on negligence makes non-relational accounts, whether\nfocused on deterrence or compensation, appear at least superficially\nviable. If, however, tort law really is a unified doctrinal area, then\nfocus on other torts clarifies that the basic form of tortious\nwrongdoing can only be understood relationally. The tort of fraud\nprovides a particularly clear illustration: it requires that the\ndefendant intentionally represented the subject matter of the deceit\nto the deceived plaintiff. If someone purchases a forged artwork based\non a lie that the seller told to someone else, the purchaser has no\naction in fraud against the seller. So, too, in defamation, only the\nperson who was defamed has a cause of action, even if that\nperson’s family members or business associates will suffer as\nmuch or more from the defamation.\n\nThe fundamental disagreement between civil recourse writers and\ncorrective justice writers turns on the remedial aspect of tort law.\nAs a common-law subject, tort law develops largely (though not\nexclusively) through the litigation of concrete disputes; in the\ncontext of those disputes, the plaintiff is always seeking a remedy\nfrom the defendant. For corrective justice writers, the point of the\nremedy is to address the wrong; the relation between the defendant and\nthe plaintiff that makes the defendant’s act towards the\nplaintiff wrongful is also the basis for the remedy. For civil\nrecourse theorists, by contrast, the aim of a tort remedy is not to\nrepair the wrong, but rather to empower plaintiffs to confront and\nmake a demand on the persons who wronged them. The difference is\nsubtle but important: although damages addressed to repairing the\nwrong provide one form of recourse, the idea of recourse is more\ngeneral. Although remedies are occasioned by wrongdoing, their purpose\nis not simply to repair wrongs. Drawing on John Locke’s idea of\nthe social contract, Goldberg and Zipursky suggest that, having\nprohibited self-help remedies, the state owes an obligation to persons\nwho have been wronged to provide them with a civil avenue of recourse\nthrough which they can proceed against those who have wronged them; a\ntort remedy is something that the plaintiff is empowered to seek from\nthe defendant rather than something that the plaintiff is entitled to\nreceive from the defendant. Until the plaintiff initiates an action\nand prevails in it, the defendant is not under a duty to pay damages\n(Smith 2012; 2019). Rather than contending that a remedy repairs a\nwrong, civil recourse writers read the eighteenth-century Latin maxim\nubi jus, ibi remedium—where there is a right there must\nbe a legal remedy for its violation—as providing those who have\nbeen wronged with the opportunity to do something to those who have\nwronged them. Civil recourse writers point to advantages of\nunderstanding the nature of tort remedies in this way, notably in\ncases in which tort remedies are insufficient to repair wrongs.\nMonetary damages may allow the plaintiff to purchase a replacement for\nproperty that has been damaged or destroyed, but in many other cases\nthey will not allow the plaintiff to continue life as if the wrong had\nnot occurred. No amount of money can make up for the loss of a limb,\nor a child, or for the humiliation of a breach of privacy or the\nwillful infliction of emotional distress (Hershovitz 2017). Civil\nrecourse writers focus on such cases in order to argue that the point\nof damages is to enable the person who has been wronged to exact an\nappropriate remedy from the wrongdoer, even when that remedy would be\ninadequate by any compensatory measure. Even in the case of injuries\nthat can be readily repaired, or of lost earnings that can be made up\nwith their estimated monetary equivalent, civil recourse writers\ncontend that the purpose of the remedy is better explained in terms of\nthe recourse that it provides rather than the loss that it\ncompensates. They argue that this provides a more unified account of\ntort law, rather than the one that is limited to a narrow class of\ninterferences with agency and remedies that seek to restore agency\n(Sage 2021).\n4.5 Assessing Civil Recourse Theory\n\nOne prominent objection to civil recourse theory, made both by\ndefenders of corrective justice accounts and defenders of economic\nanalysis, is that the principle of civil recourse is true but trivial.\nThe founders of the economic analysis of tort law, Richard Posner and\nGuido Calabresi, both of whom were at the time federal appellate\njudges in the United States, have argued that the principle of civil\nrecourse is empty, and could provide no possible guidance to any judge\nattempting to decide a case. Instead, other factors, including\ninstrumental ones, must be introduced in order to explain the\nresolution of the case and the measure of damages; that it all takes\nplace before a court at the initiative of the plaintiff is\ninstitutionally true but analytically insignificant for Posner (2013)\nand Calabresi (2013). More generally, the entitlement of someone to\nclaim a remedy from the person who has wronged them is a generic\nfeature of private legal relationships, and so fails to shed any\ndistinctive light on tort law. Instead, just as contract law provides\nplaintiffs with remedies because they have been wronged, however\nimperfectly those remedies might repair those wrongs, so too does the\nlaw of tort. That legal structure does not, however, lead to the\nconclusion that contract remedies have some point other than to\nenforce the contractual right that was violated, however imperfect\nthat remedy may be as a substitute. So, too, in the case of tort law,\nany obligation that the state has to provide a forum and avenue of\nrecourse does not show that the principle of recourse is anything\nother than the enforcement of the right that was violated. The claim\nthat there is no legal duty to pay damages unless the plaintiff brings\nsuit has also been disputed (Steel & Stevens 2020).\n\nA second objection to civil recourse theory charges that it is nothing\nmore than a notational variant on corrective justice theory, sharing\nits focus on wrongdoing, as well as its accounts of the objective\nstandard in negligence and its explanation of the lack of recovery for\npure economic loss (Benson 1995; Zipursky 2003). One of the\ndifficulties in assessing this objection is that, as we saw above,\nthere are different formulations of corrective justice theory.\nDiscussions of corrective justice in the civil recourse literature\noften associate it with the idea that the plaintiff must be made\nwhole, that is, with a purely compensatory idea, which some civil\nrecourse writers describe as moving from a less just state of affairs\nto a more just one. The idea that tort liability always leads to a net\nimprovement in justice is difficult to fit to the world in which tort\nlaw actually operates (Goldberg & Zipursky 2020). Yet prominent\nwriters about corrective justice, including Weinrib and Ripstein, do\nnot claim that the point of corrective justice is to increase justice\nglobally; instead, they characterize remedies in terms of the specific\ntransaction. Aristotle explicitly rejects the suggestion the point of\ncorrective justice is to produce greater justice along any further\ndimension when he states that duties of corrective justice apply even\nin cases in which a “decent” person is required pay\ndamages to a “base” one (Nicomachean Ethics, Book\nV, Ch. 4). For Aristotle, the basis of liability is the past\ntransaction between them, rather than the comparative magnitude of\ntheir holdings along any other dimension. Since civil recourse theory\nalso begins with a focus on the wrongful transaction, corrective\njustice writers suggest that it adds nothing to corrective justice\nanalysis and does not contrast with it.\n\nCivil recourse theory does, however, differ in at least one important\nway from corrective justice theory. It contends that the purpose of a\ntort remedy is not to enforce the plaintiff’s right against the\ndefendant, but to permit the plaintiff to exercise a power to proceed\nagainst the defendant; the state owes a duty to the plaintiff to\nprovide a forum in which that power can be exercised. For corrective\njustice theory, the remedy enforces the right that was violated; for\ncivil recourse theory, the remedy addresses the fact that some right\nwas violated, rather than enforcing the specific right that was\nviolated. On this view, damages seeking to repair the specific rights\nviolated and the magnitude of the loss are only one form of recourse.\nThe disparate remedies provided by tort law are unified by the fact\nthat they are forms of recourse rather than by their aim of repairing\nrights violations.\n\nThis focus on the plaintiff’s right against the state\ndistinguishes civil recourse theory from corrective justice but raises\na further puzzle about the status of that right. As a doctrinal and\ninterpretive matter, private rights of action in tort have been\nabolished in particular cases, as most prominently New Zealand has\ndone for all personal injuries but, more pervasively, as virtually\nevery common law country has done for a broad range of workplace\naccidents that take place in the course of employment. This raises two\npossibilities, each of which faces difficulties. One possibility is\nthat abolishing the private cause of action abolishes the\nvictim’s right against the state to be empowered to seek\nredress, in which case the principle that there is no right without a\nremedy is dramatically narrowed in scope. Rather than seeing a right\nto recourse as something the state must grant because self-help has\nbeen abolished, on this first alternative, the right of recourse\nappears to apply only to cases in which the state has granted both the\nright and the cause of action, since the state can abolish both\nself-help and the cause of action. While this first alternative\ndescribes a familiar structure of positive law, it detaches civil\nrecourse theory from its roots in Lockean political philosophy and so\ndeprives it of its broader explanatory ambitions. Alternatively,\nprohibiting self-help in cases of automobile accidents or workplace\naccidents while also failing to provide a private right of action\ncould be characterized as a violation of the rights of those who have\nbeen denied both self-help and recourse, in which case the theory\nwould require that the state must provide a remedy for that violation.\nSuch an account fails to fit familiar features of legal doctrine,\nwhich does not require states limiting the rights of action to provide\nan alternative remedy to those who would otherwise be able to exercise\nthem. Other critics have criticized the ways in which civil recourse\ntheory characterizes legal powers (Herstein 2015), or suggested that\nit only applies in circumstances in which corrective justice cannot be\nrealized (Stone 2022).\n\nSome critics of civil recourse theory have charged it with focusing on\nrevenge in a way that is morally suspect and at odds with the ideas of\nlegality. Some defenders have suggested that a focus on revenge\nprovides a more satisfying interpretation of tort law (Oman 2011;\nHershovitz 2014; Gold 2020). On this interpretation, the Lockean idea\nof a social contract is framed in terms of a default moral position in\nwhich self-help motivated by resentment or outrage is the appropriate\nresponse to having been wronged. For understandable reasons, states do\nnot permit self-help, particularly self-help carried out in anger, and\nso must provide a substitute for the conduct they have prohibited. On\nthis understanding, civil recourse is plainly distinct from corrective\njustice, because the point of the remedy is not merely to grant power\nto the plaintiff but to enable the plaintiff to act out of anger in a\ncontrolled setting. Such an interpretation faces both analytical and\nnormative challenges. The analytical challenge is in explaining how\nthe entire account does not presuppose a prior and more fundamental\nprinciple of corrective justice: if recourse is a substitute for\nlegitimate revenge, the most obvious interpretation of the imagined\nsocial contract would represent the right of recourse as the\ncompensation due to those who have been improperly deprived of a\nnatural right to exact revenge. The normative difficulty comes from\nthe assumption that there is a right to take revenge, so that the\nstate owes compensation for depriving people of it. However pervasive\nthe desire for revenge might be in human psychology, prohibiting it\ndoes not seem to be the kind of wrongful act that requires\ncompensation (Ripstein 2011; Steel 2021). A different interpretation\nof the revenge rationale understands the granting of a right of\nrecourse not as something that is owed as a matter of justice but\nrather as a political compromise in order to maintain peace by giving\ncertain moral emotions an output. As a piece of political sociology,\nthis account would need to explain how that outlet is properly\npreserved in a system in which most cases are settled, and why it is\nrequired in cases of injury for which the law provides a remedy even\nthough outrage would seem both inappropriate and idiosyncratic, such\nas mistaken but harmless trespasses to land and cases in which the\ndefendant’s best efforts fell below the standard imposed by\nlaw.\n4.6 Fairness Theories\n\nOther writers have proposed different justice-based accounts of the\ncommon law of torts. George Fletcher proposed to understand tort\nliability as a violation of reciprocity; those who impose\nnon-reciprocal risks on others must compensate for the harm that they\ndo (1972). Other writers, drawing on John Rawls’s theory of\njustice have proposed to understand tort law in broadly contractarian\nterms. For example, Gregory Keating has argued that corrective justice\nis a subordinate principle in tort law, the purpose of which is to\nuphold entitlements—not only to property but also to personal\nsecurity—that are themselves the product of a contractualist\nprocedure (1996; 1997). Keating argues that corrective justice’s\nemphasis on the form of a tort action attends to remedies without\nadequately accounting for the way in which those remedies are\nsecondary to the rights that they enforce. In order to identify the\nrelevant rights, Keating suggests a contractualist procedure similar\nto those developed by Rawls and T.M. Scanlon. The proposed\ncontractualist account would weigh the substantive interests of people\nin liberty and security, and would attach priority to bodily security\nin particular. It would therefore require two things. First, it would\nrequire that business enterprises that characteristically create risks\nto life and limb spend more on precautions than would be justified\nthrough an economic analysis of their expected costs and benefits.\nSecond, it would require that those who suffer injuries, even if those\ninjuries are unavoidable—as is likely in a world in which, as\nHolmes puts it, enterprises engaged in ongoing\n“activities” rather than isolated “acts” on a\nlarge scale will inevitably produce injuries no matter how careful\nthey are—receive compensation even though nothing short of\nprohibiting those worthwhile and beneficial activities could have been\ndone to prevent those injuries. Keating puts this point in terms of an\nidea of enterprise liability under which an enterprise that imposes\ncosts on others should properly be made to bear those costs.\nEnterprise liability, in which manufacturers were required to insure\nagainst all injuries caused by their products, even those that could\nnot be prevented through further care figured prominently in a number\nof decisions, particularly in California, in the second half of the\ntwentieth century. A leading case involved a cola bottle that\nexploded, injuring the plaintiff, although there was no evidence of\nnegligent manufacture. In recent decades, the prominence of enterprise\nliability has largely faded.\n\nLike some versions of economic analysis, Keating’s social\ncontract account is avowedly normative, proposing significant changes\nto tort doctrine. Like economic analysis, it sees tort law as one of\nmany tools available to the state in dealing with safety (2021). It\ndiffers from economic analysis in the greater weight that it proposes\nto give to personal safety rather than convenience. Ultimately,\nhowever, it engages in the same type of balancing, and appears to be\nvulnerable to the interpretive objections that are frequently raised\nagainst economic analysis, in particular, that it leaves no place for\nsome of tort law’s most familiar doctrinal structures, such as\nthe relational structure of wrongdoing and the distinction between\nwronging someone and failing to confer a benefit on that person. For\nexample, the priority attached to safety over convenience or\nprofit-making applies not only to the taking of precautions but to\nassisting others who are endangered by natural perils; the same\nweighted cost/benefit analysis would seem to apply to the person who\ncould make an easy rescue or, more generally, provide benefits to\nothers. However morally meritorious such acts might be, and whatever\nmight be said in favor of other forms of regulation mandating them,\nthey are incongruous with the way in which tort law frames issues of\ninterpersonal interaction.\n4.7 Other Issues: Causation\n\nCausation, which is a further element of the tort of negligence, has\nfigured prominently in recent debates. Some of these debates are\nnormative. They concern whether causation is relevant to liability,\nbecause the causal upshots of careless behavior are beyond the control\nof the person who is careless. This, too, is a debate prefigured in\nHolmes, who wrote \n\n\nWhen a man commits an assault and battery with a pistol, his only act\nis to contract the muscles of his arm and forefinger in a certain way,\nbut it is the delight of elementary writers to point out what a vast\nseries of physical changes must take place before the harm is done.\n(1881: 91) \n\n\nA number of writers have sought to explain the consistency of\nwhichever moral ideas they suppose properly shape tort law with the\nrole of luck in negligence liability, and with the fact that tort law\nhas no analog of the criminal law’s category of attempt\nliability (Alexander 1987; Ripstein 1998; 2007; Ripstein &\nZipursky 2001; Waldron 1997; Goldberg & Zipursky 2007).\n\nCausation also raises conceptual issues. The basic legal rule for\nfactual causation in a negligence action is that a defendant who has\nbreached a duty of care to a plaintiff is not liable for an injury to\nthat plaintiff unless the injury was caused by the defendant’s\nbreach of the duty of care. The law understands the cause of an event\nas a necessary condition for its occurrence, typically cast in the\nvocabulary of “but-for” causation: but for the\ndefendant’s negligence, would the plaintiff have been injured?\nIf the plaintiff’s injury would have happened even had the\ndefendant not been negligent, the plaintiff will not recover. This\nrequirement raises puzzling cases involving overdetermination, as when\na ship collides with two others in separate events, requiring it to be\nout of commission while each of its two sides is repaired, or when two\ndefendants pass the plaintiff’s horse on opposite sides at the\nsame time, startling it simultaneously, or when multiple fires merge.\nThe but-for test is of no assistance in these cases, since it leads to\nthe counterintuitive conclusion that neither defendant caused the\nplaintiff’s injury. Courts have developed various tools for\ndealing with these problems, and philosophers have offered\ninterpretations of the problems.\n\nA second causal issues arise in cases in which the ordinary burden of\nproof—the plaintiff must ordinarily establish each of the\nelements of a tort on the balance of probabilities—cannot be met\nbecause of factual uncertainty. In some cases, the factual uncertainty\nis itself the result of the negligence of multiple defendants, as when\ntwo hunters fire their guns negligently in the direction of a third,\ncausing a piece of buckshot to lodge in the third hunter’s eye.\nHad the two defendants not been negligent, the plaintiff would not\nhave been injured, but the presence of more than one defendant\nconfounds the plaintiff’s hope of proving that either one caused\nthe injury. The approach that most common-law courts (outside the UK)\nhave adopted for dealing with these cases strike most commentators as\nboth sensible and fair: both hunters are liable if they cannot\ncausally exculpate themselves. There are, however, deep questions\nabout whether the sensible rule about the burden of proof amounts to a\nlimited rejection of the causation requirement, or whether instead it\nis a distinctive interpretation of causation. In cases involving large\nnumbers of both plaintiffs and defendants, particularly in litigation\ninvolving mass torts, these questions are multiplied. Philosophers\nhave tried to offer interpretations of the results in these cases,\nwith some arguing that such cases require a different way of thinking\nabout the place of causation in tort law (Thomson 1984; Ripstein &\nZipursky 2001; Steel 2015a; 2015b).\n\nA third causal issue arises in cases in which more than one precaution\nis available to a defendant that would render the defendant’s\nconduct safe enough (however that is to be determined). Some of those\nprecautions might have prevented the specific injury suffered by the\nplaintiff and others not (although all would reduce the risk to an\nacceptable level). For example, two forms of medical precaution might\nmake a procedure sufficiently safe but do so by reducing different\naspects of its characteristic risks. If the defendant physician takes\none of the precautions, but the other precaution would have prevented\nthe injury suffered by the plaintiff, the injury was the realization\nof the risk, yet the defendant was not negligent. As both a legal and\nas a philosophical matter, the question “if the defendant had\nnot been negligent, would the plaintiff have suffered the same\ninjury?” seems to admit of no single answer, but rather to\ndepend on which of the untaken precautions forms the relevant contrast\ncase (Gilboa 2019).\n",
    "bibliography": {
        "categories": [
            "Legal Cases"
        ],
        "cat_ref_text": {
            "Legal Cases": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Hall v Brooklands Auto Racing Club</em>, [1933] 1 KB 205.",
                "<em>McQuire v Western Morning News</em> [1903] 2 KB 100.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alexander, Larry A., 1987, “Causation and Corrective\nJustice: Does Tort Law Make Sense?”, <em>Law and\nPhilosophy</em>, 6(1): 1–23. doi:10.1007/BF00142638</li>\n<li>Aristotle, <em>Nicomachean Ethics</em>, in <em>Complete Works of\nAristotle, Volume 2</em>, J. Barnes (trans.), Princeton: Princeton\nUniversity Press, 2014.</li>\n<li>Atiyah, P. S., 1997, <em>The Damages Lottery</em>, Oxford: Hart\nPublishing.</li>\n<li>Benson, Peter, 1995, “The Basis for Excluding Liability for\nEconomic Loss in Tort Law”, in Owen 1995: 427–459.\ndoi:10.1093/acprof:oso/9780198265795.003.0020</li>\n<li>Calabresi, Guido, 1965, “The Decision for Accidents: An\nApproach to Nonfault Allocation of Costs”, <em>Harvard Law\nReview</em>, 78(4): 713–745. doi:10.2307/1338791</li>\n<li>–––, 2013, “Civil Recourse Theory’s\nReductionism”, <em>Indiana Law Journal</em>, 88(2):\n449–468.</li>\n<li>Cane, Peter and John Gardner (eds.), 2001, <em>Relating to\nResponsibility: Essays for Tony Honoré on His Eightieth\nBirthday</em>, Oxford, UK/Portland, OR: Hart Publishing.</li>\n<li>Coase, R. H., 1960, “The Problem of Social Cost”,\n<em>Journal of Law and Economics</em> 3: 1–44.</li>\n<li>Coleman, Jules L., 2001, <em>The Practice of Principle: In Defence\nof a Pragmatist Approach to Legal Theory</em>, Oxford/New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199264124.001.0001</li>\n<li>Dworkin, Ronald M., 1980, “Is Wealth a Value?”,\n<em>The Journal of Legal Studies</em>, 9(2): 191–226.\ndoi:10.1086/467636</li>\n<li>–––, 1986, <em>Law’s Empire</em>,\nCambridge, MA: Belknap Press.</li>\n<li>Fletcher, George P., 1972, “Fairness and Utility in Tort\nTheory”, <em>Harvard Law Review</em>, 85(3): 537–573.\ndoi:10.2307/1339623</li>\n<li>Gardner, John, 2001, “Obligations and Outcomes in the Law of\nTorts”, in Cane and Gardner 2001: 111–144.</li>\n<li>–––, 2011, “What Is Tort Law For? Part 1.\nThe Place of Corrective Justice”, <em>Law and Philosophy</em>,\n30(1): 1–50. doi:10.1007/s10982-010-9086-6</li>\n<li>–––, 2018, <em>From Personal Life to Private\nLaw</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198818755.001.0001</li>\n<li>Gilboa, Maytal, 2019, “Multiple Reasonable Behaviors Cases:\nThe Problem of Causal Underdetermination in Tort Law”, <em>Legal\nTheory</em>, 25(2): 77–104. doi:10.1017/S135232521900003X</li>\n<li>Gold, Andrew S., 2020, <em>The Right of Redress</em>, Oxford:\nOxford University Press. doi:10.1093/oso/9780198814405.001.0001</li>\n<li>Goldberg, John C. P. and Benjamin C. Zipursky, 2007, “Tort\nLaw and Moral Luck”, <em>Cornell Law Review</em>, 92(6):\n1123–1174. </li>\n<li>–––, 2020, <em>Recognizing Wrongs</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Gordley, James, 2006, <em>Foundations of Private Law: Property,\nTort, Contract, Unjust Enrichment</em>, Oxford/New York: Oxford\nUniversity Press.</li>\n<li>Green, Leon, 1959, “Tort Law Public Law in Disguise”,\n<em>Texas Law Review</em>, 38(1): 1–13.</li>\n<li>Hershovitz, Scott, 2014, “Tort as a Substitute for\nRevenge”, in <em>Philosophical Foundations of the Law of\nTorts</em>, John Oberdiek (ed.), Oxford: Oxford University Press,\n86–102 (chap. 4).\ndoi:10.1093/acprof:oso/9780198701385.003.0005</li>\n<li>–––, 2017, “The Search for a Grand Unified\nTheory of Tort Law”, <em>Harvard Law Review</em>, 130(3):\n942–970.</li>\n<li>Herstein, Ori J, 2015, “How Tort Law Empowers”,\n<em>University of Toronto Law Journal</em>, 65(1): 99–132.\ndoi:10.3138/utlj.2037</li>\n<li>Holmes, Oliver Wendell, 1881, <em>The Common Law</em>, Boston:\nLittle, Brown.</li>\n<li>–––, 1894, “Privilege, Malice, and\nIntent”, <em>Harvard Law Review</em>, 8(1): 1–14.\ndoi:10.2307/1322381</li>\n<li>–––, 1897, “The Path of the Law”,\n<em>Harvard Law Review</em>, 10(8): 457–478.\ndoi:10.2307/1322028</li>\n<li>Honoré, Tony, 1999, <em>Responsibility and Fault</em>,\nOxford, UK/Portland, OR: Hart Publishing.</li>\n<li>Justinian, 533, <em>Digesta</em>. Latin text and translation as\n<em>The Digest of Justinian</em>, Alan Watson (trans.), Theodor\nMommsen (ed.), Philadelphia, PA: University of Pennsylvania Press,\n1985.</li>\n<li>Kant, Immanuel, 1797, <em>Die Metaphysik der Sitten</em>,\nKönigsberg. Translated as “The Metaphysics of Morals\n(1797)”, in <em>Practical Philosophy</em>, Mary J. Gregor\n(trans.), Cambridge: Cambridge University Press, 1996, 353–604.\ndoi:10.1017/CBO9780511813306.013</li>\n<li>Keating, Gregory C., 1996, “Reasonableness and Rationality\nin Negligence Theory”, <em>Stanford Law Review</em>, 48(2):\n311–384. doi:10.2307/1229365</li>\n<li>–––, 1997, “The Idea of Fairness in the\nLaw of Enterprise Liability”, <em>Michigan Law Review</em>,\n95(5): 1266–1380.</li>\n<li>–––, 2021, “Form and Substance in the\n‘Private Law’ of Torts”, <em>Journal of Tort\nLaw</em>, 14(1): 45–99.</li>\n<li>Murphy, John, 2019, “The Heterogeneity of Tort Law”,\n<em>Oxford Journal of Legal Studies</em>, 39(3): 455–482.\ndoi:10.1093/ojls/gqz008</li>\n<li>Oman, Nathan B., 2011, “Consent to Retaliation: a Civil\nRecourse Theory of Contractual Liability”, <em>Iowa Law\nReview</em>, 96(2): 529–580.</li>\n<li>Owen, David G. (ed.), 1995, <em>Philosophical Foundations of Tort\nLaw</em>, Oxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780198265795.001.0001</li>\n<li>Perry, Stephen R., 2001, “Honoré on Responsibility\nfor Outcomes”, in Cane and Gardner 2001: 61–80.</li>\n<li>Pollock, Frederick, 1897, <em>The Law of Torts: A Treatise on the\nPrinciples of Obligations Arising from Civil Wrongs in the Common\nLaw</em>, fifth edition, London: Stevens and Sons.</li>\n<li>Posner, Richard A., 1972, “A Theory of Negligence”,\n<em>The Journal of Legal Studies</em>, 1(1): 29–96.\ndoi:10.1086/467478</li>\n<li>–––, 1983, <em>The Economics of Justice</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2013. “Instrumental and\nNoninstrumental Theories of Tort Law”, <em>Indiana Law\nJournal</em>, 88(2): 469–525.</li>\n<li>Price Waterhouse Cooper, 2008, <em>Accident Compensation\nCorporation New Zealand Scheme Review</em>, report commissioned by\nAccident Compensation Corporation, March 2008.</li>\n<li>Prosser, William L., 1941, <em>Handbook of the Law of Torts</em>,\nSt. Paul, MN: West Publishing.</li>\n<li>Ripstein, Arthur, 1998, “Some Recent Obituaries of Tort\nLaw”, <em>The University of Toronto Law Journal</em>, 48(4):\n561–574. doi:10.2307/826028</li>\n<li>–––, 2007, “Closing the Gap”,\n<em>Theoretical Inquiries in Law</em>, 9(1): 61–95.\ndoi:10.2202/1565-3404.1169</li>\n<li>–––, 2011, “Civil Recourse and Separation\nof Wrongs and Remedies”, <em>Florida State University Law\nReview</em>, 39(1): 163–207.</li>\n<li>–––, 2016, <em>Private Wrongs</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Ripstein, Arthur and Benjamin C. Zipursky, 2001, “Corrective\nJustice in an Age of Mass Torts”, in <em>Philosophy and the Law\nof Torts</em>, Gerald J. Postema (ed.), Cambridge: Cambridge\nUniversity Press, 214–249. doi:10.1017/CBO9780511498671.006</li>\n<li>Sage, Nick, 2021, “Relational Wrongs and Agency in Tort\nTheory”, <em>Oxford Journal of Legal Studies</em> 41(4):\n1012–1039. doi:10.1093/ojls/gqab009</li>\n<li>Seavey, Warren A., 1942, “Principles of Torts”,\n<em>Harvard Law Review</em>, 56(1): 72–98.\ndoi:10.2307/1334778</li>\n<li>Sharkey, Catherine M., 2018, “In Search of the Cheapest Cost\nAvoider: Another View of the Economic Loss Rule”, <em>University\nof Cincinnati Law Review</em>, 85(4): 1017–1053.</li>\n<li>Smith, Stephen A., 2012, “Duties, Liabilities, and\nDamages”, <em>Harvard Law Review</em>, 125(7):\n1727–1756.</li>\n<li>–––, 2019, <em>Rights, Wrongs, and Injustices:\nThe Structure of Remedial Law</em>, (Oxford Private Law Theory),\nOxford: Oxford University Press.\ndoi:10.1093/oso/9780199229772.001.0001</li>\n<li>Stapleton, Jane, 2021, <em>Three Essays on Torts</em>, (Clarendon\nLaw Lectures), Oxford: Oxford University Press.\ndoi:10.1093/oso/9780192893734.001.0001</li>\n<li>Steel, Sandy, 2015a, <em>Proof of Causation in Tort Law</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9781107273689</li>\n<li>–––, 2015b, “Justifying Exceptions to\nProof of Causation in Tort Law”, <em>Modern Law Review</em>,\n<em>78</em>(5): 729–758.</li>\n<li>–––, 2020, “Compensation and\nContinuity”, <em>Legal Theory</em>, 26(3): 250–279.\ndoi:10.1017/S1352325220000221</li>\n<li>–––, 2021, “On the Moral Necessity of Tort\nLaw: The Fairness Argument”, <em>Oxford Journal of Legal\nStudies</em>, 41(1): 192–218. doi:10.1093/ojls/gqaa045</li>\n<li>Steel, Sandy, and Robert Stevens, 2020, “The Secondary Legal\nDuty to Pay Damages”, <em>Law Quarterly Review</em>, 136(2):\n283–291.</li>\n<li>Stevens, Robert, 2019, “Professor Sir Frederick Pollock\n(1845–1937): Jurist as Mayfly,” in <em>Scholars of Tort\nLaw</em>, James Goukamp and Donal Nolan (eds.), Oxford: Hart\nPublishing, 75–102.</li>\n<li>Stone, Rebecca, 2022, “The Circumstances of Civil\nRecourse”, <em>Law and Philosophy</em>, 41(1): 39–62.\ndoi:10.1007/s10982-021-09411-z</li>\n<li>Thomas, Jean, 2019, “The Promise of Contractualism in Tort\nLaw”, <em>Jurisprudence</em>, 10(3): 408–421.</li>\n<li>Thomson, Judith J., 1984, “Remarks on Causation and\nLiability”, <em>Philosophy &amp; Public Affairs</em>, 13(2):\n101–133.</li>\n<li>Waldron, Jeremy, 1997, “Moments of Carelessness and Massive\nLoss”, in Owen 1995: 387–408.\ndoi:10.1093/acprof:oso/9780198265795.003.0018</li>\n<li>Weinrib, Ernest, 1995, <em>The Idea of Private Law</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Weir, Tony, 2006, <em>An Introduction to Tort Law</em>, second\nedition, (Clarendon Law Series), Oxford/New York: Oxford University\nPress.</li>\n<li>Woodhouse Report, 1967, <em>Compensation for Personal Injury in\nNew Zealand,</em> Wellington, NZ: Government Printer.</li>\n<li>Zipursky, Benjamin C., 2003, “Civil Recourse, not Corrective\nJustice”, <em>The Georgetown Law Journal</em>, 91(3):\n695–756.</li>\n</ul>\n<h3 id=\"LegaCase\">Legal Cases</h3>\n<ul class=\"hanging\">\n<li><em>Hall v Brooklands Auto Racing Club</em>, [1933] 1 KB 205.</li>\n<li><em>McQuire v Western Morning News</em> [1903] 2 KB 100.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "causation: in the law",
            "contract law, philosophy of",
            "fairness",
            "legal obligation and authority",
            "legal philosophy: economic analysis of law",
            "legal rights",
            "nature of law",
            "property and ownership"
        ],
        "entry_link": [
            {
                "../causation-law/": "causation: in the law"
            },
            {
                "../contract-law/": "contract law, philosophy of"
            },
            {
                "../legal-obligation/": "legal obligation and authority"
            },
            {
                "../legal-econanalysis/": "legal philosophy: economic analysis of law"
            },
            {
                "../legal-rights/": "legal rights"
            },
            {
                "../lawphil-nature/": "nature of law"
            },
            {
                "../property/": "property and ownership"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=tort-theories\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/tort-theories/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=tort-theories&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/tort-theories/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=tort-theories": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/tort-theories/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=tort-theories&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/tort-theories/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Coleman, Jules,  Scott Hershovitz, and Gabriel Mendlow,\n“Theories of the Common Law of Torts”, \n <em>Stanford Encyclopedia of Philosophy</em> (Spring 2022 Edition),\nEdward N. Zalta (ed.), URL = \n &lt;<a href=\"https://plato.stanford.edu/archives/spr2022/entries/tort-theories/\">https://plato.stanford.edu/archives/spr2022/entries/tort-theories/</a>&gt;.\n [This was the previous entry on this topic in the <em>Stanford\nEncyclopedia of Philosophy</em> – see the \n<a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=tort-theories\" target=\"other\">version history</a>.]"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/spr2022/entries/tort-theories/": "https://plato.stanford.edu/archives/spr2022/entries/tort-theories/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=tort-theories": "version history"
            }
        ]
    }
}