{
    "url": "twotruths-india",
    "title": "The Theory of Two Truths in India",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Sonam Thakchoe\n<sonam.thakchoe@utas.edu.au>",
        "author_links": [
            {
                "http://fcms.its.utas.edu.au/arts/philosophy/pagedetails.asp?lpersonId=2144": "Sonam Thakchoe"
            },
            {
                "mailto:sonam%2ethakchoe%40utas%2eedu%2eau": "sonam.thakchoe@utas.edu.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://fcms.its.utas.edu.au/arts/philosophy/pagedetails.asp?lpersonId=2144\" target=\"other\">Sonam Thakchoe</a>\n&lt;<a href=\"mailto:sonam%2ethakchoe%40utas%2eedu%2eau\"><em>sonam<abbr title=\" dot \">.</abbr>thakchoe<abbr title=\" at \">@</abbr>utas<abbr title=\" dot \">.</abbr>edu<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Feb 17, 2011",
        "substantive revision Mon May 16, 2022"
    ],
    "preamble": "\n\nThe theory of the two truths has a twenty-five century long history\nbehind it. It has its origin in the sixth century\n BCE[1]\n India with the emergence of the Siddhārtha Gautama. It is said,\naccording to the Pitāpūtrasamāgama-sūtra,\nSiddhārtha became a buddha “awakened one” because he\nfully understood the meaning of the two truths—conventional\ntruth (saṁvṛti-satya) and ultimate truth\n(paramārtha-satya)—and that the reality of all the objects\nof knowledge, the text says, is exhaustively comprised of the two\ntruths (Sde Dge, dkon brtsegs nga, 60b). The theory of the\ntwo truths, according to the\nSamādhirāja-sūtra, is a unique contribution\nmade by the Buddha towards Indian philosophy. This text states:\n“the knower of the world, without hearing it from others, taught\nthat there are the two truths” (Sde dge, mdo-sde da\n174b–210b). Nāgārjuna, in his\nMūlamadhyamakakārikā [MMK], attributes the two\ntruths to the Buddha as follows: “the Dharma taught by the\nbuddhas is precisely based on the two truths: a truth of mundane\nconventions and a truth of the ultimate” ([MMK] 24:8).\n\nThe Madhyamaka philosophers claim the theory of the two truths is the\nheart of the Buddha’s philosophy. According to them, it serves as the\nmirror reflecting the core message of the Buddha’s teachings and the\nmassive philosophical literature it inspired. At the heart of the\ntheory of the two truths is the Buddha’s ever poignant existential and\nsoteriological concerns about the reality of things and of life.\nNirvāṇ ultimate freedom from the suffering conditioned by\ndesires, is only ever achieved, according to the theory of the two\ntruths, from a correct understanding of two truths. Knowledge of the\nconventional truth informs us how things are conventional, from the\nordinary commonsense perspective and thus grounds our epistemic\npractice in its proper linguistic and conceptual conventional\nframework. Knowledge of the ultimate truth informs us of how things\nreally are ultimate, from the ultimate analytical perspective and so\ntakes our minds beyond the bounds of conceptual and linguistic\nconventions.\n\nIn the theory of the two truths, as we know it today, maybe unknown to\nthe earliest start of Buddhist thought in India. Contemporary\nscholarship suggests that the Buddha himself may not have made any\nexplicit reference to the two truths. The early textual materials such\nas Pali Nikāyas and āgamas ascribe to the Buddha does not\nmake explicit mention of the distinction of the two truths. Recent\nstudies also suggest that the two truths distinction is an innovation\non the part of the Abhidhamma which came into prominence originally as\na heuristic device, useful for later interpreters to reconcile\napparent inconsistent statements in the Buddha’s teachings\n(Karunadasa, 2006: 1; 1996: 25–6 and n.139, The Cowherds, 2011; 5).\nThis distinction is however not entirely disconnected from the\nBuddha’s teachings. The antecedent hermeneutic distinctions drawn in\nthe Aṅguttara Nikāya (AN II.60) between two linguistic\nconcepts (paññatti) – nitattha (Skt.\nnitārtha) and neyyatta (Skt. neyārtha)\n– provides us with a useful insight into the rationale basis\nfrom which later develops the formulation of the two truths\ndistinction. This latter pair of terms deals with the hermeneutic\nstrategies explaining the purported meaning of the Buddhist scriptural\nstatements. Nitattha is a statement the meaning of which is\n“drawn out” (nita-attha), definitive and explicit,\ntaken as its stands, and neyyattha is a statement the meaning of which\nis “to be drawn out” (neyya-attha) and interpretive\n(Karunadasa, 1996: 25). The commentary (Aṅguttaranikāya\nAṭṭhakatah II.118) on the Aṅguttara Nikāya\nII.60 explores nitattha/neyyattha distinction’s connection with the\nsammuti/paramattha distinction. This simple heuristic device however\nstimulated rich philosophical exchanges amongst the Buddhist\nphilosophers and practitioners, not to mention the exchanges with\ntraditional Hindu thinkers. The exchange of different ideas and views\nof the two truths between the early Buddhists, among other factors,\ngave birth to Buddhism as the philosophy we know today. The\ntransformation of the two truths theory from a simple hermeneutic\nstrategy to a complex system of thought with highly sophisticated\nontological, epistemological and semantic theories blurring a clear\nmethodological distinction between “reality” and\n“truth”. As always two terms – reality and truth\n– are expressed with one Sanskrit term satya; often\nreality/truth is seen as having an interchangeable usage and meaning.\nThis philosophical development is perhaps the most significant\ncontribution resulting from the schisms the Buddhism experienced after\nthe Buddha passed away (ca. 380 BCE). Various schools with varying\ninterpretations of the Buddha’s words soon appeared in Buddhism, which\nresulted in a rich and vibrant philosophical and hermeneutic\natmosphere.\n\nIn later years, Sarvāstivādin (Vaibhāṣika) and\nSautrāntika, Madhyamaka (from the first century CE onwards) and\nYogācāra (ca. sixth century CE onwards) became the dominant\nschools. Our investigation of the theory of the two truths will\nbriefly focus on how these schools have received, interpreted and\nunderstood it. Although all these schools regard the theory of two\ntruths as the centrepiece of the Buddha’s philosophy, all have\nnevertheless adopted very different approaches to the theory. As we\nshall see each understood and interpreted the two truths in different\nways, and are often fundamentally and radically opposed to each\nother.\n",
    "toc": [
        {
            "#AabSarVai": "1. Ābhidharmikas / Sarvāstivāda (Vaibhāṣika)"
        },
        {
            "#AbhConTru": "1.1 Conventional truth"
        },
        {
            "#AbhUltTru": "1.2 Ultimate truth"
        },
        {
            "#Sau": "2. Sautrāntika"
        },
        {
            "#SauUltTru": "2.1 Ultimate truth"
        },
        {
            "#SauConTru": "2.2 Conventional truth"
        },
        {
            "#Yog": "3. Yogācāra"
        },
        {
            "#YogConTru": "3.1 Conventional Truth"
        },
        {
            "#YogUltTru": "3.2 Ultimate truth"
        },
        {
            "#Mad": "4. Madhyamaka"
        },
        {
            "#SvaMad": "4.1 Svātantrika Madhyamaka"
        },
        {
            "#PraMad": "4.2 Prāsaṅgika Madhyamaka"
        },
        {
            "#Con": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#AbbCitWor": "List of Abbreviations"
        },
        {
            "#PriLit": "Primary Literature"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Ābhidharmikas / Sarvāstivāda (Vaibhāṣika)\n\nIn the fourth century, Vasubandhu undertook a comprehensive survey of\nthe Sarvāstivāda School’s thought, and wrote a compendium,\nTreasury of Knowledge,\n(Abhidharmakośakārikā [AK]; Mngon pa\nku 1b–25a) with his own Commentary on the Treasury of\nKnowledge (Abhidharmakośabhāṣya [AKB],\nMngon pa ku 26b–258a). This commentary not only offers\nan excellent account of the Sarvāstivādin views, including\nthe theory of the two truths, but also offers a sharp critique of many\nviews held by the Sarvāstivādins. Vasubandhu based his\ncommentary on the Mahāvibhāṣā (The\nGreat Commentary), as the Sarvāstivādins held their\nphilosophical positions according to the teachings of the\nMahāvibhāṣā. Consequently,\nSarvāstivādins are often known as\nVaibhāṣikas.\n\nThe Sarvāstivādin’s\n ontology[2]\n or the theory of the two truths makes two fundamental claims.\n\nthe claim that the ultimate reality consists of irreducible\nspatial units (e.g., atoms of the material category) and irreducible\ntemporal units (e.g., point-instant consciousnesses) of the five basic\ncategories, and\nthe claim that the conventional reality consists of reducible\nspatial wholes or temporal continua.\n\n\nTo put the matter straightforwardly, for the Sarvāstivādins,\nwholes and continua are only conventionally real, whereas the atoms\nand point-instant consciousness are only ultimately real.\n1.1 Conventional truth\n\nTo see how the Sarvāstivādins defend these two claims, we\nshall have a close look at their definitions of the two truths. We\nwill examine conventional truth first. This will provide the argument\nin support of the second claim. In the Abhidharmakośa\nVasubandu defines conventional truth/reality as follows: “An\nentity, the cognition of which does not arise when it is destroyed\nand, mentally divided, is conventionally existent like a pot and\nwater. Ultimate existence is otherwise.” ([AK] 6.4, Mngon\npa khu 7ab) Whatever is, on this definition, designated as\n“conventionally existent” is taken to be\n“conventionally real” or conventional truth when the idea\nor concept of which ceases to arise when it is physically destroyed,\nby means of a hammer for instance. Or its properties such as shape are\nstripped away from it by means of subjecting it under analysis,\nthereby conceptually excluding them. A pot and water are designated as\nconventionally existent therefore conventionally real for the concept\n“pot” ceases to exist when it is destroyed physically, and\nthe concept “water” no longer arises when we conceptually\nexclude from it its shape, colour etc.\n\nOn the Sarvāstivādin definition, for an entity to be real,\nit does not need to be ultimately real, exclusively. For a thing to be\nultimately real is for that thing to be “foundationally\nexistent” (dravya-sat / rdzas\n yod)[3]\n in contrast with being “compositely existent”\n(avayavidravya / rdzas grub). By “foundationally existent”\nthe Sarvāstivādin refer to the entity which is fundamentally\nreal, the concept or the cognition of which is not dependent on\nconceptual construction, hence not conceptually existent\n(prajñaptisat) nor a composition of the aggregative phenomena.\nIn the case of foundational existent there always remains something\nirreducible to which the concept of the thing applies, hence it is\nultimately real. A simple entity is not reducible to conceptual forms,\nor conventional designations, nor is it compositely existent entity.\nWe will have lot more to say on this point shortly.\n\nPot and water are not the foundational entities. They are rather\ncomposite entities (avayavi-dravya / rdzas grub). By composite entity,\nwe mean an entity or existent which is not fundamental, primary or\nsimple, but is rather a conceptually constructed\n(prajñaptisat), composition of various properties, and is thus\nreducible both physically and logically.\n\nHence for the Sarvāstivādin, conventional reality\n(samvṛtisatya), composite-existence (avayavi-dravya / rdzas\ngrub), and the lack of intrinsic reality (niḥsvabhāva) are\nall equivalents. A conventional reality is therefore characterised as\na reducible conventional entity on three grounds: (i) conventional\nreality is both physically and logically reducible, as it\ndisintegrates when it is subjected to physical destruction and\ndisappears from our minds when its parts are separated from it by\nlogical analysis; (ii) conventional reality borrows its identity from\nother things including its parts, concepts etc., it does not exist\nindependently in virtue of its intrinsic reality\n(niḥsvabhāva), the exclusion of its parts and concepts thus\naffects and reduces its inherent nature; and (iii) conventional\nreality is a product of mental constructions, like that of\nconventionally real wholes, causation, continuum etc, and it does not\nexists intrinsically.\n1.2 Ultimate truth\n\nThe definition of the ultimate reality, as we shall see, offers the\nSarvāstivādin response to the claim that ultimate reality\nconsists of irreducible atoms and point-instant moments. In glossing\nthe [AK] 6.4 verse his commentary explains that ultimate reality is\nregarded as ultimately existent, one that is both physically and\nlogically irreducible. Vasubandhu supplies three arguments to support\nthis: (i) ultimate reality is both physically and logically\nirreducible, as it does not disintegrate when it is subjected to\nphysical destruction and that its identity does not disappear when its\nparts are separated from it under logical analysis; and (ii) ultimate\nreality does not borrow its nature from other things including its\nparts. Rather it exists independently in virtue of its intrinsic\nreality (svabhāva), the exclusion of its parts thus does\nnot affect its inherent nature; and (iii) it is not a product of\nmental constructions, like that of conventionally real wholes,\ncausation, continuum etc. It exists intrinsically ([AKB] 6.4,\nMngon pa khu 214a).\n\nUltimate reality is of two types: the compounded\n(saṁskṛta) ultimate, and the uncompounded\n(asaṁskṛta) ultimate. The uncompounded ultimate consists\nof (a) space (akāśa), and (b)\nnirvāṇa—analytical cessation\n(pratisaṁkyā-nirodha) and non-analytical cessation\n(apratisaṁkhyā-nirodha). These three ultimates are\nuncompounded as each is seen as being causally unconditioned. They are\nnonspatial concepts. These concepts do not have any physical referent\nwhatsoever. Space is a mere absence of entity. Analytical and\nnonanalytical cessations are the two forms of nirvāṇa,\nwhich is simply freedom from afflictive suffering, or the elimination\nof afflictive suffering. These concepts are not associated in positing\nany thing that can be described as remotely physical. They are thus\nthe concepts that are irreducible physically and logically.\n\nThe compounded ultimate consists of the five aggregates—material\naggregate (rūpa), feeling aggregate (vedanā),\nperception-aggregate (saṁjñā), dispositional\naggregate (saṁskāra), and consciousness-aggregate\n(vijñāna)—since they are causally produced, and the\nideas of each aggregate are conceived individually rather than\ncollectively. If the aggregates, the ideas of which are conceived\ncollectively as a whole(s) or a continuum/continua, they could not be\nultimately real. The collective concepts of the aggregate as a\n“whole” or as a “continuum” subject to\ncessation as they cease to appear to the mind, get excluded from the\nconceptual framework of the reality of the five aggregates when they\nare logically analysed.\n2. Sautrāntika\n\nThe\n philosophers[4]\n who championed this view are some of the best-known Indian logicians\nand epistemologists. Other great names who propogated the tradition\ninclude Devendrabuddhi (?), Śākhyabuddhi (?), Vinitadeva\n(630–700), Dharmottara (750–810), Mokṣakaragupt (ca.\n1100–1200). Dignāga (480–540) and Dharmakīrti\n(600–660) are credited to have founded this school. For the\ntheory of the two truths in the Sautrāntika we will need to rely\non the following texts:\n\nDignāga’s Compendium of Epistemology\n(Pramāṇasamuccaya, Tshad ma ce\n1b–13a),\nDignāga’s Auto-commentary on the Compendium of\nEpistemology (Pramāṇasamuccayavṛtti, Tshad\nma ce 14b–85b),\nDharmakīrti’s Verses on Epistemology\n(Pramāṇavārttikakārikā [PVK];\ntshad ma ce 94b–151a),\nDharmakīrti’s Commentary on the Verses of\nEpistemology (Pramāṇavārttikavṛtti\n[PVT]; tshad ma ce 261b–365a),\nDharmakīrti’s Ascertainment of Epistemology\n(Pramāṇaviniścaya, tshad ma ce\n152b–230a),\nDharmakīrti’s Dose of Logical Reasoning\n(Nyāyabindu, tshad ma ce 231b–238a).\n\n\nBroadly, all objects of knowledge are classified into two realities\nbased on the ways in which right-cognition (pramāṇa)\nengages with its object. They are either directly accessible\n(pratyakṣa), which constitutes objects that are obvious\nto cognition, or they are directly inaccessible\n(parokṣa), which constitutes objects that are occulted,\nor obscured from cognition. A directly accessible object is\nprincipally known by a direct perceptual right-cognition\n(pratyaṣa-pramāṇa), whereas a directly inaccessible\nobject is principally known by an inferential right-cognition\n(anumāna-pramāṇa).\n2.1 Ultimate truth\n\nOf the two types of objects, some are ultimately real while others are\nonly conventionally real, and some are not even conventionally real,\nthey are just unreal, or fictions. In defining ultimate truth in the\nSautrāntika tradition, we read in Dharmakīrti’s Verses on\nEpistemology: “That which is ultimately causally efficient is\nhere an ultimately existent (paramārthasat). Conventionally\nexistent (saṁvṛtisat) is otherwise. They are declared as\nthe definitions of the unique particular (svalakṣaṇa) and\nthe universal (sāmāṅyalakṣaṇa)”\n(Dharmakīrti [PVK] Tshad ma ce 118b).\n\nUltimate truth is, on this definition, a phenomenon (dharma) that is\nultimately existent, and ultimately existent are ultimately causally\nefficient. Phenomenon that is ultimately causally efficient is\nintrinsically or objectively real, existing in and of itself as a\n“unique particular”\n (svalakṣaṇa).[5]\n By “unique particular” Dharmakīrti means ultimately\nreal phenomenon—dharma that is self-defined, uniquely\nindividual, objectively real, existing independent of any conceptual\nfabrication, ultimately causally efficient (artha), a dharma which\nserves as an objects of direct perception, dharma that presents itself\nto the cognitions as distinctive/unique individuals.\n\nIn the Commentary on the Verses of Epistemology, Dharmakīrti\ncharacterises (Tshad ma ce 274b–279b) all ultimately\nreal unique particulars exist as distinct individuals with their own\nintrinsic natures. And they satisfy three criteria:\n\nThey have determinate spatial locations (deśaniyata / yul\nnges pa) of their own, as real things do not have a shared property\namongst themselves. The real fire we see is either near or far, or at\nthe left or the right, or at the back or in the front. By contrast,\nthe universal\n fireness[6],\n that is, the concept of being a fire, does not occupy a determinate\nposition.\nUnique particulars are temporally determinate (kālaniyata /\ndus nges pa or dus ma ‘dres pa). They are only momentary\ninstants. They spontaneously go out of existence the moment they have\ncome into existence. This is not the case with the universals. Being\npurely conceptually constructed, they remain uninfluenced by the\ndynamism of causal conditions and hence are not affected by time.\nUnique particulars are ontologically determinate\n(ākāraniyata / ngo bo nges pa / ngo bo ma ‘dres pa) as\nthey are causally conditioned; the effects of the aggregation of the\ncausal conditions that have the ability to produce them. When those\ncausal conditions come together at certain points in time, unique\nparticulars come into existence. When those conditions disintegrate\nand are not replaced by new conditions, unique particulars go out of\nexistence. When the conditions have not yet come together, unique\nparticulars are yet to obtain their ontological status.\n\n\nSo “determinate intrinsic natures of the unique\nparticulars,” Dharmakīrti argues in Commentary on the\nVerses of Epistemology, “are not accidental or fortuitous since\nwhat is not determinate cannot be spatially, temporally and\nontologically determinate” (Tshad ma ce 179a).\n\nThe unique particulars are, Sautrāntika claims, ultimately real,\nand they supply us four arguments to support the claim:\n\n(1) Unique particulars are causally efficient phenomena\n(arthakriyāsamartha) ([PVT] Tshad ma ce 179a) because:\n(a) they have ability to serve pragmatic purpose of life—fulfil\nthe objectives in our life, and (b) ability to produce a variety of\ncognitive images due to their remoteness or proximity. (Dharmottara’s\nNyābinduṭīkā Tshad ma we 36b–92a)\nBoth of these abilities must be associated exclusively with objects of\ndirect perception (Tshad ma we 45a).\n\n(2) Unique particulars present themselves only to a direct perceptual\ncognition as distinct and uniquely defined individuals because unique\nparticulars are, as Dharmakīrti’s Nyāyabindu points\nout “the objects whose nearness or remoteness presents the\ndifference of cognitive image” (Tshad ma ce 231a) and\nthat object alone which produces the impression of vividness according\nto its remoteness or proximity, exists ultimately\n(DharmottaraTshad ma we 44b–45a).\n\n(3) Unique particulars are not denotable by language since they are\nbeyond the full grasp of any conceptual mind\n(śabdasyāviśaya). Although unique particulars are\nobjective references of language and thought, and we may have firm\nbeliefs about them, conceptual mind does not fully grasp their real\nnature. They are ultimately real, directly cognisable by means of\ncertain perceptions without reliance on other factors (nimitta) such\nas language and thought. Therefore they must exist. They are the sorts\nof phenomena whose cognition would not occur if they are not\nobjectively real.\n\nIn the Sautrāntika ontology ultimately real/existent (synonymous)\nunique particulars are classified into three kinds:\n\nmomentary instants of matter (rūpa),\nmomentary instants of consciousness (vijñāna) and\nmomentary instants of the non-associated composite phenomena,\nwhich are neither matter nor minds or mental factors\n(citta-caitta-viprayukta-saṃskāra).\n\n\nThe Sautrāntika’s theory of ultimate truth mirrors its ontology\nof flux in which unique particulars are viewed as spatially\ninfinitesimal atoms constituting temporally momentary events\n(kṣaṇika) or as successive flashes of consciousnesses,\ncognitive events, all devoid of any real continuity as substratum.\nUnique particulars are ultimately real, although they are not enduring\nsubstances (dravyas) inhering in it’s qualities (guṇas) and\nactions (karmas) as the Naiyāyika-Vaiśeṣika claims.\nThey are rather bundles of events arising and disappearing instantly.\nEven continuity of things and motion are only successive events\nclosely resembling each other. On this theory ultimate realities are\nmomentary point instants, and Vasubandhu and Dharmakīrti both\nargue that no conditioned phenomenon, therefore, no ultimately real\nunique particulars, endure more than a single moment—hence they\nare momentary instants (kṣaṇika).\n\nFour closely interrelated arguments provide the defence of the\nSautrāntika’s claim that ultimately real unique particulars are\nmomentary instants. Vasubandhu and Dharmakīrti both employ the\nfirst two arguments. The third argument is one Dharmakīrti\nspecialises in his works.\n\n(1) Ultimately real unique particulars are momentary instants because\ntheir perishing or destruction is spontaneous to their becoming. This\nfollows because (i) unique particulars are inherently self-destructive\n(Vasubandhu [AKB], Mngon pa khu 166b–167a), and (ii)\ntheir perishing or cessation is intrinsic and does not depend\non any other extrinsic causal factors (Dharmakīrti,\n[PVK] Tshad ma ce 102a; [PVT], Tshad ma ce\n178ab).\n\n(2) The ultimately real unique particulars are momentary instants\nbecause they are motionless, and do not move from one temporal or\nspatial location to another. They perish just where they were born\nsince nothing exists later than its acquisition of existence\n(Vasubandhu [AKB] Mngon pa khu 166b).\n\n(3) The third argument proves momentary instants of unique particulars\nfrom the inference of existence (sattvānumāna). This is a\ncase of the argument from identity of existence and production\n(svabhāvahetu). All unique particulars which are ultimately\nexistent, are necessarily produced, since only those that are\nultimately existent, insofar as Dharmakīriti is concerned, are\nable to a perform causal function—i.e., to produce effects. And\ncausally efficient unique particulars imply constant change for the\nrenewal and the perishing of their antecedent identities, therefore,\nthey are momentary.\n\nFinally (4), unique particulars are ultimately real not only on the\nground that they constitute the final ontological status, but also\nbecause it forms the basis of the Sautrāntika soteriology. The\nattainment of nirvāṇa — the ultimate freedom from the\nafflictions of life—for the Sautrāntika, according to\nDharmakīrti’s Vādanyāya, has an immediate\nperception of the unique particulars as its necessary condition\n(Tshad ma che 108b–109a).\n2.2 Conventional truth\n\nDharmakīrti defines conventional truth, in his [PVK], as dharma\nwhich is “conventionally existent” and he identifies\nconventional truth with the “universal”\n (sāmānya-lakṣaṇa)[7]\n just as he identifies ultimate truth with unique particular\n(Tshad ma ce 118b). When a Sautrāntika philosopher\ndescribes a certain entity as a universal, he means a conceptual\nentity not apprehended by virtue of its own being. He means a general\nproperty that is conceptually constructed, appearing to be something\ncommon amongst all items in a certain class of objects. Unlike\nNyāya-Vaiśeṣika view where universals are regarded as\nobjectively real and eternal entities inhering in substances,\nqualities and particulars, universals, for the Sautrāntika are\npure conceptual constructs. Sautrāntika holds the view known as\nnominalism or conceptualism—the view that denies universals any\nindependent extramental objective reality existing on their own apart\nfrom being mentally constructed.\n\nWhile unique particulars exist independently of linguistic convention,\nuniversals have no reality in isolation from linguistic and conceptual\nconventions. Thus, universals and ultimate reality are mutually\nexclusive. Universals are therefore only conventionally real, lacking\nany intrinsic nature, whereas unique particulars are ultimately real,\nand exist intrinsically.\n\nThe Sautrāntika defends the claim that universals\n(sāmānya-lakṣaṇa) are only conventional reality\nfor the following reasons (tshad ma ce 118b):\n\nUniversals are domains of inferential cognition since they are\nexhaustively grasped by conceptual mind by means of language and\nthought (Dharmakīrti, Nyāyabindu, tshad ma\nce 231a).\nUniversals are objects of the apprehending cognition which arises\nsimply out of having beliefs about the objects without the need to see\nany real object.\nUniversals are causally inefficient. By “causal\ninefficiency,” the Sautrāntika, according to Dharmottara’s\nNyāyabinduṭīkā, (Tshad ma we\n45ab) means three things: (a) universals are purely conceptually\nconstructed, hence unreal; (b) universals are unable to serve a\npragmatic purpose as they do not fulfil life’s objectives; and (c)\ncognitive images produced by universals are independent of the\nproximity between objects and their cognitions since production of\nimage does not require seeing the object as it is in the case of\nperception and unique particulars.\nUniversals are products of unifying or mixing of language and\ntheir referential objects (unique particulars), and thus appearing\nthem to conceptual minds as generalities, unified wholes, unity,\ncontinuity, as phenomena that appear to conceptual mind to having\nshared properties linking with all items in the same class of\nobjects.\nUniversals, consequently, obscure the individualities of unique\nparticulars from being directly apprehended. This is because, as we\nhave already seen, universals, according to Dharmakīrti’s [PVK]\n(Tshad ma ce 97ab) and [PVT] (Tshad ma ce 282ab),\nare only conventionally real since they are conceptual constructs\nfounded on unifying and putting together the distinct individualities\nof unique particulars as having one common property being shared by\nall items in the same class.\n\n\nAccording to the Sautrāntika philosophy, language does not\ndescribe reality or unique particulars positively through real\nuniversals as suggested by the Naiyāyikas. The Sautrāntika\ndeveloped an alternative nominalist theory of universal called the\napoha-theory in which language is seen to engage with reality\nnegatively by means of elimination or exclusion of the other\n(anyāpoha / gzhan sel). On this theory, the function of language,\nspecifically naming, is to eliminate object from the class of\nthose objects to which language does not apply.\n\nIn brief the Sautrāntika’s theory of the two truths rests on\ndichotomising objects between unique particulars, which are understood\nas ultimately reals, dynamic, momentary, causally effective, the\nobjective domain of the direct perception; and universals, which are\nunderstood as only conventionally reals, conceptually constructed,\nstatic, causally ineffective and the objective domain of the\ninferential cognition.\n3. Yogācāra\n\nThe Vaibhāṣika’s realistic theory of the two truths and the\nSautrāntika’s representationalist theory of the two truths both\naffirm the ultimate reality of physical objects constituted by atoms.\nThe Yogācāra rejects physical realism of both the\nVaibhāṣika and the Sautrāntika, although it agrees\nwith the Sautrāntika’s representationalist theory as far as they\nboth affirm representation as the intentional objects in perception\nand deny in perception a direct access to any external object. Where\nthey part their company is in their response to the questions: what\ncauses representations? Is the contact of senses with physical objects\nnecessary to give rise to representations in perception? The\nSautrāntika’s reply is that external objects cause\nrepresentations, given that these representations are intentional\nobjects there is indeed a contact between senses and external objects.\nThis affirmative response allows the Sautrāntika to affirm\nreality of external objects. The Yogācārin however replies\nthat “subliminal impressions” (vāsanās) from\nfoundational consciousness (ālayavijñāna) are the\ncauses of the mental representations, and given that these impressions\nare only internal phenomena acting as intentional objects, the contact\nbetween senses and external objects is therefore rejected even\nconventionally. This allows the Yogācārin to deny even\nconventional reality of all physical objects, and argue that all\nconventional realities are our mental representations, mental\ncreations, cognitions etc.\n\nThe central thesis in the Yogācāra philosophy, the theory of\nthe two truths echoes is the assertion that all that is conventionally\nreal is only ideas, representations, images, creations of the mind,\nand that there is no conventionally real object that exists outside\nthe mind to which it corresponds. These ideas are only objects of any\ncognition. The whole universe is a mental universe. All physical\nobjects are only fiction, they are unreal even by the conventional\nstandard, similar to a dream, a mirage, a magical illusion, where what\nwe perceive are only products of our mind, without a real external\nexistence.\n\nInspired by the idealistic tendencies of various sūtras\nconsisting of important elements of the idealistic doctrines, in the\nthird and the fourth centuries many Indian philosophers developed and\nsystematised a coherent Idealist School. In the beginning of the\nViṃśatikā Vasubandhu treats citta,\nmanas, vijñāna, vijñāpti as\nsynonymous and uses these terms as the names of the idealistic school.\nThe chief founders were Maitreyanāth (ca. 300) and\nAsaṅga (315–390), propagated by Vasubandhu\n(320–380), Dignāga (480–540) Sthiramati (ca.\n500), Dharmapāla (530–561), Hiuan-tsang (602–664),\nDharmakīrti (600–660), Śāntarakṣita\n(ca.725–788) and Kamalaśīla (ca.740–795). The\nlast two are Yogācāra-Mādhyamikas in contrast with the\nearlier figures who are identified as Yogācārins.\n\nLike other Buddhist schools, the theory of the two truths captures the\ncentral Yogācāra doctrines. Maitreyanāth asserts in his\nVerses on the Distinction Between Phenomena and Reality\n(Dharmadharmatāvibhaṅga-kārikā,\nDDVK; Sems tsam phi 50b–53b)—“All this is\nunderstood to be condensed in two categories: phenomena (dharma) and\nreality (dharmatā) because they encompass all.”\n(DDVK 2, Sems tsam phi) By “All”\nYogācārin means every possible object of knowledge, and they\nare said to be contained in the two truths since objects are either\nconventional truth or ultimate truth. Things are either objects of\nconventional knowledge or objects of ultimate knowledge, and a third\ncategory is not admitted.\n3.1 Conventional Truth\n\nEtymologically the term conventional truth covers the sense of what we\nordinarily take as commonsensical truths. However, in contrast with\nnaïve realism associated with common sense notions of truths, for\nthe Yogācāra the term “conventional truth” has\nsomewhat a negative connotation. It exclusively refers to objects of\nknowledge like forms, sound etc., the mode of existence or mode of\nbeing which radically contradicts with the mode of its appearance, and\nthus they are false, unreal, and deceptive. Forms, sounds, etc., are\ndefined as conventional entities in that they are realities from the\nperspective of, or by the force of, three forms of convention:\n\nfabrication (asatkalpita),\nconsciousness (vijñāna), or\nlanguage, signifier, a convenient designator (śabda).\n\n\nA conventional truth is therefore a truth by virtue of being\nfabricated by the conceptual mind; or it is truth erroneously\napprehended by means of the dualistic consciousness; or it is true\nconcept, meaning, signified and designated by a convenient\ndesignator/signifier.\n\nBecause the Yogācārins admit three conventions, it also\nadmits three categories of conventional truths:\n\nfabricated phenomena;\nmind/consciousness; and\nlanguage since conventional truths exist due to the force of these\nthree conventions.\n\n\nThe first and the last are categories of imaginary phenomena\n(parikalpita) and the second is dependent phenomena (paratantra).\n\nThe Yogācāra’s claim that external objects are not even\nconventionally real, what is conventionally real are only our\nimpressions, and mental representations is one Vasubandhu closely\ndefends by means of the Yogācāra’s theory of the three\nnatures (trisvabhāva). In his Discernment of the\nThree Natures (Trisvabhāvakārikā, or\nTrisvabhāvanirdeśa [TSN]; Sems tsam shi\n10a–11b), Vasubandhu explains that the Yogācāra\nontology and phenomenology as consisting of the unity of three natures\n(svabhāva):\n\nthe dependent or other (paratantra);\nthe imaginary / conceptual (parikalpita); and\nthe perfect / ultimate (pariniṣpanna) ([TSN] 1,\nSems tsam shi 10a)\n\n\nThe first two account for conventional truth and the latter ultimate\ntruth. We shall consider the import of the three in turn.\n\nFirst, Vasubandhu defines the dependent nature as: (a) one that exists\ndue to being causally conditioned\n(pratyayādhīnavṛttitvāt), and (b) it is the basis\nof “what appears” (yat khyāti) mistakenly in our\ncognition as conventionally real, it is the basis for the\n“unreal conceptual fabrication” (asatkalpa) which is the\nphenomenological basis of the appearance of reified subjects and\nobjects ([TSN] 2 Sems tsam shi 10a). The implications of the\nYogācārin expression “what appears” to describe\nthe dependent nature are therefore twofold: (a) that the things that\nappear in our cognitions are exclusively the representations, which\nare the manifest forms of the subliminal impressions, and (b) that the\nentire web of conventional reality, which presents itself to our\ncognitions phenomenologically in various ways, is exclusively the\nappearance of those representations. Apart from those representations,\nconsciousnesses, which appear to be external objects, there is no\nconventionally real external content which corresponds to what\nappears.\n\nSecond, in contrast with the dependent nature which is the basis of\n“what appears” (yat khyāti), the imaginary nature\n(parikalpita), as Vasubandu defines it, is the mode of\nappearance “as it appears” (sau yathā khyāti) on\nthe ground that its existence is only an “unreal conceptual\nfabrication” (asatakalpo) ([TSN] 2, Sems tsam chi 10a).\nThe imaginary nature is only an “unreal conceptual\nconstruction” because of two reasons: (i) it is the dependent\nnature—representations—merely dually reified by the mind\nas an ultimately real subject, or self, or eg, and (ii) the imaginary\nnature is dualistic reification of beings and objects as existing\nreally and externally, there is no such reality.\n\nThird, given the fact that the dependent nature is devoid, or free\nfrom this duality, the imaginary nature is a mere superimposition on\nit. Hence nonduality, the perfect nature (pariniṣpanna) is\nultimate reality of the dependent nature.\n3.2 Ultimate truth\n\nIn the Commentary on the Sūtra of Intent\n(Ārya-saṃdhinirmocana-sūtra, Mdo sde\nca 1b–55b) it is stated that “Reality as it is, which is\nthe intentional object of a pure consciousness, is the definition of\nthe perfect nature. This must be so because it is with respect to this\nthat the Victorious Buddha attributed all phenomena as natureless,\nultimately.” (Mdo sde ca 35b) Vasubandhu’s [TSN]\ndefines “the perfect nature (pariniṣpanna) as the\neternal nonexistence of ‘as it appears’ of ‘what\nappears’ because it is unalterable.” ([TSN] 3, Sems\ntsam chi 10a) “What appears” is the dependent\nnature—a series of cognitive events, the representations.\n“As it appears” is the imaginary nature—the unreal\nconceptual fabrication of the subject-object duality. The\nrepresentations, (i.e., the dependent nature) appear in the cognition\nas if they have in them the subject-object duality, even though the\ndependent nature is wholly devoid of such subject-object duality. The\nperfect nature is therefore this eternal nonexistence of the imaginary\nnature—the duality—in the dependent nature.\n\nVasubandhu defines the perfect nature as the ultimate truth and\nidentifies it with mere-consciousness. “This is the ultimate\n(paramārtha) of the dharmas, and so it is the reality\n(tathatā) too. Because its reality is like this all the time, it\nis mere consciousness.” (Triṃ 25, Sems\ntsam shi 3b) Accordingly Sthiramati’s Commentary on the\nThirty Verses (Triṃśikābhāṣya\n[TriṃB], Sems tsam shi 146b–171b), explains\n“ultimate” (paramārtha) here as referring to\n“’ world-transcending knowledge’\n(lokottara-nirvikalpa-jñāna) in that there is\nnothing that surpasses it. Since it is the object of [the transcendent\nknowledge], it is the ultimate. It is even like the space in having\nthe same taste everywhere. It is the perfect nature, which is\nstainless and unchangable. Therefore, it is known as the\n‘ultimate.’” ([TriṃB], Sems tsam shi\n169ab)\n\nSo, as we can see the dependent and the imaginary natures together\nexplain the Yogācāra’s conventional reality and the perfect\nnature explains its conception of the ultimate reality. The first two\nnatures provide an argument for the Yogācāra’s empirical and\npractical standpoints (vyavahāra), conventional truth and the\nthird nature an argument for its ultimate truth. Even then the\ndependent nature alone is conventionally real and the perfect nature\nalone is ultimately real. By contrast, the imaginary nature is unreal\nand false even by the empirical and practical standards. This is true\nin spite of the fact the imaginary nature is constitutive of the\nconventional truth.\n\nSo, the perfect nature—nondual mind, i.e., emptiness\n(śūnyatā) of the subject-object duality—is the\nultimate reality of the Yogācāra conception. Ultimate truth\ntakes various forms as it is understood within the Yogācārin\ntradition. As Maitreyanātha states, ultimate truth takes three\nprimary forms—as emptiness it is the ultimate object, as\nnirvāṇa it is the ultimate attainment, and as nonconceptual\nknowledge it is the ultimate realization ([MVK], Sems tsam\nphi 42B).\n\nYogācāra Arguments\n\nThe core argument in support of the only mind thesis is the\nimpossibility of the existence of external objects. Vasubandhu\ndevelops this argument in his Viṃ 1–27 as does\nDignāga in his Examination of the Intentional Object\n(Ālambanaparīkṣāvṛtti,\nĀPV 1–8, Tshad ma ce 86a–87b)\nagainst the atomists (Naiyāyikas-Vaiśeṣika and\n Ābhidharmikas[8]).\n Against the Yogācāra idealist thesis the realist opponents,\nas Vasubandhu observes, raise three objections:—“If\nconsciousness (does) not (arise) out from an object (i) neither the\ndetermination or certainty (niyama) in regard to place (deśa) and\ntime (kāla), (ii) nor the indetermination or unexclusiveness\n(aniyama) in regard to the series of (consciousness) (iii) nor the\nperformance of the (specific) function (kṛtyakriya) are\nlogically possible (yuktā)” (Viṁ 2, Sems\ntsam shi 3a).\n\nVasubandhu offers his Yogācāra reply in the\nViṃ to these realist objections and insists that the\nidealist position does not face these three problems. The first\nproblem is not an issue for the Yogācāra since dreams\n(svapna) account for the spatio-temporal determination. In dreams, in\nthe absence of an external object, one still has the cognition of a\nwoman, or a man in only determinate / specific time and place, and not\narbitrarily and not everywhere and not in any moment. Neither is the\nsecond problem of the lack of an intersubjective agreement an issue\nfor the Yogācāra. The case of the pretas (hungry-ghosts)\naccount for intersubjective agreement as they look at water they\nalone, not other beings, see rivers of pus, urine, excrement, and\ncollectively hallucinates demons as the hell guardians. Although pus,\nurine, excrement and hell guardians are nonexistent externally, due to\nthe maturation of their collective karma, pretas exclusively\nexperience the series of cognitions (vijñapti), other beings do\nnot encounter such experience (Viṃ 3, Sems\ntsam shi). Nor is the lack of causal efficacy of the impressions\nor representations in the consciousness a problem for the\nYogācāra. As in the case of wet dreams, even without a union\nof the couple, the emission of semen can occur, and so the\nrepresentations in the consciousness are causally efficient even\nwithout the externally real object.\n\nYogācāra’s defensive arguments against the realist\nchallenges are quite strong. However unless Yogācāra is able\nto undermine the core realist thesis—i.e., reality of the\nexternal objects—and its key supporting argument—the\nexistence of atoms—then the debate could go either way.\nTherefore Yogācāra shows the nonexistence, or unreality of\nthe atoms as the basis of the external object to reject the realist\nposition.\n\nYogācāra’s impressions-only theory and the\nSautrāntika’s representationalist theory both explain our sensory\nexperience (the spatio-temporal determinacy, intersubjective\nagreement, and causal efficacy). They agree on what the observables\nare: mental entities, including mental images but also emotions such\nas desires. They also agree that karma plays vital role in explaining\nour experience. The realist theory, though, according to\nDignāga’s Investigation About the Support of the\nCognition (Ālambanaparīkṣāvṛ\ntti [ĀlamPV]) has to posit the reality of additional\nphysical objects, things that are in principle unobservable, given\nthat all we experience in the cognition are our impressions\n([ĀlamPV], Tshad ma ce 86a).\n\nIf the realist thesis were correct, then there would be three\nalternatives for the atoms to act as the intentional objects of\ncognition.\n\nAtoms of the things would be either one in the way the\nNyya-Vaieika conceives the whole as something constituted by\nparts but being single, one, different from the parts that\ncompose it, and having a real existence apart from the existence of\nthe parts. Or\nthings would have to be constituted by multiple atoms\ni.e., a number or a group of atoms coexisting one besides the other\nwithout forming a composite whole as a result of mutual\ncohesion between the atoms. Or\nthings would have to be atoms grouped together,\nmassed together as a unity among themselves with a tight cohesion.\nYogācāra contends that these are the only three alternatives\nin which the reality of the external objects can functioning as the\nobjects of cognition.\n\n\nOf the three alternatives: (1) points to the unity of a thing\nconceived as a whole; and (2) and (3) point to the\nmultiplicity looking at the things as loose atoms, i.e.,\ncomposite atoms. Not one of the three possibilities is, on\nYogācāra’s account, admissible as the object of cognition\nhowever. The first is inadmissible because nowhere an external object\nis grasped as a unity, whole, one apart\nfrom its parts ([ĀlamPV] Tshad ma ce 86b). The second is\ninadmissible because when we see things we find that the atoms are not\nperceived individually as one by one ([Viṃ] 13, Sems\ntsam shi 3b). The third alternative is also rejected because the\natoms in this case cannot be proved to exist as an indivisible\n([Viṃ] 14, Sems tsam shi 3b).\n\nFurther, if there were a simultaneous conjunction of an atom with\nother six atoms coming from the six directions, the atom would have\nsix parts because that which is the locus of one atom cannot be the\nlocus of another atom. If the locus of one atom were the locus of the\nsix atoms, which were in conjunction with it, then since all the seven\natoms would have the same common locus, the whole mass constituted by\nthe seven atoms would be of the size of a single atom, because of the\nmutual exclusion of the occupants of a locus. Consequently, there\nwould be no visible mass (Viṃ12, Sems tsam shi\n3b).\n\nSince unity is an essential characteristic of being the whole, or\ncomposite whereas indivisibility an essential characteristic of being\nan atom when both the unity and individuality of the atoms are\nrejected, then the whole and indivisible atoms are no longer\nadmissible. Therefore, Vasubandhu sums up the Yogācāra\nobjections against the reality of the external sense-objects\n(āyatanas) as: “An external sense-object is unreal because\nit cannot be the intentional object of cognition either as (1) a\nsingle thing or (2) as a multiple in [isolated] atoms; or (3) as a\naggregate because the atom is not proven to exist”\n(Viṃ11, Sems tsam shi 3b).\n\nThe realist insists that the external sense objects are real and that\ntheir reality is ascertained by the various means of knowledge\n(pramāṇas) of which perception (pratyakṣa) is the\nmost important. If the external sense objects are nonexistents, there\ncan be no intentional objects, then cognition would not arise. Since\ncognitions do arise, there must be external objects as their\nintentional objects.\n\nTo this objection, Yogācāra employs two arguments to refute\nthe realist claim and to establish the mechanism of cognition, which\ntakes place without the atoms of an external object. The first\nargument shows that atoms do not satisfy the criterion of being the\nintentional object, therefore they do not cause the perception.\n“Perceptual cognition [takes place] just like in dreams and the\nlike [even without an external object]; moreover, when that\n[cognition] occurs, the external object is not seen; how can it be\nthought that this is a case of perception?”\n(Viṃ16, Sems tsam shi 3b).\n\nThe second is the time-lag argument, according to which, there is a\ntime-gap between the perceptual judgement we make and the actual\nperceptual process. When we make a perceptual judgement, at that time\nwe do not perceive the external object as it is in our mental\nconsciousness (manovijñāna) that carries out the judgement\nand since the visual consciousness that perceives the object has\nalready ceased. Hence at the time when the mental consciousness\ndelivers it judgment, the perceptual cognition no longer exists since\nall things are momentary. Therefore the atoms of an external object is\nnot the intentional object of perceptual cognition, since it has\nalready ceased and does not now exist therefore it is not responsible\nfor the cognition’s having the content it has, like the unseen events\noccurring on the other side of the wall (Vasubandhu’s\nViṃśatikā-kārikāvṛtti\n[ViṃKV] 16–17).\n\nYogācāra therefore concludes that we cannot postulate the\nreality of an external object through direct perception. However since\nin perceptual cognition we are directly aware of something, there must\nbe an intentional object of the perceptual cognition. That intentional\nobject of perceptual cognition is, according to the\nYogācāra, none other than the subliminal impressions\n(vāsanās) passing from their latent state contained in the\nstorehouse consciousness (ālayavijñāna) to their\nconscious level. Therefore the impressions are the only things that\nare conventionally real.\n\nVasubandhu’s [TSN] 35–36 inspired by the Buddhist traditional\nreligious beliefs also offers others arguments to defend the idealism\nof Yogācāra:\n\none and the same thing appears differently to beings that are in\ndifferent states of existence (pretas, men, and gods);\nthe ability of the bodhisattvas and\ndhyāyins (practitioners of meditation) who have attained\nthe power of thinking (cetovaśitā) to visualise\nobjects at will;\nthe capacity of the yogins who have attained serenity of\nmind (śamatha) and a direct vision of dharmas as they\nreally are (dharma-vipaśyanā) to perceive things at\nthe very moment of the concentration of mind\n(manasikāra) with their essential characteristics of\nflux, suffering, nonself, empty; and\nthe power of those who have attained intuitive knowledge\n(nirvikalpakajñāna) which enables them not to\nblock the perception of things.\n\n\nAll these arguments based on the facts of experience show that objects\ndo not exist really outside the mind, that they are products of mental\ncreation and that their appearance is entirely mind dependent.\nTherefore the Yogācāra’s theory of the two truths concludes\nthat the whole world is a product of mind—it is the collective\nmental actions (karma) of all beings. All living beings see the same\nworld because of the identical maturation of their karmic\nconsequences. Since the karmic histories of beings are same, there is\nhomogeneity in the way in which the world is experienced and\nperceived. This is the reason there is an orderly world instead of\nchaotic and arbitrariness. This is also the reason behind the\nimpressions of the objectivity of the world.\n4. Madhyamaka\n\nAfter the Buddha the philosopher who broke new ground on the theory of\nthe two truths in the Madhyamaka system is a South Indian monk,\nNāgārjuna (ca. 100 BCE–100 CE). Amongst his seminal\nphilosophical works delineating the theory are\nNāgārjuna’s\n\nFundamental Verses on the Middle Way\n(Mūlamadhyamakakārikā [MMK],\nSeventy Verses on Emptiness\n(Śunyatāsaptati),\nRebutting the Disputes\n (Vigrahvyāvartanī[9]\n and\nSixty Verses on Logical Reasoning\n(Yuktiṣaṣṭikā).\n\n\nĀryadeva’s work\nCatuḥśatakaṣāstrakārikā\n(Four Hundred Verses) is also considered as one of the\nfoundational texts delineating Madhyamaka’s theory of the two\ntruths.\n\nNāgārjuna saw himself as propagating the dharma taught by\nthe Buddha, which he says is precisely based on the theory of the two\ntruths: a truth of mundane conventions and a truth of the ultimate.\n([MMK] 24.8, Dbu ma tsa 14b–15a) He saw the theory of\nthe two truths as constituting the Buddha’s core teaching and his\nphilosophy. Nāgārjuna maintains therefore that those who do\nnot understand the distinction between these two truths would fail to\nunderstand the Buddha’s teaching ([MMK] 24.9, Dbu ma tsa\n15a). This is so, for Nāgārjuna, because (1) without relying\non the conventional truth, the meaning of the ultimate cannot be\nexplained, and (2) without understanding the meaning of the ultimate,\nnirvāṇa is not achieved ([MMK] 24.10, Dbu ma tsa\n15a).\n\nNāgārjuna’s theory of the two truths is fundamentally\ndifferent from all theories of truth in other Indian philosophies.\nHindu philosophers of the Nyāya-Vaiśeṣika,\nSāṃkya-Yoga, and\nMīmāṁsā-Vedānta—all advocate a\nfoundationalism of some kind according to which ultimate reality is\ntaken to be “substantive reality” (drayva) or foundation\nupon which stands the entire edifice of the conventional ontological\nstructures where the ultimate reality is posited as immutable, fixed,\nirreducible and independent of any interpretative conventions. That is\nso, even though the conventional structure that stands upon it\nconstantly changes and transforms.\n\nAs we saw the Buddhist realism of the Vaibhāṣika and the\nrepresentationalism of the Sautrāntika both advocate ultimate\ntruth as ultimately real, logically irreducible. The idealism of\nYogācāra holds nondual mind as the only ultimate reality and\nthe external world as merely conventional truths. On\nNāgārjuna’s Madhyamaka all things including ultimate truth\nare ultimately unreal, empty (śūnya) of any intrinsic nature\n(svabhāva) including the emptiness (śūnyatā)\nitself, therefore all are groundless. In this sense a Mādhyamika\n(a proponent of the Madhyamaka thought) is a an advocate of the\nemptiness (śūnyavādin), advocate of the intrinsic\nunreality (niḥsvabhāvavādin), groundlessness,\nessencelessness, or carelessness. Nevertheless to assert that all\nthings are empty of any intrinsic reality, for Nāgārjuna, is\nnot to undermine the existential status of things as simply\nnothing. On the contrary, Nāgārjuna argues, to\nassert that the things are empty of any intrinsic reality is to\nexplain the way things really are as causally conditioned phenomena\n(pratītyasamputpaṅhā).\n\nNāgārjuna’s central argument to support his radical\nnon-foundationalist theory of the two truths draws upon an\nunderstanding of conventional truth as tied to dependently arisen\nphenomena, and ultimate truth as tied to emptiness of the intrinsic\nnature. Since the former and the latter are co-constitutive of each\nother, in that each entials the other, ultimate reality is tied to\nbeing that which is conventionally real. Nāgārjuna advances\nimportant arguments justifying the correlation between conventional\ntruth vis-à-vis dependent arising, and emptiness\nvis-à-vis ultimate truth. These arguments bring home their\nepistemological and ontological correlations ([MMK] 24.14; Dbu\nma tsa 15a). He argues that wherever applies emptiness as the\nultimate reality, there applies the causal efficacy of conventional\nreality and wherever emptiness does not apply as the ultimate reality,\nthere does not apply the causal efficacy of conventional reality\n(Vig.71) (Dbu ma tsa 29a). According to\nNāgārjuna, ultimate reality’s being empty of any intrinsic\nreality affords conventional reality its causal efficacy since being\nultimately empty is identical to being causally produced,\nconventionally. This must be so since, for Nāgārjuna,\n“there is no thing that is not dependently arisen; therefore,\nthere is no such thing that is not empty” ([MMK] 24.19, Dbu\nma tsa 15a).\n\nSvātantrika / Prāsaṅgika and the two\ntruths\n\nThe theory of the two truths in the Madhyamaka in India took a great\nresurgence from the fifth century onwards soon after Buddhapālita\n(ca. 470–540) wrote A Commentary on [Nāgārjuna’s]\nFundamental Verses of the Middle Way\n\n(Buddhapālitamūlamadhyamakavṛtti,[10]Dbu\n ma tsa 158b–281a). Set forth in this text is a\nthoroughgoing non-foundationalist philosophic reasoning and\nmethod—prāsaṅga arguments or reductio ad\nabsurdum style without relying upon the svatantra,\nformal probative argument—to elucidate the Madhyamaka\nmetaphysics and epistemology ingrained in theory of the two truths.\nFor this reason, Buddhapālita is often identified later as the\nfounder of the Prāsaṅgika Madhyamaka, although elucidation\nof the theory itself is set out in the works of Candrakīrti.\nThree decades later\n Bhāvaviveka[11]\n (ca. 500–570) challenged Buddhapālita’s interpretation of\nthe two truths, and developed a Madhyamaka account of the two truths\nthat reflects a significant ontological and epistemological shift from\nBuddhapalitā’s position, which was later defended in the works of\nCandrakīrti to whom we shall return shortly.\n\nMany later commentators ignore the philosophical contents of the\ndebate between the Prāsaṅgika and the Svātantrika and\nclaim that their controversy is confined only to pedagogical or\nmethodological issues. There is another view according to which the\ncontents of the debate between the Prāsaṅgika and the\nSvātantrika—Buddhapālita versus Bhāvavevika\nfollowed by Bhāvavevika versus Candrakīrti—is\nessentially philosophic in nature. Underpinning the dialectical or\nmethodological controversy between the two Madhyamaka camps lies a\ndeeper ontological and epistemological divide implied within their\ntheories of the two truths, and this in turn is reflected in the\ndifferent methodological considerations they each deploy. So on this\nsecond view, the variation in the methods used by the two schools of\nthe Madhyamaka are not simple differences in their rhetorical devices\nor pedagogical tools, they are underlain by more serious philosophical\ndisagreements between the two.\n\nAccording to this view the philosophical differentiations between the\nSvātantrika and the Prāsaṅgika is best contained\nwithin the discourse of the two truths. Prāsaṅgika’s theory\nof the two truths we leave aside for the time being. First we shall\ntake up the Svātantrika’s account.\n4.1 Svātantrika Madhyamaka\n\nBhāvaviveka wrote some of the major Madhyamaka treatises\nincluding\n\nLamp of Wisdom\n(Prajñāpradīpamūlamadhyamakavṛtti\n[PPMV], Dbu ma tsha 45b–259b),\nVerses on the Heart of the Middle Way\n(Madhyamakahṛdayakārikā [MadhHK],\nBlazes of Reasoning: A Commentary on Verses of the Heart of\nthe Middle Way (Tarkajvālā).\n\n\nIn these texts Bhāvavevika rejects the Brahmanical systems of\nNyāya-Vaiśeṣika, Sāṃkhya-Yoga,\nMīmāṃsā-Vedānta on both metaphysical and\nepistemological grounds. All the theories of truth and knowledge\nadvanced in these systems from his Madhyamaka point of view are too\nrigid to be of any significant use. Bhāvavevika’s critiques of\nĀbhidharmikas—Vaibhāṣika and\nSautrāntika—and Yogācāra predominantly target the\nontological foundationalism which underpins their theories of the\nultimate truth. He rejects them on the ground that from an analytic\ncognitive perspective, which scrutinises the nature of reality,\nnothing—subject and object—is found to be ultimately real\nsince all things are rationally reduced to spatial parts or temporal\nmoments. Thus he proposes the view that both the subject and the\nobject are conventionally intrinsically real as both are\nconventional truths, where as both are ultimately\nintrinsically unreal as both are empty of ultimate reality, hence\nemptiness alone is the ultimate reality.\n\nAlthough Bhāvavevika is said to have founded the Svātantrika\nMadhyamaka, it is important to note that there exists two different\nsubschools of the Svātantrika tradition:\n\nSautrāntika Svātantrika Madhyamaka\nYogācāra Svātantrika Madhyamaka\n\n\nThe two schools of the Svātantrika Madhyamaka take\nBhāvavevika’s intepretation of the two truths, on the whole, to\nbe more cogent than the Prāsaṅgika’s. Particularly both\nschools reject ultimate intrinsic reality while positing\nconventional intrinsic reality. As far as the presentation of\nultimate truth is concerned both schools are in\nagreement—nonself or emptiness alone is the ultimate reality,\nand the rest—the entire range of dharmas—are ultimately\nempty of any intrinsic reality. Nevertheless, the two schools differ\nslightly on the matter related to the theory of conventional truth,\nspecifically concerning reality or unreality of the external or\nphysical objects on the conventional level. The Sautrāntika\nSvātantrika Madhyamaka view held by Bhāvavevika himself, and\nhis student Jñānagarbha, affirms intrinsic reality of the\nconventional truths of both the outer domains and the inner domains\nand mental faculty along with their six respective\nconsciousnesses.\n\nThe arguments that affirm the conventional reality of the external\nobjects are the same arguments that Bhāvavevika employed to\ncriticise the Yogācāra arguments rejecting the reality of\nexternal objects. Bhāvavevika’s [MadhHK] 5.15 points out\nYogācāra’s arguments are contradicted by perception\n(pratyakṣa), tradition (āgama) and commonse sense\n(lokaprasiddha), since they all prove the correctness of the cogniton\nof material form ([MadhHK] 5.15 Dbu ma dza 20b and\nTarkajvālā 5.15 Dbu ma dza 204ab).\nYogācāra’s dream argument is also rejected because,\naccording to Bhāvavevika, dream-consciousness and so forth have\ndharmas as their objects (ālambana / dmigs pa) ([MadhHK]\n5.19 Dbu ma dza 20b). And dharmas are based on intrinsically real\nconventional objects, because they are the repeated impression of the\nobjects that have been experienced previously, like memory\n(Tarkajvālā 5.19 Dbu ma dza 205a).\n\nThe Yogācāra Svātantrika Madhyamaka view held by\nŚāntarakṣita and his student Kamalaśīla\naffirms conventionally intrinsic reality of the inner domains and\nrejects the intrinsic reality of the outer domains and it claims the\nexternal objects are mere conceptual fictions.\n4.1.1 Sautrāntika Svātantrika Madhyamaka\n\nOf the two schools of Svātantraka we shall first take up the\ntheory of the two truths presented in the Sautrāntika\nSvātantrika Madhyamaka. Bhāvavevika’s position represents\nthe theory of the two truths held by this school which was later\npromoted by his disciple Jñānagarbha. The cornerstones of\nthe Sautrāntika Svātantrika Madhyamaka theory of the two\ntruths are the following theses:\n\nThat at the level of conventional truth all phenomena are\nintrinsically real (svabhāvataḥ), because they are\nestablished as intrinsic realities from the perspective of the\nnon-analytical cognitions of the naïve ordinary beings. Allied to\nthis thesis is Bhāvavevika’s claim that the Madhyamaka accepts,\nconventionally, the intrinsic reality of things, for it is the\nintrinsic reality that defines what is to be conventionally real.\nThat at the level of ultimate truth, all phenomena, with the\nexception of the emptiness which is ultimately real, are intrinsically\nunreal (niḥsvabhāvataḥ), or ultimately unreal,\nbecause they are established as empty of any intrinsic reality from\nthe perspective of analytical exalted cognition (i.e., ultimate\ncognition of ārya-beings). Allied to this thesis is\nBhāvavevika’s claim that Madhyamaka rejects intrinsic reality at\nthe ultimate level since ultimate reality constitutes that which is\nintrinsically unreal, therefore empty.\n\nConventional truth\n\nWe shall consider Sautrāntika Svātantrika Madhyamaka’s\ndefence of the two claims in turn. We will begin first with\nBhāvavevika’s definition of the conventional truth. In the\nTarkajvālā, he defines conventional truths as an\n“incontrovertible (phyin ci ma log pa) linguistic\nconvention.” (Dbu ma dza 56a) Such conventional truth\non Bhāvavevika’s Svātantrika takes two forms—unique\nparticulars (svalakṣaṇa / rang mtshan) and universals\n(sāmānyalakṣaṇa / spyi mtshan) as the\nTarkajvālā III.8, explains:\n\nPhenomena have dual characteristics (lakṣana / mtshan nyid),\ndifferentiated as being universal or unique. Unique particular\n(svalakṣaṇa / rang mtshan) is a thing’s intrinsic reality\n(svabhāvatā / rang gi ngo bo), the domain of engagement\nwhich is definitively ascertained by a non-conceptual cognition\n(nirvikalpena jñānena / rnam par rtog pa med pa’i shes\npa). Universal (sāmāṅyalakṣaṇa) is a\ncognitive domain to be apprehended by an inferential cognition\n(anumanavijñānena / rjes su dpog pa’i shes pa) which is\nconceptual (Dbu ma dza 55b).\n\nIn this passage Bhāvavevika essentially summarises some of the\nkey features of conventional truths which are also critical to\nunderstanding the differences between the Svātantrika and\nPrāsaṅgika.\n\nBhāvavevika accepts, based on this passage, unique particular\n(svalakṣaṇa) as an integral part of the ontological\nstructure of the conventional truth. The Prāsaṅgika, by\ncontrast, rejects the concept of unique particular even at the level\nof conventional truth.\nBhāvavevika ascribes unique particular an ontological\nqualification of being “intrinsically real”\n(svabhāvatā), or “inherently real” as its given\nstatus, explicitly affirming a form of foundationalism of unique\nparticulars at the level of conventional truth, which the\nPrāsaṅgika totally rejects.\nBhāvavevika endorses the Pramāṇika’s epistemology\nin which unique particular, which is intrinsically real,\nconventionally, is considered as the domain of engagement ascertained\nby a non-conceptual cognition. The universal\n(sāmāṅyalakṣaṇa) is considered as the\ndomain to be apprehended by a conceptual inferential cognition.\n\n\nBhāvavevika’s defence of the thesis that conventionally things\nare intrinsically real can be summed up in two arguments. First, as\nfar as things are conventional realities they are also intrinsic or\ninherent realities, for being intrinsically real is the reason why\nthings are designated as “conventional reality,” since\nfrom a conventional standpoint—i.e., non-analytical cognitive\nengagements of the ordinary beings—things do appear to be\ninherently real. This means that being “intrinsic” is, for\nBhāvavevika, what makes conventional reality a\nreality.\n\nBhāvavevika’s second argument states that as long as a\nMādhyamika accepts conventional reality it must also accept\nthings as intrinsic in order to avoid the nihilism charge, for\nconventional reality is defined in terms of its being intrinsically\nand uniquely real (svalakṣaṇa). Denying intrinsic reality\nof things at the conventional level, would therefore entail the denial\nof their conventional existence, since it would entail the denial of\nthe defining characteristics of the conventional reality. This follows\nsays Bhāvavevika because “The Lord (bhāgvan / bcom\nldan ldas) has taught the two truths. Based on this [explanatory\nschema] conventionally things are posited in terms of their intrinsic\nnatures and [unique] particulars ([sva]lakṣaṇa / mtshan\nnyid). It is only ultimately that [things are] posited as having no\nintrinsic reality” ((Dbu ma dza 60a).\nUltimate truth\n\nBhāvavevika’s second thesis is that at the level of ultimate\ntruth, all phenomena are intrinsically unreal\n(niḥsvabhāvataḥ), therefore Madhyamaka rejects\nintrinsic reality ultimately. Bhāvavevika’s\nTarkajvālā 3.26 offers three ways to interpret the\ncompound paramārtha “ultimate domain” or\n“ultimate object” literally. In the first, both the terms\n“ultimate” (param) and “domain” (artha) stands\nfor the object—emptiness (śūnyatā)—because\nit is both the “ultimate” or “final” as well\nas an “object to be known,” “analysed”\n(parīkṣaṇīya / brtag par bya ba) and\n“understood” (pratipādya / go bar bya ba). In the\nsecond compound, paramārtha stands for “object of the\nultimate” (paramasya artha / dam pa’i don) where\n“object” refers to emptiness and “ultimate”\nrefers to a non-conceptual exalted cognition\n(nirvikalpajñāna / rnam par mi rtog pa’i ye shes) of the\nmeditative equipoise (samāhita / mnyam bzhag). In the third\ncompound paramārth stands for a concordant ultimate (rjes su\nmthun pa’i shes rab), a cognition that accords with the knowledge of\nthe ultimate since it has the ultimate as its domain.\n\nThe first two etymological senses of the term paramārthas have in\nthem the sense of emptiness as an objective domain since it is both\nthe final ontic status of things and it is the ultimate object of a\nnon-conceptual exalted cognition. Bhāvavevika’s third\netymological sense of the term paramārtha has it identified with\ncognition that accords with the knowledge of the ultimate truth on the\nground that such cognition has emptiness as its object and such\nknowledge is a means through which one develops a non-conceptual\nknowledge of ultimate reality. This third sense of paramārtha\nallows Bhāvavevika to argue that a cognition of the subsequent\nattainment (pṛṣṭhalabdhajñāna / rjes\nthob ye shes) which directly follows from the non-conceptual\nmeditative equipoise, while it is conceptual in character, is\nnevertheless a concordant ultimate ([PPMV] Dbu ma tsa\n228a).\n\nSo for Bhāvavevika then, “the ultimate is of two kinds: one\nis transcendent (lokuttara / ‘jig rten las ‘das pa),\nundefiled (zag pa med pa), free from elaboration (aprapañca /\nspros med) which needs to be engaged without a deliberative effort.\nThe second one” as he explains in Tarkajvālā\n3.26 “is elaborative (prāpañca / spros pa), hence it\ncan be engaged with a deliberative effort by means of a correct\nmundane cognitive process (dag pa’i ‘jig rten pa’i ye shes) that\nis sustained by the collective force of virtues (bsod nams) and\ninsights (ye shes)” (Dbu ma dza 60b).\n\nBhāvavevika advances several arguments to defend the thesis that\nultimately all are intrinsically unreal. The first is the\nconditionality argument pertaining to the four elements, according to\nwhich, all the four elements are ultimately empty of any intrinsic\nreality, for they all are conditioned by the causal factors\nappropriated for their becoming and their existence.\n\nThe second is Bhāvavevika’s non-foundationalist ontological\nargument which demonstrates all phenomena, including the atoms, are\nultimately non-foundational, for ultimately there is nothing that can\nbe taken as the foundational entity (dravya) or intrinsically real\nsince the ultimate analysis reveals that all phenomena are composed of\nthe atomic particles that are themselves composites.\n\nBhāvavevika’s third non-foundationalist epistemological argument\nshows that ultimately the objects are not the domain of cognitions.\nThe argument says that “A visible form is not ultimately\napprehended by the visual faculty because it is a composite (bsags)\nlike a sound and because it is a product of the elements like the\nsound.” ([MadhHK] 3.33 Dbu ma dza 5a) The reasons\nprovided to justify the thesis are twofold: (i) being composite and\n(ii) being a product of the elements. Given that being\ncomposites and products equally apply to visible\nform and sound, these two reasons cannot warrant the validity of the\nargument justifying the thesis that a visible form is ultimately\napprehended by the visual faculty. If they did, they would equally\nwarrant the validity of the argument justifying the thesis that a\nsound is ultimately apprehended by the visual faculty (Dbu ma\ndza 65ab).\n\nIn conclusion: mirroring these two critically important philosophical\npositions Bhāvavevika introduces a type of method or pedagogical\ndevice that is unique to the Svātantrika contra to his\nPrāsaṅgika counterpart.\n4.1.2 Yogācāra Svātantrika Madhyamaka\n\nIn the early eighth century Bhāvavevika and\nJñānagarbha’s theory of the two truths was adopted and\nelucidated in the works of the latter’s\n student[12]\n Śāntarakṣita (705–762) and his student\nKamalaśīla (ca. 725–788). Śāntarakṣita\nwrote:\n\nVerses on the Ornament of the Middle Way\n(Madhyamakālaṁkārakārikā [MAK], Dbu\nma sa 53a–56b),\nCommentary on the Verses of the Ornament of the Middle Way\n(Madhyamakālaṁkāravṛtti,  [MAV], Dbu\nma sa 56b–84a).\n\n\nIn these works he argues for the synthesis of Madhyamaka and\nYogācāra’s theories of the two truths which resulted in the\nformation of the Yogacārā-Svātantrika\nMadhyamaka—a subschool within the Svātantrika Madhyamaka.\nKamalaśīla, who is a student of\nŚāntarakṣita, held the same conception of the two\ntruths in his works:\n\nSubcommentary on the Ornament of the Middle Way\n(Madhyamakālaṁkārapañjikā, Dbu ma\nsa 84a–133b),\nLight of the Middle Way\n(Madhyamakālokaḥ [MA], Dbu ma sa\n133b–244a),\nDiscussion on the Light of Reality\n(Tattvāloka-nama-prakaraṇa, Dbu ma sa\n244b–273a),\nEstablishing the Non-intrinsic Reality of All Phenomena\n(Sarvadharmāsvabhāvasiddhi, Dbu ma sa\n273a–291a),\nStages of Meditation (Bhāvanākrama,\nDbu ma ki 22a–68b).\n\n\nUnlike Jñānagarbha and Bhāvavevika’s realistic\nSautrāntika Svātantrika Madhyamaka which presents\nconventional truth in agreement with the epistemological realism of\nthe Sautrāntika and ultimate truth in agreement with\nnon-foundationalist ontology of the Madhyamaka,\nŚāntarakṣita and Kamalaśīla advocate the\nYogācāra Svātantrika Madhyamaka. They each maintain a\nbasic presentation of conventional truth in agreement with the\nepistemological idealism of Yogācāra and the presentation of\nultimate truth in agreement with the ontological non-foundationalism\nof the Madhyamaka. Therefore Śāntarakṣita concludes:\n“By relying on the Mind Only (cittamatra / sems tsam) one\nunderstands that external phenomena do not exist. And by relying on\nthis [i.e., Madhyamaka] one understands that even [the mind] is\nthoroughly nonself.” ([MAK] 23 Dbu ma sa 56a) “Therefore,\none attains a Mahāyāna [path] when one is able to ride the\nchariots of the two systems by holding to the reigns of logic.”\n([MAK] 24 Dbu ma sa 56a) By “the two systems”\nŚāntarakṣita meant, Yogācāra’s account of\nthe conventional truth with Madhyamaka’s account of the ultimate\n truth.[13]\n\nUnderlying this syncretistic view of the two truths lay two\nfundamental theses that Yogācāra Svātantrika Madhyamaka\nare committed—namely:\n\nthat there is no real external object, mind is the only thing that\nis conventionally real, hence Yogācāra is right about its\npresentation of the conventional truth; and\nthat even mind is unreal and empty of any intrinsic nature under\nultimate analysis, therefore nothing is ultimately real, hence\nMadhyamaka is right about its presentation of the ultimate truth.\n\n\nAnd it is precisely the synthesis of these two theses that defines the\ncharacteristic of the theory of the two truths in the\nYogācāra Svātantrika Madhyamaka.\nŚāntaraṣita and Kamalaśīla attempt to\nachieve this distinctive syncretistic characteristic in their works to\nwhich we turn our discussion.\nUltimate truth\n\nWe will follow Śāntarakṣita and Kamalaśīla\nand first take up the second major thesis—ultimately everything,\nincluding the mind, is unreal and empty. Therefore, ultimate truth is\nthe emptiness of any intrinsic reality. According to\nKamalaśīla ultimate truth has three senses: ([MA], Dbu\nma sa 233b)\n\nreality, the nature of which is characterised as “nonself of\nperson” and “nonself of phenomena,” is etymologically\nboth ultimate (param / dam pa) and object (artha / don).\ntranscendent knowledge (lokottaraṁ\njñānaṃ), reliable cognition of the ultimate since it\nis directly engaged with ultimate reality.\nmundane knowledge, while not in itself ultimate knowledge, but\nbecause it is a complementary means of transcendent knowledge, it is\nalso identified as the ultimate.\n\n\nBoth Śāntarakṣita and Kamalaśīla maintains\nthat the emptiness of intrinsic reality is the ultimate truth, and in\norder to demonstrate that this is so, Kamalaśīla deploys\nfive forms of arguments—namely:\n\nThe diamond-sliver argument (vajrakaṅādiyukti / irdo\nrje gzegs ma’i gtan tshigs) which shows that all things are empty of\nintrinsic reality because things are analytically not found to\narise—neither from themselves, nor from another nor both nor\ncauselessly ([MA], Dbu ma sa 190a–202b).\nThe argument refuting the arising of existent and non-existent\nentities (sadasadutpādapratiṣedhahetu / yod med skye\n‘gog gi gtan tshigs) which shows that all things are empty\nof intrinsic reality because their intrinsic reality is not found to\narise either from things that exist or from things that do not exist\n([MA], Dbu ma sa 202b).\nThe arguments refuting the four modes of arising\n(catuṣkoṭiyutpādapratiṣedhahetu / mu bzhi\nskye ‘gog gi gtan tshigs) which shows that things are empty\nof intrinsic reality for the reason that such reality is neither found\nanaytically in existence (or being) nor in nonexistence (or nonbeing)\nnor both existence-nonexistence (being-nonbeing) nor neither existence\nnor nonexistence (neither being nor nonbeing) ([MA], Dbu ma\nsa 210b).\nThe neither-one-nor many argument (ekānekaviyogahetu /\ngcig du bral gyi gtan tshigs) which shows all phenomena are empty\nof intrinsic reality because they all lack the characteristics of\nbeing intrinsically one or intrinsically many ([MA], Dbu ma\nsa 218b).\nThe argument from dependent arising\n(pratītyasamutpādahetu / rten ‘brel gyi gtan\ntshigs) which shows that things are produced from the association\nof multiple causes and condition, and therefore showing that things do\nnot have any intrinsic reality of their own ([MA], Dbu ma sa\n205b).\n\n\nThe most well-known of Śāntarakśita’s arguments is the\nneither-one-nor many\n argument,[14]\n which seeks to examine the final (or ultimate) identity (ngo bo\nla dpyod pa) of all phenomena. In his [MAK] and [MAV]\nŚāntarakṣita develops this argument in a great detail.\nThe essential feature of the argument is as follows: “The\nentities that are proclaimed by our own [Buddhist] schools and the\nother [non-Buddhist] schools, lack intrinsic identity because in\nreality their identity is neither a (1) singular nor a (2)\nplural—like a reflection.” ([MAK] 1, Dbu ma sa\n53a) In this argument:\n\nThe subject (rtsod gzhi cos can): the entities that are\nproclaimed by our own Buddhist schools and the other non-Buddhist\nschools (from here on ‘all entities.)\nThe property to be proved (sādhyadharma / sgrub\nbya’i chos) : the lack of intrinsic identity.\nWhat is being proved (sādhya / sgrub bya) :\nall entities lack the intrinsic identity.\nThe reason (hetu / rtags) or means of proof (sādhana\n/ sgrub byed) : in reality their identity is neither a\nsingular nor a plural.\nExample: like a reflection.\n\n\nAccording to Śāntarakṣita the validity of the\nneither-one-nor many argument depends on whether or not it satisfies\nthe triple criteria (trirūpaliṅga / tshul gsum) of\nformal probative reasoning. The first criterion\n(pakṣadharmatā / phyogs chos) shows that the\nreason qualifies the subject (phyogs / pakṣa or chos can /\ndharmin), i.e., that the subject must be proven to have the\nproperty of the reason. That is, all entities must be shown, in\nreality, as neither singular nor plural. And therefore this argument\nconsists of two premises:\n\nthe premise that shows the lack of singularity\n(“unity”) and\nthe premise that shows the lack of plurality (or\n“many-ness”)\n\n\nIn [MAK] and [MAV] Śāntarakṣita develops the argument\nshowing the lack of singularity in two parts: (i) the argument that\nshows the lack of the non-pervasive singularity in (a)\npermanent phenomena, and (b) in impermanent entities; and (ii) the\nargument that shows the lack of pervasive singularity by (a)\nrefuting the indivisible atomic particles which are said to have\ncomposed the objects, and (b) by refuting the unified consciousness\nposited by Yogācāra.\n\nThe premise that shows the lack of plurality is based upon the\nconclusion of the argument that shows the lack of singularity. This is\nso, argues Śāntarakṣita, because “When we\nanalyse any entity, none is [found] to be a singular. For that for\nwhich nothing is singular, there must also be nothing which is\nplural” ([MAK] 61, Dbu ma sa 55a). This argument of\nŚāntarakṣita proceeds from understanding that being\nsingular and being plural (manifold) are essentially\ninterdependent—if there are no singular entity, one must accept\nthat there are no plural entity either since the latter is the former\nassembled.\n\nAccording to Śāntarakṣita the argument from\nneither-one-nor many satisfies the triple criteria of valid reasoning.\nIt satisfies the first criterion because all instances of the subject,\nnamely the intrinsic identities of those entities asserted by the\nBuddhist and non-Buddhist opponents, are instances of entities which\nare neither singular nor plural. The second criterion of a valid\nreason—the proof of the forward entailment\n(anvayavyāpti / rjes khyab), i.e., the proof that the\nreason occurs in only “similar instances”\n(sapakṣa / mthun phyogs) where all instances of the\nreason are the instances of the predicates—is also satisfied\nbecause the reason—all phenomena are neither singular nor\nplural—is an instance of the predicate—phenomena which\nlack identity. The third criterion of a valid reason—the proof\nof the counter entailment (vyatirekavyāpti / ldog khyab /\nldog khyab), or the proof that the reason is completely absent\nfrom the dissimilar instances of the predicate (vipakṣa / mi\nmthun phyogs)—hold because there are no instances of the\npredicate which are not instances of the reason.\n\nThere are no instances of phenomena, which lacked intrinsic identity,\nwhich are not also instances of phenomena, that are neither singular\nnor plural. Therefore “the counter entailment holds since there\nare no entities that could be posited as existing in other possible\nalternatives” ([MAV] 62 Dbu ma sa 69b).\n\nThus the second and the third criteria which are mutually entailing\nprove the entailment of the neither one-nor many argument. Once the\n entailment[15]\n of the argument is accomplished, in Śāntarakṣita’s\nview, all potential loopholes in this argument are addressed. And\ntherefore the argument successfully proves that all phenomena are\nempty of any intrinsic reality, since they all lack any singular or\nplural identity.\n\nIt is clear, then, that the arguments of Śāntarakṣita\nand Kamalaśīla have the final thrust of demonstrating the\nreasons why all phenomena ultimately lack any intrinsic\nreality, and are therefore geared towards proving the emptiness of\nintrinsic reality as the ultimate truth, in each argument a specific\ndomain of analysis is used to prove the final ontological\nposition.\nConventional Truth\n\nLet us now turn to the first thesis and look at the\nYogācāra-Svātantratika Madhyamaka defence of the theory\nof conventional truth. As we have seen from the arguments such as\nneither-one-nor many, Śāntarakṣita and\nKamalaśīla draw the conclusion that entities are ultimately\nempty of reality, for ultimately they do not exist either as a\nsingular or as a plural. They then move on to explain the way things\ndo exist, and Śāntarakṣita does this with an explicit\nadmission that things do exist conventionally—“Therefore\nthese entities are only conventionally defined. If [someone] accepts\nthem as ultimate, what can I do for that?” ([MAK] 63 Dbu\nma sa 55a). Why is it that all entities are defined as only\nconventionally real? To understand the answer to this question, we\nneed to look at Śāntarakṣita’s definition of\nconventional reality, which consists of three criteria:\n\nit strictly appeals to its face-value and cannot be subjected to\nreasoned analysis (avicāraṁaṇīya);\nit is causally efficient; and\nit is subjected to arising and disintegration ([MAK] 64, Dbu\nma sa 55a).\n\n\nElsewhere in [MAV] Śāntarakṣita also provides a\nbroader definition of conventionality (saṁvṛti / kun\nrdzob), and argues that conventionality is not simply a linguistic\nconvention (śabda-vyvahāra / sgra’i tha snyad), it also\nincludes what is conventionally real, those that are seen and accepted\nby the Mādhaymikas as dependently coarisen\n(pratītyasamutpanna / rten cing ‘brel ‘byung), and\nthose which cannot be rationally analysed ([MAV] 65, Dbu ma\nsa 70a).\n\nKamalaśīla’s definition of conventional truth stresses\nepistemic error (brānta jñāna / rnam shes khrul ba)\nin as much as he does stress on non-erroneous epistemic perspective\n(abrānta jñāna / rnam shes ma khrul ba) in his\ndefinition of the ultimate truth. So on his definition, the nature of\nall entities, illusory persons and the like, is classified into two\ntruths by virtue of erroneous (brānta / khrula ba) and\nnon-erroneous cognition through which they are each represented.\n\nKamalaśīla’s definition of conventional truth makes\nexplicitly clear the synthesis between Madhayamaka and\nYogācāra. The Yogācāra Svātantrika Madhyamaka\nclaims that the Yogācāra is right about the presentation of\nthe conventional truth as mere mental impressions, and that this can\nbe seen from the way in which Śāntaraṣita and\nKamalaśīla defend this synthesis textually and rationally\nthrough relying heavily on the\nsūtras—Saṃdhinirmocannasūtra,\nLaṅkāvatārasūtra,\nSaddharmapuṇḍarīkasūtra and so\nforth—traditionally supporting Yogācāra idealism. The\nclaim is made here, and Śāntarakṣita does this\nexplicity, that the Madhyamaka and the idealistic doctrines taught in\nthese scriptures are all “consistent.” ([MAV] 91 Dbu\nma sa 79a) The works of these two philosophers produce abundant\ncitations from these sūtra literatures stressing the\nsignificance of the passages like this from the\nLaṅkāvatārasūtra: “Material forms\ndo not exist, one’s mind appears to be external.”\n\nIn terms of the argument, Śāntarakṣita argues\n“that which is cause and effect is mere consciousness only. And\nwhatever is causally established abides in consciousness.”\n([MAK] 91, Dbu ma sa 56a) Therefore phenomena that appear to\nbe real external objects like a blue-patch are not something that is\ndistinct from the nature of the phenomenological experience of\nblue-patch, even so, as the material form experienced in dreams is not\ndistinct from the dreaming experience ([MAV] 91 Dbu ma sa\n79a).\n\nBriefly, then, it is clear the two Svātantriak\nschools—Sautrāntika-Svātantrika-Madhyamak and the\nYogācāra-Svātantrika Madhyamaka—both uphold the\nstandard Madhyamaka position in terms of treating emptiness as the\nultimate truth, although, they vary somewhat in their presentation of\nconventional truth since the former is realistic and the latter\nidealistic about the nature of the conventional truth.\n4.2 Prāsaṅgika Madhyamaka\n\nBhāvaviveka’s Svātantrika Madhyamaka theory of the two\ntruths soon came under attack from Candrakīrti (ca.\n600–650) who, among other works, wrote the following:\n\nClear-word Commentary on the Fundamental Verses of the Middle\nWay (Mūlamadhyamakavṛttiprasannapadā\n[PP], known simply as Prasannapadā, Dbu ma\n‘a 1b–200a),\nAn Introduction on Madhyamaka\n(Madhyamakāvatāra [M], Dbu ma ‘a\n201b–219a),\nCommentary on Introduction on Madhyamaka\n(Madhyamakāvatārabhāśya [MBh], Dbu\nma ‘a 220b–348a),\nCommentary on Four Hundred Verses\n(Catuúṣatakaṭika, Dbu ma ya\n30b–239a),\nCommentary on Seventy Verses on Emptiness\n(Śūnayatāsaptativṛtti, Dbu ma\ntsa 110a–121a),\nCommentary on Sixty Verses on Reasoning\n(Yuktiṣaṣṭhikavṛtii, Dbu ma\nya 1b–30b), and\nDiscussion on the Five Aggregates\n(Pañcaskandhaprakaraṇa, Dbu ma ya\n239b–266b)\n\n\nIn these philosophical works, Candrakīrti rejects the theories of\nthe two truths in both Brahmanical and the Buddhist schools of\nVaibhāṣika, Sautrāntika, Yogācāra and\nSvātantrika Madhyamaka. His chief reason for doing this is his\ndeep mistrust of the varying degrees of metaphysical and\nepistemological foundationalism that these theories are committed to.\nFor example Candrakīrti rejects Bhāvavevika’s reading of\nNāgārjuna’s theory of the two truths and explicitly\nvindicates Buddhapālita’s Prāsaṅgika approach to\nunderstanding Nāgārjuna’s Madhyamaka. He does this by\ndemonstrating the groundlessness of the fallacies Bhāvavevika\nattributed to Buddhapālita, and thereby rejecting\nBhāvavevika’s admission and imposition upon Nāgārjuna’s\nnon-foundationalist ontology of a kind of independent formal\nsvātantra argument, which Candrakīrti saw as one encumbered\nby foundationalist metaphysics, and is incompatible with\nNāgārjuna’s ontology. Instead of relying on the two truths\ntheories of other schools, Candrakīrti proposes a distinctive\nnon-foundationalist theory of the two truths in the Madhyamaka, and he\ndefends it against his foundationalist opponents. This school later\ncame to be known as the Prāsaṅgika Madhyamaka.\n\nAt the core of the Prāsaṅgika’s theory of the two truths\nare these two fundamental theses:\n\nOnly what is conventionally non-intrinsic is causally\neffective, for only those phenomena, the conventional nature of which\nis non-intrinsically real, are subject to conditioned or dependent\narising. Conventional reality (or dependently arisen phenomenon),\ngiven it is causally effective, is therefore always\nintrinsically unreal. Hence that which is conventionally (or\ndependently) coarisen is always conventionally (or dependently)\narisen.\nOnly what is ultimately non-intrinsic is causally\neffective, for only those phenomena, the ultimate nature of which is\nnon-intrinsically real, are subject to conditioned arising. Ultimate\ntruth (or emptiness), given it is causally effective, is therefore\nintrinsically unreal. Hence ultimate truth is ultimately unreal (or\nemptiness is always empty).\n\n\nAlthough these two theses are advanced separately, they are mutually\ncoextensive. There is a compatible relationship between conventional\ntruth and ultimate truth, hence between dependent arising\n(pratītyasamutpāda / rten ‘brel) and emptiness\n(śūnyatā / stong pa nyid), and there is no tension\nbetween the two. We shall examine the Prāsaṅgika arguments\nin defence of these theses.\n4.2.1 Conventional Truth\n\nLet us turn to the first thesis. Earlier we saw that both the\nVaibhāṣika and Sautrāntika argue that only\nultimately intrinsic reality (svabhāva) enables things\nto perform a causal function (arthakriya). The Svātantrika\nMadhyamaka rejects this, and it instead argues that things are\ncausally efficient because of their conventionally intrinsic\nreality (svabhāva) or unique particularity\n(svalakṣaṇa). The Prāsaṅgika Madhyamaka,\nhowever, rejects both these positions, and argues only what is\nconventionally non-intrinsic reality (niḥsvabhāva)\nis causally effective, for only those phenomena, the conventional\nnature of which is non-intrinsic, are subject to conditioned or\ndependent arising. Conventional reality (here treated as dependently\narisen phenomenon), given it is causally effective, is therefore\nalways intrinsically unreal, and hence lacks any intrinsic\nreality even conventionally. Hence that which is conventionally (or\ndependently) coarisen is always conventionally (or dependently) arisen\nand strictly does not arise ultimately.\n\nIn his etymological analysis of the term “convention”\n(saṃvṛti / kun rdzob) in [PP] Candrakīrti attributes\nthree senses to the term convention:\n\nconfusion (avidyā / mi shes pa) for it obstructs the mundane\ncognitive processes of the ordinary beings from seeing the reality as\nit is by way of concealing (saṃvṛti / kun\nrdzob) its nature;\ncodependent (paraparasaṃbhavana / phan tshun brtan\npa) for it is an interdependent phenomenon; and\nSignifier (saṁket / rda) or worldly convention\n(lokavyavahāra / ‘jig rten tha snyad) in the sense of\ndependently designated by means of expression and expressed,\nconsciousness and object of consciousness, etc ([PP] 24.8 Dbu\nma ‘a 163a).\n\n\nCandrakīrti’s claims that in the case of mundane cognitive\nprocesses of the ordinary beings, the first sense of convention\neclipses the force of the second and the third senses. As a result,\nfar from understanding things as dependently arisen (the second sense)\nand dependently designated (the third sense), ordinary beings reify\nthem to be non-dependently arisen, and non-designated. Due to the\nforce of this cognitive confusion, from the perspective of mundane\ncognitive processes of the ordinary beings, things appear real, and\neach phenomenon appears intrinsically real in spite of their\nnon-intrinsic nature. Consequently this confusion, according to\nCandrakīrti, defines epistemic practices of the ordinary beings.\nFor this reason, the epistemic norms or the standard set by\nmundane convention of the ordinary beings, is poles apart\nfrom the epistemic norms set by mundane convention of the noble beings\n(āryas / ‘phags pa) whose mundane cognitive processes are\nnot under the sway of afflictive confusion.\n\nIn order to illustrate this distinction, in his commentary [MBh] 6.28\nCandrakīrti introduces the concept: mere convention (kun\nrdzob tsam) of the noble beings to contrast with conventionally\nreal or conventional true (kun rdzob bden pa) of the\nordinary beings. Ordinary beings erroneously grasp all conditioned\nphenomena as intrinsically real, therefore things are\nconventionally real and thus are categories of conventional\ntruth. For noble beings, however, because they no longer reify them as\nreal, things are perceived as having the nature of being\ncreated (bcos ma) and unreal (bden pa ma yin pa)\nlike the reflected image ([MBh] 6.28 Dbu ma ‘a\n255a).\n\nAccording to Candrakırti’s definition of the two truths, all\nthings embody dual nature, for each is constituted by its conventional\nnature and its ultimate nature. Consequently, all entities, according\nto this definition, satisfy the criterion of the two truths, for the\ndefinition of the two truths is one based on the two natures. The two\ntruths are, therefore, not merely one specific nature\nmirrored in two different perspectives ([MBh] 6.23 Dbu ma\n‘a 253a). Conventional nature entails conventional truth and\nultimate nature entails ultimate truth, and given each entity is\nconstituted by the two natures, the two truths define what each entity\nis in its ontological and epistemological terms.\n\nConventional nature is defined as conventional truth because it is the\ndomain of mundane cognitive process, and is readily accessible for\nordinary beings, including mundane cognitive process of noble beings.\nIt is a sort of truth, while unreal and illusory in\nreality, it is yet erroneously and non-analytically taken for granted\nby mundane cognitive processes of the ordinary beings. Ultimate\nnature, on the other hand, is defined as ultimate truth because it is\ndomain of the exalted cognitive process which engages with its object\nanalytically, one that is directly accessible for noble beings\n(āryas) and only inferentially accessible for ordinary beings. It\nis this sort of truth, both real and non-illusory, that is\ncorrectly and directly found out by exalted cognitive processes of\nnoble beings, and by analytic cognitive processes of ordinary\nbeings.\n\nMundane cognitive process that is associated with the definition of\nconventional truth and therefore allied to the perception of\nunreal entities is of two kinds ([M] 6.24 Dbu ma\n‘a 205a):\n\ncorrect cognitive process, and\nfallacious cognitive process.\n\n\nCorrect cognitive process is associated with an acute sense faculty,\nwhich is not impaired by any occasional extraneous causes of\nmisperception (see below). Fallacious cognitive process is associated\nwith a defective sense faculty impaired by occasional extraneous\ncauses of misperception. In [PP] Candrakīrti introduces us to a\nsimilar epistemic distinction:\n\nmundane convention (lokasaṃvṛti /\n‘jig rten gyi kun rdzob) and\nnon-mundane convention (alokasaṃvṛti /‘jig\nrten ma yin pa’i kun rdzo).\n\n\nCandrakīrti’s key argument behind to support the distinction\nbetween two mundane epistemic practices—one mundane\nconvention and the other non-mundane convention—is that\nthe former is, for mundane standard, epistemically reliable whereas\nthe latter is epistemically unreliable. Consequently correct cognitive\nprocesses of both ordinary and awakened beings satisfy the epistemic\nstandard of mundane convention, being non-deceptive by\nmundane standard, thus they set the standard of mundane convention;\nwhereas fallacious cognitive processes of defective sense faculties,\nof both ordinary and awakened beings, do not satisfy the epistemic\nstandard of mundane convention, and therefore, they are\ndeceptive even by mundane standard. They are thus\n“non-mundane convention” as Candrakīrti characterises\nthem in [PP] 24.8 (Dbu ma ‘a 163ab).\n\nJust as they are two kinds of sensory faculty—nonerroneous and\nerroneous—their objects are, according to Candrakīrti, of\ntwo corresponding kinds:\n\nconventionally real and\nconventionally unreal.\n\n\nFirst, cognitive processes associated with sense faculties that are\nunimpaired by extraneous causes of misperception grasp the former\nobjects, and because this kind of object fulfils realistic mundane\nontological standard, it is thus real for ordinary beings,\n(not so for the noble beings the issue to which we turn later). Hence\nit is only conventionally real.\n\nSecond, cognitive processes associated with sense faculties that are\nimpaired by extraneous causes of misperception grasp conventionally\nunreal objects, and because this kind of object does not meet\nrealistic mundane ontological standard, they are thus\nconventionally unreal.\n\nAlthough Candrakīrti recognises that conventional reality\nsatisfies the ontological standard of ordinary beings, he,\nimportantly, argues that it does not satisfy the ontological criterion\nof the Madhyamaka (here synonymous for noble beings). Just as illusion\nis partly real although partly unreal, all objects\nthat are considered commonsensically as conventionally real, are\nunreal. The major difference between the two is that a\nknowledge of illusion being unreal is available to mundane cognitive\nprocesses of ordinary beings where as a knowledge of unreality of\nconventionally real entities is not available to mundane cognitive\nprocesses of ordinary beings.\n\nHowever, for Candrakīrti illusory objects are\nconventionally real and causally efficient, and that the\nconventionally real entities themselves are illusion-like.\nCandrakīrti develops this argument using the two tier theory of\nillusion.\n\nThe argument from the first tier of the theory of illusion\ndemonstrates a causal efficiency of conventionally illusory objects.\nThis, Candrakīrti does by identifying conventionally\nillusory entities with the so-called conventionally real\nentities.\nThe argument from the second tier of the theory of illusion\ndemonstrates an illusory nature of conventionally\nreal entities. This, Candrakīrti does by means of showing\nthat entities that are conventionally real are conventionally\nempty of intrinsic reality, and by denying conventional\nreality the ontological status of the so-called intrinsic\nreality.\n\n\nCandrakīrti support his argument from the theory of illusion by\nmeans of applying four categories of the conventional entities:\n\nPartly unreal entities—illusory objects (e.g. mirage,\nreflection, echoe etc.);\nPartly real entities—non-illusory objects (e.g. water, face,\nsound etc.);\nIntrinsic reality (e.g. substance, essence, intrinsic nature\netc.,) and\nConventionally unreal entities (e.g. the rabbit’s horn, the\nsky-flower etc). ([MBh] 6.28 Dbu ma ‘a\n254b–255a).\n\n\nCandrakīrti accepts conventional reality of both\nentities—partly unreal (i) and partly real (ii)—on the\nground that they both appear in mundane cognitive processes who are\nconfused about their ultimate ontological status. Candrakīrti\nrejects conventional reality status of those entities that are\nsupposedly intrinsically real (iii) and conventionally unreal (iv),\nalthough for different reasons. Conventional reality of intrinsically\nreal entity is rejected in [MBh] 6.28 on the ground that its existence\ndoes not, forever, appear to a mundane cognitive processes.\n\nCandrakīrti argues that there is a critical epistemic\ndifferentiation to be made between the two\nentities—conventionally real and conventionally illusory.\nDeceptive, unreal, and dependently arisen nature of conventionally\nreal entities is beyond the grasp of mundane cognitive processes. By\ncontrast, deceptive, unreal and dependently arisen nature of\nconventionally illusory, partly unreal, entities is grasped by mundane\ncognitive processes. Therefore illusory objects are regarded as\ndeceptive, and unreal by the standard of mundane knowledge, whereas,\nconventionally real things are regarded as nondeceptive and real by\nthe standard of mundane knowledge.\n\nSo the argument from the first tier of the illusory theory shows that\nmundane cognitive processes of ordinary beings fail to know\nillusory and unreal nature of conventionally real entities, they\ninstead grasp them to be intrinsically real. The argument from the\nsecond tier of the illusory theory offers Candrakīrti’s reason\nwhy this is so. Here, he argues, the presence of the underlying\nconfusion operating beneath mundane cognitive processes of the\nordinary beings is the force by which ordinary beings intuitively and\nerroneously reify the nature of conventional entities. Hence they grasp\nconventional entities as intrinsically real, although they are in\nactual fact on a closer analysis, only non-intrinsic, unreal or\nillusory.\n\nTherefore intrinsic reality is not a conventional reality and grasping\nthings to be intrinsically real is only a confused belief, not a\nknowledge. Hence Candrakīrti clearly excludes it from the\nontological categories of conventional reality, for the reason that\nintrinsic reality is a conceptual fiction fabricated by confused minds\nof the ordinary beings and that it is a conceptual construct thrust\nupon non-intrinsic entities ([MBh] 6.28 Dbu ma ‘a\n255a). In addition Candrakīrti argues that if things were\nintrinsically real, even conventionally, as the Svātantrikas take\nthem to be, in Candrakīrti’s view, things would exist by virtue\nof their intrinsic reality, at least conventionally. If this\nwere the case then intrinsic reality would become the ultimate nature\nof things. That would be absurd.\n\nFor Mādhyamikas, things cannot have more than one final mode of\nexistence—if they exist, they must exist qua only\nconventionally. Consequently, given the mutually exclusive relation of\nintrinsic reality and emptiness, if intrinsic reality is granted even\na conventional reality status, Candrakīrti contends, one has to\nreject emptiness as the ultimate reality ([M] 6.34, DBu ma\n‘a 205b). But since the Mādhyamika asserts emptiness to be\nthe ultimate reality, and given that emptiness and intrinsic reality\nare mutually exclusive, Mādhyamika must reject intrinsic reality\nin all its forms—conventionally as well as ultimately ([MBh]\n6.36, 1994: 118).\n4.2.2 Ultimate truth\n\nWe now turn to Candrakīrti’s second thesis—namely, only\nwhat is ultimately non-intrinsic is causally effective, for\nonly those phenomena, an ultimate nature of which is non-intrinsic,\nare subject to conditioned arising. Ultimate reality (or emptiness),\ngiven it is causally effective, is therefore intrinsically unreal.\nTherefore ultimate reality is ultimately unreal (or put it\ndifferently, emptiness is ultimately empty).\n\nCandrakīrti defines ultimate reality as the nature of things\nfound by the perception of reality ([M] 6.23 Dbu ma ‘a\n205a). In the commentary Candrakīrti expands this definition.\n“Ultimate is the object, the nature of which is found by\nparticular exalted cognitive processes (yishes) of those who\nperceive reality. But it does not exist by virtue of its intrinsic\nobjective reality (svarūpatā / bdag gi ngo bo\nnyid).” ([MBh] 6.23 Dbu ma ‘a 253a) Of the two\nnatures, the object of the perception of reality is the way things\nreally are, and this is, Candrakīrti explains, what it means to\nbe ultimate reality ([MBh] 6.23 Dbu ma ‘a 253ab).\n\nCandrakīrti’s definition raises a couple of important points\nhere. First, by defining ultimate reality as “the nature of\nthings found by particular exalted cognitive processes (yeshes) of\nthose who perceive reality,” he means ultimate reality is not\nfound by any exalted cognitive processes, it must be found by\na particular exalted cognitive processes—analytic—that\nknows things just as they are. Second, by stating that “it does\nnot exist by virtue of its intrinsic objective reality”\n(svarūpatā / bdag gi ngo bo nyid), he means ultimate reality\nis not intrinsically real just as much as conventional reality is not\nintrinsically real. Third, he says that ultimate reality is the first\nnature of the two natures of things found by perception of reality.\nThis means ultimate reality is ultimate nature of all conventionally\nreal things. For they all have an ultimate nature representing\nultimate status, just as they have conventional nature representing\nconventional status.\n\nUltimate truth, according to Candrakīrti, for the purpose of\nliberating all sentient beings ([M] 6.179 Dbu ma ‘a\n213a). ‘a 213a) is differentiated by the Buddha into two\naspects:\n\nnonself of person (pudgalanairātmya) and\nnonself of phenomena (dharmanairātmya)\n\n\nAs we shall see Candrakīrti’s arguments come from two domains of\nanalysis which he employs to account for his theory of ultimate truth:\nanalysis of personal self (pudgala-ātmya / gang zag gi bdag) and\nanalysis of phenomenal self (dharma-ātmya / chos kyi bdag). The\nanalysis will demonstrate whether or not conventionally real phenomena\nand persons are more than what they are conventionally. So we shall\nconsider Candrakīrti’s arguments under this rubrics:\n\nThe not-self argumnent: unreality of conventionally real\nperson;\nThe emptiness argument: unreality of conventionally real\nphenomena;\nThe emptiness is emptiness argument: unreality of ultimate\nreality.\n\n\nLet us begin with the first. The not-self argumnent demonstrates, as\nwe shall see, unreality of conventionally real person. We shall\ndevelop this argument of Candrakīrti progressively in three\nsteps:\n\ncorrelation between personal self and the five aggregates;\narguments against personal self; and\nreasons for positing personal self as merely dependently\ndesignated.\n\n\nIn order to appreciate Candrakīrti’s not-self argument, or the\nargument that shows unreality of conventionally real person, we need\nto understand Candrakīrti’s purpose of refuting personal self.\nAccording to Candrakīrti it is important that we look into the\nquestion: from where does the assumption of self arise before we go\nany further. He argues, like all the Buddhist philosophers do, the\nnotion of self or the assumption of self arises in relation to\npersonhood. After all it is a personal identity issue. To analyse the\nself therefore requires us to look closely among the parts that\nconstitute a person, and given that the conception of self is embedded\nin personhood which is constituted by the five aggregates, we need to\nexamine its relation to our conception of self.\n\nSuffice it here to highlight the important relation that exists\nbetween the aggregates and the notion of self. According to\nCandrakīrti, the five aggregates are primary categories upon\nwhich we will draw to examine the phenomenal structure of sentient\nbeings, because of the following reasons: because (1) it serves as a\nphenomenological scheme for examining the nature of human experience,\n(2) the way in which human beings construct conceptions of the self is\nbased upon different existential experiences within the framework of\nthe five aggregates, (3) they are the basis upon which we develop the\nsense of self through the view that objectifies the five aggregates\nwhich are transient and composites\n(satkāyaḍṛṣṭi / ‘jig tshogs la lta\nba), either through an appropriation or falsely identifying the\naggregates to be self ([MBh] 6.120, Dbu ma ‘a 292ab),\n(4) they are the objective domain of the arising of defilements that\ncause us suffering since the false view objectifying the aggregates\n(satkāyaḍṛṣṭi / ‘jig tshogs la lta\nba) to be real self lead to the arising of all “afflictive\ndefilements”, and finally (5) the five aggregates are the\nobjective domain of the knowledge of unreality of personal self. For\nthe simple reason that confusion and misconceptions of self arise in\nrelation to the aggregates, thus it is within the same framework that\nthe realisation of nonself must emerge.\n\nTherefore, for Candrakīrti, it is clear that within the range of\nthe five aggregates exhaust “all” or\n“everything” that could be considered as the basis for\ndeveloping the misconception of a reified self and also the\nbasis for correct knowledge of non-self—i.e., reality of person\nor self.\n\nCandrakīrti develops his arguments against personal self in a\ngreat detail in [M]/[Mbh] chapter six. Suffice it here to consider one\nsuch argument called “the argument from the sevenfold analysis\nof a chariot” (shing rta rnams bdun gyi rigs pa). This argument\nhowever is more or less a way of putting all his arguments together.\nIn it, Candrakīrti concludes: “the basis of the conception\nof self, when analysed, is not plausible to be an entity. It is not\nplausible to be different from the aggregates, nor identity of the\naggregates, nor dependent (skandhadhāra) on the aggregates. The\n‘basis’ (skandhadhāra) at issue is a compound that\nexposes the implausibility of self as both the container\n(ādhāra / rten) and the contained (adheya / brten pa). The\nself does not own the aggregates. This is established in codependence\non the aggregates” ([M] 6.150, Dbu ma ‘a 221b).\nPutting this argument analogically, Candrakīrti asserts that the\nself is, in terms of not being intrinsically real, analogous to a\nchariot. “We do not accept a chariot to be different from its\nown parts, nor to be identical [to its parts], nor to be in possession\nof them, nor is it in the parts, nor are the parts in it, nor\nis it the mere composite [of its parts], nor is it the shape [or size\nof the those parts]” ([M] 6.151 Dbu ma ‘a\n221b).\n\nSo the structure of the nonself “chariot” argument that\ndemonstrates unreality of a conventionally real person can be briefly\nstated as follows:\n\nP1  Self is not distinct from the aggregates.\n P2  Self is not identical to the aggregates.\n P3  Self and the aggregates are not codependent upon each\nother.\n P4  Self and the aggregates do not own each other.\n P5  Self is not the shape of the aggregates.\n P6  Self is not the collection of the aggregates.\n P7  There is nothing more to a person than the five\naggregates.\n C  Therefore a real personal self does not exist.\n\n\nThere is no ultimately real self that can be logically proven to\nexist. If it did exist it has to be found when it is subjected to\nthese sevenfold analyses. But the self is not found either to be\ndifferent from the aggregates, nor identical to the aggregates, nor to\nbe in possession of them, nor is the self in the aggregates,\nnor are the aggregates in the self, nor is the self the mere\ncomposite of the aggregates; nor is the self the shape or sizes of the\naggregates. Since there is no more to a person any more than\ndependently designated self upon basis of the five aggregates, they\nexhaust all that there is in a person, Candrakīrti therefore\nconcludes that there is no real self anywhere whatsoever to be found\nin the five aggregates.\n\nFrom this argument, Candrakīrti concludes that both ultimately\nand conventionally, any intrinsic reality of a personal self must\nremain unproven. Therefore according to any of the sevenfold analysis\na personal self is unreal, and empty of any intrinsic reality. What\nCandrakīrti does not conclude from this argument, though, is the\nimplausibility of a conventionally real self for everyday purpose. As\nmatter of fact, Candrakīrti argues, the argument from the\nsevenfold analysis reinforces the idea that only conventionally real\nself makes sense. For such a self constitutes being dependently\ndesignated on the aggregates in as much as a chariot is dependently\ndesignated on its parts (M / MBh 6.158). Just as the chariot\nis conveniently designated in dependence on its parts, and it is\nreferred to in the world as “agent,” even so, a\nconventionally self which is established through dependent designation\nserves as a conventionally real moral agent. Therefore, although the\nargument from the sevenfold analyses denies the existence of\nintrinsically real self or ultimately real self, the argument does not\nentail a denial of conventionally real self. (M / MBh\n6.159).\n\nIt turns out therefore that a self is merely a convenient designation,\nor a meaningful label given to the five aggregates, and taken for\ngranted in the everyday purpose as a agent. And it is this nominal\nself that serves the purpose of moral agent. This nominal or\nconventional self is comparable to anything that exists\nconventionally. Candrakīrti compares it to a chariot.\n\nSecond, Candrakīrti’s argument from emptiness demonstrates the\nunreality of the conventionally real phenomena by means of appealing\nto causal processes at work in producing these entities. The\nunderstanding here is that the way in which things arise and come into\nexistence definitively informs us about how things actually are. This\nargument is an extension of Nāgārjuna’s famous tetralemma\nargument which states: “neither from itself nor from another nor\nfrom both, nor without cause does anything anywhere, ever\narise.” ([MMK] 1.1) Candrakīrti develops this argument in\ngreat detail in chapter 6 of [M]/[MBh], we shall only have a quick look\nat its overall strategy without delving into its details.\n\nIf entities are intrinsically real there are only two alternative ways\nfor them to arise: either they arise (a) causally or (b) causelessly.\nIf one holds that intrinsically real things arise causally, then there\nare only three possible ways for them to arise: either they should\narise from (1) themselves, or from (2) another or from (3) both.\n\n\nP1 If intrinsic entity arise from itself it would absurdly follow that\ncause and effect would be identical and they would exist\nsimultaneously. In which case, the production of an effect would be\npointless for it would be already in existence. It is thus\nunreasonable to assume that something already arisen might arise all\nover again. ([M] 6.8) If an entity in existence still requires arising\nthen an infinite regress would follow ([M] 6. 9–13).\n\nP2 If an intrinsically real entity arises from another, anything could\narise from anything (like a fire from pitch-darkness), given that\ncause and effect would be distinct, all causes would be equally\n‘another’ ([M] 6. 14–21).\n\nP3 If an intrinsic entity arises from both itself and another then\nboth reductio ad absurdums in P1 and P2 would apply ([M] 6.\n98).\n\nP4 If an intrinsic entity arises causelessly, then anything could\narise from everything ([M] 6. 99–103).\n\nThus it is not possible for any intrinsic entity to exist because no\nsuch entity could be causally produce either from itself or from\nanother or both or causelessly. It follows therefore that any entity\nthat arises causally is not intrinsically real, hence it is\ndependently originated entity ([M] 6. 104).\n\n\nCandrakīrti therefore insists that entities that are\nintrinsically unreal are not nonexistent unlike intrinsically real\nentities which are nonexistent analogous to the rabbit’s horn. Even\nthough they are not intrinsically real, hence remain unproduced\naccording to the four analyses, unlike the rabbit’s horn,\nintrinsically unreal entities are objects of mundane cognitive\nprocesses, and they arise codependently ([M] 110–114). Hence, in\nsummarising the argument, Candrakīrti states: “Entities do\nnot arise causelessly, and they do not arise through causes like God,\nfor example. Nor do they arise out of themselves, nor from another,\nnor from both. They arise codependently.” ([M] 6.114, Dbu ma\n‘a 209b) So because entities arise codependently, according to\nCandrakīrti, reified concepts such as intrinsic entities cannot\nstand up under logical analysis. The argument from dependent arising\ntherefore eliminates the web of erroneous views presupposing intrinsic\nreality. If entities are intrinsically real, then their arising could\nbe through themselves, from another or from both, causelessly. However\nupon critical analysis the entity as such proves to be nonexistent\n([M]/[MBh] 6. 115–116).\n\nThird, Candrakīrti’s argument from the emptiness of emptiness\ndemonstrates the unreality of ultimate reality. The\n“emptiness-argument” and the\n“nonself-argument” show that all conventionally real\nphenomena and persons are empty of intrinsic reality. As we have seen\nfrom a critical rational point of view, it is demonstrated that there\nis no ultimately real or ultimately existent entities or real self of\nperson to be found. The two arguments do not however show that\nemptiness per se is empty, nor do they show that the\nselflessness is itself selfless. This raises an important question:\ndoes this mean that emptiness is the intrinsic reality of\nconventionally real entities and selflessness is the intrinsic reality\nof conventionally real persons? Putting the question differently:\ncould a Mādhyamika claim that emptiness and selflessness are\nultimately real or are intrinsically real? This question is\nreasonable. We tend to posit ultimate reality to be something that is\ntimeless, independent, transcendent, nondual etc. So if emptiness is\nthe ultimate reality of all phenomena and if selflessness is the\nultimate reality of all persons,could we say that emptiness and\nselflessness are nonempty, ultimately real or\nintrinsically real?\n\nIn order to answer this question Candrakīrti maintains that the\nBuddha reclassifies emptiness and nonself under various\naspects—“He elaborated sixteen emptinesses and\nsubsequently he condensed these into four explanations which are\nadopted by the Mahāyāna.” ([M] 6.180 Dbu ma\n‘a 213a) We shall consider one example here: Candrakīrti\nargues “The eye is empty of eye[ness] because that is its\nreality. The ear, nose, tongue, body and mind are also to be explained\nin this way.” ([M] 6.181 Dbu ma ‘a 213ab)\n“Because each of them are non-eternal (ther zugs tu\ngnas pa ma yin) not subject to disintegration\n(‘jig pa ma yin pa) and their reality is\nnon-intrinsic [the emptiness of] the eye and the other six\nfaculties is accepted as ‘internal emptiness’\n(adhyātmaśūnyatā)”([M] 6.181\nDbu ma ‘a 2213b).\n\nOn Candrakīrit’s view just as the chariot, self and other\nconventionally real phenomena are intrinsically unreal, so too is the\nemptiness and the nonself. Emptiness is also empty of intrinsic\nreality. Candrakīrti explains the emptiness of emptiness as:\n\nThe emptiness of intrinsic reality of things is itself called by the\nwise as ‘emptiness,’ and this emptiness also is considered\nto be empty of any intrinsic reality. ([M] 6.185 Dbu\nma ‘a 213b) \nThe emptiness of that which is called\n‘emptiness’ is accepted as ‘the emptiness of\nemptiness’ (śūnyatāśūnyatā). It is\nexplained in this way for the purpose of controverting objectification\nof the emptiness as intrinsically real (bhāva). ([M] 6.186\nDbu ma ‘a 213b)\n\n\nAlso consider Candrakīrti’s argument against positing emptiness\nas ultimately real that he develops in his commentary on [MMK] 13.7.\nIf emptiness is ultimately real, emptiness would not be empty of the\nintrinsic reality—the essence of conventionally real objects. In\nthat case we will have to grant emptiness as existing independently of\nconventionally real entities, as their underlying substratum. If this\nis granted the emptiness of a chariot and the empty entity, the\nchariot itself, would be quite distinct and unrelated. Moreover if the\nemptiness of the chariot is nonempty, i.e., if it is ultimately real,\nwhereas the chariot itself is empty i.e., ultimately unreal, then, one\nhas to posit two distinct and contradictory verifiable realities even\nfor one conventionally real chariot. But since there is not even the\nslightest nonempty phenomenon verified in the chariot—not even\nthe slightest bit of entity withstanding critical\nanalysis—emptiness of the chariot, like the chariot itself, is\nimplausible to be ultimately real. Like the chariot itself, the\nemptiness of the chariot is also ultimately empty.\n\nTherefore, while emptiness is the ultimate truth of the conventionally\nreal entities, it is not plausible to posit emptiness to be ultimately\nreal. Similarly, while nonself is the ultimate truth of the personal\nself, nonself is implausible to be ultimately real. Therefore nonself\nis not considered as the essence of persons or self.\n\nSo, to wind up the discussion on the Prāsaṅgika’s theory of\nthe two truths, just as conventional truth is empty of intrinsic\nreality, hence ultimately unreal, even so, is ultimate truth empty of\nintrinsic reality, hence ultimately unreal. It is, therefore,\ndemonstrated that nothing is ultimately real for Candrakīrti,\nhence everything is empty of intrinsic reality. The heart of\nCandrakīrti’s two truths theory is the argument that only because\nthey are empty of intrinsic reality can conventionally real entities\nbe causally efficient. Only in the context of a categorical rejection\nof any foundationalism of intrinsic reality—both conventionally\nand ultimate, Candrakīrti insists, can there be mundane practices\nrooted in the mutually interdependent character of cognitive\nprocesses and objects cognised. For this reason\nCandrakīrti concludes that whomsoever emptiness makes sense,\neverything makes sense. For whomsoever emptiness makes no sense,\ndependent arising would not make sense. Hence nothing would make sense\n([PP] 24.14, Dbu ma ‘a 166b).\n5. Conclusion\n\nTo sum up, though this entry provides just an overview of the theory\nof the two truths in Indian Buddhism discussed overview, it\nnevertheless offers us enough reasons to believe that there is no\nsingle theory of the two truths in Indian Buddhism. As we\nhave seen there are many such competing theories, some of which are\nhighly complex and sophisticated. The essay clearly shows, however,\nthat except for the Prāsaṅgika’s theory of the two truths,\nwhich unconditionally rejects all forms of foundationalism\nboth conventionally and ultimately, all other theories of the two\ntruths, while rejecting some forms of foundationalism, embrace another\nform of foundationalism. The Sārvastivādin (or\nVaibhāṣika) theory rejects the substance-metaphysics of the\nBrahmanical schools, yet it claims the irreducible spatial units\n(e.g., atoms of the material category) and irreducible temporal units\n(e.g., point-instant consciousnesses) of the five basic categories as\nultimate truths, which ground conventional truth, which is comprised\nof only reducible spatial wholes or temporal continua. Based on the\nsame metaphysical assumption and although with modified definitions,\nthe Sautrāntika argues that the unique particulars\n(svalakṣaṇa) which, they say, are ultimately causally\nefficient, are ultimately real; whereas the universals\n(sāmāṅyalakṣaṇa) which are only\nconceptually constructed, are only conventionally real. Rejecting the\nĀbhidharmika realism, the Yogācāra proposes a form of\nidealism in which which it is argued that only mental impressions are\nconventionally real and nondual perfect nature is the ultimately real.\nThe Svātantrika Madhyamaka, however, rejects both the\nĀbhidharmika realism and the Yogācāra idealism as\nphilosophically incoherent. It argues that things are only\nintrinsically real, conventionally, for this ensures their\ncausal efficiency, things do not need to be ultimately intrinsically\nreal. Therefore it proposes the theory which states that\nconventionally all phenomena are intrinsically real\n(svabhāvataḥ) whereas ultimately all phenomena are\nintrinsically unreal (niḥsvabhāvataḥ). Finally, the\nPrāsaṅgika Madhyamaka rejects all the theories of the two\ntruths including the one advanced by its Madhyamaka counterpart,\nnamely, Svātantrika, on the ground that all the theories are\nmetaphysically too stringent, and they do not provide the ontological\nmalleability necessary for the ontological identity of conventional\ntruth (dependent arising) and ultimate truth (emptiness). It therefore\nproposes the theory of the two truths in which the notion of intrinsic\nreality is categorically denied. It argues that only when conventional\ntruth and ultimate truth are both conventionally and\nultimately non-intrinsic, can they be causally effective.\n",
    "bibliography": {
        "categories": [
            "<a name=\"AbbCitWor\">List of Abbreviations</a>",
            "<a name=\"PriLit\">Primary Literature</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"AbbCitWor\">List of Abbreviations</a>": [
                "</h3>\n<table class=\"cellpad-small vert-top cell-rl\">\n<tbody>\n<tr>",
                "[AK]",
                "<em>Abhidharmakośakārikā</em> </tr>\n<tr>",
                "[AKB]",
                "<em>Abhidharmakośabhāṣya</em> </tr>\n<tr>",
                "[ĀlamPV]",
                "<em>Ālambanaparīkṣāvṛtti</em>\n</tr>\n<tr>",
                "[M]",
                "<em>Madhyamakāvatāra</em> </tr>\n<tr>",
                "[MA]",
                "<em>Madhyamakālokaḥ</em> </tr>\n<tr>",
                "[MadhHK]",
                "<em>Madhyamakahṛdayakārikā</em> </tr>\n<tr>",
                "[MAK]",
                "<em>Madhyamakālaṁkārakārikā</em>\n</tr>\n<tr>",
                "[MAV]",
                "<em>Madhyamakālaṁkāravṛtti</em> </tr>\n<tr>",
                "[MBh]",
                "<em>Madhyamakāvatārabhāśya</em> </tr>\n<tr>",
                "[MMK]",
                "<em>Mūlamadhyamakārikā</em> </tr>\n<tr>",
                "[PP]",
                "<em>Prasannapadā</em> </tr>\n<tr>",
                "[PPMV]",
                "<em>Prajñāpradīpamūlamadhyamakavṛtti</em>\n</tr>\n<tr>",
                "[PVK]",
                "<em>Pramāṇavārttikakārikā</em>\n</tr>\n<tr>",
                "[PVT]",
                "<em>Pramāṇavārttikavṛtti</em> </tr>\n<tr>",
                "[TriṃB]",
                "<em>Triṃśikābhāṣya</em> </tr>\n<tr>",
                "[TSN]",
                "<em>Trisvabhāvanirdeśa</em> </tr>\n<tr>",
                "[ViṃKV]",
                "<em>Viṃśatikā-kārikāvṛtti</em>\n</tr> </tbody>\n</table>\n<h3>"
            ],
            "<a name=\"PriLit\">Primary Literature</a>": [
                "</h3>\n<p>\nNote: In the citations like <em>Mngon pa</em> khu 166b–167a),\n<em>Tshad ma</em> che 108b–109a) etc., <em>Mngon pa</em> and\n<em>Tshad ma</em> are the names of the classificatory disciplines and\nkhu 166b–167a, che 108b–109a etc., are volume titles and\nnumbers.</p>\n<ul class=\"hanging\">",
                "Āryadeva, <em>Four Hundred Verses</em>\n(<em>Catuḥśataka</em>, tsha 1b–18a), Sde dge edition\nof the Bstan ‘gyur, Dharmasala: Paljor Press, 1998. For\nGyel-tsap’s full commentary in Enlish translation see:\n\n<ul class=\"subhang\">",
                "Geshe Sonam Rinchen, 2008, <em>Āryadeva’s Four Hundrded\nStanzas on the Middle Way</em>, Ruth Sonam (trans.), Ithaca, New York:\nSnow Lion Publications.\n</ul> \nthe translations of the first four chapters are included in:\n\n<ul class=\"subhang\">",
                "Lang, Karen, 2003, <em>Four Illusions: Candrakīrti’s Advices\nto Travelers on the Bodhisattva Path</em>, Oxford: Oxford University\nPress.\n</ul>",
                "Bhāvavevika, [MadhHK],\n<em>Madhyamakahṛdayakārikā</em> (<em>Dbu ma snying\npo’i tshig l’hur byas pa</em>). Dbu ma dza 1a–40b), Sde dge\nedition of the Bstan ‘gyur, Dharmasala: Paljor Press, 1998.",
                "–––,\n<em>Madhyamakahṛdayavṛtti-tarkajvālā</em>\n(<em>Dbu ma snying po’i ‘grel pa rtog ge ‘bar ba</em>).\nDbu ma dza 40b–396b), Sde dge edition of the Bstan ‘gyur,\nDharmasala: Paljor Press, 1998.",
                "–––, <em>Madhyamakaratnapradīpa</em>\n(<em>Dbu ma rin po che’i sgron ma</em>), Sde dge bstan ‘gyur,\nDbu ma tsha 259b–289a), Sde dge edition of the Bstan\n‘gyur, Dharmasala: Paljor Press, 1998.",
                "–––, [PPMV],\n<em>Prajñāpradīpamūlamadhyamakav ṛtti</em>\n(<em>Dbu ma rtsa ba’i ‘grel ba shes rab sgron ma</em>. Dbu ma\ntsha 45b–259b), Sde dge edition of the Bstan ‘gyur,\nDharmasala: Paljor Press, 1998.",
                "Buddhapālita,\n<em>Buddhapālitamūlamadhyamakavṛtti</em>. (<em>Dbu\nma</em> tsa 158b–281a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "Coghlan, Ian, 2021, <em>Buddhapālita’s Commentary on\nNāgārjuna’s Middle Way:\nBuddhapālita-Mūlamadhyamaka-Vṛtti</em>. New York: The\nAmerican Institute of Buddhist Studies and Wisdom Publications. A good\nportion of this text is translated from Tibetan into English by Akira\nSaito and included in his unpublished thesis:\n\n<ul class=\"subhang\">",
                "Saito, Akira, 1984, <em>A Study of the\nBuddhapālita-Mūlamadhyamakakārikā-vṛtti</em>,\nPh.D. thesis, Australian National University.\n [<a href=\"http://hdl.handle.net/1885/8139\" target=\"other\">Saito 1984 available online</a>]\n</ul>",
                "Candrakīrti, [M], <em>An Introduction on Madhyamaka</em>\n(<em>Madhyamakāvatāra</em>. Dbu ma ‘a\n201b–219a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, [PP], <em>Clear-word Commentary on the\nFundamental Verses of the Middle Way</em>\n(<em>Mūlamadhyamakavṛttiprasannapadā</em>. Dbu ma\n‘a 1b–200a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. This text received a good deal of\nattention from academic studies. For partial English translations see:\n\n<ul class=\"subhang\">",
                "Sprung, M., 1979, <em>Lucid Exposition of the Middle Way: The\nEssential Chapters from the Prasannapadā of\nCandrakīrti</em>, London: Routledge and Kegan Paul.",
                "Arnold, D., 2005, “Materials for a Mādhyamika Critique\nof Foundationalism: An Annotated Translation of Prasannapadā\n55.11 to 75.13”, <em>Journal of International Association of\nBuddhist Studies</em>, 28(2): 411–467.",
                "de Jong, J.W., 1978, “Textcritical Notes on the\nPrasannapadā”, <em>Indo-Iranian Journal</em>, 20(1):\n25–59 and 20(3): 217–252. doi:10.1007/BF00167750 and\ndoi:10.1007/BF00158041",
                "MacDonald, A., 2015, <em>In Clear Words: The Prasannapadā,\nChapter One</em>, Vol. II: <em>Annotated Translation, Tibetan\nText</em>, Wien: OAW.\n</ul>",
                "–––, <em>Commentary on Seventy Verses on\nEmptiness</em> (<em>Śūnayatāsaptativṛtti</em>,\n<em>Dbu ma</em> tsa 110a–121a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, <em>Commentary on Sixty Verses on\nReasoning</em> (<em>Yuktiṣaṣṭhikavṛtii</em>,\n<em>Dbu ma</em> ya 1b–30b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, <em>Commentary on the Four Hundred Verses\n(Catuḥṣatakaṭika</em>. Dbu ma ya 30b–239a).\nSde dge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998. The first four chapters of Candrakīrti’s commentary are now\navailable in English, see:\n\n<ul class=\"subhang\">",
                "Lang, Karen, 2003, <em>Four Illusions: Candrakīrti’s Advice\nfor Travelers on the Bodhisattva Path</em>, New York: Oxford\nUniversity Press.\n</ul> for a full commentary by Gyeltsap see:\n\n<ul class=\"subhang\">",
                "Geshe Sonam Rinchen, 2008, <em>Āryadeva’s Four Hundred\nStanzas on the Middle Way with Commentary by Gyeltsap</em>, Ruth Sonam\n(trans.), Ithaca, New York: Snow Lion Publications.\n</ul>",
                "–––, [MBh], <em>Commentary on the Introduction\non Madhyamaka</em>\n(<em>Madhyamakāvatārabhāśya</em>. Dbu ma ‘a\n220b–348a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, <em>Discussion on the Five Aggregates</em>\n(<em>Pañcaskandhaprakaraṇa</em>, <em>Dbu ma</em> ya\n239b–266b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Dharmakīrti, <em>Ascertainment of Epistemology</em>\n(<em>Pramāṇaviniścaya, tshad ma</em> ce\n152b–230a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, [PVT], <em>Commentary on the Verses of\nEpistemology</em>\n(<em>Pramāṇavārttikavṛtti</em>, <em>tshad\nma</em> ce 261b–365a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, <em>Dose of Logical Reasoning</em>\n(<em>Nyāyabindu</em>, <em>tshad ma</em> ce 231b–238a). Sde\ndge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998.",
                "–––, [PVK], <em>Verses on Epistemology</em>\n(<em>Pramāṇavārttikakārikā</em>, <em>tshad\nma</em> ce 94b–151a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Dharmottara, <em>Epistemological Drops\n(Nyābinduṭīkā)</em> (<em>Tshad ma</em> we\n36b–92a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.",
                "Dignāga, [ĀlamPV], <em>Investigation About the Support\nof the Cognition</em>\n(<em>Ālambanaparīkṣāvṛtti</em>). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press, 1998. The\ntranslation of Dignāga’s text is included in two contemporary\nworks:\n\n<ul class=\"subhang\">",
                "Tola, F. and C. Dragonetti, 2004, <em>Being as Consciousness:\nYogācāra Philosophy of Buddhism</em>, Delhi: Motilal\nBanarsidass Publishers.",
                "Duckworth, D., M.D. Eckel, J.L. Garfield, J. Powers, Y. Thabkhas,\nand S. Thakchoe, 2016, <em>Dignāga’s Investigation of the\nPercept: A Philosophical Legacy in India and Tibet</em>, New York:\nOxford University Press.\n</ul>",
                "–––, <em>Auto-commentary on the Compendium of\nRight-cognition</em> (<em>Pramāṇasamuccayavṛtti,\nTshad ma</em> ce 14b–85b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, <em>Compendium of Right-cognition</em>\n(<em>Pramāṇasamuccaya</em>, <em>Tshad ma</em> ce\n1b–13a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.",
                "Dorjee, Penpa, <em>Ācārya Kamalaśīla’s\nMadhyamakāloka</em> (<em>Restored Sansktrit Text from the Tibetan\nVersion</em>). Sarnath: Central Institute of Higher Tibetan Studies.\n2001.",
                "Jayānanda, <em>Commentary on Introduction on Middle Way\n(Madhyamakāvatāraṭīkā / Dbu ma la ’jug\npa’i ’grel bshad)</em>. Translated by Jayānanda and\nKun dga’ grags. Degé Tangyur: Toh. 3870, dbu ma, ra:\n1b-365a; Pedurma (119).",
                "–––, <em>Reasoning Hammer\n(Tarkamudgarakārikā / Rtog Gi Tho Ba’i Tshig\nLe’ur Byas Pa)</em>. Translated by Jayānanda and Khu Mdo\nrde ’bar. Degé Tangyur: Toh. 3869, dbu ma, ya: 374b-375a;\nPedurma (118): 1876–1879.",
                "Jñānagarbha (Yeshes snying po), <em>Commentary\nOnf The Two Truths Distinction (Satyadvayavibhaṅgavṛtti /\nBden Pa Gnyis Rnam Par ’byed Pa’i ’Grel Pa)</em>.\nTranslated by Śīlendrabodhi and Yeshes sde. Degé\nTangyur: Toh. 3882, dbu ma, sa: 3b-15b.",
                "<em>–––, The Two Truths Distinction\n(Satyadvayavibhaṅgakārikā / Bden pa gnyis rnam par\n’byed pa’i tshig le’ur byas)</em>. Translated into\nTibetan by Śīlendrabodhi and Yeshes sde. Degé\nTangyur: Toh. 3881, dbu ma, sa: 1b-3b. The English translation of\nJñānagarbha’s text",
                "Malcolm David Eckel,1992.\n<em>Jñānagarbha’s commentary on the distinction\nbetween the two truths: an eighth century handbook of Madhyamaka\nphilosophy</em>. Indian ed. Delhi: Motilal Banarsidass.",
                "<em>–––, Yogic Path\n(Yogabhāvanāmārga / Rnal ’byor Bsgom Pa’i\nLam)</em>. Degé Tangyur: Toh. 3909, dbu ma, ki: 4a–6a.",
                "Kamalaśīla, <em>Discussion on the Light of Reality</em>\n(<em>Tattvāloka-nama-prakaraṇa</em>, <em>Dbu ma</em> sa\n244b–273a), Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, <em>Establishing the Non-intrinsic Reality\nof All Phenomena</em> (<em>Sarvadharmāsvabhāvasiddhi</em>,\nDbu ma sa 273a–291a), Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "–––, [MA], <em>Light of the Middle Way</em>\n(<em>Madhyamakālokaḥ Dbu ma</em> sa 133b–244a). Sde\ndge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998.",
                "–––, <em>Stages of Meditation</em>\n(<em>Bhāvanākrama</em>, Dbu ma ki 22a–68b). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, <em>Subcommentary on the Ornament of the\nMiddle Way</em>\n(<em>Madhyamakālaṁkārapañjikā</em>, Dbu ma\nsa 84a–133b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Komito, D.R., 1999, <em>Nāgārjuna’s Seventy Stanzas: A\nBuddhist Psychology of Emptiness</em>, Ithaca, New York: Snow Lion\nPublications.",
                "Maitreyanātha, [DharDVK], <em>Verses on the Distinction\nBetween Phenomena and Reality</em>\n(<em>Dharmadharmatāvibhaṅga-kārikā</em>, <em>Sems\ntsam</em> phi 50b–53b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, <em>Separation of the Middle From\nExtremes</em> (<em>Madhyāntavibhaṅgakārika</em>, Sems\ntsam phi 50b–53b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Nāgārjuna, <em>Commentary on the Verse Rebutting the\nDisputes (Vigrahavyāvartanīvṛtti</em>, Vig Dbu ma tsa\n121a–137a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. For English translations of this text\nsee:\n\n<ul class=\"subhang\">",
                "Kamaleswar, B., E.H. Johnson, and A. Kunst, 2002, <em>The\nDialectical Method of Nāgārjuna:\nVigrahavyāvartanī</em>, New Delhi: Motilal Banarsidass\nPublishers.",
                "Westerhoff, Jan, 2010, <em>The Dispeller of Disputes:\nNāgārjuna’s Vigrahavyāvartanī</em>. New York:\nOxford University Press.\n</ul>",
                "–––, [MMK], <em>Fundamental Verses of the Middle\nWay (Mūlamadhyamakakārikā, Dbu ma</em> tsa\n1b–19a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. For commentaries in English translations, see:\n\n<ul class=\"subhang\">",
                "Siderits, M. and S. Katsura, 2013, <em>Nāgārjuna’s\nMiddle Way: Mūlamadhyamakakārikā</em>, Boston: Wisdom\nPublications.",
                "Garfield, J. and N. Geshe Samten, 2006, <em>Ocean of Reasoning: A\nGreat Commentary on Nāgārjuna’s\nMūlamadhyamakākarikā</em>, New York: Oxford University\nPress.\n</ul>",
                "–––, <em>Seventy Verses on Emptiness\n(Śūnyatāsaptatikārikā</em>. <em>Dbu m</em>a\ntsa 24a–27a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. An English translation of the text is\nincluded in Lindtner 1997: 94–120. For Geshe Sonam Rinchen’s\ncommentary on this text in English see Komito 1999.",
                "–––, <em>Sixty Verses on Reasoning</em>\n(<em>Yuktiṣaṣṭhikākārikā</em>,\n<em>Dbu ma</em> tsa 20b–22b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998. For Candrakīrti’s\ncommentary translated from the Tibetan with introductory study and\nannotation by Joseph John Loizzo and the AIBS translation team see\nLoizzo, <em>Nāgārjuna’s Reason Sixty with Candrakīrti’s\nCommentary</em>, New York: Columbia University Press. 2007.",
                "–––, <em>Verses Rebutting the Disputes\n(Vigrahavyāvartanīkārikā</em>, Dbu ma tsa\n27a–29a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.",
                "Śāntarakṣita, <em>Commentary on the Distinguishing\nthe Two Truths</em> (<em>Satyadvayavibhaṅgapañjikā\nDbu ma</em> sa 15b–52b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, [MAV], <em>Commentary on the Ornament of\nthe Middle Way</em> (<em>Madhyamakālaṁkāravṛtti\nDbu ma</em> sa 56b–84a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.",
                "–––, [MAK], <em>Ornament of the Middle Way</em>\n(<em>Madhyamakālaṁkārakārikā</em> <em>Dbu\nma</em> sa 53a–56b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Sthiramati, [TriṃB], <em>Commentary on the Thirty\nVerses</em> (<em>Triṃśikābhāṣya</em>,\n<em>Sems tsam</em>),Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.",
                "Vasubandhu, [AKB], <em>Commentary on the Treasury of\nKnowledge</em> (<em>Abhidharmakośabhāṣya</em>),\n<em>Mngon pa</em> ku 26b–258a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998. For English translation\nsee:\n\n<ul class=\"subhang\">",
                "Pruden, L.M., 1988–1990,\n<em>Abhidharmakośabhāṣyam of Vasubandhu</em>, Vols.\nI–IV, Berkeley, CA: Asian Humanities Press.\n</ul>",
                "–––, <em>Commentary on The Twenty Verses\nViṃśakārikāvṛtti, Sems tsam</em> shi\n4a–10a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. An English translations of verses and their\ncommentary are included in Anacker 2005: 157–181:\n\n<ul class=\"subhang\">",
                "Anaker, S., 2005, <em>Seven Works of Vasubandhu: The Buddhist\nPsychological Doctor</em>, Delhi: Motilal Banarsidass, 2005,\n</ul>",
                "–––, [ViṃKV], <em>Commentary on the Twenty\nVerses</em>\n(<em>Viṃśatikā-kārikāvṛtti</em>,\n16–17). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. An English translations of verses and their\ncommentary are included in Anacker 2005: 157–181.",
                "–––, [TSN], <em>The Discernment of the Three\nNatures</em> (<em>Tri Svabhāva Niṛdeśa</em>). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press. 1998. An\nEnglish translations of this text is included in Anacker 2005:\n287–299.",
                "–––, <em>The Thirty Verses</em>\n(<em>Triṃśikā kārikā Triṃ; Sem\ntsam</em> shi 1a–3a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. For an English translations of the\nverses see Anacker 2005: 181–191.",
                "–––, [AK], <em>Treasury of Knowledge</em>\n(<em>Abhidharmakośakārikā</em>); <em>Mngon pa</em> ku\n1b–25a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.",
                "–––, <em>The Twenty Verses</em>\n(<em>Viṃśatikākārikā, Viṃ Sems\ntsam</em> shi 3a–4a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.\n</ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Changkya Rolpai Droje (<em>Lcang skya rol pa’i rdo rje</em>),\n1989, <em>Philosophical Embellishment of the Buddha’s Teachings</em>\n(<em>Grub mtha’ thub bstan lhun po’i mdzes rgyan</em>), Xiling: Mtsho\nsngon mi rigs Press.",
                "Blumental, James, 2004, <em>The Ornament of the Middle Way: A\nStudy of the Madhyamaka Thought of Śāntarakṣita</em>,\nIthaca, New York: Snow Lion Publications.",
                "Eckel, Malcolm David, 1987, <em>Jñāgarbhabha’s\nCommentary on the Distinction Between the Two Truths: An Eight Century\nHandbook of Madhyamaka Philosophy</em>, New York: State University of\nNew York Press.",
                "–––, 2008, <em>Bhavevika and His Opponents:\nChapters 4 and 5 of the Verses on the Heart of the Middle Way</em>\n(<em>Madhyamakahṛdayakārikā</em>), with the Commentary\nEntitled The Flame of Reason (<em>Tarkajvāla</em>), Cambridge:\nHarvard University Press.",
                "Emmanuel, Steven M., ed. 2013, <em>A Companion to Buddhist\nPhilosophy</em>. Blackwell Companions to Philosophy 139. Chichester,\nWest Sussex, United Kingdom: Wiley-Blackwell.",
                "Garfield, Jay L, 1995, <em>The Fundamental Wisdom of the\nMiddle Way</em>, New York, Oxford: Oxford University Press",
                "–––, 2015, <em>Engaging Buddhism: Why It Matters\nto Philosophy</em>. Oxford ; New York: Oxford University\nPress.",
                "–––, 2022, <em>Losing Ourselves: Learning to\nLive without a Self</em>. Princeton: Princeton University Press.",
                "Hayes, Richard P. 1994, “Nāgārjuna’s\nAppeal.” <em>Journal of Indian Philosophy</em> 22(4):\n299–378.",
                "Huntington, C.W. and Geshe Namgyal Wangchen, 1989, <em>The\nEmptiness of Emptiness: An Introduction to Early Indian\nMādhyamika</em>, Honolulu: University of Hawaii Press.",
                "Kapstein, Matthew. 2015, <em>Interpreting Indian Philosophy</em>.\nEdited by Jonardon Ganeri. Vol. 1. Oxford University Press.",
                "Kalupahana, D. J., 1991, <em>Mūlamadhyamakakārikā\nof Nāgārjuna: The Philosophy of the Middle Way.\nIntroduction, Sanskrit Text, English Translation and Annotation</em>,\nDelhi: Motilal Banarsidass Publishers Pvt. Limited.",
                "Karunadasa, Y., 1996, <em>The Dhamma Theory: Philosophical\nCornerstone of the Abhidhamma</em>, Wheel Publication 412/413. Kandy,\nSri Lanka: Buddhist Publication Society.",
                "–––, 2006, “Theravāda Version of the\nTwo Truths”, Presentation to Korean Conference of Buddhist\nStudies. <!-- commented out by Emma January 2017 URL = &lt;<a href=\"http://www.skb.or.kr/2006/down/papers/094.pdf\" target=\"other\">http://www.skb.or.kr/2006/down/papers/094.pdf</a>&gt;\n -->",
                "Lindtner, Chr., 1997, <em>Masters of Wisdom: Writings of the\nBuddhist Master Nāgārjuna</em>, Oakland, CA: Dharma\nPress.",
                "Roerich, George N., 1976, <em>The Blue Annals</em>, Delhi: Motilal\nBanarsidass.",
                "Ruegg, David Seyfort. 2010, <em>The Buddhist Philosophy of the\nMiddle: Essays on Indian and Tibetan Madhyamaka</em>, Boston: Wisdom\nPublications.",
                "Siderits, Mark, 2007, <em>Buddhism as Philosophy: an Introduction,\n</em> Ashgate Publishing/Hackett Publishing.",
                "–––, 2015, Personal Identity and Buddhist\nPhilosophy: Empty Persons, Ashgate World Philosophies Series,\nBurlington, VT: Ashaget Publishing Company.",
                "Siderits, Mark, and Jan Westerhoff, eds. 2016. <em>Studies in\nBuddhist Philosophy,</em> Oxford, New York: Oxford University\nPress.",
                "Thakchoe, Sonam, 2007, <em>The Two Truths Debate: Tsongkhapa and\nGorampa on the Middle Way</em>, Boston: Wisdom Publications.",
                "Thakchoe, Sonam, Malcolm David Eckel, Jay L. Garfield, and\nDignāga. 2016. <em>Dignāga’s Investigation of the\nPercept: A Philosophical Legacy in India and Tibet</em>. New York, NY:\nOxford University Press.",
                "The Cowherds, 2011, <em>Moonshadows: Conventional Truth in\nBuddhist Philosophy</em>, New York: Oxford University Press.",
                "–––, 2015, <em>Moonpath: Ethics and\nEmptiness</em>, New York: Oxford University Press.",
                "The Yakherds,  2021a. <em>Knowing Illusion: Bringing Tibetan\nDebate into Contemporary Discourse: I Philosophical History of the\nDebate</em>. 1st ed. New York: Oxford University Press.",
                "–––, 2021b, <em>Knowing Illusion:\nBringing Tibetan Debate into Contemporary Discourse: II\nTranslation</em>. 1st ed. New York: Oxford University Press.",
                "Westerhoff, Jan. 2018, <em>The Golden Age of Indian Buddhist\nPhilosophy</em>. First edition. The Oxford History of Philosophy.\nOxford: Oxford University Press.",
                "–––, 2015, <em>Nāgārjuna on\nEmptiness</em>. Edited by Jonardon Ganeri. Vol. 1. Oxford University\nPress.",
                "–––, 2010, <em>The Dispeller of Disputes:\nNāgārjuna’s Vigrahavyāvartanī</em>.\nOxford ; New York: Oxford University Press.",
                "–––, 2010, <em>Twelve Examples of Illusion</em>.\n1 edition. Oxford ; New York: Oxford University Press.",
                "–––, 2009, <em>Nāgārjuna’s Madhyamaka:\nA Philosophical Introduction</em>, Oxford: Oxford University\nPress.",
                "Yonezawa, Yoshiyasu, 2008, “Vigrahavyāvartanī,\nSanskrit Transliteration and Tibetan Translation”, <em>Journal\nof Naritasan Institute for Buddhist Studies</em>, 31:\n209–333.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"AbbCitWor\">List of Abbreviations</a></h3>\n<table class=\"cellpad-small vert-top cell-rl\">\n<tbody>\n<tr>\n<td>[AK]</td>\n<td><em>Abhidharmakośakārikā</em></td> </tr>\n<tr>\n<td>[AKB]</td>\n<td><em>Abhidharmakośabhāṣya</em></td> </tr>\n<tr>\n<td>[ĀlamPV]</td>\n<td><em>Ālambanaparīkṣāvṛtti</em></td>\n</tr>\n<tr>\n<td>[M]</td>\n<td><em>Madhyamakāvatāra</em></td> </tr>\n<tr>\n<td>[MA]</td>\n<td><em>Madhyamakālokaḥ</em></td> </tr>\n<tr>\n<td>[MadhHK]</td>\n<td><em>Madhyamakahṛdayakārikā</em></td> </tr>\n<tr>\n<td>[MAK]</td>\n<td><em>Madhyamakālaṁkārakārikā</em></td>\n</tr>\n<tr>\n<td>[MAV]</td>\n<td><em>Madhyamakālaṁkāravṛtti</em></td> </tr>\n<tr>\n<td>[MBh]</td>\n<td><em>Madhyamakāvatārabhāśya</em></td> </tr>\n<tr>\n<td>[MMK]</td>\n<td><em>Mūlamadhyamakārikā</em></td> </tr>\n<tr>\n<td>[PP]</td>\n<td><em>Prasannapadā</em></td> </tr>\n<tr>\n<td>[PPMV]</td>\n<td><em>Prajñāpradīpamūlamadhyamakavṛtti</em></td>\n</tr>\n<tr>\n<td>[PVK]</td>\n<td><em>Pramāṇavārttikakārikā</em></td>\n</tr>\n<tr>\n<td>[PVT]</td>\n<td><em>Pramāṇavārttikavṛtti</em></td> </tr>\n<tr>\n<td>[TriṃB]</td>\n<td><em>Triṃśikābhāṣya</em></td> </tr>\n<tr>\n<td>[TSN]</td>\n<td><em>Trisvabhāvanirdeśa</em></td> </tr>\n<tr>\n<td>[ViṃKV]</td>\n<td><em>Viṃśatikā-kārikāvṛtti</em></td>\n</tr> </tbody>\n</table>\n<h3><a name=\"PriLit\">Primary Literature</a></h3>\n<p>\nNote: In the citations like <em>Mngon pa</em> khu 166b–167a),\n<em>Tshad ma</em> che 108b–109a) etc., <em>Mngon pa</em> and\n<em>Tshad ma</em> are the names of the classificatory disciplines and\nkhu 166b–167a, che 108b–109a etc., are volume titles and\nnumbers.</p>\n<ul class=\"hanging\">\n<li>Āryadeva, <em>Four Hundred Verses</em>\n(<em>Catuḥśataka</em>, tsha 1b–18a), Sde dge edition\nof the Bstan ‘gyur, Dharmasala: Paljor Press, 1998. For\nGyel-tsap’s full commentary in Enlish translation see:\n\n<ul class=\"subhang\">\n<li>Geshe Sonam Rinchen, 2008, <em>Āryadeva’s Four Hundrded\nStanzas on the Middle Way</em>, Ruth Sonam (trans.), Ithaca, New York:\nSnow Lion Publications.</li>\n</ul> \nthe translations of the first four chapters are included in:\n\n<ul class=\"subhang\">\n<li>Lang, Karen, 2003, <em>Four Illusions: Candrakīrti’s Advices\nto Travelers on the Bodhisattva Path</em>, Oxford: Oxford University\nPress.</li>\n</ul> </li>\n<li>Bhāvavevika, [MadhHK],\n<em>Madhyamakahṛdayakārikā</em> (<em>Dbu ma snying\npo’i tshig l’hur byas pa</em>). Dbu ma dza 1a–40b), Sde dge\nedition of the Bstan ‘gyur, Dharmasala: Paljor Press, 1998.</li>\n<li>–––,\n<em>Madhyamakahṛdayavṛtti-tarkajvālā</em>\n(<em>Dbu ma snying po’i ‘grel pa rtog ge ‘bar ba</em>).\nDbu ma dza 40b–396b), Sde dge edition of the Bstan ‘gyur,\nDharmasala: Paljor Press, 1998.</li>\n<li>–––, <em>Madhyamakaratnapradīpa</em>\n(<em>Dbu ma rin po che’i sgron ma</em>), Sde dge bstan ‘gyur,\nDbu ma tsha 259b–289a), Sde dge edition of the Bstan\n‘gyur, Dharmasala: Paljor Press, 1998.</li>\n<li>–––, [PPMV],\n<em>Prajñāpradīpamūlamadhyamakav ṛtti</em>\n(<em>Dbu ma rtsa ba’i ‘grel ba shes rab sgron ma</em>. Dbu ma\ntsha 45b–259b), Sde dge edition of the Bstan ‘gyur,\nDharmasala: Paljor Press, 1998.</li>\n<li>Buddhapālita,\n<em>Buddhapālitamūlamadhyamakavṛtti</em>. (<em>Dbu\nma</em> tsa 158b–281a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>Coghlan, Ian, 2021, <em>Buddhapālita’s Commentary on\nNāgārjuna’s Middle Way:\nBuddhapālita-Mūlamadhyamaka-Vṛtti</em>. New York: The\nAmerican Institute of Buddhist Studies and Wisdom Publications. A good\nportion of this text is translated from Tibetan into English by Akira\nSaito and included in his unpublished thesis:\n\n<ul class=\"subhang\">\n<li>Saito, Akira, 1984, <em>A Study of the\nBuddhapālita-Mūlamadhyamakakārikā-vṛtti</em>,\nPh.D. thesis, Australian National University.\n [<a href=\"http://hdl.handle.net/1885/8139\" target=\"other\">Saito 1984 available online</a>]</li>\n</ul> </li>\n<li>Candrakīrti, [M], <em>An Introduction on Madhyamaka</em>\n(<em>Madhyamakāvatāra</em>. Dbu ma ‘a\n201b–219a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, [PP], <em>Clear-word Commentary on the\nFundamental Verses of the Middle Way</em>\n(<em>Mūlamadhyamakavṛttiprasannapadā</em>. Dbu ma\n‘a 1b–200a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. This text received a good deal of\nattention from academic studies. For partial English translations see:\n\n<ul class=\"subhang\">\n<li>Sprung, M., 1979, <em>Lucid Exposition of the Middle Way: The\nEssential Chapters from the Prasannapadā of\nCandrakīrti</em>, London: Routledge and Kegan Paul.</li>\n<li>Arnold, D., 2005, “Materials for a Mādhyamika Critique\nof Foundationalism: An Annotated Translation of Prasannapadā\n55.11 to 75.13”, <em>Journal of International Association of\nBuddhist Studies</em>, 28(2): 411–467.</li>\n<li>de Jong, J.W., 1978, “Textcritical Notes on the\nPrasannapadā”, <em>Indo-Iranian Journal</em>, 20(1):\n25–59 and 20(3): 217–252. doi:10.1007/BF00167750 and\ndoi:10.1007/BF00158041</li>\n<li>MacDonald, A., 2015, <em>In Clear Words: The Prasannapadā,\nChapter One</em>, Vol. II: <em>Annotated Translation, Tibetan\nText</em>, Wien: OAW.</li>\n</ul> </li>\n<li>–––, <em>Commentary on Seventy Verses on\nEmptiness</em> (<em>Śūnayatāsaptativṛtti</em>,\n<em>Dbu ma</em> tsa 110a–121a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Commentary on Sixty Verses on\nReasoning</em> (<em>Yuktiṣaṣṭhikavṛtii</em>,\n<em>Dbu ma</em> ya 1b–30b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Commentary on the Four Hundred Verses\n(Catuḥṣatakaṭika</em>. Dbu ma ya 30b–239a).\nSde dge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998. The first four chapters of Candrakīrti’s commentary are now\navailable in English, see:\n\n<ul class=\"subhang\">\n<li>Lang, Karen, 2003, <em>Four Illusions: Candrakīrti’s Advice\nfor Travelers on the Bodhisattva Path</em>, New York: Oxford\nUniversity Press.</li>\n</ul> for a full commentary by Gyeltsap see:\n\n<ul class=\"subhang\">\n<li>Geshe Sonam Rinchen, 2008, <em>Āryadeva’s Four Hundred\nStanzas on the Middle Way with Commentary by Gyeltsap</em>, Ruth Sonam\n(trans.), Ithaca, New York: Snow Lion Publications.</li>\n</ul> </li>\n<li>–––, [MBh], <em>Commentary on the Introduction\non Madhyamaka</em>\n(<em>Madhyamakāvatārabhāśya</em>. Dbu ma ‘a\n220b–348a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Discussion on the Five Aggregates</em>\n(<em>Pañcaskandhaprakaraṇa</em>, <em>Dbu ma</em> ya\n239b–266b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Dharmakīrti, <em>Ascertainment of Epistemology</em>\n(<em>Pramāṇaviniścaya, tshad ma</em> ce\n152b–230a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, [PVT], <em>Commentary on the Verses of\nEpistemology</em>\n(<em>Pramāṇavārttikavṛtti</em>, <em>tshad\nma</em> ce 261b–365a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Dose of Logical Reasoning</em>\n(<em>Nyāyabindu</em>, <em>tshad ma</em> ce 231b–238a). Sde\ndge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998.</li>\n<li>–––, [PVK], <em>Verses on Epistemology</em>\n(<em>Pramāṇavārttikakārikā</em>, <em>tshad\nma</em> ce 94b–151a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Dharmottara, <em>Epistemological Drops\n(Nyābinduṭīkā)</em> (<em>Tshad ma</em> we\n36b–92a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.</li>\n<li>Dignāga, [ĀlamPV], <em>Investigation About the Support\nof the Cognition</em>\n(<em>Ālambanaparīkṣāvṛtti</em>). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press, 1998. The\ntranslation of Dignāga’s text is included in two contemporary\nworks:\n\n<ul class=\"subhang\">\n<li>Tola, F. and C. Dragonetti, 2004, <em>Being as Consciousness:\nYogācāra Philosophy of Buddhism</em>, Delhi: Motilal\nBanarsidass Publishers.</li>\n<li>Duckworth, D., M.D. Eckel, J.L. Garfield, J. Powers, Y. Thabkhas,\nand S. Thakchoe, 2016, <em>Dignāga’s Investigation of the\nPercept: A Philosophical Legacy in India and Tibet</em>, New York:\nOxford University Press.</li>\n</ul> </li>\n<li>–––, <em>Auto-commentary on the Compendium of\nRight-cognition</em> (<em>Pramāṇasamuccayavṛtti,\nTshad ma</em> ce 14b–85b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Compendium of Right-cognition</em>\n(<em>Pramāṇasamuccaya</em>, <em>Tshad ma</em> ce\n1b–13a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.</li>\n<li>Dorjee, Penpa, <em>Ācārya Kamalaśīla’s\nMadhyamakāloka</em> (<em>Restored Sansktrit Text from the Tibetan\nVersion</em>). Sarnath: Central Institute of Higher Tibetan Studies.\n2001.</li>\n<li>Jayānanda, <em>Commentary on Introduction on Middle Way\n(Madhyamakāvatāraṭīkā / Dbu ma la ’jug\npa’i ’grel bshad)</em>. Translated by Jayānanda and\nKun dga’ grags. Degé Tangyur: Toh. 3870, dbu ma, ra:\n1b-365a; Pedurma (119).</li>\n<li>–––, <em>Reasoning Hammer\n(Tarkamudgarakārikā / Rtog Gi Tho Ba’i Tshig\nLe’ur Byas Pa)</em>. Translated by Jayānanda and Khu Mdo\nrde ’bar. Degé Tangyur: Toh. 3869, dbu ma, ya: 374b-375a;\nPedurma (118): 1876–1879.</li>\n<li>Jñānagarbha (Yeshes snying po), <em>Commentary\nOnf The Two Truths Distinction (Satyadvayavibhaṅgavṛtti /\nBden Pa Gnyis Rnam Par ’byed Pa’i ’Grel Pa)</em>.\nTranslated by Śīlendrabodhi and Yeshes sde. Degé\nTangyur: Toh. 3882, dbu ma, sa: 3b-15b.</li>\n<li><em>–––, The Two Truths Distinction\n(Satyadvayavibhaṅgakārikā / Bden pa gnyis rnam par\n’byed pa’i tshig le’ur byas)</em>. Translated into\nTibetan by Śīlendrabodhi and Yeshes sde. Degé\nTangyur: Toh. 3881, dbu ma, sa: 1b-3b. The English translation of\nJñānagarbha’s text </li>\n<li>       Malcolm David Eckel,1992.\n<em>Jñānagarbha’s commentary on the distinction\nbetween the two truths: an eighth century handbook of Madhyamaka\nphilosophy</em>. Indian ed. Delhi: Motilal Banarsidass.</li>\n<li><em>–––, Yogic Path\n(Yogabhāvanāmārga / Rnal ’byor Bsgom Pa’i\nLam)</em>. Degé Tangyur: Toh. 3909, dbu ma, ki: 4a–6a.</li>\n<li>Kamalaśīla, <em>Discussion on the Light of Reality</em>\n(<em>Tattvāloka-nama-prakaraṇa</em>, <em>Dbu ma</em> sa\n244b–273a), Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Establishing the Non-intrinsic Reality\nof All Phenomena</em> (<em>Sarvadharmāsvabhāvasiddhi</em>,\nDbu ma sa 273a–291a), Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>–––, [MA], <em>Light of the Middle Way</em>\n(<em>Madhyamakālokaḥ Dbu ma</em> sa 133b–244a). Sde\ndge edition of the Bstan ‘gyur. Dharmasala: Paljor Press.\n1998.</li>\n<li>–––, <em>Stages of Meditation</em>\n(<em>Bhāvanākrama</em>, Dbu ma ki 22a–68b). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Subcommentary on the Ornament of the\nMiddle Way</em>\n(<em>Madhyamakālaṁkārapañjikā</em>, Dbu ma\nsa 84a–133b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Komito, D.R., 1999, <em>Nāgārjuna’s Seventy Stanzas: A\nBuddhist Psychology of Emptiness</em>, Ithaca, New York: Snow Lion\nPublications.</li>\n<li>Maitreyanātha, [DharDVK], <em>Verses on the Distinction\nBetween Phenomena and Reality</em>\n(<em>Dharmadharmatāvibhaṅga-kārikā</em>, <em>Sems\ntsam</em> phi 50b–53b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, <em>Separation of the Middle From\nExtremes</em> (<em>Madhyāntavibhaṅgakārika</em>, Sems\ntsam phi 50b–53b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Nāgārjuna, <em>Commentary on the Verse Rebutting the\nDisputes (Vigrahavyāvartanīvṛtti</em>, Vig Dbu ma tsa\n121a–137a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. For English translations of this text\nsee:\n\n<ul class=\"subhang\">\n<li>Kamaleswar, B., E.H. Johnson, and A. Kunst, 2002, <em>The\nDialectical Method of Nāgārjuna:\nVigrahavyāvartanī</em>, New Delhi: Motilal Banarsidass\nPublishers.</li>\n<li>Westerhoff, Jan, 2010, <em>The Dispeller of Disputes:\nNāgārjuna’s Vigrahavyāvartanī</em>. New York:\nOxford University Press.</li>\n</ul> </li>\n<li>–––, [MMK], <em>Fundamental Verses of the Middle\nWay (Mūlamadhyamakakārikā, Dbu ma</em> tsa\n1b–19a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. For commentaries in English translations, see:\n\n<ul class=\"subhang\">\n<li>Siderits, M. and S. Katsura, 2013, <em>Nāgārjuna’s\nMiddle Way: Mūlamadhyamakakārikā</em>, Boston: Wisdom\nPublications.</li>\n<li>Garfield, J. and N. Geshe Samten, 2006, <em>Ocean of Reasoning: A\nGreat Commentary on Nāgārjuna’s\nMūlamadhyamakākarikā</em>, New York: Oxford University\nPress.</li>\n</ul> </li>\n<li>–––, <em>Seventy Verses on Emptiness\n(Śūnyatāsaptatikārikā</em>. <em>Dbu m</em>a\ntsa 24a–27a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. An English translation of the text is\nincluded in Lindtner 1997: 94–120. For Geshe Sonam Rinchen’s\ncommentary on this text in English see Komito 1999.</li>\n<li>–––, <em>Sixty Verses on Reasoning</em>\n(<em>Yuktiṣaṣṭhikākārikā</em>,\n<em>Dbu ma</em> tsa 20b–22b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998. For Candrakīrti’s\ncommentary translated from the Tibetan with introductory study and\nannotation by Joseph John Loizzo and the AIBS translation team see\nLoizzo, <em>Nāgārjuna’s Reason Sixty with Candrakīrti’s\nCommentary</em>, New York: Columbia University Press. 2007.</li>\n<li>–––, <em>Verses Rebutting the Disputes\n(Vigrahavyāvartanīkārikā</em>, Dbu ma tsa\n27a–29a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.</li>\n<li>Śāntarakṣita, <em>Commentary on the Distinguishing\nthe Two Truths</em> (<em>Satyadvayavibhaṅgapañjikā\nDbu ma</em> sa 15b–52b). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, [MAV], <em>Commentary on the Ornament of\nthe Middle Way</em> (<em>Madhyamakālaṁkāravṛtti\nDbu ma</em> sa 56b–84a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998.</li>\n<li>–––, [MAK], <em>Ornament of the Middle Way</em>\n(<em>Madhyamakālaṁkārakārikā</em> <em>Dbu\nma</em> sa 53a–56b). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Sthiramati, [TriṃB], <em>Commentary on the Thirty\nVerses</em> (<em>Triṃśikābhāṣya</em>,\n<em>Sems tsam</em>),Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n<li>Vasubandhu, [AKB], <em>Commentary on the Treasury of\nKnowledge</em> (<em>Abhidharmakośabhāṣya</em>),\n<em>Mngon pa</em> ku 26b–258a). Sde dge edition of the Bstan\n‘gyur. Dharmasala: Paljor Press. 1998. For English translation\nsee:\n\n<ul class=\"subhang\">\n<li>Pruden, L.M., 1988–1990,\n<em>Abhidharmakośabhāṣyam of Vasubandhu</em>, Vols.\nI–IV, Berkeley, CA: Asian Humanities Press.</li>\n</ul> </li>\n<li>–––, <em>Commentary on The Twenty Verses\nViṃśakārikāvṛtti, Sems tsam</em> shi\n4a–10a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. An English translations of verses and their\ncommentary are included in Anacker 2005: 157–181:\n\n<ul class=\"subhang\">\n<li>Anaker, S., 2005, <em>Seven Works of Vasubandhu: The Buddhist\nPsychological Doctor</em>, Delhi: Motilal Banarsidass, 2005,</li>\n</ul> </li>\n<li>–––, [ViṃKV], <em>Commentary on the Twenty\nVerses</em>\n(<em>Viṃśatikā-kārikāvṛtti</em>,\n16–17). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998. An English translations of verses and their\ncommentary are included in Anacker 2005: 157–181.</li>\n<li>–––, [TSN], <em>The Discernment of the Three\nNatures</em> (<em>Tri Svabhāva Niṛdeśa</em>). Sde dge\nedition of the Bstan ‘gyur. Dharmasala: Paljor Press. 1998. An\nEnglish translations of this text is included in Anacker 2005:\n287–299.</li>\n<li>–––, <em>The Thirty Verses</em>\n(<em>Triṃśikā kārikā Triṃ; Sem\ntsam</em> shi 1a–3a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998. For an English translations of the\nverses see Anacker 2005: 181–191.</li>\n<li>–––, [AK], <em>Treasury of Knowledge</em>\n(<em>Abhidharmakośakārikā</em>); <em>Mngon pa</em> ku\n1b–25a). Sde dge edition of the Bstan ‘gyur. Dharmasala:\nPaljor Press. 1998.</li>\n<li>–––, <em>The Twenty Verses</em>\n(<em>Viṃśatikākārikā, Viṃ Sems\ntsam</em> shi 3a–4a). Sde dge edition of the Bstan ‘gyur.\nDharmasala: Paljor Press. 1998.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Changkya Rolpai Droje (<em>Lcang skya rol pa’i rdo rje</em>),\n1989, <em>Philosophical Embellishment of the Buddha’s Teachings</em>\n(<em>Grub mtha’ thub bstan lhun po’i mdzes rgyan</em>), Xiling: Mtsho\nsngon mi rigs Press.</li>\n<li>Blumental, James, 2004, <em>The Ornament of the Middle Way: A\nStudy of the Madhyamaka Thought of Śāntarakṣita</em>,\nIthaca, New York: Snow Lion Publications.</li>\n<li>Eckel, Malcolm David, 1987, <em>Jñāgarbhabha’s\nCommentary on the Distinction Between the Two Truths: An Eight Century\nHandbook of Madhyamaka Philosophy</em>, New York: State University of\nNew York Press.</li>\n<li>–––, 2008, <em>Bhavevika and His Opponents:\nChapters 4 and 5 of the Verses on the Heart of the Middle Way</em>\n(<em>Madhyamakahṛdayakārikā</em>), with the Commentary\nEntitled The Flame of Reason (<em>Tarkajvāla</em>), Cambridge:\nHarvard University Press.</li>\n<li>Emmanuel, Steven M., ed. 2013, <em>A Companion to Buddhist\nPhilosophy</em>. Blackwell Companions to Philosophy 139. Chichester,\nWest Sussex, United Kingdom: Wiley-Blackwell.</li>\n<li>Garfield, Jay L, 1995, <em>The Fundamental Wisdom of the\nMiddle Way</em>, New York, Oxford: Oxford University Press</li>\n<li>–––, 2015, <em>Engaging Buddhism: Why It Matters\nto Philosophy</em>. Oxford ; New York: Oxford University\nPress.</li>\n<li>–––, 2022, <em>Losing Ourselves: Learning to\nLive without a Self</em>. Princeton: Princeton University Press.</li>\n<li>Hayes, Richard P. 1994, “Nāgārjuna’s\nAppeal.” <em>Journal of Indian Philosophy</em> 22(4):\n299–378.</li>\n<li>Huntington, C.W. and Geshe Namgyal Wangchen, 1989, <em>The\nEmptiness of Emptiness: An Introduction to Early Indian\nMādhyamika</em>, Honolulu: University of Hawaii Press.</li>\n<li>Kapstein, Matthew. 2015, <em>Interpreting Indian Philosophy</em>.\nEdited by Jonardon Ganeri. Vol. 1. Oxford University Press.</li>\n<li>Kalupahana, D. J., 1991, <em>Mūlamadhyamakakārikā\nof Nāgārjuna: The Philosophy of the Middle Way.\nIntroduction, Sanskrit Text, English Translation and Annotation</em>,\nDelhi: Motilal Banarsidass Publishers Pvt. Limited.</li>\n<li>Karunadasa, Y., 1996, <em>The Dhamma Theory: Philosophical\nCornerstone of the Abhidhamma</em>, Wheel Publication 412/413. Kandy,\nSri Lanka: Buddhist Publication Society.</li>\n<li>–––, 2006, “Theravāda Version of the\nTwo Truths”, Presentation to Korean Conference of Buddhist\nStudies. <!-- commented out by Emma January 2017 URL =  &lt;<a href=\"http://www.skb.or.kr/2006/down/papers/094.pdf\" target=\"other\">http://www.skb.or.kr/2006/down/papers/094.pdf</a>&gt;\n --></li>\n<li>Lindtner, Chr., 1997, <em>Masters of Wisdom: Writings of the\nBuddhist Master Nāgārjuna</em>, Oakland, CA: Dharma\nPress.</li>\n<li>Roerich, George N., 1976, <em>The Blue Annals</em>, Delhi: Motilal\nBanarsidass.</li>\n<li>Ruegg, David Seyfort. 2010, <em>The Buddhist Philosophy of the\nMiddle: Essays on Indian and Tibetan Madhyamaka</em>, Boston: Wisdom\nPublications.</li>\n<li>Siderits, Mark, 2007, <em>Buddhism as Philosophy: an Introduction,\n</em> Ashgate Publishing/Hackett Publishing.</li>\n<li>–––, 2015, Personal Identity and Buddhist\nPhilosophy: Empty Persons, Ashgate World Philosophies Series,\nBurlington, VT: Ashaget Publishing Company.</li>\n<li>Siderits, Mark, and Jan Westerhoff, eds. 2016. <em>Studies in\nBuddhist Philosophy,</em> Oxford, New York: Oxford University\nPress.</li>\n<li>Thakchoe, Sonam, 2007, <em>The Two Truths Debate: Tsongkhapa and\nGorampa on the Middle Way</em>, Boston: Wisdom Publications.</li>\n<li>Thakchoe, Sonam, Malcolm David Eckel, Jay L. Garfield, and\nDignāga. 2016. <em>Dignāga’s Investigation of the\nPercept: A Philosophical Legacy in India and Tibet</em>. New York, NY:\nOxford University Press.</li>\n<li>The Cowherds, 2011, <em>Moonshadows: Conventional Truth in\nBuddhist Philosophy</em>, New York: Oxford University Press.</li>\n<li>–––, 2015, <em>Moonpath: Ethics and\nEmptiness</em>, New York: Oxford University Press.</li>\n<li>The Yakherds,  2021a. <em>Knowing Illusion: Bringing Tibetan\nDebate into Contemporary Discourse: I Philosophical History of the\nDebate</em>. 1st ed. New York: Oxford University Press.</li>\n<li>–––, 2021b, <em>Knowing Illusion:\nBringing Tibetan Debate into Contemporary Discourse: II\nTranslation</em>. 1st ed. New York: Oxford University Press.</li>\n<li>Westerhoff, Jan. 2018, <em>The Golden Age of Indian Buddhist\nPhilosophy</em>. First edition. The Oxford History of Philosophy.\nOxford: Oxford University Press.</li>\n<li>–––, 2015, <em>Nāgārjuna on\nEmptiness</em>. Edited by Jonardon Ganeri. Vol. 1. Oxford University\nPress.</li>\n<li>–––, 2010, <em>The Dispeller of Disputes:\nNāgārjuna’s Vigrahavyāvartanī</em>.\nOxford ; New York: Oxford University Press.</li>\n<li>–––, 2010, <em>Twelve Examples of Illusion</em>.\n1 edition. Oxford ; New York: Oxford University Press.</li>\n<li>–––, 2009, <em>Nāgārjuna’s Madhyamaka:\nA Philosophical Introduction</em>, Oxford: Oxford University\nPress.</li>\n<li>Yonezawa, Yoshiyasu, 2008, “Vigrahavyāvartanī,\nSanskrit Transliteration and Tibetan Translation”, <em>Journal\nof Naritasan Institute for Buddhist Studies</em>, 31:\n209–333.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Indian Philosophy (Classical): perceptual experience and concepts",
            "Madhyamaka",
            "nominalism: in metaphysics",
            "properties",
            "Śāntarakṣita",
            "two truths in Tibet, theory of",
            "Vasubandhu",
            "yogaacaara"
        ],
        "entry_link": [
            {
                "../perception-india/": "Indian Philosophy (Classical): perceptual experience and concepts"
            },
            {
                "../madhyamaka/": "Madhyamaka"
            },
            {
                "../nominalism-metaphysics/": "nominalism: in metaphysics"
            },
            {
                "../properties/": "properties"
            },
            {
                "../saantarak-sita/": "Śāntarakṣita"
            },
            {
                "../twotruths-tibet/": "two truths in Tibet, theory of"
            },
            {
                "../vasubandhu/": "Vasubandhu"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=twotruths-india\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/twotruths-india/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=twotruths-india&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/twotruths-india/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=twotruths-india": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/twotruths-india/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=twotruths-india&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/twotruths-india/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}