{
    "url": "utilitarianism-history",
    "title": "The History of Utilitarianism",
    "authorship": {
        "year": "Copyright © 2014",
        "author_text": "Julia Driver\n<julia.driver@austin.utexas.edu>",
        "author_links": [
            {
                "mailto:julia%2edriver%40austin%2eutexas%2eedu": "julia.driver@austin.utexas.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2014</a> by\n\n<br/>\nJulia Driver\n&lt;<a href=\"mailto:julia%2edriver%40austin%2eutexas%2eedu\"><em>julia<abbr title=\" dot \">.</abbr>driver<abbr title=\" at \">@</abbr>austin<abbr title=\" dot \">.</abbr>utexas<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Mar 27, 2009",
        "substantive revision Mon Sep 22, 2014"
    ],
    "preamble": "\n\n\nUtilitarianism is one of the most powerful and persuasive approaches\nto normative ethics in the history of philosophy. Though not\nfully articulated until the 19th century, proto-utilitarian\npositions can be discerned throughout the history of ethical\ntheory.\n\n\nThough there are many varieties of the view discussed,\nutilitarianism is generally held to be the view that the morally right\naction is the action that produces the most good. There are many\nways to spell out this general claim. One thing to note is that\nthe theory is a form of consequentialism: the right action is\nunderstood entirely in terms of consequences produced. What\ndistinguishes utilitarianism from egoism has to do with the scope of\nthe relevant consequences. On the utilitarian view one ought to\nmaximize the overall good — that is, consider the good of others\nas well as one's own good.\n\n\nThe Classical Utilitarians, Jeremy Bentham and John Stuart Mill,\nidentified the good with pleasure, so, like Epicurus, were hedonists\nabout value. They also held that we ought to maximize the good,\nthat is, bring about ‘the greatest amount of good for the\ngreatest number’.\n\n\nUtilitarianism is also distinguished by impartiality and\nagent-neutrality. Everyone's happiness counts the\nsame. When one maximizes the good, it is the good\nimpartially considered. My good counts for no more than\nanyone else's good. Further, the reason I have to promote\nthe overall good is the same reason anyone else has to so promote the\ngood. It is not peculiar to me.\n\n\nAll of these features of this approach to moral evaluation and/or\nmoral decision-making have proven to be somewhat controversial and\nsubsequent controversies have led to changes in the Classical version\nof the theory.\n",
    "toc": [
        {
            "#PreClaApp": "1. Precursors to the Classical Approach"
        },
        {
            "#ClaApp": "2. The Classical Approach"
        },
        {
            "#JerBen": "2.1 Jeremy Bentham"
        },
        {
            "#JohStuMil": "2.2 John Stuart Mill"
        },
        {
            "#HenSid": "3. Henry Sidgwick"
        },
        {
            "#IdeUti": "4. Ideal Utilitarianism"
        },
        {
            "#Con": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Precursors to the Classical Approach\n\n\nThough the first systematic account of utilitarianism was developed\nby Jeremy Bentham (1748–1832), the core insight motivating the theory\noccurred much earlier. That insight is that morally appropriate\nbehavior will not harm others, but instead increase happiness or\n‘utility.’ What is distinctive about utilitarianism\nis its approach in taking that insight and developing an account of\nmoral evaluation and moral direction that expands on it. Early\nprecursors to the Classical Utilitarians include the British Moralists,\nCumberland, Shaftesbury, Hutcheson, Gay, and Hume. Of these,\nFrancis Hutcheson (1694–1746) is explicitly utilitarian when it comes\nto action choice.\n\n\nSome of the earliest utilitarian thinkers were the\n‘theological’ utilitarians such as Richard Cumberland\n(1631–1718) and John Gay (1699–1745). They believed that\npromoting human happiness was incumbent on us since it was approved by\nGod. After enumerating the ways in which humans come under\nobligations (by perceiving the “natural consequences of\nthings”, the obligation to be virtuous, our civil obligations\nthat arise from laws, and obligations arising from “the authority\nof God”) John Gay writes: “…from the consideration\nof these four sorts of obligation…it is evident that a full and\ncomplete obligation which will extend to all cases, can only be that\narising from the authority of God; because God only can in all\ncases make a man happy or miserable: and therefore, since we are\nalways obliged to that conformity called virtue, it is evident\nthat the immediate rule or criterion of it is the will of God”\n(R, 412). Gay held that since God wants the happiness of mankind,\nand since God's will gives us the criterion of virtue,\n“…the happiness of mankind may be said to be the criterion\nof virtue, but once removed” (R, 413). This view\nwas combined with a view of human motivation with egoistic\nelements. A person's individual salvation, her eternal\nhappiness, depended on conformity to God's will, as did virtue\nitself. Promoting human happiness and one's own coincided,\nbut, given God's design, it was not an accidental\ncoincidence.\n\n\nThis approach to utilitarianism, however, is not theoretically clean\nin the sense that it isn't clear what essential work God does, at\nleast in terms of normative ethics. God as the source of\nnormativity is compatible with utilitarianism, but utilitarianism\ndoesn't require this.\n\n\nGay's influence on later writers, such as Hume, deserves\nnote. It is in Gay's essay that some of the\nquestions that concerned Hume on the nature of virtue are\naddressed. For example, Gay was curious about how to explain our\npractice of approbation and disapprobation of action and\ncharacter. When we see an act that is vicious we disapprove of\nit. Further, we associate certain things with their effects, so\nthat we form positive associations and negative associations that also\nunderwrite our moral judgments. Of course, that we view happiness,\nincluding the happiness of others as a good, is due to God's\ndesign. This is a feature crucial to the theological approach,\nwhich would clearly be rejected by Hume in favor of a naturalistic view\nof human nature and a reliance on our sympathetic engagement with\nothers, an approach anticipated by Shaftesbury (below). The\ntheological approach to utilitarianism would be developed later by\nWilliam Paley, for example, but the lack of any theoretical necessity\nin appealing to God would result in its diminishing appeal.\n\n\nAnthony Ashley Cooper, the 3rd Earl of Shaftesbury\n(1671–1713) is generally thought to have been the one of the earliest\n‘moral sense’ theorists, holding that we possess a kind\nof “inner eye” that allows us to make moral\ndiscriminations. This seems to have been an innate sense of right\nand wrong, or moral beauty and deformity. Again, aspects of this\ndoctrine would be picked up by Francis Hutcheson and David Hume\n(1711–1776). Hume, of course, would clearly reject any robust\nrealist implications. If the moral sense is like the other\nperceptual senses and enables us to pick up on properties out there in\nthe universe around us, properties that exist independent from our\nperception of them, that are objective, then Hume clearly was not a\nmoral sense theorist in this regard. But perception picks up on\nfeatures of our environment that one could regard as having a\ncontingent quality. There is one famous passage where Hume likens moral\ndiscrimination to the perception of secondary qualities, such as\ncolor. In modern terminology, these are response-dependent\nproperties, and lack objectivity in the sense that they do not exist\nindependent of our responses. This is radical. If an\nact is vicious, its viciousness is a matter of the human\nresponse (given a corrected perspective) to the act (or its perceived\neffects) and thus has a kind of contingency that seems unsettling,\ncertainly unsettling to those who opted for the theological option.\n\n\nSo, the view that it is part of our very nature to make moral\ndiscriminations is very much in Hume. Further — and what is\nrelevant to the development of utilitarianism — the view of\nShaftesbury that the virtuous person contributes to the good of the\nwhole — would figure into Hume's writings, though\nmodified. It is the virtue that contributes to the good of the\nwhole system, in the case of Hume's artificial virtues.\n\n\nShaftesbury held that in judging someone virtuous or good in a moral\nsense we need to perceive that person's impact on the systems of\nwhich he or she is a part. Here it sometimes becomes difficult to\ndisentangle egoistic versus utilitarian lines of thought in\nShaftesbury. He clearly states that whatever guiding force there is has\nmade nature such that it is “…the private\ninterest and good of every one, to work towards the\ngeneral good, which if a creature ceases to promote, he is\nactually so far wanting to himself, and ceases to promote his own\nhappiness and welfare…” (R, 188). It is hard, sometimes,\nto discern the direction of the ‘because’ — if one\nshould act to help others because it supports a system in which\none's own happiness is more likely, then it looks really like a\nform of egoism. If one should help others because that's the\nright thing to do — and, fortunately, it also ends up promoting\none's own interests, then that's more like utilitarianism,\nsince the promotion of self-interest is a welcome effect but not what,\nall by itself, justifies one's character or actions.\n\n\nFurther, to be virtuous a person must have certain psychological\ncapacities  —  they must be able to reflect on character, for example,\nand represent to themselves the qualities in others that are either\napproved or disapproved of.\n\n…in this case alone it is we call any creature worthy or\nvirtuous when it can have the notion of a public interest, and can\nattain the speculation or science of what is morally good or ill,\nadmirable or blameable, right or wrong….we never say\nof….any mere beast, idiot, or changeling, though ever so\ngood-natured, that he is worthy or virtuous. (Shaftesbury IVM; BKI,\nPII, sec. iii)\n\n\n\nThus, animals are not objects of moral appraisal on the view, since\nthey lack the necessary reflective capacities. Animals also lack\nthe capacity for moral discrimination and would therefore seem to lack\nthe moral sense. This raises some interesting questions. It\nwould seem that the moral sense is a perception that something\nis the case. So it isn't merely a discriminatory sense that\nallows us to sort perceptions. It also has a propositional\naspect, so that animals, which are not lacking in other senses are\nlacking in this one.\n\n\nThe virtuous person is one whose affections, motives, dispositions\nare of the right sort, not one whose behavior is simply of the right\nsort and who is able to reflect on goodness, and her own goodness [see\nGill]. Similarly, the vicious person is one who exemplifies the\nwrong sorts of mental states, affections, and so forth. A person\nwho harms others through no fault of his own “…because he\nhas convulsive fits which make him strike and wound such as approach\nhim” is not vicious since he has no desire to harm anyone and his\nbodily movements in this case are beyond his control.\n\n\nShaftesbury approached moral evaluation via the virtues and vices.\nHis utilitarian leanings are distinct from his moral sense approach,\nand his overall sentimentalism. However, this approach highlights the\nmove away from egoistic views of human nature — a trend picked\nup by Hutcheson and Hume, and later adopted by Mill in criticism of\nBentham's version of utilitarianism. For writers like Shaftesbury and\nHutcheson the main contrast was with egoism rather than\nrationalism.\n\n\nLike Shaftesbury, Francis Hutcheson was very much interested in\nvirtue evaluation. He also adopted the moral sense\napproach. However, in his writings we also see an emphasis\non action choice and the importance of moral deliberation to action\nchoice. Hutcheson, in An Inquiry Concerning Moral Good and\nEvil, fairly explicitly spelled out a utilitarian principle of\naction choice. (Joachim Hruschka (1991) notes, however, that it was\nLeibniz who first spelled out a utilitarian decision procedure.)\n\n\n….In comparing the moral qualities of actions…we are led\nby our moral sense of virtue to judge thus; that in equal\ndegrees of happiness, expected to proceed from the action, the\nvirtue is in proportion to the number of persons to whom the\nhappiness shall extend (and here the dignity, or moral\nimportance of persons, may compensate numbers); and, in\nequal numbers, the virtue is the quantity of the\nhappiness, or natural good; or that the virtue is in a compound ratio of the\nquantity of good, and number of enjoyers….so\nthat that action is best, which procures\nthe greatest happiness for the greatest numbers; and\nthat worst, which, in like manner, occasions\nmisery. (R, 283–4)\n\n\n\nScarre notes that some hold the moral sense approach incompatible\nwith this emphasis on the use of reason to determine what we ought to\ndo; there is an opposition between just apprehending what's\nmorally significant and a model in which we need to reason to figure\nout what morality demands of us. But Scarre notes these are not\nactually incompatible:\n\nThe picture which emerges from Hutcheson's discussion is of a\ndivision of labor, in which the moral sense causes us to look with\nfavor on actions which benefit others and disfavor those which harm\nthem, while consequentialist reasoning determines a more precise\nranking order of practical options in given situations. (Scarre,\n53–54)\n\n\nScarre then uses the example of telling a lie to illustrate: lying\nis harmful to the person to whom one lies, and so this is viewed with\ndisfavor, in general. However, in a specific case, if a lie is\nnecessary to achieve some notable good, consequentialist reasoning will\nlead us to favor the lying. But this example seems to\nput all the emphasis on a consideration of consequences in\nmoral approval and disapproval. Stephen Darwall notes (1995,\n216 ff.) that the moral sense is concerned\nwith motives — we approve, for example, of the motive of\nbenevolence, and the wider the scope the better. It is the motives\nrather than the consequences that are the objects of approval and\ndisapproval.  But inasmuch as the morally good person cares about what\nhappens to others, and of course she will, she will rank order acts in\nterms of their effects on others, and reason is used in calculating\neffects. So there is no incompatibility at all.\n\n\nHutcheson was committed to maximization, it seems. However, he\ninsisted on a caveat — that “the dignity or moral\nimportance of persons may compensate numbers.” He added\na deontological constraint — that we have a duty to others in\nvirtue of their personhood to accord them fundamental dignity\nregardless of the numbers of others whose happiness is to be affected\nby the action in question.\n\n\nHume was heavily influenced by Hutcheson, who was one of his\nteachers. His system also incorporates insights made by\nShaftesbury, though he certainly lacks Shaftesbury's confidence\nthat virtue is its own reward. In terms of his place in the\nhistory of utilitarianism we should note two distinct effects his\nsystem had. Firstly, his account of the social utility of the\nartificial virtues influenced Bentham's thought on utility.\nSecondly, his account of the role sentiment played in moral judgment\nand commitment to moral norms influenced Mill's thoughts about\nthe internal sanctions of morality. Mill would diverge from\nBentham in developing the ‘altruistic’ approach to\nUtilitarianism (which is actually a misnomer, but more on that\nlater). Bentham, in contrast to Mill, represented the egoistic\nbranch — his theory of human nature reflected Hobbesian\npsychological egoism.\n2. The Classical Approach\n\n\nThe Classical Utilitarians, Bentham and Mill, were concerned with\nlegal and social reform. If anything could be identified as the\nfundamental motivation behind the development of Classical\nUtilitarianism it would be the desire to see useless, corrupt laws and\nsocial practices changed. Accomplishing this goal required a\nnormative ethical theory employed as a critical tool. What is the\ntruth about what makes an action or a policy a morally good one, or\nmorally right? But developing the theory itself was also\ninfluenced by strong views about what was wrong in their society.\nThe conviction that, for example, some laws are bad resulted in\nanalysis of why they were bad. And, for Jeremy Bentham, what made\nthem bad was their lack of utility, their tendency to lead to\nunhappiness and misery without any compensating happiness. If a\nlaw or an action doesn't do any good, then it\nisn't any good.\n2.1 Jeremy Bentham\n\n\nJeremy Bentham (1748–1832) was influenced both by Hobbes'\naccount of human nature and Hume's account of social\nutility. He famously held that humans were ruled by two sovereign\nmasters — pleasure and pain. We seek pleasure and the avoidance\nof pain, they “…govern us in all we do, in all we say, in\nall we think…” (Bentham PML, 1). Yet he also promulgated the\nprinciple of utility as the standard of right action on the part of\ngovernments and individuals. Actions are approved when they\nare such as to promote happiness, or pleasure, and disapproved of when\nthey have a tendency to cause unhappiness, or pain (PML). Combine\nthis criterion of rightness with a view that we should be actively\ntrying to promote overall happiness, and one has a serious\nincompatibility with psychological egoism. Thus, his apparent\nendorsement of Hobbesian psychological egoism created problems in\nunderstanding his moral theory since psychological egoism rules out\nacting to promote the overall well-being when that it is incompatible\nwith one's own. For the psychological egoist, that is not\neven a possibility. So, given ‘ought implies can’ it\nwould follow that we are not obligated to act to promote overall\nwell-being when that is incompatible with our own. This generates\na serious tension in Bentham's thought, one that was drawn to his\nattention. He sometimes seemed to think that he could reconcile\nthe two commitments empirically, that is, by noting that when people\nact to promote the good they are helping themselves, too. But\nthis claim only serves to muddy the waters, since the standard\nunderstanding of psychological egoism  —  and Bentham's own\nstatement of his view  —  identifies motives of action which are\nself-interested. Yet this seems, again, in conflict with his own\nspecification of the method for making moral decisions which is not to\nfocus on self-interest  —  indeed, the addition of extent as a\nparameter along which to measure pleasure produced distinguishes this\napproach from ethical egoism. Aware of the difficulty, in later\nyears he seemed to pull back from a full-fledged commitment to\npsychological egoism, admitting that people do sometimes act\nbenevolently — with the overall good of humanity in mind.\n\n\nBentham also benefited from Hume's work, though in many ways\ntheir approaches to moral philosophy were completely different.  Hume\nrejected the egoistic view of human nature. Hume also focused on\ncharacter evaluation in his system. Actions are significant as\nevidence of character, but only have this derivative significance. In\nmoral evaluation the main concern is that of character. Yet Bentham\nfocused on act-evaluation. There was a tendency — remarked on by\nJ. B. Schneewind (1990), for example — to move away from focus on\ncharacter evaluation after Hume and towards act-evaluation. Recall\nthat Bentham was enormously interested in social reform. Indeed,\nreflection on what was morally problematic about laws and policies\ninfluenced his thinking on utility as a standard. When one legislates,\nhowever, one is legislating in support of, or against, certain\nactions. Character — that is, a person's true\ncharacter — is known, if known at all, only by that person. If one\nfinds the opacity of the will thesis plausible then character, while\ntheoretically very interesting, isn't a practical focus for\nlegislation.  Further, as Schneewind notes, there was an increasing\nsense that focus on character would actually be disruptive, socially,\nparticularly if one's view was that a person who didn't\nagree with one on a moral issues was defective in terms of his or her\ncharacter, as opposed to simply making a mistake reflected in\naction.\n\n\nBut Bentham does take from Hume the view that utility is the measure\nof virtue — that is, utility more broadly construed than\nHume's actual usage of the term. This is because Hume made\na distinction between pleasure that the perception of virtue generates\nin the observer, and social utility, which consisted in a trait's\nhaving tangible benefits for society, any instance of which may or may\nnot generate pleasure in the observer. But Bentham is not simply\nreformulating a Humean position — he's merely been\ninfluenced by Hume's arguments to see pleasure as a measure or\nstandard of moral value. So, why not move from pleasurable\nresponses to traits to pleasure as a kind of\nconsequence which is good, and in relation to which, actions\nare morally right or wrong? Bentham, in making this move, avoids a\nproblem for Hume. On Hume's view it seems that the\nresponse — corrected, to be sure —  determines the trait's\nquality as a virtue or vice. But on Bentham's view the action\n(or trait) is morally good, right, virtuous in view of the\nconsequences it generates, the pleasure or utility it produces, which\ncould be completely independent of what our responses are to the\ntrait. So, unless Hume endorses a kind of ideal observer test for\nvirtue, it will be harder for him to account for how it is people make\nmistakes in evaluations of virtue and vice. Bentham, on the other\nhand, can say that people may not respond to the actions good\nqualities — perhaps they don't perceive the good\neffects. But as long as there are these good effects which are, on\nbalance, better than the effects of any alternative course of action,\nthen the action is the right one. Rhetorically, anyway, one can see\nwhy this is an important move for Bentham to be able to make. He was a\nsocial reformer. He felt that people often had responses to certain\nactions — of pleasure or disgust  —  that did not reflect anything\nmorally significant at all. Indeed, in his discussions of\nhomosexuality, for example, he explicitly notes that\n‘antipathy’ is not sufficient reason to legislate against\na practice:\n\n\nThe circumstances from which this antipathy may have taken its rise\nmay be worth enquiring to…. One is the physical antipathy to\nthe offence…. The act is to the highest degree odious and\ndisgusting, that is, not to the man who does it, for he does it only\nbecause it gives him pleasure, but to one who thinks [?]  of it. Be it\nso, but what is that to him? (Bentham OAO, v. 4, 94)\n\n\nBentham then notes that people are prone to use their physical\nantipathy as a pretext to transition to moral antipathy, and the\nattending desire to punish the persons who offend their taste.\nThis is illegitimate on his view for a variety of reasons, one of which\nis that to punish a person for violations of taste, or on the basis of\nprejudice, would result in runaway punishments, “…one\nshould never know where to stop…” The prejudice in\nquestion can be dealt with by showing it “to be\nill-grounded”. This reduces the antipathy to the act in\nquestion. This demonstrates an optimism in Bentham. If a\npain can be demonstrated to be based on false beliefs then he believes\nthat it can be altered or at the very least ‘assuaged and\nreduced’. This is distinct from the view that a pain or\npleasure based on a false belief should be discounted. Bentham\ndoes not believe the latter. Thus Bentham's hedonism is a\nvery straightforward hedonism. The one intrinsic good is\npleasure, the bad is pain. We are to promote pleasure and act to\nreduce pain. When called upon to make a moral decision one\nmeasures an action's value with respect to pleasure and pain\naccording to the following: intensity (how strong the pleasure or pain\nis), duration (how long it lasts), certainty (how likely the pleasure\nor pain is to be the result of the action), proximity (how close the\nsensation will be to performance of the action), fecundity (how likely\nit is to lead to further pleasures or pains), purity (how much\nintermixture there is with the other sensation). One also\nconsiders extent — the number of people affected by the\naction.\n\n\nKeeping track of all of these parameters can be complicated and time\nconsuming. Bentham does not recommend that they figure into every\nact of moral deliberation because of the efficiency costs which need to\nbe considered. Experience can guide us. We know that the\npleasure of kicking someone is generally outweighed by the pain\ninflicted on that person, so such calculations when confronted with a\ntemptation to kick someone are unnecessary. It is reasonable to\njudge it wrong on the basis of past experience or consensus. One\ncan use ‘rules of thumb’ to guide action, but these rules\nare overridable when abiding by them would conflict with the promotion\nof the good.\n\n\nBentham's view was surprising to many at the time at least in part\nbecause he viewed the moral quality of an action to be determined\ninstrumentally. It isn't so much that there is a particular kind of\naction that is intrinsically wrong; actions that are wrong are wrong\nsimply in virtue of their effects, thus, instrumentally wrong. This\ncut against the view that there are some actions that by their very\nnature are just wrong, regardless of their effects.  Some may be wrong\nbecause they are ‘unnatural’ — and, again, Bentham\nwould dismiss this as a legitimate criterion. Some may be wrong\nbecause they violate liberty, or autonomy. Again, Bentham would view\nliberty and autonomy as good — but good instrumentally, not\nintrinsically. Thus, any action deemed wrong due to a violation of\nautonomy is derivatively wrong on instrumental grounds as well. This\nis interesting in moral philosophy — as it is far removed from\nthe Kantian approach to moral evaluation as well as from natural law\napproaches. It is also interesting in terms of political philosophy\nand social policy. On Bentham's view the law is not monolithic and\nimmutable.  Since effects of a given policy may change, the moral\nquality of the policy may change as well. Nancy Rosenblum noted that\nfor Bentham one doesn't simply decide on good laws and leave it at\nthat: “Lawmaking must be recognized as a continual process in\nresponse to diverse and changing desires that require\nadjustment” (Rosenblum 1978, 9). A law that is good at one point\nin time may be a bad law at some other point in time. Thus, lawmakers\nhave to be sensitive to changing social circumstances.  To be fair to\nBentham's critics, of course, they are free to agree with him that\nthis is the case in many situations, just not all — and that\nthere is still a subset of laws that reflect the fact that some\nactions just are intrinsically wrong regardless of\nconsequences. Bentham is in the much more difficult position of\narguing that effects are all there are to moral evaluation of action\nand policy.\n2.2 John Stuart Mill\n\n\nJohn Stuart Mill (1806–1873) was a follower of Bentham, and, through\nmost of his life, greatly admired Bentham's work even though he\ndisagreed with some of Bentham's claims — particularly on\nthe nature of ‘happiness.’ Bentham, recall, had\nheld that there were no qualitative differences between pleasures, only\nquantitative ones. This left him open to a variety of\ncriticisms. First, Bentham's Hedonism was too\negalitarian. Simple-minded pleasures, sensual pleasures, were\njust as good, at least intrinsically, than more sophisticated and\ncomplex pleasures. The pleasure of drinking a beer in front of\nthe T.V. surely doesn't rate as highly as the pleasure one gets\nsolving a complicated math problem, or reading a poem, or listening to\nMozart. Second, Bentham's view that there were no\nqualitative differences in pleasures also left him open to the\ncomplaint that on his view human pleasures were of no more value than\nanimal pleasures and, third, committed him to the corollary that the\nmoral status of animals, tied to their sentience, was the same as that\nof humans. While harming a puppy and harming a person are both\nbad, however, most people had the view that harming the person was\nworse. Mill sought changes to the theory that could accommodate\nthose sorts of intuitions.\n\n\nTo this end, Mill's hedonism was influenced by perfectionist\nintuitions. There are some pleasures that are more fitting than\nothers. Intellectual pleasures are of a higher, better, sort than\nthe ones that are merely sensual, and that we share with animals.\nTo some this seems to mean that Mill really wasn't a hedonistic\nutilitarian. His view of the good did radically depart from\nBentham's view. However, like Bentham, the good still\nconsists in pleasure, it is still a psychological state. There is\ncertainly that similarity. Further, the basic structures of the\ntheories are the same (for more on this see Donner 1991). While it is\ntrue that Mill is more comfortable with notions like\n‘rights’ this does not mean that he, in actuality, rejected\nutilitarianism. The rationale for all the rights he recognizes is\nutilitarian.\n\n\nMill's ‘proof’ of the claim that intellectual\npleasures are better in kind than others, though, is highly\nsuspect. He doesn't attempt a mere appeal to raw\nintuition. Instead, he argues that those persons who have experienced\nboth view the higher as better than the lower. Who would rather be a\nhappy oyster, living an enormously long life, than a person living a\nnormal life? Or, to use his most famous example — it is better to\nbe Socrates ‘dissatisfied’ than a fool\n‘satisfied.’ In this way Mill was able to solve a problem\nfor utilitarianism.\n\n\nMill also argued that the principle could be proven, using another\nrather notorious argument:\n\nThe only proof capable of being given that an object is visible is\nthat people actually see it…. In like manner, I apprehend, the\nsole evidence it is possible to produce that anything is desirable is\nthat people do actually desire it. If the end which the utilitarian\ndoctrine proposes to itself were not, in theory and in practiced,\nacknowledged to be an end, nothing could ever convince any person that\nit was so. (Mill, U, 81)\n\n\nMill then continues to argue that people desire happiness — the\nutilitarian end — and that the general happiness is “a good\nto the aggregate of all persons.” (81)\n\n\nG. E. Moore (1873–1958) criticized this as fallacious. He\nargued that it rested on an obvious ambiguity:\n\n\nMill has made as naïve and artless a use of the naturalistic\nfallacy as anybody could desire. “Good”, he tells us,\nmeans “desirable”, and you can only find out what is\ndesirable by seeking to find out what is actually desired….\nThe fact is that “desirable” does not mean “able to\nbe desired” as “visible” means “able to be\nseen.” The desirable means simply what ought to be\ndesired or deserves to be desired; just as the detestable means not\nwhat can be but what ought to be detested… (Moore, PE, 66–7)\n\n\n\nIt should be noted, however, that Mill was offering this as an\nalternative to Bentham's view which had been itself criticized as\na ‘swine morality,’ locating the good in pleasure in a kind\nof indiscriminate way. The distinctions he makes strike many as\nintuitively plausible ones. Bentham, however, can accommodate\nmany of the same intuitions within his system. This is because he\nnotes that there are a variety of parameters along which we\nquantitatively measure pleasure  —  intensity and duration are just two\nof those. His complete list is the following: intensity,\nduration, certainty or uncertainty, propinquity or remoteness,\nfecundity, purity, and extent. Thus, what Mill\ncalls the intellectual pleasures will score more highly than the\nsensual ones along several parameters, and this could give us reason to\nprefer those pleasures  —  but it is a quantitative not a qualitative\nreason, on Bentham's view. When a student decides to\nstudy for an exam rather than go to a party, for example, she is making\nthe best decision even though she is sacrificing short term\npleasure. That's because studying for the exam, Bentham\ncould argue, scores higher in terms of the long term pleasures doing\nwell in school lead to, as well as the fecundity of the pleasure in\nleading to yet other pleasures. However, Bentham will have to\nconcede that the very happy oyster that lives a very long time could,\nin principle, have a better life than a normal human.\n\n\nMill's version of utilitarianism differed from Bentham's\nalso in that he placed weight on the effectiveness of internal\nsanctions — emotions like guilt and remorse which serve to\nregulate our actions. This is an off-shoot of the different view\nof human nature adopted by Mill. We are the sorts of beings that\nhave social feelings, feelings for others, not just ourselves. We\ncare about them, and when we perceive harms to them this causes painful\nexperiences in us. When one perceives oneself to be the agent of\nthat harm, the negative emotions are centered on the self. One\nfeels guilt for what one has done, not for what one sees another\ndoing. Like external forms of punishment, internal sanctions are\ninstrumentally very important to appropriate action. Mill also\nheld that natural features of human psychology, such as conscience and\na sense of justice, underwrite motivation. The sense of justice,\nfor example, results from very natural impulses. Part of this\nsense involves a desire to punish those who have harmed others, and\nthis desire in turn “…is a spontaneous outgrowth from two\nsentiments, both in the highest degree natural…; the impulse of\nself-defense, and the feeling of sympathy.” (Chapter 5,\nUtilitarianism) Of course, he goes on, the justification\nmust be a separate issue. The feeling is there naturally, but it\nis our ‘enlarged’ sense, our capacity to include the\nwelfare of others into our considerations, and make intelligent\ndecisions, that gives it the right normative force.\n\n\nLike Bentham, Mill sought to use utilitarianism to inform law and\nsocial policy. The aim of increasing happiness underlies his\narguments for women's suffrage and free speech. We can be\nsaid to have certain rights, then — but those rights are\nunderwritten by utility. If one can show that a purported right\nor duty is harmful, then one has shown that it is not genuine.\nOne of Mills most famous arguments to this effect can be found in his\nwriting on women's suffrage when he discusses the ideal marriage\nof partners, noting that the ideal exists between individuals of\n“cultivated faculties” who influence each other\nequally. Improving the social status of women was important\nbecause they were capable of these cultivated faculties, and denying\nthem access to education and other opportunities for development is\nforgoing a significant source of happiness. Further, the men who\nwould deny women the opportunity for education, self-improvement, and\npolitical expression do so out of base motives, and the resulting\npleasures are not ones that are of the best sort.\n\n\nBentham and Mill both attacked social traditions that were justified\nby appeals to natural order. The correct appeal is to utility\nitself. Traditions often turned out to be “relics”\nof “barbarous” times, and appeals to nature as a form\nof justification were just ways to try rationalize continued deference\nto those\nrelics.\nIn the latter part of the 20th century some writers criticized\nutilitarianism for its failure to accommodate virtue evaluation.\nHowever, though virtue is not the central normative concept in Mill's\ntheory, it is an extremely important one.  In Chapter 4 of\nUtilitarianism Mill noted \n… does the utilitarian doctrine deny that people\ndesire virtue, or maintain that virtue is not a thing to be desired?\nThe very reverse.  It maintains not only that virtue is to be desired,\nbut also that it is to be desired disinterestedly, for\nitself. Whatever may be the opinion of utilitarian moralists as to the\noriginal conditions by which virtue is made virtue … they not only\nplace virtue at the very head of things which are good as a means to\nthe ultimate end, but they also recognize as a psychological fact the\npossibility of its being, to the individual, a good in itself, without\nlooking to any end beyond it; and hold, that the mind is not in a\nright state, not in a state conformable to Utility, not in the state\nmost conducive to the general happiness, unless it does love virtue in\nthis manner …\nIn Utilitarianism Mill argues that virtue not only has\ninstrumental value, but is constitutive of the good life.  A person\nwithout virtue is morally lacking, is not as able to promote the good.\nHowever, this view of virtue is someone complicated by rather cryptic\nremarks Mill makes about virtue in his A System of Logic in\nthe section in which he discusses the “Art of Life.”  There he seems\nto associate virtue with aesthetics, and morality is reserved for the\nsphere of ‘right’ or ‘duty‘.  Wendy Donner\nnotes that separating virtue from right allows Mill to solve another\nproblem for the theory: the demandingness problem (Donner 2011).  This\nis the problem that holds that if we ought to maximize utility, if\nthat is the right thing to do, then doing right requires enormous\nsacrifices (under actual conditions), and that requiring such\nsacrifices is too demanding. With duties, on Mill's view, it is\nimportant that we get compliance, and that justifies coercion.  In the\ncase of virtue, however, virtuous actions are those which it is\n“…for the general interest that they remain free.”\n3. Henry Sidgwick\n\n\nHenry Sidgwick's (1838–1900) The Methods of Ethics (1874) is\none of the most well known works in utilitarian moral philosophy, and\ndeservedly so. It offers a defense of utilitarianism, though some\nwriters (Schneewind 1977) have argued that it should not primarily be\nread as a defense of utilitarianism. In The Methods Sidgwick\nis concerned with developing an account of “…the\ndifferent methods of Ethics that I find implicit in our common moral\nreasoning…” These methods are egoism, intuition based\nmorality, and utilitarianism. On Sidgwick's view, utilitarianism is\nthe more basic theory. A simple reliance on intuition, for example,\ncannot resolve fundamental conflicts between values, or rules, such as\nTruth and Justice that may conflict. In Sidgwick's words\n“…we require some higher principle to decide the\nissue…” That will be utilitarianism.  Further, the rules\nwhich seem to be a fundamental part of common sense morality are often\nvague and underdescribed, and applying them will actually require\nappeal to something theoretically more basic — again,\nutilitarianism. Yet further, absolute interpretations of rules seem\nhighly counter-intuitive, and yet we need some justification for any\nexceptions — provided, again, by utilitarianism.  Sidgwick\nprovides a compelling case for the theoretical primacy of\nutilitarianism.\n\n\nSidgwick was also a British philosopher, and his views developed out\nof and in response to those of Bentham and Mill. His\nMethods offer an engagement with the theory as it had been\npresented before him, and was an exploration of it and the main\nalternatives as well as a defense.\n\n\nSidgwick was also concerned with clarifying fundamental features of\nthe theory, and in this respect his account has been enormously\ninfluential to later writers, not only to utilitarians and\nconsequentialists, generally, but to intuitionists as well.\nSidgwick's thorough and penetrating discussion of the theory\nraised many of the concerns that have been developed by recent moral\nphilosophers.\n\n\nOne extremely controversial feature of Sidgwick's views\nrelates to his rejection of a publicity requirement for moral\ntheory. He writes:\n\n\nThus, the Utilitarian conclusion, carefully stated, would seem to be\nthis; that the opinion that secrecy may render an action right which\nwould not otherwise be so should itself be kept comparatively secret;\nand similarly it seems expedient that the doctrine that esoteric\nmorality is expedient should itself be kept esoteric. Or, if this\nconcealment be difficult to maintain, it may be desirable that Common\nSense should repudiate the doctrines which it is expedient to confine\nto an enlightened few. And thus a Utilitarian may reasonably desire,\non Utilitarian principles, that some of his conclusions should be\nrejected by mankind generally; or even that the vulgar should keep\naloof from his system as a whole, in so far as the inevitable\nindefiniteness and complexity of its calculations render it likely to\nlead to bad results in their hands. (490)\n\n\nThis accepts that utilitarianism may be self-effacing; that is, that\nit may be best if people do not believe it, even though it is\ntrue. Further, it rendered the theory subject to Bernard\nWilliams' (1995) criticism that the theory really simply\nreflected the colonial elitism of Sidgwick's time, that it was\n‘Government House Utilitarianism.’ The elitism in his\nremarks may reflect a broader attitude, one in which the educated are\nconsidered better policy makers than the uneducated.\n\n\nOne issue raised in the above remarks is relevant to practical\ndeliberation in general. To what extent should proponents of a\ngiven theory, or a given rule, or a given policy — or even\nproponents of a given one-off action — consider what they think\npeople will actually do, as opposed to what they think those\nsame people ought to do (under full and reasonable reflection,\nfor example)? This is an example of something that comes up in\nthe Actualism/possibilism debate in accounts of practical\ndeliberation. Extrapolating from the example used above, we have\npeople who advocate telling the truth, or what they believe to be the\ntruth, even if the effects are bad because the truth is somehow misused\nby others. On the other hand are those who recommend not telling\nthe truth when it is predicted that the truth will be misused by others\nto achieve bad results. Of course it is the case that the truth\nought not be misused, that its misuse can be avoided and is not\ninevitable, but the misuse is entirely predictable. Sidgwick\nseems to recommending that we follow the course that we predict will\nhave the best outcome, given as part of our calculations the data that\nothers may fail in some way — either due to having bad desires,\nor simply not being able to reason effectively. The worry\nWilliams points to really isn't a worry specifically with\nutilitarianism (Driver 2011). Sidgwick would point out\nthat if it is bad to hide the truth, because ‘Government\nHouse’ types, for example, typically engage in self-deceptive\nrationalizations of their policies (which seems entirely plausible),\nthen one shouldn't do it. And of course, that heavily\ninfluences our intuitions.\n\n\nSidgwick raised issues that run much deeper to our basic\nunderstanding of utilitarianism. For example, the way earlier\nutilitarians characterized the principle of utility left open serious\nindeterminacies. The major one rests on the distinction between\ntotal and average utility. He raised the issue in the context of\npopulation growth and increasing utility levels by increasing numbers\nof people (or sentient beings):\n\n\nAssuming, then, that the average happiness of human beings is a\npositive quantity, it seems clear that, supposing the average\nhappiness enjoyed remains undiminished, Utilitarianism directs us to\nmake the number enjoying it as great as possible. But if we foresee as\npossible that an increase in numbers will be accompanied by a decrease\nin average happiness or vice versa, a point arises which has\nnot only never been formally noticed, but which seems to have been\nsubstantially overlooked by many Utilitarians. For if we take\nUtilitarianism to prescribe, as the ultimate end of action, happiness\non the whole, and not any individual's happiness, unless\nconsidered as an element of the whole, it would follow that, if the\nadditional population enjoy on the whole positive happiness, we ought\nto weigh the amount of happiness gained by the extra number against\nthe amount lost by the remainder. (415)\n\n\nFor Sidgwick, the conclusion on this issue is not to simply strive\nto greater average utility, but to increase population to the point\nwhere we maximize the product of the number of persons who are\ncurrently alive and the amount of average happiness. So it seems\nto be a hybrid, total-average view. This discussion also raised\nthe issue of policy with respect to population growth, and both would\nbe pursued in more detail by later writers, most notably Derek Parfit\n(1986).\n4. Ideal Utilitarianism\n\n\nG. E. Moore strongly disagreed with the hedonistic value theory\nadopted by the Classical Utilitarians. Moore agreed that we ought\nto promote the good, but believed that the good included far more than\nwhat could be reduced to pleasure. He was a pluralist, rather\nthan a monist, regarding intrinsic value. For example, he\nbelieved that ‘beauty’ was an intrinsic good. A\nbeautiful object had value independent of any pleasure it might\ngenerate in a viewer. Thus, Moore differed from Sidgwick who\nregarded the good as consisting in some consciousness. Some objective\nstates in the world are intrinsically good, and on Moore's view,\nbeauty is just such a state. He used one of his more notorious\nthought experiments to make this point: he asked the reader to\ncompare two worlds, one was entirely beautiful, full of things which\ncomplemented each other; the other was a hideous, ugly world, filled\nwith “everything that is most disgusting to us.” Further,\nthere are not human beings, one imagines, around to appreciate or be\ndisgusted by the worlds. The question then is, which of these worlds is\nbetter, which one's existence would be better than the\nother's? Of course, Moore believed it was clear that the\nbeautiful world was better, even though no one was around to appreciate\nits beauty. This emphasis on beauty was one facet of\nMoore's work that made him a darling of the Bloomsbury\nGroup. If beauty was a part of the good independent of its\neffects on the psychological states of others — independent of,\nreally, how it affected others, then one needn't sacrifice\nmorality on the altar of beauty anymore. Following beauty is not\na mere indulgence, but may even be a moral obligation. Though\nMoore himself certainly never applied his view to such cases, it does\nprovide the resources for dealing with what the contemporary literature\nhas dubbed ‘admirable immorality’ cases, at least some of\nthem. Gauguin may have abandoned his wife and children, but it\nwas to a beautiful end.\n\n\nMoore's targets in arguing against hedonism were the earlier\nutilitarians who argued that the good was some state of consciousness\nsuch as pleasure. He actually waffled on this issue a bit, but\nalways disagreed with Hedonism in that even when he held that beauty\nall by itself was not an intrinsic good, he also held that for the\nappreciation of beauty to be a good the beauty must actually be there,\nin the world, and not be the result of illusion.\n\n\nMoore further criticized the view that pleasure itself was\nan intrinsic good, since it failed a kind of isolation test that he\nproposed for intrinsic value. If one compared an empty universe\nwith a universe of sadists, the empty universe would strike one as\nbetter. This is true even though there is a good deal of\npleasure, and no pain, in the universe of sadists. This would\nseem to indicate that what is necessary for the good is at least the\nabsence of bad intentionality. The pleasures of sadists, in\nvirtue of their desires to harm others, get discounted — they are\nnot good, even though they are pleasures. Note this radical\ndeparture from Bentham who held that even malicious pleasure was\nintrinsically good, and that if nothing instrumentally bad attached to the\npleasure, it was wholly good as well.\n\n\nOne of Moore's important contributions was to put forward an\n‘organic unity’ or ‘organic whole’ view of\nvalue. The principle of organic unity is vague, and there is some\ndisagreement about what Moore actually meant in presenting it.\nMoore states that ‘organic’ is used “…to\ndenote the fact that a whole has an intrinsic value different in amount\nfrom the sum of the values of its parts.” (PE, 36) And, for\nMoore, that is all it is supposed to denote. So, for example, one\ncannot determine the value of a body by adding up the value of its\nparts. Some parts of the body may have value only in relation to\nthe whole. An arm or a leg, for example, may have no value at all\nseparated from the body, but have a great deal of value attached to the\nbody, and increase the value of the body, even. In the section of\nPrincipia Ethica on the Ideal, the principle of organic unity\ncomes into play in noting that when persons experience pleasure through\nperception of something beautiful (which involves a positive emotion in\nthe face of a recognition of an appropriate object — an emotive\nand cognitive set of elements), the experience of the beauty is better\nwhen the object of the experience, the beautiful object, actually\nexists. The idea was that experiencing beauty has a small positive\nvalue, and existence of beauty has a small positive value, but\ncombining them has a great deal of value, more than the simple addition\nof the two small values (PE, 189 ff.). Moore noted:\n“A true belief in the reality of an object greatly increases the\nvalue of many valuable wholes…” (199).\n\n\nThis principle in Moore — particularly as applied to the\nsignificance of actual existence and value, or knowledge and value,\nprovided utilitarians with tools to meet some significant\nchallenges. For example, deluded happiness would be severely\nlacking on Moore's view, especially in comparison to happiness\nbased on knowledge.\n5. Conclusion\n\n\nSince the early 20th Century utilitarianism has undergone a variety\nof refinements. After the middle of the 20th Century it has\nbecome more common to identify as a ‘Consequentialist’\nsince very few philosophers agree entirely with the view proposed by\nthe Classical Utilitarians, particularly with respect to the hedonistic\nvalue theory. But the influence of the Classical Utilitarians has\nbeen profound — not only within moral philosophy, but within\npolitical philosophy and social policy. The question Bentham\nasked, “What use is it?,” is a cornerstone of policy\nformation. It is a completely secular, forward-looking\nquestion. The articulation and systematic development of this\napproach to policy formation is owed to the Classical Utilitarians.\n",
    "bibliography": {
        "categories": [
            "Primary Literature",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Bentham, Jeremy, 1789 [PML]. <em>An Introduction to the Principles of\nMorals and Legislation.</em>, Oxford: Clarendon Press, 1907.",
                "–––, 1785 [OAO]. “Offences Against\nOneself.” Louis Compton (ed.), <em>The Journal of\nHomosexuality</em>, 3(4) (1978): 389–406, 4(1): 91–107..",
                "Cooper, Anthony Ashley (3<sup>rd</sup> Earl of\nShaftesbury), 1711 [IVM]. <em>Inquiry Concerning Virtue or\nMerit</em>, in <em>Characteristics of Men, Manners, Opinions and\nTimes</em>, excerpts reprinted in Raphael 1969.",
                "Cumberland, Richard, 1672. <em>De Legibus Naturae Disquisitio\nPhilosophica</em>, London. English translation by John Maxwell, <em>A\nTreatise of the Laws of Nature</em>, 1727, reprinted New York,\nGarland, 1978.",
                "Gay, John, 1731. <em>A Dissertation Concerning the Fundamental\nPrinciple and Immediate Criterion of Virtue</em> in Frances\nKing's <em>An Essay on the Origin of Evil</em>, London.",
                "Hume, David, 1738. <em>A Treatise of Human Nature</em>, edited by\nL. A. Selby-Bigge, Oxford: Oxford University Press, 1978.",
                "Hutcheson, Francis, 1725. <em>An Inquiry into the Original of\nour Ideas of Beauty and Virtue</em>, London; excerpts reprinted in\nRaphael 1969.",
                "Mill, John Stuart, 1843. <em>A System of Logic</em>, London: John\nW. Parker.",
                "–––, 1859. <em>On Liberty</em>, London: Longman,\nRoberts &amp; Green.",
                "–––, 1861 [U]. <em>Utilitarianism</em>, Roger\nCrisp (ed.), Oxford: Oxford University Press, 1998.",
                "Moore, G. E., 1903 [PE]. <em>Principia Ethica</em>, Amherst, New\nYork: Prometheus Books, 1988.",
                "Price, Richard, 1758 [PE]. <em>A Review of the Principle Questions\nin Morals</em>, London: T. Cadell in the Strand, 1787.",
                "Raphael, D. D., 1969 [R]. <em>British Moralists</em>, in two\nvolumes, London: Oxford, Clarendon Press.\n</ul>\n<h3>"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Crisp, Roger, 1997. <em>Mill on Utilitarianism.</em>, London:\nRoutledge.",
                "Darwall, Stephen, 1995. <em>Hume and the Invention of\nUtilitarianism</em>, University Park, PA: Penn State University\nPress.",
                "Donner, Wendy, 1991. <em>The Liberal Self: John Stuart Mill's\nMoral and Political Philosophy</em>, Ithaca, NY: Cornell University\nPress.",
                "–––, 2011. “Morality, Virtue, and\nAesthetics in Mill's Art of Life,” in Ben Eggleston, Dale\nE. Miller, and David Weinstein (eds.) <em>John Stuart Mill and the Art\nof Life</em>, Oxford: Oxford University Press.",
                "Driver, Julia, 2004. “Pleasure as the Standard of Virtue\nin Hume's Moral Philosophy.” <em>Pacific Philosophical\nQuarterly.</em>, 85: 173–194.",
                "–––, 2011. <em>Consequentialism</em>,\nLondon: Routledge.",
                "Gill, Michael, 2006. <em>The British Moralists on Human Nature\nand the Birth of Secular Ethics</em>, New York: Cambridge University\nPress.",
                "Hruschka, Joachim, 1991. “The Greatest Happiness Principle\nand Other Early German Anticipations of Utilitarian\nTheory,” <em>Utilitas</em>, 3: 165–77.",
                "Long, Douglas, 1990. “‘Utility’ and the\n‘Utility Principle’: Hume, Smith, Bentham, Mill,”\n<em>Utilitas</em>, 2: 12–39.",
                "Rosen, Frederick, 2003. “Reading Hume Backwards: Utility as\nthe Foundation of Morals,” in Frederick Rosen (ed.),\n<em>Classical Utilitarianism from Hume to Mill</em>, London: Routledge,\n29–57.",
                "Rosenblum, Nancy, 1978. <em>Bentham's Theory of the Modern\nState</em>, New York: Cambridge University Press.",
                "Ryan, Alan, 1990. <em>The Philosophy of John Stuart\nMill</em>, Amherst, NY: Prometheus Books.",
                "Scarre, Geoffrey, 1996. <em>Utilitarianism</em>, London:\nRoutledge.",
                "Schneewind, J. B., 1977. <em>Sidgwick's Ethics and Victorian\nMoral Philosophy</em>, Oxford: Clarendon Press.",
                "–––, 1990. “The Misfortunes of\nVirtue,” <em>Ethics</em>, 101: 42–63.",
                "Schofield, Philip, 2006. <em>Utility and Democracy: the Political\nThought of Jeremy Bentham</em>, Oxford: Oxford University Press.",
                "Schultz, Bart, 2004. <em>Henry Sidgwick, Eye of the\nUniverse</em>, New York: Cambridge University Press.",
                "Skorupski, John, 1989. <em>John Stuart Mill</em>, London:\nRoutledge &amp; Kegan Paul.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Primary Literature</h3>\n<ul class=\"hanging\">\n<li>Bentham, Jeremy, 1789 [PML]. <em>An Introduction to the Principles of\nMorals and Legislation.</em>, Oxford: Clarendon Press, 1907.</li>\n<li>–––, 1785 [OAO]. “Offences Against\nOneself.” Louis Compton (ed.), <em>The Journal of\nHomosexuality</em>, 3(4) (1978): 389–406, 4(1): 91–107..</li>\n<li>Cooper, Anthony Ashley (3<sup>rd</sup> Earl of\nShaftesbury), 1711 [IVM]. <em>Inquiry Concerning Virtue or\nMerit</em>, in <em>Characteristics of Men, Manners, Opinions and\nTimes</em>, excerpts reprinted in Raphael 1969. </li>\n<li>Cumberland, Richard, 1672. <em>De Legibus Naturae Disquisitio\nPhilosophica</em>, London. English translation by John Maxwell, <em>A\nTreatise of the Laws of Nature</em>, 1727, reprinted New York,\nGarland, 1978.</li>\n<li>Gay, John, 1731. <em>A Dissertation Concerning the Fundamental\nPrinciple and Immediate Criterion of Virtue</em> in Frances\nKing's <em>An Essay on the Origin of Evil</em>, London.</li>\n<li>Hume, David, 1738. <em>A Treatise of Human Nature</em>, edited by\nL. A. Selby-Bigge, Oxford: Oxford University Press, 1978.</li>\n<li>Hutcheson, Francis, 1725. <em>An Inquiry into the Original of\nour Ideas of Beauty and Virtue</em>, London; excerpts reprinted in\nRaphael 1969.</li>\n<li>Mill, John Stuart, 1843. <em>A System of Logic</em>, London: John\nW. Parker.</li>\n<li>–––, 1859. <em>On Liberty</em>, London: Longman,\nRoberts &amp; Green.</li>\n<li>–––, 1861 [U]. <em>Utilitarianism</em>, Roger\nCrisp (ed.), Oxford: Oxford University Press, 1998.</li>\n<li>Moore, G. E., 1903 [PE]. <em>Principia Ethica</em>, Amherst, New\nYork: Prometheus Books, 1988.</li>\n<li>Price, Richard, 1758 [PE]. <em>A Review of the Principle Questions\nin Morals</em>, London: T. Cadell in the Strand, 1787.</li>\n<li>Raphael, D. D., 1969 [R]. <em>British Moralists</em>, in two\nvolumes, London: Oxford, Clarendon Press.</li>\n</ul>\n<h3>Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Crisp,  Roger, 1997.  <em>Mill on  Utilitarianism.</em>, London:\nRoutledge.</li>\n<li>Darwall, Stephen, 1995. <em>Hume and the Invention of\nUtilitarianism</em>, University Park, PA: Penn State University\nPress.</li>\n<li>Donner, Wendy, 1991. <em>The Liberal Self: John Stuart Mill's\nMoral and Political Philosophy</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>–––, 2011. “Morality, Virtue, and\nAesthetics in Mill's Art of Life,” in Ben Eggleston, Dale\nE. Miller, and David Weinstein (eds.) <em>John Stuart Mill and the Art\nof Life</em>, Oxford: Oxford University Press.</li>\n<li>Driver, Julia, 2004. “Pleasure as the Standard of Virtue\nin Hume's Moral Philosophy.” <em>Pacific Philosophical\nQuarterly.</em>, 85: 173–194.</li>\n<li>–––, 2011. <em>Consequentialism</em>,\nLondon: Routledge.</li>\n<li>Gill, Michael, 2006. <em>The British Moralists on Human Nature\nand the Birth of Secular Ethics</em>, New York: Cambridge University\nPress.</li>\n<li>Hruschka, Joachim, 1991. “The Greatest Happiness Principle\nand Other Early German Anticipations of Utilitarian\nTheory,” <em>Utilitas</em>, 3: 165–77.</li>\n<li>Long, Douglas, 1990. “‘Utility’ and the\n‘Utility Principle’: Hume, Smith, Bentham, Mill,”\n<em>Utilitas</em>, 2: 12–39.</li>\n<li>Rosen, Frederick, 2003. “Reading Hume Backwards: Utility as\nthe Foundation of Morals,” in Frederick Rosen (ed.),\n<em>Classical Utilitarianism from Hume to Mill</em>, London: Routledge,\n29–57.</li>\n<li>Rosenblum, Nancy, 1978. <em>Bentham's Theory of the Modern\nState</em>, New York: Cambridge University Press.</li>\n<li>Ryan, Alan, 1990. <em>The Philosophy of John Stuart\nMill</em>, Amherst, NY: Prometheus Books.</li>\n<li>Scarre, Geoffrey, 1996. <em>Utilitarianism</em>, London:\nRoutledge.</li>\n<li>Schneewind, J. B., 1977. <em>Sidgwick's Ethics and Victorian\nMoral Philosophy</em>, Oxford: Clarendon Press.</li>\n<li>–––, 1990. “The Misfortunes of\nVirtue,” <em>Ethics</em>, 101: 42–63.</li>\n<li>Schofield, Philip, 2006. <em>Utility and Democracy: the Political\nThought of Jeremy Bentham</em>, Oxford: Oxford University Press.</li>\n<li>Schultz, Bart, 2004. <em>Henry Sidgwick, Eye of the\nUniverse</em>, New York: Cambridge University Press.</li>\n<li>Skorupski, John, 1989. <em>John Stuart Mill</em>, London:\nRoutledge &amp; Kegan Paul.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Bentham, Jeremy",
            "consequentialism",
            "hedonism",
            "Hume, David",
            "Mill, John Stuart",
            "Moore, George Edward",
            "Scottish Philosophy: in the 18th Century",
            "Shaftesbury, Lord [Anthony Ashley Cooper, 3rd Earl of]",
            "Sidgwick, Henry",
            "well-being"
        ],
        "entry_link": [
            {
                "../bentham/": "Bentham, Jeremy"
            },
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../hedonism/": "hedonism"
            },
            {
                "../hume/": "Hume, David"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../moore/": "Moore, George Edward"
            },
            {
                "../scottish-18th/": "Scottish Philosophy: in the 18th Century"
            },
            {
                "../shaftesbury/": "Shaftesbury, Lord [Anthony Ashley Cooper, 3rd Earl of]"
            },
            {
                "../sidgwick/": "Sidgwick, Henry"
            },
            {
                "../well-being/": "well-being"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=utilitarianism-history\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/utilitarianism-history/\" target=\"other\">Preview the PDF version of this entry</a> at the <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=utilitarianism-history&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/utilitarianism-history/\" target=\"other\">Enhanced bibliography for this entry</a> at <a href=\"http://philpapers.org\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=utilitarianism-history": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/utilitarianism-history/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=utilitarianism-history&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/utilitarianism-history/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}