{
    "url": "work-labor",
    "title": "Philosophical Approaches to Work and Labor",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Michael Cholbi\n<mcholbi@ed.ac.uk>",
        "author_links": [
            {
                "http://michael.cholbi.com/": "Michael Cholbi"
            },
            {
                "mailto:mcholbi%40ed%2eac%2euk": "mcholbi@ed.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://michael.cholbi.com/\" target=\"other\">Michael Cholbi</a>\n&lt;<a href=\"mailto:mcholbi%40ed%2eac%2euk\"><em>mcholbi<abbr title=\" at \">@</abbr>ed<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Jan 11, 2022"
    ],
    "preamble": "\n\nWork is a subject with a long philosophical pedigree. Some of the most\ninfluential philosophical systems devote considerable attention to\nquestions concerning who should work, how they should work, and why.\nFor example, in the ideally just city outlined in the\nRepublic, Plato proposed a system of labor specialization,\naccording to which individuals are assigned to one of three economic\nstrata, based on their inborn abilities: the laboring or mercantile\nclass, a class of auxiliaries charged with keeping the peace and\ndefending the city, or the ruling class of\n‘philosopher-kings’. Such a division of labor, Plato\nargued, will ensure that the tasks essential to the city’s\nflourishing will be performed by those most capable of performing\nthem.\n\nIn proposing that a just society must concern itself with how work is\nperformed and by whom, Plato acknowledged the centrality of work to\nsocial and personal life. Indeed, most adults spend a significant time\nengaged in work, and many contemporary societies are arguably\n“employment-centred” (Gorz 2010). In such societies, work\nis the primary source of income and is ‘normative’ in the\nsociological sense, i.e., work is expected to be a central feature of\nday-to-day life, at least for adults.\n\nArguably then, no phenomenon exerts a greater influence on the quality\nand conditions of human life than work. Work thus deserves the same\nlevel of philosophical scrutiny as other phenomena central to economic\nactivity (for example, markets or property) or collective life (the\nfamily, for instance).\n\nThe history of philosophy contains an array of divergent perspectives\nconcerning the place of work in human life (Applebaum 1992, Schaff\n2001, Budd 2011, Lis and Soly 2012, Komlosy 2018). Traditional\nConfucian thought, for instance, embraces hard work, perseverance, the\nmaintenance of professional relations, and identification with\norganizational values. The ancient Mediterranean tradition,\nexemplified by Plato and Aristotle, admired craft and knowledge-driven\nproductive activity while also espousing the necessity of leisure and\nfreedom for a virtuous life. The Christian tradition contains several\ndifferent views of work, including that work is toil for human sin,\nthat work should be a calling or vocation by which one glorifies God\nor carries out God’s will, and that work is an arena in which to\nmanifest one’s status as elect in the eyes of God (the\n‘Protestant work ethic’). The onset of the Industrial\nRevolution and the adverse working conditions of industrial labor\nsparked renewed philosophical interest in work, most prominently in\nMarxist critiques of work and labor that predict the alienation of\nworkers under modern capitalism and the emergence of a classless\nsociety in which work is minimized or equitably distributed.\n\nPhilosophical attention to work and labor seems to increase when work\narrangements or values appear to be in flux. For example, recent years\nhave witnessed an increase in philosophical research on work, driven\nat least in part by the perception that is in ‘crisis’:\nEconomic inequality in employment-centred societies continues to rise,\ntechnological automation seems poised to eliminate jobs and to augur\nan era of persistent high unemployment, and dissatisfaction about the\nquality or meaningfulness of work in present day jobs appears to be\nincreasing (Schwartz 2015, Livingston 2016, Graeber 2018, Danaher\n2019). Many scholars now openly question whether work should be\ntreated as a ‘given’ in modern societies (Weeks 2011).\n\nThis entry will attempt to bring systematicity to the extant\nphilosophical literature on work by examining the central conceptual,\nethical, and political questions in the philosophy of work and labor\n(Appiah 2021).\n",
    "toc": [
        {
            "#ConcDistWorkLaboEmplLeis": "1. Conceptual Distinctions: Work, Labor, Employment, Leisure"
        },
        {
            "#ValuWork": "2. The Value of Work"
        },
        {
            "#GoodWork": "2.1 The Goods of Work"
        },
        {
            "#OppoWorkWorkCentCult": "2.2 Opposition to Work and Work-centred Culture"
        },
        {
            "#JustPoliWork": "3. Justice and the Politics of Work"
        },
        {
            "#DistJust": "3.1 Distributive Justice"
        },
        {
            "#ContProdJust": "3.2 Contributive and Productive Justice"
        },
        {
            "#EquaWorkGove": "3.3 Equality and Workplace Governance"
        },
        {
            "#GendCareEmotLabo": "3.4 Gender, Care, And Emotional Labor"
        },
        {
            "#WorkFutu": "4. Work and its Future"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Conceptual Distinctions: Work, Labor, Employment, Leisure\n\nIt is not difficult to enumerate examples of work. Hence, Samuel\nClark:\n\nby work I mean the familiar things we do in fields,\nfactories, offices, schools, shops, building sites, call centres,\nhomes, and so on, to make a life and a living. Examples of work in our\ncommercial society include driving a taxi, selling washing machines,\nmanaging a group of software developers, running a till in a\nsupermarket, attaching screens to smartphones on an assembly line,\nfielding customer complaints in a call centre, and teaching in a\nschool (Clark 2017: 62).\n\n\nSome contemporary commentators have observed that human life is\nincreasingly understood in work-like terms: parenthood is often\ndescribed as a job, those with romantic difficulties are invited to\n‘work on’ their relationships, those suffering from the\ndeaths of others are advised to undertake ‘grief work,’\nand what was once exercise is now ‘working out’ (Malesic\n2017). The diversity of undertakings we designate as\n‘work’, and the apparent dissimilarities among them, have\nled some philosophers to conclude that work resists any definition\n(Muirhead 2007: 4, Svendsen 2015) or is at best a loose concept in\nwhich different instances of work share a ‘family\nresemblance’ (Pence 2001: 96–97).\n\nThe porousness of the notion of work notwithstanding, some progress in\ndefining work seems possible by first considering the variety of ways\nin which work is organized. For one, although many contemporary\ndiscussions of work focus primarily on employment, not all\nwork takes the form of employment. It is therefore important not to\nassimilate work to employment, because not every philosophically\ninteresting claim that is true of employment is true of work as such,\nand vice versa. In an employment relationship, an individual worker\nsells their labor to another in exchange for compensation (usually\nmoney), with the purchaser of their labor serving as a kind of\nintermediary between the worker and those who ultimately enjoy the\ngoods that the worker helps to produce (consumers). The intermediary,\nthe employer, typically serves to manage (or appoints those\nwho manage) the hired workers — the employees—, setting\nmost of the terms of what goods are thereby to be produced, how the\nprocess of production will be organized, etc. Such an arrangement is\nwhat we typically understand as having a job.\n\nBut a worker can produce goods without their production being mediated\nin this way. In some cases, a worker is a proprietor, someone\nwho owns the enterprise as well as participating in the production of\nthe goods produced by that enterprise (for example, a restaurant owner\nwho is also its head chef). This arrangement may also be termed\nself-employment, and differs from arrangements in which\nproprietors are not workers in the enterprise but merely capitalize it\nor invest in it. And some proprietors are also employers, that is,\nthey hire other workers to contribute their labor to the process of\nproduction. Arguably, entrepreneurship or self-employment, rather than\nhaving a job, has been the predominant form of work throughout human\nhistory, and it continues to be prevalent. Over half of all workers\nare self-employed in parts of the world such as Africa and South Asia,\nand the number of self-employed individuals has been rising in many\nregions of the globe (International Labor Organization 2019). In\ncontrast, jobs — more or less permanent employment relationships\n— are more a byproduct of industrial modernity than we realise\n(Suzman 2021).\n\nEmployees and proprietors are most often in a transactional\nrelationship with consumers; they produce goods that consumers buy\nusing their income. But this need not be the case. Physicians at a\n‘free clinic’ are not paid by their patients but by a\ngovernment agency, charity, etc. Nevertheless, such employees expect\nto earn income from their work from some source. But some instances of\nwork go unpaid or uncompensated altogether. Slaves work, as do\nprisoners in some cases, but their work is often not compensated. So\ntoo for those who volunteer for charities or who provide unpaid\ncare work, attending to the needs of children, the aged, or\nthe ill.\n\nThus, work need not involve working for others, nor need it\nbe materially compensated. These observations are useful inasmuch as\nthey indicate that certain conditions we might presume to be essential\nto work (being employed, being monetarily compensated) are not in fact\nessential to it. Still, these observations only inform as to what work\nis not. Can we say more exactly what work is?\n\nPart of the difficulty in defining work is that whether a\nperson’s actions constitute work seems to depend both on how her\nactions shape the world as well on the person’s attitudes\nconcerning those actions. On the one hand, the activity of work is\ncausal in that it modifies the world in some non-accidental way. As\nBertrand Russell (1932) remarked, “work is of two kinds: first,\naltering the position of matter at or near the earth’s surface\nrelatively to other such matter; second, telling other people to do\nso.” But work involves altering the world in presumptively\nworthwhile ways. In this respect, work is closely tied to the\nproduction of what Raymond Geuss (2021:5) has called\n‘objective’ value, value residing in\n“external” products that can be “measured and valued\nindependently of anything one might know about the process through\nwhich that product came to be or the people who made it.” By\nworking, we generate goods (material objects but also experiences,\nstates of mind, etc.) that others can value and enjoy in their own\nright. In most cases of work (for example, when employed), a person is\ncompensated not for the performance of labor as such but because their\nlabor contributes to the production of goods that have such\n‘objective’ value. Note, however, that although work\ninvolves producing what others can enjoy or consume,\nsometimes the objective value resulting from work is not in fact\nenjoyed by others or by anyone at all. A self-sufficient farmer works\nby producing food solely for their own use, in which case the worker\n(rather than others) ends up consuming the objective value of their\nwork. Likewise, the farmer who works to produce vegetables for market\nthat ultimately go unsold has produced something whose objective value\ngoes unconsumed.\n\nGeuss has suggested a further characteristic of work, that it is\n“necessary” for individuals and for “societies as a\nwhole” (2021:18). Given current and historical patterns of human\nlife, work has been necessary to meet human needs. However, if some\nprognostications about automation and artificial intelligence prove\ntrue (see section 4 on ‘The Future of Work’), then the\nscarcity that has defined the human condition up to now may be\neliminated, obviating the necessity of work at both the individual and\nsocietal level. Moreover, as Geuss observes, some work aims to produce\ngoods that answer to human wants rather than human needs or\nnecessities (that is, to produce luxuries), and some individuals\nmanage to escape the necessity of work thanks to their antecedent\nwealth.\n\nStill, work appears to have as one of its essential features that it\nbe an activity that increases the objective (or perhaps\nintersubjective) value in the world. Some human activities are\ntherefore arguably not work because they generate value for the actor\ninstead of for others. For instance, work stands in contrast to\nleisure. Leisure is not simply idleness or the absence of\nwork, nor is it the absence of activity altogether (Pieper 1952,\nWalzer 1983: 184–87, Adorno 2001, Haney and Kline 2010). When at\nleisure, individuals engage in activities that produce goods for their\nown enjoyment largely indifferent to the objective value that these\nactivities might generate for others. The goods resulting from a\nperson’s leisure are bound up with the fact that she generates\nthem through her activity. We cannot hire others to sunbathe for us or\nenjoy a musical performance for us because the value of such leisure\nactivities is contingent upon our performing the activities. Leisure\nthus produces subjective value that we ‘make’ for\nourselves, value that (unlike the objective value generated from work)\ncannot be transferred to or exchanged with others. It might also be\npossible to create the objective value associated with working despite\nbeing at leisure. A professional athlete, for instance, might be\nmotivated to play her sport as a form of leisure but produce (and be\nmonetarily compensated for the production of) objective value for\nothers (spectators who enjoy the sport). Perhaps such examples are\ninstances of work and leisure or working by way of\nleisure.\n\nSome accounts of work emphasize not the nature of the value work\nproduces but the individual’s attitudes concerning work. For\ninstance, many definitions of work emphasize that work is experienced\nas exertion or strain (Budd 2011:2, Veltman 2016:24–25, Geuss\n2021: 9–13). Work, on this view, is inevitably\nlaborious. No doubt work is often strenuous. But defining\nwork in this way seems to rule out work that is sufficiently\npleasurable to the worker as to hardly feel like a burden. An actor\nmay so enjoy performing that it hardly feels like a strain at all.\nNevertheless, the performance is work inasmuch as the actor must\ndeliberately orient their activities to realize the objective value\nthe performance may have for others. Her acting will not succeed in\nproducing this objective value unless she is guided by a concern to\nproduce the value by recalling and delivering her lines, etc. In fact,\nthe actor may find performing pleasurable rather than a burden because\nshe takes great satisfaction in producing this objective value for\nothers. Other work involves little exertion of strain because it is\nnearly entirely passive; those who are paid subjects in medical\nresearch are compensated less for their active contribution to the\nresearch effort but simply “to endure” the investigative\nprocess and submit to the wills of others (Malmqvist 2019). Still, the\nresearch subject must also be deliberate in their participation,\nmaking sure to abide by protocols that ensure the validity of the\nresearch. Examples such as these suggest that a neglected dimension of\nwork is that, in working, we are paradigmatically guided by the wills\nof others, for we are aiming in our work activities to generate goods\nthat others could enjoy.\n2. The Value of Work\n\nThe proposed definition of work as the deliberate attempt to produce\ngoods that others can enjoy or consume indicates where work’s\nvalue to those besides the worker resides. And the value that work has\nto others need not be narrowly defined in terms of specific\nindividuals enjoying or consuming the goods we produce. Within some\nreligious traditions, work is way to serve God and or one’s\ncommunity.\n\nBut these considerations do not shed much light on the first-personal\nvalue of work: What value does one’s work have to\nworkers? How do we benefit when we produce goods that others could\nenjoy?\n2.1 The Goods of Work\n\nOn perhaps the narrowest conception of work’s value, it only has\nexchange value. On this conception, work’s value is\nmeasured purely in terms of the material goods it generates for the\nworker, either in monetary terms or in terms of work’s products\n(growing one’s own vegetables, for instance). To view work as\nhaving exchange value is to see its value as wholly extrinsic; there\nis no value to work as such, only value to be gained from what\none’s work concretely produces. If work only has exchange value,\nthen work is solely a cost or a burden, never worth doing for its own\nsake. Echoing the Biblical tale of humanity’s fall, this\nconception of work’s value casts it as a curse foisted upon us\ndue to human limitations or inadequacies.\n\nBut work is often valued for other reasons. One powerful bit of\nevidence in favour of work’s being valued for reasons unrelated\nto its exchange value comes from studies of (involuntary)\nunemployment. Unemployment usually adverse economic effects on\nworkers, inasmuch as it deprives them, at least temporarily, of\nincome. But prolonged unemployment also has measurable negative\neffects on individuals’ health, both physical and mental (Calvo\net al 2015, Margerison-Zilko et al. 2016, Helliwell et al 2017), as\nwell as being among the most stressful of live events. (Holmes and\nRahe 1967). That being deprived of work is evidently so detrimental to\nindividual well-being indicates that work matters for many beyond a\npaycheck.\n\nMany of the goods of work are linked to the fact that work is nearly\nalways a social endeavour. As Cynthia Estlund (2003:7) observes,\n“the workplace is the single most important site of cooperative\ninteraction and sociability among adult citizens outside the\nfamily.” Individuals thus seek out many social goods through\nwork. Gheaus and Herzog (2016) propose that in addition to providing\nus wages, work fulfills various social roles. For example, work is a\nprimary means by which individuals can achieve a sense of community.\nIn working with others, we can establish bonds that contribute to our\nsense of belonging and that enable us to contribute to a distinctive\nworkplace culture. In a similar vein, communitarian theorists often\nargue that work, by embedding us in shared practices or traditions, is\nessential to social life (Walzer 1983, Breen 2007). MacIntyre\n(1984:187) defines a practice as a “any coherent and complex\nform of socially established cooperative activity through which goods\ninternal to that form of activity are realised in the course of trying\nto achieve those standards of excellence which are appropriate to, and\npartially definitive of, that form of activity.” Those working\ntogether in (say) a bakery are cooperating to produce the goods\ninternal to that activity (bread), with the result that they extend\ntheir capacities and enrich their appreciation of the goods they\ncooperatively produce.\n\nMany philosophers have closely linked work’s value to different\naspects of human rationality. For instance, philosophers inspired by\nthinkers such as Aristotle have underscored work’s ability to\nallow us to perfect ourselves by developing and exercising our\nrational potential in worthwhile ways. On this picture, work is a\ncentral arena for the realization of our natures across our lifetimes\n(Clark 2017). Marxists typically agree that work allows us to develop\nand exercise our rational powers, but add that work’s value also\nresides in how it enables us to make those powers visible by imparting\nhuman form to a natural world that would otherwise remain alien to us.\nHence, for Marxists, work is an expression of our active nature, a\npathway to self-realization inasmuch as work creates products that\n“objectify” the human will. Work thus represents a\ncounterweight to the passive consumption characteristic of modern\nsocieties (Elster 1989, Sayers 2005).\n\nAnother value associated with work is meaningfulness.\nPhilosophical inquiry into meaningful work often parallels\nphilosophical inquiry into\n the meaning of life.\n One central dispute about meaningful work is whether it is\nfundamentally subjective (a matter of how a worker feels about her\nwork), fundamentally objective (a matter of the qualities of\none’s work or of the products one makes), or both (Yeoman 2014,\nMichaelson 2021). Some accounts of meaningful work are broadly\nKantian, seeing meaningful work as grounded in the value of autonomy\n(Schwartz 1982, Bowie 1998, Roessler 2012). Such accounts judge work\nas meaningful to the extent that it is freely entered into, affords\nworkers opportunities to exercise their own independent judgment, and\nallows them to pursue ends of their own that are to some extent\ndistinct from the ends mandated by their employers. Other accounts\nlocate the meaningfulness of work in its potential to enhance our\ncapabilities, to manifest virtues such as pride or self-discipline, or\nto emotionally engage our sense of purpose (Beadle and Knight 2012,\nSvendsen 2015, Yeoman 2014, Veltman 2016).\n\nAt the same time, some argue that meaningful work is in turn a\nprecondition of other important goods. John Rawls, for example,\nproposed that a lack of opportunity for meaningful work undermines\nself-respect, where self-respect is the belief that our plan for our\nlives is both worth pursuing and attainable through our intentional\nefforts. Meaningful work, as Rawls understood it, involves enjoying\nthe exercise of our capacities, particularly our more complex\ncapacities. Given that meaningful work is a “social basis”\nfor self-respect, a just and stable society may have to offer\nmeaningful work by serving as an “employer of last resort”\nif such work is otherwise unavailable (Rawls 1996, Moriarty 2009).\n\nRecent years have witnessed a resurgence of interest in the\ndignity of work. Christian thought, and Catholicism in\nparticular (John Paul II 1981), has long advocated that work manifests\nthe dignity inherent in human beings. The claim that “all work\nhas dignity,” regardless of its nature or of how much social\nesteem it enjoys, rests on egalitarian ideals about labor, ideals\narticulated by Black American thinkers such as Booker T. Washington\nand Martin Luther King, Jr. As Washington expressed it, “there\nis as much dignity in tilling a field as in writing a poem”\n(Washington 1901:220). At the same time however, this tradition has\nalso deployed the notion of dignity as a critical concept, to\nhighlight labor injustice and to decry exploitative forms of work\n(including slavery) that fail to serve or uplift humanity (Washington\n1901: 148, King 2011: 171–72, Veltman 2016: 29–31). This\nposition thus seems to assert that work as such has dignity but that\nwork can also vary in its dignity depending on workers’ economic\nconditions or social status. More recent philosophical scholarship on\nthe dignity of work has investigated its relationship to human rights.\nFor instance, Paolo Gilabert (2018) distinguishes between dignity as a\nstatus and dignity as a condition. Status dignity is grounded in\ncertain valuable capacities that individuals have, capacities that in\nturn that require workers be treated with respect and concern.\nCondition dignity is achieved when individuals are treated in\naccordance with the ‘dignitarian’ norms mandated by such\nrespect or concern. Gilabert’s distinction may allow the\naffirmation both of the inherent dignity of work, inasmuch as work\ngives evidence of human capacities worthy of respect, and of the claim\nthat failing to provide decent working conditions is at odds with (but\ndoes not undermine) dignity.\n2.2 Opposition to Work and Work-centred Culture\n\nThat work is a potential source of income, social and personal goods,\nmeaning, or dignity, does not entail that work in fact\nprovides these goods or that work is good for us on balance.\nSince the Industrial Revolution in particular, many philosophers and\nsocial theorists have been sceptical about the value of work and of\nthe work-centred cultures typical of contemporary affluent societies\n(Deranty 2015).\n\nCrucially, much of the scepticism surrounding the value of work is not\nscepticism about the value of work per se but scepticism\nabout the value of work in present day social conditions or scepticism\nabout the veneration of work found in the “Protestant work\nethic” (Weber 1904–05) or in work-centred societies.\nSceptics about work-centred culture question whether popular\nenthusiasm for work is rational or well-informed or whether it gives\nadequate credence to alternatives to work-centred culture (Cholbi\n2018b, Sage 2019). Indeed, many critics of contemporary work\narrangements essentially argue that good or desirable work is possible\nbut rarer than we suppose. In “Useful Work versus Useful\nToil,” (1884), for example, the socialist activist William\nMorris rejects “the creed of modern morality that all labor is\ngood in itself” and argues for a distinction between work that\nis “a blessing, a lightening of life” and work that is\n“a mere curse, a burden to life,” offering us no hope of\nrest, no hope of producing anything genuinely useful, and no hope of\npleasure in its performance. Similarly, the anarchist Bob Black opens\nhis essay “The Abolition of Work” (1985) as follows:\n\nNo one should ever work. Work is the source of nearly all the misery\nin the world. Almost any evil you’d care to name comes from\nworking or from living in a world designed for work. In order to stop\nsuffering, we have to stop working.\n\n\nBut Black proceeds to define work as “forced labor, that is,\ncompulsory production.” His ‘abolition’ of work is\nthus compatible with individuals voluntarily engaging in\neconomically productive activities, which (as we have seen) can\nresemble work in its essentials.\n\nDanaher (2019:54) allows that work can contribute to human well-being,\nbut as presently organized, the world of work is “structurally\nbad” and unlikely to change in these respects:\n\nThe labor market in most developed countries has settled into an\nequilibrium pattern that makes work very bad for many people, that is\ngetting worse as a result of technical and institutional changes, and\nthat is very difficult to reform or improve in such a way as to remove\nits bad-making properties.\n\n\nThus, even those espousing stridently ‘anti-work’\npositions usually target not work as such, but work as it has been\norganized or understood in the contemporary world. Indeed, much of\ntheir ire is directed at current conditions of employment, which (as\nnoted earlier) is only one prominent species work can take.\n\nThe sceptical case against work or work culture has many dimensions,\nbut can be fruitfully analysed as having four strands:\n\n\n\nGoods not realized: While work can be a source of various\ngoods, many people’s working lives fail to provide them these\ngoods. Popular enthusiasm for work thus seems misplaced, according to\nwork sceptics, for “the moral sanctity of work is painfully out\nof step with the way that a vast proportion of people actually\nexperience their jobs” (Frayne 2015: 62–63).\n\nWith respect to the exchange value of work, work is often poorly\ncompensated or insecure. Contemporary economies are increasingly\ncharacterized by a ‘hollowing out’ of middle class labor,\nwherein wages continue to increase for those at the upper end of the\nwage scale, wages stagnate at the bottom end of the scale, and the\nnumber of workers in the middle strata shrinks. This has resulted in\nthe emergence of a class of ‘working poor,’ individuals\nwho lack sufficient income to pay for basic needs such as housing or\nfood despite being employed.\n\nMany of the other potential goods of work are enjoyed by some workers,\nbut many receive little social recognition or do not achieve a greater\nsense of community through their work. A good deal of socially\nvaluable or ‘essential’ work is largely invisible to its\nbeneficiaries. Many jobs are dull or unchallenging, contributing\nlittle to the development or exercise of our more sophisticated human\ncapacities. It is difficult to envision, for instance, that toll booth\nworkers find their jobs or stimulating or challenging (aside from\ntesting their ability to withstand repetition or boredom).\n\nModern work has been oriented around the division of labor,\ni.e., the increasing separation of productive processes into ever\nsmaller tasks. (The factory assembly line provides the model here.)\nThe division of labor results in workers becoming hyper-specialists,\nwho repetitively perform narrow or simple tasks. Although the division\nof labor increases overall economic productivity, critics such as the\nclassical economist Adam Smith worried that it eventually makes\nworkers “as stupid and ignorant as it is possible for a human\ncreature to become.” (Smith 1776 [1976]: V.1.178) As to meaning\nor dignity, a wide swath of human work neither engages workers nor\nallows them to exercise their autonomous judgment, and many work in\noppressive or exploitative conditions seemingly at odds with the\ndignity of the work they perform. \n\n\nInternal tensions among work goods: A characteristic of\nwork-centred societies is that their members look to work to provide\nthem with many different goods. But work (and employment in\nparticular) may be ill-suited to provide this package of goods, i.e.,\nwork may be capable of providing some of these goods but only at the\nexpense of others. For instance, many of the professions that\nindividuals view as offering the greatest opportunities for meaningful\nwork (such as education, counseling, or care for the sick, young, or\ndisabled) are among the poorest paid professions. Contemporary labor\nmarkets thus seem to offer a workers the opportunity for an inadequate\nincome or meaningful work, but rarely both. The psychologist Barry\nSchwartz argues (2015) that our non-material motivations for work,\nsuch as seeking meaningfulness, social engagement, and opportunities\nfor autonomy, are in motivational competition with the monetary\nincentives associated with work. The monetary incentives distort\nworkplace attitudes and behaviours so that the non-material goods we\nseek in work are crowded out by a focus on productivity and the\neconomic goods work makes available. That labor markets are\ncompetitive may also undermine the social benefits of work, for even\nthose who succeed in the labor market do so by being ‘pitted\nagainst’ other workers in ways that reduce solidarity among\nthem, turning fellow citizens into rivals who are indifferent (or even\nhostile to) each other’s interests (Hussain 2020). \n\n\nUnrecognized bads or costs: Sceptics also point to\n‘bads’ or costs associated with work that tend to go\nunrecognized. The most obvious of these is the opportunity costs\nresulting from the amount of time spent working. Typically, full-time\nworkers spend 1,500–2,500 hours per year on the job, equivalent\nto around nine to fifteen weeks annually. These are hours that, were\nthey not allocated to working, could be devoted to leisure, sleep,\nexercise, family life, civic and community engagement, and so on (Rose\n2016). These hours do not include the considerable amount of time that\nworkers expend on training or educating themselves for work or on\ncommuting to and from workplaces. Nor does it include the hours that\nmany salaried workers are expected to be ‘connected’ or\n‘on call’ by their employers. Formal employment also tends\nto preclude workers from work other than that performed for their\nemployers, with the result that workers often end up paying other\nworkers for that labor. Such costs include the hiring of housekeepers,\nchild care providers, maintenance experts and landscapers, etc. And\nwhile unemployment seems to have adverse effects on our physical and\nmental well-being, working is not free of adverse health effects\neither, including stress, emotional frustration, and physical ailments\nfrom repetitive work tasks or ergonomic deficiencies in workplace\ndesign.\n\nSceptics also argue that when work fails to deliver certain kinds of\ngoods, workers suffer certain psychological bads. Three such classes\nof bads merit particular attention:\n\nMarx’s critique of work under capitalism rests on the notion\nthat work often lacks goods whose absence gives rise to the further\nbad of alienation. Marx (1844) proposed that work under\ncapitalism alienates workers from what they produce, inasmuch as\nworkers have little if any say over what is produced and how; from the\nact of work itself, inasmuch as workers are compelled by economic\nnecessity to work and so do not take intrinsic satisfaction in\nworking; from their own human nature or “species-essence,”\ninasmuch as workers do not witness their own agency or intentions\n“objectified” in the products of their work; and from\nother workers, inasmuch as capitalism treats workers as\ninterchangeable inputs of production and pits worker against worker.\nIn terms of our earlier enumeration of the goods of work, Marx’s\nappeal to alienation suggests that the absence of these goods is not\nmerely a lack or a deprivation but is a positive bad of work in its\nown right (Elster 1989, Brudney 1998, Kandiyali 2020).\nMany work sceptics emphasize how work may distort our priorities\nor values. The value of work, in their eyes, has come to be an\nunquestioned ethical dogma. “The economists and the moralists\nhave cast a sacred halo over work,” according to Paul LaFargue\n(1883), instilling us in the “delusion” of the “love\nof work.” (See also Frayne 2015.) Bertrand Russell (1932) argued\nthat the veneration of work has eroded our appreciation of the value\nof leisure and idleness. (See also O’Connor 2018.) Economists\nsuch as Keynes (1930) observed that the dramatic increases in economic\nproductivity have often not led to reductions in work time, a\ndevelopment he attributes to a work ethic that stymies our capacity to\nenjoy leisure and abundance.\nThe social cachet of work may end up warping our moral\nrelationship to ourselves, treating ourselves not as intrinsically\nvaluable but as mere instruments of production. Hannah Arendt (1958)\nargued that conceiving of ourselves primarily as workers leads to a\nsort of instrumental stance on ourselves and other human agents, in\nwhich we come to view ourselves purely as resources for production or\nsites of consumption. More recent critics have proposed that\nwork-centred cultures encourage us to view the self as a commodity to\nbe ‘branded’ or marketed to prospective employers (Davis\n2003).\n\n\nLastly, work can have costs to others besides workers themselves. The\naforementioned opportunity costs deriving from time devoted to work\nmay worsen workers’ relationships with others or bar their\ncommunities from making use of those workers’ skills for\nsocially worthwhile purposes. Some work arguably makes workers\ncomplicit in harmful or unjust practices, such as the sale of tobacco\nor unhealthy foods. Workers may also impose negative\nexternalities through their work. For example, working outside\nthe home typically results in a greater environmental impact,\nincluding contributions to the carbon outputs responsible for global\nclimate change (James 2018). \n\n\nAlternatives sources of work-related goods: A last thread in\n‘anti-work’ thinking is that, even to the degree that work\nis good, it is not obviously uniquely situated to provide the goods it\nprovides. A sense of social recognition or identity can be rooted in\ndomains of human life besides employment, such as volunteer work,\nfamily life, religion, or friendship. “Ludic” activities,\ni.e., play, can offer opportunities to exercise and hone our rational\ncapacities (Black 1985, Nguyen 2019). Some have proposed that virtual\nreality will provide us simulacra of work-like activities that could\nthereby substitute for work itself. Contrary to Gheaus and Herzog\n(2016) then, work may not be a “a privileged context” for\nrealizing the goods we associate with work. \n\n\nAnti-work theorists typically call for work to be re-valued such that\nindividuals will ‘work to live, not live to work,’ as well\nas policies (such as reductions in the mandated weekly working time)\nto minimize the influence of work on our quality of life. That work is\nboth unavoidable and seemingly necessary but frustrating might suggest\nthe wisdom of an ironic stance toward work (de Botton 2010).\n3. Justice and the Politics of Work\n\nHuman societies can be seen as cooperative endeavours aimed at\nsecuring their members’ interests. If so, then social justice\nwill be centrally concerned with those practices within societies by\nwhich individuals cooperate to produce goods for one another’s\nuse. Work is therefore a central concern of social justice. Questions\nof work and justice arise both with respect to the design of\ninstitutions and the choices of individuals.\n3.1 Distributive Justice\n\nMost accounts of justice assume that a large number of individuals\nwithin a given society will engage in paid work. A crucial moral\nquestion, then, is what individuals are entitled to with respect to\nboth the benefits and the harms of work. How, in other words, are the\ngoods and bads of work justly distributed?\n\nOne possible answer to this question is that each worker is entitled\nto whatever benefits their talents and abilities enable them to secure\nin a labor market governed purely by supply and demand. This answer\nentails that those whose talents or abilities are in high demand\nand/or short supply will command greater benefits from prospective\nemployers than those whose talents or abilities are in low demand\nand/or generously supplied (Boatright 2010). (This same logic would\napply to those who use their labor to produce goods for sale rather\nthan those in employment arrangements.)\n\nAfter the early decades of the twentieth century, many nations\nimplemented policies at odds with this ‘pure market’\nvision of work and labor. Most have wage regulations, for example,\nmandating a minimum level of pay. But the justice of minimum levels of\npay is disputed, with some theorists arguing that disallowing a person\nto sell her labor at a price she judges adequate infringes on her\npersonal liberty. According to many libertarian thinkers, our labor is\nan exercise of our bodies or our talents, each of which we own in a\nway akin to our ownership of private property. To disallow someone the\nright to sell their labor even at a very low cost thus infringes on\ntheir rights of self-ownership. (Mack 2002) The fairness of wage\ndifferentials is also disputed. Should wages track the economic value\nof a worker’s contributions or their effort, or are wages\nprimarily an incentive to encourage worker commitment and motivation?\n(Heath 2018, Moriarty 2020) Some theorists have proposed that\ninequalities in pay ought to be eliminated altogether (Örtenblad\n2021), while some supporters of an unconditional basic income, in\nwhich individuals receive regular payments regardless of their working\nstatus, see it an alternative way to ensure a sufficient minimum\nincome, one immune to workers becoming unemployed (van Parijs and\nVanderbroght 2017).\n\nDistributive justice also pertains to various protections against\nharms or wrongs associated with work. Again, most\nsocieties place legal limitations on various conditions of work. These\ninclude protections against overwork via limitations on the length of\nthe workday or workweek; bans on discrimination in hiring or promotion\nbased on race, gender, religion, or other social categories;\nassurances that workplace risks and dangers are mitigated; and, at a\nwider societal level, prohibitions aimed at ensuring that individuals\nlives are not dominated by work at particular life stages (bans on\nchild labor and provisions to make retirement possible). One important\nmoral question about these protections is whether workers should have\nthe right to bargain away some of these protections either for\nincreased pay (as when employees negotiate higher wages in exchange\nfor performing more dangerous jobs) or for enhancements in other\nprotections.\n3.2 Contributive and Productive Justice\n\nThe questions of distributive justice addressed in the previous\nsection concern what goods workers receive from work if they\nwork at all. But critical questions about justice also pertain to\nwhether workers are entitled to work and whether they are obligated to\ndo so. Work thus raises questions of contributive and\nproductive justice respectively.\n\nFor one, do workers have a right to work in the first place? The\nUniversal Declaration of Human Rights states as much, assuring each\nindividual “the right to work, to free employment, to just and\nfavorable conditions of work and to protection against\nunemployment.” (United Nations 1948, Article 23) A right to work\nwould presumably be more than a negative liberty, i.e., not simply a\nright that others not interfere with one’s attempts to work,\nsecure employment, etc., but a claim to be provided work if\none wishes (Schaff 2017). The right to work has been defended both for\nspecific populations (such as the disabled; see Kavka 1992) or for the\npopulace writ large (Tcherneva 2020). If there is such a right, it\nwill presumably be because work is an essential (or at least the\nprevailing) means for the acquisition of vital goods. Elster (1988)\nproposes a job guarantee on the grounds that work is essential to\nself-realization. Gomberg (2007) argues that work is a key social good\nbecause it is the primary path by which to make a socially validated\ncontribution to one’s wider community, a contribution that can\nprovide us recognition and a sense of meaning. Two crucial questions\nthat arise in connection with the putative right to work are (a)\nagainst whom is this right held, i.e., who must provide work if\nworkers have a right to it, or (b) whether work provided so as to\nhonour this right will in fact provide the goods on which the right to\nwork is based (e.g., the work provided under a government-provided job\nguarantee could prove unfulfilling).\n\nA right to work would mean that any person (or at least any adult) who\nwished to work would be able to do so. But do individuals have a right\nnot to work, or is work in any sense morally obligatory? The\nmost obvious basis for such an obligation appeals to notions of\nfair play or reciprocity: Individuals act wrongly when they\nfail to contribute to social enterprises from which they benefit, and\nsince the productive economy benefits most everyone in a society,\nindividuals have an obligation to contribute to the productive economy\nby working. (Becker 1980, White 2003) Opponents of this fair play\nrationale argue that the conditions for just reciprocal relations\nbetween societies and particular groups (e.g., the ghetto poor; see\nShelby 2012) do not obtain, thereby exempting members of such groups\nfrom the obligation to work, or that contemporary economic\ndevelopments fail to provide the background conditions for the\nobligation to apply (Cholbi 2018a). Other opponents of an obligation\nto work argue that it represents a violation of the state’s duty\nto treat citizens equally; citizens who are compelled to work are made\nto pursue a conception of the good life with which they may not agree,\nand a just state should treat citizens as equals by remaining neutral\namong rival conceptions of the good life (van Parijs 1991, Levine\n1995). An obligation to work would in effect amount to the\nstate’s endorsement of the ‘work ethic’ and the\nrejection of ways of life (e.g., being a beachcomber) that themselves\noppose the work ethic. Other opponents of a duty to work argue that\nrequiring individuals to work is likely to stand in the way of\nself-realization for particular people (Maskivker 2012).\n\nAnother possibility is that even if there is not a general obligation\nto work, we might be subject to limitations on our work-related\nliberties in order to satisfy demands of distributive justice. Many of\nthe goods provided by a just society, including education and health\ncare, are labor-intensive. But societies often face shortfalls of\nworkers in the very occupations that provide these goods. Some\nphilosophers have argued that the demands of distributive justice may\npermissibly constrain our work choices, and in fact, may license\ngovernments conscripting labor in order to secure workers to provide\nthese goods, on the model of the military draft during wartime.\n(Fabré 2008, Stanczyk 2012). Similar concerns arise concerning\nsocially necessary but undesirable ‘dirty’ work.(Walzer\n1983, Schmode 2019). Conversely, if justice can require individuals to\nperform certain kinds of work, this might speak against a right to\nstrike (Borman, 2017, Gourevitch 2018), particularly on the part of\nessential workers (Munoz 2014).\n\nHow one’s choice of work contributes to justice and the overall\ngood is a moral question that individuals face as well. Some jobs\n(hired assassin, for example) seem immoral as such. But to what\nextent, if any, are we obligated to choose careers or jobs that\npromote justice or the welfare of others? On the one hand, choice of\njobs and careers does not appear exempt from moral considerations,\ninasmuch as the work one performs affects others and society at large,\nand given the often dismal state of the world, perhaps we are\nobligated to choose jobs and careers for moral reasons rather than\nsolely on the basis of self-interest. Norman Care (1984:285) proposes\n“that in today’s world morality requires that service to\nothers be put before self-realization in the matter of career\nchoice.” In contrast, some philosophers who believe that\nindividuals (and not merely institutions) within a society are subject\nto demands of justice nevertheless accord individuals discretion in\ntheir choices of occupation. G.A. Cohen, for instance, asserts that we\nshould each enjoy a “personal prerogative” that allows us\nto be something more than an “engine for the welfare of other\npeople” or “slaves to social justice.” (2008:10) We\nmight likewise worry that requiring that our job or career choices be\noptimal from the standpoint of justice or social welfare is\nexcessively demanding in light of how such choices both reflect and\nshape our identities (Cholbi 2020).\n3.3 Equality and Workplace Governance\n\nIn recent years, egalitarian philosophers have begun to critique\ntypical workplace arrangements as antagonistic to requirements of\nequal relations among individuals in society. Particularly influential\nhere is Anderson’s suggestion that many workplaces amount to a\nform of “private government,” at least as authoritarian as\nmany forms of state government.\n\nImagine a government that assigns almost everyone a superior whom they\nmust obey. Although superiors give most inferiors a routine to follow,\nthere is no rule of law. Orders may be arbitrary and can change at any\ntime, without prior notice or opportunity to appeal. Superiors are\nunaccountable to those they order around. They are neither elected nor\nremovable by their inferiors. …The government does not\nrecognize a personal or private sphere or autonomy free from sanction.\nIt may prescribe a dress code and forbid certain hairstyles. Everyone\nlives under surveillance, to ensure that they are complying with\norders. …The economic system of the society run by this\ngovernment is communist. The government owns all the nonlabor means of\nproduction in the society it governs. It organizes production by means\nof central planning. The form of the government is a dictatorship\n(Anderson 2017: 37–38).\n\n\nThe ‘society’ Anderson invites us to imagine is of course\nthe contemporary workplace, at least as it stands in the United States\nand many other nations. Anderson and other relational\negalitarians view the relationships defined by the powers that\nemployers usually have over their employees as oppressive and unjust.\nWorkers are subject to employers’ ‘governance,’ but\nthis governance consists in employees being arbitrarily and\nunaccountably subject to the wills of employers. The relational\negalitarian thus concludes that workplaces, as presently constituted,\ndo not involve employees and employers relating as genuine equals. And\nwhile employees will generally have the right to exit employment\nrelationships, this may be little protection against oppression if\nmost workplaces are organized in the way Anderson illustrates.\n\nTo some degree, the inequalities to which Anderson points are products\nof labor law and policies specific to different nations. There are,\nhowever, ways of altering the relationships between employers and\nworkers so as to potentially prevent or address these (and other)\ninequalities.\n\nPerhaps the most familiar such method is unionization or\ncollective bargaining. Worker unions amplify the power of individual\nworkers in relation to their employers by compelling employers to\nnegotiate contracts with workers as a body. Unions may organize\nworkers within a particular profession, within many professions, or\nwithin a single workplace or firm. Societies vary considerably in the\ndegrees to which their workers are unionized and their labor laws\nfriendly to union formation and power. Unions are presumptively\njustified on the grounds that workers who consensually form or join\nunions are exercising their right to freely associate with others with\nwhom they share interests in order to promote those interests\n(Lindblom 2019), though if union membership is required in order to be\nemployed in a particular workplace or industry, unionization may\nviolate individuals right not to associate with others or to\nassociate with (in this instance, to enter into an employment\nrelationship) any party of their choosing (White 1998).Appealing to\n“republican liberty,” Mark Reiff (2020) has argued that\nunions should be viewed as a basic institution of society that\nprotects workers’ liberty from exploitation by employers. On\nReiff’s view, unionization should therefore be universal and\ncompulsory.\n\nOther methods for redressing the seemingly unequal and oppressive\nrelations between employers and employees involve breaking the\nmonopoly on decision making that management typically has within a\ngiven firm or employment arrangement. Typical workplaces are\nhierarchical rather than democratic. Many egalitarian critics of work\ncall for the workplace to be more democratized, with workers having a\ngreater say not only concerning their own working conditions but also\nconcerning decisions usually reserved for management. Advocates for\nworkplace democracy often argue that it is likely to be the most\neffective workplace organization in protecting workers’\ninterests. (González-Ricoy 2014). Others emphasize that the\nworkplace is a microcosm of larger society and hence serves as a\ntraining ground for the development of virtues needed to live in a\nlarger democratic society (Pateman 1970, Estlund 2003). But perhaps\nthe most basic argument for workplace democracy is that firms are\nanalogous to states, and so if the state ought to be governed\ndemocratically, so too should firms and other workplaces (Dahl 1986,\nMayer 2000, Landemore & Ferreras 2016). Workplace democracy would\nseem to render the workplace more just inasmuch as it makes\nworkers’ conditions a partial byproduct of their consent and a\nreflection of their autonomy (Schaff 2012).\n3.4 Gender, Care, And Emotional Labor\n\nWork’s role in justice is further complicated by the fact that\nwork is a highly gendered phenomenon in many societies. For one, women\ntypically perform much of the housekeeping and child care that\ntraditionally have not been recognized with monetary compensation.\nWithin the formal labor market, many societies have a wage gap wherein\nwomen are paid less than men for similar work, and there are\nsignificant differences in gender representations in different\nprofessions (traditionally, women highly represented in fields such as\nprimary school teaching, nursing, and social work, men highly\nrepresented in fields such as engineering and finance). Feminist\nphilosophers have detected in these differentials an undervaluation of\nthe kinds of work, particularly care work, that women have often\nperformed (Gurtler and Smith 2005) as well as a blind spot in\nphilosophical theorizing about justice wherein\n‘relational’ goods that matter to our life prospects but\nare usually not provided via market exchange are ignored (Gheaus\n2009). One intricate set of issues here is understanding the\nunderlying relations of cause and effect: Are women in societies with\nsexist norms pushed toward low pay or low prestige jobs because they\nare women, or are these low pay or low prestige jobs because women\ntend to perform them (or both)? In a similar vein, we may wonder how\nnorms of gender intersect with the gendered division of labor\n(whether, for example, the stereotype that women are more eager to\ncare for children feeds the gendered division of labor or whether the\ngendered division of labor reinforces that stereotype, or both).\n\nThe gendered division of labor is open to objections of different\nkinds: On the one hand, it appears to result in distributions of\nwork-related goods (such as income, free time, etc.) in which women\nare systematically shortchanged. In addition, the gendered division of\nlabor may be unjust because it contributes to hierarchies between the\ngenders that render them unequal. (Hartley and Watson 2018) Schouten\n(2019) argues that, although many individuals embrace traditional\ngender norms and the gendered division of labor these entail, those\nwho instead favour gender-egalitarian ways of life have a reasonable\nground to complain when societies create institutions and policies\nthat support expectations — the gendered division of labor chief\namong these — that serve as impediments to such ways of life.\nAccording to Schouten then, a just society will regulate work time,\nfamily leave, and dependent care so as to foster gender-egalitarian\nways of life and a non-gendered division of labor. (See also Wright\nand Brighouse 2008, Gheaus 2012.)\n\nA further strand in feminist thought about work arises from\nHochschild’s scholarship (2012) on emotional labor.\nSome work involves intensive monitoring or management of one’s\nown emotions in order to engage or manipulate the emotions of others.\nAlthough Hochschild offers examples of such emotional labor undertaken\nboth by women and men, some professions in which women predominate are\nsaturated with emotional labor. Hochschild notes that female flight\nattendants, for instance, are subject to a wide array of emotional\nexpectations vis-à-vis air travellers (smiling, friendly\nbanter, interest in travellers’ destinations or professions,\netc.). Scholars have highlighted a number of ethically salient\nfeatures of emotional labor (see Barry, Olekalns, and Rees 2019 for a\nuseful overview), but the phenomenon has been subject to little\nsystematic philosophical analysis. Hochschild primarily emphasizes the\ndetrimental effects of emotional labor on workers themselves, arguing\nthat it can estrange workers from their own emotions and lead to\nstruggles to identify or express authentic emotion both within and\noutside the workplace. Furthermore, when emotional labor results in\nemployees’ “surface acting,” that is, displaying\nemotions at odds with their own internal feelings, employees’\nhealth suffers. Other ethical concerns are more interpersonal —\nfor example, that emotional labor is deceptive or lacks integrity.\nBarry, Olekalns, and Rees (2019) offer a useful starting point by\nnoting that emotional labor raises the prospect of conflicts between\nworkers’ rights and the rights of their employers, between\nworkers’ rights and workers’ duties, and between employer\nrights and employer duties.\n4. Work and its Future\n\nA number of social commentators have predicted that economic and\ntechnological trends will soon culminate in societies become\nincreasingly ‘post-work,’ that is, far fewer individuals\nwill engage in paid work, work hours will dramatically decrease, and\nwork will have a far smaller role among individuals’ values or\nconcerns.(Frey and Osborne 2013, Thompson 2015, Brynjolofsson and\nMcAfee 2014). Whether this prospect should be welcomed or avoided\ndepends to a large extent on issues addressed earlier in this article:\nhow good work in fact is, whether there are other avenues for\nattaining the goods associated with work, etc.\n\nSome welcome a post-work future as liberating (Livingston 2016,\nChamberlain 2018, James 2018, Danaher 2019), arguing that diminutions\nin the centrality of work will afford us greater leisure, freedom, or\ncommunity, especially if activities such as play or the appreciation\nof the natural worlds supplant work. Others worry that the decline of\nwork will deprive us of a central arena in which to realize goods\ncentral to our natures (Deranty 2015) or will instigate high levels of\ninequality or economic distress (Frase 2016). Others express concern\nabout individuals’ ability to psychologically transition from a\nwork-centred to a work-optional society (Cholbi 2018b).\n5. Conclusion\n\nWork and labor bear intrinsic philosophical interest. But their\ncentrality to the human condition also entail that work and labor\nintersect with still broader philosophical questions about the human\ngood and the just organization of human societies. Ongoing and\nanticipated changes to the world of work should provide rich fodder\nfor philosophical inquiry in coming decades. Philosophy is likely to\nhave a special role to play in addressing what Appiah (2021:7) has\ncalled the “hard problem,” to determine “how to\nproduce the goods and services we need, while providing people with\nincome, sociability, and significance.”\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adorno, Theodor, 2001. <em>“</em>Free Time,” in J.M.\nBernstein (ed.), <em>The Culture Industry: Selected Essays on\nMass Culture</em>, London:Routledge, pp. 187–198.",
                "Anderson, Elizabeth, 2017. <em>Private Government: How Employers\nRule Our Lives (and Why We Don’t Talk About It)</em>, Princeton:\nPrinceton University Press.",
                "Appiah, Kwame Anthony, 2021. “The Philosophy of Work,”\nin D. Sobel, P. Vallentyne, and S. Wall (eds.), <em>Oxford Studies in\nPolitical Philosophy</em> (Volume 7), Oxford: Oxford University Press,\npp. 1–22.",
                "Applebaum, Herbert, 1992. <em>The Concept of Work: Ancient,\nMedieval, and Modern</em>, Albany: State University of New York\nPress.",
                "Arendt, Hannah, 1958. <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.",
                "Barry, Bruce, Olekalns, Mara, and Rees, Laura, 2019. “An\nEthical Analysis of Emotional Labor,” <em>Journal of Business\nEthics</em>, 160: 17–34.",
                "Beadle, Ron, and Knight, Kelvin, 2012. “Virtue and\nMeaningful Work,” <em>Business Ethics Quarterly</em>, 22:\n433–450.",
                "Becker, Lawrence C., 1980. “The Obligation to Work,”\n<em>Ethics</em>, 91: 35–49",
                "Black, Bob, 1985. “The Abolition of Work,” in <em>The\nAbolition of Work and Other Essays</em>, Port Townsend: Loompanics\nUnlimited, pp. 17–34.",
                "Boatright, J.R., 2010, “Executive Compensation: Unjust or\nJust Right?,” in G.G. Brenkert &amp; T. L. Beauchamp (eds.),\n<em>Oxford Handbook of Business Ethics</em>, New York: Oxford\nUniversity Press, pp. 161–201.",
                "Borman, D.A., 2017. “Contractualism and the Right to\nStrike,” <em>Res Publica</em>, 23: 81–98.",
                "Bowie, Norman E., 1998. “A Kantian Theory of Meaningful\nWork,” <em>Journal of Business Ethics</em>, 17:\n1083–1092.",
                "Breen, Keith, 2007 “Work and Emancipatory Practice: Towards\na Recovery of Human Beings’ Productive Capacities,”\n<em>Res Publica</em>, 13: 381–414.",
                "Brudney, Daniel, 1998. <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.",
                "Brynjolfsson, Erik and McAfee, Andrew, 2014. <em>The Second\nMachine Age: Work, Progress, and Prosperity in a Time of Brilliant\nTechnologies</em>, New York: Norton.",
                "Budd, John W., 2011. <em>The Thought of Work</em>, Ithaca, NY:\nCornell University Press.",
                "Calvo, E., Mair, C.A., &amp; Sarkisian, N., 2015.\n“Individual Troubles, Shared Troubles: The Multiplicative Effect\nof Individual and Country-level Unemployment on Life Satisfaction in\n95 Nations (1981–2009),” <em>Social Forces</em>, 93:\n1625–53.",
                "Care, Norman S., 1984. “Career Choice,”\n<em>Ethics</em>, 94: 283–302.",
                "Chamberlain, James A., 2018. <em>Undoing Work, Rethinking\nCommunity</em>, Ithaca, NY: Cornell University Press.",
                "Cholbi, Michael, 2018a. “The Duty to Work,”\n<em>Ethical Theory and Moral Practice</em>, 21: 1119–1133.",
                "–––, 2018b. “The Desire to Work as an\nAdaptive Preference,” <em>Autonomy</em>, 04 (July).\n [<a href=\"http://autonomy.work/wp-content/uploads/2018/08/The-Desire-For-Work-As-An-Adaptive-Preference-V3.pdf\" target=\"other\">Cholbi 2018b available online</a>]",
                "–––, 2020. “The Ethics of Choosing Jobs\nand Careers,” in B. Fischer (ed.), <em>College Ethics</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press, pp.\n878–889.",
                "Clark, Samuel, 2017. “Good Work,” <em>Journal of\nApplied Philosophy</em>, 34: 61–73.",
                "Cohen, G.A., 2008. <em>Rescuing Justice and Equality</em>,\nCambridge, MA: Harvard University Press.",
                "Dahl, Robert A., 1986. <em>A Preface to Economic Democracy</em>,\nBerkeley: University of California Press.",
                "Danaher, John, 2019. <em>Automation and Utopia: Human Flourishing\nin a World Without Work</em>, Cambridge, MA: Harvard University\nPress.",
                "Davis, Joseph E., 2003. “The Commodification of Self,”\n<em>Hedgehog Review</em>, Summer\n [<a href=\"https://hedgehogreview.com/issues/the-commodification-of-everything/articles/the-commodification-of-self\">Davis 2003 available online</a>].",
                "De Botton, Alain, 2010. <em>The Pleasures and Sorrows of\nWork</em>, New York: Penguin.",
                "Deranty, Jean-Philippe, 2015. “Historical Objections to the\nCentrality of Work,” <em>Constellations</em>, 22:\n105–121.",
                "Elster, Jon, 1988. “Is There (or Should There Be) a Right to\nWork?,” in A. Gutmann (ed.), <em>Democracy and the Welfare\nState</em>, Princeton: Princeton University Press, pp.\n53–78.",
                "–––, 1989. “Self-realisation in Work and\nPolitics,” in J. Elster and K.O. Moene (eds.), <em>Alternatives\nto Capitalism</em>, Cambridge: Cambridge University Press, pp.\n127–158.",
                "Estlund, Cynthia, 2003. <em>Working Together: How Workplace Bonds\nStrengthen a Diverse Democracy</em>, New York: Oxford University\nPress.",
                "Fabré, Cecile, 2008. <em>Whose Body Is It?: Justice and the\nIntegrity of the Person</em>, Oxford: Oxford University Press.",
                "Frase, Peter, 2016. <em>Four Futures: Life After Capitalism</em>,\nLondon: Verso.",
                "Frayne, David, 2015. <em>The Refusal of Work: The Theory and\nPractice of Resistance to Work</em>, London: Zed.",
                "Gheaus, Anca, 2009. “The Challenge of Care to Idealizing\nTheories of Distributive Justice,” in L. Tessman (ed.),\n<em>Feminist Ethics and Social and Political Philosophy: Theorizing\nthe Non-Ideal</em>, Dordrecht: Springer, pp. 105–119.",
                "–––, 2012. “Gender Justice,”\n<em>Journal of Ethics and Social Philosophy</em>, 6: 1–24.",
                "Gheaus, Anca, and Herzog, Lisa. 2016. “The Goods of Work\n(Other Than Money!),” <em>Journal of Social Philosophy</em>, 47:\n70–89.",
                "Gilabert, Pablo, 2018. “Dignity at Work,” in H.\nCollins, G. Lester, and V. Mantouvalou (eds.), <em>Philosophical\nFoundations of Labour Law</em>, Oxford: Oxford University Press, pp.\n68–86.",
                "Gomberg, Paul, 2007. <em>How to Make Opportunity Equal: Race and\nContributive Justice</em>, Oxford: Blackwell.",
                "González-Ricoy, Iñigo, 2014. “The Republican\nCase for Workplace Democracy,” <em>Social Theory and\nPractice</em>, 40: 232–254.",
                "Gorz, Andre, 2010. <em>Critique of Economic Reason</em>, London:\nVerso.",
                "Gourevitch, Alex, 2018. “The Right to Strike: A Radical\nView,” <em>American Political Science Review</em>, 112:\n905–917.",
                "Graeber, David, 2018. <em>Bullshit Jobs: A Theory</em>, New York:\nSimon and Schuster.",
                "Gurtler, Sabine, and Smith, Andrew F., 2005. “The Ethical\nDimension of Work: A Feminist Perspective,” <em>Hypatia</em>,\n20: 119–134.",
                "Haney, Mitchell R., and Kline, A. David, 2010. <em>The Value of\nTime and Leisure in a World of Work</em>, Lanham, MD: Lexington\nBooks.",
                "Hartley, Christie and Watson, Lori, 2018. <em>Equal Citizenship\nand Public Reason: A Feminist Political Liberalism</em>, New York:\nOxford University Press.",
                "Heath, Joseph, 2018. “On the Very Idea of a Just\nWage,” <em>Erasmus Journal for Philosophy and Economics</em>,\n11: 1–33.",
                "Helliwell, J., Layard, R., &amp; Sachs, J., 2017. “World\nHappiness Report 2017,” New York: Sustainable Development\nSolutions Network.",
                "Hochschild, Arlie, 2012. <em>The Managed Heart: Commercialization\nof Human Feeling</em>, Berkeley: University of California Press.",
                "Holmes, Thomas, and Rahe Richard, 1967. “The Social\nReadjustment Rating Scale,” <em>Journal of Psychosomatic\nResearch</em>, 11: 213–18.",
                "Hussain, Waheed, 2020. “Pitting People Against Each\nOther,” <em>Philosophy and Public Affairs</em>, 48:\n79–111.",
                "International Labour Organization, 2019. <em>Small Matters. Global\nEvidence on the Contribution to Employment by the Self-employed,\nMicro-enterprises and SMEs</em>, Geneva: ILO.",
                "James, Aaron, 2018. <em>Surfing with Sartre: An Aquatic Inquiry\ninto the Life of Meaning</em>, New York: Penguin/Random House.",
                "Kandiyali, Jan, 2020. “The Importance of Others: Marx on\nUnalienated Production,” <em>Ethics</em>, 130:\n555–587.",
                "Lis, Catharina, and Soly, Hugo, 2012. <em>Worthy Efforts:\nAttitudes to Work and Workers in Pre-Industrial Europe</em>, Leiden:\nBrill.",
                "Kavka, Gregory, 1992. “Disability and the Right to\nWork,” <em>Social Philosophy and Policy</em>, 9:\n262–280.",
                "Keynes, John Maynard, 1930. “Economic Possibilities for Our\nGrandchildren,” in <em>Essays in Persuasion</em>, New York: W.W.\nNorton and Co., 1963, pp. 358–373.",
                "King, M.L., 2011. “All Labour Has Dignity,” M.K. Honey\n(ed.), Boston: Beacon Press.",
                "Komlosy, Andrea, 2018. <em>Work: The Last 1,000 Years</em>,\nLondon: Verso.",
                "Levine, Andrew, 1995. “Fairness to Idleness: Is There a\nRight Not to Work?,” <em>Economics and Philosophy</em>, 11:\n255–274.",
                "Lafargue, Paul, 1883. “The Right to Be Lazy,” in C.H.\nKerr, trans., <em>The Right to Be Lazy and Other Studies</em>,\nChicago: Charles H. Kerr &amp; Co., 1907, pp. 3–62.",
                "Landemore, Hélène and Ferreras, Isabelle, 2016.\n“In Defense of Workplace Democracy: Towards a Justification of\nthe Firm–State Analogy,” <em>Political Theory</em>, 44:\n53–81.",
                "Lindblom, Lars, 2019. “Consent, Contestability, and\nUnions,” <em>Business Ethics Quarterly</em>, 29:\n189–211.",
                "Livingston, James, 2016. <em>No More Work: Why Full Employment is\na Bad Idea</em>, Chapel Hill: University of North Carolina Press.",
                "MacIntyre, Alasdair, 1984. <em>After Virtue: A Study in Moral\nTheory</em>, 2<sup>nd</sup> edition, Notre Dame: University of Notre\nDame Press.",
                "Mack, Eric, 2002. “Self-Ownership, Marxism, and\nEgalitarianism: Part I: Challenges to Historical Entitlement,”\n<em>Politics, Philosophy, and Economics</em>, 1: 75–108.",
                "Malesic, Jonathan, 2017. “Parenting is Not a\n‘Job,’ and Marriage is Not ‘Work,’”\n<em>New Republic</em>, 9 Aug 2017\n [<a href=\"https://newrepublic.com/article/144254/parenting-not-job-marriage-not-work\" target=\"other\">Malesic 2017 available online</a>].",
                "Malmqvist, Erik, 2019 “’Paid to Endure’: Paid\nResearch Participation, Passivity, and the Goods of Work,\n”<em>American Journal of Bioethics</em>, 19: 11–20 .",
                "Margerison-Zilko, C., Goldman-Mellor, S., Falconi A., &amp;\nDowing, J., 2016. “Health Impacts of the Great Recession: A\nCritical Review,” <em>Current Epidemiology Reports</em>, 3:\n81–91.",
                "Marx, Karl, 1844. <em>Economic and Philosophic Manuscripts of\n1844</em>, Martin Milligan (trans. and ed.), Mineola, NY: Dover.",
                "Maskivker, Julia, 2012. <em>Self-Realization and Justice: A\nLiberal-Perfectionist Defense of the Right to Freedom from\nEmployment</em>, New York: Routledge.",
                "Mayer, Robert, 2000. “Is there a Moral Right to Workplace\nDemocracy?” <em>Social Theory and Practice</em>, 26:\n301–325.",
                "Michaelson, Christopher, 2021. “A Normative Meaning of\nMeaningful Work,” <em>Journal of Business Ethics</em>, 170:\n413–428.",
                "Moriarty, Jeffrey, 2009. “Rawls, Self-Respect, and the\nOpportunity for Meaningful Work,” <em>Social Theory and\nPractice</em>, 35: 441–459.",
                "–––, 2020. “What’s in a Wage? A New\nApproach to the Justification of Pay,” <em>Business Ethics\nQuarterly</em>, 30: 119–137.",
                "Morris, William, 1884. “Useful Work Versus Useless\nToil,” in <em>Collected Works of William Morris</em>, Cambridge:\nCambridge University Press, 2012, pp. 98–120.",
                "Muñoz, Cristian Pérez, 2014. “Essential\nServices, Workers’ Freedom, and Distributive Justice,”\n<em>Social Theory and Practice</em>, 40: 649–672.",
                "Muirhead, Russell, 2007. <em>Just Work</em>, Cambridge, MA:\nHarvard University Press.",
                "Nguyen, C. Thi, 2019. “Games and the Art of Agency,”\n<em>Philosophical Review</em>, 128: 423–462",
                "O’Connor, Brian, 2018. <em>Idleness: A Philosophical\nEssay</em>, Princeton: Princeton University Press.",
                "Örtenblad, A., 2021. <em>Debating Equal Pay for All: Economy,\nPracticability, and Ethics</em>, London: Palgrave Macmillan.",
                "Pateman, Carole, 1970. <em>Participation and Democratic\nTheory</em>, Cambridge: Cambridge University Press.",
                "Pieper, Josef, 1952. <em>Leisure, the Basis of Culture</em>, A.\nDru, (trans.), London: Faber and Faber.",
                "Pence, Gregory, 2001. “Towards a Theory of Work,” in\nSchaff (ed.) 2001, pp. 93–106.",
                "Reiff, Mark, 2020. <em>In the Name of Liberty: The Argument for\nUniversal Unionization</em>, Cambridge: Cambridge University\nPress.",
                "Rawls, John, 1996. <em>Political Liberalism</em>, New York:\nColumbia University Press.",
                "Rose, Julie, 2016. <em>Free Time</em>, Princeton: Princeton\nUniversity Press.",
                "Russell, Bertrand, 1932. “In Praise of Idleness,”\n<em>Harper’s Magazine</em>, October 1932.\n [<a href=\"https://harpers.org/archive/1932/10/in-praise-of-idleness/\" target=\"other\">Russell 1932 available online</a>]",
                "Sage, Daniel, 2019. “Unemployment, Wellbeing and the Power\nof the Work Ethic: Implications for Social Policy,” <em>Critical\nSocial Policy</em>, 39: 205–228.",
                "Sayers, Sean, 2005. “Why Work? Marx and Human Nature,”\n<em>Science and Society</em>, 69: 606–616.",
                "Schaff, Kory, 2001. <em>Philosophy and the Problems of Work: A\nReader</em>, Lanham, MD: Rowman and Littlefield.",
                "–––, 2012. “Democratic Rights in the\nWorkplace,” <em>Inquiry</em>, 55: 386–404.",
                "–––, 2017. “A Right to Work and Fair\nConditions of Employment,” in K.P. Schaff (ed.), <em>Fair Work:\nEthics, Social Policy, Globalization</em>, London: Rowman and\nLittlefield, pp. 41–56.",
                "Schmode, Frauke, 2019. “What Difference Does It Make? UBI\nand the Problem of Bad Work,” in M. Cholbi and M.E. Weber\n(eds.), <em>The Future of Work, Technology, and Basic Income</em>, New\nYork: Routledge, pp. 151–170.",
                "Schwartz, Adina, 1982. “Meaningful Work,”\n<em>Ethics</em>, 92: 634–646.",
                "Schwartz, Barry, 2015. <em>Why We Work</em>, Simon and Schuster:\nNew York.",
                "Shelby, Tommie, 2012. “Justice, Work, and the Ghetto\nPoor,” <em>The Law and Ethics of Human Rights</em>, 6 December\n2012. doi:10.1515/1938-2545.1068",
                "Smith, Adam, 1776 [1976], <em>An Inquiry into the Nature and\nCauses of the Wealth of Nations</em>, E. Cannon (ed.), Chicago:\nUniversity of Chicago Press",
                "Stanczyk, Lucas, 2012. “Productive Justice,”\n<em>Philosophy and Public Affairs</em>, 40: 144–164.",
                "Suzman, James, 2021. <em>Work: A History of How We Spend Our\nTime</em>, London:Bloomsbury.",
                "Svendsen, Lars Fredrik, 2015. <em>Work</em>, 2<sup>nd</sup>\nedition, London: Routledge.",
                "Tcherneva, Pavlina R., 2020. <em>The Case for a Job\nGuarantee</em>, New York: John Wiley &amp; Sons.",
                "Thompson, Derek, 2015. “A World Without Work,” <em>The\nAtlantic</em>, July-August 2015.\n [<a href=\"https://www.theatlantic.com/magazine/archive/2015/07/world-without-work/395294/\" target=\"other\">Thompson 2015 available online</a>]",
                "United Nations, 1948. <em>Universal Declaration of Human\nRights</em>.\n [<a href=\"https://www.un.org/en/about-us/universal-declaration-of-human-rights\" target=\"other\">available online</a>]",
                "Van Parijs, Philipe, 1991. “Why Surfers Should Be Fed: The\nLiberal Case for an Unconditional Basic Income,” <em>Philosophy\n&amp; Public Affairs</em>, 20: 101–131.",
                "Van Parijs, Phillipe, and Vanderbroght, Yannick, 2017. <em>Basic\nIncome: A Radical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.",
                "Veltman, Andrea, 2016. <em>Meaningful Work</em>, Oxford: Oxford\nUniversity Press.",
                "Walzer, Michael, 1983. <em>Spheres of Justice: A Defense of\nPluralism and Equality</em>, New York: Basic Books.",
                "Washington, Booker T., 1901. <em>Up From Slavery: An\nAutobiography</em>, New York: Doubleday.",
                "Weber, Max, 1904–05. <em>The Protestant Ethic and the Spirit\nof Capitalism</em>, translation of <em>Die protestantische Ethik und\nder Geist des Kapitalismus</em>, T. Parsons (trans.), New York:\nCharles Scribner’s Sons, 1930.",
                "Weeks, Kathi, 2011. <em>The Problem with Work:</em>, <em>Feminism,\nMarxism, Antiwork Politics, and Postwork Imaginaries</em>, Durham:\nDuke University Press.",
                "White, Stuart, 1998. “Trade Unionism in a Liberal\nState,” in A. Gutmann (ed.), <em>Freedom of Association</em>,\nPrinceton: Princeton University Press, pp. 330–356.",
                "–––, 2003. <em>The Civic Minimum: On the Rights\nand Obligations of Economic Citizenship</em>, Oxford: Oxford\nUniversity Press.",
                "Wright, Erik Olin, and Brighouse, Harrry, 2008. “Strong\nGender Egalitarianism,” <em>Politics and Society</em>, 36:\n360–372.",
                "Yeoman, Ruth, 2014. “Conceptualizing Meaningful Work as a\nFundamental Human Need,” <em>Journal of Business Ethics</em>,\n124: 235–251."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adorno, Theodor, 2001. <em>“</em>Free Time,” in J.M.\nBernstein (ed.), <em>The Culture Industry: Selected Essays on\nMass Culture</em>, London:Routledge, pp. 187–198.</li>\n<li>Anderson, Elizabeth, 2017. <em>Private Government: How Employers\nRule Our Lives (and Why We Don’t Talk About It)</em>, Princeton:\nPrinceton University Press.</li>\n<li>Appiah, Kwame Anthony, 2021. “The Philosophy of Work,”\nin D. Sobel, P. Vallentyne, and S. Wall (eds.), <em>Oxford Studies in\nPolitical Philosophy</em> (Volume 7), Oxford: Oxford University Press,\npp. 1–22.</li>\n<li>Applebaum, Herbert, 1992. <em>The Concept of Work: Ancient,\nMedieval, and Modern</em>, Albany: State University of New York\nPress.</li>\n<li>Arendt, Hannah, 1958. <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Barry, Bruce, Olekalns, Mara, and Rees, Laura, 2019. “An\nEthical Analysis of Emotional Labor,” <em>Journal of Business\nEthics</em>, 160: 17–34.</li>\n<li>Beadle, Ron, and Knight, Kelvin, 2012. “Virtue and\nMeaningful Work,” <em>Business Ethics Quarterly</em>, 22:\n433–450.</li>\n<li>Becker, Lawrence C., 1980. “The Obligation to Work,”\n<em>Ethics</em>, 91: 35–49</li>\n<li>Black, Bob, 1985. “The Abolition of Work,” in <em>The\nAbolition of Work and Other Essays</em>, Port Townsend: Loompanics\nUnlimited, pp. 17–34.</li>\n<li>Boatright, J.R., 2010, “Executive Compensation: Unjust or\nJust Right?,” in G.G. Brenkert &amp; T. L. Beauchamp (eds.),\n<em>Oxford Handbook of Business Ethics</em>, New York: Oxford\nUniversity Press, pp. 161–201.</li>\n<li>Borman, D.A., 2017. “Contractualism and the Right to\nStrike,” <em>Res Publica</em>, 23: 81–98.</li>\n<li>Bowie, Norman E., 1998. “A Kantian Theory of Meaningful\nWork,” <em>Journal of Business Ethics</em>, 17:\n1083–1092.</li>\n<li>Breen, Keith, 2007 “Work and Emancipatory Practice: Towards\na Recovery of Human Beings’ Productive Capacities,”\n<em>Res Publica</em>, 13: 381–414.</li>\n<li>Brudney, Daniel, 1998. <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Brynjolfsson, Erik and McAfee, Andrew, 2014. <em>The Second\nMachine Age: Work, Progress, and Prosperity in a Time of Brilliant\nTechnologies</em>, New York: Norton.</li>\n<li>Budd, John W., 2011. <em>The Thought of Work</em>, Ithaca, NY:\nCornell University Press.</li>\n<li>Calvo, E., Mair, C.A., &amp; Sarkisian, N., 2015.\n“Individual Troubles, Shared Troubles: The Multiplicative Effect\nof Individual and Country-level Unemployment on Life Satisfaction in\n95 Nations (1981–2009),” <em>Social Forces</em>, 93:\n1625–53.</li>\n<li>Care, Norman S., 1984. “Career Choice,”\n<em>Ethics</em>, 94: 283–302.</li>\n<li>Chamberlain, James A., 2018. <em>Undoing Work, Rethinking\nCommunity</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Cholbi, Michael, 2018a. “The Duty to Work,”\n<em>Ethical Theory and Moral Practice</em>, 21: 1119–1133.</li>\n<li>–––, 2018b. “The Desire to Work as an\nAdaptive Preference,” <em>Autonomy</em>, 04 (July).\n [<a href=\"http://autonomy.work/wp-content/uploads/2018/08/The-Desire-For-Work-As-An-Adaptive-Preference-V3.pdf\" target=\"other\">Cholbi 2018b available online</a>]</li>\n<li>–––, 2020. “The Ethics of Choosing Jobs\nand Careers,” in B. Fischer (ed.), <em>College Ethics</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press, pp.\n878–889.</li>\n<li>Clark, Samuel, 2017. “Good Work,” <em>Journal of\nApplied Philosophy</em>, 34: 61–73.</li>\n<li>Cohen, G.A., 2008. <em>Rescuing Justice and Equality</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Dahl, Robert A., 1986. <em>A Preface to Economic Democracy</em>,\nBerkeley: University of California Press.</li>\n<li>Danaher, John, 2019. <em>Automation and Utopia: Human Flourishing\nin a World Without Work</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Davis, Joseph E., 2003. “The Commodification of Self,”\n<em>Hedgehog Review</em>, Summer\n [<a href=\"https://hedgehogreview.com/issues/the-commodification-of-everything/articles/the-commodification-of-self\">Davis 2003 available online</a>].</li>\n<li>De Botton, Alain, 2010. <em>The Pleasures and Sorrows of\nWork</em>, New York: Penguin.</li>\n<li>Deranty, Jean-Philippe, 2015. “Historical Objections to the\nCentrality of Work,” <em>Constellations</em>, 22:\n105–121.</li>\n<li>Elster, Jon, 1988. “Is There (or Should There Be) a Right to\nWork?,” in A. Gutmann (ed.), <em>Democracy and the Welfare\nState</em>, Princeton: Princeton University Press, pp.\n53–78.</li>\n<li>–––, 1989. “Self-realisation in Work and\nPolitics,” in J. Elster and K.O. Moene (eds.), <em>Alternatives\nto Capitalism</em>, Cambridge: Cambridge University Press, pp.\n127–158.</li>\n<li>Estlund, Cynthia, 2003. <em>Working Together: How Workplace Bonds\nStrengthen a Diverse Democracy</em>, New York: Oxford University\nPress.</li>\n<li>Fabré, Cecile, 2008. <em>Whose Body Is It?: Justice and the\nIntegrity of the Person</em>, Oxford: Oxford University Press.</li>\n<li>Frase, Peter, 2016. <em>Four Futures: Life After Capitalism</em>,\nLondon: Verso.</li>\n<li>Frayne, David, 2015. <em>The Refusal of Work: The Theory and\nPractice of Resistance to Work</em>, London: Zed.</li>\n<li>Gheaus, Anca, 2009. “The Challenge of Care to Idealizing\nTheories of Distributive Justice,” in L. Tessman (ed.),\n<em>Feminist Ethics and Social and Political Philosophy: Theorizing\nthe Non-Ideal</em>, Dordrecht: Springer, pp. 105–119.</li>\n<li>–––, 2012. “Gender Justice,”\n<em>Journal of Ethics and Social Philosophy</em>, 6: 1–24.</li>\n<li>Gheaus, Anca, and Herzog, Lisa. 2016. “The Goods of Work\n(Other Than Money!),” <em>Journal of Social Philosophy</em>, 47:\n70–89.</li>\n<li>Gilabert, Pablo, 2018. “Dignity at Work,” in H.\nCollins, G. Lester, and V. Mantouvalou (eds.), <em>Philosophical\nFoundations of Labour Law</em>, Oxford: Oxford University Press, pp.\n68–86.</li>\n<li>Gomberg, Paul, 2007. <em>How to Make Opportunity Equal: Race and\nContributive Justice</em>, Oxford: Blackwell.</li>\n<li>González-Ricoy, Iñigo, 2014. “The Republican\nCase for Workplace Democracy,” <em>Social Theory and\nPractice</em>, 40: 232–254.</li>\n<li>Gorz, Andre, 2010. <em>Critique of Economic Reason</em>, London:\nVerso.</li>\n<li>Gourevitch, Alex, 2018. “The Right to Strike: A Radical\nView,” <em>American Political Science Review</em>, 112:\n905–917.</li>\n<li>Graeber, David, 2018. <em>Bullshit Jobs: A Theory</em>, New York:\nSimon and Schuster.</li>\n<li>Gurtler, Sabine, and Smith, Andrew F., 2005. “The Ethical\nDimension of Work: A Feminist Perspective,” <em>Hypatia</em>,\n20: 119–134.</li>\n<li>Haney, Mitchell R., and Kline, A. David, 2010. <em>The Value of\nTime and Leisure in a World of Work</em>, Lanham, MD: Lexington\nBooks.</li>\n<li>Hartley, Christie and Watson, Lori, 2018. <em>Equal Citizenship\nand Public Reason: A Feminist Political Liberalism</em>, New York:\nOxford University Press.</li>\n<li>Heath, Joseph, 2018. “On the Very Idea of a Just\nWage,” <em>Erasmus Journal for Philosophy and Economics</em>,\n11: 1–33.</li>\n<li>Helliwell, J., Layard, R., &amp; Sachs, J., 2017. “World\nHappiness Report 2017,” New York: Sustainable Development\nSolutions Network.</li>\n<li>Hochschild, Arlie, 2012. <em>The Managed Heart: Commercialization\nof Human Feeling</em>, Berkeley: University of California Press.</li>\n<li>Holmes, Thomas, and Rahe Richard, 1967. “The Social\nReadjustment Rating Scale,” <em>Journal of Psychosomatic\nResearch</em>, 11: 213–18.</li>\n<li>Hussain, Waheed, 2020. “Pitting People Against Each\nOther,” <em>Philosophy and Public Affairs</em>, 48:\n79–111.</li>\n<li>International Labour Organization, 2019. <em>Small Matters. Global\nEvidence on the Contribution to Employment by the Self-employed,\nMicro-enterprises and SMEs</em>, Geneva: ILO.</li>\n<li>James, Aaron, 2018. <em>Surfing with Sartre: An Aquatic Inquiry\ninto the Life of Meaning</em>, New York: Penguin/Random House.</li>\n<li>Kandiyali, Jan, 2020. “The Importance of Others: Marx on\nUnalienated Production,” <em>Ethics</em>, 130:\n555–587.</li>\n<li>Lis, Catharina, and Soly, Hugo, 2012. <em>Worthy Efforts:\nAttitudes to Work and Workers in Pre-Industrial Europe</em>, Leiden:\nBrill.</li>\n<li>Kavka, Gregory, 1992. “Disability and the Right to\nWork,” <em>Social Philosophy and Policy</em>, 9:\n262–280.</li>\n<li>Keynes, John Maynard, 1930. “Economic Possibilities for Our\nGrandchildren,” in <em>Essays in Persuasion</em>, New York: W.W.\nNorton and Co., 1963, pp. 358–373.</li>\n<li>King, M.L., 2011. “All Labour Has Dignity,” M.K. Honey\n(ed.), Boston: Beacon Press.</li>\n<li>Komlosy, Andrea, 2018. <em>Work: The Last 1,000 Years</em>,\nLondon: Verso.</li>\n<li>Levine, Andrew, 1995. “Fairness to Idleness: Is There a\nRight Not to Work?,” <em>Economics and Philosophy</em>, 11:\n255–274.</li>\n<li>Lafargue, Paul, 1883. “The Right to Be Lazy,” in C.H.\nKerr, trans., <em>The Right to Be Lazy and Other Studies</em>,\nChicago: Charles H. Kerr &amp; Co., 1907, pp. 3–62.</li>\n<li>Landemore, Hélène and Ferreras, Isabelle, 2016.\n“In Defense of Workplace Democracy: Towards a Justification of\nthe Firm–State Analogy,” <em>Political Theory</em>, 44:\n53–81.</li>\n<li>Lindblom, Lars, 2019. “Consent, Contestability, and\nUnions,” <em>Business Ethics Quarterly</em>, 29:\n189–211.</li>\n<li>Livingston, James, 2016. <em>No More Work: Why Full Employment is\na Bad Idea</em>, Chapel Hill: University of North Carolina Press.</li>\n<li>MacIntyre, Alasdair, 1984. <em>After Virtue: A Study in Moral\nTheory</em>, 2<sup>nd</sup> edition, Notre Dame: University of Notre\nDame Press.</li>\n<li>Mack, Eric, 2002. “Self-Ownership, Marxism, and\nEgalitarianism: Part I: Challenges to Historical Entitlement,”\n<em>Politics, Philosophy, and Economics</em>, 1: 75–108.</li>\n<li>Malesic, Jonathan, 2017. “Parenting is Not a\n‘Job,’ and Marriage is Not ‘Work,’”\n<em>New Republic</em>, 9 Aug 2017\n [<a href=\"https://newrepublic.com/article/144254/parenting-not-job-marriage-not-work\" target=\"other\">Malesic 2017 available online</a>].</li>\n<li>Malmqvist, Erik, 2019 “’Paid to Endure’: Paid\nResearch Participation, Passivity, and the Goods of Work,\n”<em>American Journal of Bioethics</em>, 19: 11–20 .</li>\n<li>Margerison-Zilko, C., Goldman-Mellor, S., Falconi A., &amp;\nDowing, J., 2016. “Health Impacts of the Great Recession: A\nCritical Review,” <em>Current Epidemiology Reports</em>, 3:\n81–91.</li>\n<li>Marx, Karl, 1844. <em>Economic and Philosophic Manuscripts of\n1844</em>, Martin Milligan (trans. and ed.), Mineola, NY: Dover.</li>\n<li>Maskivker, Julia, 2012. <em>Self-Realization and Justice: A\nLiberal-Perfectionist Defense of the Right to Freedom from\nEmployment</em>, New York: Routledge.</li>\n<li>Mayer, Robert, 2000. “Is there a Moral Right to Workplace\nDemocracy?” <em>Social Theory and Practice</em>, 26:\n301–325.</li>\n<li>Michaelson, Christopher, 2021. “A Normative Meaning of\nMeaningful Work,” <em>Journal of Business Ethics</em>, 170:\n413–428.</li>\n<li>Moriarty, Jeffrey, 2009. “Rawls, Self-Respect, and the\nOpportunity for Meaningful Work,” <em>Social Theory and\nPractice</em>, 35: 441–459.</li>\n<li>–––, 2020. “What’s in a Wage? A New\nApproach to the Justification of Pay,” <em>Business Ethics\nQuarterly</em>, 30: 119–137.</li>\n<li>Morris, William, 1884. “Useful Work Versus Useless\nToil,” in <em>Collected Works of William Morris</em>, Cambridge:\nCambridge University Press, 2012, pp. 98–120.</li>\n<li>Muñoz, Cristian Pérez, 2014. “Essential\nServices, Workers’ Freedom, and Distributive Justice,”\n<em>Social Theory and Practice</em>, 40: 649–672.</li>\n<li>Muirhead, Russell, 2007. <em>Just Work</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Nguyen, C. Thi, 2019. “Games and the Art of Agency,”\n<em>Philosophical Review</em>, 128: 423–462</li>\n<li>O’Connor, Brian, 2018. <em>Idleness: A Philosophical\nEssay</em>, Princeton: Princeton University Press.</li>\n<li>Örtenblad, A., 2021. <em>Debating Equal Pay for All: Economy,\nPracticability, and Ethics</em>, London: Palgrave Macmillan.</li>\n<li>Pateman, Carole, 1970. <em>Participation and Democratic\nTheory</em>, Cambridge: Cambridge University Press.</li>\n<li>Pieper, Josef, 1952. <em>Leisure, the Basis of Culture</em>, A.\nDru, (trans.), London: Faber and Faber.</li>\n<li>Pence, Gregory, 2001. “Towards a Theory of Work,” in\nSchaff (ed.) 2001, pp. 93–106.</li>\n<li>Reiff, Mark, 2020. <em>In the Name of Liberty: The Argument for\nUniversal Unionization</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Rawls, John, 1996. <em>Political Liberalism</em>, New York:\nColumbia University Press.</li>\n<li>Rose, Julie, 2016. <em>Free Time</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Russell, Bertrand, 1932. “In Praise of Idleness,”\n<em>Harper’s Magazine</em>, October 1932.\n [<a href=\"https://harpers.org/archive/1932/10/in-praise-of-idleness/\" target=\"other\">Russell 1932 available online</a>]</li>\n<li>Sage, Daniel, 2019. “Unemployment, Wellbeing and the Power\nof the Work Ethic: Implications for Social Policy,” <em>Critical\nSocial Policy</em>, 39: 205–228.</li>\n<li>Sayers, Sean, 2005. “Why Work? Marx and Human Nature,”\n<em>Science and Society</em>, 69: 606–616.</li>\n<li>Schaff, Kory, 2001. <em>Philosophy and the Problems of Work: A\nReader</em>, Lanham, MD: Rowman and Littlefield.</li>\n<li>–––, 2012. “Democratic Rights in the\nWorkplace,” <em>Inquiry</em>, 55: 386–404.</li>\n<li>–––, 2017. “A Right to Work and Fair\nConditions of Employment,” in K.P. Schaff (ed.), <em>Fair Work:\nEthics, Social Policy, Globalization</em>, London: Rowman and\nLittlefield, pp. 41–56.</li>\n<li>Schmode, Frauke, 2019. “What Difference Does It Make? UBI\nand the Problem of Bad Work,” in M. Cholbi and M.E. Weber\n(eds.), <em>The Future of Work, Technology, and Basic Income</em>, New\nYork: Routledge, pp. 151–170.</li>\n<li>Schwartz, Adina, 1982. “Meaningful Work,”\n<em>Ethics</em>, 92: 634–646.</li>\n<li>Schwartz, Barry, 2015. <em>Why We Work</em>, Simon and Schuster:\nNew York.</li>\n<li>Shelby, Tommie, 2012. “Justice, Work, and the Ghetto\nPoor,” <em>The Law and Ethics of Human Rights</em>, 6 December\n2012. doi:10.1515/1938-2545.1068</li>\n<li>Smith, Adam, 1776 [1976], <em>An Inquiry into the Nature and\nCauses of the Wealth of Nations</em>, E. Cannon (ed.), Chicago:\nUniversity of Chicago Press</li>\n<li>Stanczyk, Lucas, 2012. “Productive Justice,”\n<em>Philosophy and Public Affairs</em>, 40: 144–164.</li>\n<li>Suzman, James, 2021. <em>Work: A History of How We Spend Our\nTime</em>, London:Bloomsbury.</li>\n<li>Svendsen, Lars Fredrik, 2015. <em>Work</em>, 2<sup>nd</sup>\nedition, London: Routledge.</li>\n<li>Tcherneva, Pavlina R., 2020. <em>The Case for a Job\nGuarantee</em>, New York: John Wiley &amp; Sons.</li>\n<li>Thompson, Derek, 2015. “A World Without Work,” <em>The\nAtlantic</em>, July-August 2015.\n [<a href=\"https://www.theatlantic.com/magazine/archive/2015/07/world-without-work/395294/\" target=\"other\">Thompson 2015 available online</a>]</li>\n<li>United Nations, 1948. <em>Universal Declaration of Human\nRights</em>.\n [<a href=\"https://www.un.org/en/about-us/universal-declaration-of-human-rights\" target=\"other\">available online</a>]</li>\n<li>Van Parijs, Philipe, 1991. “Why Surfers Should Be Fed: The\nLiberal Case for an Unconditional Basic Income,” <em>Philosophy\n&amp; Public Affairs</em>, 20: 101–131.</li>\n<li>Van Parijs, Phillipe, and Vanderbroght, Yannick, 2017. <em>Basic\nIncome: A Radical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Veltman, Andrea, 2016. <em>Meaningful Work</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Walzer, Michael, 1983. <em>Spheres of Justice: A Defense of\nPluralism and Equality</em>, New York: Basic Books.</li>\n<li>Washington, Booker T., 1901. <em>Up From Slavery: An\nAutobiography</em>, New York: Doubleday.</li>\n<li>Weber, Max, 1904–05. <em>The Protestant Ethic and the Spirit\nof Capitalism</em>, translation of <em>Die protestantische Ethik und\nder Geist des Kapitalismus</em>, T. Parsons (trans.), New York:\nCharles Scribner’s Sons, 1930.</li>\n<li>Weeks, Kathi, 2011. <em>The Problem with Work:</em>, <em>Feminism,\nMarxism, Antiwork Politics, and Postwork Imaginaries</em>, Durham:\nDuke University Press.</li>\n<li>White, Stuart, 1998. “Trade Unionism in a Liberal\nState,” in A. Gutmann (ed.), <em>Freedom of Association</em>,\nPrinceton: Princeton University Press, pp. 330–356.</li>\n<li>–––, 2003. <em>The Civic Minimum: On the Rights\nand Obligations of Economic Citizenship</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Wright, Erik Olin, and Brighouse, Harrry, 2008. “Strong\nGender Egalitarianism,” <em>Politics and Society</em>, 36:\n360–372.</li>\n<li>Yeoman, Ruth, 2014. “Conceptualizing Meaningful Work as a\nFundamental Human Need,” <em>Journal of Business Ethics</em>,\n124: 235–251.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "economics [normative] and economic justice",
            "ethics: business",
            "exploitation",
            "feminist philosophy, topics: perspectives on class and work",
            "justice: distributive",
            "life: meaning of",
            "markets",
            "Marx, Karl",
            "Smith, Adam: moral and political philosophy",
            "value: intrinsic vs. extrinsic",
            "well-being"
        ],
        "entry_link": [
            {
                "../economic-justice/": "economics [normative] and economic justice"
            },
            {
                "../ethics-business/": "ethics: business"
            },
            {
                "../exploitation/": "exploitation"
            },
            {
                "../feminism-class/": "feminist philosophy, topics: perspectives on class and work"
            },
            {
                "../justice-distributive/": "justice: distributive"
            },
            {
                "../life-meaning/": "life: meaning of"
            },
            {
                "../markets/": "markets"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../smith-moral-political/": "Smith, Adam: moral and political philosophy"
            },
            {
                "../value-intrinsic-extrinsic/": "value: intrinsic vs. extrinsic"
            },
            {
                "../well-being/": "well-being"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=work-labor\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/work-labor/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=work-labor&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/work-labor/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=work-labor": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/work-labor/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=work-labor&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/work-labor/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Frey, Carl Benedikt, and Osborne, Michael A.,\n <a href=\"https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf\">“The Future of Employment: How Susceptible Are Jobs to Computerisation?”</a>,\n Working Paper, Oxford Martin School, University of Oxford.",
            "Jean-Philippe Deranty,\n <a href=\"https://onwork.edu.au/about/\"><em>For Work/Against Work</em></a>,\n Australian Research Council, “The Case for Work”.",
            "<a href=\"https://autonomy.work/\">Autonomy</a>,\n research institute focusing on the future of work.",
            "John Paul II, 1981.\n <a href=\"https://www.vatican.va/content/john-paul-ii/en/encyclicals/documents/hf_jp-ii_enc_14091981_laborem-exercens.html\"><em>Labourem Exercens</em></a>,\n papal encyclical."
        ],
        "listed_links": [
            {
                "https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf": "“The Future of Employment: How Susceptible Are Jobs to Computerisation?”"
            },
            {
                "https://onwork.edu.au/about/": "For Work/Against Work"
            },
            {
                "https://autonomy.work/": "Autonomy"
            },
            {
                "https://www.vatican.va/content/john-paul-ii/en/encyclicals/documents/hf_jp-ii_enc_14091981_laborem-exercens.html": "Labourem Exercens"
            }
        ]
    }
}