{"url": "aristotle-politics", "title": "Aristotle’s Political Theory", "authorship": {"year": "Copyright © 2022", "author_text": "Fred Miller\n<fmiller@sppfbg.org>", "author_links": [{"mailto:fmiller%40sppfbg%2eorg": "fmiller@sppfbg.org"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nFred Miller\n&lt;<a href=\"mailto:fmiller%40sppfbg%2eorg\"><em>fmiller<abbr title=\" at \">@</abbr>sppfbg<abbr title=\" dot \">.</abbr>org</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Wed Jul 1, 1998", "substantive revision Fri Jul 1, 2022"], "preamble": "\n\nAristotle (b. 384–d. 322 BCE), was a Greek philosopher,\nlogician, and scientist. Along with his teacher Plato, Aristotle is\ngenerally regarded as one of the most influential ancient thinkers in\na number of philosophical fields, including political theory.\nAristotle was born in Stagira in northern Greece, and his father was a\ncourt physician to the king of Macedon. As a young man he studied in\nPlato’s Academy in Athens. After Plato’s death he left Athens to\nconduct philosophical and biological research in Asia Minor and\nLesbos, and he was then invited by King Philip II of Macedon to tutor\nhis young son, Alexander the Great. Soon after Alexander succeeded his\nfather, consolidated the conquest of the Greek city-states, and\nlaunched the invasion of the Persian Empire. Aristotle returned as a\nresident alien to Athens, and was a close friend of Antipater, the\nMacedonian viceroy. At this time (335–323 BCE) he wrote, or at\nleast worked on, some of his major treatises, including the\nPolitics. When Alexander died suddenly, Aristotle had to flee\nfrom Athens because of his Macedonian connections, and he died soon\nafter. Aristotle’s life seems to have influenced his political thought\nin various ways: his interest in biology seems to be reflected in\nthe naturalism of his politics; his interest in comparative politics\nand his qualified sympathies for democracy as well as monarchy may\nhave been encouraged by his travels and experience of diverse\npolitical systems; he reacts critically to his teacher Plato, while\nborrowing extensively, from Plato’s Republic,\nStatesman, and Laws; and his own Politics\nis intended to guide rulers and statesmen, reflecting the high\npolitical circles in which he moved.\n", "toc": [{"#PoliScieGene": "1. Political Science in General"}, {"supplement1.html": "Supplement: Characteristics and Problems of Aristotle’s Politics"}, {"#ArisViewPoli": "2. Aristotle’s View of Politics"}, {"supplement2.html": "Supplement: Presuppositions of Aristotle’s Politics"}, {"#GeneTheoConsCiti": "3. General Theory of Constitutions and Citizenship"}, {"supplement3.html": "Supplement: Political Naturalism"}, {"#StudSpecCons": "4. Study of Specific Constitutions"}, {"#ArisModePoli": "5. Aristotle and Modern Politics"}, {"#GlosArisTerm": "Glossary of Aristotelian Terms"}, {"#Bib": "Bibliography"}, {"#GreeTextArisPoli": "A. Greek Text of Aristotle’s Politics"}, {"#BEnglTranArisPoli": "B. English Translations of Aristotle’s Politics"}, {"#CAnth": "C. Anthologies"}, {"#DSingAuthCommOver": "D. Single-authored Commentaries and Overviews"}, {"#EStudPartTopi": "E. Studies of Particular Topics"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Political Science in General\n\nThe modern word ‘political’ derives from the Greek\npolitikos, ‘of, or pertaining to, the polis’.\n(The Greek term polis will be translated here as\n‘city-state’. It is also commonly translated as\n‘city’ or  simply anglicized as ‘polis’.\nCity-states like Athens and Sparta were relatively small and cohesive\nunits, in which political, religious, and cultural concerns were\nintertwined. The extent of their similarity to modern nation-states is\ncontroversial.) Aristotle’s word for ‘politics’ is\npolitikê, which is short for politikê\nepistêmê or ‘political science’. It\nbelongs to one of the three main branches of science, which Aristotle\ndistinguishes by their ends or objects. Contemplative science\n(including physics and metaphysics) is concerned with truth or\nknowledge for its own sake; practical science with good action; and\nproductive science with making useful or beautiful objects\n(Top. VI.6.145a14–16, Met. VI.1.1025b24,\nXI.7.1064a16–19, EN VI.2.1139a26–8). Politics is\na practical science, since it is concerned with the noble action or\nhappiness of the citizens (although it resembles a productive science\nin that it seeks to create, preserve, and reform political systems).\nAristotle thus understands politics as a normative or prescriptive\ndiscipline rather than as a purely empirical or descriptive\ninquiry.\n\nIn the Nicomachean Ethics Aristotle describes his subject\nmatter as ‘political science’, which he characterizes as\nthe most authoritative science. It prescribes which sciences are to be\nstudied in the city-state, and the others — such as military\nscience, household management, and rhetoric — fall under its\nauthority. Since it governs the other practical sciences, their ends\nserve as means to its end, which is nothing less than the human good.\n“Even if the end is the same for an individual and for a\ncity-state, that of the city-state seems at any rate greater and more\ncomplete to attain and preserve. For although it is worthy to attain\nit for only an individual, it is nobler and more divine to do so for a\nnation or city-state” (EN I.2.1094b7–10). The two\nethical works (the Nicomachean Ethics and the Eudemian\nEthics) explain the principles that form the foundations for\nthe Politics: that happiness is the highest human good, that\nhappiness is the activity of moral virtue defined in terms of the\nmean, and that justice or the common advantage is the political good.\nAristotle’s political science thus encompasses the two fields which\nmodern philosophers distinguish as ethics and political philosophy.\n(See the entry on\n Aristotle’s ethics.)\n Political philosophy in the narrow sense is roughly speaking the\nsubject of his treatise called the Politics. For a further\ndiscussion of this topic, see the following supplementary\ndocument:\n\nSupplement: Characteristics and Problems of Aristotle’s Politics\n\n2. Aristotle’s View of Politics\n\nPolitical science studies the tasks of the politician or statesman\n(politikos), in much the way that medical science concerns\nthe work of the physician (see Politics IV.1). It is, in\nfact, the body of knowledge that such practitioners, if truly expert,\nwill also wield in pursuing their tasks. The most important task for\nthe politician is, in the role of lawgiver\n(nomothetês), to frame the appropriate constitution for\nthe city-state. This involves enduring laws, customs, and institutions\n(including a system of moral education) for the citizens. Once the\nconstitution is in place, the politician needs to take the appropriate\nmeasures to maintain it, to introduce reforms when he finds them\nnecessary, and to prevent developments which might subvert the\npolitical system. This is the province of legislative science, which\nAristotle regards as more important than politics as exercised in\neveryday political activity such as the passing of decrees (see\nEN VI.8).\n\nAristotle frequently compares the politician to a craftsman. The\nanalogy is imprecise because politics, in the strict sense of\nlegislative science, is a form of practical knowledge, while a craft\nlike architecture or medicine is a form of productive knowledge.\nHowever, the comparison is valid to the extent that the politician\nproduces, operates, maintains a legal system according to universal\nprinciples (EN VI.8 and X.9). In order to appreciate this\nanalogy it is helpful to observe that Aristotle explains the\nproduction of an artifact such as a drinking cup in terms of four\ncauses: the material, formal, efficient, and final causes\n(Phys. II.3 and Met. A.2). For example, clay\n(material cause) is molded into a roughly cylindrical shape\nclosed at one end (formal cause) by a potter (efficient or moving\ncause) so that it can contain a beverage (final cause). (For\ndiscussion of the four causes see the entry on\n Aristotle’s physics.)\n\nOne can also explain the existence of the city-state in terms of the\nfour causes. It is a kind of community (koinônia), that\nis, a collection of parts having some functions and interests in\ncommon (Pol. II.1.1261a18, III.1.1275b20). Hence, it is made\nup of parts, which Aristotle describes in various ways in different\ncontexts: as households, or economic classes (e.g., the rich and the\npoor), or demes (i.e., local political units). But, ultimately, the\ncity-state is composed of individual citizens (see\nIII.1.1274a38–41), who, along with natural resources, are the\n“material” or “equipment” out of which the\ncity-state is fashioned (see VII.14.1325b38–41).\n\nThe formal cause of the city-state is its constitution\n(politeia). Aristotle defines the constitution as “a\ncertain ordering of the inhabitants of the city-state”\n(III.1.1274b32–41). He also speaks of the constitution of a community\nas “the form of the compound” and argues that whether the\ncommunity is the same over time depends on whether it has the same\nconstitution (III.3.1276b1–11). The constitution is not a\nwritten document, but an immanent organizing principle, analogous to\nthe soul of an organism. Hence, the constitution is also “the\nway of life” of the citizens (IV.11.1295a40–b1, VII.8.1328b1–2).\nHere the citizens are that minority of the resident population who\npossess full political rights (III.1.1275b17–20).\n\nThe existence of the city-state also requires an efficient cause,\nnamely, its ruler. On Aristotle’s view, a community of any sort can\npossess order only if it has a ruling element or authority. This\nruling principle is defined by the constitution, which sets criteria\nfor political offices, particularly the sovereign office\n(III.6.1278b8–10; cf. IV.1.1289a15–18). However, on a\ndeeper level, there must be an efficient cause to explain why a\ncity-state acquires its constitution in the first place. Aristotle\nstates that “the person who first established [the city-state]\nis the cause of very great benefits” (I.2.1253a30–1). This\nperson was evidently the lawgiver (nomothetês), someone\nlike Solon of Athens or Lycurgus of Sparta, who founded the\nconstitution. Aristotle compares the lawgiver, or the politician more\ngenerally, to a craftsman (dêmiourgos) like a weaver or\nshipbuilder, who fashions material into a finished product\n(II.12.1273b32–3, VII.4.1325b40–1365a5).\n\nThe notion of final cause dominates Aristotle’s Politics from\nthe opening lines:\n\nSince we see that every city-state is a sort of community and that\nevery community is established for the sake of some good (for everyone\ndoes everything for the sake of what they believe to be good), it is\nclear that every community aims at some good, and the community which\nhas the most authority of all and includes all the others aims\nhighest, that is, at the good with the most authority. This is what is\ncalled the city-state or political community. [I.1.1252a1–7]\n\n\nSoon after, he states that the city-state comes into being for the\nsake of life but exists for the sake of the good life\n(2.1252b29–30). The theme that the good life or happiness is the\nproper end of the city-state recurs throughout the Politics\n(III.6.1278b17–24, 9.1280b39; VII.2.1325a7–10).\n\nTo sum up, the city-state is a hylomorphic (i.e., matter-form)\ncompound of a particular population (i.e., citizen-body) in a given\nterritory (material cause) and a constitution (formal cause). The\nconstitution itself is fashioned by the lawgiver and is governed by\npoliticians, who are like craftsmen (efficient cause), and the\nconstitution defines the aim of the city-state (final cause,\nIV.1.1289a17–18). Aristotle’s hylomorphic analysis has important\npractical implications for him: just as a craftsman should not try to\nimpose a form on materials for which it is unsuited (e.g. to build a\nhouse out of sand), the legislator should not lay down or change laws\nwhich are contrary to the nature of the citizens. Aristotle\naccordingly rejects utopian schemes such as the proposal in Plato’s\nRepublic that children and property should belong to all the\ncitizens in common. For this runs afoul of the fact that “people give\nmost attention to their own property, less to what is communal, or\nonly as much as falls to them to give attention” (Pol.\nII.3.1261b33–5). Aristotle is also wary of casual political\ninnovation, because it can have the deleterious side-effect of\nundermining the citizens’ habit of obeying the law\n(II.8.1269a13–24). For a further discussion of the theoretical\nfoundations of Aristotle’s politics, see the following supplementary\ndocument:\n\nSupplement: Presuppositions of Aristotle’s Politics\n\n\nIt is in these terms, then, that Aristotle understands the fundamental\nnormative problem of politics: What constitutional form should the\nlawgiver establish and preserve in what material for the sake of what\nend?\n3. General Theory of Constitutions and Citizenship\n\nAristotle states, “The politician and lawgiver is wholly\noccupied with the city-state, and the constitution is a certain way of\norganizing those who inhabit the city-state” (III.1.1274b36–8).\nHis general theory of constitutions is set forth in Politics\nIII. He begins with a definition of the citizen\n(politês), since the city-state is by nature a\ncollective entity, a multitude of citizens. Citizens are distinguished\nfrom other inhabitants, such as resident aliens and slaves; and even\nchildren and seniors are not unqualified citizens (nor are most\nordinary workers). After further analysis he defines the citizen as a\nperson who has the right (exousia) to participate in\ndeliberative or judicial office (1275b18–21). In Athens, for\nexample, citizens had the right to attend the assembly, the council,\nand other bodies, or to sit on juries. The Athenian system differed\nfrom a modern representative democracy in that the citizens were more\ndirectly involved in governing. Although full citizenship tended to be\nrestricted in the Greek city-states (with women, slaves, foreigners,\nand some others excluded), the citizens were more deeply enfranchised\nthan in modern representative democracies because they were more\ndirectly involved in governing. This is reflected in Aristotle’s\ndefinition of the citizen (without qualification). Further, he defines\nthe city-state (in the unqualified sense) as a multitude of such\ncitizens which is adequate for a self-sufficient life\n(1275b20–21).\n\nAristotle defines the constitution (politeia) as a way of\norganizing the offices of the city-state, particularly the sovereign\noffice (III.6.1278b8–10; cf. IV.1.1289a15–18). The\nconstitution thus defines the governing body, which takes different\nforms: for example, in a democracy it is the people, and in an\noligarchy it is a select few (the wealthy or well born). Before\nattempting to distinguish and evaluate various constitutions Aristotle\nconsiders two questions. First, why does a city-state come into being?\nHe recalls the thesis, defended in Politics I.2, that human\nbeings are by nature political animals, who naturally want to live\ntogether. For a further discussion of this topic, see the following\nsupplementary document:\n\nSupplement: Political Naturalism\n\n\nAristotle then adds, “The common advantage also brings them\ntogether insofar as they each attain the noble life. This is above all\nthe end for all both in common and separately”\n(III.6.1278b19–24). Second, what are the different forms of rule\nby which one individual or group can rule over another? Aristotle\ndistinguishes several types of rule, based on the nature of the soul\nof the ruler and of the subject. He first considers despotic rule,\nwhich is exemplified in the master-slave relationship. Aristotle\nthinks that this form of rule is justified in the case of natural\nslaves who (he asserts without evidence) lack a deliberative faculty\nand thus need a natural master to direct them (I.13.1260a12; slavery\nis defended at length in Politics I.4–8). Although a\nnatural slave allegedly benefits from having a master, despotic rule\nis still primarily for the sake of the master and only incidentally\nfor the slave (III.6.1278b32–7). (Aristotle provides no argument\nfor this: if some persons are congenitally incapable of governing\nthemselves, why should they not be ruled primarily for their own\nsakes?) He next considers paternal and marital rule, which he also\nviews as defensible: “the male is by nature more capable of\nleadership than the female, unless he is constituted in some way\ncontrary to nature, and the elder and perfect [is by nature more\ncapable of leadership] than the younger and imperfect”\n(I.12.1259a39–b4).\n\nAristotle is persuasive when he argues that children need adult\nsupervision because their rationality is “imperfect”\n(ateles) or immature. But he is unconvincing to modern\nreaders when he alleges (without substantiation) that, although women\nhave a deliberative faculty, it is “without authority”\n(akuron), so that females require male supervision\n(I.13.1260a13–14). (Aristotle’s arguments about slaves and women\nappear so weak that some commentators take them to be ironic. However,\nwhat is obvious to a modern reader need not have been so to an ancient\nGreek, so that it is not necessary to suppose Aristotle’s\ndiscussion is disingenuous.) It is noteworthy, however, that paternal\nand marital rule are properly practiced for the sake of the ruled (for\nthe sake of the child and of the wife respectively), just as arts like\nmedicine or gymnastics are practiced for the sake of the patient\n(III.6.1278b37–1279a1). In this respect they resemble political\nrule, which is the form of rule appropriate when the ruler and the\nsubject have equal and similar rational capacities. This is\nexemplified by naturally equal citizens who take turns at ruling for\none another’s advantage (1279a8–13). This sets the stage for the\nfundamental claim of Aristotle’s constitutional theory:\n“constitutions which aim at the common advantage are correct and\njust without qualification, whereas those which aim only at the\nadvantage of the rulers are deviant and unjust, because they involve\ndespotic rule which is inappropriate for a community of free\npersons” (1279a17–21).\n\nThe distinction between correct and deviant constitutions is combined\nwith the observation that the government may consist of one person, a\nfew, or a multitude. Hence, there are six possible constitutional\nforms (Politics III.7):\n\n\n\n \nCorrect\nDeviant \n\nOne Ruler\nKingship\nTyranny \n\nFew Rulers\nAristocracy\nOligarchy \n\nMany Rulers\nPolity\nDemocracy  \n\n\nThis six-fold classification (which is doubtless adapted from Plato’s\nStatesman 302c–d) sets the stage for Aristotle’s inquiry into\nthe best constitution, although it is modified in various ways\nthroughout the Politics. For example, he observes that the\ndominant class in oligarchy (literally rule of the oligoi,\ni.e., few) is typically the wealthy, whereas in democracy (literally\nrule of the dêmos, i.e., people) it is the poor, so\nthat these economic classes should be included in the definition of\nthese forms (see Politics III.8, IV.4, and VI.2 for\nalternative accounts). Also, polity is later characterized as a kind\nof “mixed” constitution typified by rule of the\n“middle” group of citizens, a moderately wealthy class\nbetween the rich and poor (Politics IV.11).\n\nAristotle’s constitutional theory is based on his theory of justice,\nwhich is expounded in Nicomachean Ethics book V. Aristotle\ndistinguishes two different but related senses of\n“justice” — universal and particular — both of\nwhich play an important role in his constitutional theory. Firstly, in\nthe universal sense “justice” means\n“lawfulness” and is concerned with the common advantage and\nhappiness of the political community (NE\nV.1.1129b11–19, cf. Pol. III.12.1282b16–17). The\nconception of universal justice undergirds the distinction between\ncorrect (just) and deviant (unjust) constitutions. But what exactly\nthe “common advantage” (koinê sumpheron)\nentails is a matter of scholarly controversy. Some passages imply that\njustice involves the advantage of all the citizens; for example, every\ncitizen of the best constitution has a just claim to private property\nand to an education (Pol. VII.9.1329a23–4,\n13.1332a32–8). But Aristotle also allows that it might be\n“in a way” just to ostracize powerful citizens even when\nthey have not been convicted of any crimes (III.13.1284b15–20).\nWhether Aristotle understands the common advantage as safeguarding the\ninterests of each and every citizen has a bearing on whether and to\nwhat extent he anticipates what moderns would understand as a theory\nof individual rights. (See Fred Miller and Richard Kraut for differing\ninterpretations.)\n\nSecondly, in the particular sense “justice” means\n“equality” or “fairness”, and this includes\ndistributive justice, according to which different individuals have\njust claims to shares of some common asset such as property. Aristotle\nanalyzes arguments for and against the different constitutions as\ndifferent applications of the principle of distributive justice\n(III.9.1280a7–22). Everyone agrees, he says, that justice\ninvolves treating equal persons equally, and treating unequal persons\nunequally, but they do not agree on the standard by which individuals\nare deemed to be equally (or unequally) meritorious or deserving. He\nassumes his own analysis of distributive justice set forth in\nNicomachean Ethics V.3: Justice requires that benefits be\ndistributed to individuals in proportion to their merit or desert. The\noligarchs mistakenly think that those who are superior in wealth\nshould also have superior political rights, whereas the democrats hold\nthat those who are equal in free birth should also have equal\npolitical rights. Both of these conceptions of political justice are\nmistaken in Aristotle’s view, because they assume a false conception\nof the ultimate end of the city-state. The city-state is neither a\nbusiness enterprise to maximize wealth (as the oligarchs suppose) nor\nan association to promote liberty and equality (as the democrats\nmaintain). Instead, Aristotle argues, “the good life is the end\nof the city-state,” that is, a life consisting of noble actions\n(1280b39–1281a4). Hence, the correct conception of justice is\naristocratic, assigning political rights to those who make a full\ncontribution to the political community, that is, to those with virtue\nas well as property and freedom (1281a4–8). This is what\nAristotle understands by an “aristocratic” constitution:\nliterally, the rule of the aristoi, i.e., best persons.\nAristotle explores the implications of this argument in the remainder\nof Politics III, considering the rival claims of the rule of\nlaw and the rule of a supremely virtuous individual. Here absolute\nkingship is a limiting case of aristocracy. Again, in books VII-VIII,\nAristotle describes the ideal constitution in which the citizens are\nfully virtuous.\n\nAlthough justice is in Aristotle’s view  the foremost\npolitical virtue (Pol. III.9.1283a38–40), the other great\nsocial virtue, friendship, should not be overlooked, because the two\nvirtues work hand in hand to secure every sort of association\n(EN VIII.9.1159b26–7). Justice enables the citizens of a\ncity-state to share peacefully in the benefits and burdens of\ncooperation, while friendship holds them together and prevents them\nfrom breaking up into warring factions (cf. Pol.\nII.4.1262b7–9). Friends are expected to treat each other justly, but\nfriendship goes beyond justice because it is a complex mutual bond in\nwhich individuals choose the good for others and trust that others are\nchoosing the good for them (cf. EE VII.2.1236a14–15, b2–3;\nEN VIII.2.1155b34–3.1156a10). Because choosing the good for\none another is essential to friendship and there are three different\nways in which something can be called ‘good’ for a human\nbeing—virtuous (i.e., good without qualification), useful, or\npleasant—there are three types of friendship: hedonistic,\nutilitarian, and virtuous. Political (or civic) friendship is a\nspecies of utilitarian friendship, and it is the most important form\nof utilitarian friendship because the polis is the greatest community.\nOpposed to political friendship is enmity, which leads to faction or\ncivil war (stasis) or even to political revolution and the\nbreakup of the polis, as discussed in Book V of the Politics.\nAristotle offers general accounts of political or civic friendship as\npart of his general theory of friendship in EE VII.10 and\nEN VIII.9–12.\n4. Study of Specific Constitutions\n\nThe purpose of political science is to guide “the good lawgiver\nand the true politician” (IV.1.1288b27). Like any complete\nscience or craft, it must study a range of issues concerning its\nsubject matter. For example, gymnastics (physical education) studies\nwhat sort of training is best or adapted to the body that is naturally\nthe best, what sort of training is best for most bodies, and what\ncapacity is appropriate for someone who does not want the condition or\nknowledge appropriate for athletic contests. Political science studies\na comparable range of constitutions (1288b21–35): first, the\nconstitution which is best without qualification, i.e., “most\naccording to our prayers with no external impediment”; second,\nthe constitution that is best under the circumstances “for it is\nprobably impossible for many persons to attain the best\nconstitution”; third, the constitution which serves the aim a\ngiven population happens to have, i.e., the one that is best\n“based on a hypothesis”: “for [the political\nscientist] ought to be able to study a given constitution, both how it\nmight originally come to be, and, when it has come to be, in what\nmanner it might be preserved for the longest time; I mean, for\nexample, if a particular city happens neither to be governed by the\nbest constitution, nor to be equipped even with necessary things, nor\nto be the [best] possible under existing circumstances, but to be a\nbaser sort.” Hence, Aristotelian political science is not\nconfined to the ideal system, but also investigates the second-best\nconstitution or even inferior political systems, because this may be\nthe closest approximation to full political justice which the lawgiver\ncan attain under the circumstances.\n\nRegarding the constitution that is ideal or “according to\nprayer,” Aristotle criticizes the views of his predecessors in\nthe Politics and then offers a rather sketchy blueprint\nof his own in Politics VII–VIII. Although his own\npolitical views were influenced by his teacher Plato, Aristotle is\nhighly critical of the ideal constitution set forth in Plato’s\nRepublic on the grounds that it overvalues political unity,\nit embraces a system of communism that is impractical and inimical to\nhuman nature, and it neglects the happiness of the individual citizens\n(Politics II.1–5). In contrast, in Aristotle’s\n“best constitution,” each and every citizen will possess\nmoral virtue and the equipment to carry it out in practice, and\nthereby attain a life of excellence and complete happiness (see\nVII.13.1332a32–8). All of the citizens will hold political\noffice and possess private property because “one should call the\ncity-state happy not by looking at a part of it but at all the\ncitizens.” (VII.9.1329a22–3). Moreover, there will be a\ncommon system of education for all the citizens, because they share\nthe same end (Pol. VIII.1).\n\nIf (as is the case with most existing city-states) the population\nlacks the capacities and resources for complete happiness, however,\nthe lawgiver must be content with fashioning a suitable constitution\n(Politics IV.11). The second-best system typically takes the\nform of a polity (in which citizens possess an inferior, more common\ngrade of virtue) or mixed constitution (combining features of\ndemocracy, oligarchy, and, where possible, aristocracy, so that no\ngroup of citizens is in a position to abuse its rights). Aristotle\nargues that for city-states that fall short of the ideal, the best\nconstitution is one controlled by a numerous middle class which stands\nbetween the rich and the poor. For those who possess the goods of\nfortune in moderation find it “easiest to obey the rule of\nreason” (Politics IV.11.1295b4–6). They are\naccordingly less apt than the rich or poor to act unjustly toward\ntheir fellow citizens. A constitution based on the middle class is the\nmean between the extremes of oligarchy (rule by the rich) and\ndemocracy (rule by the poor). “That the middle [constitution] is\nbest is evident, for it is the freest from faction: where the middle\nclass is numerous, there least occur factions and divisions among\ncitizens” (IV.11.1296a7–9). The middle constitution is\ntherefore both more stable and more just than oligarchy and\ndemocracy.\n\nAlthough Aristotle classifies democracy as a deviant constitution\n(albeit the best of a bad lot), he argues that a case might be made\nfor popular rule in Politics III.11, a discussion which has\nattracted the attention of modern democratic theorists. The central\nclaim is that the many may turn out to be better than the virtuous few\nwhen they come together, even though the many may be inferior when\nconsidered individually. For if each individual has a portion of\nvirtue and practical wisdom, they may pool these moral assets and turn\nout to be better rulers than even a very wise individual. This\nargument seems to anticipate treatments of “the wisdom of the\nmultitude” such as Condorcet’s “jury theorem.”\nIn recent years, this particular chapter has been widely discussed in\nconnection with topics such as democratic deliberation and public\nreason.\n\nIn addition, the political scientist must attend to existing\nconstitutions even when they are bad. Aristotle notes that “to\nreform a constitution is no less a task [of politics] than it is to\nestablish one from the beginning,” and in this way “the\npolitician should also help existing constitutions”\n(IV.1.1289a1–7). The political scientist should also be\ncognizant of forces of political change which can undermine an\nexisting regime. Aristotle criticizes his predecessors for excessive\nutopianism and neglect of the practical duties of a political\ntheorist. However, he is no Machiavellian. The best constitution still\nserves as a regulative ideal by which to evaluate existing\nsystems.\n\nThese topics occupy the remainder of the Politics. Books\nIV–VI are concerned with the existing constitutions: that is,\nthe three deviant constitutions, as well as polity or the\n“mixed” constitution, which are the best attainable under\nmost circumstances (IV.2.1289a26–38). The mixed constitution has\nbeen of special interest to scholars because it looks like a\nforerunner of modern republican regimes. The whole of book V\ninvestigates the causes and prevention of revolution or political\nchange (metabolê) and civil war or faction\n(stasis). Books VII–VIII are devoted to the ideal\nconstitution. As might be expected, Aristotle’s attempt to carry out\nthis program involves many difficulties, and scholars disagree about\nhow the two series of books (IV–VI and VII–VIII) are\nrelated to each other: for example, which were written first, which\nwere intended to be read first, and whether they are ultimately\nconsistent with each other. Most importantly, when Aristotle offers\npractical political prescriptions in Books IV–VI, is he guided\nby the best constitution as a regulative ideal, or is he simply\nabandoning political idealism and practicing  a form of\nRealpolitik?For a further discussion of this topic, see the following\nsupplementary document:\n\nSupplement: Characteristics and Problems of Aristotle’s Politics\n\n5. Aristotle and Modern Politics\n\nAristotle has continued to influence thinkers up to the present\nthroughout the political spectrum, including conservatives (such as\nHannah Arendt, Leo Strauss, and Eric Voegelin), communitarians (such\nas Alasdair MacIntyre and Michael Sandel), liberals (such as William\nGalston and Martha C. Nussbaum), libertarians (such as Tibor R.\nMachan, Douglas B. Rasmussen, and Douglas J. Den Uyl), and democratic\ntheorists (such as Jill Frank and Gerald M. Mara).\n\nIt is not surprising that such diverse political persuasions can lay\nclaim to Aristotle as a source. For his method often leads to\ndivergent interpretations. When he deals with a difficult problem, he\nis inclined to consider opposing arguments in a careful and nuanced\nmanner, and he is often willing to concede that there is truth on each\nside. For example, though he is critical of democracy, in one passage\nhe allows that the case for rule by the many based on the superior\nwisdom of the multitude “perhaps also involves some truth”\n(Pol. III.11.1281a39–42). Again, he sometimes applies his own\nprinciples in a questionable manner, for example, when he reasons that\nbecause associations should be governed in a rational manner, the\nhousehold should be run by the husband rather than by the wife, whose\nrational capacity “lacks authority” (I.13.1260a13). Modern\ncommentators sympathetic with Aristotle’s general approach often\ncontend that in this case he applies his own principles\nincorrectly–leaving open the question of how they\nshould be applied. Further, the way he applies his principles\nmay have seemed reasonable in his socio-political context–for\nexample, that the citizen of a polity (normally the best attainable\nconstitution) must be a hoplite soldier (cf. III.7,1297b4)–but\nit may be debatable how these might apply within a modern democratic\nnation-state.\n\nThe problem of extrapolating to modern political affairs can be\nillustrated more fully in connection with Aristotle’s discussion of\nlegal change in Politics II.8. He first lays out the argument\nfor making the laws changeable. It has been beneficial in the case of\nmedicine, for example, for it to progress from traditional ways to\nimproved forms of treatment. An existing law may be a vestige of a\nprimitive barbaric practice. For instance, Aristotle mentions a law in\nCyme that allows an accuser to produce a number of his own relatives\nas witnesses to prove that a defendant is guilty of murder.\n“So,” Aristotle concludes, “it is evident from the\nforegoing that some laws should sometimes be changed. But to those who\nlook at the matter from a different angle, caution would seem to be\nrequired” (1269a12–14). Since the law gets its force from the\ncitizens’ habit of obedience, great care should be exercised in making\nany change in it. It may sometimes be better to leave defective laws\nin place rather than encouraging lawlessness by changing the laws too\nfrequently. Moreover, there are the problems of how the laws are to be\nchanged and who is to change them. Although Aristotle offers valuable\ninsights, he breaks off the discussion of this topic and never takes\nit up elsewhere. We might sum up his view as follows: When it comes to\nchanging the laws, observe the mean: don’t be too bound by traditional\nlaws, but on the other hand don’t be overeager in altering them. It is\nobvious that this precept, reasonable as it is, leaves considerable\nroom for disagreement among contemporary\n“neo-Aristotelian” theorists. For example, should the laws\nbe changed to allow self-described transsexual persons to use sexually\nsegregated restrooms? Conservatives and liberals might agree with\nAristotle’s general stricture regarding legal change but differ widely\non how to apply it in a particular case.\n\nMost scholars of Aristotle advisedly make no attempt to show that he\nis aligned with any contemporary ideology. Rather, insofar as they\nfind him relevant to our times, it is because he offers a remarkable\nsynthesis of idealism and pragmatism unfolding in deep and\nthought-provoking discussions of perennial concerns of political\nphilosophy: the role of human nature in politics, the relation of the\nindividual to the state, the place of morality in politics, the theory\nof political justice, the rule of law, the analysis and evaluation of\nconstitutions, the relevance of ideals to practical politics, the\ncauses and cures of political change and revolution, and the\nimportance of a morally educated citizenry.\nGlossary of Aristotelian Terms\n\naction: praxis\ncitizen: politês\ncity-state: polis (also ‘city’ or\n‘state’)\ncommunity: koinônia\nconstitution: politeia (also ‘regime’)\nfaction: stasis (also ‘civil war’)\nfree: eleutheros\nfriendship: philia\ngood: agathos\nhappiness: eudaimonia\nhappy: eudaimôn\njustice: dikaiosunê\nlaw: nomos\nlawgiver: nomothetês\nmaster: despotês\nnature: phusis\nnoble: kalon (also ‘beautiful’ or\n‘fine’)\npeople (dêmos)\npolitical: politikos (of, or pertaining to, the\npolis)\npolitical science: politikê\nepistêmê\npolitician: politikos (also ‘statesman’)\npractical: praktikos\npractical wisdom: phronêsis\nrevolution: metabolê (also\n‘change’)\nright: exousia (also ‘liberty’)\nruler: archôn\nself-sufficient: autarkês\nsovereign: kurios\nvirtue: aretê (also ‘excellence’)\nwithout qualification: haplôs (also\n‘absolute’)\nwithout authority: akuron\n\n", "bibliography": {"categories": ["A. Greek Text of Aristotle’s <em>Politics</em>", "B. English Translations of Aristotle’s <em>Politics</em>", "C. Anthologies", "D. Single-authored Commentaries and Overviews", "E. Studies of Particular Topics"], "cat_ref_text": {"A. Greek Text of Aristotle’s <em>Politics</em>": ["</h3>\n<ul class=\"hanging\">", "Dreizehnter, Alois, <em>Aristoteles’ Politik</em>, Munich: Wilhelm\nFink, 1970 [generally the most reliable critical edition].", "Ross, W. D., <em>Aristotelis Politica</em>, Oxford: Oxford\nUniversity Press, 1957.\n</ul>\n<h3 id=\"BEnglTranArisPoli\">"], "B. English Translations of Aristotle’s <em>Politics</em>": ["</h3>\n<ul class=\"hanging\">", "Barker, Ernest, revised by Richard Stalley, Oxford: Oxford\nUniversity Press, 1995.", "Jowett, Benjamin, revised in <em>The Complete Works of\nAristotle</em> (The Revised Oxford Translation), Jonathan Barnes\n(ed.), Princeton: Princeton University Press, 1984, vol. II, pp.\n1986–2129.", "Lord, Carnes, Chicago: University of Chicago Press, 2013, revised\nedition.", "Rackham, H., Cambridge, London: Harvard University Press,\n1932.", "Reeve, C. D. C., Indianapolis: Hackett Publishing Co., 2017 (new\ntranslation).", "Simpson, Peter L. P., Chapel Hill: University of North Carolina\nPress, 1996.", "Sinclair, T. A., revised by Trevor J. Saunders, Harmondsworth:\nPenguin, 1983.\n</ul>\n<p>\nThe Clarendon Aristotle Series (Oxford University Press) includes\ntranslation and commentary of the <em>Politics</em> in four\nvolumes:</p>\n<ul>", "Trevor J. Saunders, <em>Politics</em> I–II (1995).", "Richard Robinson with a supplementary essay by David Keyt,\n<em>Politics</em> III–IV (1995).", "David Keyt, <em>Politics</em> V–VI (1999).", "Richard Kraut, <em>Politics</em> VII–VIII (1997).\n</ul>\n<ul>", "Also of interest is the <em>Constitution of Athens</em>, an\naccount of the history and workings of the Athenian democracy.\nAlthough it was formerly ascribed to Aristotle, it is now thought by\nmost scholars to have been written by one of his pupils, perhaps at\nhis direction toward the end of Aristotle’s life. A reliable\ntranslation with introduction and notes is by P. J. Rhodes,\n<em>Aristotle: The Athenian Constitution</em>. Harmondsworth: Penguin,\n1984.\n</ul>\n<h3 id=\"CAnth\">"], "C. Anthologies": ["</h3>\n<ul class=\"hanging\">", "Barnes, Jonathan, Malcolm Schofield, and Richard Sorabji (eds.),\n<em>Articles on Aristotle</em> (Volume 2: Ethics and Politics),\nLondon: Duckworth, 1977.", "Boudouris, K. J. (ed.), <em>Aristotelian Political\nPhilosophy,</em> 2 volumes, Athens: Kardamitsa Publishing Co.,\n1995.", "Deslauriers, Marguerite, and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013.", "Höffe, Otfried (ed.), <em>Aristoteles Politik</em>, Berlin:\nAkademie Verlag, 2001.", "Keyt, David, and Fred D. Miller, Jr. (eds.), <em>A Companion to\nAristotle’s Politics</em>, Oxford: Blackwell, 1991.", "Kraut, Richard, and Steven Skultety (eds.), <em>Aristotle’s\nPolitics: Critical Essays</em>, Lanham, MD: Rowman and Littlefield,\n2005.", "Lockwood, Thornton, and Thanassis Samaras (eds.), <em>Aristotle’s\nPolitics: A Critical Guide</em>, Cambridge: Cambridge University\nPress, 2015.", "Lord, Carnes, and David O’Connor (eds.), <em>Essays on the\nFoundations of Aristotelian Political Science</em>, Berkeley:\nUniversity of California Press, 1991.", "Patzig, Günther (ed.), <em>Aristoteles’ Politik: Akten des\nXI. Symposium Aristotelicum</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990.\n</ul>\n<h3 id=\"DSingAuthCommOver\">"], "D. Single-authored Commentaries and Overviews": ["</h3>\n<ul class=\"hanging\">", "Aquinas, Thomas, <em>Commentary on Aristotle’s Politics</em>,\ntranslated by Richard J. Regan, Indianapolis Publishing Co.: Hackett,\n2007.", "Barker, Ernest, <em>The Political Thought of Plato and\nAristotle</em>, London: Methuen, 1906; reprinted, New York: Russell\n&amp; Russell, 1959.", "Bodéüs, Richard, <em>The Political Dimensions of\nAristotle’s Ethics</em>, Albany: SUNY Press, 1993.", "Brill, Sara, <em>Aristotle on the Concept of the Shared Life</em>,\nOxford: Oxford University Press, 2020.", "Hansen, Mogens Herman, <em>Reflections on Aristotle’s\nPolitics</em>, Copenhagen: Tusculaneum Press, 2013.", "Keyt, David, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017.", "Kontos, Pavlos, <em>Aristotle on the Scope of Practical Reason:\nSpectators, Legislators, Hopes, and Evils</em>, Abingdon, New York:\nRoutledge, 2021.", "Kraut, Richard, <em>Aristotle: Political Philosophy</em>, Oxford:\nOxford University Press, 2002.", "Miller, Fred D., Jr., <em>Nature, Justice, and Rights in\nAristotle’s Politics</em>, Oxford: Oxford University Press, 1995.", "Mulgan, Richard G., <em>Aristotle’s Political Theory</em>, Oxford:\nOxford University Press, 1977.", "Newman, W. L., <em>The Politics of Aristotle</em>, 4 vols. Oxford:\nOxford University Press, 1887–1902; reprinted Salem, NH: Ayer,\n1985.", "Nichols, Mary, <em>Citizens and Statesmen: A Study of Aristotle’s\nPolitics</em>, Lanham, MD: Rowman &amp; Littlefield, 1992.", "Pangle, Lorraine Smith, <em>Reason and Character: The Moral\nFoundations of Aristotelian Political Philosophy</em>, Chicago:\nUniversity of Chicago Press, 2020.", "Pellegrin, Pierre, <em>Endangered Excellent: On the Political\nPhilosophy of Aristotle</em>, translated by Anthony Preus, Albany, NY:\nSUNY Press, 2020.", "Riesbeck, David J., <em>Aristotle on Political Community</em>,\nCambridge: Cambridge University Press, 2016.", "Roberts, Jean, <em>Routledge Philosophy Guidebook to Aristotle and\nthe Politics</em>, London and New York: Routledge, 2009.", "Schütrumpf, Eckart, <em>Aristoteles: Politik</em>, 4 vols.\nBerlin and Darmstadt: Akademie Verlag, 1999–2005.", "Simpson, Peter, <em>A Philosophical Commentary on the Politics of\nAristotle</em>, Chapel Hill: University of North Carolina Press,\n1998.", "Strauss, Leo, “On Aristotle’s Politics,” in <em>The\nCity and Man</em>, Chicago: University of Chicago Press, 1964, pp.\n13–49.", "Susemihl, Franz, and R. D. Hicks, <em>The Politics of\nAristotle</em>, London: Macmillan, 1894. [Includes books\nI–III and VII–VIII renumbered as IV–V.]", "Trott, Adriel M., <em>Aristotle on the Nature of Community</em>,\nNew York: Cambridge University Press, 2005.", "Veogelin, Eric, <em>Order and History</em> (Vol. III:\n<em>Plato and Aristotle</em>), Baton Rouge, LA: Louisiana State\nUniversity Press, 1977.", "Yack, Bernard, <em>The Problems of a Political Animal: Community,\nJustice, and Conflict in Aristotelian Political Thought</em>,\nBerkeley: University of California Press, 1993.\n</ul>\n<h3 id=\"EStudPartTopi\">"], "E. Studies of Particular Topics": ["</h3>\n<h4>1. Biographical and Textual Studies</h4>\n<ul class=\"hanging\">", "Barker, Ernest, “The Life of Aristotle and the Composition\nand Structure of the <em>Politics</em>,” <em>Classical\nReview</em>, 45 (1931), 162–72.", "Jaeger, Werner, <em>Aristotle: Fundamentals of the History of His\nDevelopment</em>, Oxford: Oxford University Press, 1948.", "Kelsen, Hans, “Aristotle and the Hellenic-Macedonian\nPolicy,” in Jonathan Barnes et al. (eds.), <em>Articles on\nAristotle</em> (Volume 2: Ethics and Politics), London: Duckworth,\n1977, pp. 170–94.", "Lord, Carnes, “The Character and Composition of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 9 (1981),\n459–78.\n</ul>\n<h4>2. Methodology and Foundations of Aristotle’s Political Theory</h4>\n<ul class=\"hanging\">", "Adkins, A. W. H., “The Connection between Aristotle’s\n<em>Ethics</em> and <em>Politics</em>,” in David Keyt and Fred\nD. Miller, Jr. (eds.), <em>A Companion to Aristotle’s Politics</em>,\nOxford: Blackwell, 1991, pp. 75–93.", "Cherry, Kevin M., <em>Plato, Aristotle and the Purpose of\nPolitics</em>, Cambridge: Cambridge University Press, 2012.", "Depew, David J., “The Ethics of Aristotle’s\n<em>Politics</em>,” in Ryan K. Balot (ed.), <em>A Companion to\nGreek and Roman Political Thought</em>, Oxford: Wiley-Blackwell, 2009,\npp. 399–418.", "Frank Jill, “On <em>Logos</em> and Politics in\nAristotle,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 9–26.", "Frede, Dorothea, “The Political Character of Aristotle’s\nEthics,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 14–37.", "Gerson, Lloyd, “On the Scientific Character of\nAristotle’s Politics,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. I, pp. 35–50.", "Irwin, Terence H., “Moral Science and Political Theory in\nAristotle,” <em>History of Political Thought</em>, 6 (1985), pp.\n150–68.", "Kahn, Charles H., “The Normative Structure of Aristotle’s\n<em>Politics</em>,” in Günther Patzig (ed.)\n<em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 369–84.", "Kamtekar, Rachana, “The Relationship between\nAristotle’s Ethical and Political Discourses (<em>NE</em> X\n9),” in Ronald Polansky (ed.), <em>The Cambridge Companion to\nAristotle’s Nicomachean Ethics</em>. Cambridge, UK: Cambridge\nUniversity Press, 2014, pp. 370–82.", "Keyt, David, “Aristotle’s Political Philosophy,” in\nDavid Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, 165–95.", "Lockwood, Thornton, “<em>Politics</em> II: Political\nCritique, Political Theorizing, Political Innovation,” in\nThornton Lockwood and Thanassis Samaras (eds.), <em>Aristotle’s\nPolitics: A Critical Guide</em>, Cambridge: Cambridge University\nPress, 2015, pp. 64–83.", "Miller, Fred D., Jr., “The Unity of Aristotle’s\nEthics and Politics,” in David Konstan and David Sider (eds.),\n<em>Philoderma: Essays in Greek and Roman Philosophy in Honor of\nPhillip Mitsis</em> (Siracusa: Parnassos Press, 2022), pp.\n215–43.", "Ober, Joshua, “Aristotle’s Political Sociology: Class,\nStatus, and Order in the <em>Politics</em>,” in Carnes Lord and\nDavid O’Connor (eds.), <em>Essays on the Foundations of Aristotelian\nPolitical Science</em>, Berkeley: University of California Press,\n1991.", "Pellegrin, Pierre, “On the ‘Platonic’ Part of\nAristotle’s <em>Politics</em>,” in William Wians (ed.)\n<em>Aristotle’s Philosophical Development</em>, Lanham, MD: Rowman\n&amp; Littlefield, 1996, pp. 347–59.", "–––, “Is Politics a Natural\nScience?” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 27–45.", "–––, “Aristotle’s\n<em>Politics</em>,” in Christopher Shields (ed.), <em>The Oxford\nHandbook of Aristotle</em>, Oxford: Oxford University Press, 2012, pp.\n558–85.", "Peonids, F., “The Relation between the <em>Nicomachean\nEthics</em> and the <em>Politics</em> Revisited,” <em>History of\nPolitical Thought</em> 22 (2001): 1–12.", "Rowe, Christopher J., “Aims and Methods in Aristotle’s\n<em>Politics</em>,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 57–74.", "Salkever, Stephen G., “Aristotle’s Social Science,”\n<em>Political Theory</em>, 9 (1981), pp. 479–508; reprinted in\nRichard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n27–64.", "–––, <em>Finding the Mean: Theory and Practice\nin Aristotelian Political Philosophy</em>, Princeton: Princeton\nUniversity Press, 1990.", "Santas, Gerasimos X.,“The Relation between Aristotle’s\nEthics and Politics,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. I, pp. 160–76.", "Smith, Nicholas D. and Robert Mayhew, “Aristotle on What the\nPolitical Scientist Needs to Know,” in K. I. Boudouris (ed.)\n<em>Aristotelian Political Philosophy</em>, Athens: International\nCenter for Greek Philosophy and Culture, 1995, vol. I, pp.\n189–98.", "Vander Waerdt, Paul A., “The Political Intention of\nAristotle’s Moral Philosophy,” <em>Ancient Philosophy</em>\n5 (1985), 77–89.", "–––, “The Plan and Intention of\nAristotle’s Ethical and Political Writings,” <em>Illinois\nClassical Studies</em> 16 (1991), 231–53.\n</ul>\n<h4>3. Political Naturalism</h4>\n<ul class=\"hanging\">", "Ambler, Wayne, “Aristotle’s Understanding of the Naturalness\nof the City,” <em>Review of Politics</em>, 47 (1985),\n163–85.", "Annas, Julia, “Aristotle on Human Nature and Political\nVirtue,” <em>The Review of Metaphysics</em>, 49 (1996),\n731–54.", "Berryman, Sylvia, <em>Aristotle on the Sources of the Ethical\nLife</em>, Oxford: Oxford University Press, 2919, esp. Ch. 3\n“Naturalism in Aristotle’s <em>Politics.</em>”", "Chan, Joseph, “Does Aristotle’s Political Theory Rest on a\nBlunder?” <em>History of Political Thought</em>, 13 (1992),\n189–202.", "Chappell, Timothy, “‘Naturalism’ in Aristotle’s\nPolitical Philosophy,” in Ryan K. Balot (ed.), <em>A Companion\nto Greek and Roman Political Thought</em>, Oxford: Wiley-Blackwell,\n2009, pp. 382–98.", "Cherry, K. and E. A. Goerner, “Does Aristotle’s Polis Exist\n‘By Nature’?” <em>History of Political Thought</em>,\n27 (2006), 563–85.", "Cooper, John M., “Political Animals and Civic\nFriendship,” in Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 220–41; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n65–89.", "DePew, David J., “Humans and Other Political Animals in\nAristotle’s <em>Historia Animalium</em>,” <em>Phronesis</em>, 40\n(1995), 156–76.", "–––, “Political Animals and the Genealogy\nof the <em>Polis</em>: Aristotle’s <em>Politics</em> and\nPlato’s <em>Statesman</em>,” in Geert Keil and Nora Kreft\n(eds.), <em>Aristotle’s Anthropology</em>, Cambridge: Cambridge\nUniversity Press, 2019, pp. 238–57.", "Everson, Stephen, “Aristotle on the Foundations of the\nState,” <em>Political Studies</em>, 36 (1988),\n89–101.", "Karbowski, Joseph, “Political Animals and Human Nature in\nAristotle’s <em>Politics</em>,” in Geert Keil and Nora\nKreft (eds.), <em>Aristotle’s Anthropology</em>, Cambridge:\nCambridge University Press, 2019, pp. 221–37.", "Keyt, David, “The Meaning of BIOS in Aristotle’s\n<em>Ethics</em> and <em>Politics</em>,” <em>Ancient\nPhilosophy</em> , 9 (1989), 15–21; reprinted in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017,\n101–9.", "–––, “Three Basic Theorems in Aristotle’s\n<em>Politics</em>,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 118–41; reprinted in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017,\n111–38.", "Kullmann, Wolfgang, “Man as a Political Animal in\nAristotle,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n94–117.", "Lloyd, Geoffrey, “Aristotle on the Natural Sociability,\nSkills and Intelligence of Animals,” in Verity Harte and Melissa\nLane (eds.), <em>Politeia in Greek and Roman Philosophy</em>,\nCambridge: Cambridge University Press, 2013, pp. 277–94.", "Miller, Fred D., Jr., “Aristotle: Naturalism,” in\nChristopher J. Rowe and Malcolm Schofield (eds.), <em>The Cambridge\nHistory of Greek and Roman Political Thought</em>, Cambridge:\nCambridge University Press, 2000, pp. 321–43.", "Mulgan, Richard, “Aristotle’s Doctrine that Man is a\nPolitical Animal,” <em>Hermes</em>, 102 (1974),\n438–45.", "Reeve, C. D. C., “The Naturalness of the Polis in\nAristotle,” in Georgios Anagnostopoulos (ed.), <em>A Companion\nto Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n512–25.", "Roberts, Jean, “Political Animals in the <em>Nicomachean\nEthics</em>,” <em>Phronesis</em>, 34 (1989), 185–202.\n</ul>\n<h4>4. Household: Women, Children, and Slaves</h4>\n<ul class=\"hanging\">", "Booth, William James, “Politics and the Household: A\nCommentary on Aristotle’s <em>Politics</em> Book One,”\n<em>History of Political Thought</em>, 2 (1981), 203–26.", "Brunt, P. A., “Aristotle and Slavery,” in <em>Studies\nin Greek History and Thought</em>, Oxford: Oxford University Press,\n1993, pp. 434–88.", "Chambliss, J. J., “Aristotle’s Conception of Children and\nthe Poliscraft,” <em>Educational Studies</em>, 13 (1982),\n33–43.", "Cole, Eve Browning, “Women, Slaves, and ‘Love of\nToil’ in Aristotle’s Moral Psychology,” in Bat-Ami Bar On\n(ed.), <em>Engendering Origins: Critical Feminist Readings in Plato\nand Aristotle</em>, Albany: SUNY Press, 1994, pp. 127–44.", "Deslauriers, Marguerite, “The Virtues of Women and\nSlaves,” <em>Oxford Studies in Ancient Philosophy</em>, 25\n(2003), 213–31.", "–––, “Political Rule Over Women in\n<em>Politics</em>,” in Thornton Lockwood and Thanassis Samaras\n(eds.), <em>Aristotle’s Politics: A Critical Guide</em>, Cambridge:\nCambridge University Press, 2015, pp. 46–63.", "Fortenbaugh, W. W., “Aristotle on Slaves and Women,”\nin Jonathan Barnes et al. (eds.), <em>Articles on Aristotle</em>, vol.\n2, Ethics and Politics. London: Duckworth, 1977, pp. 135–9.", "Frank, Jill, “Citizens, Slaves, and Foreigners: Aristotle on\nHuman Nature,” <em>American Political Science Review</em>, 98\n(2004), 91–104.", "Freeland, Cynthia, <em>Feminist Interpretations of Aristotle</em>,\nUniversity Park, PA: Pennsylvania State University Press, 1998.", "Garnsey, Peter, <em>Ideas of Slavery from Aristotle to\nAugustine</em>, Cambridge: Cambridge University Press, 1996.", "Lindsay, Thomas K., “Was Aristotle Racist, Sexist, and\nAnti-Democratic?: A Review Essay,” <em>Review of Politics</em>\n56 (1994), 127–51.", "Lockwood, Thornton, “Justice in Aristotle’s Household and\nCity,” <em>Polis</em>, 20 (2003), 1–21.", "–––, “Is Natural Slavery\nBeneficial?” <em>Journal of the History of Philosophy</em>, 45\n(2007), 207–21.", "Mayhew, Robert, <em>The Female in Aristotle’s Biology: Reason or\nRationalization</em>, Chicago: University of Chicago Press, 2004.", "Modrak, Deborah, “Aristotle: Women, Deliberation, and\nNature,” in Bat-Ami Bar On (ed.), <em>Engendering Origins:\nCritical Feminist Readings in Plato and Aristotle</em>, Albany: SUNY\nPress, 1994, pp. 207–21.", "Mulgan, Robert G., “Aristotle and the Political Role of\nWomen,” <em>History of Political Thought</em>, 15 (1994),\n179–202.", "Nagle, D. Brendan, <em>The Household as the Foundation of\nAristotle’s Polis</em>, Cambridge: Cambridge University Press,\n2006.", "Pellegrin, Pierre, “Natural Slavery,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 92–116.", "Saxenhouse, Arlene W., “Family, Polity, and Unity: Aristotle\non Socrates’ Community of Wives,” <em>Polity</em>, 15 (1982),\n202–19.", "Schofield, Malcolm, “Ideology and Philosophy in Aristotle’s\nTheory of Slavery,” in Günther Patzig (ed.)\n<em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 1–27; reprinted in Richard\nKraut and Steven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n91–119.", "Senack, Christine M., “Aristotle on the Woman’s Soul,”\nin Bat-Ami Bar On (ed.), <em>Engendering Origins: Critical Feminist\nReadings in Plato and Aristotle</em>, Albany: SUNY Press, 1994, pp.\n223–36.", "Simpson, Peter, “Aristotle’s Criticism of Socrates’\nCommunism of Wives and Children,” <em>Apeiron</em>, 24 (1991),\n99–114.", "Smith, Nicholas D., “Plato and Aristotle on the Nature of\nWomen,” <em>Journal of the History of Philosophy</em>, 21\n(1983), 467–78.", "–––, “Aristotle’s Theory of Natural\nSlavery,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n142–55.", "Spelman, E. V., “Aristotle and the Politicization of the\nSoul,” in Sandra Harding and M. B. Hintikka (eds)\n<em>Discovering Reality: Feminist Perspectives on Epistemology,\nMetaphysics, Methodology, and Philosophy of Science</em>, Dordrecht:\nD. Reidel, 1983, pp. 17–30.", "–––, “Who’s Who in the Polis,” in\nBat-Ami Bar On (ed.), <em>Engendering Origins: Critical Feminist\nReadings in Plato and Aristotle</em>, Albany: SUNY Press, 1994, pp.\n99–125.", "Stauffer, Dana J., “Aristotle’s Account of the Subjection of\nWomen,” <em>Journal of Politics</em>, 70 (2008),\n929–41.\n</ul>\n<h4>5. Political Economy</h4>\n<ul class=\"hanging\">", "Ambler, Wayne H., “Aristotle on Acquisition,”\n<em>Canadian Journal of Political Science</em>, 17 (1984),\n487–502.", "Crespo, Ricardo F., <em>A Re-assessment of\nAristotle</em>’<em>s Economic Thought</em>. London: Routledge,\n2014.", "Dobbs, Darrell, “Aristotle’s Anticommunism,”\n<em>American Journal of Political Science</em>, 29 (1985),\n29–46.", "Finley, M. I., “Aristotle and Economic Analysis,” in\nJonathan Barnes et al. (eds.), <em>Articles on Aristotle</em>, vol. 2,\nEthics and Politics. London: Duckworth, 1977, pp. 140–58.", "Gallagher, Robert L., <em>Aristotle’s Critique of Political\nEconomy with a Contemporary Application.</em> London: Routledge,\n2018.", "Hadreas, Peter, “Aristotle on the Vices and Virtue of\nWealth,” <em>Journal of Business Ethics, </em>39\n(2002), 361–76.", "Hartman, Edwin M., “Virtue, Profit, and the Separation\nThesis: An Aristotelian View,” <em>Journal of Business Ethics\n</em>,99 (2011), 5–17.", "–––, <em>Virtue in Business: Conversations with\nAristotle</em>. Cambridge: Cambridge University Press, 2013.", "Inamura, Kazutaka, “The Role of Reciprocity in Aristotle’s\nTheory of Political Economy,” <em>History of Political\nThought</em>, 32 (2011), 565–87.", "Irwin, Terence H., “Aristotle’s Defense of Private\nProperty,” in David Keyt and Fred D. Miller, Jr. (eds.). <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n200–25.", "Judson, Lindsay, “Aristotle on Fair Exchange,”\n<em>Oxford Studies in Ancient Philosophy</em>, 15 (1997),\n147–75.", "Keyt, David, “Aristotle and the Joy of Working,” in\nDavid Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, pp. 223–39.", "Mathie, William,“Property in the Political Science of\nAristotle,” in Anthony Parel &amp; Thomas Flanagan(eds.),\n<em>Theories of Property: Aristotle to the Present</em>. Waterloo,\nOnt.: Wilfrid Laurier University Press, 1979, pp. 12–35.", "Mayhew, Robert, “Aristotle on Property,” <em>The\nReview of Metaphysics</em>, 46 (1993), 802–31.", "McNeill, D., “Alternative Interpretations of Aristotle on\nExchange and Reciprocity,” <em>Public Affairs Quarterly</em>, 4\n(1990), 55–68.", "Mei, Todd S., “The Preeminence of Use: Reevaluating the\nRelation between Use and Exchange in Aristotle’s Economic\nThought,” <em>American Journal of the History of Philosophy</em>\n47 (2009), 523–48.", "Meikle, Scott, “Aristotle on Money” <em>Phronesis</em>\n39 (1994), 26–44.", "–––, <em>Aristotle’s Economic Thought</em>,\nOxford: Oxford University Press, 1995.", "Miller, Fred D. Jr., “Property Rights in Aristotle,”\nin Richard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n121–44.", "–––, “Was Aristotle the First\nEconomist?” <em>Apeiron</em>, 31 (1998), 387–98.", "–––, “Aristotle and Business: Friend or\nFoe?” in Eugene Heath and Byron Kaldis (eds.), <em>Wealth,\nCommerce and Philosophy: Foundational Thinkers and Business\nEthics</em>, Chicago: University of Chicago Press, 2017, pp.\n31–52.", "Morris, Tom, <em>If Aristotle Ran General Motors: The New Soul of\nBusiness</em>, New York: Henry Holt, 1997.", "Nielsen, Karen Margrethe, “Economy and Private\nProperty,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 67–91.", "Solomon, Robert C., “Corporate Roles, Personal Virtues: An\nAristotelian Approach to Business Ethics,” <em>Business Ethics\nQuarterly</em>, 2 (1992), 317–39.", "–––, “Aristotle, Ethics, and Business\nOrganizations,” <em>Organization Studies, </em>25\n(2004), 1021–43.\n</ul>\n<h4>6. Political Justice and Injustice</h4>\n<ul class=\"hanging\">", "Brunschwig, Jacques, “The Aristotelian Theory of\nEquity,” in Michael Frede and Gisela Striker (eds.),\n<em>Rationality in Greek Thought</em>, Oxford: Oxford University\nPress, pp. 115–55.", "Marguerite Deslauriers, “Political Unity and\nInequality,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 117–43.", "Georgiadis, Constantine, “Equitable and Equity in\nAristotle,” in Spiro Panagiotou (ed.), <em>Justice, Law and\nMethod in Plato and Aristotle</em>, Edmonton: Academic Printing &amp;\nPublishing, 1987, pp. 159–72.", "Keyt, David, “Aristotle’s Theory of Distributive\nJustice,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n238–78.", "–––, “The Good Man and the Upright Citizen\nin Aristotle’s <em>Ethics</em> and <em>Politics</em>,” in\nDavid Keyt and Fred D. Miller, Jr. (eds.), <em>Freedom, Reason, and\nthe Polis: Essays in Ancient Greek Political Philosophy</em>,\nCambridge: Cambridge University Press, 2007, 220–40. Reprinted\nin David Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, 197–221.", "–––, “Nature and Justice,” in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017, pp.\n1–19.", "Lockwood, Thornton, “Polity, Political Justice, and\nPolitical Mixing,” <em>History of Political Thought</em>, 27\n(2006), 207–22.", "Morrison, Donald, “The Common Good,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 176–98.", "Nussbaum, Martha C., “Nature, Function, and Capability:\nAristotle on Political Distribution,” in Günther Patzig\n(ed.), <em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 153–87.", "Roberts, Jean, “Justice and the Polis,” in Christopher\nJ. Rowe and Malcolm Schofield (eds.), <em>The Cambridge History of\nGreek and Roman Political Thought</em>, Cambridge: Cambridge\nUniversity Press, 2000, pp. 344–65.", "Rosler, Andrés, “Civic Virtue: Citizenship,\nOstracism, and War,” in Marguerite Deslauriers and Pierre\nDestrée (eds.), <em>The Cambridge Companion to Aristotle’s\nPolitics</em>, Cambridge: Cambridge University Press, 2013, pp.\n144–75.", "Saxonhouse, Arlene W., “Aristotle on the Corruption of\nRegimes: Resentment and Justice,” in Thornton Lockwood and\nThanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n184–203.", "Schütrumpf, Eckart, “Little to Do With Justice:\nAristotle on Distributing Political Power,” in Thornton Lockwood\nand Thanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n163–83.", "Young, Charles M., “Aristotle on Justice,” <em>The\nSouthern Journal of Philosophy</em>, 27 (1988), 233–49.", "Zingano, Marco, “Natural, Ethical, and Political\nJustice,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 199–222.\n</ul>\n<h4>7. Political Friendship and Enmity</h4>\n<ul class=\"hanging\">", "Cooper, John M., “Political Animals and Civic\nFriendship,” in Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 220–41; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n65–89.", "Hatzistavrou, Antony, “Faction,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 301–23.", "Irrera, Elena, “Between Advantage and Virtue:\nAristotle’s Theory of Political Friendship,” <em>History\nof Political Thought</em>, 26 (2005), 565–85.", "Jang, Misung, “Aristotle’s Political Friendship as\nSolidarity,” in Liesbeth Huppes-Cluysenaer, &amp; Nuno M.S.\nCoelho (eds.), <em>Aristotle on Emotions in Law and Politics,</em>\nDordrecht: Springer, 2018. pp. 417–33.", "Kalimtzis, Kostas, <em>Aristotle on Political Enmity and Disease:\nAn Inquiry into Stasis</em>, Albany, NY: State University of New York\nPress, 2000.", "Kreft, Nora, “Aristotle on Friendship and Being\nHuman,” in Geert Keil and Nora Kreft (eds.),\n<em>Aristotle’s Anthropology</em>, Cambridge: Cambridge\nUniversity Press, 2019, pp. 182–99.", "Kronman, Anthony, “Aristotle’s Idea of Political\nFraternity,” <em>American Journal of Jurisprudence</em>, 24\n(1979),114–138.", "Leontsini, Eleni, “The Motive of Society: Aristotle on Civic\nFriendship, Justice, and Concord,” <em>Res Publica</em>, 19\n(2013), 21–35.", "Ludwig, Paul W., <em>Rediscovering Political Friendship:\nAristotle’s Theory and Modern Identity, Community, and Equality</em>,\nCambridge: Cambridge University Press, 2020.", "Miller, Fred D., Jr., “Aristotle on Deviant\nConstitutions,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. II, pp. 105–15.", "Mulgan, Richard, “The Role of Friendship in\nAristotle’s Political Theory,” in Preston King, and\nHeather Devere (eds.), <em>The Challenge to Friendship in\nM</em><em>odernity</em>, London: Frank Cass, 2000, pp.\n15–32.", "Schofield, Malcolm, “Political Friendship and the Ideology\nof Reciprocity,” in <em>Saving the City</em>, London: Routledge,\n1999, pp. 82–99.", "Schwarzenbach, Sibyl, “On Civic Friendship,”\n<em>Ethics</em>, 107 (1996), 97–128.", "Skultety, Steven C.,. “Defining Aristotle’s Conception\nof <em>Stasis</em> in the <em>Politics</em>,” <em>Phronesis</em>\n54 (2009), 346–70.", "–––, <em>Conflict in\nAristotle</em><em>’</em><em>s Political Philosophy</em>, Albany\nNY: State University of New York Press, 2019.", "Sosa, Javier Echeñique &amp; Jose Antonio Errázuriz\nBesa, “Aristotle on Personal Enmity,” <em>Ancient\nPhilosophy</em>, 62 (2022), 215–31.", "Ward, Ann, “Friendship and politics in Aristotle’s\n<em>Nicomachean Ethics</em>,” <em>European Journal of Political\nTheory</em>, 10 (2011), 443–62.", "Weed, Ronald, <em>Aristotle on Stasis: A Psychology of Political\nConflict</em>, Berlin: Logos Verlag, 2007.", "Yack, Bernard, “Community and Conflict in Aristotle’s\nPolitical Philosophy,” <em>Review of Politics</em>, 47\n(1985), 92–112.", "–––,  “Natural Right and\nAristotle’s Understanding of Justice,” <em>Political\nTheory</em>, 18 (1990), 216–37.\n</ul>\n<h4>8. Citizenship, Civic Obligation, and Political Rights</h4>\n<ul class=\"hanging\">", "Allan, D. J., “Individual and State in the <em>Ethics</em>\nand <em>Politics</em>,” <em>Entretiens sur l’Antiquité\nClassique IX, La ‘Politique’ d’Aristote</em>, Geneva:\nFondation Hardt, 1964, pp. 53–95.", "Barnes, Jonathan, “Aristotle and Political Liberty,”\nin Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 249–63; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n185–201.", "Collins, Susan D., <em>Aristotle and the Rediscovery of\nCitizenship</em>, Cambridge: Cambridge University Press, 2006.", "Frede, Dorothea, “Citizenship in Aristotle’s\n<em>Politics</em>,” in Richard Kraut and Steven Skultety (eds.),\n<em>Aristotle’s Politics: Critical Essays</em>, Lanham, MD: Rowman and\nLittlefield, 2005, pp. 167–84.", "Horn, Christoph, “Law, Governance, and Political\nObligation,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 223–46.", "Irwin, Terence H., “The Good of Political Activity,”\nin Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 73–98.", "Kraut, Richard, “Are There Natural Rights in\nAristotle?” <em>The Review of Metaphysics</em>, 49 (1996),\n755–74.", "Lane, Melissa, “Claims to Rule: The Case of the\nMutlitude,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 247–74.", "Long, Roderick T., “Aristotle’s Conception of\nFreedom,” <em>The Review of Metaphysics</em>, 49 (1996),\n775–802; reprinted in Richard O. Brooks and James Bernard Murphy\n(eds.), <em>Aristotle and Modern Law</em>, Aldershot Hants, UK:\nAshgate Publishing Co., 2003, pp. 384–410.", "Miller, Fred D., Jr., “Aristotle and the Origins of Natural\nRights,” <em>The Review of Metaphysics</em>, 49 (1996),\n873–907.", "–––, “Aristotle’s Theory of Political\nRights,” in Richard O. Brooks and James Bernard Murphy (eds.),\n<em>Aristotle and Modern Law</em>, Aldershot Hants, UK: Ashgate\nPublishing Co., 2003, pp. 309–50.", "Morrison, Donald, “Aristotle’s Definition of Citizenship: A\nProblem and Some Solutions,” <em>History of Philosophy\nQuarterly</em>, 16 (1999), 143–65.", "Mulgan, Robert G., “Aristotle and the Value of Political\nParticipation,” <em>Political Theory</em>, 18 (1990),\n195–215.", "Roberts, Jean, “Excellences of the Citizen and of the\nIndividual,” in Georgios Anagnostopoulos (ed.), <em>A Companion\nto Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n555–65.", "Rosler, Andrés, “Civic Virtue: Citizenship,\nOstracism, and War,” in Marguerite Deslauriers and Pierre\nDestrée (eds.), <em>The Cambridge Companion to Aristotle’s\nPolitics</em>, Cambridge: Cambridge University Press, 2013, pp.\n144–75.", "Samaras, Thanassis, “Aristotle and the Question of\nCitizenship,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 123–41.", "Schofield, Malcolm, “Sharing in the Constitution,”\n<em>The Review of Metaphysics</em>, 49 (1996), 831–58; reprinted\nin Richard O. Brooks and James Bernard Murphy (eds.), <em>Aristotle\nand Modern Law</em>, Aldershot Hants, UK: Ashgate Publishing Co.,\n2003, pp. 353–80.", "Zuckert, Catherine H., “Aristotle on the Limits and\nSatisfactions of Political Life,” <em>Interpretation</em>, 11\n(1983), 185–206.\n</ul>\n<h4>9. Constitutional Theory</h4>\n<ul class=\"hanging\">", "Balot, Ryan, “The ‘Mixed Regime’ In Aristotle’s\n<em>Politics</em>,” in Thornton Lockwood and Thanassis Samaras\n(eds.), <em>Aristotle’s Politics: A Critical Guide</em>, Cambridge:\nCambridge University Press, 2015, pp. 103–22.", "Bates, Clifford A., <em>Aristotle’s “Best Regime”:\nKingship, Democracy, and the Rule of Law</em>, Baton Rouge: Louisiana\nState University Press, 2003.", "Bobonich, Christopher, “Aristotle, Decision Making, and the\nMany,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 142–62.", "Cherry, Kevin M., “The Problem of Polity: Political\nParticipation in Aristotle’s Best Regime,” <em>Journal of\nPolitics</em>, 71 (2009), 406–21.", "Coby, Patrick, “Aristotle’s Three Cities and the Problem of\nFaction,” <em>Journal of Politics</em>, 50 (1988),\n896–919.", "Destrée, Pierre, “Aristotle on Improving Imperfect\nCities,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 204–23.", "Dietz, Mary G., “Between Polis and Empire: Aristotle’s\n<em>Politics</em>,” <em>American Political Science Review</em>\n106 (2012), 275–93.", "Garsten, Bryan, “Deliberating and Acting Together,” in\nMarguerite Deslauriers and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 324–49.", "Huxley, G., “On Aristotle’s Best State,” in Paul\nCartledge and F. D. Harvey (eds.), <em>Crux: Essays Presented to G. E.\nM. de Ste. Croix</em>, London: Duckworth, 1985, pp. 139–49.", "Johnson, Curtis N., <em>Aristotle’s Theory of the State</em>, New\nYork: Macmillan, 1990.", "Keyt, David, “Aristotle and Anarchism,” <em>Reason\nPapers</em>, 18 (1993), 133–52; reprinted in Richard Kraut and\nSteven Skultety. <em>Aristotle’s Politics: Critical Essays</em>,\nLanham, MD: Rowman and Littlefield, 2005, pp. 203–22.", "Kraut, Richard, “Aristotle’s Critique of False\nUtopias,” in Otfried Höffe (ed.), <em>Aristoteles\nPolitik</em>, Berlin: Akademie Verlag, 2001, pp. 59–73.", "Lintott, Andrew, “Aristotle and Democracy,” <em>The\nClassical Quarterly</em> (New Series), 42 (1992), 114–28.", "Mayhew, Robert, <em>Aristotle’s Criticism of Plato’s\nRepublic</em>, Lanham, MD: Rowman &amp; Littlefield, 1997.", "–––, “Rulers and Ruled,” in Georgios\nAnagnostopoulos (ed.), <em>A Companion to Aristotle</em>, Oxford:\nWiley-Blackwell, 2009, pp. 526–39.", "Miller, Fred D., Jr., “Aristotle on the Ideal\nConstitution,” in Georgios Anagnostopoulos (ed.), <em>A\nCompanion to Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n540–54.", "–––, “The Rule of Reason,” in\nMarguerite Deslauriers and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 38–66.", "Mulgan, Richard, “Aristotle’s Analysis of Oligarchy and\nDemocracy,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n307–22.", "–––, “Constitutions and the Purpose of the\nState,” in Otfried Höffe (ed.), <em>Aristoteles\nPolitik</em>, Berlin: Akademie Verlag, 2001, pp. 93–106.", "Mulhern, J. J., “<em>Politeia</em> in Greek Literature,\nInscriptions, and in Aristotle’s <em>Politics</em>: Reflections on\nTranslation and Interpretation,” in Thornton Lockwood and\nThanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n84–102.", "Murray, O., “Polis and <em>Politeia</em> in\nAristotle,” in Mogens Herman Hansen (ed.), <em>The Ancient Greek\nCity-State</em>, Copenhagen: Muksgaard, 1993, pp. 197–210.", "Ober, Joshua, “Aristotle’s Natural Democracy,” in\nRichard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n223–43.", "–––, “Democracy’s Wisdom: An Aristotelian\nMiddle Way for Collective Judgment,” <em>American Political\nScience Review</em>, 107 (2013), 104–22.", "–––, “Nature, History, and Aristotle’s\nBest Possible Regime,” in Thornton Lockwood and Thanassis\nSamaras (eds.), <em>Aristotle’s Politics: A Critical Guide</em>,\nCambridge: Cambridge University Press, 2015, pp. 224–43.", "Polansky, Ronald, “Aristotle on Political Change,” in\nDavid Keyt and Fred D. Miller, Jr. (eds.), <em>A Companion to\nAristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n322–45.", "Rosler, Andres, <em>Political Authority and Obligation in\nAristotle</em>, Oxford: Oxford University Press, 2005.", "Rowe, C. J., “Reality and Utopia,” <em>Elenchos</em>,\n10 (1989), 317–36.", "–––, “Aristotelian Constitutions,”\nin Christopher J. Rowe and Malcolm Schofield (eds.), <em>The Cambridge\nHistory of Greek and Roman Political Thought</em>, Cambridge:\nCambridge University Press, 2000, pp. 366–89.", "Strauss, Barry, “On Aristotle’s Critique of Athenian\nDemocracy,” in Carnes Lord and David O’Connor (eds.), <em>Essays\non the Foundations of Aristotelian Political Science</em>, Berkeley:\nUniversity of California Press, 1991, pp. 212–33.", "Vander Waert, Paul A., “Kingship and Philosophy in\nAristotle’s Best Regime,” <em>Phronesis</em>, 30 (1985),\n249–73.", "Waldron, Jeremy, “The Wisdom of the Multitude: Some\nReflections on Book 3, Chapter 11 of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 20 (1992),\n613–41; reprinted in Richard Kraut and Steven Skultety (eds.),\n<em>Aristotle’s Politics: Critical Essays</em>, Lanham, MD: Rowman and\nLittlefield, 2005, pp. 145–65.", "Wilson, James L., “Deliberation, Democracy, and the Rule of\nReason in Aristotle’s <em>Politics</em>,” <em>American Political\nScience Review</em>, 105 (2011), 259–74.\n</ul>\n<h4>10. Education</h4>\n<ul class=\"hanging\">", "Burnyeat, Myles F., “Aristotle on Learning to Be\nGood,” in Amelie O. Rorty (ed.), <em>Essays on Aristotle’s\nEthics</em>, Berkeley: University of California Press, 1980, pp.\n69–92.", "Curren, Randall R., <em>Aristotle on the Necessity of Public\nEducation</em>, Lanham, MD: Rowman and Littlefield, 2000.", "Depew, David J., “Politics, Music, and Contemplation in\nAristotle’s Ideal State,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 346–80.", "Destrée, Pierre, “Education, Leisure, and\nPolitics,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 301–23.", "Frede, Dorothea, “The Deficiency of Human Nature: The Task\nof a ‘Philosophy of Human Nature’,” in Geert Keil\nand Nora Kreft (eds.), <em>Aristotle’s Anthropology</em>,\nCambridge: Cambridge University Press, 2019, pp. 258–74.", "Jimenez, Marta, <em>Aristotle on Shame and Learning to Be\nGood</em>, Oxford: Oxford University Press, 2021.", "Kraut, Richard, “Aristotle on Method and Moral\nEducation,” in Jyl Gentzler (ed.), <em>Method in Ancient\nPhilosophy</em>, Oxford: Oxford University Press, 1998, pp.\n171–90.", "–––, “Aristotle on Becoming Good:\nHabituation, Reflection, and Perception,” in Christopher Shields\n(ed.), <em>The Oxford Handbook of Aristotle</em>, Oxford: Oxford\nUniversity Press, 2012, pp. 529–57.", "Lord, Carnes, <em>Education and Culture in the Political Thought\nof Aristotle</em>, Ithaca, NY: Cornell University Press, 1982.", "Lynch, John Patrick, <em>Aristotle’s School</em>, Berkeley:\nUniversity of California Press, 1972.", "Muzio, G. D., “Aristotle on Improving One’s\nCharacter,” <em>Phronesis</em>, 45 (2000), 205–19.", "Reeve, C. D. C,  “Aristotelian Education,” in A.\nO. Rorty (ed.), <em>Philosophers on Education</em>, London: Routledge,\n1998, pp. 51–65.", "Stalley, Richard, “Education and the State,” in\nGeorgios Anagnostopoulos (ed.), <em>A Companion to Aristotle</em>,\nOxford: Wiley-Blackwell, 2009, pp. 566–76.\n</ul>\n<h4>11. Law</h4>\n<ul class=\"hanging\">", "Brooks, Richard O. and James B. Murphy (eds.), <em>Aristotle and\nModern Law</em>, Aldershot Hants, UK and Burlington, VT: Ashgate,\n2003.", "Burns, Tony, “Aristotle and Natural Law,” <em>History\nof Political Thought</em>, 19 (1998), 142–66.", "Duke, George, <em>Aristotle and Law: The Politics of Nomos</em>,\nCambridge: Cambridge University Press.", "Gordley, James R., “Tort Law in the Aristotelian\nTradition,” in Salvador Rus Rufino (ed.), <em>Aristoteles: El\nPensamiento Politico y Juridico</em>. León &amp; Seville:\nUniversity of León &amp; University of Seville, 1999, pp.\n71–97.", "Hamburger, Max, <em>Morals and Law: The Growth of Aristotle’s\nLegal Theory</em>, New Haven: Yale University Press, 1951.", "Huppes-Cluysenaer, Liesbeth &amp; Nuno M..S. Coelho (eds.),\n<em>Aristotle on Emotions in Law and Politics</em>, Dordrecht:\nSpringer, 2018.", "Miller, Eugene, “Prudence and the Rule of Law,”\n<em>American Journal of Jurisprudence</em>, 24 (1979),\n181–206.", "Miller, Fred D., Jr., “Aristotle’s Philosophy of Law,”\nin Fred D. Miller, Jr. and Carrie-Ann Biondi (eds.), <em>A History of\nthe Philosophy of Law from the Ancient Greeks to the Scholastics</em>\n[vol. 6 of <em>A Treatise of Legal Philosophy and General\nJurisprudence</em>, ed. Enrico Pattaro]. Dordrecht: Springer, 2007,\npp.79–110.", "Schroeder, Donald N., “Aristotle on Law,”\n<em>Polis</em>, 4 (1981), 17–31; reprinted in Richard O. Brooks\nand James Bernard Murphy (eds.), <em>Aristotle and Modern Law</em>,\nAldershot Hants, UK: Ashgate Publishing Co., 2003, pp.\n37–51.", "Wormuth, F. D., “Aristotle on Law,” in M. R. Korvitz\nand A. E. Murphy (eds.), <em>Essays in Political Theory Presented to\nG. H. Sabine,</em> Ithaca, NY: Cornell University Press, 1948,\npp. 45–61.", "Zanetti, Gianfrancesco, “Problematic Aspects of\nAristotle’s Philosophy of Law,” <em>Archiv\nf</em><em>ü</em><em>r Rechts- und Sozialphilosophie</em>, 81\n(1995), 49–64.\n</ul>\n<h4>12. Aristotle and Contemporary Politics</h4>\n<ul class=\"hanging\">", "Biondi, Carrie-Ann, “Aristotle on the Mixed Constitution and\nIts Relevance for American Political Thought,” in David Keyt and\nFred D. Miller, Jr. (eds.), <em>Freedom, Reason, and the Polis: Essays\nin Ancient Greek Political Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 2007, 176–98.", "Frank, Jill, <em>A Democracy of Distinction: Aristotle and the\nWork of Politics</em>, Chicago: University of Chicago Press,\n2005.", "Galston, William A., <em>Justice and the Human Good</em>, Chicago:\nUniversity of Chicago Press, 1980.", "Garver, Eugene, <em>Aristotle’s Politics: Living Well and Living\nTogether</em>, Chicago: Chicago University Press, 2011.", "Goodman, Lenn E. and Robert Talise (eds.), <em>Aristotle’s\nPolitics Today</em>, Albany: State University of New York Press,\n2003.", "Kraut, Richard, “Aristotle and Rawls on the Common\nGood,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 350–74.", "Lord, Carnes, “Aristotle and the Idea of Liberal\nEducation,” in Josiah Ober and Charles Hedrick (eds.),\n<em>Demokrateia: A Conversation of Democracy, Ancient and Modern</em>,\nPrinceton: Princeton University Press Oxford: Blackwell, 1996, pp.\n271–88.", "Machan, Tibor R., “Aristotle and the Moral Status of\nBusiness,” <em>Journal of Value Inquiry</em>, 38 (2004),\n217–33.", "Mara, Gerald M., “The Culture of Democracy: Aristotle’s\n<em>Athênaiôn Politeia</em> as Political Theory,” in\nAristide Tessitore (ed.), <em>Aristotle and Modern Politics: The\nPersistence of Political Philosophy</em>, Notre Dame: University of\nNotre Dame Press, 2002, 307–41.", "Mulgan, Robert G., “Was Aristotle an ‘Aristotelian\nSocial Democrat’?” <em>Ethics</em>, 111 (2000),\n79–101.", "Murphy, James Bernard, <em>The Moral Economy of Labor:\nAristotelian Themes in Economic Theory</em>, New Haven: Yale\nUniversity Press, 1993.", "Nussbaum, Martha C., “Aristotelian Social Democracy,”\nin R. Bruce Douglas, Gerald M. Mara, and Henry S. Richardson (eds.)\n<em>Liberalism and the Good</em>, London: Routledge, 1990, pp.\n203–52.", "–––, “Capabilities and Human\nRights,” <em>Fordham Law Review</em>, 66 (1997), 273–300;\nreprinted in Richard O. Brooks and James Bernard Murphy (eds.),\n<em>Aristotle and Modern Law</em>, Aldershot Hants, UK: Ashgate\nPublishing Co., 2003, pp. 413–40.", "–––, “Aristotle, Politics, and Human\nCapabilities: A Response to Anthony, Arneson, Charlesworth, and\nMulgan,” <em>Ethics</em>, 111 (2000), 102–40.", "Pack, Spencer J., “Aristotle’s Difficult Relationship with\nModern Economic Theory,” <em>Foundations of Science</em>, 13\n(2008), 256–80.", "Rasmussen, Douglas B. and Douglas J. Den Uyl, <em>Liberty and\nNature: An Aristotelian Defense of Liberal Order</em>, La Salle, IL:\nOpen Court, 1991.", "–––, <em>Norms of Liberty: A Perfectionist Basis\nfor Non-Perfectionist Politics</em>, University Park, PA: Pennsylvania\nState University Press, 2005.", "Schollmeier, Paul, <em>Rewriting Contemporary Political Philosophy\nwith Plato and Aristotle: An Essay on Eudaimonic\nPolitics,</em> London: Bloomsbury Academic, 2019.", "Salkever, Stephen S., <em>Finding the Mean: Theory and Practice in\nAristotelian Political Philosophy</em>, Princeton: Princeton\nUniversity Press, 1990.", "Tessitore, Aristide (ed.), <em>Aristotle and Modern Politics: The\nPersistence of Political Philosophy</em>, Notre Dame: University of\nNotre Dame Press, 2002.", "Wallach, John C., “Contemporary Aristotelianism,”\n<em>Political Theory</em>, 20 (1992), 613–41.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\n<strong>Note on Citations</strong>. Passages in Aristotle are cited as\nfollows: title of treatise (italics), book (Roman numeral), chapter\n(Arabic numeral), line reference. Line references are keyed to the\n1831 edition of Immanuel Bekker which had two columns (“a”\nand “b”) on each page. <em>Politics</em> is abbreviated as\n<em>Pol.</em> and <em>Nicomachean Ethics</em> as <em>NE</em>. In this\narticle, “<em>Pol</em>. I.2.1252b27”, for example, refers\nto <em>Politics</em> book I, chapter 2, page 1252, column b, line 27.\nMost translations include the Bekker page number with column letter in\nthe margin followed by every fifth line number.</p>\n<p>\nPassages in Plato are cited in a similar fashion, except the line\nreferences are to the Stephanus edition of 1578 in which pages were\ndivided into five parts (“a” through “e”).</p>\n<p>\n<strong>Caveat on Bibliography.</strong> Although fairly\nextensive, this bibliography represents only a fraction of the\nsecondary literature in English. However, the items cited here contain\nmany references to other valuable scholarly work in other languages as\nwell as in English. </p>\n<h3 id=\"GreeTextArisPoli\">A. Greek Text of Aristotle’s <em>Politics</em></h3>\n<ul class=\"hanging\">\n<li>Dreizehnter, Alois, <em>Aristoteles’ Politik</em>, Munich: Wilhelm\nFink, 1970 [generally the most reliable critical edition].</li>\n<li>Ross, W. D., <em>Aristotelis Politica</em>, Oxford: Oxford\nUniversity Press, 1957.</li>\n</ul>\n<h3 id=\"BEnglTranArisPoli\">B. English Translations of Aristotle’s <em>Politics</em></h3>\n<ul class=\"hanging\">\n<li>Barker, Ernest, revised by Richard Stalley, Oxford: Oxford\nUniversity Press, 1995.</li>\n<li>Jowett, Benjamin, revised in <em>The Complete Works of\nAristotle</em> (The Revised Oxford Translation), Jonathan Barnes\n(ed.), Princeton: Princeton University Press, 1984, vol. II, pp.\n1986–2129.</li>\n<li>Lord, Carnes, Chicago: University of Chicago Press, 2013, revised\nedition.</li>\n<li>Rackham, H., Cambridge, London: Harvard University Press,\n1932.</li>\n<li>Reeve, C. D. C., Indianapolis: Hackett Publishing Co., 2017 (new\ntranslation).</li>\n<li>Simpson, Peter L. P., Chapel Hill: University of North Carolina\nPress, 1996.</li>\n<li>Sinclair, T. A., revised by Trevor J. Saunders, Harmondsworth:\nPenguin, 1983.</li>\n</ul>\n<p>\nThe Clarendon Aristotle Series (Oxford University Press) includes\ntranslation and commentary of the <em>Politics</em> in four\nvolumes:</p>\n<ul>\n<li>Trevor J. Saunders, <em>Politics</em> I–II (1995).</li>\n<li>Richard Robinson with a supplementary essay by David Keyt,\n<em>Politics</em> III–IV (1995).</li>\n<li>David Keyt, <em>Politics</em> V–VI (1999).</li>\n<li>Richard Kraut, <em>Politics</em> VII–VIII (1997).</li>\n</ul>\n<ul>\n<li>Also of interest is the <em>Constitution of Athens</em>, an\naccount of the history and workings of the Athenian democracy.\nAlthough it was formerly ascribed to Aristotle, it is now thought by\nmost scholars to have been written by one of his pupils, perhaps at\nhis direction toward the end of Aristotle’s life. A reliable\ntranslation with introduction and notes is by P. J. Rhodes,\n<em>Aristotle: The Athenian Constitution</em>. Harmondsworth: Penguin,\n1984.</li>\n</ul>\n<h3 id=\"CAnth\">C. Anthologies</h3>\n<ul class=\"hanging\">\n<li>Barnes, Jonathan, Malcolm Schofield, and Richard Sorabji (eds.),\n<em>Articles on Aristotle</em> (Volume 2: Ethics and Politics),\nLondon: Duckworth, 1977.</li>\n<li>Boudouris, K. J. (ed.), <em>Aristotelian Political\nPhilosophy,</em> 2 volumes, Athens: Kardamitsa Publishing Co.,\n1995.</li>\n<li>Deslauriers, Marguerite, and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013.</li>\n<li>Höffe, Otfried (ed.), <em>Aristoteles Politik</em>, Berlin:\nAkademie Verlag, 2001.</li>\n<li>Keyt, David, and Fred D. Miller, Jr. (eds.), <em>A Companion to\nAristotle’s Politics</em>, Oxford: Blackwell, 1991.</li>\n<li>Kraut, Richard, and Steven Skultety (eds.), <em>Aristotle’s\nPolitics: Critical Essays</em>, Lanham, MD: Rowman and Littlefield,\n2005.</li>\n<li>Lockwood, Thornton, and Thanassis Samaras (eds.), <em>Aristotle’s\nPolitics: A Critical Guide</em>, Cambridge: Cambridge University\nPress, 2015.</li>\n<li>Lord, Carnes, and David O’Connor (eds.), <em>Essays on the\nFoundations of Aristotelian Political Science</em>, Berkeley:\nUniversity of California Press, 1991.</li>\n<li>Patzig, Günther (ed.), <em>Aristoteles’ Politik: Akten des\nXI. Symposium Aristotelicum</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990.</li>\n</ul>\n<h3 id=\"DSingAuthCommOver\">D. Single-authored Commentaries and Overviews</h3>\n<ul class=\"hanging\">\n<li>Aquinas, Thomas, <em>Commentary on Aristotle’s Politics</em>,\ntranslated by Richard J. Regan, Indianapolis Publishing Co.: Hackett,\n2007.</li>\n<li>Barker, Ernest, <em>The Political Thought of Plato and\nAristotle</em>, London: Methuen, 1906; reprinted, New York: Russell\n&amp; Russell, 1959.</li>\n<li>Bodéüs, Richard, <em>The Political Dimensions of\nAristotle’s Ethics</em>, Albany: SUNY Press, 1993.</li>\n<li>Brill, Sara, <em>Aristotle on the Concept of the Shared Life</em>,\nOxford: Oxford University Press, 2020.</li>\n<li>Hansen, Mogens Herman, <em>Reflections on Aristotle’s\nPolitics</em>, Copenhagen: Tusculaneum Press, 2013.</li>\n<li>Keyt, David, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017.</li>\n<li>Kontos, Pavlos, <em>Aristotle on the Scope of Practical Reason:\nSpectators, Legislators, Hopes, and Evils</em>, Abingdon, New York:\nRoutledge, 2021.</li>\n<li>Kraut, Richard, <em>Aristotle: Political Philosophy</em>, Oxford:\nOxford University Press, 2002.</li>\n<li>Miller, Fred D., Jr., <em>Nature, Justice, and Rights in\nAristotle’s Politics</em>, Oxford: Oxford University Press, 1995.</li>\n<li>Mulgan, Richard G., <em>Aristotle’s Political Theory</em>, Oxford:\nOxford University Press, 1977.</li>\n<li>Newman, W. L., <em>The Politics of Aristotle</em>, 4 vols. Oxford:\nOxford University Press, 1887–1902; reprinted Salem, NH: Ayer,\n1985.</li>\n<li>Nichols, Mary, <em>Citizens and Statesmen: A Study of Aristotle’s\nPolitics</em>, Lanham, MD: Rowman &amp; Littlefield, 1992.</li>\n<li>Pangle, Lorraine Smith, <em>Reason and Character: The Moral\nFoundations of Aristotelian Political Philosophy</em>, Chicago:\nUniversity of Chicago Press, 2020.</li>\n<li>Pellegrin, Pierre, <em>Endangered Excellent: On the Political\nPhilosophy of Aristotle</em>, translated by Anthony Preus, Albany, NY:\nSUNY Press, 2020.</li>\n<li>Riesbeck, David J., <em>Aristotle on Political Community</em>,\nCambridge: Cambridge University Press, 2016.</li>\n<li>Roberts, Jean, <em>Routledge Philosophy Guidebook to Aristotle and\nthe Politics</em>, London and New York: Routledge, 2009.</li>\n<li>Schütrumpf, Eckart, <em>Aristoteles: Politik</em>, 4 vols.\nBerlin and Darmstadt: Akademie Verlag, 1999–2005.</li>\n<li>Simpson, Peter, <em>A Philosophical Commentary on the Politics of\nAristotle</em>, Chapel Hill: University of North Carolina Press,\n1998.</li>\n<li>Strauss, Leo, “On Aristotle’s Politics,” in <em>The\nCity and Man</em>, Chicago: University of Chicago Press, 1964, pp.\n13–49.</li>\n<li>Susemihl, Franz, and R. D. Hicks, <em>The Politics of\nAristotle</em>, London: Macmillan, 1894. [Includes books\nI–III and VII–VIII renumbered as IV–V.]</li>\n<li>Trott, Adriel M., <em>Aristotle on the Nature of Community</em>,\nNew York: Cambridge University Press, 2005.</li>\n<li>Veogelin, Eric, <em>Order and History</em> (Vol. III:\n<em>Plato and Aristotle</em>), Baton Rouge, LA: Louisiana State\nUniversity Press, 1977.</li>\n<li>Yack, Bernard, <em>The Problems of a Political Animal: Community,\nJustice, and Conflict in Aristotelian Political Thought</em>,\nBerkeley: University of California Press, 1993.</li>\n</ul>\n<h3 id=\"EStudPartTopi\">E. Studies of Particular Topics</h3>\n<h4>1. Biographical and Textual Studies</h4>\n<ul class=\"hanging\">\n<li>Barker, Ernest, “The Life of Aristotle and the Composition\nand Structure of the <em>Politics</em>,” <em>Classical\nReview</em>, 45 (1931), 162–72.</li>\n<li>Jaeger, Werner, <em>Aristotle: Fundamentals of the History of His\nDevelopment</em>, Oxford: Oxford University Press, 1948.</li>\n<li>Kelsen, Hans, “Aristotle and the Hellenic-Macedonian\nPolicy,” in Jonathan Barnes et al. (eds.), <em>Articles on\nAristotle</em> (Volume 2: Ethics and Politics), London: Duckworth,\n1977, pp. 170–94.</li>\n<li>Lord, Carnes, “The Character and Composition of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 9 (1981),\n459–78.</li>\n</ul>\n<h4>2. Methodology and Foundations of Aristotle’s Political Theory</h4>\n<ul class=\"hanging\">\n<li>Adkins, A. W. H., “The Connection between Aristotle’s\n<em>Ethics</em> and <em>Politics</em>,” in David Keyt and Fred\nD. Miller, Jr. (eds.), <em>A Companion to Aristotle’s Politics</em>,\nOxford: Blackwell, 1991, pp. 75–93.</li>\n<li>Cherry, Kevin M., <em>Plato, Aristotle and the Purpose of\nPolitics</em>, Cambridge: Cambridge University Press, 2012.</li>\n<li>Depew, David J., “The Ethics of Aristotle’s\n<em>Politics</em>,” in Ryan K. Balot (ed.), <em>A Companion to\nGreek and Roman Political Thought</em>, Oxford: Wiley-Blackwell, 2009,\npp. 399–418.</li>\n<li>Frank Jill, “On <em>Logos</em> and Politics in\nAristotle,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 9–26.</li>\n<li>Frede, Dorothea, “The Political Character of Aristotle’s\nEthics,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 14–37.</li>\n<li>Gerson, Lloyd, “On the Scientific Character of\nAristotle’s Politics,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. I, pp. 35–50.</li>\n<li>Irwin, Terence H., “Moral Science and Political Theory in\nAristotle,” <em>History of Political Thought</em>, 6 (1985), pp.\n150–68.</li>\n<li>Kahn, Charles H., “The Normative Structure of Aristotle’s\n<em>Politics</em>,” in Günther Patzig (ed.)\n<em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 369–84.</li>\n<li>Kamtekar, Rachana, “The Relationship between\nAristotle’s Ethical and Political Discourses (<em>NE</em> X\n9),” in Ronald Polansky (ed.), <em>The Cambridge Companion to\nAristotle’s Nicomachean Ethics</em>. Cambridge, UK: Cambridge\nUniversity Press, 2014, pp. 370–82.</li>\n<li>Keyt, David, “Aristotle’s Political Philosophy,” in\nDavid Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, 165–95.</li>\n<li>Lockwood, Thornton, “<em>Politics</em> II: Political\nCritique, Political Theorizing, Political Innovation,” in\nThornton Lockwood and Thanassis Samaras (eds.), <em>Aristotle’s\nPolitics: A Critical Guide</em>, Cambridge: Cambridge University\nPress, 2015, pp. 64–83.</li>\n<li>Miller, Fred D., Jr.,  “The Unity of Aristotle’s\nEthics and Politics,” in David Konstan and David Sider (eds.),\n<em>Philoderma: Essays in Greek and Roman Philosophy in Honor of\nPhillip Mitsis</em> (Siracusa: Parnassos Press, 2022), pp.\n215–43.</li>\n<li>Ober, Joshua, “Aristotle’s Political Sociology: Class,\nStatus, and Order in the <em>Politics</em>,” in Carnes Lord and\nDavid O’Connor (eds.), <em>Essays on the Foundations of Aristotelian\nPolitical Science</em>, Berkeley: University of California Press,\n1991.</li>\n<li>Pellegrin, Pierre, “On the ‘Platonic’ Part of\nAristotle’s <em>Politics</em>,” in William Wians (ed.)\n<em>Aristotle’s Philosophical Development</em>, Lanham, MD: Rowman\n&amp; Littlefield, 1996, pp. 347–59.</li>\n<li>–––, “Is Politics a Natural\nScience?” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 27–45.</li>\n<li>–––, “Aristotle’s\n<em>Politics</em>,” in Christopher Shields (ed.), <em>The Oxford\nHandbook of Aristotle</em>, Oxford: Oxford University Press, 2012, pp.\n558–85.</li>\n<li>Peonids, F., “The Relation between the <em>Nicomachean\nEthics</em> and the <em>Politics</em> Revisited,” <em>History of\nPolitical Thought</em> 22 (2001): 1–12.</li>\n<li>Rowe, Christopher J., “Aims and Methods in Aristotle’s\n<em>Politics</em>,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 57–74.</li>\n<li>Salkever, Stephen G., “Aristotle’s Social Science,”\n<em>Political Theory</em>, 9 (1981), pp. 479–508; reprinted in\nRichard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n27–64.</li>\n<li>–––, <em>Finding the Mean: Theory and Practice\nin Aristotelian Political Philosophy</em>, Princeton: Princeton\nUniversity Press, 1990.</li>\n<li>Santas, Gerasimos X.,“The Relation between Aristotle’s\nEthics and Politics,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. I, pp. 160–76.</li>\n<li>Smith, Nicholas D. and Robert Mayhew, “Aristotle on What the\nPolitical Scientist Needs to Know,” in K. I. Boudouris (ed.)\n<em>Aristotelian Political Philosophy</em>, Athens: International\nCenter for Greek Philosophy and Culture, 1995, vol. I, pp.\n189–98.</li>\n<li>Vander Waerdt, Paul A., “The Political Intention of\nAristotle’s Moral Philosophy,” <em>Ancient Philosophy</em>\n5 (1985), 77–89.</li>\n<li>–––,  “The Plan and Intention of\nAristotle’s Ethical and Political Writings,” <em>Illinois\nClassical Studies</em> 16 (1991), 231–53.</li>\n</ul>\n<h4>3. Political Naturalism</h4>\n<ul class=\"hanging\">\n<li>Ambler, Wayne, “Aristotle’s Understanding of the Naturalness\nof the City,” <em>Review of Politics</em>, 47 (1985),\n163–85.</li>\n<li>Annas, Julia, “Aristotle on Human Nature and Political\nVirtue,” <em>The Review of Metaphysics</em>, 49 (1996),\n731–54.</li>\n<li>Berryman, Sylvia, <em>Aristotle on the Sources of the Ethical\nLife</em>, Oxford: Oxford University Press, 2919, esp. Ch. 3\n“Naturalism in Aristotle’s <em>Politics.</em>”</li>\n<li>Chan, Joseph, “Does Aristotle’s Political Theory Rest on a\nBlunder?” <em>History of Political Thought</em>, 13 (1992),\n189–202.</li>\n<li>Chappell, Timothy, “‘Naturalism’ in Aristotle’s\nPolitical Philosophy,” in Ryan K. Balot (ed.), <em>A Companion\nto Greek and Roman Political Thought</em>, Oxford: Wiley-Blackwell,\n2009, pp. 382–98.</li>\n<li>Cherry, K. and E. A. Goerner, “Does Aristotle’s Polis Exist\n‘By Nature’?” <em>History of Political Thought</em>,\n27 (2006), 563–85.</li>\n<li>Cooper, John M., “Political Animals and Civic\nFriendship,” in Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 220–41; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n65–89.</li>\n<li>DePew, David J., “Humans and Other Political Animals in\nAristotle’s <em>Historia Animalium</em>,” <em>Phronesis</em>, 40\n(1995), 156–76.</li>\n<li>–––, “Political Animals and the Genealogy\nof the <em>Polis</em>: Aristotle’s <em>Politics</em> and\nPlato’s <em>Statesman</em>,” in Geert Keil and Nora Kreft\n(eds.), <em>Aristotle’s Anthropology</em>, Cambridge: Cambridge\nUniversity Press, 2019, pp. 238–57.</li>\n<li>Everson, Stephen, “Aristotle on the Foundations of the\nState,” <em>Political Studies</em>, 36 (1988),\n89–101.</li>\n<li>Karbowski, Joseph, “Political Animals and Human Nature in\nAristotle’s <em>Politics</em>,” in Geert Keil and Nora\nKreft (eds.), <em>Aristotle’s Anthropology</em>, Cambridge:\nCambridge University Press, 2019, pp. 221–37.</li>\n<li>Keyt, David, “The Meaning of BIOS in Aristotle’s\n<em>Ethics</em> and <em>Politics</em>,” <em>Ancient\nPhilosophy</em> , 9 (1989), 15–21; reprinted in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017,\n101–9.</li>\n<li>–––, “Three Basic Theorems in Aristotle’s\n<em>Politics</em>,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 118–41; reprinted in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017,\n111–38.</li>\n<li>Kullmann, Wolfgang, “Man as a Political Animal in\nAristotle,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n94–117.</li>\n<li>Lloyd, Geoffrey, “Aristotle on the Natural Sociability,\nSkills and Intelligence of Animals,” in Verity Harte and Melissa\nLane (eds.), <em>Politeia in Greek and Roman Philosophy</em>,\nCambridge: Cambridge University Press, 2013, pp. 277–94.</li>\n<li>Miller, Fred D., Jr., “Aristotle: Naturalism,” in\nChristopher J. Rowe and Malcolm Schofield (eds.), <em>The Cambridge\nHistory of Greek and Roman Political Thought</em>, Cambridge:\nCambridge University Press, 2000, pp. 321–43.</li>\n<li>Mulgan, Richard, “Aristotle’s Doctrine that Man is a\nPolitical Animal,” <em>Hermes</em>, 102 (1974),\n438–45.</li>\n<li>Reeve, C. D. C., “The Naturalness of the Polis in\nAristotle,” in Georgios Anagnostopoulos (ed.), <em>A Companion\nto Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n512–25.</li>\n<li>Roberts, Jean, “Political Animals in the <em>Nicomachean\nEthics</em>,” <em>Phronesis</em>, 34 (1989), 185–202.</li>\n</ul>\n<h4>4. Household: Women, Children, and Slaves</h4>\n<ul class=\"hanging\">\n<li>Booth, William James, “Politics and the Household: A\nCommentary on Aristotle’s <em>Politics</em> Book One,”\n<em>History of Political Thought</em>, 2 (1981), 203–26.</li>\n<li>Brunt, P. A., “Aristotle and Slavery,” in <em>Studies\nin Greek History and Thought</em>, Oxford: Oxford University Press,\n1993, pp. 434–88.</li>\n<li>Chambliss, J. J., “Aristotle’s Conception of Children and\nthe Poliscraft,” <em>Educational Studies</em>, 13 (1982),\n33–43.</li>\n<li>Cole, Eve Browning, “Women, Slaves, and ‘Love of\nToil’ in Aristotle’s Moral Psychology,” in Bat-Ami Bar On\n(ed.), <em>Engendering Origins: Critical Feminist Readings in Plato\nand Aristotle</em>, Albany: SUNY Press, 1994, pp. 127–44.</li>\n<li>Deslauriers, Marguerite, “The Virtues of Women and\nSlaves,” <em>Oxford Studies in Ancient Philosophy</em>, 25\n(2003), 213–31.</li>\n<li>–––, “Political Rule Over Women in\n<em>Politics</em>,” in Thornton Lockwood and Thanassis Samaras\n(eds.), <em>Aristotle’s Politics: A Critical Guide</em>, Cambridge:\nCambridge University Press, 2015, pp. 46–63.</li>\n<li>Fortenbaugh, W. W., “Aristotle on Slaves and Women,”\nin Jonathan Barnes et al. (eds.), <em>Articles on Aristotle</em>, vol.\n2, Ethics and Politics. London: Duckworth, 1977, pp. 135–9.</li>\n<li>Frank, Jill, “Citizens, Slaves, and Foreigners: Aristotle on\nHuman Nature,” <em>American Political Science Review</em>, 98\n(2004), 91–104.</li>\n<li>Freeland, Cynthia, <em>Feminist Interpretations of Aristotle</em>,\nUniversity Park, PA: Pennsylvania State University Press, 1998.</li>\n<li>Garnsey, Peter, <em>Ideas of Slavery from Aristotle to\nAugustine</em>, Cambridge: Cambridge University Press, 1996.</li>\n<li>Lindsay, Thomas K., “Was Aristotle Racist, Sexist, and\nAnti-Democratic?: A Review Essay,” <em>Review of Politics</em>\n56 (1994), 127–51.</li>\n<li>Lockwood, Thornton, “Justice in Aristotle’s Household and\nCity,” <em>Polis</em>, 20 (2003), 1–21.</li>\n<li>–––, “Is Natural Slavery\nBeneficial?” <em>Journal of the History of Philosophy</em>, 45\n(2007), 207–21.</li>\n<li>Mayhew, Robert, <em>The Female in Aristotle’s Biology: Reason or\nRationalization</em>, Chicago: University of Chicago Press, 2004.</li>\n<li>Modrak, Deborah, “Aristotle: Women, Deliberation, and\nNature,” in Bat-Ami Bar On (ed.), <em>Engendering Origins:\nCritical Feminist Readings in Plato and Aristotle</em>, Albany: SUNY\nPress, 1994, pp. 207–21.</li>\n<li>Mulgan, Robert G., “Aristotle and the Political Role of\nWomen,” <em>History of Political Thought</em>, 15 (1994),\n179–202.</li>\n<li>Nagle, D. Brendan, <em>The Household as the Foundation of\nAristotle’s Polis</em>, Cambridge: Cambridge University Press,\n2006.</li>\n<li>Pellegrin, Pierre, “Natural Slavery,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 92–116.</li>\n<li>Saxenhouse, Arlene W., “Family, Polity, and Unity: Aristotle\non Socrates’ Community of Wives,” <em>Polity</em>, 15 (1982),\n202–19.</li>\n<li>Schofield, Malcolm, “Ideology and Philosophy in Aristotle’s\nTheory of Slavery,” in Günther Patzig (ed.)\n<em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 1–27; reprinted in Richard\nKraut and Steven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n91–119.</li>\n<li>Senack, Christine M., “Aristotle on the Woman’s Soul,”\nin Bat-Ami Bar On (ed.), <em>Engendering Origins: Critical Feminist\nReadings in Plato and Aristotle</em>, Albany: SUNY Press, 1994, pp.\n223–36.</li>\n<li>Simpson, Peter, “Aristotle’s Criticism of Socrates’\nCommunism of Wives and Children,” <em>Apeiron</em>, 24 (1991),\n99–114.</li>\n<li>Smith, Nicholas D., “Plato and Aristotle on the Nature of\nWomen,” <em>Journal of the History of Philosophy</em>, 21\n(1983), 467–78.</li>\n<li>–––, “Aristotle’s Theory of Natural\nSlavery,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n142–55.</li>\n<li>Spelman, E. V., “Aristotle and the Politicization of the\nSoul,” in Sandra Harding and M. B. Hintikka (eds)\n<em>Discovering Reality: Feminist Perspectives on Epistemology,\nMetaphysics, Methodology, and Philosophy of Science</em>, Dordrecht:\nD. Reidel, 1983, pp. 17–30.</li>\n<li>–––, “Who’s Who in the Polis,” in\nBat-Ami Bar On (ed.), <em>Engendering Origins: Critical Feminist\nReadings in Plato and Aristotle</em>, Albany: SUNY Press, 1994, pp.\n99–125.</li>\n<li>Stauffer, Dana J., “Aristotle’s Account of the Subjection of\nWomen,” <em>Journal of Politics</em>, 70 (2008),\n929–41.</li>\n</ul>\n<h4>5. Political Economy</h4>\n<ul class=\"hanging\">\n<li>Ambler, Wayne H., “Aristotle on Acquisition,”\n<em>Canadian Journal of Political Science</em>, 17 (1984),\n487–502.</li>\n<li>Crespo, Ricardo F., <em>A Re-assessment of\nAristotle</em>’<em>s Economic Thought</em>. London: Routledge,\n2014.</li>\n<li>Dobbs, Darrell, “Aristotle’s Anticommunism,”\n<em>American Journal of Political Science</em>, 29 (1985),\n29–46.</li>\n<li>Finley, M. I., “Aristotle and Economic Analysis,” in\nJonathan Barnes et al. (eds.), <em>Articles on Aristotle</em>, vol. 2,\nEthics and Politics. London: Duckworth, 1977, pp. 140–58.</li>\n<li>Gallagher, Robert L., <em>Aristotle’s Critique of Political\nEconomy with a Contemporary Application.</em> London: Routledge,\n2018.</li>\n<li>Hadreas, Peter, “Aristotle on the Vices and Virtue of\nWealth,” <em>Journal of Business Ethics, </em>39\n(2002), 361–76.</li>\n<li>Hartman, Edwin M., “Virtue, Profit, and the Separation\nThesis: An Aristotelian View,” <em>Journal of Business Ethics\n</em>,99 (2011), 5–17.</li>\n<li>–––, <em>Virtue in Business: Conversations with\nAristotle</em>. Cambridge: Cambridge University Press, 2013.</li>\n<li>Inamura, Kazutaka, “The Role of Reciprocity in Aristotle’s\nTheory of Political Economy,” <em>History of Political\nThought</em>, 32 (2011), 565–87.</li>\n<li>Irwin, Terence H., “Aristotle’s Defense of Private\nProperty,” in David Keyt and Fred D. Miller, Jr. (eds.). <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n200–25.</li>\n<li>Judson, Lindsay, “Aristotle on Fair Exchange,”\n<em>Oxford Studies in Ancient Philosophy</em>, 15 (1997),\n147–75.</li>\n<li>Keyt, David, “Aristotle and the Joy of Working,” in\nDavid Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, pp. 223–39.</li>\n<li>Mathie, William,“Property in the Political Science of\nAristotle,” in Anthony Parel &amp; Thomas Flanagan(eds.),\n<em>Theories of Property: Aristotle to the Present</em>. Waterloo,\nOnt.: Wilfrid Laurier University Press, 1979, pp. 12–35.</li>\n<li>Mayhew, Robert, “Aristotle on Property,” <em>The\nReview of Metaphysics</em>, 46 (1993), 802–31.</li>\n<li>McNeill, D., “Alternative Interpretations of Aristotle on\nExchange and Reciprocity,” <em>Public Affairs Quarterly</em>, 4\n(1990), 55–68.</li>\n<li>Mei, Todd S., “The Preeminence of Use: Reevaluating the\nRelation between Use and Exchange in Aristotle’s Economic\nThought,” <em>American Journal of the History of Philosophy</em>\n47 (2009), 523–48.</li>\n<li>Meikle, Scott, “Aristotle on Money” <em>Phronesis</em>\n39 (1994), 26–44.</li>\n<li>–––, <em>Aristotle’s Economic Thought</em>,\nOxford: Oxford University Press, 1995.</li>\n<li>Miller, Fred D. Jr., “Property Rights in Aristotle,”\nin Richard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n121–44.</li>\n<li>–––, “Was Aristotle the First\nEconomist?” <em>Apeiron</em>, 31 (1998), 387–98.</li>\n<li>–––, “Aristotle and Business: Friend or\nFoe?” in Eugene Heath and Byron Kaldis (eds.), <em>Wealth,\nCommerce and Philosophy: Foundational Thinkers and Business\nEthics</em>, Chicago: University of Chicago Press, 2017, pp.\n31–52.</li>\n<li>Morris, Tom, <em>If Aristotle Ran General Motors: The New Soul of\nBusiness</em>, New York: Henry Holt, 1997.</li>\n<li>Nielsen, Karen Margrethe, “Economy and Private\nProperty,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 67–91.</li>\n<li>Solomon, Robert C., “Corporate Roles, Personal Virtues: An\nAristotelian Approach to Business Ethics,” <em>Business Ethics\nQuarterly</em>, 2 (1992), 317–39.</li>\n<li>–––, “Aristotle, Ethics, and Business\nOrganizations,” <em>Organization Studies, </em>25\n(2004), 1021–43.</li>\n</ul>\n<h4>6. Political Justice and Injustice</h4>\n<ul class=\"hanging\">\n<li>Brunschwig, Jacques, “The Aristotelian Theory of\nEquity,” in Michael Frede and Gisela Striker (eds.),\n<em>Rationality in Greek Thought</em>, Oxford: Oxford University\nPress, pp. 115–55.</li>\n<li>Marguerite Deslauriers, “Political Unity and\nInequality,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 117–43.</li>\n<li>Georgiadis, Constantine, “Equitable and Equity in\nAristotle,” in Spiro Panagiotou (ed.), <em>Justice, Law and\nMethod in Plato and Aristotle</em>, Edmonton: Academic Printing &amp;\nPublishing, 1987, pp. 159–72.</li>\n<li>Keyt, David, “Aristotle’s Theory of Distributive\nJustice,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n238–78.</li>\n<li>–––, “The Good Man and the Upright Citizen\nin Aristotle’s <em>Ethics</em> and <em>Politics</em>,” in\nDavid Keyt and Fred D. Miller, Jr. (eds.), <em>Freedom, Reason, and\nthe Polis: Essays in Ancient Greek Political Philosophy</em>,\nCambridge: Cambridge University Press, 2007, 220–40. Reprinted\nin David Keyt, <em>Nature and Justice: Studies in the Ethical and\nPolitical Philosophy of Plato and Aristotle</em>, Leuven: Peeters,\n2017, 197–221.</li>\n<li>–––, “Nature and Justice,” in David Keyt,\n<em>Nature and Justice: Studies in the Ethical and Political\nPhilosophy of Plato and Aristotle</em>, Leuven: Peeters, 2017, pp.\n1–19.</li>\n<li>Lockwood, Thornton, “Polity, Political Justice, and\nPolitical Mixing,” <em>History of Political Thought</em>, 27\n(2006), 207–22.</li>\n<li>Morrison, Donald, “The Common Good,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 176–98.</li>\n<li>Nussbaum, Martha C., “Nature, Function, and Capability:\nAristotle on Political Distribution,” in Günther Patzig\n(ed.), <em>Aristoteles’ ‘Politik’</em>, Göttingen:\nVandenhoeck &amp; Ruprecht, 1990, pp. 153–87.</li>\n<li>Roberts, Jean, “Justice and the Polis,” in Christopher\nJ. Rowe and Malcolm Schofield (eds.), <em>The Cambridge History of\nGreek and Roman Political Thought</em>, Cambridge: Cambridge\nUniversity Press, 2000, pp. 344–65.</li>\n<li>Rosler, Andrés, “Civic Virtue: Citizenship,\nOstracism, and War,” in Marguerite Deslauriers and Pierre\nDestrée (eds.), <em>The Cambridge Companion to Aristotle’s\nPolitics</em>, Cambridge: Cambridge University Press, 2013, pp.\n144–75.</li>\n<li>Saxonhouse, Arlene W., “Aristotle on the Corruption of\nRegimes: Resentment and Justice,” in Thornton Lockwood and\nThanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n184–203.</li>\n<li>Schütrumpf, Eckart, “Little to Do With Justice:\nAristotle on Distributing Political Power,” in Thornton Lockwood\nand Thanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n163–83.</li>\n<li>Young, Charles M., “Aristotle on Justice,” <em>The\nSouthern Journal of Philosophy</em>, 27 (1988), 233–49.</li>\n<li>Zingano, Marco, “Natural, Ethical, and Political\nJustice,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 199–222.</li>\n</ul>\n<h4>7. Political Friendship and Enmity</h4>\n<ul class=\"hanging\">\n<li>Cooper, John M., “Political Animals and Civic\nFriendship,” in Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 220–41; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n65–89.</li>\n<li>Hatzistavrou, Antony, “Faction,” in Marguerite\nDeslauriers and Pierre Destrée (eds.), <em>The Cambridge\nCompanion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 301–23.</li>\n<li>Irrera, Elena, “Between Advantage and Virtue:\nAristotle’s Theory of Political Friendship,” <em>History\nof Political Thought</em>, 26 (2005), 565–85.</li>\n<li>Jang, Misung, “Aristotle’s Political Friendship as\nSolidarity,” in Liesbeth Huppes-Cluysenaer, &amp; Nuno M.S.\nCoelho (eds.), <em>Aristotle on Emotions in Law and Politics,</em>\nDordrecht: Springer, 2018. pp. 417–33.</li>\n<li>Kalimtzis, Kostas, <em>Aristotle on Political Enmity and Disease:\nAn Inquiry into Stasis</em>, Albany, NY: State University of New York\nPress, 2000.</li>\n<li>Kreft, Nora, “Aristotle on Friendship and Being\nHuman,” in Geert Keil and Nora Kreft (eds.),\n<em>Aristotle’s Anthropology</em>, Cambridge: Cambridge\nUniversity Press, 2019, pp. 182–99.</li>\n<li>Kronman, Anthony, “Aristotle’s Idea of Political\nFraternity,” <em>American Journal of Jurisprudence</em>, 24\n(1979),114–138.</li>\n<li>Leontsini, Eleni, “The Motive of Society: Aristotle on Civic\nFriendship, Justice, and Concord,” <em>Res Publica</em>, 19\n(2013), 21–35.</li>\n<li>Ludwig, Paul W., <em>Rediscovering Political Friendship:\nAristotle’s Theory and Modern Identity, Community, and Equality</em>,\nCambridge: Cambridge University Press, 2020.</li>\n<li>Miller, Fred D., Jr., “Aristotle on Deviant\nConstitutions,” in K. I. Boudouris, K. I. (ed.),\n<em>Aristotelian Political Philosophy,</em> Athens: Kardamitsa\nPublishing Co., 1995, vol. II, pp. 105–15.</li>\n<li>Mulgan, Richard, “The Role of Friendship in\nAristotle’s Political Theory,” in Preston King, and\nHeather Devere (eds.), <em>The Challenge to Friendship in\nM</em><em>odernity</em>, London: Frank Cass, 2000, pp.\n15–32.</li>\n<li>Schofield, Malcolm, “Political Friendship and the Ideology\nof Reciprocity,” in <em>Saving the City</em>, London: Routledge,\n1999, pp. 82–99.</li>\n<li>Schwarzenbach, Sibyl, “On Civic Friendship,”\n<em>Ethics</em>, 107 (1996), 97–128.</li>\n<li>Skultety, Steven C.,. “Defining Aristotle’s Conception\nof <em>Stasis</em> in the <em>Politics</em>,” <em>Phronesis</em>\n54 (2009), 346–70.</li>\n<li>–––, <em>Conflict in\nAristotle</em><em>’</em><em>s Political Philosophy</em>, Albany\nNY: State University of New York Press, 2019.</li>\n<li>Sosa, Javier Echeñique &amp; Jose Antonio Errázuriz\nBesa, “Aristotle on Personal Enmity,” <em>Ancient\nPhilosophy</em>, 62 (2022), 215–31.</li>\n<li>Ward, Ann, “Friendship and politics in Aristotle’s\n<em>Nicomachean Ethics</em>,” <em>European Journal of Political\nTheory</em>, 10 (2011), 443–62.</li>\n<li>Weed, Ronald, <em>Aristotle on Stasis: A Psychology of Political\nConflict</em>, Berlin: Logos Verlag, 2007.</li>\n<li>Yack, Bernard, “Community and Conflict in Aristotle’s\nPolitical Philosophy,” <em>Review of Politics</em>, 47\n(1985), 92–112.</li>\n<li>–––,   “Natural Right and\nAristotle’s Understanding of Justice,” <em>Political\nTheory</em>, 18 (1990), 216–37.</li>\n</ul>\n<h4>8. Citizenship, Civic Obligation, and Political Rights</h4>\n<ul class=\"hanging\">\n<li>Allan, D. J., “Individual and State in the <em>Ethics</em>\nand <em>Politics</em>,” <em>Entretiens sur l’Antiquité\nClassique IX, La ‘Politique’ d’Aristote</em>, Geneva:\nFondation Hardt, 1964, pp. 53–95.</li>\n<li>Barnes, Jonathan, “Aristotle and Political Liberty,”\nin Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 249–63; reprinted in Richard Kraut and\nSteven Skultety (eds.), <em>Aristotle’s Politics: Critical\nEssays</em>, Lanham MD: Rowman and Littlefield, 2005, pp.\n185–201.</li>\n<li>Collins, Susan D., <em>Aristotle and the Rediscovery of\nCitizenship</em>, Cambridge: Cambridge University Press, 2006.</li>\n<li>Frede, Dorothea, “Citizenship in Aristotle’s\n<em>Politics</em>,” in Richard Kraut and Steven Skultety (eds.),\n<em>Aristotle’s Politics: Critical Essays</em>, Lanham, MD: Rowman and\nLittlefield, 2005, pp. 167–84.</li>\n<li>Horn, Christoph, “Law, Governance, and Political\nObligation,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 223–46.</li>\n<li>Irwin, Terence H., “The Good of Political Activity,”\nin Günther Patzig (ed.), <em>Aristoteles’\n‘Politik’</em>, Göttingen: Vandenhoeck &amp;\nRuprecht, 1990, pp. 73–98.</li>\n<li>Kraut, Richard, “Are There Natural Rights in\nAristotle?” <em>The Review of Metaphysics</em>, 49 (1996),\n755–74.</li>\n<li>Lane, Melissa, “Claims to Rule: The Case of the\nMutlitude,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 247–74.</li>\n<li>Long, Roderick T., “Aristotle’s Conception of\nFreedom,” <em>The Review of Metaphysics</em>, 49 (1996),\n775–802; reprinted in Richard O. Brooks and James Bernard Murphy\n(eds.), <em>Aristotle and Modern Law</em>, Aldershot Hants, UK:\nAshgate Publishing Co., 2003, pp. 384–410.</li>\n<li>Miller, Fred D., Jr., “Aristotle and the Origins of Natural\nRights,” <em>The Review of Metaphysics</em>, 49 (1996),\n873–907.</li>\n<li>–––, “Aristotle’s Theory of Political\nRights,” in Richard O. Brooks and James Bernard Murphy (eds.),\n<em>Aristotle and Modern Law</em>, Aldershot Hants, UK: Ashgate\nPublishing Co., 2003, pp. 309–50.</li>\n<li>Morrison, Donald, “Aristotle’s Definition of Citizenship: A\nProblem and Some Solutions,” <em>History of Philosophy\nQuarterly</em>, 16 (1999), 143–65.</li>\n<li>Mulgan, Robert G., “Aristotle and the Value of Political\nParticipation,” <em>Political Theory</em>, 18 (1990),\n195–215.</li>\n<li>Roberts, Jean, “Excellences of the Citizen and of the\nIndividual,” in Georgios Anagnostopoulos (ed.), <em>A Companion\nto Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n555–65.</li>\n<li>Rosler, Andrés, “Civic Virtue: Citizenship,\nOstracism, and War,” in Marguerite Deslauriers and Pierre\nDestrée (eds.), <em>The Cambridge Companion to Aristotle’s\nPolitics</em>, Cambridge: Cambridge University Press, 2013, pp.\n144–75.</li>\n<li>Samaras, Thanassis, “Aristotle and the Question of\nCitizenship,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 123–41.</li>\n<li>Schofield, Malcolm, “Sharing in the Constitution,”\n<em>The Review of Metaphysics</em>, 49 (1996), 831–58; reprinted\nin Richard O. Brooks and James Bernard Murphy (eds.), <em>Aristotle\nand Modern Law</em>, Aldershot Hants, UK: Ashgate Publishing Co.,\n2003, pp. 353–80.</li>\n<li>Zuckert, Catherine H., “Aristotle on the Limits and\nSatisfactions of Political Life,” <em>Interpretation</em>, 11\n(1983), 185–206.</li>\n</ul>\n<h4>9. Constitutional Theory</h4>\n<ul class=\"hanging\">\n<li>Balot, Ryan, “The ‘Mixed Regime’ In Aristotle’s\n<em>Politics</em>,” in Thornton Lockwood and Thanassis Samaras\n(eds.), <em>Aristotle’s Politics: A Critical Guide</em>, Cambridge:\nCambridge University Press, 2015, pp. 103–22.</li>\n<li>Bates, Clifford A., <em>Aristotle’s “Best Regime”:\nKingship, Democracy, and the Rule of Law</em>, Baton Rouge: Louisiana\nState University Press, 2003.</li>\n<li>Bobonich, Christopher, “Aristotle, Decision Making, and the\nMany,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 142–62.</li>\n<li>Cherry, Kevin M., “The Problem of Polity: Political\nParticipation in Aristotle’s Best Regime,” <em>Journal of\nPolitics</em>, 71 (2009), 406–21.</li>\n<li>Coby, Patrick, “Aristotle’s Three Cities and the Problem of\nFaction,” <em>Journal of Politics</em>, 50 (1988),\n896–919.</li>\n<li>Destrée, Pierre, “Aristotle on Improving Imperfect\nCities,” in Thornton Lockwood and Thanassis Samaras (eds.),\n<em>Aristotle’s Politics: A Critical Guide</em>, Cambridge: Cambridge\nUniversity Press, 2015, pp. 204–23.</li>\n<li>Dietz, Mary G., “Between Polis and Empire: Aristotle’s\n<em>Politics</em>,” <em>American Political Science Review</em>\n106 (2012), 275–93.</li>\n<li>Garsten, Bryan, “Deliberating and Acting Together,” in\nMarguerite Deslauriers and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 324–49.</li>\n<li>Huxley, G., “On Aristotle’s Best State,” in Paul\nCartledge and F. D. Harvey (eds.), <em>Crux: Essays Presented to G. E.\nM. de Ste. Croix</em>, London: Duckworth, 1985, pp. 139–49.</li>\n<li>Johnson, Curtis N., <em>Aristotle’s Theory of the State</em>, New\nYork: Macmillan, 1990.</li>\n<li>Keyt, David, “Aristotle and Anarchism,” <em>Reason\nPapers</em>, 18 (1993), 133–52; reprinted in Richard Kraut and\nSteven Skultety. <em>Aristotle’s Politics: Critical Essays</em>,\nLanham, MD: Rowman and Littlefield, 2005, pp. 203–22.</li>\n<li>Kraut, Richard, “Aristotle’s Critique of False\nUtopias,” in Otfried Höffe (ed.), <em>Aristoteles\nPolitik</em>, Berlin: Akademie Verlag, 2001, pp. 59–73.</li>\n<li>Lintott, Andrew, “Aristotle and Democracy,” <em>The\nClassical Quarterly</em> (New Series), 42 (1992), 114–28.</li>\n<li>Mayhew, Robert, <em>Aristotle’s Criticism of Plato’s\nRepublic</em>, Lanham, MD: Rowman &amp; Littlefield, 1997.</li>\n<li>–––, “Rulers and Ruled,” in Georgios\nAnagnostopoulos (ed.), <em>A Companion to Aristotle</em>, Oxford:\nWiley-Blackwell, 2009, pp. 526–39.</li>\n<li>Miller, Fred D., Jr., “Aristotle on the Ideal\nConstitution,” in Georgios Anagnostopoulos (ed.), <em>A\nCompanion to Aristotle</em>, Oxford: Wiley-Blackwell, 2009, pp.\n540–54.</li>\n<li>–––, “The Rule of Reason,” in\nMarguerite Deslauriers and Pierre Destrée (eds.), <em>The\nCambridge Companion to Aristotle’s Politics</em>, Cambridge: Cambridge\nUniversity Press, 2013, pp. 38–66.</li>\n<li>Mulgan, Richard, “Aristotle’s Analysis of Oligarchy and\nDemocracy,” in David Keyt and Fred D. Miller, Jr. (eds.), <em>A\nCompanion to Aristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n307–22.</li>\n<li>–––, “Constitutions and the Purpose of the\nState,” in Otfried Höffe (ed.), <em>Aristoteles\nPolitik</em>, Berlin: Akademie Verlag, 2001, pp. 93–106.</li>\n<li>Mulhern, J. J., “<em>Politeia</em> in Greek Literature,\nInscriptions, and in Aristotle’s <em>Politics</em>: Reflections on\nTranslation and Interpretation,” in Thornton Lockwood and\nThanassis Samaras (eds.), <em>Aristotle’s Politics: A Critical\nGuide</em>, Cambridge: Cambridge University Press, 2015, pp.\n84–102.</li>\n<li>Murray, O., “Polis and <em>Politeia</em> in\nAristotle,” in Mogens Herman Hansen (ed.), <em>The Ancient Greek\nCity-State</em>, Copenhagen: Muksgaard, 1993, pp. 197–210.</li>\n<li>Ober, Joshua, “Aristotle’s Natural Democracy,” in\nRichard Kraut and Steven Skultety (eds.), <em>Aristotle’s Politics:\nCritical Essays</em>, Lanham, MD: Rowman and Littlefield, 2005, pp.\n223–43.</li>\n<li>–––, “Democracy’s Wisdom: An Aristotelian\nMiddle Way for Collective Judgment,” <em>American Political\nScience Review</em>, 107 (2013), 104–22.</li>\n<li>–––, “Nature, History, and Aristotle’s\nBest Possible Regime,” in Thornton Lockwood and Thanassis\nSamaras (eds.), <em>Aristotle’s Politics: A Critical Guide</em>,\nCambridge: Cambridge University Press, 2015, pp. 224–43.</li>\n<li>Polansky, Ronald, “Aristotle on Political Change,” in\nDavid Keyt and Fred D. Miller, Jr. (eds.), <em>A Companion to\nAristotle’s Politics</em>, Oxford: Blackwell, 1991, pp.\n322–45.</li>\n<li>Rosler, Andres, <em>Political Authority and Obligation in\nAristotle</em>, Oxford: Oxford University Press, 2005.</li>\n<li>Rowe, C. J., “Reality and Utopia,” <em>Elenchos</em>,\n10 (1989), 317–36.</li>\n<li>–––, “Aristotelian Constitutions,”\nin Christopher J. Rowe and Malcolm Schofield (eds.), <em>The Cambridge\nHistory of Greek and Roman Political Thought</em>, Cambridge:\nCambridge University Press, 2000, pp. 366–89.</li>\n<li>Strauss, Barry, “On Aristotle’s Critique of Athenian\nDemocracy,” in Carnes Lord and David O’Connor (eds.), <em>Essays\non the Foundations of Aristotelian Political Science</em>, Berkeley:\nUniversity of California Press, 1991, pp. 212–33.</li>\n<li>Vander Waert, Paul A., “Kingship and Philosophy in\nAristotle’s Best Regime,” <em>Phronesis</em>, 30 (1985),\n249–73.</li>\n<li>Waldron, Jeremy, “The Wisdom of the Multitude: Some\nReflections on Book 3, Chapter 11 of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 20 (1992),\n613–41; reprinted in Richard Kraut and Steven Skultety (eds.),\n<em>Aristotle’s Politics: Critical Essays</em>, Lanham, MD: Rowman and\nLittlefield, 2005, pp. 145–65.</li>\n<li>Wilson, James L., “Deliberation, Democracy, and the Rule of\nReason in Aristotle’s <em>Politics</em>,” <em>American Political\nScience Review</em>, 105 (2011), 259–74.</li>\n</ul>\n<h4>10. Education</h4>\n<ul class=\"hanging\">\n<li>Burnyeat, Myles F., “Aristotle on Learning to Be\nGood,” in Amelie O. Rorty (ed.), <em>Essays on Aristotle’s\nEthics</em>, Berkeley: University of California Press, 1980, pp.\n69–92.</li>\n<li>Curren, Randall R., <em>Aristotle on the Necessity of Public\nEducation</em>, Lanham, MD: Rowman and Littlefield, 2000.</li>\n<li>Depew, David J., “Politics, Music, and Contemplation in\nAristotle’s Ideal State,” in David Keyt and Fred D. Miller, Jr.\n(eds.), <em>A Companion to Aristotle’s Politics</em>, Oxford:\nBlackwell, 1991, pp. 346–80.</li>\n<li>Destrée, Pierre, “Education, Leisure, and\nPolitics,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 301–23.</li>\n<li>Frede, Dorothea, “The Deficiency of Human Nature: The Task\nof a ‘Philosophy of Human Nature’,” in Geert Keil\nand Nora Kreft (eds.), <em>Aristotle’s Anthropology</em>,\nCambridge: Cambridge University Press, 2019, pp. 258–74.</li>\n<li>Jimenez, Marta, <em>Aristotle on Shame and Learning to Be\nGood</em>, Oxford: Oxford University Press, 2021.</li>\n<li>Kraut, Richard, “Aristotle on Method and Moral\nEducation,” in Jyl Gentzler (ed.), <em>Method in Ancient\nPhilosophy</em>, Oxford: Oxford University Press, 1998, pp.\n171–90.</li>\n<li>–––, “Aristotle on Becoming Good:\nHabituation, Reflection, and Perception,” in Christopher Shields\n(ed.), <em>The Oxford Handbook of Aristotle</em>, Oxford: Oxford\nUniversity Press, 2012, pp. 529–57.</li>\n<li>Lord, Carnes, <em>Education and Culture in the Political Thought\nof Aristotle</em>, Ithaca, NY: Cornell University Press, 1982.</li>\n<li>Lynch, John Patrick, <em>Aristotle’s School</em>, Berkeley:\nUniversity of California Press, 1972.</li>\n<li>Muzio, G. D., “Aristotle on Improving One’s\nCharacter,” <em>Phronesis</em>, 45 (2000), 205–19.</li>\n<li>Reeve, C. D. C,  “Aristotelian Education,” in A.\nO. Rorty (ed.), <em>Philosophers on Education</em>, London: Routledge,\n1998, pp. 51–65.</li>\n<li>Stalley, Richard, “Education and the State,” in\nGeorgios Anagnostopoulos (ed.), <em>A Companion to Aristotle</em>,\nOxford: Wiley-Blackwell, 2009, pp. 566–76.</li>\n</ul>\n<h4>11. Law</h4>\n<ul class=\"hanging\">\n<li>Brooks, Richard O. and James B. Murphy (eds.), <em>Aristotle and\nModern Law</em>, Aldershot Hants, UK and Burlington, VT: Ashgate,\n2003.</li>\n<li>Burns, Tony, “Aristotle and Natural Law,” <em>History\nof Political Thought</em>, 19 (1998), 142–66.</li>\n<li>Duke, George, <em>Aristotle and Law: The Politics of Nomos</em>,\nCambridge: Cambridge University Press.</li>\n<li>Gordley, James R., “Tort Law in the Aristotelian\nTradition,” in Salvador Rus Rufino (ed.), <em>Aristoteles: El\nPensamiento Politico y Juridico</em>. León &amp; Seville:\nUniversity of León &amp; University of Seville, 1999, pp.\n71–97.</li>\n<li>Hamburger, Max, <em>Morals and Law: The Growth of Aristotle’s\nLegal Theory</em>, New Haven: Yale University Press, 1951.</li>\n<li>Huppes-Cluysenaer, Liesbeth &amp; Nuno M..S. Coelho (eds.),\n<em>Aristotle on Emotions in Law and Politics</em>, Dordrecht:\nSpringer, 2018.</li>\n<li>Miller, Eugene, “Prudence and the Rule of Law,”\n<em>American Journal of Jurisprudence</em>, 24 (1979),\n181–206.</li>\n<li>Miller, Fred D., Jr., “Aristotle’s Philosophy of Law,”\nin Fred D. Miller, Jr. and Carrie-Ann Biondi (eds.), <em>A History of\nthe Philosophy of Law from the Ancient Greeks to the Scholastics</em>\n[vol. 6 of <em>A Treatise of Legal Philosophy and General\nJurisprudence</em>, ed. Enrico Pattaro]. Dordrecht: Springer, 2007,\npp.79–110.</li>\n<li>Schroeder, Donald N., “Aristotle on Law,”\n<em>Polis</em>, 4 (1981), 17–31; reprinted in Richard O. Brooks\nand James Bernard Murphy (eds.), <em>Aristotle and Modern Law</em>,\nAldershot Hants, UK: Ashgate Publishing Co., 2003, pp.\n37–51.</li>\n<li>Wormuth, F. D., “Aristotle on Law,” in M. R. Korvitz\nand A. E. Murphy (eds.), <em>Essays in Political Theory Presented to\nG. H. Sabine,</em> Ithaca, NY: Cornell University Press, 1948,\npp. 45–61.</li>\n<li>Zanetti, Gianfrancesco, “Problematic Aspects of\nAristotle’s Philosophy of Law,” <em>Archiv\nf</em><em>ü</em><em>r Rechts- und Sozialphilosophie</em>, 81\n(1995), 49–64.</li>\n</ul>\n<h4>12. Aristotle and Contemporary Politics</h4>\n<ul class=\"hanging\">\n<li>Biondi, Carrie-Ann, “Aristotle on the Mixed Constitution and\nIts Relevance for American Political Thought,” in David Keyt and\nFred D. Miller, Jr. (eds.), <em>Freedom, Reason, and the Polis: Essays\nin Ancient Greek Political Philosophy</em>, Cambridge: Cambridge\nUniversity Press, 2007, 176–98.</li>\n<li>Frank, Jill, <em>A Democracy of Distinction: Aristotle and the\nWork of Politics</em>, Chicago: University of Chicago Press,\n2005.</li>\n<li>Galston, William A., <em>Justice and the Human Good</em>, Chicago:\nUniversity of Chicago Press, 1980.</li>\n<li>Garver, Eugene, <em>Aristotle’s Politics: Living Well and Living\nTogether</em>, Chicago: Chicago University Press, 2011.</li>\n<li>Goodman, Lenn E. and Robert Talise (eds.), <em>Aristotle’s\nPolitics Today</em>, Albany: State University of New York Press,\n2003.</li>\n<li>Kraut, Richard, “Aristotle and Rawls on the Common\nGood,” in Marguerite Deslauriers and Pierre Destrée\n(eds.), <em>The Cambridge Companion to Aristotle’s Politics</em>,\nCambridge: Cambridge University Press, 2013, pp. 350–74.</li>\n<li>Lord, Carnes, “Aristotle and the Idea of Liberal\nEducation,” in Josiah Ober and Charles Hedrick (eds.),\n<em>Demokrateia: A Conversation of Democracy, Ancient and Modern</em>,\nPrinceton: Princeton University Press Oxford: Blackwell, 1996, pp.\n271–88.</li>\n<li>Machan, Tibor R., “Aristotle and the Moral Status of\nBusiness,” <em>Journal of Value Inquiry</em>, 38 (2004),\n217–33.</li>\n<li>Mara, Gerald M., “The Culture of Democracy: Aristotle’s\n<em>Athênaiôn Politeia</em> as Political Theory,” in\nAristide Tessitore (ed.), <em>Aristotle and Modern Politics: The\nPersistence of Political Philosophy</em>, Notre Dame: University of\nNotre Dame Press, 2002, 307–41.</li>\n<li>Mulgan, Robert G., “Was Aristotle an ‘Aristotelian\nSocial Democrat’?” <em>Ethics</em>, 111 (2000),\n79–101.</li>\n<li>Murphy, James Bernard, <em>The Moral Economy of Labor:\nAristotelian Themes in Economic Theory</em>, New Haven: Yale\nUniversity Press, 1993.</li>\n<li>Nussbaum, Martha C., “Aristotelian Social Democracy,”\nin R. Bruce Douglas, Gerald M. Mara, and Henry S. Richardson (eds.)\n<em>Liberalism and the Good</em>, London: Routledge, 1990, pp.\n203–52.</li>\n<li>–––, “Capabilities and Human\nRights,” <em>Fordham Law Review</em>, 66 (1997), 273–300;\nreprinted in Richard O. Brooks and James Bernard Murphy (eds.),\n<em>Aristotle and Modern Law</em>, Aldershot Hants, UK: Ashgate\nPublishing Co., 2003, pp. 413–40.</li>\n<li>–––, “Aristotle, Politics, and Human\nCapabilities: A Response to Anthony, Arneson, Charlesworth, and\nMulgan,” <em>Ethics</em>, 111 (2000), 102–40.</li>\n<li>Pack, Spencer J., “Aristotle’s Difficult Relationship with\nModern Economic Theory,” <em>Foundations of Science</em>, 13\n(2008), 256–80.</li>\n<li>Rasmussen, Douglas B. and Douglas J. Den Uyl, <em>Liberty and\nNature: An Aristotelian Defense of Liberal Order</em>, La Salle, IL:\nOpen Court, 1991.</li>\n<li>–––, <em>Norms of Liberty: A Perfectionist Basis\nfor Non-Perfectionist Politics</em>, University Park, PA: Pennsylvania\nState University Press, 2005.</li>\n<li>Schollmeier, Paul, <em>Rewriting Contemporary Political Philosophy\nwith Plato and Aristotle: An Essay on Eudaimonic\nPolitics,</em> London: Bloomsbury Academic, 2019.</li>\n<li>Salkever, Stephen S., <em>Finding the Mean: Theory and Practice in\nAristotelian Political Philosophy</em>, Princeton: Princeton\nUniversity Press, 1990.</li>\n<li>Tessitore, Aristide (ed.), <em>Aristotle and Modern Politics: The\nPersistence of Political Philosophy</em>, Notre Dame: University of\nNotre Dame Press, 2002.</li>\n<li>Wallach, John C., “Contemporary Aristotelianism,”\n<em>Political Theory</em>, 20 (1992), 613–41.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Aristotle, General Topics: biology", "Aristotle, General Topics: ethics", "Aristotle, Special Topics: natural philosophy"], "entry_link": [{"../aristotle-biology/": "Aristotle, General Topics: biology"}, {"../aristotle-ethics/": "Aristotle, General Topics: ethics"}, {"../aristotle-natphil/": "Aristotle, Special Topics: natural philosophy"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=aristotle-politics\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/aristotle-politics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=aristotle-politics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/aristotle-politics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=aristotle-politics": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/aristotle-politics/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=aristotle-politics&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/aristotle-politics/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [], "listed_links": []}, "tokenized_text": ["1", "political", "science", "general", "modern", "word", "political", "derives", "greek", "politikos", "pertaining", "polis", "greek", "term", "polis", "translated", "citystate", "also", "commonly", "translated", "city", "simply", "anglicized", "polis", "citystate", "like", "athens", "sparta", "relatively", "small", "cohesive", "unit", "political", "religious", "cultural", "concern", "intertwined", "extent", "similarity", "modern", "nationstates", "controversial", "aristotle", "word", "politics", "politikê", "short", "politikê", "epistêmê", "political", "science", "belongs", "one", "three", "main", "branch", "science", "aristotle", "distinguishes", "end", "object", "contemplative", "science", "including", "physic", "metaphysics", "concerned", "truth", "knowledge", "sake", "practical", "science", "good", "action", "productive", "science", "making", "useful", "beautiful", "object", "top", "vi6145a1416", "met", "vi11025b24", "xi71064a1619", "en", "vi21139a268", "politics", "practical", "science", "since", "concerned", "noble", "action", "happiness", "citizen", "although", "resembles", "productive", "science", "seek", "create", "preserve", "reform", "political", "system", "aristotle", "thus", "understands", "politics", "normative", "prescriptive", "discipline", "rather", "purely", "empirical", "descriptive", "inquiry", "nicomachean", "ethic", "aristotle", "describes", "subject", "matter", "political", "science", "characterizes", "authoritative", "science", "prescribes", "science", "studied", "citystate", "others", "military", "science", "household", "management", "rhetoric", "fall", "authority", "since", "governs", "practical", "science", "end", "serve", "mean", "end", "nothing", "le", "human", "good", "even", "end", "individual", "citystate", "citystate", "seems", "rate", "greater", "complete", "attain", "preserve", "although", "worthy", "attain", "individual", "nobler", "divine", "nation", "citystate", "en", "i21094b710", "two", "ethical", "work", "nicomachean", "ethic", "eudemian", "ethic", "explain", "principle", "form", "foundation", "politics", "happiness", "highest", "human", "good", "happiness", "activity", "moral", "virtue", "defined", "term", "mean", "justice", "common", "advantage", "political", "good", "aristotle", "political", "science", "thus", "encompasses", "two", "field", "modern", "philosopher", "distinguish", "ethic", "political", "philosophy", "see", "entry", "aristotle", "ethic", "political", "philosophy", "narrow", "sense", "roughly", "speaking", "subject", "treatise", "called", "politics", "discussion", "topic", "see", "following", "supplementary", "document", "supplement", "characteristic", "problem", "aristotle", "politics", "2", "aristotle", "view", "politics", "political", "science", "study", "task", "politician", "statesman", "politikos", "much", "way", "medical", "science", "concern", "work", "physician", "see", "politics", "iv1", "fact", "body", "knowledge", "practitioner", "truly", "expert", "also", "wield", "pursuing", "task", "important", "task", "politician", "role", "lawgiver", "nomothetês", "frame", "appropriate", "constitution", "citystate", "involves", "enduring", "law", "custom", "institution", "including", "system", "moral", "education", "citizen", "constitution", "place", "politician", "need", "take", "appropriate", "measure", "maintain", "introduce", "reform", "find", "necessary", "prevent", "development", "might", "subvert", "political", "system", "province", "legislative", "science", "aristotle", "regard", "important", "politics", "exercised", "everyday", "political", "activity", "passing", "decree", "see", "en", "vi8", "aristotle", "frequently", "compare", "politician", "craftsman", "analogy", "imprecise", "politics", "strict", "sense", "legislative", "science", "form", "practical", "knowledge", "craft", "like", "architecture", "medicine", "form", "productive", "knowledge", "however", "comparison", "valid", "extent", "politician", "produce", "operates", "maintains", "legal", "system", "according", "universal", "principle", "en", "vi8", "x9", "order", "appreciate", "analogy", "helpful", "observe", "aristotle", "explains", "production", "artifact", "drinking", "cup", "term", "four", "cause", "material", "formal", "efficient", "final", "cause", "phys", "ii3", "met", "a2", "example", "clay", "material", "cause", "molded", "roughly", "cylindrical", "shape", "closed", "one", "end", "formal", "cause", "potter", "efficient", "moving", "cause", "contain", "beverage", "final", "cause", "discussion", "four", "cause", "see", "entry", "aristotle", "physic", "one", "also", "explain", "existence", "citystate", "term", "four", "cause", "kind", "community", "koinônia", "collection", "part", "function", "interest", "common", "pol", "ii11261a18", "iii11275b20", "hence", "made", "part", "aristotle", "describes", "various", "way", "different", "context", "household", "economic", "class", "eg", "rich", "poor", "demes", "ie", "local", "political", "unit", "ultimately", "citystate", "composed", "individual", "citizen", "see", "iii11274a3841", "along", "natural", "resource", "material", "equipment", "citystate", "fashioned", "see", "vii141325b3841", "formal", "cause", "citystate", "constitution", "politeia", "aristotle", "defines", "constitution", "certain", "ordering", "inhabitant", "citystate", "iii11274b3241", "also", "speaks", "constitution", "community", "form", "compound", "argues", "whether", "community", "time", "depends", "whether", "constitution", "iii31276b111", "constitution", "written", "document", "immanent", "organizing", "principle", "analogous", "soul", "organism", "hence", "constitution", "also", "way", "life", "citizen", "iv111295a40b1", "vii81328b12", "citizen", "minority", "resident", "population", "posse", "full", "political", "right", "iii11275b1720", "existence", "citystate", "also", "requires", "efficient", "cause", "namely", "ruler", "aristotle", "view", "community", "sort", "posse", "order", "ruling", "element", "authority", "ruling", "principle", "defined", "constitution", "set", "criterion", "political", "office", "particularly", "sovereign", "office", "iii61278b810", "cf", "iv11289a1518", "however", "deeper", "level", "must", "efficient", "cause", "explain", "citystate", "acquires", "constitution", "first", "place", "aristotle", "state", "person", "first", "established", "citystate", "cause", "great", "benefit", "i21253a301", "person", "evidently", "lawgiver", "nomothetês", "someone", "like", "solon", "athens", "lycurgus", "sparta", "founded", "constitution", "aristotle", "compare", "lawgiver", "politician", "generally", "craftsman", "dêmiourgos", "like", "weaver", "shipbuilder", "fashion", "material", "finished", "product", "ii121273b323", "vii41325b401365a5", "notion", "final", "cause", "dominates", "aristotle", "politics", "opening", "line", "since", "see", "every", "citystate", "sort", "community", "every", "community", "established", "sake", "good", "everyone", "everything", "sake", "believe", "good", "clear", "every", "community", "aim", "good", "community", "authority", "includes", "others", "aim", "highest", "good", "authority", "called", "citystate", "political", "community", "i11252a17", "soon", "state", "citystate", "come", "sake", "life", "exists", "sake", "good", "life", "21252b2930", "theme", "good", "life", "happiness", "proper", "end", "citystate", "recurs", "throughout", "politics", "iii61278b1724", "91280b39", "vii21325a710", "sum", "citystate", "hylomorphic", "ie", "matterform", "compound", "particular", "population", "ie", "citizenbody", "given", "territory", "material", "cause", "constitution", "formal", "cause", "constitution", "fashioned", "lawgiver", "governed", "politician", "like", "craftsman", "efficient", "cause", "constitution", "defines", "aim", "citystate", "final", "cause", "iv11289a1718", "aristotle", "hylomorphic", "analysis", "important", "practical", "implication", "craftsman", "try", "impose", "form", "material", "unsuited", "eg", "build", "house", "sand", "legislator", "lay", "change", "law", "contrary", "nature", "citizen", "aristotle", "accordingly", "reject", "utopian", "scheme", "proposal", "plato", "republic", "child", "property", "belong", "citizen", "common", "run", "afoul", "fact", "people", "give", "attention", "property", "le", "communal", "much", "fall", "give", "attention", "pol", "ii31261b335", "aristotle", "also", "wary", "casual", "political", "innovation", "deleterious", "sideeffect", "undermining", "citizen", "habit", "obeying", "law", "ii81269a1324", "discussion", "theoretical", "foundation", "aristotle", "politics", "see", "following", "supplementary", "document", "supplement", "presupposition", "aristotle", "politics", "term", "aristotle", "understands", "fundamental", "normative", "problem", "politics", "constitutional", "form", "lawgiver", "establish", "preserve", "material", "sake", "end", "3", "general", "theory", "constitution", "citizenship", "aristotle", "state", "politician", "lawgiver", "wholly", "occupied", "citystate", "constitution", "certain", "way", "organizing", "inhabit", "citystate", "iii11274b368", "general", "theory", "constitution", "set", "forth", "politics", "iii", "begin", "definition", "citizen", "politês", "since", "citystate", "nature", "collective", "entity", "multitude", "citizen", "citizen", "distinguished", "inhabitant", "resident", "alien", "slave", "even", "child", "senior", "unqualified", "citizen", "ordinary", "worker", "analysis", "defines", "citizen", "person", "right", "exousia", "participate", "deliberative", "judicial", "office", "1275b1821", "athens", "example", "citizen", "right", "attend", "assembly", "council", "body", "sit", "jury", "athenian", "system", "differed", "modern", "representative", "democracy", "citizen", "directly", "involved", "governing", "although", "full", "citizenship", "tended", "restricted", "greek", "citystate", "woman", "slave", "foreigner", "others", "excluded", "citizen", "deeply", "enfranchised", "modern", "representative", "democracy", "directly", "involved", "governing", "reflected", "aristotle", "definition", "citizen", "without", "qualification", "defines", "citystate", "unqualified", "sense", "multitude", "citizen", "adequate", "selfsufficient", "life", "1275b2021", "aristotle", "defines", "constitution", "politeia", "way", "organizing", "office", "citystate", "particularly", "sovereign", "office", "iii61278b810", "cf", "iv11289a1518", "constitution", "thus", "defines", "governing", "body", "take", "different", "form", "example", "democracy", "people", "oligarchy", "select", "wealthy", "well", "born", "attempting", "distinguish", "evaluate", "various", "constitution", "aristotle", "considers", "two", "question", "first", "citystate", "come", "recall", "thesis", "defended", "politics", "i2", "human", "being", "nature", "political", "animal", "naturally", "want", "live", "together", "discussion", "topic", "see", "following", "supplementary", "document", "supplement", "political", "naturalism", "aristotle", "add", "common", "advantage", "also", "brings", "together", "insofar", "attain", "noble", "life", "end", "common", "separately", "iii61278b1924", "second", "different", "form", "rule", "one", "individual", "group", "rule", "another", "aristotle", "distinguishes", "several", "type", "rule", "based", "nature", "soul", "ruler", "subject", "first", "considers", "despotic", "rule", "exemplified", "masterslave", "relationship", "aristotle", "think", "form", "rule", "justified", "case", "natural", "slave", "asserts", "without", "evidence", "lack", "deliberative", "faculty", "thus", "need", "natural", "master", "direct", "i131260a12", "slavery", "defended", "length", "politics", "i48", "although", "natural", "slave", "allegedly", "benefit", "master", "despotic", "rule", "still", "primarily", "sake", "master", "incidentally", "slave", "iii61278b327", "aristotle", "provides", "argument", "person", "congenitally", "incapable", "governing", "ruled", "primarily", "sake", "next", "considers", "paternal", "marital", "rule", "also", "view", "defensible", "male", "nature", "capable", "leadership", "female", "unless", "constituted", "way", "contrary", "nature", "elder", "perfect", "nature", "capable", "leadership", "younger", "imperfect", "i121259a39b4", "aristotle", "persuasive", "argues", "child", "need", "adult", "supervision", "rationality", "imperfect", "ateles", "immature", "unconvincing", "modern", "reader", "alleges", "without", "substantiation", "although", "woman", "deliberative", "faculty", "without", "authority", "akuron", "female", "require", "male", "supervision", "i131260a1314", "aristotle", "argument", "slave", "woman", "appear", "weak", "commentator", "take", "ironic", "however", "obvious", "modern", "reader", "need", "ancient", "greek", "necessary", "suppose", "aristotle", "discussion", "disingenuous", "noteworthy", "however", "paternal", "marital", "rule", "properly", "practiced", "sake", "ruled", "sake", "child", "wife", "respectively", "art", "like", "medicine", "gymnastics", "practiced", "sake", "patient", "iii61278b371279a1", "respect", "resemble", "political", "rule", "form", "rule", "appropriate", "ruler", "subject", "equal", "similar", "rational", "capacity", "exemplified", "naturally", "equal", "citizen", "take", "turn", "ruling", "one", "another", "advantage", "1279a813", "set", "stage", "fundamental", "claim", "aristotle", "constitutional", "theory", "constitution", "aim", "common", "advantage", "correct", "without", "qualification", "whereas", "aim", "advantage", "ruler", "deviant", "unjust", "involve", "despotic", "rule", "inappropriate", "community", "free", "person", "1279a1721", "distinction", "correct", "deviant", "constitution", "combined", "observation", "government", "may", "consist", "one", "person", "multitude", "hence", "six", "possible", "constitutional", "form", "politics", "iii7", "correct", "deviant", "one", "ruler", "kingship", "tyranny", "ruler", "aristocracy", "oligarchy", "many", "ruler", "polity", "democracy", "sixfold", "classification", "doubtless", "adapted", "plato", "statesman", "302cd", "set", "stage", "aristotle", "inquiry", "best", "constitution", "although", "modified", "various", "way", "throughout", "politics", "example", "observes", "dominant", "class", "oligarchy", "literally", "rule", "oligoi", "ie", "typically", "wealthy", "whereas", "democracy", "literally", "rule", "dêmos", "ie", "people", "poor", "economic", "class", "included", "definition", "form", "see", "politics", "iii8", "iv4", "vi2", "alternative", "account", "also", "polity", "later", "characterized", "kind", "mixed", "constitution", "typified", "rule", "middle", "group", "citizen", "moderately", "wealthy", "class", "rich", "poor", "politics", "iv11", "aristotle", "constitutional", "theory", "based", "theory", "justice", "expounded", "nicomachean", "ethic", "book", "v", "aristotle", "distinguishes", "two", "different", "related", "sens", "justice", "universal", "particular", "play", "important", "role", "constitutional", "theory", "firstly", "universal", "sense", "justice", "mean", "lawfulness", "concerned", "common", "advantage", "happiness", "political", "community", "ne", "v11129b1119", "cf", "pol", "iii121282b1617", "conception", "universal", "justice", "undergirds", "distinction", "correct", "deviant", "unjust", "constitution", "exactly", "common", "advantage", "koinê", "sumpheron", "entail", "matter", "scholarly", "controversy", "passage", "imply", "justice", "involves", "advantage", "citizen", "example", "every", "citizen", "best", "constitution", "claim", "private", "property", "education", "pol", "vii91329a234", "131332a328", "aristotle", "also", "allows", "might", "way", "ostracize", "powerful", "citizen", "even", "convicted", "crime", "iii131284b1520", "whether", "aristotle", "understands", "common", "advantage", "safeguarding", "interest", "every", "citizen", "bearing", "whether", "extent", "anticipates", "modern", "would", "understand", "theory", "individual", "right", "see", "fred", "miller", "richard", "kraut", "differing", "interpretation", "secondly", "particular", "sense", "justice", "mean", "equality", "fairness", "includes", "distributive", "justice", "according", "different", "individual", "claim", "share", "common", "asset", "property", "aristotle", "analyzes", "argument", "different", "constitution", "different", "application", "principle", "distributive", "justice", "iii91280a722", "everyone", "agrees", "say", "justice", "involves", "treating", "equal", "person", "equally", "treating", "unequal", "person", "unequally", "agree", "standard", "individual", "deemed", "equally", "unequally", "meritorious", "deserving", "assumes", "analysis", "distributive", "justice", "set", "forth", "nicomachean", "ethic", "v3", "justice", "requires", "benefit", "distributed", "individual", "proportion", "merit", "desert", "oligarch", "mistakenly", "think", "superior", "wealth", "also", "superior", "political", "right", "whereas", "democrat", "hold", "equal", "free", "birth", "also", "equal", "political", "right", "conception", "political", "justice", "mistaken", "aristotle", "view", "assume", "false", "conception", "ultimate", "end", "citystate", "citystate", "neither", "business", "enterprise", "maximize", "wealth", "oligarch", "suppose", "association", "promote", "liberty", "equality", "democrat", "maintain", "instead", "aristotle", "argues", "good", "life", "end", "citystate", "life", "consisting", "noble", "action", "1280b391281a4", "hence", "correct", "conception", "justice", "aristocratic", "assigning", "political", "right", "make", "full", "contribution", "political", "community", "virtue", "well", "property", "freedom", "1281a48", "aristotle", "understands", "aristocratic", "constitution", "literally", "rule", "aristoi", "ie", "best", "person", "aristotle", "explores", "implication", "argument", "remainder", "politics", "iii", "considering", "rival", "claim", "rule", "law", "rule", "supremely", "virtuous", "individual", "absolute", "kingship", "limiting", "case", "aristocracy", "book", "viiviii", "aristotle", "describes", "ideal", "constitution", "citizen", "fully", "virtuous", "although", "justice", "aristotle", "view", "foremost", "political", "virtue", "pol", "iii91283a3840", "great", "social", "virtue", "friendship", "overlooked", "two", "virtue", "work", "hand", "hand", "secure", "every", "sort", "association", "en", "viii91159b267", "justice", "enables", "citizen", "citystate", "share", "peacefully", "benefit", "burden", "cooperation", "friendship", "hold", "together", "prevents", "breaking", "warring", "faction", "cf", "pol", "ii41262b79", "friend", "expected", "treat", "justly", "friendship", "go", "beyond", "justice", "complex", "mutual", "bond", "individual", "choose", "good", "others", "trust", "others", "choosing", "good", "cf", "ee", "vii21236a1415", "b23", "en", "viii21155b3431156a10", "choosing", "good", "one", "another", "essential", "friendship", "three", "different", "way", "something", "called", "good", "human", "beingvirtuous", "ie", "good", "without", "qualification", "useful", "pleasantthere", "three", "type", "friendship", "hedonistic", "utilitarian", "virtuous", "political", "civic", "friendship", "specie", "utilitarian", "friendship", "important", "form", "utilitarian", "friendship", "polis", "greatest", "community", "opposed", "political", "friendship", "enmity", "lead", "faction", "civil", "war", "stasis", "even", "political", "revolution", "breakup", "polis", "discussed", "book", "v", "politics", "aristotle", "offer", "general", "account", "political", "civic", "friendship", "part", "general", "theory", "friendship", "ee", "vii10", "en", "viii912", "4", "study", "specific", "constitution", "purpose", "political", "science", "guide", "good", "lawgiver", "true", "politician", "iv11288b27", "like", "complete", "science", "craft", "must", "study", "range", "issue", "concerning", "subject", "matter", "example", "gymnastics", "physical", "education", "study", "sort", "training", "best", "adapted", "body", "naturally", "best", "sort", "training", "best", "body", "capacity", "appropriate", "someone", "want", "condition", "knowledge", "appropriate", "athletic", "contest", "political", "science", "study", "comparable", "range", "constitution", "1288b2135", "first", "constitution", "best", "without", "qualification", "ie", "according", "prayer", "external", "impediment", "second", "constitution", "best", "circumstance", "probably", "impossible", "many", "person", "attain", "best", "constitution", "third", "constitution", "serf", "aim", "given", "population", "happens", "ie", "one", "best", "based", "hypothesis", "political", "scientist", "ought", "able", "study", "given", "constitution", "might", "originally", "come", "come", "manner", "might", "preserved", "longest", "time", "mean", "example", "particular", "city", "happens", "neither", "governed", "best", "constitution", "equipped", "even", "necessary", "thing", "best", "possible", "existing", "circumstance", "baser", "sort", "hence", "aristotelian", "political", "science", "confined", "ideal", "system", "also", "investigates", "secondbest", "constitution", "even", "inferior", "political", "system", "may", "closest", "approximation", "full", "political", "justice", "lawgiver", "attain", "circumstance", "regarding", "constitution", "ideal", "according", "prayer", "aristotle", "criticizes", "view", "predecessor", "politics", "offer", "rather", "sketchy", "blueprint", "politics", "viiviii", "although", "political", "view", "influenced", "teacher", "plato", "aristotle", "highly", "critical", "ideal", "constitution", "set", "forth", "plato", "republic", "ground", "overvalues", "political", "unity", "embrace", "system", "communism", "impractical", "inimical", "human", "nature", "neglect", "happiness", "individual", "citizen", "politics", "ii15", "contrast", "aristotle", "best", "constitution", "every", "citizen", "posse", "moral", "virtue", "equipment", "carry", "practice", "thereby", "attain", "life", "excellence", "complete", "happiness", "see", "vii131332a328", "citizen", "hold", "political", "office", "posse", "private", "property", "one", "call", "citystate", "happy", "looking", "part", "citizens", "vii91329a223", "moreover", "common", "system", "education", "citizen", "share", "end", "pol", "viii1", "case", "existing", "citystate", "population", "lack", "capacity", "resource", "complete", "happiness", "however", "lawgiver", "must", "content", "fashioning", "suitable", "constitution", "politics", "iv11", "secondbest", "system", "typically", "take", "form", "polity", "citizen", "posse", "inferior", "common", "grade", "virtue", "mixed", "constitution", "combining", "feature", "democracy", "oligarchy", "possible", "aristocracy", "group", "citizen", "position", "abuse", "right", "aristotle", "argues", "citystate", "fall", "short", "ideal", "best", "constitution", "one", "controlled", "numerous", "middle", "class", "stand", "rich", "poor", "posse", "good", "fortune", "moderation", "find", "easiest", "obey", "rule", "reason", "politics", "iv111295b46", "accordingly", "le", "apt", "rich", "poor", "act", "unjustly", "toward", "fellow", "citizen", "constitution", "based", "middle", "class", "mean", "extreme", "oligarchy", "rule", "rich", "democracy", "rule", "poor", "middle", "constitution", "best", "evident", "freest", "faction", "middle", "class", "numerous", "least", "occur", "faction", "division", "among", "citizen", "iv111296a79", "middle", "constitution", "therefore", "stable", "oligarchy", "democracy", "although", "aristotle", "classifies", "democracy", "deviant", "constitution", "albeit", "best", "bad", "lot", "argues", "case", "might", "made", "popular", "rule", "politics", "iii11", "discussion", "attracted", "attention", "modern", "democratic", "theorist", "central", "claim", "many", "may", "turn", "better", "virtuous", "come", "together", "even", "though", "many", "may", "inferior", "considered", "individually", "individual", "portion", "virtue", "practical", "wisdom", "may", "pool", "moral", "asset", "turn", "better", "ruler", "even", "wise", "individual", "argument", "seems", "anticipate", "treatment", "wisdom", "multitude", "condorcet", "jury", "theorem", "recent", "year", "particular", "chapter", "widely", "discussed", "connection", "topic", "democratic", "deliberation", "public", "reason", "addition", "political", "scientist", "must", "attend", "existing", "constitution", "even", "bad", "aristotle", "note", "reform", "constitution", "le", "task", "politics", "establish", "one", "beginning", "way", "politician", "also", "help", "existing", "constitution", "iv11289a17", "political", "scientist", "also", "cognizant", "force", "political", "change", "undermine", "existing", "regime", "aristotle", "criticizes", "predecessor", "excessive", "utopianism", "neglect", "practical", "duty", "political", "theorist", "however", "machiavellian", "best", "constitution", "still", "serf", "regulative", "ideal", "evaluate", "existing", "system", "topic", "occupy", "remainder", "politics", "book", "ivvi", "concerned", "existing", "constitution", "three", "deviant", "constitution", "well", "polity", "mixed", "constitution", "best", "attainable", "circumstance", "iv21289a2638", "mixed", "constitution", "special", "interest", "scholar", "look", "like", "forerunner", "modern", "republican", "regime", "whole", "book", "v", "investigates", "cause", "prevention", "revolution", "political", "change", "metabolê", "civil", "war", "faction", "stasis", "book", "viiviii", "devoted", "ideal", "constitution", "might", "expected", "aristotle", "attempt", "carry", "program", "involves", "many", "difficulty", "scholar", "disagree", "two", "series", "book", "ivvi", "viiviii", "related", "example", "written", "first", "intended", "read", "first", "whether", "ultimately", "consistent", "importantly", "aristotle", "offer", "practical", "political", "prescription", "book", "ivvi", "guided", "best", "constitution", "regulative", "ideal", "simply", "abandoning", "political", "idealism", "practicing", "form", "realpolitik", "discussion", "topic", "see", "following", "supplementary", "document", "supplement", "characteristic", "problem", "aristotle", "politics", "5", "aristotle", "modern", "politics", "aristotle", "continued", "influence", "thinker", "present", "throughout", "political", "spectrum", "including", "conservative", "hannah", "arendt", "leo", "strauss", "eric", "voegelin", "communitarians", "alasdair", "macintyre", "michael", "sandel", "liberal", "william", "galston", "martha", "c", "nussbaum", "libertarian", "tibor", "r", "machan", "douglas", "b", "rasmussen", "douglas", "j", "den", "uyl", "democratic", "theorist", "jill", "frank", "gerald", "m", "mara", "surprising", "diverse", "political", "persuasion", "lay", "claim", "aristotle", "source", "method", "often", "lead", "divergent", "interpretation", "deal", "difficult", "problem", "inclined", "consider", "opposing", "argument", "careful", "nuanced", "manner", "often", "willing", "concede", "truth", "side", "example", "though", "critical", "democracy", "one", "passage", "allows", "case", "rule", "many", "based", "superior", "wisdom", "multitude", "perhaps", "also", "involves", "truth", "pol", "iii111281a3942", "sometimes", "applies", "principle", "questionable", "manner", "example", "reason", "association", "governed", "rational", "manner", "household", "run", "husband", "rather", "wife", "whose", "rational", "capacity", "lack", "authority", "i131260a13", "modern", "commentator", "sympathetic", "aristotle", "general", "approach", "often", "contend", "case", "applies", "principle", "incorrectlyleaving", "open", "question", "applied", "way", "applies", "principle", "may", "seemed", "reasonable", "sociopolitical", "contextfor", "example", "citizen", "polity", "normally", "best", "attainable", "constitution", "must", "hoplite", "soldier", "cf", "iii71297b4", "but", "may", "debatable", "might", "apply", "within", "modern", "democratic", "nationstate", "problem", "extrapolating", "modern", "political", "affair", "illustrated", "fully", "connection", "aristotle", "discussion", "legal", "change", "politics", "ii8", "first", "lay", "argument", "making", "law", "changeable", "beneficial", "case", "medicine", "example", "progress", "traditional", "way", "improved", "form", "treatment", "existing", "law", "may", "vestige", "primitive", "barbaric", "practice", "instance", "aristotle", "mention", "law", "cyme", "allows", "accuser", "produce", "number", "relative", "witness", "prove", "defendant", "guilty", "murder", "aristotle", "concludes", "evident", "foregoing", "law", "sometimes", "changed", "look", "matter", "different", "angle", "caution", "would", "seem", "required", "1269a1214", "since", "law", "get", "force", "citizen", "habit", "obedience", "great", "care", "exercised", "making", "change", "may", "sometimes", "better", "leave", "defective", "law", "place", "rather", "encouraging", "lawlessness", "changing", "law", "frequently", "moreover", "problem", "law", "changed", "change", "although", "aristotle", "offer", "valuable", "insight", "break", "discussion", "topic", "never", "take", "elsewhere", "might", "sum", "view", "follows", "come", "changing", "law", "observe", "mean", "bound", "traditional", "law", "hand", "overeager", "altering", "obvious", "precept", "reasonable", "leaf", "considerable", "room", "disagreement", "among", "contemporary", "neoaristotelian", "theorist", "example", "law", "changed", "allow", "selfdescribed", "transsexual", "person", "use", "sexually", "segregated", "restroom", "conservative", "liberal", "might", "agree", "aristotle", "general", "stricture", "regarding", "legal", "change", "differ", "widely", "apply", "particular", "case", "scholar", "aristotle", "advisedly", "make", "attempt", "show", "aligned", "contemporary", "ideology", "rather", "insofar", "find", "relevant", "time", "offer", "remarkable", "synthesis", "idealism", "pragmatism", "unfolding", "deep", "thoughtprovoking", "discussion", "perennial", "concern", "political", "philosophy", "role", "human", "nature", "politics", "relation", "individual", "state", "place", "morality", "politics", "theory", "political", "justice", "rule", "law", "analysis", "evaluation", "constitution", "relevance", "ideal", "practical", "politics", "cause", "cure", "political", "change", "revolution", "importance", "morally", "educated", "citizenry", "glossary", "aristotelian", "term", "action", "praxis", "citizen", "politês", "citystate", "polis", "also", "city", "state", "community", "koinônia", "constitution", "politeia", "also", "regime", "faction", "stasis", "also", "civil", "war", "free", "eleutheros", "friendship", "philia", "good", "agathos", "happiness", "eudaimonia", "happy", "eudaimôn", "justice", "dikaiosunê", "law", "nomos", "lawgiver", "nomothetês", "master", "despotês", "nature", "phusis", "noble", "kalon", "also", "beautiful", "fine", "people", "dêmos", "political", "politikos", "pertaining", "polis", "political", "science", "politikê", "epistêmê", "politician", "politikos", "also", "statesman", "practical", "praktikos", "practical", "wisdom", "phronêsis", "revolution", "metabolê", "also", "change", "right", "exousia", "also", "liberty", "ruler", "archôn", "selfsufficient", "autarkês", "sovereign", "kurios", "virtue", "aretê", "also", "excellence", "without", "qualification", "haplôs", "also", "absolute", "without", "authority", "akuron"]}