{"url": "buber", "title": "Martin Buber", "authorship": {"year": "Copyright © 2020", "author_text": "Michael Zank\n<mzank@bu.edu>\nZachary Braiterman", "author_links": [{"http://www.bu.edu/mzank/Michael_Zank": "Michael Zank"}, {"mailto:mzank%40bu%2eedu": "mzank@bu.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.bu.edu/mzank/Michael_Zank\" target=\"other\">Michael Zank</a>\n&lt;<a href=\"mailto:mzank%40bu%2eedu\"><em>mzank<abbr title=\" at \">@</abbr>bu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nZachary Braiterman\n\n    </p>\n</div>"}, "pubinfo": ["First published Tue Apr 20, 2004", "substantive revision Tue Jul 28, 2020"], "preamble": "\n\n\nMartin Buber (1878–1965) was a prolific author, scholar, literary\ntranslator, and political activist whose writings—mostly in\nGerman and Hebrew—ranged from Jewish mysticism to social\nphilosophy, biblical studies, religious phenomenology, philosophical\nanthropology, education, politics, and art. Most famous among his\nphilosophical writings is the short but powerful book I and\nThou (1923) where our relation to others is considered as\ntwofold.  The I-it relation prevails between subjects and\nobjects of thought and action; the I-Thou relation, on the\nother hand, obtains in encounters between subjects that exceed the\nrange of the Cartesian subject-object relation. Though originally\nplanned as a prolegomenon to a phenomenology of religion, I and\nThou proved influential in other areas as well, including the\nphilosophy of education. The work of Martin Buber remains a linchpin\nof qualitative philosophical anthropology and continues to be cited in\nfields such as philosophical psychology, medical anthropology, and\npedagogical theory.  Buber’s writings on Jewish national\nrenaissance, Hasidism, and political philosophy made him a major\ntwentieth-century figure in Jewish thought and the philosophy of\nreligion. Buber’s extensive writing on the political dimensions of biblical historiography and prophetic literature not only made contributions to the history of religion but also to contemporary discussions on political theology with an anarchistic bent. His translation, with Franz Rosenzweig, of the Hebrew Bible into German remains a classic in the German language.\n", "toc": [{"#BioBac": "1. Biographical Background"}, {"#PhiInf": "2. Philosophical Influences"}, {"#EarBubGesMeaRea": "3. The early Buber: Gestalt as a means of realization"}, {"#DiaITho": "4. Philosophy of Dialogue: I and Thou"}, {"#Zio": "5. Zionism"}, {"#PolThe": "6. Political Theology"}, {"#DisRelLatPhiAnt": "7. Distance and Relation: Late Philosophical Anthropology"}, {"#Cri": "8. Criticism"}, {"#HonLeg": "9. Honors and Legacy"}, {"#Bib": "Bibliography"}, {"#WorCit": "Works Cited"}, {"#Bibs": "Bibliographies"}, {"#SelEarWorMarBub": "Selected Early Works by Martin Buber"}, {"#ColEdiWriLet": "Collections and Editions of Writings and Letters"}, {"#BubEng": "Buber in English"}, {"#SelEdiVolMarBub": "Selected Edited Volumes on Martin Buber"}, {"#SecLit": "Secondary Literature"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Biographical Background\n\n\nThe setting of Buber’s early childhood was late-nineteenth-century Vienna, then still the\ncosmopolitan capital of the Austro-Hungarian Empire, a multiethnic\nconglomerate whose eventual demise (in the First World War) effectively\nended the millennial rule of Catholic princes in Europe.\nFin-de-siècle Vienna was the home of light opera and\nheavy neo-romantic music, French-style boulevard comedy and social\nrealism, sexual repression and deviance, political intrigue and vibrant\njournalism, a cultural cauldron aptly captured in Robert Musil’s\nThe Man Without Qualities (Der Mann ohne Eigenschaften,\n1930–1932).\n\n\nBuber’s parents, Carl Buber and Elise née Wurgast, separated\nwhen Martin was four years old. For the next ten years, he lived with\nhis paternal grandparents, Solomon and Adele Buber, in Lemberg (now:\nLviv/Ukraine) who were part of what one might call the landed Jewish\naristocracy. Solomon, a “master of the old Haskala” \n(“[ein] … Meister der alten Haskala”; \nBuber 1906b, Dedication) who called himself \n“a Pole of the Mosaic persuasion”\n(Friedman [1981] p. 11), produced the first modern editions of rabbinic\nmidrash literature yet was also greatly respected in the traditional\nJewish community. His reputation opened the doors for Martin when he\nbegan to show interest in Zionism and Hasidic literature. The wealth of\nhis grandparents was built on the Galician estate managed by Adele and\nenhanced by Solomon through mining, banking, and commerce. It provided\nMartin with financial security until the German occupation of Poland in\n1939, when their estate was expropriated. Home-schooled and pampered by\nhis grandmother, Buber was a bookish aesthete with few friends his age,\nwhose major diversion was the play of the imagination. He easily\nabsorbed local languages (Hebrew, Yiddish, Polish, German) and acquired\nothers (Greek, Latin, French, Italian, English). German was the\ndominant language at home, while the language of instruction at the\nFranz Joseph Gymnasium was Polish. This multilingualism nourished\nBuber’s life-long interest in language.\n\n\nAmong the young Buber’s first publications are essays on, and\ntranslations into Polish of, the poetry of Arthur Schnitzler and Hugo\nvon Hofmannsthal. Buber’s literary voice may be best understood as\nprobingly personal while seeking communication with others, forging a\npath between East and West, Judaism and Humanism, national\nparticularity and universal spirit. His deliberate and perhaps somewhat\nprecious diction was nourished by the contrasts between the German\nclassics he read at home and the fervently religious to mildly secular\nGalician Jewish jargon he encountered on the outside. Reentering the\nurban society of Vienna, Buber encountered a world brimming with\nAustrian imperial tradition as well as Germanic pragmatism, where\nradical new approaches to psychology and philosophy were being\ndeveloped. This was a place where solutions to the burning social and\npolitical issues of city, nation, and empire were often expressed\nin grandly theatrical oratory (Karl Lueger) and in the aestheticizing\nrhetoric of self-inscenation (Theodor Herzl). As a student of art\nhistory, German literature, and psychology in Vienna, Leipzig,\nZürich, and Berlin, Buber made himself at home in a bohemian world\nof letters.\n\n\nFrom 1900 to 1916, Buber and his life-partner, the author Paula\nWinkler (1877–1958; pen-name: Georg Munk), moved to Berlin where they\nbefriended the anarchist Gustav Landauer (1870–1919) and attended the\nsalon of the Hart brothers, an epicenter of Jugendstil\naesthetics. Early on in this period Buber was active in the Zionist\nmovement of Theodor Herzl, who recruited him as the editor of his\njournal Die Welt. In 1904, the year Herzl died, Buber finished\nhis dissertation on the problem of individuation in Nicholas of Cusa\nand Jakob Boehme and he took a position as literary editor for Ruetten\n& Loening, a publishing house whose mid-nineteenth century Jewish\nfounders (Rindskopf and Löwental) had made a fortune with the\nperennially best-selling Struwwelpeter, a politically\nincorrect book of drawings about ill-behaved children (Wurm, 1994). At\nthe beginning of the century, the publisher was looking to move beyond\nthe gilded editions of Goethe and Schiller that they were publishing at the\ntime. Buber became their agent of modernization. One of the first books\nBuber placed here was his retelling of the stories of Rabbi Nachman,\none of the great figures of Eastern European Hasidism. The flagship\npublication edited by Buber was an ambitious forty-volume series of\nsocial studies, titled Die Gesellschaft, that appeared between\n1906 and 1912. As editor, Buber recruited and corresponded with many of the leading minds of his time.\n\n\nIn 1916, Martin and Paula moved to Heppenheim/Bergstrasse, half-way\nbetween Frankfurt/Main and Heidelberg. At that time, his friend Gustav\nLandauer severely criticized Buber’s enthusiasm for the salutary\neffect that, as Buber saw it, the war was having on a hitherto\nfragmented society (Gesellschaft), transforming it into a\nnational community (Gemeinschaft). Buber later claimed that it\nwas at this time that he began to draft the book that was to become\nI and Thou. In Frankfurt, Buber met Franz Rosenzweig\n(1886–1929) with whom he was to develop a close intellectual\ncompanionship. In the early nineteen twenties, Rosenzweig recruited\nBuber as a lecturer for his unaffiliated (“free”) Jewish\nadult education center (Freies jüdisches Lehrhaus) and he\nmanaged Buber’s appointment as university lecturer in Jewish\nreligious studies and ethics, a position endowed by a Jewish community\nthat initially opposed Buber as too radical. Rosenzweig also became\nBuber’s chief collaborator in the project, initiated by the young\nChristian publisher Lambert Schneider, to produce a new translation of\nthe Bible into German, a project he continued after Rosenzweig’s\ndeath. Dismissed by the Nazis from the university in 1933, Buber served\nas the architect of German Jewish teacher re-education through the\nso-called Mittelstelle für jüdische\nErwachsenenbildung (Simon, 1959). In 1937 Buber received a\nlong-coveted call to teach at the Hebrew University in Jerusalem (officially founded in 1925), an institution whose creation he had promoted since 1902 and that he \nrepresented as a member of its board of overseers. In Jerusalem, Buber\nreturned to the field of social philosophy, an academic appointment the\nuniversity administration wrested from a faculty that deemed the\n“Schriftsteller Dr. Martin Buber” neither a genuine scholar of religion nor sufficiently educated as a specialist in Jewish\nstudies. World-famous in his later years, Buber traveled and lectured\nextensively in Europe and the United States.\n\n\nBuber’s wide range of interests, his literary abilities, and the\ngeneral appeal of his philosophical orientation are reflected in the\nfar-flung correspondence he conducted over the course of his long\nlife.  As the editor of Die Gesellschaft, Buber corresponded\nwith Georg Simmel, Franz Oppenheimer, Ellen Key, Lou\nAndreas-Salomé, Werner Sombart, and many other academics and\nintellectuals. Among the poets of his time with whom he exchanged\nletters were Hugo von Hofmannsthal, Hermann Hesse, and Stefan\nZweig. He was particularly close to the socialist and Zionist novelist\nArnold Zweig. With poet Chaim Nachman Bialik and the later Nobel\nlaureate Sh. Y. Agnon Buber shared a deep interest in the revival of\nHebrew literature. He published the works of the Jewish Nietzschean\nstory-teller Micha Josef Berdiczewsky. He was a major inspiration to\nthe young Zionist cadre of Prague Jews (Hugo Bergmann, Max Brod,\nRobert Weltsch), and the Jewish\nadult education system he organized under the Nazis inadvertently provided a last bastion\nfor the free exchange of ideas for non-Jews as well. Buber’s name is\nintimately linked with that of Franz Rosenzweig and his circle (Eugen\nRosenstock-Huessy, Hans Ehrenberg, Rudolf Ehrenberg, Viktor von\nWeizsäcker, Ernst Michel, etc.), an association that manifested\nitself, among others, in the journal Die Kreatur\n(1926–29). The journal Der Jude, founded and edited by\nBuber from 1916 until 1924, and several editions of his speeches on\nJudaism made Buber a central figure of the Jewish cultural\nrenaissance of the early twentieth century.  Buber’s work awakened\nmany young intellectuals from highly assimilated families, such as Ernst Simon, to the possibility of embracing Judaism as a living faith. Others, among them Franz Rosenzweig, Gershom Scholem, and Leo Strauss, developed their scholarly and philosophical agendas in critical appreciation of Buber without giving in to the seductions of “Buberism.” Buber\ncounted among his friends and admirers Christian theologians such as\nKarl Heim, Friedrich Gogarten, Albert Schweitzer, and Leonard\nRagaz. His philosophy of dialogue entered into the discourse of\npsychoanalysis through the work of Hans Trüb, and is today among\nthe most popular approaches to educational theory in German-language\nstudies of pedagogy.\n2. Philosophical Influences\n\n\nAmong Buber’s early philosophical influences were Kant’s\nProlegomena, which he read at the age of fourteen,\nand Nietzsche’s Zarathustra. Haunted by the seeming infinity of space and time, Buber found solace in Kant’s understanding that\nspace and time are mere forms of perception that structure the \nmanifold of sensory impressions. At the same time, Kant allows to think of being as transcending the pure forms of human intellection. Buber’s mildly religious reading of Kant, which seems both conventional and autodidactic, seems to have been untrammeled by the debates between the various schools of neo-Kantianism that developed since the 1860’s and came to dominate much of the academic teaching of philosophy across Germany until the First World War. From Nietzsche and Schopenhauer Buber\nlearned the importance of the will, the power to project oneself\nheroically into a fluid and malleable world, and to do so according to\none’s own measure and standard. Though Buber’s philosophy\nof dialogue is a decisive step away from Nietzschean vitalism, the\nfocus on lived experience and embodied human wholeness, as well as the\nprophetic tone and aphoristic style Buber honed from early on,\npersisted in his subsequent writings. Between 1896 and 1899 he studied the\nhistory of art, German literature, philosophy, and psychology in\nVienna, Leipzig (1897/98), Berlin (1898/99), and Zurich (1899). In Vienna he\nabsorbed the oracular poetry of Stefan George, which influenced him\ngreatly, although he never became a disciple of George. In Leipzig and\nBerlin he developed an interest in the ethnic psychology (Völkerpsychologie) of Wilhelm\nWundt, the social philosophy of Georg Simmel, the psychology of Carl\nStumpf, and the lebensphilosophische approach to the\nhumanities of Wilhelm Dilthey. In Leipzig he attended meetings of the\nSociety for Ethical Culture (Gesellschaft für ethische\nKultur), then dominated by the thought of Lasalle and\nTönnies.\n\n\nFrom his early reading of philosophical literature Buber retained some\nof the most basic convictions found in his later writings. In Kant he\nfound two answers to his concern with the nature of time. If time and\nspace are pure forms of perception, then they pertain to things only\nas they appear to us (as phenomena) and not to\nthings-in-themselves (noumena). If our experience\nof others, especially of persons, is of objects of our experience,\nthen we necessarily reduce them to the scope of our phenomenal\nknowledge, in other words, to what Buber later called\nthe I-It relation. Yet Kant also indicated ways of\nmeaningfully speaking of the noumenal, even though not in terms of\ntheoretical reason. Practical reason – as expressed in \"maxims of action,\" categorical imperatives, or principles of duty we choose for their own sake and regardless of outcome – obliges us to consider persons as ends in themselves rather than means to an end. This suggests something like an absolute\nobligation. Teleological (aesthetic) judgment, as developed in Kant’s\nThird Critique, suggests the possibility of a rational grounding of\nrepresentation. Taken together, Kant’s conceptions of ethics and\naesthetics resonated with Buber’s notion that the phenomenon is always\nthe gateway to the noumenon, just as the noumenal cannot be\nencountered other than in, and by way of, concrete phenomena. Thus Buber\nmanaged to meld Kantian metaphysical and ethical conceptions into a\nmore immediate relation with things as they appear to us and as we\nrepresent them to ourselves. Buber succeeded in translating this theoretical dialectic of immediacy and distance, phenomenal encounter and reflexivity, into a style he cultivated in his writing but also in his manner of personal interactions. Buber sought not only to describe but to live the tension between a Dionysian primacy of life in its particularity, immediacy, and individuality and the Apollonian world of form,\nmeasure, and abstraction as inter-dependent forces. Both are constitutive of\nhuman experience in that they color our interactions with the other in\nnature, with other human beings, and with the divine Thou. Buber thus developed his own distinctive voice in the emerging chorus of writers, thinkers, and artists of his time who rallied against the widely-perceived \"alienation\" associated with modern life.\n3. The early Buber: Gestalt as a means of realization\n\n\nBuber’s early writings include anthologies, such as The Tales of\nRabbi Nachman (1906), The Legend of the Baal Shem Tov\n(1908), and mystical writings from world religions (Ecstatic\nConfessions, 1909), lectures on Judaism (On Judaism,\n1967b), and an expressionist dialogue on “realization”\n(Daniel, 1913). His essays on the arts include reflections on\nthe Isenheim Altarpiece, the dance of Nijinsky (Pointing the\nWay, 1957), Jewish art, and the painter Lesser Ury (The First\nBuber, 1999a). Common to these early productions is the\npreoccupation with shape (Gestalt), movement, color,\nlanguage, and gesture as the means of a “realized” or\n“perfected” particular human existence that represents\nlife beyond the limits of spatio-temporal duration imposed on us in\nthe manner of a Cartesian grid.\n\n\nThe German words Form (form) and Gestalt (here\ntranslated as “shape”) are not identical, although, in\nEnglish, it is easy to confuse one with the other. Buber uses\nGestalt as a term of central, constitutive, and animating\npower, contrasting it with the Platonic term Form, which he\nassociates with a lack of genuine vitality. Commenting upon a work by\nMichelangelo, Buber speaks of Gestalt as hidden in the raw\nmaterial, waiting to emerge as the artist wrestles with the dead block.\nThe artistic struggle instantiates and represents the more fundamental\nopposition between formative (gestaltende) and shapeless\n(gestaltlose) principles. The tension between these, for\nBuber, lay at the source of all spiritual renewal, raging within every\nhuman individual as the creative, spiritual act that subjugates\nunformed, physical stuff (1963b: 239). It is the free play of\nGestalt that quickens the dead rigidity of form.\n\n\nThe wrestling with form and its overcoming and its reanimation with\nliving energy in Buber’s early work was rooted in a concern with\nthe embodiment of perception and imagination. Whether writing about\nHasidic masters, Nijinsky, religiosity, Judaism, mysticism, myth,\n“the Orient,” or the Isenheim Altar, Buber always returned\nto the same fundamental dynamics. Everything starts from the most basic\nfacts of human existence: the body and motion. As understood by the\nearly Buber (following a Kantian intuition), the world is one in which\nthe objective spatial order was dissolved, where up and down, left and\nright, bear no intrinsic meaning. More fundamentally, orientation is\nalways related to the body, which is, however, an objective datum. Ethical\nlife remains inextricably linked, within the world of space, to the\nhuman body and to physical sensation as they reach across the divide\ntoward an unmitigated Erlebnis. The “unity,” so\nimportant to Buber’s early conception of the self, was not an\noriginal one. It was instead the effect of those gestural acts that\n“dance it out” (Pointing the Way, 1957).\n\n\nBuber conceived of political community as a type of plastic shape,\nan object (or subject) of Gestaltung and hence realization.\nJust as he had enlivened Kant’s distinction between phenomenon and\nnoumenon with his literary imagination, so too he transformed the\nvalue-theoretical distinction between Gesellschaft (society)\nand Gemeinschaft (community), types of social aggregation\ntheorized by Ferdinand Tönnies, into a wellspring for his\npolitical speeches and writings. The first arena for his social,\npsychological, and educational engagement was the Zionist movement.\nBuber’s social philosophy was stimulated and decisively influenced by his close friend, the anarchist Gustav Landauer, whom he recruited to write the volume on revolution for his series Die Gesellschaft. As a pioneer of social thought and a student of Georg Simmel, Buber participated in the 1909 founding conference of\nthe German sociological association. Buber’s social-psychological\napproach to the study and description of social phenomena and his interest in the constitutive correlation between the individual and his and her social experience\nremained important aspects of his philosophy of dialogue. It came to\nthe fore again in his last academic position at Hebrew\nUniversity in Jerusalem, where he taught social philosophy (prominent\nstudents: Amitai Etzioni, Shmuel Eisenstadt).\n\n\nBuber’s thought matured under the impact of Landauer’s harsh critique, which persuaded Buber that he had unduly romanticized the war. Buber’s 1916 lead essay\nfor the new journal Der Jude still praised the war as an\nopportunity for the modern Jew to forge, out of the chaos of rupture, a\nfeeling for community, connection, a new unity, a unified\nGestalt, one that could restore the Jewish people to a\ncondition of wholeness. For Buber’s friend Landauer, such\nthoughts were “very painful…very repugnant, and borderline incomprehensible. Object though you will, I call this way of thinking aestheticism and formalism and I say that you have no right…to try and tuck these tangled events into your philosophical scheme\n(schönen und weisen Allgemeinheiten): what results is\ninadequate and outrageous” (Letters of Martin Buber, p.\n189; transl. modified). Landauer continued to argue, “Historical matters can only\nbe talked about historically, not in terms of formal patterns\n(formalem Schematismus) … I gladly grant that behind\nthis is the desire to see greatness; but desire alone is not sufficient\nto make greatness out of a confused vulgarity” (ibid., 190–1).\nLandauer’s challenge to the grotesque fusion of\nErlebnis, Gemeinschaft, and Gestalt out of\nworld war and mass slaughter precipitated the end of aesthetic\nreligiosity in Buber’s work.\n4. Philosophy of Dialogue: I and Thou\n\n\nBuber’s best-known work is the short philosophical essay I and\nThou (1923), the basic tenets of which he was to modify, but never\nto abandon. In this work, Buber gives expression to the intuition that\nwe need to withstand the temptation to reduce human relations to the\nsimple either/or of Apollonian or Dionysian, rational or romantic\nways of relating to others. We are beings that can enter into dialogic\nrelations not just with human others but with other animate beings,\nsuch as animals, or a tree, as well as with the Divine Thou. The\nduality of relations and, at its extreme, their coincidence, may serve\nas the key to Buber’s mature thought on everything from his\napproach to biblical faith to his practical politics in matters of\nJewish-Arab relations in Palestine. I and Thou was first\ntranslated into English in 1937 by Ronald Gregor Smith and later again\nby Walter Kaufmann. The German original was an instant classic and remains in print today. In the 1950s and 60s, when Buber first traveled\nand lectured in the USA, the essay became popular in the\nEnglish-speaking world as well.\n\n\nWhereas before World War I Buber had promoted an aesthetic of unity\nand unification, his later writings embrace a rougher and more\nelemental dualism. Buber always opposed philosophical monism, which he\nidentified with Bergson, and objected to “doctrines of\nimmersion,” which he identified with Buddhism. Complicating the\nundifferentiated shape of mystical experience (as sought by the\nmedievals, including Eckhart, as an annihilation of self), the\nprofoundly dualistic world-view proffered in I and Thou\nreferences Cusa’s coincidentia oppositorum as an\nexpression of human limits. Buber’s text reduces the relation\nbetween persons, animate objects, and deity to three expressive\nsignifiers: “I”, “You”, and “It”. \nThey are the elemental variables whose\ncombination and re-combination structure all experience as relational.\nThe individuated elements realize themselves in relations, forming\npatterns that burst into life, grow, vanish, and revive. Human\ninter-subjectivity affirms the polymorphous I-Thou encounter.\nResting upon the claim that no isolated I exists apart\nfrom relationship to an other, dialogue or “encounter”\ntransforms each figure into an ultimate and mysterious center of value\nwhose presence eludes the concepts of instrumental language. The\nheteronomous revelation of a singular presence calls the subject into\nan open-ended relationship, a living pattern, that defies sense, logic,\nand proportion; whereas the I-It relationship, in its most\ndegenerate stage, assumes the fixed form of objects that one can measure and manipulate.\nAt the core of this model of existence is the notion of encounter as\n“revelation.” As understood by Buber, revelation is the\nrevelation of “presence” (Gegenwart). In contrast\nto “object” (Gegenstand), the presence revealed by\nrevelation as encounter occupies the space “in between” the\nsubject and an other (a tree, a person, a work of art, God). This\n“in between” space is defined as “mutual”\n(gegenseitig). Contrasting with the Kantian concept of\nexperience (Erfahrung), Erlebnis (encounter), or\nrevelation of sheer presence, is an ineffable, pure form that carries\nnot an iota of determinate or object-like conceptual or linguistic\ncontent. Buber always insisted that the dialogic principle, i.e., the\nduality of primal words (Urworte) that he called the\nI-Thou and the I-It, was not an abstract conception\nbut an ontological reality that he pointed to but that could not be\nproperly represented in discursive prose.\n\n\nThe confusion (and/or con-fusion) between philosophy and religion is\nespecially marked in I and Thou. While Buber seems to lack a\nfully worked-out epistemology and occasionally revels in paradoxes that\nborder on mystical theology, it has been argued that Buber did indeed\nsolve the inherent “difficulty of dialogics that it reflects on,\nand speaks of, a human reality about which, in his own words, one\ncannot think and speak in an appropriate manner” (Bloch [1983] p.\n62). Debates about the strength and weakness of I and Thou as\nthe foundation of a system hinge, in part, on the assumption that the\nfive-volume project, to which this book was to serve as a prolegomenon\n(a project Buber abandoned), was indeed a philosophical one.\nBuber’s lectures at the Freies jüdisches Lehrhaus\nand his courses at University of Frankfurt, as well as letters to\nRosenzweig show that, at the time of its writing, he was preoccupied\nwith a new approach to the phenomenology of religion (cf. Schottroff,\nZank). In Buber’s cyclical conception of the history of\nreligions, the revelation of presence mixes into and animates the\nliving and lived forms of historical religion (institutions, texts,\nrituals, images, and ideas), becoming over time ossified and rigid and\nobject-like, but structurally open to the force of renewal based on new\nforms of encounter as revelation. The history of religion as described\nby Buber in the closing words of I and Thou is a contracting,\nintensifying spiral figure that has redemption as its telos. It would\nbe artificial, however, to separate Buber’s interest in religious\nphenomena from his interest in a general philosophical anthropology.\nRather, Buber seems to have tried to find one in the other,\nor—put differently—to make religious belief and practice\nperspicacious in light of a general philosophical anthropology.\n5. Zionism\n\n\nAt the very beginning of his literary career, Buber was recruited by\nthe Budapest-born and Vienna-based journalist Theodor Herzl to edit the\nmain paper of the Zionist party, Die Welt. He soon found a\nmore congenial home in the “democratic faction” of\n“cultural Zionists” led by Chaim Weizmann, then living in\nZurich. Buber’s phases of engagement in the movement’s political\ninstitutions alternated with extended phases of disengagement, but he\nnever ceased to write and speak about what he understood to be the\ndistinctive Jewish brand of nationalism. Buber seems to have derived an\nimportant lesson from the early struggles between political and\ncultural Zionism for the leadership and direction of the movement. He\nrealized that his place was not in high diplomacy and political\neducation but in the search for psychologically sound foundations on\nwhich to heal the rift between modern realpolitik and a\ndistinctively Jewish theological-political tradition. Very much in\nkeeping with the nineteenth-century Protestant yearning for a Christian\nfoundation of the nation-state, Buber sought a healing source in the\nintegrating powers of religious experience. After a hiatus of more than\nten years during which Buber spoke to Jewish youth groups (most\nfamously the Prague Bar Kokhba) but refrained from any practical\ninvolvement in Zionist politics, he reentered Zionist debates in 1916\nwhen he began publishing the journal Der Jude, which served as\nan open forum of exchange on any issues related to cultural and\npolitical Zionism. In 1921 Buber attended the Zionist Congress in\nCarlsbad as a delegate of the socialist Hashomer Hatzair (“the\nyoung guard”). In the debates that followed the first\nanti-Zionist riots in Palestine, Buber joined the Brit Shalom,\nwhich argued for peaceful means of resistance. During the Arab revolt\nof 1936–39, when the British government imposed quotas on immigration\nto Palestine, Buber argued for demographic parity rather than trying to\nachieve a Jewish majority. Finally, in the wake of the Biltmore\nConference, Buber (as a member of Ihud) argued for a\nbi-national rather than a Jewish state in Palestine. At any of these\nstages Buber harbored no illusion about the chances of his political\nviews to sway the majority but he believed that it was important to\narticulate the moral truth as one saw it. Needless to say, this\npolitics of authenticity made him few friends among the members of the\nZionist establishment.\n\n\nAt the theoretical core of the Zionism advanced by Buber was a\nconception of Jewish identity that was neither entirely determined by religion nor by nationality, but constituted a unique hybrid. From early on, Buber rejected any state-form for the Jewish people in Palestine. This was clear already in a\nwidely-noted 1916 exchange of letters with the liberal philosopher\nHermann Cohen. Cohen rejected Zionism as incommensurate with the Jewish\nmission of living as a religious minority with the task of maintaining\nthe idea of messianism that he saw as a motor of social and political\nreform within society at large. In contrast, Buber embraced Zionism as\nthe self-expression of a particular Jewish collective that could be\nrealized only in its own land, on its soil, and in its language. The\nmodern state, its means and symbols, however, were not genuinely\nconnected to this vision of a Jewish renaissance. While in the writings\nof the early war years, Buber had characterized the Jews as an oriental\ntype in perpetual motion, in his later writings the Jews represent no\ntype at all. Neither nation nor creed, they uncannily combine what he\ncalled national and spiritual elements. In his letter to Gandhi, Buber\ninsisted on the spatial orientation of Jewish existence and defended\nthe Zionist cause against the critic who saw in it only a form of\ncolonialism. For Buber, space was a necessary but insufficient material\ncondition for the creation of culture based on dialogue. A\nGesamtkunstwerk in its own right, the Zionist project was to\nepitomize the life of dialogue by drawing the two resident nations of\nPalestine into a perfectible common space free from mutual\ndomination.\n6. Political Theology\n\n\nBuber honed his political theology in response to the conflict\nbetween fascism and communism, the two main ideologies dominating\nmid-twentieth century Europe. His national-utopian thought shared\ntraits with both of these extreme positions and made him, in fact, one\nof the few Jewish personages “acceptable” as a partner for\ndebate with moderate National Socialists in the early 1930s, a\nproximity he himself vigorously dismissed as a misperception. His\npolitical position remained indissolubly linked to his\nphilosophical-theological commitment to the life of dialogue developed\nin I and Thou. According to Buber, politics was the work by\nwhich a society shapes itself. He rejected any hardened ideological\nformations of “the collective” and thus objected to the\nsolutions articulated on either political extreme. He understood these\nto recognize neither an I nor a Thou in social life. Buber particularly\nopposed the notion that the political sphere rested on the friend/enemy\ndistinction, as theorized by the ultra-conservative jurist Carl\nSchmitt. Buber’s political ideal, “a-cephalic” and\nutopian as it was, was derived from his reconstruction of the ancient\nIsraelite polity as reflected in the Book of Judges. Conversely, it has been argued, his reading of Judges was inspired by the anarchism of Landauer. (See Brody (2018))\n\n\nAs presented by Buber in the 1930s, the primary governing trope of\nJewish political theology—divine kingship (Königtum\nGottes)—represents an answer to Schmitt, whose political\ntheology allowed divine power to be absorbed by the human sovereign.\nBuber resisted this slippage, privileging instead the anti-monarchical\nstrata of the Hebrew Bible. In his 1932 book on the Kingship of\nGod, the biblical hero Gideon from chapter eight of the Book of\nJudges stands out as the leader who, beating back the Philistine\nenemy, declines any claim to hereditary kingship. What Buber reads as\na genuine, unconditional “no” to political sovereignty\nrests on an unconditional “yes” affirming the absolute\nkingship of God. Against the theory staked out by Schmitt, the\nassertion that God alone is sovereign means that God’s authority is\nnon-transferable to any human head or political institution. Thus\nBuber preserves the notion of divine sovereignty over all forms of\nstate apparatus and tyranny. Buber privileged simple, preliminary,\nprimitive, and immediate forms of government, insisting that genuine\n“theocracy” is not a form of government at all, but rather\na striving against the political tide. No “theological work of\nart,” the messianic ideal of divine kingship found in the Hebrew\nBible is presented as a reliable image preserved by the collective\nmemory of tradition. Buber maintained that once upon a time the\nIsraelite deity YHWH was, in fact, the\nheretog or warrior-king of the people. But he also knew that\nhe was unable to posit this for certain, and so proceeded to admit\nthat the image reflects not a historical actuality that we can know\nbut only a historical possibility.\n\n\nIn Paths in Utopia (1947), Buber was to plot the “image\nof perfect space” as one composed of lines that allow no fixed\ndefinition, the zone between the individual and collective constantly\nrecalibrated according to the free creativity of its\nmembers. “The relationship between centralism and\ndecentralization is a problem which…cannot be approached in\nprinciple, but…only with great spiritual tact, with the\nconstant and tireless weighing and measuring of the right proportion\nbetween them.” A “social pattern,” utopia was based\non a constant “drawing and re-drawing of lines of\ndemarcation” (Paths in Utopia, 1996, p. 137). An\n“experiment that did not fail,” the Jewish village\ncommunes in Palestine (i.e. the kvutza, kibbutz, and\nmoshav) owed their success to the pragmatism with which their\nmembers approached the historical situation, to their inclination\ntowards increased levels of federation, and to the degree to which they\nestablished a relationship to the society at large. Single units\ncombine into a system or “series of units” without the\ncentralization of state authority (ibid., 142–8).\n“Nowhere…in the history of the Socialist movement were men so\ndeeply involved in the process of differentiation and yet so intent on\npreserving the principle of integration” (ibid., 145). They\ndiscovered “[t]he right proportion, tested anew every day\naccording to changing conditions, between group-freedom and collective\norder” (ibid., 148). It is not difficult to recognize in\nthis description of the modern Jewish agricultural collective an\nupdated version of the biblical tribal past that Buber idealized in his\nwork on the primitive Israelite polity of the age of the biblical\njudges.\n7. Distance and Relation: Late Philosophical Anthropology\n\n\nResponding to the unfolding political chaos in Europe and to the\nstruggle between Jews and Arabs in Palestine, Buber’s philosophical\noeuvre assumed a more occasionalist and essayistic form in the\nlate 1930s and 1940s. In addition to the works cited above and works\non religion, the Bible, and prophetic faith, his last major\nphilosophical publication was The Eclipse of God (1951). What\nunites all of the late works as a group is the common emphasis on\nphilosophical anthropology, the place of the individual person in the\nworld vis-à-vis other human beings in human community. Whether\nreflecting on “man,” “the Jew,” or “the\nsingle one,” always critical to Buber’s late thought is the\ntension between distance and relation, and the role of mediated images\nin dialogical, open-ended, non-fixed relation to the social and\nnatural world. In this, Buber addressed, but never directly, the\ntension between “fact” and “value,” explored\nwith more rigor in later nineteenth- and early twentieth-century German\nphilosophy and in post-war Anglo-American analytic philosophy.\n\n\nOne of the signature pieces from this period is the essay on\nKierkegaard, “The Question to the Single One” (1936). Buber\nturns to Kierkegaard in order to force the question of solipsism. For\nBuber, the Danish philosopher stands for a modern alienation from the\nworld. The question Buber asks is whether it is even possible to\nconceive of the human being as a “single one.” According to\nBuber, Kierkegaard’s love of God excludes the love of his\nneighbor, the fellow creature with whom we constitute “the\nworld” in human terms. With his eye on the creation of Genesis,\nBuber describes man as a subject hovering over and embracing the\ncreaturely world. In this model, there is no renunciation of objects\nand political life. At the same time, relation does not mean the giving\noneself over to the crowd. The embrace of creaturely existence remains\nvexing. Buber characterizes the human being in terms of\n“potentiality” within factual and finite limits, not in\nterms of the “radicality” he sees in Kierkegaard. That is\nto say, instead of positing a radical dichotomy between community and\nthe single one, Buber argues that they are compatible with, and\nnecessary for, one another.\n\n\nThis critique of the single one in relation to a larger social world\nbelongs to the world-picture established by Buber in the essay\n“What is Man?” (1938). At stake for Buber was a knowledge\nof the human person as a whole, i.e., a complete understanding of human\nsubjectivity. The methodological key to the essay is a philosophical\nanthropology. Buber assumed that only by entering\ninto the act of self-reflection can the philosophical anthropologist\nbecome aware of human wholeness based on a structural distinction\nbetween epochs of human habitation and epochs of human homelessness. In\nthe former, philosophical anthropology is cosmological, i.e.\nfundamentally related to the world and to human environments. In the\nlatter, human subjectivity is conceived of as self-standing and\nindependent. The conceptual tension is between being at home in a\nuniverse of things in contrast to what is presented as the collapse of\na rounded and unified world vis-à-vis self-divided forms of\nconsciousness. In order to preserve the imbrication of singular\nselfhood and the bonding of human personhood, Buber rejected the false\nchoice between individualism and collectivism. As Buber always\nunderstood it, human wholeness lies in the meeting of the one with the\nother in a living fourfold relation to things, individual persons, the\nmystery of Being, and self. Every living relation is essential and\ncontributes to human wholeness because human wholeness\n(“man’s unique essence”) is known or posited only in\nliving out a set of relations.\n\n\nIf relationship constitutes the fundamental datum of human\nwholeness, it remains also true that relation was not understood by\nBuber independent of its conceptual antipode, namely\n“distance.” As developed in the essay “Distance and\nRelation” (1951), relation cannot take shape apart from or without\nthe prior setting of things, persons, and spiritual beings at a\ndistance. For Buber, this setting of things, persons, and beings at a\ndistance is the only way to secure the form of otherness without which\nthere can be no relation. For without the form of otherness there can be no\nconfirmation of self insofar as the confirmation of the I is always\nmediated by the other who confirms me, both at a distance and in\nrelation, or rather in the distance that is relation and the relation\nthat is difference.\n\n\nWhile Buber most famously understood the I-Thou relationship as one\nbased on immediacy, he always steeped his thought in the power of\nmediating images and other plastic forms as the material stuff of\ninter-subjective relationship. In the essay \"Man and his Image-Work,\"\nBuber set out to understand something about the formation of images in\nrelation to the world, the world encompassed by art, faith, love, and\nphilosophy. Buber postulated three levels of world formation. The first\ntwo levels are the familiar Kantian concepts of a noumenal\n“x” world and a phenomenal sense-world of form, comprising\nthe world as shaped by and in images and concepts. Buber’s\nconception of the third level, what he calls the world of perfect form,\nderives from the mystical tradition. This paradoxical level of world\nformation is expressed in terms of perfected form-relations. In art,\nfaith, and philosophy, the human image-work emerges out of relational\nencounters between persons and an independent \"world\" that exists on\nits own, but is not imaginable. \n\n\nThe concern about “images” in relation to distance and\ndialogue surfaced again in Buber’s last major work, The\nEclipse of God (1952). The so-called “eclipse of God”\nwas Buber’s symbol for the spiritual crisis in postwar Western\ncivilization. It designated a philosophical collapse as much as a moral\none. Like Sartre and Heidegger, Buber directed his attention to\nconcrete existence. But unlike his fellow\n“existentialists,” Buber was moved by the interaction\nbetween humans, individually and collectively, and an absolute reality\nthat exceeds the human imagination. Against Sartre, Heidegger, and also\nCarl Jung, Buber rejected the picture of self-enclosed human subjects\nand self-enclosed human life-worlds beyond which there are no external,\nindependent realities. Towards the end of his career as a writer and\nthinker, Buber sought to maintain the distinction and relation between\nthe human subject and an external other in order to\nsustain an ontological source of ethical value in opposition to the\nfalse absolutes of a modern world that had fused the absolute with the\npolitical and historical products of the human spirit.\n8. Criticism\n\n\nPhilosophical criticism of Buber tends to focus on three areas: [1]\nepistemological questions regarding the status of the I-Thou\nform of relationship and the status of the object-world delimited by\nthe I-It form of relationship, [2] hermeneutical questions\nregarding Buber’s reading of Hasidic source material, and [3] doubts\nregarding the author’s rhetoric and style that touch upon the\nphilosophy of language. All three lines of criticism have at their\ncore the problem of the conflict between realism and idealism,\nworld-affirmation and world-denial.\n\n\nThe nature of the world picture in Buber’s magnum opus has\nalways been among the most contested aspects of Buber’s\nphilosophy in the critical literature. I and Thou is\nconsidered to have inaugurated “a Copernican revolution in\ntheology (…) against the scientific-realistic attitude”\n(Bloch [1983], p. 42), but it has also been criticized for its\nreduction of fundamental human relations to just two—the\nI-Thou and the I-It. Writing to Buber after the\npublication of I and Thou, Rosenzweig would not be the last\ncritic to complain, “In your setting up the I-IT, you give the\nI-Thou a cripple for an opponent.” He continued to rebuke,\n“You make of creation a chaos, just good enough to provide\nconstruction material (Baumaterial) for the new\nbuilding” (Franz Rosenzweig, Briefe und Tagebücher,\npp. 824–5). In Jewish philosophical circles, it has been long argued\nthat Buber was unable to ward off the relativism, subjectivism, and\nantinomianism that are said to permeate non-realist epistemologies and\nontologies. Building on Rosenzweig’s complaint against\nBuber’s epistemology, Steven Katz called for a\n“realism” that affirms the rich world of stable objects\nextended in time and space. It is still widely assumed by his critics\nin Jewish philosophy that in his critique of Jewish law and the\nI-It form of relationship Buber rejected the world of\nobject-forms in toto.\n\n\nIn addition to hermeneutical arguments regarding historicism,\nanti-historicism, literary style and poetic license, arguments about\nthe picture of Hasidism that emerged out of Buber’s research and\nwriting are also based upon the philosophical world picture as it took\nshape in Buber’s philosophical universe. Against Buber’s corpus of\nHasidica, the doyen of Kabbalah scholarship, Gershom Scholem, was one\nof the first to throw down the gauntlet. Scholem argued that Buber’s\nfocus on the genre of folk-tales obscured the theoretical works within\nthe corpus Hasidic literature, where the phenomenon of (gnostic) world\ndenial was more pronounced than in the popular tales. Buber’s later\ncollections of Hasidic tales in particular reflect a this-worldly\nethos at odds with important tenets of Hasidic mysticism. Whereas\nBuber’s early, neo-romantic Hasidica assumed a more distant and even\nantagonistic relation to the world of time and space, critics, such as\nScholem, Katz, and Schatz-Uffenheimer, focused their critique almost\nexclusively on the later body of work, in which a this-wordly\ncosmology was more sharply articulated, in line with Buber’s own\nrenewed interest, starting in the mid to late 1920s, with quotidian\nforms of existence.\n\n\nThe analytic philosopher Steven T. Katz, author of an important\nessay about the particularism of mystical language, articulated a range\nof criticisms directed against Buber’s writings (Katz, 1985).\nMore recently, Katz revisited and mitigated some of these earlier\ncriticisms that included the charge of antinomianism, the lack of an\naccount for the enduring character of the I-Thou relation, and\nthe misrepresentation of Hasidic thought (Katz in Zank, 2006). What\nremains most objectionable in Buber is the tendency toward an\naestheticization of reality and the problem of Buber’s often\nslippery poetic rhetoric. Walter Kaufmann, who produced a second\nEnglish translation of I and Thou, articulated his displeasure\nwith Buber most strongly. While he did not regard the lack of deep\nimpact of Buber’s contributions to biblical studies, Hasidism, and\nZionist politics as an indication of failure, Kaufmann considered I\nand Thou a shameful performance in both style and content. In\nstyle the book invoked “the oracular tone of false\nprophets” and it was “more affected than honest.”\nWriting in a state of “irresistible enthusiasm,” Buber\nlacked the critical distance needed to critique and revise his own\nformulations. His conception of the I-It was a\n“Manichean insult” while his conception of the\nI-Thou was “rashly romantic and ecstatic,” and\nBuber “mistook deep emotional stirrings for revelation.”\n(Kaufmann [1983] pp. 28–33). The preponderance in Buber’s writings of\nrhetorical figures, such as “experience,”\n“realization,” “revelation,”\n“presence” and “encounter,” and his\npredilection for utopian political programs such as anarchism,\nsocialism, and a bi-national solution to the intractable national\nconflict between Jews and Arabs in Palestine, are in line with a\nvagueness in his philosophical writing that often renders Buber’s\nthought suggestive, but elusive. Similar criticisms apply to\nBuber’s claim that language has the power to reveal divine\npresence or uncover Being.\n\n\nBuber’s early Jugendstil rhetoric was a far cry from\nthe neue Sachlichkeit of the nineteen twenties (Braiterman,\n2007). While similarly inclined literary authors like Hermann Hesse\npraised Buber’s German renditions of Hasidic lore and his Bible\ntranslation later gained popular praise among German theologians,\nothers, among them Franz Kafka, Theodor W. Adorno, and Siegfried\nKracauer, spoke of Buber’s style disparagingly.\n\n\nOn a more biographical note, the\nphilosopher of the “I and Thou” allowed very few people to\ncall him by his first name; the theorist of education suffered no\ndisturbance of his rigorous schedule by children playing in his own\nhome; the utopian politician alienated most representatives of the\nZionist establishment; and the innovative academic lecturer barely\nfound a permanent position in the university he had helped to create—the \nHebrew University of Jerusalem. Some of the most dedicated students\nof this inspiring orator and writer found themselves irritated by the\nconflict between their master’s ideas and their own attempts at putting\nthem into practice. In the final analysis it seems as if Buber always\nremained the well-groomed, affected, prodigiously gifted, pampered\nViennese boy, displaced in a land of horses and chemists, whose best\ncompany were the works of his own imagination and whose self-staging\novertures to the outside world were always tainted by his enthusiasm\nfor words and for the heightened tone of his own prodigious voice.\n9. Honors and Legacy\n\n\nLargely ignored by academic philosophers, Buber was already widely\nrecognized and reviewed across the larger field of German letters\nbefore World War I. He rose to renewed prominence in Germany\nafter World War II, where his Bible translation, collections of Hasidic\nstories, and writings on the philosophy of dialogue have remained in\nprint ever since. Among the honors Buber received after 1945 were the\nGoethe Prize of the City of Hamburg (1951), the Friedenspreis des\nDeutschen Buchhandels (Frankfurt am Main, 1953), and the Erasmus Prize\n(Amsterdam, 1963). Significant students who considered their own work a\ncontinuation of Buber’s were Nahum Glatzer (Buber’s only\ndoctoral student during his years at the university in Frankfurt,\n1924–1933, later an influential teacher of Judaic Studies at Brandeis\nUniversity), Akiba Ernst Simon (historian and theorist of education in\nIsrael who first met Buber at the Freies jüdisches Lehrhaus in\nFrankfurt, and who returned from Palestine to work with Buber for the\nMittelstelle für jüdische Erwachsenenbildung), and\nimportant Israeli scholars, such as Shmuel Eisenstadt, Amitai Etzioni,\nand Jochanan Bloch, who knew Buber in his later years when he taught\nseminars on social philosophy and education at the Hebrew University\nof Jerusalem. As for the United States, Buber’s American translator\nand biographer Maurice Friedman, a prolific author in his own right,\nalmost single-handedly introduced Buber to post-war American religion\nscholars and the larger reading public. In addition to Friedman,\nWalter Kaufmann, the author of one of the first English-language\nstudies of Nietzsche as well as books on religion and existentialism,\nhelped to popularize Buber in the United States, despite the\nabove-cited critique of Buber’s I and Thou. It was Kaufmann\nwho first included Buber in the canon of religious existentialism in\nthe 1950s and 1960s. In Jewish philosophy, Buber’s name has since been\neclipsed by those of Franz Rosenzweig and Emmanuel Levinas.\n", "bibliography": {"categories": ["<a id=\"WorCit\">Works Cited</a>", "<a id=\"Bibs\">Bibliographies</a>", "<a id=\"SelEarWorMarBub\">Selected Early Works By Martin Buber</a>", "<a id=\"ColEdiWriLet\">Collections and Editions of Writings and Letters</a>", "<a id=\"BubEng\">Buber in English</a>", "<a id=\"SelEdiVolMarBub\">Selected Edited Volumes on Martin Buber</a>", "<a id=\"SecLit\">Secondary Literature</a>"], "cat_ref_text": {"<a id=\"WorCit\">Works Cited</a>": ["</h3>\n<ul class=\"hanging\">", "Braiterman, Zachary, 2007, <em>The Shape of Revelation: Aesthetics\nand Modern Jewish Thought</em>, Stanford: Stanford University\nPress.", "Brody, Samuel H., 2018, <em>Martin Buber’s Theopolitics</em>, Bloomington: Indiana University Press.", "Friedman, Maurice, 1981, <em>Martin Buber’s Life and Work: The\nEarly Years, 1878–1923</em>, New York: Dutton.", "Bloch, Jochanan/Gordon, Hayyim (ed.), 1983, <em>Martin Buber.\nBilanz seines Denkens</em>, Freiburg i. B.", "Kaufmann, Walter, 1983, “Bubers Fehlschläge und sein\nTriumph” in Bloch [1983], pp. 22ff.", "Wurm, Carsten, 1994, <em>150 Jahre Rütten &amp; Loening\n… Mehr als eine Verlagsgeschichte</em>, Berlin:\nRütten &amp; Loening.", "Zank, Michael, 2006, “Buber and\n<em>Religionswissenschaft</em>: The Case of His Studies on Biblical\nFaith” in <em>New Perspectives on Martin Buber</em>,\nTübingen: Mohr Siebeck, pp. 61–82.\n</ul>\n<h3>"], "<a id=\"Bibs\">Bibliographies</a>": ["</h3>\n<ul class=\"hanging\">", "Catanne, Moshe, 1961, <em>A Bibliography of Martin Buber’s Works\n(1895–1957)</em>, Jerusalem: Bialik Institute.", "Cohn, Margot, 1980, <em>Martin Buber. A Bibliography of His\nWritings, 1897–1978.</em> Compiled by Margot Cohn and Raphael Buber.\nJerusalem: Magnes Press. This is the most authoritative bibliography\ncompiled by Buber’s long-time secretary and his son.", "Friedman, Maurice, 1963, “Bibliographie” in Paul\nArthur Schilpp and Maurice Friedman (ed.), <em>Martin Buber</em>,\nStuttgart: Kohlhammer1.", "Kohn, Hans, 1930, <em>Martin Buber</em>, Hellerau: J. Hegner. This biography\nincludes a bibliography of Buber’s writings from 1897 to 1928. The\nsecond edition (1961) contains bibliographic updates by Robert\nWeltsch.", "Moonan, Willard, 1981, <em>Martin Buber and His Critics. An\nAnnotated Bibliography of Writings in English Through 1978</em>, New\nYork &amp; London: Garland. With a list of the abstracts, indices,\nand bibliographies consulted by the author, indices of translators and\nauthors writing on Buber, and subject indices of writings by and about\nBuber.\n</ul>\n<h3>"], "<a id=\"SelEarWorMarBub\">Selected Early Works By Martin Buber</a>": ["</h3>\n<ul class=\"hanging\">", "1906–1912, <em>Die Gesellschaft. Sammlung sozial-psychologischer\nMonographien</em> [Society. A Collection of Social-Psychological\nMonographs], Frankfurt am Main: Rütten &amp; Loening. 40 volumes.\nThe first volume (Werner Sombart, <em>Das Proletariat</em>) includes\nBuber’s introduction to the series.", "1906b, <em>Die Geschichten des Rabbi Nachman</em> [The Tales of\nRabbi Nachman], Frankfurt am Main: Rütten &amp; Loening. Dedicated\nto “the memory of my grandfather, Salomon Buber, the last master\nof the old haskalah.” (“<em>Meinem Großvater Salomon \nBuber dem letzten Meister der alten Haskala bringe ich dies Werk der \nChassidut dar in Ehrfurcht und Liebe.</em>”)", "1908, <em>Die Legende des Baal Schem</em> [The Legend of the Baal\nShem], Frankfurt: Rütten &amp; Loening (second edition: 1916). On\nthe founder of the Hasidic movement in early eighteenth-century\nPodolia/Volynia,", "1911a, <em>Chinesische Geister- und Liebesgeschichten</em> [Chinese\nGhost and Love Stories], Frankfurt: Rütten &amp; Loening.", "1911b, <em>Drei Reden über das Judentum</em> [Three Speeches\non Judaism], Frankfurt: Rütten &amp; Loening, 1911 (second,\n“complete” edition, 1923). Dedicated to “my\nwife.”", "1913, <em>Daniel: Gespräche von der Verwirklichung</em>\n[Daniel, Dialogues on Realization], Leipzig: Insel-Verlag.", "1916–24, <em>Der Jude. Eine Monatsschrift</em> [The Jew. A\nMonthly], Wien/Berlin: R. Löwith and Berlin: Jüdischer\nVerlag. Founded by Buber, who edited it during these years and wrote\nmany contributions.", "1918, <em>Mein Weg zum Chassidismus. Erinnerungen</em> [My Path to\nHasidism. Recollections], Frankfurt: Rütten &amp; Loening.\nDedicated to “my beloved father.”", "1919, <em>Der heilige Weg. Ein Wort an die Juden und an die\nVölker</em> [The Holy Path. A Word to the Jews and to the\nGentiles], Frankfurt: Rütten &amp; Loening. Dedicated to\n“my friend Gustav Landauer at his grave.”", "1922, <em>Der grosse Maggid und seine Nachfolge</em> [The Great\nMaggid and his Succession], Frankfurt: Rütten &amp; Loening.", "1923, <em>Ich und Du</em> [I and Thou], Leipzig: Insel Verlag.", "1924, <em>Das verborgene Licht</em> [The Hidden Light], Frankfurt:\nRütten &amp; Loening.", "1925ff, <em>Die Schrift. Zu verdeutschen unternommen von Martin\nBuber</em> <em>gemeinsam mit Franz Rosenzweig</em>. Buber and\nRosenzweig’s translation of the Hebrew Scriptures was published by\nLambert Schneider first in his own publishing house in Berlin, between\n1933 and 1939 under the heading of Schocken Verlag, Berlin, and again,\nafter 1945, through the newly founded Lambert Schneider Verlag,\nHeidelberg.", "1926–29, <em>Die Kreatur</em> [Creation], Berlin: Lambert\nSchneider. A quarterly edited by Buber with the Protestant\npsychologist Victor von Weizsäcker and the dissident Catholic\ntheologian Joseph Wittig.\n</ul>\n<h3>"], "<a id=\"ColEdiWriLet\">Collections and Editions of Writings and Letters</a>": ["</h3>\n<ul class=\"hanging\">", "1953–62, <em>Die Schrift. Verdeutscht von Martin Buber gemeinsam\nmit Franz Rosenzweig</em>, improved and complete edition in four\nvolumes, Cologne: J. Hegner.", "1953a, <em>Hinweise. Gesammelte Essays</em>, Zurich: Manesse.", "1962, <em>Werke.</em> Erster Band: <em>Schriften zur\nPhilosophie</em> [<em>Works</em>, Volume One: <em>Philosophical\nWritings</em>], Munich and Heidelberg: Lambert Schneider.", "1963a, <em>Werke.</em> Dritter Band: <em>Schriften zum\nChassidismus</em> [<em>Works</em>, Volume Three: <em>Writings on\nHasidism</em>], Munich and Heidelberg: Lambert Schneider.", "1963b, <em>Der Jude und sein Judentum. Gesammelte Aufsätze und\nReden</em>, Cologne: J. Hegner.", "1964, <em>Werke.</em> Zweiter Band: <em>Schriften zur Bibel</em>\n[<em>Works</em>, Volume Two: <em>Writings on the Bible</em>], Munich\nand Heidelberg: Lambert Schneider.", "1965, <em>Nachlese.</em> Heidelberg: Lambert Schneider. English\ntranslation: 1967a.", "1972–75, <em>Briefwechsel aus sieben Jahrzehnten</em>, edited by\nGrete Schaeder, Volume I: 1897–1918 (1972), Volume II: 1918–1938\n(1973), Volume III: 1938–1965 (1975), Heidelberg: Lambert\nSchneider.", "1996, <em>The Letters of Martin Buber: A Life of Dialogue</em>,\nedited by Nahum Glatzer and Paul Mendes-Flohr, Syracuse: Syracuse\nUniversity Press.", "2001ff, <em>Werkausgabe</em>, edited by Paul Mendes-Flohr, Peter\nSchafer, Martina Urban, Bernd Witte and others. Gutersloh: Gutersloher\nVerlagshaus.\n</ul>\n<h3>"], "<a id=\"BubEng\">Buber in English</a>": ["</h3>\n<ul class=\"hanging\">", "1937, <em>I and Thou</em>, transl. by Ronald Gregor Smith,\nEdinburgh: T. and T. Clark. 2<sup>nd</sup> Edition New York: Scribners,\n1958. 1<sup>st</sup> Scribner Classics ed. New York, NY: Scribner, 2000,\nc1986", "1952, <em>Eclipse of God</em>, New York: Harper and Bros.\n2<sup>nd</sup> Edition Westport, Conn.: Greenwood Press, 1977.", "1957, <em>Pointing the Way</em>, transl. Maurice Friedman, New\nYork: Harper, 1957, 2<sup>nd</sup> Edition New York: Schocken,\n1974.", "1960, <em>The Origin and Meaning of Hasidism</em>, transl. M.\nFriedman, New York: Horizon Press.", "1964, <em>Daniel: Dialogues</em> <em>on Realization</em>, New York,\nHolt, Rinehart and Winston.", "1965, <em>The Knowledge of Man</em>, transl. Ronald Gregor Smith\nand Maurice Friedman, New York: Harper &amp; Row. 2<sup>nd</sup>\nEdition New York, 1966.", "1966, <em>The Way of Response: Martin Buber; Selections\nfrom his Writings</em>, edited by N. N. Glatzer. New York: Schocken\nBooks.", "1967a, <em>A Believing Humanism: My Testament</em>, translation of\n<em>Nachlese</em> (Heidelberg 1965) by M. Friedman, New York:\nSimon and Schuster.", "1967b, <em>On Judaism</em>, edited by Nahum Glatzer and transl. by\nEva Jospe and others, New York: Schocken Books.", "1968, <em>On the Bible: Eighteen Studies</em>, edited by Nahum\nGlatzer, New York: Schocken Books.", "1970a, <em>I and Thou</em>, a new translation with a prologue\n“I and you” and notes by Walter Kaufmann, New York:\nScribner’s Sons.", "1970b, <em>Mamre: Essays in Religion</em>, translated by Greta\nHort, Westport, Conn.: Greenwood Press.", "1970c, <em>Martin Buber and the Theater, Including Martin Buber’s\n“Mystery Play” Elijah</em>, edited and translated with\nthree introductory essays by Maurice Friedman, New York, Funk\n&amp;Wagnalls.", "1972, <em>Encounter: Autobiographical Fragments</em>. La Salle,\nIll.: Open Court.", "1973a, <em>On Zion: the History of an Idea,</em> with a new\nforeword by Nahum N. Glatzer, Translated from the German by Stanley\nGodman, New York: Schocken Books.", "1973b, <em>Meetings</em>, edited with an introduction and bibliography\nby Maurice Friedman, La Salle, Ill.: Open Court Pub. Co. 3rd ed.\nLondon, New York: Routledge, 2002.", "1983, <em>A Land of Two Peoples: Martin Buber on Jews and\nArabs</em>, edited with commentary by Paul R. Mendes-Flohr, New York:\nOxford University Press. 2<sup>nd</sup> Edition Gloucester, Mass.:\nPeter Smith, 1994", "1985, <em>Ecstatic Confessions</em>, edited by Paul\nMendes-Flohr, translated by Esther Cameron, San Francisco: Harper &amp;\nRow.", "1991a, <em>Chinese Tales: Zhuangzi, Sayings and Parables and\nChinese Ghost and Love stories</em>, translated by Alex Page, with an\nintroduction by Irene Eber, Atlantic Highlands, N.J.: Humanities Press\nInternational.", "1991b, <em>Tales of the Hasidim</em>, foreword by Chaim Potok, New\nYork: Schocken Books, distributed by Pantheon.", "1992, <em>On Intersubjectivity and Cultural\nCreativity</em>, edited and with an introduction by S.N. Eisenstadt,\nChicago: University of Chicago Press.", "1994, <em>Scripture and Translation</em>, Martin Buber and Franz\nRosenzweig, translated by Lawrence Rosenwald with Everett Fox.\nBloomington: Indiana University Press.", "1996, <em>Paths in Utopia</em>, translated by R.F. Hull. Syracuse:\nSyracuse University Press.", "1999a, <em>The First Buber: Youthful Zionist Writings of\nMartin Buber</em>, edited and translated from the German by Gilya G.\nSchmidt, Syracuse, N.Y.: Syracuse University Press.", "1999b, <em>Martin Buber on Psychology and Psychotherapy: Essays,\nLetters, and Dialogue</em>, edited by Judith Buber Agassi, with a\nforeword by Paul Roazin, New York: Syracuse University Press.", "1999c, <em>Gog and Magog: A Novel</em>, translated from the German\nby Ludwig Lewisohn, Syracuse, NY: Syracuse University Press.", "2002a, <em>The Legend of the Baal-Shem</em>, translated by\nMaurice Friedman, London: Routledge.", "2002b, <em>Between Man and Man</em>, translated by Ronald\nGregor-Smith, with an introduction by Maurice Friedman, London, New\nYork: Routledge.", "2002c, <em>The Way of Man: According to the Teaching of\nHasidim</em>, London: Routledge.", "2002d, <em>The Martin Buber Reader: Essential Writings</em>, edited\nby Asher D. Biemann, New York: Palgrave Macmillan.", "2002e, <em>Ten Rungs: Collected Hasidic Sayings</em>,\ntranslated by Olga Marx, London: Routledge.", "2003, <em>Two Types of Faith</em>, translated by Norman P.\nGoldhawk with an afterword by David Flusser, Syracuse, N.Y.: Syracuse\nUniversity Press.\n</ul>\n<h3>"], "<a id=\"SelEdiVolMarBub\">Selected Edited Volumes on Martin Buber</a>": ["</h3>\n<ul class=\"hanging\">", "Bloch, Jochanan/Gordon, Hayyim (ed.), 1983, <em>Martin Buber.\nBilanz seines Denkens</em>, Freiburg i. B.: Herder.", "Licharz, Werner/Schmidt, Heinz (ed.), 1989, <em>Martin Buber\n(1878–1965). Internationales Symposium zum 20. Todestag</em>. Two\nvolumes (Series: Arnoldshainer Texte), Arnoldshain: Haag and Herchen.", "Schilpp, Paul Arthur/Friedman, Maurice (ed.), 1963, <em>Martin\nBuber</em>, (Series: Philosophen des 20. Jahrhunderts), Stuttgart, Kohlhammer.\nEnglish edition: 1967, <em>The Philosophy of Martin Buber.</em>\n(Series: Library of Living Philosophers, vol. XII). Lasalle/Ill.: Open\nCourt. Among the contributors to this volume are, aside from Buber\nhimself, Max Brod, Emmanuel Lévinas, Emil Brunner, Emil\nFackenheim, Marvin Fox, Nahum Glatzer, Mordecai Kaplan, Walter\nKaufmann, Gabriel Marcel, Nathan Rotenstreich, Rivka\nSchatz-Uffenheimer, Ernst Simon, Jacob Taubes, C.F. von\nWeizsäcker, and Robert Weltsch.", "Zank, Michael (ed.), 2006, <em>New Perspectives on Martin\nBuber</em>, Tübingen: Mohr Siebeck. With essays by Joseph Agassi,\nLeora Batnitzky, Ilaria Bertone, Asher Biemann, Zachary Braiterman,\nMicha Brumlik, Judith Buber Agassi, Steven T. Katz, Paul Mendes-Flohr,\nGesine Palmer, Andrea Poma, Yossef Schwartz, Jules Simon, Martina\nUrban, and Michael Zank\n</ul>\n<h3>"], "<a id=\"SecLit\">Secondary Literature</a>": ["</h3>\n<ul class=\"hanging\">", "Avnon, Dan, 1998, <em>Martin Buber. The Hidden Dialogue</em>,\nLanham, Boulder, New York, Oxford: Rowman &amp; Littlefield.", "Babolin, A., 1965, <em>Essere e Alteritá in Martin\nBuber</em>, Padova: Gregoriana.", "Balthasar, Hans Urs von, 1958, <em>Einsame Zwiesprache. Martin\nBuber und das Christentum</em>, Cologne: J. Hegner.", "Berkovits, Eliezer, 1962, <em>A Jewish Critique of the Philosophy\nof Martin Buber</em>, New York: Yeshiva University.", "Bloch, J., 1977, <em>Die Aporie des Du</em>, Heidelberg: Lambert\nSchneider.", "Brody, Samuel H., 2018, <em>Martin Buber’s Theopolitics</em>, Bloomington: Indiana University Press.", "Blumenfeld, Walter, 1951, <em>La antropologia filosofica de Martin\nBuber y la filosofia antropologica; un essayo</em>, Lima: Tipografia\nSanta Rosa.", "Braiterman, Zachary, 2007, <em>The Shape of Revelation: Aesthetics\nand Modern Jewish Thought</em>, Stanford: Stanford University\nPress.", "Casper, Bernhard, 1967, <em>Das dialogische Denken: Franz\nRosenzweig, Ferdinand Ebner, Martin Buber</em>, Freiburg i. B., Basel,\nWien: Herder.", "Dujovne, L., 1966, <em>Martin Buber; sus ideas religiosas,\nfilosoficas y sociales</em>, Buenos Aires: Bibliografica Omeba.", "Friedman, Maurice, 1955, <em>Martin Buber. The Life of\nDialogue</em>, Chicago: University of Chicago.", "Friedman, Maurice, 1981, <em>Martin Buber’s Life and Work. The\nearly years. 1878–1923.</em>, New York: Dutton.", "Horwitz, Rivka, 1978, <em>Buber’s Way to I and Thou. An Historical\nAnalysis</em>, Heidelberg: Lambert Schneider.", "Kavka, Martin, 2012, “Verification (Bewahrung) in\nMartin <em>Buber” Journal of Jewish Thought</em> and\nPhilosophy 20 (1):71–98.", "Katz, Steven, 1985, <em>Post-Holocaust Dialogues</em>, New York:\nNew York University Press.", "Kohn, Hans, 1930, <em>Martin Buber</em>, Hellerau: J. Hegner. Second edition:\nCologne: Melzer, 1961. First biography of Buber, published on the occasion of\nhis fiftieth birthday.", "Koren, Israel, 2002, “Between Buber’s <em>Daniel</em> and His\n<em>I and Thou</em>: A New Examination” in <em>Modern\nJudaism</em> 22 (2002): 169–198.", "Lang, Bernhard, 1964, <em>Martin Buber und das dialogische Leben</em>,\nBern: H. Lang.", "Mendes-Flohr, Paul, 1989, <em>From Mysticism to Dialogue. Martin\nBuber’s Transformation of German Social Thought</em>, Detroit: Wayne\nState University Press.", "Mendes-Flohr, Paul, 2019, <em>Martin Buber: A Life of Faith and Dissent</em>, New Haven/Ct and London: Yale University Press.", "Poma, Andrea, 1974, <em>La filosofia dialogica di Martin\nBuber</em>, Torino: Rosenberg and Sellier.", "Schaeder, Grete, 1966, <em>Martin Buber, Hebräischer\nHumanismus</em>, Göttingen: Vandenhoek and Ruprecht. English:\n1973, <em>The Hebrew Humanism of Martin Buber</em>, transl. by Noah\nJ. Jacobs, Detroit: Wayne State University.", "Simon, Ernst, 1959, <em>Aufbau im Untergang</em>, Tübingen:\nMohr. English: 1956, “Jewish adult education in Nazi Germany as\nspiritual resistence” in <em>Yearbook of the Leo Baeck\nInstitute</em>, London: Secker &amp; Warburg, Nr. 1,\npp. 68–105. On the Mittelstelle für jüdische\nErwachsenenbildung, a centralized institution, run by Buber from\n1933–38, in charge of reeducating Jewish teachers who had been\nforced out of the general school system under the Nazis.", "Smith, M. K., 2000 [2009], “Martin Buber on education,”\nin <em>The Encyclopaedia of Informal Education</em>, \n [<a href=\"http://infed.org/mobi/martin-buber-on-education/\" target=\"other\">available online</a>, \n retrieved: Dec 3, 2014].", "Theunissen, Michael, 1964, “Bubers negative Ontologie des\nZwischen” in <em>Philosophisches Jarhbuch</em>, Freiburg and\nMunich: Alber, pp. 319–330.", "Theunissen, Michael, 1965, <em>Der Andere. Studien zur\nSozialontologie der Gegenwart</em>, Berlin: De Gruyter. English: 1984,\n<em>The Other: Studies in the Social ontology of Husserl, Heidegger,\nSartre, and Buber</em>, transl. by Christopher Macann, Cambridge: The\nMIT Press, 1984.", "Wood, R., 1969, <em>Martin Buber’s Ontology; An Analysis of\n“I and Thou”</em>, Evanston, Illinois: Northwestern\nUniversity Press.", "Urban, Martina, 2008, <em>Aesthetics of Renewal: Martin Buber’s\nEarly Representation of Hasidism as Kulturkritik</em>, Chicago:\nUniversity of Chicago Press.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"WorCit\">Works Cited</a></h3>\n<ul class=\"hanging\">\n<li>Braiterman, Zachary, 2007, <em>The Shape of Revelation: Aesthetics\nand Modern Jewish Thought</em>, Stanford: Stanford University\nPress.</li>\n<li>Brody, Samuel H., 2018, <em>Martin Buber’s Theopolitics</em>, Bloomington: Indiana University Press.</li>\n<li>Friedman, Maurice, 1981, <em>Martin Buber’s Life and Work: The\nEarly Years, 1878–1923</em>, New York: Dutton.</li>\n<li>Bloch, Jochanan/Gordon, Hayyim (ed.), 1983, <em>Martin Buber.\nBilanz seines Denkens</em>, Freiburg i. B.</li>\n<li>Kaufmann, Walter, 1983, “Bubers Fehlschläge und sein\nTriumph” in Bloch [1983], pp. 22ff.</li>\n<li>Wurm, Carsten, 1994, <em>150 Jahre Rütten &amp; Loening\n… Mehr als eine Verlagsgeschichte</em>, Berlin:\nRütten &amp; Loening.</li>\n<li>Zank, Michael, 2006, “Buber and\n<em>Religionswissenschaft</em>: The Case of His Studies on Biblical\nFaith” in <em>New Perspectives on Martin Buber</em>,\nTübingen: Mohr Siebeck, pp. 61–82.</li>\n</ul>\n<h3><a id=\"Bibs\">Bibliographies</a></h3>\n<ul class=\"hanging\">\n<li>Catanne, Moshe, 1961, <em>A Bibliography of Martin Buber’s Works\n(1895–1957)</em>, Jerusalem: Bialik Institute.</li>\n<li>Cohn, Margot, 1980, <em>Martin Buber. A Bibliography of His\nWritings, 1897–1978.</em> Compiled by Margot Cohn and Raphael Buber.\nJerusalem: Magnes Press. This is the most authoritative bibliography\ncompiled by Buber’s long-time secretary and his son.</li>\n<li>Friedman, Maurice, 1963, “Bibliographie” in Paul\nArthur Schilpp and Maurice Friedman (ed.), <em>Martin Buber</em>,\nStuttgart: Kohlhammer1.</li>\n<li>Kohn, Hans, 1930, <em>Martin Buber</em>, Hellerau: J. Hegner. This biography\nincludes a bibliography of Buber’s writings from 1897 to 1928. The\nsecond edition (1961) contains bibliographic updates by Robert\nWeltsch.</li>\n<li>Moonan, Willard, 1981, <em>Martin Buber and His Critics. An\nAnnotated Bibliography of Writings in English Through 1978</em>, New\nYork &amp; London: Garland. With a list of the abstracts, indices,\nand bibliographies consulted by the author, indices of translators and\nauthors writing on Buber, and subject indices of writings by and about\nBuber.</li>\n</ul>\n<h3><a id=\"SelEarWorMarBub\">Selected Early Works By Martin Buber</a></h3>\n<ul class=\"hanging\">\n<li>1906–1912, <em>Die Gesellschaft. Sammlung sozial-psychologischer\nMonographien</em> [Society. A Collection of Social-Psychological\nMonographs], Frankfurt am Main: Rütten &amp; Loening. 40 volumes.\nThe first volume (Werner Sombart, <em>Das Proletariat</em>) includes\nBuber’s introduction to the series.</li>\n<li>1906b, <em>Die Geschichten des Rabbi Nachman</em> [The Tales of\nRabbi Nachman], Frankfurt am Main: Rütten &amp; Loening. Dedicated\nto “the memory of my grandfather, Salomon Buber, the last master\nof the old haskalah.” (“<em>Meinem Großvater Salomon \nBuber dem letzten Meister der alten Haskala bringe ich dies Werk der \nChassidut dar in Ehrfurcht und Liebe.</em>”)</li>\n<li>1908, <em>Die Legende des Baal Schem</em> [The Legend of the Baal\nShem], Frankfurt: Rütten &amp; Loening (second edition: 1916). On\nthe founder of the Hasidic movement in early eighteenth-century\nPodolia/Volynia,</li>\n<li>1911a, <em>Chinesische Geister- und Liebesgeschichten</em> [Chinese\nGhost and Love Stories], Frankfurt: Rütten &amp; Loening.</li>\n<li>1911b, <em>Drei Reden über das Judentum</em> [Three Speeches\non Judaism], Frankfurt: Rütten &amp; Loening, 1911 (second,\n“complete” edition, 1923). Dedicated to “my\nwife.”</li>\n<li>1913, <em>Daniel: Gespräche von der Verwirklichung</em>\n[Daniel, Dialogues on Realization], Leipzig: Insel-Verlag.</li>\n<li>1916–24, <em>Der Jude. Eine Monatsschrift</em> [The Jew. A\nMonthly], Wien/Berlin: R. Löwith and Berlin: Jüdischer\nVerlag. Founded by Buber, who edited it during these years and wrote\nmany contributions.</li>\n<li>1918, <em>Mein Weg zum Chassidismus. Erinnerungen</em> [My Path to\nHasidism. Recollections], Frankfurt: Rütten &amp; Loening.\nDedicated to “my beloved father.”</li>\n<li>1919, <em>Der heilige Weg. Ein Wort an die Juden und an die\nVölker</em> [The Holy Path. A Word to the Jews and to the\nGentiles], Frankfurt: Rütten &amp; Loening. Dedicated to\n“my friend Gustav Landauer at his grave.”</li>\n<li>1922, <em>Der grosse Maggid und seine Nachfolge</em> [The Great\nMaggid and his Succession], Frankfurt: Rütten &amp; Loening.</li>\n<li>1923, <em>Ich und Du</em> [I and Thou], Leipzig: Insel Verlag.</li>\n<li>1924, <em>Das verborgene Licht</em> [The Hidden Light], Frankfurt:\nRütten &amp; Loening.</li>\n<li>1925ff, <em>Die Schrift. Zu verdeutschen unternommen von Martin\nBuber</em> <em>gemeinsam mit Franz Rosenzweig</em>. Buber and\nRosenzweig’s translation of the Hebrew Scriptures was published by\nLambert Schneider first in his own publishing house in Berlin, between\n1933 and 1939 under the heading of Schocken Verlag, Berlin, and again,\nafter 1945, through the newly founded Lambert Schneider Verlag,\nHeidelberg.</li>\n<li>1926–29, <em>Die Kreatur</em> [Creation], Berlin: Lambert\nSchneider. A quarterly edited by Buber with the Protestant\npsychologist Victor von Weizsäcker and the dissident Catholic\ntheologian Joseph Wittig.</li>\n</ul>\n<h3><a id=\"ColEdiWriLet\">Collections and Editions of Writings and Letters</a></h3>\n<ul class=\"hanging\">\n<li>1953–62, <em>Die Schrift. Verdeutscht von Martin Buber gemeinsam\nmit Franz Rosenzweig</em>, improved and complete edition in four\nvolumes, Cologne: J. Hegner.</li>\n<li>1953a, <em>Hinweise. Gesammelte Essays</em>, Zurich: Manesse.</li>\n<li>1962, <em>Werke.</em> Erster Band: <em>Schriften zur\nPhilosophie</em> [<em>Works</em>, Volume One: <em>Philosophical\nWritings</em>], Munich and Heidelberg: Lambert Schneider.</li>\n<li>1963a, <em>Werke.</em> Dritter Band: <em>Schriften zum\nChassidismus</em> [<em>Works</em>, Volume Three: <em>Writings on\nHasidism</em>], Munich and Heidelberg: Lambert Schneider.</li>\n<li>1963b, <em>Der Jude und sein Judentum. Gesammelte Aufsätze und\nReden</em>, Cologne: J. Hegner.</li>\n<li>1964, <em>Werke.</em> Zweiter Band: <em>Schriften zur Bibel</em>\n[<em>Works</em>, Volume Two: <em>Writings on the Bible</em>], Munich\nand Heidelberg: Lambert Schneider.</li>\n<li>1965, <em>Nachlese.</em> Heidelberg: Lambert Schneider. English\ntranslation: 1967a.</li>\n<li>1972–75, <em>Briefwechsel aus sieben Jahrzehnten</em>, edited by\nGrete Schaeder, Volume I: 1897–1918 (1972), Volume II: 1918–1938\n(1973), Volume III: 1938–1965 (1975), Heidelberg: Lambert\nSchneider.</li>\n<li>1996, <em>The Letters of Martin Buber: A Life of Dialogue</em>,\nedited by Nahum Glatzer and Paul Mendes-Flohr, Syracuse: Syracuse\nUniversity Press.</li>\n<li>2001ff, <em>Werkausgabe</em>, edited by Paul Mendes-Flohr, Peter\nSchafer, Martina Urban, Bernd Witte and others. Gutersloh: Gutersloher\nVerlagshaus.</li>\n</ul>\n<h3><a id=\"BubEng\">Buber in English</a></h3>\n<ul class=\"hanging\">\n<li>1937, <em>I and Thou</em>, transl. by Ronald Gregor Smith,\nEdinburgh: T. and T. Clark. 2<sup>nd</sup> Edition New York: Scribners,\n1958. 1<sup>st</sup> Scribner Classics ed. New York, NY: Scribner, 2000,\nc1986</li>\n<li>1952, <em>Eclipse of God</em>, New York: Harper and Bros.\n2<sup>nd</sup> Edition Westport, Conn.: Greenwood Press, 1977.</li>\n<li>1957, <em>Pointing the Way</em>, transl. Maurice Friedman, New\nYork: Harper, 1957, 2<sup>nd</sup> Edition New York: Schocken,\n1974.</li>\n<li>1960, <em>The Origin and Meaning of Hasidism</em>, transl. M.\nFriedman, New York: Horizon Press.</li>\n<li>1964, <em>Daniel: Dialogues</em> <em>on Realization</em>, New York,\nHolt, Rinehart and Winston.</li>\n<li>1965, <em>The Knowledge of Man</em>, transl. Ronald Gregor Smith\nand Maurice Friedman, New York: Harper &amp; Row. 2<sup>nd</sup>\nEdition New York, 1966.</li>\n<li>1966, <em>The Way of Response: Martin Buber; Selections\nfrom his Writings</em>, edited by N. N. Glatzer. New York: Schocken\nBooks.</li>\n<li>1967a, <em>A Believing Humanism: My Testament</em>, translation of\n<em>Nachlese</em> (Heidelberg 1965) by M. Friedman, New York:\nSimon and Schuster.</li>\n<li>1967b, <em>On Judaism</em>, edited by Nahum Glatzer and transl. by\nEva Jospe and others, New York: Schocken Books.</li>\n<li>1968, <em>On the Bible: Eighteen Studies</em>, edited by Nahum\nGlatzer, New York: Schocken Books.</li>\n<li>1970a, <em>I and Thou</em>, a new translation with a prologue\n“I and you” and notes by Walter Kaufmann, New York:\nScribner’s Sons.</li>\n<li>1970b, <em>Mamre: Essays in Religion</em>, translated by Greta\nHort, Westport, Conn.: Greenwood Press.</li>\n<li>1970c, <em>Martin Buber and the Theater, Including Martin Buber’s\n“Mystery Play” Elijah</em>, edited and translated with\nthree introductory essays by Maurice Friedman, New York, Funk\n&amp;Wagnalls.</li>\n<li>1972, <em>Encounter: Autobiographical Fragments</em>. La Salle,\nIll.: Open Court.</li>\n<li>1973a, <em>On Zion: the History of an Idea,</em> with a new\nforeword by Nahum N. Glatzer, Translated from the German by Stanley\nGodman, New York: Schocken Books.</li>\n<li>1973b, <em>Meetings</em>, edited with an introduction and bibliography\nby Maurice Friedman, La Salle, Ill.: Open Court Pub. Co. 3rd ed.\nLondon, New York: Routledge, 2002.</li>\n<li>1983, <em>A Land of Two Peoples: Martin Buber on Jews and\nArabs</em>, edited with commentary by Paul R. Mendes-Flohr, New York:\nOxford University Press. 2<sup>nd</sup> Edition Gloucester, Mass.:\nPeter Smith, 1994</li>\n<li>1985, <em>Ecstatic Confessions</em>, edited by Paul\nMendes-Flohr, translated by Esther Cameron, San Francisco: Harper &amp;\nRow.</li>\n<li>1991a, <em>Chinese Tales: Zhuangzi, Sayings and Parables and\nChinese Ghost and Love stories</em>, translated by Alex Page, with an\nintroduction by Irene Eber, Atlantic Highlands, N.J.: Humanities Press\nInternational.</li>\n<li>1991b, <em>Tales of the Hasidim</em>, foreword by Chaim Potok, New\nYork: Schocken Books, distributed by Pantheon.</li>\n<li>1992, <em>On Intersubjectivity and Cultural\nCreativity</em>, edited and with an introduction by S.N. Eisenstadt,\nChicago: University of Chicago Press.</li>\n<li>1994, <em>Scripture and Translation</em>, Martin Buber and Franz\nRosenzweig, translated by Lawrence Rosenwald with Everett Fox.\nBloomington: Indiana University Press.</li>\n<li>1996, <em>Paths in Utopia</em>, translated by R.F. Hull. Syracuse:\nSyracuse University Press.</li>\n<li>1999a, <em>The First Buber: Youthful Zionist Writings of\nMartin Buber</em>, edited and translated from the German by Gilya G.\nSchmidt, Syracuse, N.Y.: Syracuse University Press.</li>\n<li>1999b, <em>Martin Buber on Psychology and Psychotherapy: Essays,\nLetters, and Dialogue</em>, edited by Judith Buber Agassi, with a\nforeword by Paul Roazin, New York: Syracuse University Press.</li>\n<li>1999c, <em>Gog and Magog: A Novel</em>, translated from the German\nby Ludwig Lewisohn, Syracuse, NY: Syracuse University Press.</li>\n<li>2002a, <em>The Legend of the Baal-Shem</em>, translated by\nMaurice Friedman, London: Routledge.</li>\n<li>2002b, <em>Between Man and Man</em>, translated by Ronald\nGregor-Smith, with an introduction by Maurice Friedman, London, New\nYork: Routledge.</li>\n<li>2002c, <em>The Way of Man: According to the Teaching of\nHasidim</em>, London: Routledge.</li>\n<li>2002d, <em>The Martin Buber Reader: Essential Writings</em>, edited\nby Asher D. Biemann, New York: Palgrave Macmillan.</li>\n<li>2002e, <em>Ten Rungs: Collected Hasidic Sayings</em>,\ntranslated by Olga Marx, London: Routledge.</li>\n<li>2003, <em>Two Types of Faith</em>, translated by Norman P.\nGoldhawk with an afterword by David Flusser, Syracuse, N.Y.: Syracuse\nUniversity Press.</li>\n</ul>\n<h3><a id=\"SelEdiVolMarBub\">Selected Edited Volumes on Martin Buber</a></h3>\n<ul class=\"hanging\">\n<li>Bloch, Jochanan/Gordon, Hayyim (ed.), 1983, <em>Martin Buber.\nBilanz seines Denkens</em>, Freiburg i. B.: Herder.</li>\n<li>Licharz, Werner/Schmidt, Heinz (ed.), 1989, <em>Martin Buber\n(1878–1965). Internationales Symposium zum 20. Todestag</em>. Two\nvolumes (Series: Arnoldshainer Texte), Arnoldshain: Haag and Herchen.</li>\n<li>Schilpp, Paul Arthur/Friedman, Maurice (ed.), 1963, <em>Martin\nBuber</em>, (Series: Philosophen des 20. Jahrhunderts), Stuttgart, Kohlhammer.\nEnglish edition: 1967, <em>The Philosophy of Martin Buber.</em>\n(Series: Library of Living Philosophers, vol. XII). Lasalle/Ill.: Open\nCourt. Among the contributors to this volume are, aside from Buber\nhimself, Max Brod, Emmanuel Lévinas, Emil Brunner, Emil\nFackenheim, Marvin Fox, Nahum Glatzer, Mordecai Kaplan, Walter\nKaufmann, Gabriel Marcel, Nathan Rotenstreich, Rivka\nSchatz-Uffenheimer, Ernst Simon, Jacob Taubes, C.F. von\nWeizsäcker, and Robert Weltsch.</li>\n<li>Zank, Michael (ed.), 2006, <em>New Perspectives on Martin\nBuber</em>, Tübingen: Mohr Siebeck. With essays by Joseph Agassi,\nLeora Batnitzky, Ilaria Bertone, Asher Biemann, Zachary Braiterman,\nMicha Brumlik, Judith Buber Agassi, Steven T. Katz, Paul Mendes-Flohr,\nGesine Palmer, Andrea Poma, Yossef Schwartz, Jules Simon, Martina\nUrban, and Michael Zank</li>\n</ul>\n<h3><a id=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Avnon, Dan, 1998, <em>Martin Buber. The Hidden Dialogue</em>,\nLanham, Boulder, New York, Oxford: Rowman &amp; Littlefield.</li>\n<li>Babolin, A., 1965, <em>Essere e Alteritá in Martin\nBuber</em>, Padova: Gregoriana.</li>\n<li>Balthasar, Hans Urs von, 1958, <em>Einsame Zwiesprache. Martin\nBuber und das Christentum</em>, Cologne: J. Hegner.</li>\n<li>Berkovits, Eliezer, 1962, <em>A Jewish Critique of the Philosophy\nof Martin Buber</em>, New York: Yeshiva University.</li>\n<li>Bloch, J., 1977, <em>Die Aporie des Du</em>, Heidelberg: Lambert\nSchneider.</li>\n<li>Brody, Samuel H., 2018, <em>Martin Buber’s Theopolitics</em>, Bloomington: Indiana University Press.</li>\n<li>Blumenfeld, Walter, 1951, <em>La antropologia filosofica de Martin\nBuber y la filosofia antropologica; un essayo</em>, Lima: Tipografia\nSanta Rosa.</li>\n<li>Braiterman, Zachary, 2007, <em>The Shape of Revelation: Aesthetics\nand Modern Jewish Thought</em>, Stanford: Stanford University\nPress.</li>\n<li>Casper, Bernhard, 1967, <em>Das dialogische Denken: Franz\nRosenzweig, Ferdinand Ebner, Martin Buber</em>, Freiburg i. B., Basel,\nWien: Herder.</li>\n<li>Dujovne, L., 1966, <em>Martin Buber; sus ideas religiosas,\nfilosoficas y sociales</em>, Buenos Aires: Bibliografica Omeba.</li>\n<li>Friedman, Maurice, 1955, <em>Martin Buber. The Life of\nDialogue</em>, Chicago: University of Chicago.</li>\n<li>Friedman, Maurice, 1981, <em>Martin Buber’s Life and Work. The\nearly years. 1878–1923.</em>, New York: Dutton.</li>\n<li>Horwitz, Rivka, 1978, <em>Buber’s Way to I and Thou. An Historical\nAnalysis</em>, Heidelberg: Lambert Schneider.</li>\n<li>Kavka, Martin, 2012, “Verification (Bewahrung) in\nMartin <em>Buber” Journal of Jewish Thought</em> and\nPhilosophy 20 (1):71–98. </li>\n<li>Katz, Steven, 1985, <em>Post-Holocaust Dialogues</em>, New York:\nNew York University Press.</li>\n<li>Kohn, Hans, 1930, <em>Martin Buber</em>, Hellerau: J. Hegner. Second edition:\nCologne: Melzer, 1961. First biography of Buber, published on the occasion of\nhis fiftieth birthday.</li>\n<li>Koren, Israel, 2002, “Between Buber’s <em>Daniel</em> and His\n<em>I and Thou</em>: A New Examination” in <em>Modern\nJudaism</em> 22 (2002): 169–198.</li>\n<li>Lang, Bernhard, 1964, <em>Martin Buber und das dialogische Leben</em>,\nBern: H. Lang.</li>\n<li>Mendes-Flohr, Paul, 1989, <em>From Mysticism to Dialogue. Martin\nBuber’s Transformation of German Social Thought</em>, Detroit: Wayne\nState University Press.</li>\n<li>Mendes-Flohr, Paul, 2019, <em>Martin Buber: A Life of Faith and Dissent</em>, New Haven/Ct and London: Yale University Press.</li>\n<li>Poma, Andrea, 1974, <em>La filosofia dialogica di Martin\nBuber</em>, Torino: Rosenberg and Sellier.</li>\n<li>Schaeder, Grete, 1966, <em>Martin Buber, Hebräischer\nHumanismus</em>, Göttingen: Vandenhoek and Ruprecht. English:\n1973, <em>The Hebrew Humanism of Martin Buber</em>, transl. by Noah\nJ. Jacobs, Detroit: Wayne State University.</li>\n<li>Simon, Ernst, 1959, <em>Aufbau im Untergang</em>, Tübingen:\nMohr. English: 1956, “Jewish adult education in Nazi Germany as\nspiritual resistence” in <em>Yearbook of the Leo Baeck\nInstitute</em>, London: Secker &amp; Warburg, Nr. 1,\npp. 68–105. On the Mittelstelle für jüdische\nErwachsenenbildung, a centralized institution, run by Buber from\n1933–38, in charge of reeducating Jewish teachers who had been\nforced out of the general school system under the Nazis.</li>\n<li>Smith, M. K., 2000 [2009], “Martin Buber on education,”\nin <em>The Encyclopaedia of Informal Education</em>, \n [<a href=\"http://infed.org/mobi/martin-buber-on-education/\" target=\"other\">available online</a>, \n retrieved: Dec 3, 2014].</li>\n<li>Theunissen, Michael, 1964, “Bubers negative Ontologie des\nZwischen” in <em>Philosophisches Jarhbuch</em>, Freiburg and\nMunich: Alber, pp. 319–330.</li>\n<li>Theunissen, Michael, 1965, <em>Der Andere. Studien zur\nSozialontologie der Gegenwart</em>, Berlin: De Gruyter. English: 1984,\n<em>The Other: Studies in the Social ontology of Husserl, Heidegger,\nSartre, and Buber</em>, transl. by Christopher Macann, Cambridge: The\nMIT Press, 1984.</li>\n<li>Wood, R., 1969, <em>Martin Buber’s Ontology; An Analysis of\n“I and Thou”</em>, Evanston, Illinois: Northwestern\nUniversity Press.</li>\n<li>Urban, Martina, 2008, <em>Aesthetics of Renewal: Martin Buber’s\nEarly Representation of Hasidism as Kulturkritik</em>, Chicago:\nUniversity of Chicago Press.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Dilthey, Wilhelm", "education, philosophy of", "Nietzsche, Friedrich", "Rosenzweig, Franz", "Wundt, Wilhelm Maximilian"], "entry_link": [{"../dilthey/": "Dilthey, Wilhelm"}, {"../education-philosophy/": "education, philosophy of"}, {"../nietzsche/": "Nietzsche, Friedrich"}, {"../rosenzweig/": "Rosenzweig, Franz"}, {"../wilhelm-wundt/": "Wundt, Wilhelm Maximilian"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=buber\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/buber/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=buber&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/buber/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=buber": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/buber/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=buber&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/buber/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"https://www.martin-buber.com/kategorie/werkausgabe/\">Information on the Martin Buber Werkausgabe</a>\n Published on behalf of Philosophische Fakultät der Heinrich\nHeine Universität Düsseldorf and Israel Academy of Sciences and\nHumanities, edited by Paul Mendes-Flohr and Bernd Witte.", "<a href=\"http://www.dhm.de/lemo/html/biografien/BuberMartin/\" target=\"other\">Buber Timeline</a>,\n A brief biographic sketch maintained by the online project of the Museum for German History in Berlin."], "listed_links": [{"https://www.martin-buber.com/kategorie/werkausgabe/": "Information on the Martin Buber Werkausgabe"}, {"http://www.dhm.de/lemo/html/biografien/BuberMartin/": "Buber Timeline"}]}, "tokenized_text": ["1", "biographical", "background", "setting", "buber", "early", "childhood", "latenineteenthcentury", "vienna", "still", "cosmopolitan", "capital", "austrohungarian", "empire", "multiethnic", "conglomerate", "whose", "eventual", "demise", "first", "world", "war", "effectively", "ended", "millennial", "rule", "catholic", "prince", "europe", "findesiècle", "vienna", "home", "light", "opera", "heavy", "neoromantic", "music", "frenchstyle", "boulevard", "comedy", "social", "realism", "sexual", "repression", "deviance", "political", "intrigue", "vibrant", "journalism", "cultural", "cauldron", "aptly", "captured", "robert", "musil", "man", "without", "quality", "der", "mann", "ohne", "eigenschaften", "19301932", "buber", "parent", "carl", "buber", "elise", "née", "wurgast", "separated", "martin", "four", "year", "old", "next", "ten", "year", "lived", "paternal", "grandparent", "solomon", "adele", "buber", "lemberg", "lvivukraine", "part", "one", "might", "call", "landed", "jewish", "aristocracy", "solomon", "master", "old", "haskala", "ein", "meister", "der", "alten", "haskala", "buber", "1906b", "dedication", "called", "pole", "mosaic", "persuasion", "friedman", "1981", "p", "11", "produced", "first", "modern", "edition", "rabbinic", "midrash", "literature", "yet", "also", "greatly", "respected", "traditional", "jewish", "community", "reputation", "opened", "door", "martin", "began", "show", "interest", "zionism", "hasidic", "literature", "wealth", "grandparent", "built", "galician", "estate", "managed", "adele", "enhanced", "solomon", "mining", "banking", "commerce", "provided", "martin", "financial", "security", "german", "occupation", "poland", "1939", "estate", "expropriated", "homeschooled", "pampered", "grandmother", "buber", "bookish", "aesthete", "friend", "age", "whose", "major", "diversion", "play", "imagination", "easily", "absorbed", "local", "language", "hebrew", "yiddish", "polish", "german", "acquired", "others", "greek", "latin", "french", "italian", "english", "german", "dominant", "language", "home", "language", "instruction", "franz", "joseph", "gymnasium", "polish", "multilingualism", "nourished", "buber", "lifelong", "interest", "language", "among", "young", "buber", "first", "publication", "essay", "translation", "polish", "poetry", "arthur", "schnitzler", "hugo", "von", "hofmannsthal", "buber", "literary", "voice", "may", "best", "understood", "probingly", "personal", "seeking", "communication", "others", "forging", "path", "east", "west", "judaism", "humanism", "national", "particularity", "universal", "spirit", "deliberate", "perhaps", "somewhat", "precious", "diction", "nourished", "contrast", "german", "classic", "read", "home", "fervently", "religious", "mildly", "secular", "galician", "jewish", "jargon", "encountered", "outside", "reentering", "urban", "society", "vienna", "buber", "encountered", "world", "brimming", "austrian", "imperial", "tradition", "well", "germanic", "pragmatism", "radical", "new", "approach", "psychology", "philosophy", "developed", "place", "solution", "burning", "social", "political", "issue", "city", "nation", "empire", "often", "expressed", "grandly", "theatrical", "oratory", "karl", "lueger", "aestheticizing", "rhetoric", "selfinscenation", "theodor", "herzl", "student", "art", "history", "german", "literature", "psychology", "vienna", "leipzig", "zürich", "berlin", "buber", "made", "home", "bohemian", "world", "letter", "1900", "1916", "buber", "lifepartner", "author", "paula", "winkler", "18771958", "penname", "georg", "munk", "moved", "berlin", "befriended", "anarchist", "gustav", "landauer", "18701919", "attended", "salon", "hart", "brother", "epicenter", "jugendstil", "aesthetic", "early", "period", "buber", "active", "zionist", "movement", "theodor", "herzl", "recruited", "editor", "journal", "die", "welt", "1904", "year", "herzl", "died", "buber", "finished", "dissertation", "problem", "individuation", "nicholas", "cusa", "jakob", "boehme", "took", "position", "literary", "editor", "ruetten", "loening", "publishing", "house", "whose", "midnineteenth", "century", "jewish", "founder", "rindskopf", "löwental", "made", "fortune", "perennially", "bestselling", "struwwelpeter", "politically", "incorrect", "book", "drawing", "illbehaved", "child", "wurm", "1994", "beginning", "century", "publisher", "looking", "move", "beyond", "gilded", "edition", "goethe", "schiller", "publishing", "time", "buber", "became", "agent", "modernization", "one", "first", "book", "buber", "placed", "retelling", "story", "rabbi", "nachman", "one", "great", "figure", "eastern", "european", "hasidism", "flagship", "publication", "edited", "buber", "ambitious", "fortyvolume", "series", "social", "study", "titled", "die", "gesellschaft", "appeared", "1906", "1912", "editor", "buber", "recruited", "corresponded", "many", "leading", "mind", "time", "1916", "martin", "paula", "moved", "heppenheimbergstrasse", "halfway", "frankfurtmain", "heidelberg", "time", "friend", "gustav", "landauer", "severely", "criticized", "buber", "enthusiasm", "salutary", "effect", "buber", "saw", "war", "hitherto", "fragmented", "society", "gesellschaft", "transforming", "national", "community", "gemeinschaft", "buber", "later", "claimed", "time", "began", "draft", "book", "become", "thou", "frankfurt", "buber", "met", "franz", "rosenzweig", "18861929", "develop", "close", "intellectual", "companionship", "early", "nineteen", "twenty", "rosenzweig", "recruited", "buber", "lecturer", "unaffiliated", "free", "jewish", "adult", "education", "center", "frey", "jüdisches", "lehrhaus", "managed", "buber", "appointment", "university", "lecturer", "jewish", "religious", "study", "ethic", "position", "endowed", "jewish", "community", "initially", "opposed", "buber", "radical", "rosenzweig", "also", "became", "buber", "chief", "collaborator", "project", "initiated", "young", "christian", "publisher", "lambert", "schneider", "produce", "new", "translation", "bible", "german", "project", "continued", "rosenzweig", "death", "dismissed", "nazi", "university", "1933", "buber", "served", "architect", "german", "jewish", "teacher", "reeducation", "socalled", "mittelstelle", "für", "jüdische", "erwachsenenbildung", "simon", "1959", "1937", "buber", "received", "longcoveted", "call", "teach", "hebrew", "university", "jerusalem", "officially", "founded", "1925", "institution", "whose", "creation", "promoted", "since", "1902", "represented", "member", "board", "overseer", "jerusalem", "buber", "returned", "field", "social", "philosophy", "academic", "appointment", "university", "administration", "wrested", "faculty", "deemed", "schriftsteller", "dr", "martin", "buber", "neither", "genuine", "scholar", "religion", "sufficiently", "educated", "specialist", "jewish", "study", "worldfamous", "later", "year", "buber", "traveled", "lectured", "extensively", "europe", "united", "state", "buber", "wide", "range", "interest", "literary", "ability", "general", "appeal", "philosophical", "orientation", "reflected", "farflung", "correspondence", "conducted", "course", "long", "life", "editor", "die", "gesellschaft", "buber", "corresponded", "georg", "simmel", "franz", "oppenheimer", "ellen", "key", "lou", "andreassalomé", "werner", "sombart", "many", "academic", "intellectual", "among", "poet", "time", "exchanged", "letter", "hugo", "von", "hofmannsthal", "hermann", "hesse", "stefan", "zweig", "particularly", "close", "socialist", "zionist", "novelist", "arnold", "zweig", "poet", "chaim", "nachman", "bialik", "later", "nobel", "laureate", "sh", "y", "agnon", "buber", "shared", "deep", "interest", "revival", "hebrew", "literature", "published", "work", "jewish", "nietzschean", "storyteller", "micha", "josef", "berdiczewsky", "major", "inspiration", "young", "zionist", "cadre", "prague", "jew", "hugo", "bergmann", "max", "brod", "robert", "weltsch", "jewish", "adult", "education", "system", "organized", "nazi", "inadvertently", "provided", "last", "bastion", "free", "exchange", "idea", "nonjew", "well", "buber", "name", "intimately", "linked", "franz", "rosenzweig", "circle", "eugen", "rosenstockhuessy", "han", "ehrenberg", "rudolf", "ehrenberg", "viktor", "von", "weizsäcker", "ernst", "michel", "etc", "association", "manifested", "among", "others", "journal", "die", "kreatur", "192629", "journal", "der", "jude", "founded", "edited", "buber", "1916", "1924", "several", "edition", "speech", "judaism", "made", "buber", "central", "figure", "jewish", "cultural", "renaissance", "early", "twentieth", "century", "buber", "work", "awakened", "many", "young", "intellectual", "highly", "assimilated", "family", "ernst", "simon", "possibility", "embracing", "judaism", "living", "faith", "others", "among", "franz", "rosenzweig", "gershom", "scholem", "leo", "strauss", "developed", "scholarly", "philosophical", "agenda", "critical", "appreciation", "buber", "without", "giving", "seduction", "buberism", "buber", "counted", "among", "friend", "admirer", "christian", "theologian", "karl", "heim", "friedrich", "gogarten", "albert", "schweitzer", "leonard", "ragaz", "philosophy", "dialogue", "entered", "discourse", "psychoanalysis", "work", "han", "trüb", "today", "among", "popular", "approach", "educational", "theory", "germanlanguage", "study", "pedagogy", "2", "philosophical", "influence", "among", "buber", "early", "philosophical", "influence", "kant", "prolegomenon", "read", "age", "fourteen", "nietzsche", "zarathustra", "haunted", "seeming", "infinity", "space", "time", "buber", "found", "solace", "kant", "understanding", "space", "time", "mere", "form", "perception", "structure", "manifold", "sensory", "impression", "time", "kant", "allows", "think", "transcending", "pure", "form", "human", "intellection", "buber", "mildly", "religious", "reading", "kant", "seems", "conventional", "autodidactic", "seems", "untrammeled", "debate", "various", "school", "neokantianism", "developed", "since", "1860", "came", "dominate", "much", "academic", "teaching", "philosophy", "across", "germany", "first", "world", "war", "nietzsche", "schopenhauer", "buber", "learned", "importance", "power", "project", "oneself", "heroically", "fluid", "malleable", "world", "according", "one", "measure", "standard", "though", "buber", "philosophy", "dialogue", "decisive", "step", "away", "nietzschean", "vitalism", "focus", "lived", "experience", "embodied", "human", "wholeness", "well", "prophetic", "tone", "aphoristic", "style", "buber", "honed", "early", "persisted", "subsequent", "writing", "1896", "1899", "studied", "history", "art", "german", "literature", "philosophy", "psychology", "vienna", "leipzig", "189798", "berlin", "189899", "zurich", "1899", "vienna", "absorbed", "oracular", "poetry", "stefan", "george", "influenced", "greatly", "although", "never", "became", "disciple", "george", "leipzig", "berlin", "developed", "interest", "ethnic", "psychology", "völkerpsychologie", "wilhelm", "wundt", "social", "philosophy", "georg", "simmel", "psychology", "carl", "stumpf", "lebensphilosophische", "approach", "humanity", "wilhelm", "dilthey", "leipzig", "attended", "meeting", "society", "ethical", "culture", "gesellschaft", "für", "ethische", "kultur", "dominated", "thought", "lasalle", "tönnies", "early", "reading", "philosophical", "literature", "buber", "retained", "basic", "conviction", "found", "later", "writing", "kant", "found", "two", "answer", "concern", "nature", "time", "time", "space", "pure", "form", "perception", "pertain", "thing", "appear", "u", "phenomenon", "thingsinthemselves", "noumenon", "experience", "others", "especially", "person", "object", "experience", "necessarily", "reduce", "scope", "phenomenal", "knowledge", "word", "buber", "later", "called", "iit", "relation", "yet", "kant", "also", "indicated", "way", "meaningfully", "speaking", "noumenal", "even", "though", "term", "theoretical", "reason", "practical", "reason", "expressed", "maxim", "action", "categorical", "imperative", "principle", "duty", "choose", "sake", "regardless", "outcome", "obliges", "u", "consider", "person", "end", "rather", "mean", "end", "suggests", "something", "like", "absolute", "obligation", "teleological", "aesthetic", "judgment", "developed", "kant", "third", "critique", "suggests", "possibility", "rational", "grounding", "representation", "taken", "together", "kant", "conception", "ethic", "aesthetic", "resonated", "buber", "notion", "phenomenon", "always", "gateway", "noumenon", "noumenal", "encountered", "way", "concrete", "phenomenon", "thus", "buber", "managed", "meld", "kantian", "metaphysical", "ethical", "conception", "immediate", "relation", "thing", "appear", "u", "represent", "buber", "succeeded", "translating", "theoretical", "dialectic", "immediacy", "distance", "phenomenal", "encounter", "reflexivity", "style", "cultivated", "writing", "also", "manner", "personal", "interaction", "buber", "sought", "describe", "live", "tension", "dionysian", "primacy", "life", "particularity", "immediacy", "individuality", "apollonian", "world", "form", "measure", "abstraction", "interdependent", "force", "constitutive", "human", "experience", "color", "interaction", "nature", "human", "being", "divine", "thou", "buber", "thus", "developed", "distinctive", "voice", "emerging", "chorus", "writer", "thinker", "artist", "time", "rallied", "widelyperceived", "alienation", "associated", "modern", "life", "3", "early", "buber", "gestalt", "mean", "realization", "buber", "early", "writing", "include", "anthology", "tale", "rabbi", "nachman", "1906", "legend", "baal", "shem", "tov", "1908", "mystical", "writing", "world", "religion", "ecstatic", "confession", "1909", "lecture", "judaism", "judaism", "1967b", "expressionist", "dialogue", "realization", "daniel", "1913", "essay", "art", "include", "reflection", "isenheim", "altarpiece", "dance", "nijinsky", "pointing", "way", "1957", "jewish", "art", "painter", "lesser", "ury", "first", "buber", "1999a", "common", "early", "production", "preoccupation", "shape", "gestalt", "movement", "color", "language", "gesture", "mean", "realized", "perfected", "particular", "human", "existence", "represents", "life", "beyond", "limit", "spatiotemporal", "duration", "imposed", "u", "manner", "cartesian", "grid", "german", "word", "form", "form", "gestalt", "translated", "shape", "identical", "although", "english", "easy", "confuse", "one", "buber", "us", "gestalt", "term", "central", "constitutive", "animating", "power", "contrasting", "platonic", "term", "form", "associate", "lack", "genuine", "vitality", "commenting", "upon", "work", "michelangelo", "buber", "speaks", "gestalt", "hidden", "raw", "material", "waiting", "emerge", "artist", "wrestle", "dead", "block", "artistic", "struggle", "instantiates", "represents", "fundamental", "opposition", "formative", "gestaltende", "shapeless", "gestaltlose", "principle", "tension", "buber", "lay", "source", "spiritual", "renewal", "raging", "within", "every", "human", "individual", "creative", "spiritual", "act", "subjugates", "unformed", "physical", "stuff", "1963b", "239", "free", "play", "gestalt", "quickens", "dead", "rigidity", "form", "wrestling", "form", "overcoming", "reanimation", "living", "energy", "buber", "early", "work", "rooted", "concern", "embodiment", "perception", "imagination", "whether", "writing", "hasidic", "master", "nijinsky", "religiosity", "judaism", "mysticism", "myth", "orient", "isenheim", "altar", "buber", "always", "returned", "fundamental", "dynamic", "everything", "start", "basic", "fact", "human", "existence", "body", "motion", "understood", "early", "buber", "following", "kantian", "intuition", "world", "one", "objective", "spatial", "order", "dissolved", "left", "right", "bear", "intrinsic", "meaning", "fundamentally", "orientation", "always", "related", "body", "however", "objective", "datum", "ethical", "life", "remains", "inextricably", "linked", "within", "world", "space", "human", "body", "physical", "sensation", "reach", "across", "divide", "toward", "unmitigated", "erlebnis", "unity", "important", "buber", "early", "conception", "self", "original", "one", "instead", "effect", "gestural", "act", "dance", "pointing", "way", "1957", "buber", "conceived", "political", "community", "type", "plastic", "shape", "object", "subject", "gestaltung", "hence", "realization", "enlivened", "kant", "distinction", "phenomenon", "noumenon", "literary", "imagination", "transformed", "valuetheoretical", "distinction", "gesellschaft", "society", "gemeinschaft", "community", "type", "social", "aggregation", "theorized", "ferdinand", "tönnies", "wellspring", "political", "speech", "writing", "first", "arena", "social", "psychological", "educational", "engagement", "zionist", "movement", "buber", "social", "philosophy", "stimulated", "decisively", "influenced", "close", "friend", "anarchist", "gustav", "landauer", "recruited", "write", "volume", "revolution", "series", "die", "gesellschaft", "pioneer", "social", "thought", "student", "georg", "simmel", "buber", "participated", "1909", "founding", "conference", "german", "sociological", "association", "buber", "socialpsychological", "approach", "study", "description", "social", "phenomenon", "interest", "constitutive", "correlation", "individual", "social", "experience", "remained", "important", "aspect", "philosophy", "dialogue", "came", "fore", "last", "academic", "position", "hebrew", "university", "jerusalem", "taught", "social", "philosophy", "prominent", "student", "amitai", "etzioni", "shmuel", "eisenstadt", "buber", "thought", "matured", "impact", "landauer", "harsh", "critique", "persuaded", "buber", "unduly", "romanticized", "war", "buber", "1916", "lead", "essay", "new", "journal", "der", "jude", "still", "praised", "war", "opportunity", "modern", "jew", "forge", "chaos", "rupture", "feeling", "community", "connection", "new", "unity", "unified", "gestalt", "one", "could", "restore", "jewish", "people", "condition", "wholeness", "buber", "friend", "landauer", "thought", "painfulvery", "repugnant", "borderline", "incomprehensible", "object", "though", "call", "way", "thinking", "aestheticism", "formalism", "say", "rightto", "try", "tuck", "tangled", "event", "philosophical", "scheme", "schönen", "und", "weisen", "allgemeinheiten", "result", "inadequate", "outrageous", "letter", "martin", "buber", "p", "189", "transl", "modified", "landauer", "continued", "argue", "historical", "matter", "talked", "historically", "term", "formal", "pattern", "formalem", "schematismus", "gladly", "grant", "behind", "desire", "see", "greatness", "desire", "alone", "sufficient", "make", "greatness", "confused", "vulgarity", "ibid", "1901", "landauer", "challenge", "grotesque", "fusion", "erlebnis", "gemeinschaft", "gestalt", "world", "war", "mass", "slaughter", "precipitated", "end", "aesthetic", "religiosity", "buber", "work", "4", "philosophy", "dialogue", "thou", "buber", "bestknown", "work", "short", "philosophical", "essay", "thou", "1923", "basic", "tenet", "modify", "never", "abandon", "work", "buber", "give", "expression", "intuition", "need", "withstand", "temptation", "reduce", "human", "relation", "simple", "eitheror", "apollonian", "dionysian", "rational", "romantic", "way", "relating", "others", "being", "enter", "dialogic", "relation", "human", "others", "animate", "being", "animal", "tree", "well", "divine", "thou", "duality", "relation", "extreme", "coincidence", "may", "serve", "key", "buber", "mature", "thought", "everything", "approach", "biblical", "faith", "practical", "politics", "matter", "jewisharab", "relation", "palestine", "thou", "first", "translated", "english", "1937", "ronald", "gregor", "smith", "later", "walter", "kaufmann", "german", "original", "instant", "classic", "remains", "print", "today", "1950s", "60", "buber", "first", "traveled", "lectured", "usa", "essay", "became", "popular", "englishspeaking", "world", "well", "whereas", "world", "war", "buber", "promoted", "aesthetic", "unity", "unification", "later", "writing", "embrace", "rougher", "elemental", "dualism", "buber", "always", "opposed", "philosophical", "monism", "identified", "bergson", "objected", "doctrine", "immersion", "identified", "buddhism", "complicating", "undifferentiated", "shape", "mystical", "experience", "sought", "medievals", "including", "eckhart", "annihilation", "self", "profoundly", "dualistic", "worldview", "proffered", "thou", "reference", "cusa", "coincidentia", "oppositorum", "expression", "human", "limit", "buber", "text", "reduces", "relation", "person", "animate", "object", "deity", "three", "expressive", "signifier", "elemental", "variable", "whose", "combination", "recombination", "structure", "experience", "relational", "individuated", "element", "realize", "relation", "forming", "pattern", "burst", "life", "grow", "vanish", "revive", "human", "intersubjectivity", "affirms", "polymorphous", "ithou", "encounter", "resting", "upon", "claim", "isolated", "exists", "apart", "relationship", "dialogue", "encounter", "transforms", "figure", "ultimate", "mysterious", "center", "value", "whose", "presence", "eludes", "concept", "instrumental", "language", "heteronomous", "revelation", "singular", "presence", "call", "subject", "openended", "relationship", "living", "pattern", "defies", "sense", "logic", "proportion", "whereas", "iit", "relationship", "degenerate", "stage", "assumes", "fixed", "form", "object", "one", "measure", "manipulate", "core", "model", "existence", "notion", "encounter", "revelation", "understood", "buber", "revelation", "revelation", "presence", "gegenwart", "contrast", "object", "gegenstand", "presence", "revealed", "revelation", "encounter", "occupies", "space", "subject", "tree", "person", "work", "art", "god", "space", "defined", "mutual", "gegenseitig", "contrasting", "kantian", "concept", "experience", "erfahrung", "erlebnis", "encounter", "revelation", "sheer", "presence", "ineffable", "pure", "form", "carry", "iota", "determinate", "objectlike", "conceptual", "linguistic", "content", "buber", "always", "insisted", "dialogic", "principle", "ie", "duality", "primal", "word", "urworte", "called", "ithou", "iit", "abstract", "conception", "ontological", "reality", "pointed", "could", "properly", "represented", "discursive", "prose", "confusion", "andor", "confusion", "philosophy", "religion", "especially", "marked", "thou", "buber", "seems", "lack", "fully", "workedout", "epistemology", "occasionally", "revel", "paradox", "border", "mystical", "theology", "argued", "buber", "indeed", "solve", "inherent", "difficulty", "dialogics", "reflects", "speaks", "human", "reality", "word", "one", "think", "speak", "appropriate", "manner", "bloch", "1983", "p", "62", "debate", "strength", "weakness", "thou", "foundation", "system", "hinge", "part", "assumption", "fivevolume", "project", "book", "serve", "prolegomenon", "project", "buber", "abandoned", "indeed", "philosophical", "one", "buber", "lecture", "frey", "jüdisches", "lehrhaus", "course", "university", "frankfurt", "well", "letter", "rosenzweig", "show", "time", "writing", "preoccupied", "new", "approach", "phenomenology", "religion", "cf", "schottroff", "zank", "buber", "cyclical", "conception", "history", "religion", "revelation", "presence", "mix", "animates", "living", "lived", "form", "historical", "religion", "institution", "text", "ritual", "image", "idea", "becoming", "time", "ossified", "rigid", "objectlike", "structurally", "open", "force", "renewal", "based", "new", "form", "encounter", "revelation", "history", "religion", "described", "buber", "closing", "word", "thou", "contracting", "intensifying", "spiral", "figure", "redemption", "telos", "would", "artificial", "however", "separate", "buber", "interest", "religious", "phenomenon", "interest", "general", "philosophical", "anthropology", "rather", "buber", "seems", "tried", "find", "one", "orput", "differentlyto", "make", "religious", "belief", "practice", "perspicacious", "light", "general", "philosophical", "anthropology", "5", "zionism", "beginning", "literary", "career", "buber", "recruited", "budapestborn", "viennabased", "journalist", "theodor", "herzl", "edit", "main", "paper", "zionist", "party", "die", "welt", "soon", "found", "congenial", "home", "democratic", "faction", "cultural", "zionist", "led", "chaim", "weizmann", "living", "zurich", "buber", "phase", "engagement", "movement", "political", "institution", "alternated", "extended", "phase", "disengagement", "never", "ceased", "write", "speak", "understood", "distinctive", "jewish", "brand", "nationalism", "buber", "seems", "derived", "important", "lesson", "early", "struggle", "political", "cultural", "zionism", "leadership", "direction", "movement", "realized", "place", "high", "diplomacy", "political", "education", "search", "psychologically", "sound", "foundation", "heal", "rift", "modern", "realpolitik", "distinctively", "jewish", "theologicalpolitical", "tradition", "much", "keeping", "nineteenthcentury", "protestant", "yearning", "christian", "foundation", "nationstate", "buber", "sought", "healing", "source", "integrating", "power", "religious", "experience", "hiatus", "ten", "year", "buber", "spoke", "jewish", "youth", "group", "famously", "prague", "bar", "kokhba", "refrained", "practical", "involvement", "zionist", "politics", "reentered", "zionist", "debate", "1916", "began", "publishing", "journal", "der", "jude", "served", "open", "forum", "exchange", "issue", "related", "cultural", "political", "zionism", "1921", "buber", "attended", "zionist", "congress", "carlsbad", "delegate", "socialist", "hashomer", "hatzair", "young", "guard", "debate", "followed", "first", "antizionist", "riot", "palestine", "buber", "joined", "brit", "shalom", "argued", "peaceful", "mean", "resistance", "arab", "revolt", "193639", "british", "government", "imposed", "quota", "immigration", "palestine", "buber", "argued", "demographic", "parity", "rather", "trying", "achieve", "jewish", "majority", "finally", "wake", "biltmore", "conference", "buber", "member", "ihud", "argued", "binational", "rather", "jewish", "state", "palestine", "stage", "buber", "harbored", "illusion", "chance", "political", "view", "sway", "majority", "believed", "important", "articulate", "moral", "truth", "one", "saw", "needle", "say", "politics", "authenticity", "made", "friend", "among", "member", "zionist", "establishment", "theoretical", "core", "zionism", "advanced", "buber", "conception", "jewish", "identity", "neither", "entirely", "determined", "religion", "nationality", "constituted", "unique", "hybrid", "early", "buber", "rejected", "stateform", "jewish", "people", "palestine", "clear", "already", "widelynoted", "1916", "exchange", "letter", "liberal", "philosopher", "hermann", "cohen", "cohen", "rejected", "zionism", "incommensurate", "jewish", "mission", "living", "religious", "minority", "task", "maintaining", "idea", "messianism", "saw", "motor", "social", "political", "reform", "within", "society", "large", "contrast", "buber", "embraced", "zionism", "selfexpression", "particular", "jewish", "collective", "could", "realized", "land", "soil", "language", "modern", "state", "mean", "symbol", "however", "genuinely", "connected", "vision", "jewish", "renaissance", "writing", "early", "war", "year", "buber", "characterized", "jew", "oriental", "type", "perpetual", "motion", "later", "writing", "jew", "represent", "type", "neither", "nation", "creed", "uncannily", "combine", "called", "national", "spiritual", "element", "letter", "gandhi", "buber", "insisted", "spatial", "orientation", "jewish", "existence", "defended", "zionist", "cause", "critic", "saw", "form", "colonialism", "buber", "space", "necessary", "insufficient", "material", "condition", "creation", "culture", "based", "dialogue", "gesamtkunstwerk", "right", "zionist", "project", "epitomize", "life", "dialogue", "drawing", "two", "resident", "nation", "palestine", "perfectible", "common", "space", "free", "mutual", "domination", "6", "political", "theology", "buber", "honed", "political", "theology", "response", "conflict", "fascism", "communism", "two", "main", "ideology", "dominating", "midtwentieth", "century", "europe", "nationalutopian", "thought", "shared", "trait", "extreme", "position", "made", "fact", "one", "jewish", "personage", "acceptable", "partner", "debate", "moderate", "national", "socialist", "early", "1930s", "proximity", "vigorously", "dismissed", "misperception", "political", "position", "remained", "indissolubly", "linked", "philosophicaltheological", "commitment", "life", "dialogue", "developed", "thou", "according", "buber", "politics", "work", "society", "shape", "rejected", "hardened", "ideological", "formation", "collective", "thus", "objected", "solution", "articulated", "either", "political", "extreme", "understood", "recognize", "neither", "thou", "social", "life", "buber", "particularly", "opposed", "notion", "political", "sphere", "rested", "friendenemy", "distinction", "theorized", "ultraconservative", "jurist", "carl", "schmitt", "buber", "political", "ideal", "acephalic", "utopian", "derived", "reconstruction", "ancient", "israelite", "polity", "reflected", "book", "judge", "conversely", "argued", "reading", "judge", "inspired", "anarchism", "landauer", "see", "brody", "2018", "presented", "buber", "1930s", "primary", "governing", "trope", "jewish", "political", "theologydivine", "kingship", "königtum", "gottes", "represents", "answer", "schmitt", "whose", "political", "theology", "allowed", "divine", "power", "absorbed", "human", "sovereign", "buber", "resisted", "slippage", "privileging", "instead", "antimonarchical", "stratum", "hebrew", "bible", "1932", "book", "kingship", "god", "biblical", "hero", "gideon", "chapter", "eight", "book", "judge", "stand", "leader", "beating", "back", "philistine", "enemy", "decline", "claim", "hereditary", "kingship", "buber", "read", "genuine", "unconditional", "political", "sovereignty", "rest", "unconditional", "yes", "affirming", "absolute", "kingship", "god", "theory", "staked", "schmitt", "assertion", "god", "alone", "sovereign", "mean", "god", "authority", "nontransferable", "human", "head", "political", "institution", "thus", "buber", "preserve", "notion", "divine", "sovereignty", "form", "state", "apparatus", "tyranny", "buber", "privileged", "simple", "preliminary", "primitive", "immediate", "form", "government", "insisting", "genuine", "theocracy", "form", "government", "rather", "striving", "political", "tide", "theological", "work", "art", "messianic", "ideal", "divine", "kingship", "found", "hebrew", "bible", "presented", "reliable", "image", "preserved", "collective", "memory", "tradition", "buber", "maintained", "upon", "time", "israelite", "deity", "yhwh", "fact", "heretog", "warriorking", "people", "also", "knew", "unable", "posit", "certain", "proceeded", "admit", "image", "reflects", "historical", "actuality", "know", "historical", "possibility", "path", "utopia", "1947", "buber", "plot", "image", "perfect", "space", "one", "composed", "line", "allow", "fixed", "definition", "zone", "individual", "collective", "constantly", "recalibrated", "according", "free", "creativity", "member", "relationship", "centralism", "decentralization", "problem", "which", "approached", "principle", "butonly", "great", "spiritual", "tact", "constant", "tireless", "weighing", "measuring", "right", "proportion", "them", "social", "pattern", "utopia", "based", "constant", "drawing", "redrawing", "line", "demarcation", "path", "utopia", "1996", "p", "137", "experiment", "fail", "jewish", "village", "commune", "palestine", "ie", "kvutza", "kibbutz", "moshav", "owed", "success", "pragmatism", "member", "approached", "historical", "situation", "inclination", "towards", "increased", "level", "federation", "degree", "established", "relationship", "society", "large", "single", "unit", "combine", "system", "series", "unit", "without", "centralization", "state", "authority", "ibid", "1428", "nowherein", "history", "socialist", "movement", "men", "deeply", "involved", "process", "differentiation", "yet", "intent", "preserving", "principle", "integration", "ibid", "145", "discovered", "right", "proportion", "tested", "anew", "every", "day", "according", "changing", "condition", "groupfreedom", "collective", "order", "ibid", "148", "difficult", "recognize", "description", "modern", "jewish", "agricultural", "collective", "updated", "version", "biblical", "tribal", "past", "buber", "idealized", "work", "primitive", "israelite", "polity", "age", "biblical", "judge", "7", "distance", "relation", "late", "philosophical", "anthropology", "responding", "unfolding", "political", "chaos", "europe", "struggle", "jew", "arab", "palestine", "buber", "philosophical", "oeuvre", "assumed", "occasionalist", "essayistic", "form", "late", "1930s", "1940s", "addition", "work", "cited", "work", "religion", "bible", "prophetic", "faith", "last", "major", "philosophical", "publication", "eclipse", "god", "1951", "unites", "late", "work", "group", "common", "emphasis", "philosophical", "anthropology", "place", "individual", "person", "world", "visàvis", "human", "being", "human", "community", "whether", "reflecting", "man", "jew", "single", "one", "always", "critical", "buber", "late", "thought", "tension", "distance", "relation", "role", "mediated", "image", "dialogical", "openended", "nonfixed", "relation", "social", "natural", "world", "buber", "addressed", "never", "directly", "tension", "fact", "value", "explored", "rigor", "later", "nineteenth", "early", "twentiethcentury", "german", "philosophy", "postwar", "angloamerican", "analytic", "philosophy", "one", "signature", "piece", "period", "essay", "kierkegaard", "question", "single", "one", "1936", "buber", "turn", "kierkegaard", "order", "force", "question", "solipsism", "buber", "danish", "philosopher", "stand", "modern", "alienation", "world", "question", "buber", "asks", "whether", "even", "possible", "conceive", "human", "single", "one", "according", "buber", "kierkegaard", "love", "god", "excludes", "love", "neighbor", "fellow", "creature", "constitute", "world", "human", "term", "eye", "creation", "genesis", "buber", "describes", "man", "subject", "hovering", "embracing", "creaturely", "world", "model", "renunciation", "object", "political", "life", "time", "relation", "mean", "giving", "oneself", "crowd", "embrace", "creaturely", "existence", "remains", "vexing", "buber", "characterizes", "human", "term", "potentiality", "within", "factual", "finite", "limit", "term", "radicality", "see", "kierkegaard", "say", "instead", "positing", "radical", "dichotomy", "community", "single", "one", "buber", "argues", "compatible", "necessary", "one", "another", "critique", "single", "one", "relation", "larger", "social", "world", "belongs", "worldpicture", "established", "buber", "essay", "man", "1938", "stake", "buber", "knowledge", "human", "person", "whole", "ie", "complete", "understanding", "human", "subjectivity", "methodological", "key", "essay", "philosophical", "anthropology", "buber", "assumed", "entering", "act", "selfreflection", "philosophical", "anthropologist", "become", "aware", "human", "wholeness", "based", "structural", "distinction", "epoch", "human", "habitation", "epoch", "human", "homelessness", "former", "philosophical", "anthropology", "cosmological", "ie", "fundamentally", "related", "world", "human", "environment", "latter", "human", "subjectivity", "conceived", "selfstanding", "independent", "conceptual", "tension", "home", "universe", "thing", "contrast", "presented", "collapse", "rounded", "unified", "world", "visàvis", "selfdivided", "form", "consciousness", "order", "preserve", "imbrication", "singular", "selfhood", "bonding", "human", "personhood", "buber", "rejected", "false", "choice", "individualism", "collectivism", "buber", "always", "understood", "human", "wholeness", "lie", "meeting", "one", "living", "fourfold", "relation", "thing", "individual", "person", "mystery", "self", "every", "living", "relation", "essential", "contributes", "human", "wholeness", "human", "wholeness", "man", "unique", "essence", "known", "posited", "living", "set", "relation", "relationship", "constitutes", "fundamental", "datum", "human", "wholeness", "remains", "also", "true", "relation", "understood", "buber", "independent", "conceptual", "antipode", "namely", "distance", "developed", "essay", "distance", "relation", "1951", "relation", "take", "shape", "apart", "without", "prior", "setting", "thing", "person", "spiritual", "being", "distance", "buber", "setting", "thing", "person", "being", "distance", "way", "secure", "form", "otherness", "without", "relation", "without", "form", "otherness", "confirmation", "self", "insofar", "confirmation", "always", "mediated", "confirms", "distance", "relation", "rather", "distance", "relation", "relation", "difference", "buber", "famously", "understood", "ithou", "relationship", "one", "based", "immediacy", "always", "steeped", "thought", "power", "mediating", "image", "plastic", "form", "material", "stuff", "intersubjective", "relationship", "essay", "man", "imagework", "buber", "set", "understand", "something", "formation", "image", "relation", "world", "world", "encompassed", "art", "faith", "love", "philosophy", "buber", "postulated", "three", "level", "world", "formation", "first", "two", "level", "familiar", "kantian", "concept", "noumenal", "x", "world", "phenomenal", "senseworld", "form", "comprising", "world", "shaped", "image", "concept", "buber", "conception", "third", "level", "call", "world", "perfect", "form", "derives", "mystical", "tradition", "paradoxical", "level", "world", "formation", "expressed", "term", "perfected", "formrelations", "art", "faith", "philosophy", "human", "imagework", "emerges", "relational", "encounter", "person", "independent", "world", "exists", "imaginable", "concern", "image", "relation", "distance", "dialogue", "surfaced", "buber", "last", "major", "work", "eclipse", "god", "1952", "socalled", "eclipse", "god", "buber", "symbol", "spiritual", "crisis", "postwar", "western", "civilization", "designated", "philosophical", "collapse", "much", "moral", "one", "like", "sartre", "heidegger", "buber", "directed", "attention", "concrete", "existence", "unlike", "fellow", "existentialist", "buber", "moved", "interaction", "human", "individually", "collectively", "absolute", "reality", "exceeds", "human", "imagination", "sartre", "heidegger", "also", "carl", "jung", "buber", "rejected", "picture", "selfenclosed", "human", "subject", "selfenclosed", "human", "lifeworlds", "beyond", "external", "independent", "reality", "towards", "end", "career", "writer", "thinker", "buber", "sought", "maintain", "distinction", "relation", "human", "subject", "external", "order", "sustain", "ontological", "source", "ethical", "value", "opposition", "false", "absolute", "modern", "world", "fused", "absolute", "political", "historical", "product", "human", "spirit", "8", "criticism", "philosophical", "criticism", "buber", "tends", "focus", "three", "area", "1", "epistemological", "question", "regarding", "status", "ithou", "form", "relationship", "status", "objectworld", "delimited", "iit", "form", "relationship", "2", "hermeneutical", "question", "regarding", "buber", "reading", "hasidic", "source", "material", "3", "doubt", "regarding", "author", "rhetoric", "style", "touch", "upon", "philosophy", "language", "three", "line", "criticism", "core", "problem", "conflict", "realism", "idealism", "worldaffirmation", "worlddenial", "nature", "world", "picture", "buber", "magnum", "opus", "always", "among", "contested", "aspect", "buber", "philosophy", "critical", "literature", "thou", "considered", "inaugurated", "copernican", "revolution", "theology", "scientificrealistic", "attitude", "bloch", "1983", "p", "42", "also", "criticized", "reduction", "fundamental", "human", "relation", "twothe", "ithou", "iit", "writing", "buber", "publication", "thou", "rosenzweig", "would", "last", "critic", "complain", "setting", "iit", "give", "ithou", "cripple", "opponent", "continued", "rebuke", "make", "creation", "chaos", "good", "enough", "provide", "construction", "material", "baumaterial", "new", "building", "franz", "rosenzweig", "briefe", "und", "tagebücher", "pp", "8245", "jewish", "philosophical", "circle", "long", "argued", "buber", "unable", "ward", "relativism", "subjectivism", "antinomianism", "said", "permeate", "nonrealist", "epistemology", "ontology", "building", "rosenzweig", "complaint", "buber", "epistemology", "steven", "katz", "called", "realism", "affirms", "rich", "world", "stable", "object", "extended", "time", "space", "still", "widely", "assumed", "critic", "jewish", "philosophy", "critique", "jewish", "law", "iit", "form", "relationship", "buber", "rejected", "world", "objectforms", "toto", "addition", "hermeneutical", "argument", "regarding", "historicism", "antihistoricism", "literary", "style", "poetic", "license", "argument", "picture", "hasidism", "emerged", "buber", "research", "writing", "also", "based", "upon", "philosophical", "world", "picture", "took", "shape", "buber", "philosophical", "universe", "buber", "corpus", "hasidica", "doyen", "kabbalah", "scholarship", "gershom", "scholem", "one", "first", "throw", "gauntlet", "scholem", "argued", "buber", "focus", "genre", "folktales", "obscured", "theoretical", "work", "within", "corpus", "hasidic", "literature", "phenomenon", "gnostic", "world", "denial", "pronounced", "popular", "tale", "buber", "later", "collection", "hasidic", "tale", "particular", "reflect", "thisworldly", "ethos", "odds", "important", "tenet", "hasidic", "mysticism", "whereas", "buber", "early", "neoromantic", "hasidica", "assumed", "distant", "even", "antagonistic", "relation", "world", "time", "space", "critic", "scholem", "katz", "schatzuffenheimer", "focused", "critique", "almost", "exclusively", "later", "body", "work", "thiswordly", "cosmology", "sharply", "articulated", "line", "buber", "renewed", "interest", "starting", "mid", "late", "1920s", "quotidian", "form", "existence", "analytic", "philosopher", "steven", "t", "katz", "author", "important", "essay", "particularism", "mystical", "language", "articulated", "range", "criticism", "directed", "buber", "writing", "katz", "1985", "recently", "katz", "revisited", "mitigated", "earlier", "criticism", "included", "charge", "antinomianism", "lack", "account", "enduring", "character", "ithou", "relation", "misrepresentation", "hasidic", "thought", "katz", "zank", "2006", "remains", "objectionable", "buber", "tendency", "toward", "aestheticization", "reality", "problem", "buber", "often", "slippery", "poetic", "rhetoric", "walter", "kaufmann", "produced", "second", "english", "translation", "thou", "articulated", "displeasure", "buber", "strongly", "regard", "lack", "deep", "impact", "buber", "contribution", "biblical", "study", "hasidism", "zionist", "politics", "indication", "failure", "kaufmann", "considered", "thou", "shameful", "performance", "style", "content", "style", "book", "invoked", "oracular", "tone", "false", "prophet", "affected", "honest", "writing", "state", "irresistible", "enthusiasm", "buber", "lacked", "critical", "distance", "needed", "critique", "revise", "formulation", "conception", "iit", "manichean", "insult", "conception", "ithou", "rashly", "romantic", "ecstatic", "buber", "mistook", "deep", "emotional", "stirring", "revelation", "kaufmann", "1983", "pp", "2833", "preponderance", "buber", "writing", "rhetorical", "figure", "experience", "realization", "revelation", "presence", "encounter", "predilection", "utopian", "political", "program", "anarchism", "socialism", "binational", "solution", "intractable", "national", "conflict", "jew", "arab", "palestine", "line", "vagueness", "philosophical", "writing", "often", "render", "buber", "thought", "suggestive", "elusive", "similar", "criticism", "apply", "buber", "claim", "language", "power", "reveal", "divine", "presence", "uncover", "buber", "early", "jugendstil", "rhetoric", "far", "cry", "neue", "sachlichkeit", "nineteen", "twenty", "braiterman", "2007", "similarly", "inclined", "literary", "author", "like", "hermann", "hesse", "praised", "buber", "german", "rendition", "hasidic", "lore", "bible", "translation", "later", "gained", "popular", "praise", "among", "german", "theologian", "others", "among", "franz", "kafka", "theodor", "w", "adorno", "siegfried", "kracauer", "spoke", "buber", "style", "disparagingly", "biographical", "note", "philosopher", "thou", "allowed", "people", "call", "first", "name", "theorist", "education", "suffered", "disturbance", "rigorous", "schedule", "child", "playing", "home", "utopian", "politician", "alienated", "representative", "zionist", "establishment", "innovative", "academic", "lecturer", "barely", "found", "permanent", "position", "university", "helped", "createthe", "hebrew", "university", "jerusalem", "dedicated", "student", "inspiring", "orator", "writer", "found", "irritated", "conflict", "master", "idea", "attempt", "putting", "practice", "final", "analysis", "seems", "buber", "always", "remained", "wellgroomed", "affected", "prodigiously", "gifted", "pampered", "viennese", "boy", "displaced", "land", "horse", "chemist", "whose", "best", "company", "work", "imagination", "whose", "selfstaging", "overture", "outside", "world", "always", "tainted", "enthusiasm", "word", "heightened", "tone", "prodigious", "voice", "9", "honor", "legacy", "largely", "ignored", "academic", "philosopher", "buber", "already", "widely", "recognized", "reviewed", "across", "larger", "field", "german", "letter", "world", "war", "i", "rose", "renewed", "prominence", "germany", "world", "war", "ii", "bible", "translation", "collection", "hasidic", "story", "writing", "philosophy", "dialogue", "remained", "print", "ever", "since", "among", "honor", "buber", "received", "1945", "goethe", "prize", "city", "hamburg", "1951", "friedenspreis", "de", "deutschen", "buchhandels", "frankfurt", "main", "1953", "erasmus", "prize", "amsterdam", "1963", "significant", "student", "considered", "work", "continuation", "buber", "nahum", "glatzer", "buber", "doctoral", "student", "year", "university", "frankfurt", "19241933", "later", "influential", "teacher", "judaic", "study", "brandeis", "university", "akiba", "ernst", "simon", "historian", "theorist", "education", "israel", "first", "met", "buber", "frey", "jüdisches", "lehrhaus", "frankfurt", "returned", "palestine", "work", "buber", "mittelstelle", "für", "jüdische", "erwachsenenbildung", "important", "israeli", "scholar", "shmuel", "eisenstadt", "amitai", "etzioni", "jochanan", "bloch", "knew", "buber", "later", "year", "taught", "seminar", "social", "philosophy", "education", "hebrew", "university", "jerusalem", "united", "state", "buber", "american", "translator", "biographer", "maurice", "friedman", "prolific", "author", "right", "almost", "singlehandedly", "introduced", "buber", "postwar", "american", "religion", "scholar", "larger", "reading", "public", "addition", "friedman", "walter", "kaufmann", "author", "one", "first", "englishlanguage", "study", "nietzsche", "well", "book", "religion", "existentialism", "helped", "popularize", "buber", "united", "state", "despite", "abovecited", "critique", "buber", "thou", "kaufmann", "first", "included", "buber", "canon", "religious", "existentialism", "1950s", "1960s", "jewish", "philosophy", "buber", "name", "since", "eclipsed", "franz", "rosenzweig", "emmanuel", "levinas"]}