{"url": "collins", "title": "Anthony Collins", "authorship": {"year": "Copyright © 2020", "author_text": "William Uzgalis\n<buzgalis@gmail.com>", "author_links": [{"http://oregonstate.edu/cla/philosophy/uzgalis": "William Uzgalis"}, {"mailto:buzgalis%40gmail%2ecom": "buzgalis@gmail.com"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://oregonstate.edu/cla/philosophy/uzgalis\" target=\"other\">William Uzgalis</a>\n&lt;<a href=\"mailto:buzgalis%40gmail%2ecom\"><em>buzgalis<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Mon Aug 25, 2003", "substantive revision Thu Oct 8, 2020"], "preamble": "\n\nAnthony Collins (1676–1729) was a wealthy English free-thinker,\ndeist and materialist who in his later years became a country squire\nand local government official in Essex. Along with John Toland,\nCollins was the most significant member of a close knit circle of\nradical free thinkers that arose in England in the first three decades\nof the eighteenth century. This group included such men as Samuel\nBold, Matthew Tindal, Thomas Woolston and William\n Wollaston.[1]\n Collins was a friend of John Locke in Locke’s old age and Locke\nwas one important formative influence on his philosophical views. In\nrespect to his materialism and determinism Collins was clearly\ninfluenced more by Hobbes, Bayle and possibly Spinoza than he was by\nLocke. The Latitudinarians may well have influenced his views about\nfree thinking as well as Locke. Collins’ works had some\ninfluence in England and much more on the continent during the\neighteenth century.\n\nCollins’ central passion is the autonomy of reason particularly\nwith respect to religion. Collins was strongly motivated by an\naversion to religious persecution. Issues revolving around religious\nfreedom are the threads that run through all of his writing. It is\npossible to divide Collins’ works into those that are mainly\nphilosophical and those that are more narrowly religious, but they are\nclearly connected. His 1707–8 pamphlet controversy with Samuel\nClarke over whether “matter can think” and other topics,\nand his book about free will and determinism are chiefly engaged with\nphilosophical topics. Even these topics, however, involve such\nreligious issues as the immortality of the soul and punishment and\nreward in the next life. His writing about reason and free-thinking\nmay be regarded as on the borderline between philosophy and religion.\nAlthough it deals with epistemological and sometimes metaphysical\nissues, it focuses almost entirely on religious issues. His religious\nworks are even more narrowly focused. The Thirty-nine Articles are the\nonly official confessional statement of Anglicanism. Two of\nCollins’ books deal with the authenticity of Article 20 of the\nThirty-nine Articles and whether the church has the power to make\ndoctrine. In large measure, these represent the doctrines of\nfree-thinking applied to the particular case of the Anglican Church.\nCollins also wrote a book examining the question of whether the\nprophecies of Christ’s messiahship could be accepted. This seems\nto be a rejection of Christianity as a revealed religion. How far\nCollins went in the direction of atheism is still a matter of\nscholarly debate.\n\nCollins was clearly a controversial figure in his time; nor has\nscholarly treatment down the years done much better at being\nobjective. As Ernest Campbell Mossner remarks: \n\n\nThe Deists were long subjected to the odium theologicum and\nthe historians of the movement have almost without exception\ndowngraded or slandered them both socially as well as intellectually\nsince the time of John Leland in the eighteenth century. (Mossner\n1967b: 335)\n\n", "toc": [{"#LifeWork": "1. Life and Works"}, {"#Life": "1.1 Life"}, {"#ChieWork": "1.2 Chief Works"}, {"#ClarCollCorr1707": "2. The Clarke Collins Correspondence (1707–08)"}, {"#BackConsMateSyst": "2.1 Background: Consciousness and Material Systems"}, {"#Corr": "2.2 The Correspondence"}, {"#ClarCate": "2.2.1 Clarke’s categories"}, {"#RealEmerProp": "2.2.2 Real emergent properties"}, {"#PersIden": "2.2.3 Personal Identity"}, {"#EvalClarCollCorr": "2.3 Evaluating the Clarke Collins Correspondence"}, {"#DeteFreeWill": "3. Determinism and Free Will"}, {"#Back": "3.1 Background"}, {"#DeteCollEarlWork": "3.2 Determinism in Collins’ early works"}, {"#PhilInquConcHumaLibe1717": "3.3 A Philosophical Inquiry Concerning Human Liberty, 1717"}, {"#CollDeisFree": "4. Collins, Deism and Freethinking"}, {"#EssaConcUseReas1707": "4.1 An Essay Concerning the Use of Reason, 1707"}, {"#AnalLang": "4.2 Analogical language"}, {"#DiscFreeThin1713": "4.3 A Discourse of Free Thinking, 1713"}, {"#InteDiscFreeThin": "4.4 Interpreting A Discourse of Free Thinking"}, {"#CollReli": "5. Collins and Religion"}, {"#Infl": "6. Influences"}, {"#Engl": "6.1 In England"}, {"#Cont": "6.2 On the continent"}, {"#Bib": "Bibliography"}, {"#PrimLite": "Primary Literature"}, {"#WorkColl": "Work by Collins"}, {"#WorkOthe": "Works by Others"}, {"#SecoLite": "Secondary Literature"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Life and Works\n1.1 Life\n\nAnthony Collins was born in Heston, Middlesex on June 21, 1676 into a\nfamily of lawyers. He went to Eton and then King’s College,\nCambridge in 1693. Though he had not graduated from Cambridge, Collins\nwent to the Middle Temple in 1694 to study law. He didn’t like\nthe law and was never called to the Bar. In 1698 he married the\ndaughter of a rich London merchant, Sir Francis Child. She died in\nchildbirth in 1703. At the time of his marriage he received some\nproperty in Essex from his father. Together with his wife’s\ndowry, this made him a very rich man indeed. Collins met John Locke on\na visit to Oates in Essex in 1703, visited Locke five times over the\nnext 18 months and carried on a correspondence with him about various\nphilosophical topics. In one of his letters to Collins Locke remarked:\n\n\n\nBelieve it, my good friend, to love truth for truth’s sake is\nthe principal part of human perfection in this world, and the seed bed\nof all other virtues; and if I mistake not, you have as much of it as\nI have ever met with in anybody. \n\n\nCollins was a lifelong bibliophile with a large private research\nlibrary. In the article on Collins in Birch’s Dictionary, Birch\nnotes that his \n\n\nlarge and curious [library] was open to all men of letters, to whom he\nreadily communicated all the lights and assistance in his power, and\neven furnished his antagonists with books to confute himself, and\ndirected them how to give their arguments all the force of which they\nwere capable. (Birch, quoted in Berman 1975: 50) \n\n\nDuring this period Collins also met Samuel Bold and John Toland. From\n1703 until 1706, after his wife’s death, Collins spent the\nwinters in London and the summers at his fine summer mansion in\nBuckinghamshire—where Queen Anne and her court visited him. In\n1707 Collins began a pamphlet controversy with Samuel Clarke, a\nprominent British philosopher and member of Newton’s inner\ncircle, over the question of whether matter can think. The controversy\ncontinued until 1708. In 1707 Collins also published anonymously the\nEssay Concerning the Use of Reason in Propositions, the evidence\nwhereof depends on human testimony. During this period Collins\nfrequented the London coffee shops where the deists and free-thinkers\nmet. Berkeley apparently met him at such a gathering in 1713. In 1710\nCollins made his first trip to the Continent, spending his time buying\nbooks in Holland and meeting John Churchill, first Duke of\nMarlborough, and Prince Eugene. Back in England, Collins met several\ntimes with Samuel Clarke and William Whiston at the house of Lady\nCalverly and Sir John Hubern for “frequent but friendly debates\nabout the truth of the Bible and the Christian Religion”\n(Whiston, quoted in O’Higgins 1970: 77). In 1713 he published\nA Discourse Concerning Free-Thinking. The Discourse\nwas his most controversial work. He made a second trip to the\ncontinent about the time that the Discourse was published.\nAgain he went to Holland and France and planned to go on to Italy. The\ntrip was cut short by the death of a close kinsman. In 1715 Collins,\nin effect, took root in Essex, moving into Mowdon Hall. Collins\nprobably owned a good 2000 acres in Essex, much of it prime\nagricultural land. In 1717 he published A Philosophical Enquiry\nConcerning Human Liberty in which he argues for a compatibilist\nform of determinism and rejects freedom of the will. Samuel Clarke\nreviewed the book, continuing the argument that had begun during the\nClarke Collins correspondence of 1707–08.\n\nFrom 1717 on Collins spent most of his time in the country, but still\nhad a keen interest in national politics at a distance, and local\npolitics in person. Collins was a Whig and became a spokesman for the\nWhigs in the country. Collins took a serious role in the government of\nEssex—serving as a justice, a commissioner for taxes, and then\nTreasurer of the County. He examined roads and bridges. He was\ninvolved in finding a place for housing county records. As Treasurer\nhe was a model of integrity. In considering the relation between\nCollins, the County official and Collins the writer, O’Higgins\nnotes that Collins was probably less tolerant towards Catholics than\nother justices (O’Higgins 1970: 128–9). Collins the writer\nis consistently anti-Catholic. So, while one might hope that the use\nof reason would produce a higher degree of toleration towards all\nreligious groups than one would expect to find among true believers,\nthere seems to be little conflict here between the writer and the\njurist.\n\nIn December 1723 Collins’ only son suddenly became ill and died.\nHis father was grief-stricken. Collins remarried in 1724 and he\npublished what is perhaps his most successful book, A Discourse on\nthe Grounds and Reasons of the Christian Religion as well as\nAn Historical and Critical Essay on the Thirty Nine Articles of\nthe Church of England. From 1725 until 1729 Collins’ health\nbegan to deteriorate. Still, in 1726 he published The Scheme of\nLiteral Prophecy Considered. In 1729 Collins published A\nDiscourse Concerning Ridicule and Irony in Writing. He was\nsuffering from gall stones and finally died of his disease on December\n13, 1729. His second wife Elisabeth and his two daughters survived\nhim. He willed his unpublished manuscripts to Pierre Desmaizeaux but\nDesmaizeaux took an offer from Collins’ widow to buy them.\nDesmaizeaux quickly regretted his decision, but it was too late. He\naccused Elisabeth Collins of giving some of Collins unpublished papers\nto the Bishop of Lincoln. She denied that the story was true. She\nwilled some or all of Collins unpublished papers to a friend. What\nbecame of them is still a mystery.\n1.2 Chief Works\n\nAn Essay Concerning the Use of Reason, 1707\nCollins contributions to the Clarke Collins controversy:\n\n\nA Letter to Mr. Dodwell, 1706\nA Reply to Mr. Clarke’s Defence of His Letter to Mr.\nDodwell\nReflections on Mr. Clarke’s Second Defence of His Letter to\nMr. Dodwell\nAn Answer to Mr. Clarke’s Third Defence of His Letter to Mr.\nDodwell, 1708\n \nPriestcraft In Perfection 1710\nA Vindication of the Divine Attributes, in some Remarks on His\nGrace the Archbishop of Dublin’s sermon intitled “Divine\nPredestination Consistent with the Freedom of Man’s\nWill”, 1710\nA Discourse of Free-Thinking, 1713\nPhilosophical Inquiry Concerning Human Liberty, 1717\nA Discourse on the Grounds and Reasons of the Christian\nReligion, 1724\nAn Historical and Critical Essay on the Thirty Nine Articles\nof the Church of England, 1724\nThe Scheme of Literal Prophecy Considered, 1726\nA Discourse concerning Ridicule and Irony in Writing,\n1729\n\n2. The Clarke Collins Correspondence (1707–08)\n2.1 Background: Consciousness and Material Systems\n\nThe chief topic of the Clarke Collins controversy of 1707–08 is\nwhether consciousness can inhere in a material system, a highly\ncontroversial issue largely inspired in this case by Locke’s\nnotorious speculation about thinking matter. In Book IV of An\nEssay Concerning Human Understanding, in stressing the limits of\nhuman knowledge of substances, Locke writes: \n\n\nWe have the Ideas of Matter and Thinking, but possibly shall never be\nable to know, whether any mere material Being thinks, or no; it being\nimpossible for us, by the contemplation of our own Ideas, without\nrevelation, to discover whether Omnipotency has not given to some\nSystem of Matter fitly disposed, a power to perceive and think, or\nelse joined and fixed to Matter so disposed, a thinking immaterial\nSubstance…. (Locke 1690 IV, iii, 6 [1975: 540–1]) \n\n\nLocke then went on to conjecture that it might be just as easy for God\nto add the power of thought to a system of matter organized in the\nright way as for God to connect an immaterial thinking thing to a body\n(Ibid.). Clearly, the difficulties in explaining how an immaterial\nmind could relate to a material body play a significant role in\nleading Locke to this position. This “thinking matter”\npassage “raised a storm of protest and discussion that lasted\nright through to the last years of the eighteenth century”\n(Yolton 1983: 17). One of the first of these protests came from Bishop\nStillingfleet and Locke’s response helps us better understand\nthe thinking matter hypothesis. Starting with God’s creation of\nmatter, Locke goes through a series of superadditions of motion to\nmatter, life and the excellencies of vegetation such as those of a\nrose or a peach tree, then sense and spontaneous motion and the other\nproperties of an elephant. Then he notes that if there are no\nobjections to God performing these actions upon matter, why object to\nthe next step which is superadding the powers to matter to make a\nthinking, intelligent material thing. Thus, superaddition seems to\ninvolve the creation of organizations out of matter that have\nparticular functional powers characteristic of different kinds of\nliving things.\n\nLocke and Collins discussed some of the responses to the thinking\nmatter passage that were published before Locke’s death in 1704.\nLocke’s conjecture about thinking matter is, in effect, the\ncenterpiece of the debate between Samuel Clarke and Anthony Collins\nbetween 1707 and 1708, although the issue was also discussed on the\ncontinent. Still, as Ann Thompson writes in Bodies of\nThought: \n\n\nHere I shall only observe that despite the undeniable importance of\nLocke’s hypothesis and the arguments put forward in his second\nreply to Stillingfleet, they should not be seen as a starting point\nfor speculations about the soul, but as part of an ongoing\nphilosophical and theological discussion. While Locke’s\narguments probably provided a new stimulus for discussion, claims that\nhis hypothesis constituted the sole impetus for the late seventeenth\ncentury materialistic works ignore the preceding theological debates.\n(Thompson 2008: 58) \n\n\nThere were some diverse strands to this debate.\n\nThe Catholic Church at the Fifth Lateran Council in 1553 had declared\nthe soul immaterial and therefore immortal. Philosophers were invited\nto produce proof of the soul’s immateriality. There was a\ntradition going back to Plato that the soul is a unity without parts.\nPresumably having no parts it cannot fall apart. The kind of substance\ndualism that one finds in Descartes, for example, was intended to\ndistinguish humans from animals. In England, the new science was both\nregarded suspiciously by some religious conservatives while its\nproponents saw it as an ally of religion. In his will, Robert Boyle\nprovided for a series of lectures that would use the new science to\ndefend religious orthodoxy. These Boyle lectures were aimed at\ndefending religion against atheists, deists, Epicurean philosophers,\nas well as Hobbes, Spinoza, and their followers. One of Richard\nBently’s sermons in 1692 was titled Matter and Motion Cannot\nThink. Bently claimed that even God’s omnipotence could not\nproduce a cognitive body (Thompson 2008: 61). This claim that there\nwas a limit to God’s omnipotence was shocking to some. Samuel\nClarke gave the Boyle lecture two years in a row, 1704 and 1705, and\nthese were published together as A Discourse Concerning the Being\nand Attributes of God and the Obligations of Natural Religion and the\nTruth and Certainty of the Christian Revelation. It is quite\nlikely that Collins had read this work and so when he opposed Clarke,\nhe surely knew who and what philosophical positions he was dealing\nwith.\n\nOn the other side, the mechanical philosophy of Descartes, Mersenne\nand Gassendi played a role on the materialist side of the debate.\nInsofar as animals could be treated like machines, it became possible\nfor one to argue that humans were sufficiently like other animals that\nthey too could be treated as machines. Thus an immaterial soul could\nbe dispensed with. There were also medical treatises that suggested\nthat matter is active and that the soul dies with the body. There were\nthe works of Hobbes and Spinoza which argued for a materialistic\nmonism. In 1704 John Toland published his Letters to Serena\nin which he argues that motion is essential to matter. Finally, there\nwas a Christian mortalist strand in Protestantism. One strand of these\nChristian mortalists claimed to derive their mortalism from scripture\nalone and urged that the immaterial soul was a Platonic invention that\nhad been foisted on Christianity and should be dispensed with. In\nEngland, this movement can be traced back as far as William Tindale in\nthe sixteenth century and included such luminaries as Overton, Milton,\nand Hobbes. Henry Dodwell, a well respected biblical scholar, was one\nsuch figure in this tradition.\n2.2 The Correspondence\n\nThe correspondence between Clarke and Collins took its rise from a\nbook published in 1706 by Henry Dodwell. Dodwell claimed on the basis\nof various passages from the Bible that without divine intervention\nthe soul would perish at death. Clarke wrote a public refutation of\nDodwell’s book. Besides rejecting Dodwell’s interpretation\nof scripture, Clarke gave a single argument to show that consciousness\ncould not be a property of a material system since the most plausible\nreason, apart from appeals to scripture, for the soul being naturally\nmortal is that it is material. Clarke claims \n\n\nmatter being a divisible substance, consisting always of\nseparable—nay of actually separate and distinct parts—it\nis plain, unless it were essentially conscious—in which case\nevery particle of matter must consist of innumerable separate and\ndistinct consciousnesses—no system of it in any possible\ncomposition or division can be an individual conscious being. (Clarke\n1738 [1928: 757]; Clarke and Collins 2011: 48) \n\n\nClarke went on to pose a thought experiment in which we are to imagine\n“three or three hundred particles at a mile, or any given\ndistance, one from another” (ibid.). Clarke claims that this\ncollection of particles could not constitute one individual conscious\nbeing. Then he has us supposes these particles brought together so as\nto touch one another. \n\n\nWill they, thereby, by any motion or composition whatever, become any\nwhit less truly distinct beings than they were at the greatest\ndistance? How, then, can their being disposed in any possible system,\nmake them one individual conscious being? (ibid.) \n\n\nClarke’s argument in effect denies that organization can play\nany role in unifying parts into a whole. Clarke’s argument,\nwithout mentioning Locke by name, is a refutation of Locke’s\nthinking matter hypothesis.\n\nCollins, writing to Dodwell concerning matters about which they\ndisagreed, noted that he would be happy to see Dodwell have the\nliberty “to publish whatever he thinks fit” (Dybikowski\n2011: 188). Collins then wrote a public “Letter to Mr.\nDodwell” in which he claimed to show that Clarke’s\nphilosophical argument against the mortality of the soul was\ninconclusive. Clarke responded with “A Defence of a Letter to\nMr. Dodwell”. Over the next two years, Clarke wrote three more\ndefenses of his original letter to Henry Dodwell and Collins wrote\nthree replies. Each of these was longer than its predecessor. Clarke,\nwho became increasingly irritated as the debate continued, got the\nfinal word in “The Fourth Defence of A Letter”.\n\nWhile the central issue of the correspondence is whether it is\npossible for consciousness to inhere in a material system and thus for\nmatter to think, the discussion toward the end turned to other issues\nsuch as free will and determinism and the adequacy of Collins’\naccount of personal identity. Rather than explain the Correspondence\nin detail, what follows is a discussion of Collins’ position in\nrespect to two central issues, that of emergent properties and\npersonal\n identity.[2]\n2.2.1 Clarke’s categories\n\nTo give a materialist account of life and consciousness, Collins needs\nto show that from lifeless and unthinking matter one can get life and\nthought. In his “Letter to Dodwell” Collins claims that\nthere are material systems all about us whose parts do not have the\nproperties found in the whole. He gives the example of a rose that has\nthe power to produce its sweet scent in us, while the particles that\ncompose it individually do not have this power (Clarke 1738 [1928:\n751]; Clarke and Collins 2011: 48–9). These material systems\nprovide models and analogies to understand how life and consciousness\ncan arise from lifeless and thoughtless particles. Thus, from the\nbeginning, Collins is arguing that consciousness is an emergent\nproperty, i.e. a property had by the whole, but not by the parts that\ncompose that whole.\n\nIn his First Defence, Clarke responds by giving an argument to show\nthat there are no real emergent properties. He does this by giving an\nenumeration of all of the kinds of properties. It turns out that there\nare only three categories. These categories correspond roughly to the\nprimary, secondary and tertiary qualities of the mechanical philosophy\n(Attfield 1977: 46). The correspondence is not precise because Clarke\nclaims to be categorizing all properties, not just properties\nthat belong to matter. Thus, he includes consciousness in the first\ncategory, though on a different basis than the first category\nproperties of matter such as magnitude and motion. Clarke claims that\nonly properties of the first kind are real. Properties of the second\nkind are \n\n\nnot really Qualities of the System, and evidently do not in\nany proper Sense belong to it, but are only Effects\noccasionally produced by it in some other Substance, and truly are\nQualities or Modes of that other Substance in which they are\nproduced…. (Clarke 1738 [1928: 759]; Clarke and Collins 2011:\n56) \n\n\nHeat, light, taste, and sound are examples of this class of\nproperties. Clarke claims that these properties are largely irrelevant\nto the question about consciousness because they are modes of the\nother substance in which they are produced. He claims, inaccurately\nthat Collins’s example of the smell of a rose belongs to this\nclass. The properties of the third kind are fictional. They \n\n\nare not real Qualities at all, residing in any subject, but\nmerely abstract Names to express the Effects of some\ndeterminate Motions of certain streams of Matter…. (Clarke 1738\n[1928: 760]; Clarke and Collins 2011: 57) \n\n\nThe examples that Clarke gives of third category properties are\nmagnetism, electrical attractions, and gravity.\n\nWhat conditions are required for belonging to Clarke’s first\nclass? In respect to material wholes, Clarke is a reductionist who\nholds that whatever real property one finds in the whole must be found\nproportionally in the parts. The height of the bricks and the mortar\nin a wall sum to the height of the wall as a whole. Thus, all the\nproperties in a material whole are compositions of the properties of\nthe parts. Call this Clarke’s Composition Principle. Any\nproperty of a material system that fails to conform to this pattern is\nnot a real property. It follows that emergent properties, properties\npossessed by the whole but not by the parts, cannot be real. As a\nresult of his examination of the kinds of categories, Clarke claims\nthat all properties of a whole which are not proportionally present in\nthe parts belong in his third class, the class of fictional\nproperties. It follows that since consciousness is a real property it\ncannot be an emergent property.\n\nSince consciousness is a real property it must belong in\nClarke’s first class of properties. This being so, it would seem\nthat it could not violate the Composition Principle. But\nconsciousness, on Clarke’s account, is so strongly unified that\nit cannot be either compounded or divided. This is why it cannot\nbelong to any material system. So, there must be a second sufficient\ncondition for belonging to Clarke’s first category. Clarke\nsecond sufficient condition is that \n\n\nan Individual Power, properly and strictly\nspeaking…can only proceed from or reside in, an Individual\nBeing. (Clarke 1738 [1928: 750]; Clarke and Collins 2011: 58).\n\n\n\nTo be an individual power, Clarke tells us, a power must be truly\nunitary, and thus not composed of parts. Call this the Individual\nPower Principle. So, consciousness is an individual power, which\nbelongs to an individual being, the soul. The soul, too, is so unified\nthat it does not have parts. Magnitude, in contrast, satisfies the\nComposition Principle but is not an individual power. This is because\nthe matter to which it belongs can always be divided, or more\nprecisely, actually is divided.\n\nUnderlying Clarke’s categories and his rejection of the\npossibility that wholes have properties not possessed by their parts\nis a principle that from material properties such as magnitude,\nmotion, or solidity, only other material properties, or properties of\nthe same kind, may result. The same kind of restriction can be said to\napply to mental properties. Call this the Homogeneity Principle. This\nPrinciple, in turn, is related to what has been called an heirloom\ntheory of causality. The idea here is that whatever ends up in an\neffect, must have been in the cause of that effect. Otherwise one gets\ncontradictions such as that something has come from nothing, or there\nis more of a given property in the whole than there is in the parts,\nand so\n on.[3]\n Later, in “A Third Defense of an Argument” Clarke calls\nCollins’s attention to the fact that in his proof for the\nexistence of God in Book IV of An Essay Concerning Human\nUnderstanding, Locke invokes the Homogeneity Principle to argue\nthat an eternal, immaterial thinking being could not arise from matter\n(Clarke 1738 [1928: 837]; Clarke and Collins, 2011: 170–171).\nClarke holds that this puts an end to Locke’s claim that God\ncould as easily make matter organized in the right way to think. We\nwill return to this when we consider the outcome of the debate.\n\nMarleen Rozemond, in her article of 2008, writes that Clarke’s\nposition is that something made out of matter can never constitute a\ngenuine individual because it is infinitely divisible, and so lacks\nthe required unity. She notes the similarity on this score of\nClarke’s position with that of Leibniz (Rozemond 2008: 175). One\nmight think that a whole, at least one that obeyed the Composition\nPrinciple, would be a real individual being.  But, it turns out that\nthis is not the case. The magnitude of the collected particles is a\nreal property but such a whole is not a genuine individual. The only\nreal individuals have no parts. So, while Locke and Collins agree with\nClarke that matter is infinitely divisible, they disagree on the role\nthat organization plays in producing real, unified wholes that have\nparts. Clarke holds that organization cannot unify such wholes into\nindividuals, and Locke and Collins hold that it can, both at a time\nand over time; notably in cases of living things, where the matter\ncomposing that individual changes while the organization\npersists. Clarke holds that as soon as a whole loses or gains a single\nparticle it becomes a different substance.\n\nIn his “Reply to Mr. Clarke’s Defense of A Letter to Mr.\nDodwell” Collins challenges the enumeration of categories of\nproperties with which Clarke seeks to prove that consciousness cannot\nbelong to a material system (Clarke 1738: Vol. 3: 751; 767–70;\nClarke and Collins 2011: 69–72). He continues to maintain that\nconsciousness is a real emergent property. He also challenges the\nIndividual Power Principle.\n2.2.2 Real emergent properties\n\nIn responding to Clarke’s Defense, Collins claims that Clarke\nhas not properly enumerated the kinds of properties. He claims that\nClarke needs to show that his enumeration is complete but has not done\nso. There may be powers unknown to Clarke that need to be included in\norder to give a complete enumeration of the properties and powers of\nmatter. In order to effectively defend his materialist account of\nconsciousness, however, Collins points out a new class of properties\nthat are arguably real and that are emergent and do not fit\nClarke’s composition model for real properties of matter.\n\nCollins’ chief strategy for showing that there are real emergent\nproperties is likely derived from Locke’s claim in the Chapter\n“Of Identity and Diversity” in the Essay that\nliving things are individuated not by the matter that composes them at\na time but by their functional organization (Locke 1975: ii. xxvii\n3–4: 330–331; see also Attfield 1977:\n 52).[4]\n\nCollins begins by considering the different roles that matter and\norganization may play in producing all the different kinds of things\nin the universe. He starts with the hypothesis that different parts of\nmatter are different from one another. If this is so the particles of\nmatter may work in the way different parts of a clock work—the\nparts of the clock are different from one another and consequently\nhave different powers. The whole to which they contribute will have\npowers that none of the parts have (Clarke 1738 [1928: 768]; Clarke\nand Collins 2011: 72). The second hypothesis Collins puts forth is\nthat all matter is the same and therefore completely interchangeable.\nCollins prefers this hypothesis because it makes it easy to argue that\nall of the differences between the various kinds of things are a\nresult of their organization. The distinction between matter and its\norganization is useful for Collins’ purposes because the\nproperties that result from the organization of matter are different\nfrom the properties of the particles. As Collins notes:\n\n\n…if the powers of a System of Matter may intirely cease upon\nthe least Alteration of a Part of that System, it is evident that the\nPowers of the System inhere not in the Parts in the same Sense with\nMagnitude and Motion: for divide and vary the Parts of Matter as much\nas you will, there will be Magnitude and may be Motion; but divide or\nvary the least Part of the Eye, and the Power of contributing to the\nAct of Vision is intirely at an end. (Clarke 1738 [1928: 768]; Clarke\nand Collins 2011: 72)\n\n\nThe organization of the eye is essential to its proper functioning and\nindeed to it being an eye at all (Clarke 1738 [1928: 769]; Clarke and\nCollins 2011: 72). It is an emergent property. Collins does not\nexplicitly make the point that since the organization of the eye is an\nessential property it must also be a real property. Perhaps he thought\nthis obvious. Clarke’s response was to claim that the power of\nthe eye to see is a fictional and not a real property (Clarke 1738:\n790]; Clarke and Collins 2011: 100).\n\nSerious engagement with emergent properties did not really take place\nuntil the nineteenth and twentieth centuries. There are now a variety\nof different versions of emergentism, both scientific and\nphilosophical, many of which bear hardly any resemblance to Collins\naccount of properties had by wholes which are not had by the parts of\nthat whole. However, in an article “Aggregativity: Reductive\nHeuristics for Finding Emergence” William Wimsatt describes a\nversion of the distinction between emergent and non-emergent\nproperties, coming from Complexity theory, that both improves on and\narticulates the insight that makes Collins’ account so\ninteresting, though Wimsatt was unaware of the historical precedent\n(Wimsatt 1997 [2008]). That insight is that properties that are a\nresult of the organization of parts are essentially emergent. Even if\nthey can ultimately be explained, this will not change their status as\nemergent properties (see also Uzgalis 2018: 272).\n2.2.3 Personal Identity\n\nThe topic of personal identity comes up as early as Clarke’s\nSecond Defence of an Argument because Clarke objects to consciousness\nbeing an emergent property of the brain and also objects to the brain\nbeing the bearer or seat of personal identity (Clarke 1738 [1928:\n787]; Clarke and Collins 2011: 96). Correspondingly, there are\nimportant connections between Collins’ account of emergent\nproperties and his account of personal identity. Consciousness, for\nCollins is both an emergent property and constitutive of personal\nidentity. In addition, Collins claims that because of the mind-body\nproblem, dualist views do not serve the ends and purposes of religion.\nClarke replies that it is Collins’ materialist views that not\nonly are useless, but have dangerous consequences for the ends and\npurposes of religion. Many of these consequences have to do with\npersonal identity.\n\nWhat are the connections between Collins’ account of emergent\nproperties and his account of personal identity? The most important\nconnection is the Lockean distinction between the matter that composes\na material thing at any given time and the organization of matter. The\ndistinction comes from Locke’s account of the individuation of\nmasses of matter and living things in his chapter “Of Identity\nand Diversity” in Book II of the Essay Concerning Human\nUnderstanding. A mass of matter is individuated by the particles\nthat compose it, however organized. If the mass gains or loses a\nsingle particle it becomes a different substance. Living things, by\ncontrast, are individuated by their functional organization (Locke\n1690: II. xxvii 3 [1975: 330). Collins’ summary of his views on\nidentity and personal identity make it clear that he agrees almost\ncompletely with Locke’s account of identity and the\nindividuation of masses, living things and persons (Clarke 1738 [1928:\n875]; Clarke and Collins 2011: 231–232). But Clarke insists that\nin order for something to remain the same, it must remain the same\nsubstance. In the case of material things like oaks, this means that\nthe matter that composes it must remain the same or it is not the same\noak. Only atoms, souls and God fulfill this same substance condition\nfor Clarke. So, oaks are only identical in a fictional sense. In\naddition, it is not possible for any entity to have the same\nproperties it had previously if its substance has changed, because it\nis not possible to transfer properties from one substance to another\n(Clarke 1738 [1928: 798]; Clarke and Collins 2011: 113). So, just as\nClarke holds that emergent properties are fictional, so he holds that\nany identity not based on identity of substance is fictional. The\nclash between the two over the metaphysical importance of organization\nis fundamental to their different views of emergent properties,\nidentity, and personal identity.\n\nCollins accepts Locke’s revolutionary view that consciousness\nand not the substantial soul is the bearer of personal identity. Again\nagreeing with Locke, he regards memory as crucial to personal identity\nand feelings of pleasure and pain as important concomitants of\nconsciousness. Still, Collins’ account of personal identity is\nnot exactly the same as Locke’s. Locke’s account is\nofficially neutral in regard to whether “the substance that\nthinks in us” is material or immaterial, simple or compounded\n(Locke 1690: II, xxvii. 17 [1975: 341). Collins, by contrast, is\ngiving an account that makes “the substance that thinks in\nus” material and compounded. But the neutrality of Locke’s\naccount of personal identity ought to allow Collins to adopt it\nwithout significant change, and this is what he does. Collins also\ndefends the view against attacks addressed to the concept of memory\ninvolved. Clarke holds that Collins’ account of memory violates\na basic principle of Clarke’s substantialist account of\nidentity—that properties cannot be transferred from one\nsubstance to another. So, if the particles of the brain have changed,\na memory cannot be a veridical memory of that new substance. Locke and\nCollins,by contrast hold that representations of events can be\ntransferred from one substance to another and these constitute genuine\nmemories (Clarke 1738 [1028: 787]; Clarke and Collins 2011: 96).\n\nCollins’ response to this is to claim that annexing\nconsciousness to the brain explains the phenomena of consciousness far\nbetter than positing an unchanging immaterial substance. There is also\na perfectly reasonable sense for properties to be transferred from one\nsubstance to another. In his Reflections on Mr. Clarke’s Second\nDefence he writes:\n\n\nFor if we utterly forget, or cease to be conscious of having done many\nthings in former Parts of our Lives which we certainly did, as much as\nany of those which we are conscious that we have done; and if in fact\nwe do by degrees forget everything which we do not revive by frequent\nRecollection, and by again and again imprinting our decaying Ideas;\nand if there be in a determinate Time a partial or total flux of\nParticles in our Brains: What can better account for out total\nForgetfulness of some things, our partial Forgetfulness of others,\nthan to suppose that the Substance of the Brain in constant Flux?\n(Clarke 1738 [1928: 787 and 809]; Clarke and Collins 2011: 130)\n\n\nAs for the problem of transferring consciousness from one substance to\nanother he writes:\n\n\nI will suppose myself conscious at Forty of having been carried to a\nMarket or Fair at Five Years old, without any Particle of Matter about\nme, the same which I had at that Age: now in order to retain the\nConsciousness of that Action, it is necessary to revive the Idea of it\nbefore any considerable Flux of Particles, (otherwise I must totally\nlose the Memory of it (as I do of several things done in my Childhood)\nand by reviving the Idea of that Action, I imprint afresh the\nConsciousness of having done that Action, by which the Brain has a\nlively an Impression of Consciousness (though it be not entirely\ncomposed of the same Particles) as it had the day after it did the\nAction…. (ibid.)\n\n\nThis account of how memory works nicely fits the model of the\npreservation of an organization through a change of matter that Locke\nuses to explain the identity of living things. However, Clarke does\nnot accept this explanation because he holds that only a theory of the\nsubstantial soul can provide the underpinnings for an account of\nveridical memory (Clarke 1738 [1928: 787; Clarke and Collins 2011:\n180).\n2.3 Evaluating the Clarke Collins Correspondence\n\nOne might ask who won the debate? In the eighteenth century, the\nanswer largely depended on whether you were a dualist or a\nmaterialist. If you were a dualist you saw Clarke as the winner. If\nyou were a materialist you saw Collins as the winner. In her 2009\narticle focusing on Collins’ emergentism, Marleen Rozemond gives\nan account of the way she thinks the dialogue proceeded and concludes\nthat Clarke was the victor. She holds that Collins, in fact, conceded\na crucial point and as a result subsequently changed his position.\n\nIn order to understand why she thinks this we need to grasp the\ndistinction Collins makes between numerical and generical powers in\nhis “Reflections on Mr. Clarke’s Second Defence of his\nLetter to Mr Dodwell”. He writes: \n\n\nBy numerical powers I understand such powers as motions and\nfigures of the same species. The power of the eye to contribute\ntowards seeing is a species of motion, and the roundness of a body is\na species of figure. By generical powers I understand all the\nseveral species of numerical powers—as motion signifies\nall the various species of motion, and figure all the various species\nof figure. (Clarke 1738 [1928: 805–806]; Clarke and Collins\n2011: 124–125) \n\n\nRozemond notes that after making this distinction Collins admits that\nall generical powers conform to the Homogeneity Principle. In her 2008\narticle, Rozemond claims that Locke did not accept that emergent\nproperties are possible, because in his proof for the existence of God\nin Chapter 10 of Book IV of An Essay Concerning Human\nUnderstanding he invokes the Homogeneity Principle to show that\nan eternal and Intelligent Being could not be created by matter\n(Rozemond 2008:163). In fact, Clarke draws Collins’ attention to\nthis very passage in the Essay (Clarke 1738 [1928: 837]; Clarke and\nCollins 2011: 170–171). If this were the only reference to the\nHomogeneity Principle in the Essay it would be difficult to see how\nLocke could also maintain that it would be possible for God to cause\nmatter to think even if it were arranged in the right\nway. Clarke’s point to Collins is that on this basis he should\ngive up the idea that thinking matter is possible. I take it that this\nis Rozemond’s point as well and she holds that in saying that\nthe Homogeneity Principle applies to all generical powers, Collins is\nconceding the crucial point.\n\nRozemond notes that there is one other way that Collins could have\nproceeded. \n\n\nOne way to reject Clarke’s position is to reject his qualitative\nconstraints on causation. One could do this by becoming a Humean about\ncausation. Collins did not do this and the world had to wait another\nwhile for Hume. (Rozemond 2009: 186–7) \n\n\nSo, on her view, Collins gives up the possibility of emergent\nproperties and does not have the kind of empiricist theory of\ncausality that Hume has. And there seem to be no other alternatives.\nShe claims that after this Collins substantively changes his position\nby suggesting that consciousness is a mode of motion. She takes this\nto be a quite unattractive version of mind-brain identity theory\n(Rozemond 2009: 187).\n\nThere is, however an alternative view of how the Correspondence ends.\nThis view is that Collins has not changed his position, or at least\nnot changed it in the way Rozemond suggests. He is conceding nothing\nto Clarke. In introducing the distinction between numerical and\ngenerical powers he writes that \n\n\nhaving set forth the entire strength of what can be said against my\ninstances, an answer to it will set this dispute in a clearer light\nthan possibly it has hitherto been, and perhaps give Mr.\nClarke particular satisfaction with relation to the\ninconclusiveness of hiss argument, by detecting what I conceive has\npreviously imposed upon him. (Clarke 1738: [1928: 805], Clarke and\nCollins 2011: 124) \n\n\nHis response to Clarke’s attack on his examples is to make the\ndistinction between numerical and generical properties. This is hardly\nthe words of someone who is about to concede the decisive point being\ndebated.\n\nThere are a couple of possibilities about what Collins has in mind for\nnumerical powers. One is that numerical powers would include both\npowers that conform to the Composition Principle (figure and motion),\nand powers that do not (the power of the eye to see). Generical\npowers, by contrast, simply treat powers that are numerically\ndifferent (such as different kinds of motion) just as motions. Thus,\nall material powers, treated as generical, conform to the Homogeneity\nPrinciple (Clarke 1738 [1928: 806–807]; Clarke and Collins 2011:\n28–30).\n\nThe second possibility, which is what the examples Collins gives\nreally suggest, is that all numerical powers are emergent and do not\nconform to the Composition Principle. All generical powers, on the\nother hand, do conform to the Homogeneity Principle. If the second\ninterpretation is true, Collins thinks that all of Clarke’s\nfirst category powers, or at least his favorite ones, can be treated\nas wholes that have properties not had by the parts. This would indeed\nbe a change of position, but in just the opposite direction to the one\nthat Rozemond supposes. But, even on this second interpretation, all\ngenerical properties conform to the Homogeneity Principle. So, why\nisn’t Collins in trouble in the way Rozemond claims? The answer\nis that the use of the Homogeneity Principle in Locke’s proof\nfor the existence of God is not the only reference to that principle\nin Locke’s Essay.\n\nIn replying to Clarke in “An Answer to Mr. Clarke’s Third\nDefense of A Letter to Mr. Dodell”, Collins points out to Clarke\nthat Locke had distinguished two situations involving the Homogeneity\nPrinciple (Clarke 1738 [1928: 868]; Clarke and Collins 2011:\n220–221). In the proof for the existence of God as an immaterial\nintelligence, the Principle applies in full force to show that matter\ncould not create an eternal, immaterial, intelligent being. The second\ncase is the creation of human thought. In this second case, Locke\nsupposes that an omnipotent, immaterial God exists and that God,\nbecause He is omnipotent, could violate the Principle of Homogeneity.\nIn fact, Locke claims that God has in fact done so – in the case\nof secondary properties, such as color and sound, where what is\nproduced in the mind bears no resemblance to the causes of those ideas\nin the material world or motions in the brain. Thus, Locke holds,\nthere is good reason to think that God could produce thinking\nmatter. He is explicit that there is no contradiction between the two\ncases, knowing as he did that some people thought his use of the\nHomogeneity Principle in the proof for the existence of God ruled out\nthe possibility of thinking matter (Locke 1690: IV. iii. 6 [1975:\n541).  Collins adopts this position as well (Clarke 1738 [1928: 837];\nClarke and Collins 2011: 170–171; see also Uzgalis 2018:\n270–271). If this is right Collins can continue to maintain that\nemergent properties are possible as they are all numerical properties\nand so need not conform to the Homogeneity Principle and actually\nexist and that God’s omnipotence allows him to make matter duly\narranged to think. Clarke, in his next Defense, rejects both\nCollins’ distinction between numerical and generical powers and\nthe Lockean distinction concerning the Homogeneity Principle (Clarke\n1738 [1928: 829–830]; Clarke and Collins: 158–159). He\nclaims in respect to the Homogeneity principle that the reasoning is\nthe same in both cases. Clarke’s view is that even an omnipotent\nGod cannot violate the Homogeneity Principle (Clarke 1738: 901; Clarke\nand Collins 2011: 268–269). As a consequence, he holds that\nemergent properties are not possible, nor can matter think. So. on\nthis alternative view of who won the debate, if the criteria for\nvictory is a concession by one side or the other, the Correspondence\nends not in a victory for Clarke, but in a stand-off. \n\nIn evaluating the controversy, one would have to say that of all the\nencounters between the Newtonians and the free thinkers, the one\nbetween Collins and Clarke was the most philosophically significant\nand influential. O’Higgins holds that Collins is important to us\nmainly because he defends an early version of materialism. While there\nis surely some truth to this, O’Higgins is clearly damning\nCollins with faint praise. What we should recognize is that Collins\nwas indeed a pioneer in trying to show that consciousness is a real\nemergent property of the brain and in this regard certainly showed\nmuch more originality than O’Higgins gives him credit for (see\n note 2).\n One need only compare Locke’s claim that we would need\nrevelation to understand how matter could think and his use of the\nterm ’superaddition’ with Collins account of emergent\nproperties to see what an improvement in explanatory power the latter\nhas over the former. O’Higgins also claims that Collins’\narguments are not very good. This also does not give Collins enough\ncredit. It is true that Collins does give some arguments that are not\nvery good. On the other hand, Collins forced Clarke to clarify his\nposition in a number of respects. He also uncovered a number of weak\npoints in Clarke’s position. Clarke’s poor treatment of\nCollins’ example of the power of a rose to produce a sweet smell\nin us is one example. He answered as if Collins was talking about the\nsmell of the rose and claims that this secondary quality belongs in\nhis second class of properties. But Collins properly objects that he\nwas talking about the organization of the particles of the\nrose—the cause of this effect, and not the effect on us.\nClarke’s response is weak. One of Collins’ strongest\npoints was his critique of Clarke’s doctrine that though the\nsoul is immaterial it is extended (Vailati 1993). One can also see how\nmuch pressure Collins is applying to Clarke’s system as the\nnumber of properties in Clarke’s third class—fictional\nproperties—continues to mount in the course of the\ncorrespondence.\n\nIn respect to the central issues of the debate, Collins is struggling\nto articulate a materialist and empiricist metaphysics that can\ncompete with the well developed dualist, a priori metaphysics\nthat Clarke deploys. As Barresi and Martin comment: \n\n\nHis faltering, but often successful attempts to reformulate\ntraditional metaphysical issues empirically, embodies the birth pangs\nof a new approach. (Martin and Barresi 2000: 51) \n\n\nBut perhaps most strikingly, Collins is attempting to defend a\ndoctrine of emergent properties that does not become prominent in\nEnglish philosophy until Mill’s System of Logic (1843)\nand the twentieth century British Emergentism movement.\n3. Determinism and Free Will\n3.1 Background\n\nCollins deals in passing with determinism and freedom of the will in\nthe 1707–08 correspondence with Samuel Clarke and in his 1707\nbook An Essay concerning the Use of Reason. His A\nPhilosophical Inquiry Concerning Liberty of 1717 is entirely\ndevoted to the issue. From the beginning, Collins is a determinist\nwith a compatibilist account of free action (Clarke 1738 [1928: 872];\nClarke and Collins: 226–227). Clarke attacked Collins’\ndeterminism in the 1707–08 correspondence. He also reviewed the\n1717 book and defended a doctrine of libertarian free will as he had\nin the earlier correspondence.\n\nSince the nature of human choices and actions are central to debates\nabout free will and determinism there is a close connection between\npositions about these issues and positions about consciousness and\npersonal identity. The kind of determinism that Collins advocates is a\nnatural extension of his materialist, empirical, and naturalistic\naccount of consciousness. In his account of consciousness, Collins\nmakes the pursuit of pleasure and the avoidance of pain the most basic\nmotives of action. This makes happiness and misery necessary\nconcomitants of consciousness, and thus conscious beings are endowed\nwith a desire for happiness. This is true as much of animals as it is\nof human beings and accounts for a large number of similarities in the\nbehavior of humans and animals. Collins holds that if the behavior of\nanimals is determined, then that of humans must be as well. \n3.2 Determinism in Collins’ early works\n\nIn the Clarke Collins correspondence of 1707–08 Collins claims\nthat Clarke’s argument for dualism is useless to religion and\nmorality because of the problem of explaining how the immaterial mind\nand the material body interact. One of Clarke’s counter-charges\nis that Collins’ materialism is not just useless but dangerous\nto religion and morality because it implies a determinism that is\ndestructive of religion and morality (Clarke 1738 [1928: 831], Clarke\nand Collins: 192).\n\nCollins claims that human action is caused in much the same way as the\nactions of clocks. Both are necessary agents, though the causes that\nproduce the action, in either case, are very different. \n\n\nBoth are necessarily determined in their Actions: the one by the\nAppearances of Good and Evil, the other by a Weight or Spring. (Clarke\n1738 [1928: 872]; Clarke and Collins 2011: 226) \n\n\nCollins also attacks the free will position. He holds that the same\ncauses will always produce the same effects and claims that the free\nwill explanation of being able to do otherwise violates this basic\nprinciple of causal explanations (Clarke 1738 [1928: 873 and 874];\nClarke and Collins 2011: 227 and 230).\n\nCollins also expressed determinist views in his first\nbook—An Essay Concerning the Use of Reason, 1707. He\ndoes this in the context of the problem of reconciling God’s\nforeknowledge with human free will. As O’Higgins puts it: \n\n\nHe solved the problem to his own satisfaction by saying that all\nthings, including human choices, are determined in their causes and as\nsuch can be foreseen by an all-knowing God. (O’Higgins 1976: 6)\n\n\n\nThis view also plays a role in Collins’ 1710 critique of\nArchbishop King’s views about the problem of evil and the\nepistemological status of the attributes of God. King claimed that\nGod’s attributes, including his foreknowledge of events, was\nanalogical. In the case of God’s foreknowledge, he did this to\navoid contradictions between God’s knowing what was to come and\nthe contingency of events and human free will. Collins is content to\nreject human free will and to suppose that ‘foreknowledge’\nhas a univocal meaning when used with reference to God or humans.\n3.3 A Philosophical Inquiry Concerning Human Liberty, 1717\n\nAt the beginning of his discussion of Collins and determinism Jacopo\nAgnesina remarks: “Determinism is the aspect of Anthony Collins\nthought that has always met with the most success” (Agnesina\n2018: 97). In A Philosophical Inquiry Concerning Human\nLiberty Collins briefly states his position. He rejects the view\nthat there is any freedom from necessity and claims that insofar as\nthere is human freedom it is “liberty or freedom from outward\nimpediment to action”. Such freedom is compatible with\nnecessity. Collins holds that every action has been caused and must\nnecessarily have occurred. The future is as much determined as the\npast. He then gives six arguments for this form of determinism.\n\nThe first of Collins’ arguments has to do with experience.\nDefenders of free will hold that the experience of even ordinary\npeople shows that they choose freely. Collins’ response is much\nthe same as that of Hobbes and Spinoza. He claims that those who say\nsuch things are either not attending to, or not seeing, the causes of\ntheir actions. Collins goes on to claim that some defenders of free\nwill admit that the issues are tangled and not to be resolved by\nappeals to vulgar experience (Collins 1717: 12–31 [1976:\n60–69]).\n\nWilliam Rowe notes that Collins and Clarke share a volitional theory\nof action. Rowe describes the theory in this way: \n\n\nAccording to this theory, actions are of two sorts: thoughts and\nmotions of the body. What makes a thought or bodily motion an action\nis its being preceded by a certain act of will (volitions) which bring\nabout the thought or motion. Volitions, then, are “action\nstarters”. (Rowe 1987: 54) \n\n\nRowe also notes that Collins and Clarke share the assumption that if a\nvolition is causally determined then the person doing the act does not\nhave free will (Rowe 1987: 53). Rowe says that as the two antagonists\nagree on these points, they play little or no part in the debate. But\nthey do explain the strategy that Collins uses to argue that\nexperience actually shows that we are determined. He examines\nexperience under four topics relating to choice and action: (1)\nPerception of Ideas; (2) Judging of Propositions; (3) Willing; and (4)\nDoing as we will. Collins argues that each of these is causally\ndetermined.\n\nHe holds that perception of ideas of sensation and reflection are not\nvoluntary. So, perception can hardly be free. In respect to judging,\nhe claims that we judge in terms of how things appear to us and that\nwe can’t change these appearances. In respect to the will, he\nclaims that there are two questions to be considered. One is whether\nwe are at liberty to will or not. The second is whether we are at\nliberty to will “one or the other of two or more objects”.\nIn respect to the first question, he claims that Locke made a mistake\nin holding that people are at liberty to will because they can suspend\nwilling. So, Collins holds that Locke’s answer to the first\nquestion would be affirmative. Collins claims that suspense of willing\nis as much an act of will as any other. So, his answer is negative. In\nrespect to the second question, Collins argues for a value determinism\nthat makes the answer to the second question negative as well. In\ndefining willing, he remarks: “Willing or preferring is the same\nwith respect to good and evil, that judging is with respect to truth\nor falsehood”. So, if something seems better than the\nalternatives we will choose it. Collins is thus a moral determinist\nwho holds that we must do what seems best to us. In giving his\nnegative answer to his second question, Collins is also rejecting the\nclaim that we could have done otherwise in cases where we have decided\nwhich of the alternative choices is best (Collins 1717: 31–40\n[1976: 69–73]). Collins then proceeds to consider cases where we\ncan see no difference between the objects we are to choose among,\ne.g., which of two eggs we will take. Collins’ response is\nthat:\n\n\nIt is not enough to render things equal to the will, that they are\nequal or alike in themselves. All the various modifications of the\nman, his opinions, prejudices, temper, habit, and circumstances, are\nto be taken in and considered as causes of the election no less than\nthe objects without us among which we chuse; and these will ever\nincline or determine our wills, and make the choice we do make,\npreferable to us, though the external objects of our choice are ever\nso much alike to each other. (Collins 1717: 47 [1976: 77])\n\n\nIf one were truly indifferent one simply would not choose. But once\nthere is a will to choose, the cascade of causes that leads to action\nwill determine the choice one way or the other. What Collins means by\n“doing as we will” is what we do consequent to willing.\nHere again, he finds no freedom from necessity. We do what we have\nwilled unless some external impediment or intervening cause hinders us\nfrom doing so. Finally, he compares the actions of animals to those of\nmen. He claims that while animals are supposed to be necessary agents\nand humans free agents, there is no perceivable difference between\ntheir actions that would allow us to make this distinction (Collins\n1717: 53–57 [1976: 80–82]).\n\nCollins’ second argument is that man is a necessary agent\nbecause all his actions have a beginning. He holds that whatever has a\nbeginning has a cause and all causes are necessary. Collins (as he had\nin the Clarke Collins controversy) also rejects the proposition that\nthe same causes could produce different effects. Thus Collins rejects\nthe doctrine of free will because it violates the basic principle of\ncausal explanations. The third argument claimed that liberty is an\nimperfection. Going back to judging propositions, Collins points out\nthat if we were free, we would be able to judge probable what is\nimprobable, and so on. This is the analog of moral determinism to the\nepistemic realm. Just as we are not free to knowingly choose the worse\nover the better, we cannot affirm that what seems improbable to us is\nprobable. If we could we would be worse off than we are. The fourth\nargument is that liberty is inconsistent with God’s\nforeknowledge. This is again similar to the view that Hobbes held and\nrepeats the assertions of Collins’ first book An Essay\nconcerning the Use of Reason. The fifth is that if man were not a\nnecessary agent, and determined by pleasure and pain, there would be\nno foundation for rewards and punishments. The sixth is that if a man\nwere not a necessary agent he would be ignorant of morality and have\nno motive to practice it. These last two arguments make the point that\ncausality is necessary for the operation of morality in the world, and\nto introduce a causeless free will is to make the teaching of morality\nor its motivation by punishment or reward pointless (Collins 1717:\n57–108 [1976: 82–108]).\n\nJames Harris and Jacopo Agnesina have both argued that the An\nInquiry Concerning Human Liberty was in fact a response to Dr.\nClarke and rational theology. They claim that Collins was attempting\nto demonstrate that determinism follows from Clarke’s first\nprinciples (Agnesina 2011, 2018: 105; Harris 2005: 58). Agnesina has\nalso been at pains to argue that Collins’ determinism is a\nlogical and not just a causal determinism.\n\nAgnesina characterizes the distinction between these two kinds of\ndeterminism in this way. Causal determinists maintain: \n\n\n…that present and future events are determined causally by\ntheir antecedents. This theory has its roots in the principle of\ncausality or the principle of sufficient reason: all events\nhave a sufficient cause that determines them. Thus causal determinism\nexcludes events that arise ex abrupto, but without stating\nthat this is the only possible and conceivable world: unrealized\npossibilities exist that, though they are not logically contradictory,\ncannot come about because they are incompatible with the law of\nnature, that is with the causal chain of events of this world.\nNecessitarianism strengthens causal determinism from just this latter\nstandpoint: all unrealized possibilities are excluded and it is held\nthat the current law of nature is the only possible one. (Agnesina\n2018: 98)\n\n\nIn this regard, he thinks Collin’ position is that of a logical\ndeterminist, and so close to that of Spinoza. O’Higgins claimed\nthat it was possible that Collins did not understand the Spinozistic\nimplications of his position (Collins 1717 [1976: 45 note 114]).\nO’Higgins seems to be suggesting that Collins, if he read\nSpinoza’s  Ethics, might have been confused by the\nbook, even though Collins had also read the critiques of Spinoza by\nPierre Bayle and G. W. Leibniz. Agnesina counters that even if Collins\nhad not read the Ethics, he had read the critiques of Spinoza\nby Bayle and Leibniz and that these critics of Spinoza had clearly\nspelled out the implications of the kind of logical determinism that\nCollins seems perfectly willing to adopt (Agnesina 2018:\n120–125). One problem with taking Collins to be a logical\ndeterminist is that Collins is a compatibilist, thus regarding freedom\nas freedom from outside obstruction. But it would seem that while\ncompatibilism is possible under causal determinism; it is not under\nlogical determinism. But, Hobbes too claimed to be a compatibilist and\nhad the same kind of tendencies towards logical determinism that\nCollins has.\n\nInterestingly, there was only one response to Collins’ book in\nEngland. Samuel Clarke reviewed it and argued that the notion of a\n’necessary agent’ was incoherent, for to be an agent one\nmust be active and Collins’ position was that the humans are\ncompletely passive and thus (in Clarke’s sense) not agents at\nall. Clarke charges that in discussing being able to do otherwise,\nCollins fails to distinguish between physical and moral necessity (see\nHarris 2005: 59). Clarke also complained that Collins treated\nperception as actions, when in fact, perception is passive (Clarke\n1738 [1928: 722]). Clarke develops his own account of free will\narguing that motives, pleasures and pains, reasons and arguments, are\nsimply occasions for the self-moving power that is active to freely\ndetermine action. What we have again is a competing set of\nexplanations for the same phenomena. It appears that Clarke failed to\ntake a number of Collins’ arguments seriously, because the free\nwill arguments being refuted were not his arguments.\n\nIn a series of letters, Collins discussed Clarke’s review of his\nbook with his long time friend and collaborator Pierre Desmaizeaux. He\nhad written up a reply. Eventually, however, Collins concluded that\nClarke had been threatening him with civil action, and that to reply\nwould provide Clarke with the opportunity to do so (Dybikowski 2011:\n260–1, 269 and 281). Consequently, Collins made no reply to\nClarke’s review.\n\nIn 1729 a short book, A Dissertation of Liberty and\nNecessity, with the initials A.C. on the title page, was\npublished. For a number of reasons O’Higgins holds that Collins\nis not the author of this work. O’Higgins first reason for\nrejecting Collins’ authorship is that the book treats the\nsubstance of the soul as unknown—a Lockean doctrine that Collins\nhad rejected. O’Higgins also cites contemporary reviews that\nclaim the arguments of the book are weak compared to the\nInquiry. Jacopo Agnesina agrees with O’Higgins that the\nwork is not by Collins and gives a full discussion of the argument\nover attribution (Agnesina 2018: 125–132, see also Harris 2005:\n60). Still while making claims that Collins would not make about the\nsoul and substance, the arguments are certainly consistent with the\ndeterminist position that Collins was holding in the earlier work. The\nauthor also takes into account at least one of Clarke’s\ncriticisms of the Inquiry.\n\nThe author of A Dissertation remarks that he will \n\n\nattempt to solve the Point of Free Will, by tracing the progress of\nthe Soul through all its Operations which we are conscious of, and\nexamining in each whether “tis Active or Passive”.\n(Collins 1729: 1) \n\n\nThe point is that at every stage in the process, from perception to\naction, we are passive. The author apparently accepted Clarke’s\npoint in his review of Collins’ Inquiry that perception\nis not an action, for he calls it not an ‘action’ but an\n‘operation.’ The author explicitly takes up Clarke’s\nviews when he argues that we are passive in judgment. He quotes Clarke\nat length. Clarke holds that judgment is passive but distinguishes\nbetween judging and acting. The author continues: \n\n\nBut I conceive the doctor here begs the Question, by asserting the\nSelf-motive Power in the Soul without proving it, and then reasons\nfrom it as granted to him. (1729: 6) \n\n\nThe author of A Dissertation thus returns to Clarke a charge\nthat Clarke had made about Collins in his 1717 review of A\nPhilosophical Inquiry Concerning Human Liberty.\n4. Collins, Deism and Freethinking\n\nThe seventeenth and early eighteenth century in England saw a\nrationalist treatment of theology that spanned many competing groups\nfrom the Latitudinarians to the Dissenters to the Deists. Samuel\nHefelbower in The Relation of John Locke to English Deism\nremarks that among the progressives—theologians, philosophers\nand deists—all accepted a rationalistic religion. The question\nthen becomes what exactly is the role of reason vis à vis\nrevelation. The discussion of the relation of reason to revelation\ngoes back at least to Albertus Magnus and Thomas Aquinas—that is\nto the scholastic authorities. Albert held that reason has a role to\nplay in religion, but there are questions where philosophy has no\nfinal answer and revelation must decide. Revelation is above reason\nbut not contrary to it. Thomas has a similar position (Hefelbower\n1918: 47). Locke holds that reason is responsible for determining what\ncounts as a genuine revelation. Locke also holds the view that there\nis revelation that tells us about things above reason but not contrary\nto it. \n\n\nThus that part of the Angels rebelled against GOD, and thereby lost\ntheir first happy state: And that the dead shall rise, and live again:\nThese, and the like, being beyond the Discovery of Reason, are purely\nmatters of Faith, with which Reason has directly, nothing to do.\n(Locke 1690: IV. xviii. 7. [1975: 694]) \n\n\nThe Deists tend to hold a more radical view than the one that Locke\nadvocates.\n\nSamuel Clarke in his Boyle lectures of 1704 distinguishes four grades\nof deists. First there were those who acknowledged a future life and\nother doctrines of natural religion. Second were those who while\ndenying a future life, admitted the moral role of the deity. Third are\nthose who acknowledged providence in natural religion, but not in\nmorality. And finally, those who denied providence altogether. Where\ndoes Collins fit, in these grades of deism? According to\nO’Higgins: \n\n\nIn his books, Collins came to emphasize the part that morality should\nplay in religion and to assert the importance of natural religion.\n(O’Higgins 1970: 40) \n\n\nCollins claims to believe in a future life (if not natural\nimmortality). Collins rejects Revelation. So, if O’Higgins is\nright, Collins fits Clarke’s first grade of deists.\n\nDavid Berman has disputed this view, arguing that Collins is, in fact,\nan atheist (Berman 1988: 801). Jacopo Agnesina in his book The\nPhilosophy of Anthony Collins: Free Thought and Atheism strongly\nagrees with Berman. Agnesina’s strategy is to take the whole of\nCollins’ work and by putting the pieces together makes clear\nwhat the parts only partially display—Collins atheism (Agnesina\n2018: 192).\n4.1 An Essay Concerning the Use of Reason, 1707\n\nAn Essay Concerning the Use of Reason, Collins’ first\nbook, was published anonymously in 1707 a little before his Letter\nto Mr. Dodwell. The main thrust of the book is to reject\nreligious mysteries. Collins starts his approach to the issues of\nreligion and reason along the same lines that Locke does. He defines\nreason as “that faculty of the Mind, whereby it perceives the\ntruth, Falsehood, Probability or Improbability of Propositions”\n(1707 [1984: 3]). Propositions consist of words “which stand for\nIdeas concerning which some agreement is affirm’d or\ndeny’d” (1707 [1984: 3–4]). Thus he accepts\nLocke’s definition of knowledge. He also distinguishes in the\nway Locke does intuitive, demonstrative and probable truths, and\ntreats claims about revelation as probable propositions that largely\nderive from testimony. Perhaps one diversion from Locke is that\nCollins distinguishes between two different kinds of probability. The\nstronger kind resembles demonstration but the connection between ideas\nis merely probable. The weaker kind of probability is a testimony.\nCollins’ position is that a person is not expected to believe\nanything that is not comprehensible by the human intellect. So, if\nterms take on meanings that cannot be understood, humans cannot be\nexpected to believe them.\n\nO’Higgins sees a strong affinity between Collins’ book and\nJohn Toland’s Christianity Not Mysterious, which had\nbeen published in 1696. He quotes Toland’s remark that:\n\n\nWe hold that reason is the only foundation of all\ncertitude…that nothing reveal’d, whether as to its manner\nor to its existence, is more exempted from its disquisitions, than the\nordinary phenomena of nature…that there is nothing in the\ngospel contrary to or above it.\n\n\nO’Higgins claims that this is very much the position that\nCollins is taking in the Essay. In An Essay Concerning\nHuman Understanding Locke allowed that there were some truths\nthat were above reason but compatible with it. Some scholars regard\nthis as a mere verbal commitment to truths above reason, while others\nregard it as substantive. What is clear is that Locke would not accept\ntruths above and contrary to reason. On this point, Locke, Toland, and\nCollins are in complete agreement. Toland, however, has a more radical\nposition than Locke in that he rejects truths above reason, even where\nthese truths are compatible with reason (see Woolhouse 2007: 372).\nThus Toland would not accept the story of the rebellion of the angels\nor the claim that the dead shall rise. Collins, on the other hand,\nseems to hold the same position Locke does. He quotes with approval a\npassage from Robert Boyle who uses an analogy of a deep-sea diver to\nmake the distinction between above reason and contrary to reason\nplausible. If the diver asks you if you can see to the bottom of the\nocean and after you have declared that you cannot, brings up oysters\nwith pearls in them, you will have no objection to the claim that\nthere are oysters with pearls in them at the bottom of the sea. If, on\nthe other hand, the diver claims that the pearls he shows you are\nlarger than the shells containing them, “you would doubtless\njudge what he asserts contrary to the information of your eyes”\n(Collins 1707 [1984: 25–6]). This sounds like Locke’s\nposition. But Agnesina points out that Collins gives this analogy a\ntwist. He writes: \n\n\n…Collins reduces Boyle’s example to its conceptual\nscheme: it is simply a matter of acquisition of knowledge, not of a\ndifferent type or degree of knowledge. (Agnesina 2018: 149) \n\n\nThus Agnesina agrees with O’Higgins that Collins holds the same\nposition as Toland: there are no truths above or contrary to\nreason.\n\nTurning from analogy to theological doctrines, we find that Collins\nrejecting transubstantiation (1707 [1984: 24]). Collins also objects\nto the doctrine of the Trinity because it is not understandable and on\nsome interpretations involves contradictions. Acceptance of the\ndoctrine of the Trinity is the first of the Thirty-nine Articles to\nwhich an Anglican was supposed to subscribe. It is plain that Collins,\nlike Locke, Newton, Clarke, Whiston, Toland, and others, objected to\nthis article. Many of these men concealed their views about the\nTrinity and claimed that they were orthodox Anglicans.\n\nGiven that Collins rejects mysteries and the claims that there are\ntruths above reason why should we accept any part of Holy Scripture?\nCollins holds that it is on account of testimony. Collins writes: \n\n\nThere are ideas join’d in Propositions, which the Mind perceives\nto agree or disagree by the testimony of others. (Collins, 1707: 5)\n\n\n\nTestimony gives rise to a particular kind of knowledge,\nfaith. We learn about facts, current events, historical,\nscientific ones, and so on by having them communicated to us by\nothers. But testimony itself is not enough to produce faith or assent\nunless the people and events themselves are credible. Collins, like\nSpinoza in the Theological-Political Treatise concludes that\nthe writers of the Bible were not writing for philosophers, but\nadapted their expressions to the capacity of understanding of the bulk\nof mankind (Collins 1707: 14). Agnesina points out the similarity in\nCollins’ conclusions not only with Spinoza, but Locke, Le Clerc,\nRichard Simon, and Toland. He remarks that these similarities:\n\n\n…show what enormous pressure the Bible was subjected to in\nthose years. Freed from the Holiness that made it untouchable, it was\nnow minutely examined with the tools of philology. As may easily be\nimagined, this operation was exploited by the most radical thinkers,\nwho discredited its contradictions and inconsistencies, in order to\ngain credit for their own positions. From the opposing side, in a sort\nof contrasting action, the desire was growing to preserve the Bible\nand to ’update’ according to the findings of science.\n(Agnesina 2018: 151)\n\n\nBesides the kinds of pressure just noted, there was the act of\ntoleration which came along with the Glorious Revolution of 1688. The\nAnglican Church in the 1690s was on edge as it saw its revenues\nfalling and debates about the fundamental doctrines of the Church were\nat a fever pitch. Thus, the advent of the Boyle Lectures to defend the\nviews of the Anglican Church and show their compatibility with\nNewtonian science is hardly surprising.\n4.2 Analogical language\n\nIn A Vindication of the Divine Attributes, in some Remarks on His\nGrace the Archbishop of Dublin’s sermon intitled “Divine\nPredestination Consistent with the Freedom of Man’s\nWill”, (published in 1710) Collins takes on another way of\nevading his demand that whatever we believe must be comprehensible to\nus. This is the doctrine of analogy that goes back to St. Thomas\nAquinas. The form in which Collins finds it in the works of Archbishop\nKing of Dublin, is the doctrine that not only does God not have hands\nand feet and a beard in a literal sense, he does not have wisdom,\nbenevolence or justice in any sense that we can understand these\nterms. Thus King remarked: \n\n\nIt does not follow from hence, that any of these are more properly or\nliterally in God after the manner they are in us, than hands or eyes,\nthan mercy, than love or hatred are. \n\n\nCollins rejects the claim that God’s wisdom and benevolence\ncould have meanings that we do not comprehend. He asserts that\nGod’s knowledge and his attributes are univocal with ours\n(O’Higgins 1970: 63).\n\nDavid Berman in his A History of Atheism in Great Britain,\ngives a number of reasons to take Collins as an atheist rather than a\ndeist. He sees Collins’ account of the creation of matter ex\nnihilo in the Answer to Mr. Clarke’s Third Defence in the\nClarke Collins correspondence as an argument for atheism disguised as\nan argument against atheism (Berman 1988: 80–81). He sees\nCollins as using Bayle to raise the problem of evil in the\nVindication of the Divine Attributes and then showing that\nboth the solution offered by Bayle and Dr. King are unacceptable.\nCollins’ official position at the end of the\nVindication is that King is wrong but atheism is avoidable.\nBerman asks what the actual conclusion of the Vindication is.\nHe continues:\n\n\nIt is simply that there are very formidable, or insuperable,\ndifficulties in the theistic conception of God—revealed by the\nManichean problems—and that the latest attempt to cope with, or\nsolve, these difficulties, i.e. King’s theory, has failed; for\nthe medicine is as bad as the disease. But the disease remains!\n(Berman 1988: 84)\n\n\nCollins clearly rejects theism based on revelation. But one could also\nbe a theist based on arguments from natural religion. Berman sees the\nVindication as aimed at the heart of natural religion (1988:\n84). If this were so, we would have good reason to regard Collins as\nan atheist. On the one hand, Collins’ position about analogical\nlanguage may seem to strongly support natural religion. Insofar as the\nmeaning of the divine attributes is univocal with our use of the same\nwords about human beings, the analogy that natural religion relies on\nwould work at its best. (The basic analogy on which natural religion\ndepends is that humans are to the machines they make as God is to the\nworld.) Archbishop King’s position, on the other hand, would\ncompletely undermine the analogy. There is, however, a second\nconsideration. Insofar as the problem of evil is left unresolved in\nnatural religion, it would suggest that it can provide no effective\nanswer to this fundamental difficulty in theism. This is\nBerman’s point. O’Higgins, by contrast, claims that in the\nVindication Collins simply sets aside the problem of evil\n(O’Higgins 1970: 63).\n4.3 A Discourse of Free Thinking, 1713\n\nLike Locke, Collins is an advocate of the use of reason to determine\nreligious truths. One necessary condition for being able to think\nfreely is not to be persecuted for considering views that are\ndifferent from the accepted ones. Only in such an environment can one\ngenuinely consider alternatives. It must be possible to adopt\nwhichever of the possibilities turns out to be the most reasonable.\nCollins, like Locke, is committed to the view that one should\nproportion assent to a proposition on the basis of the evidence for\nit. Religious persecution aims to limit the possibilities and the\nevidence that one can consider. Though Collins was strongly\nanti-clerical, he does distinguish between good priests and bad\npriests. The good priests are the ones who advocate freedom of\nthought; the bad priests, on the other hand, are persecutors who want\nto prevent people from thinking through the truths of religion for\nthemselves. In his own time, Collins’ most controversial work\nwas his A Discourse of Freethinking (1714).\n\nConcerning the Discourse, J.M. Robertson writes that it \n\n\n…may be said to sum up and unify the drift not only of previous\nEnglish freethinking, but of the great contribution of Bayle, whose\nlearning and temper influence all English deism from Shaftesbury\nonward. (Robertson 1915: 123) \n\n\nPerhaps the motto of A Discourse of Free-Thinking ought to be\n“Where experts disagree, any person is free to reason for\nthemselves”. Collins is chiefly concerned with religion, so the\nvast bulk of the disagreements he cites have to do with religious\nissues, from whether one religion is better than another, down to the\ndetails of Anglicanism. Looking at conflicting claims often leads to\nskepticism. Where exactly this approach leads Collins is a question\nthat we will have to consider.\n\nIn A Discourse of Free-thinking Collins defines free-thinking\nas \n\n\nThe Use of the Understanding, in endeavouring to find out the Meaning\nof any Proposition whatsoever, in considering the nature and Evidence\nfor or against it, and in judging of it according to the seeming Force\nor Weakness of the Evidence. (Collins 1713 [1984: 5) \n\n\nCollins claims that we have a right to think freely. Richard Bently in\nhis Remarks about a Late Discourse of Free-Thinking charges\nthat this definition is too broad—that it amounts to a\ndefinition of thinking. James O’Higgins in his study of Collins\nagrees with Bently. This, however, is not a good evaluation.\nCollins’ account is surely intended to rule out believing\nwithout evidence, or against the evidence, or without carefully\nconsidering conflicting evidence. Either these are not going to be\nadmitted as thinking at all, or Collins’ definition is not too\nbroad.\n\nThe Discourse is divided into three sections. In the first\ntwo Collins gives a series of arguments in favor of free-thinking and\nin the third he answers objections to free-thinking and gives a list\nof historical figures who he views as free-thinkers. The arguments\ntreat thinking effectively as like a craft or art and a number of the\nearly arguments work on this analogy. He claims that just as putting\nrestrictions on painting would reduce the proficiency of the painter,\nso putting restrictions on thinking can only reduce the proficiency of\nthe thinker. To fail to think freely leads to the holding of absurd\nbeliefs and superstition. Collins gives a brief history of the efforts\nof priests to control what people believe by fraud from the ancient\nworld to the Reformation. Collins then claims that free-thinking is\nresponsible for the decline in the belief in witchcraft.\n\nSection 2 begins with Collins arguing that right opinion in matters of\nreligion is supposed to be essential to salvation and errors to lead\nto damnation. But if one is not to think freely oneself about such\nsubjects, then one must simply take up the opinions of those among\nwhom one happens to live. But this means that they will only be right\nby accident. On the other hand, if people think freely, they will have\n“the evidence of things to determine them to the side of\ntruth” (Collins 1713 [1984: 33). There are in all ages an\ninfinite number of pretenders to revelations from Heaven, supported by\nmiracles. These pretenders offer new notions of the Deity, new\ndoctrines, commands, ceremonies and modes of worship. To decide which\nof these are genuine and which spurious requires that one think freely\nabout the competing evidence that would show that one is genuine while\nthe other an imposter. Collins remarks that since the Anglican Church\nhas an organization to support foreign missionaries (The Society for\nPropagating the Gospel in Foreign Lands) this really requires\nsupporting free-thinking throughout the world and therefore at home as\nwell. Indeed: \n\n\nAs there can be no reasonable change of opinions among men, no\nquitting of any old religion, no reception of any new religion, nor\nbelieving any religion at all, but by means of free-thinking; so the\nHoly Scriptures agreeably to reason, and to the design of our blessed\nSavior of establishing his religion throughout the whole universe,\nimply everywhere and press in many places the duty of free thinking.\n(Collins 1713 [1984: 43–46]) \n\n\nFinally Collins claims that the conduct of the priests \n\n\nwho are the chief Pretenders to be the Guides to others in matters of\nReligion, makes free-thinking on the nature and attributes of the\neternal being of God, on the authority of the scriptures, and on the\nsense of scriptures, unavoidable. (Collins 1713 [1984: 46]) \n\n\nHe goes on to list disagreements and differences of opinion among\npriests on all these topics.\n\nIn section 3 Collins takes up various objections to free-thinking. To\nsuppose that all men have a right to think freely on all subjects is\nto suppose that they have the capacity to do so. But they do not. So\nit is absurd to think that they have a duty to think freely. Collins\nreplies that to suppose a right to a thing “also implies a Right\nin him to let it alone, if he thinks fit” (Collins 1713 [1984:\n100). As for free-thinking being a duty, Collins responds that it is\nso only in cases where those who contend “for the Necessity of\nall Men’s assenting to certain Propositions, must allow that men\nare qualify’d to do so” (ibid.). If it were the case that\nthe great bulk of mankind lacked the capacity to think freely on\nmatters of speculation, then the priests should conclude that men\nshould in no way be concerned about truth and falsehood in speculative\nmatters. In short, they should hold no opinion. Even in this case,\nhowever, the right to think freely would remain untouched in those\ndisposed to think freely. The second objection is that to encourage\nfree-thinking “will produce endless Divisions of Opinion and by\nconsequence Disorders in Society”. Collins suggests that the\nconsequence is false and that any remedy is worse than the disease.\nThird, free-thinking may lead to atheism. Collins points out that many\ndivines hold that there never was a real atheist in the world while\nBacon holds that contemplative atheists are rare. Still, even if\nfree-thinking were to produce many atheists, the number of those who\nare superstitious or enthusiastic that will be produced in the absence\nof free-thinking is even greater. And these are worse evils for\nsociety than atheism. Fourthly, priests are the experts who are to be\nrelied upon in their subject as doctors and lawyers are to be relied\nupon in theirs. Collins argues that the analogy between doctors and\nlawyers and priests does not hold. First, while doctors and lawyers\nact for us, we need not believe the principles or opinions on which\none prescribes and the other acts. But in matters of religion,\n“I am obliged to believe certain opinions myself. No man’s\nbelief will save me except my own” (Collins 1713: 109). Finally,\nfree-thinkers are “the most infamous, wicked and senseless of\nall mankind” (Collins 1713: 118). Collins answers this objection\nin various ways—arguing that in fact free-thinking makes one\nvirtuous. He ends by listing a variety of men he considers\nfree-thinkers whose moral character was impeccable—Socrates,\nPlato, Aristotle, Epicurus, Plutarch, Cicero, Varo and others among\nthe ancients. Among the moderns he includes, Bacon, Hobbes and\nArchbishop Tillotson.\n4.4 Interpreting A Discourse of Free Thinking\n\nThe Discourse leaves us with a variety of questions. What\nexactly is Collins trying to achieve in this book? Reflecting on the\nfirst two sections of the Discourse, James O’Higgins\nnotes: \n\n\nA good deal of what he wrote can be interpreted as the writing of an\nanti-clerical protestant, insisting on private judgment for the laity.\nA few other passages…such as those from Varo and Socrates, seem\nto imply a bias against Christianity itself, or at least against\nRevelation. (O’Higgins 1970: 89) \n\n\nSome of Collins’ critics accused him of being an atheist. But,\nunless one gives the work an esoteric reading, this hardly seems\nwarranted. Collins is, however, clearly extolling a universal religion\nbased on reason.\n\nThe Discourse received a good number of replies. Steele\ncommented that the author of the Discourse deserved “to\nbe denied the common benefits of air and water” (quoted in\nO’Higgins 1970: 78). The Guardian campaigned against\nthe Discourse. Among the articles it published were some by\nthe young George Berkeley. There is a certain amount of scholarly\ndebate about how effective these replies were. From early on,\nhistorians have often claimed that Richard Bently in his Remarks\nabout a late Discourse of Freethinking delivered a crushing\nrejoinder to Collins. James O’Higgins in his book-length study\nof Collins probably gives the most balanced assessment.\nO’Higgins admits that Bently, on the whole, makes a strictly\nad hominem attack on Collins. He attacked Collins’\nscholarship and accused him of atheism. O’Higgins thinks that\nBently succeeded in showing that “Collins was not the man to\nproduce a critical edition of the Bible” (O’Higgins 1970:\n84). O’Higgins also remarks that Bently correctly points out\nthat Collins did not understand the role of textual variants in\nreducing (rather than increasing) our uncertainty about the meaning of\na text. Since Collins is maintaining that everyone capable of doing so\nshould reason about religious matters, claims that he failed to reason\ncorrectly may have more bite to them than other ad hominem\narguments. But while these are good points, set against the fact that\nBently completely failed to address the main issue of religious\nauthority, this can hardly amount to a crushing rejoinder.\n5. Collins and Religion\n\nEdward and Lillian Bloom note in their introduction to A Discourse\nConcerning Ridicule and Irony in Writing that: \n\n\nFor several years and in such works as Priestcraft in\nPerfection (1710) and A Discourse of Free-Thinking\n(1713), he was a flailing polemicist against the entire Anglican\nhierarchy. Not until 1724 did he become a polished debater, when he\ninitiated a controversy that made “a very great noise” and\nwhich ended only with his death. The loudest shot in the persistent\nbarrage was sounded by Grounds and Reasons and its last\nfusillade by the Discourse Concerning Ridicule and Irony in\nWriting. (Collins 1729 [1970: iii])\n\n\nIn Priestcraft in Perfection, 1710, and An Historical and\nCritical Essay on the Thirty Nine Articles of the Church of\nEngland, 1724, Collins attacks the first clause of Article 20 of\nthe 39 articles: “The Church hath power to decree rites or\nceremonies, and authority in controversies of faith”. Collins\ngoes over the history of the clause in considerable detail to argue\nthat it is a forgery. Clearly if this were a forgery, the church would\nhave no power to decree rites nor authority in controversies of faith.\nThe point is that: \n\n\n…the just and true establishment of religion lies, in allowing\nevery man to have a conscience of his own; to use and follow his own\nprivate judgment; and particularly, to understand, profess and\npractice, what he thinks God teaches in the holy scriptures. (Collins,\nPreface to the Essay, quoted in O’Higgins 1970:\n143–4) \n\n\nO’Higgins notes that this might be the position of any\ndissenting minister. He gives a detailed summary of the controversy in\nChapter IX of his study of Collins.\n\nIn A Discourse on the Grounds and Reasons of the Christian\nReligion, 1724, Collins attacks the basis of Christianity as a\nrevealed religion. In The Reasonableness of Christianity,\nLocke had made the messiahship of Christ the single fundamental tenet\nfor being a Christian. In the Discourse Collins rejects it.\nThe argument is that Christianity is founded on Judaism, or the New\nTestament on the Old. The New Testament is only of importance in this\nregard insofar as it shows that the prophecies of the Old are\nfulfilled. Collins rejects the claim that they are fulfilled in the\nNew Testament. This, he asserts, is the only proof for Christianity.\nCollins’ critics disputed this claim; there was the proof from\nmiracles. But Collins rejected such proofs.\n\nIn rejecting the argument from prophecies Collins is once again\njousting with the Newtonians. William Whiston (1667–1752) was a\nclose associate of Newton’s and was probably influenced by\nNewton’s interest in prophetic arguments. Stephen Snobelen\npoints out in his review of the controversy that Whiston hoped to set\nup an exact science of prophecies. As Snobelen notes: “For\nWhiston, fulfilled prophecy was as certain as a Boylean experiment or\na Newtonian demonstration” (Snobelen 1996: 205). Collins shared\nmuch of Whiston’s desire for precision. Often it was allowed\nthat a prophecy in the Old Testament had dual fulfillments, one in the\nprophet’s own day and one in the more remote future. One of\nthese was supposed to be literal, the other allegorical. Both Whiston\nand Collins reject ‘allegorical’ interpretations for\nliteral ones. But while Whiston regarded the later fulfillment as\nliteral and the earlier as allegorical, Collins insisted that it was\nthe earlier one that should be regarded as literal.\n\nUsing the catalog of Collins’ library produced by Giovanni\nTarantino, Jacopo Agnesina has persuasively argued that A\nDiscourse Concerning Ridicule and Irony in Writing published in\n1729 is a genuine work of Anthony Collins, though O’Higgins in\nhis biography of Collins doubted its authenticity (Agnesina 2009).\nEdward and Lillian Bloom in their introduction to their reprint of the\nDiscourse remark that:\n\n\nFor the modern reader, the Discourse concerning Ridicule and\nIrony is the most satisfying of Collins’s many pamphlets\nand books. It lacks the pretentiousness of the Scheme, the\nsnide convolutions of the Grounds and Reasons, the argument\nby half-truths of the Discourse of Free-Thinking. His last\nwork is free of the curious ambivalence which marked so many of his\nearlier pieces, a visible uncertainty that made him fear repression\nand yet court it. On the contrary, his last work is in fact a\njustification of his rhetorical mode and religious beliefs; it is an\napologia pro vita sua written with all the intensity and\ndecisiveness that such a justification demands. (Collins 1729 [1970:\nxv])\n\n\nThe aim of the Discourse is to refute a claim by Nathanael\nMarshall that while serious arguments about religious issues should be\nallowed, ridicule and irony in attacks on established religion should\nbe prosecuted by the magistrate. This is a clear indication of how\nmuch his Anglican opponents had let Collins’ irreverent wit,\nbiting satire and ironical remarks get under their skin.\nCollins’ opponent was vulnerable on a number of points and\nCollins makes telling arguments against his claim. He notes that the\nbest writers on religion will be found to be committing these crimes\nin disputation; that the best punishment would be either to be ignored\nor to return ridicule with ridicule—rather than to be punished\nby the magistrate. He points out that when Mr. Marshall discovers how\nmany of those who practice these crimes are of his party and are\nencouraged in these practices he will give up his position, and so on.\nThe theme of allowing liberty of discourse in public debates about\nreligion is the over-arching theme of the Discourse, and it\nis certainly one of the main themes of Collins’ work throughout\nhis life.\n6. Influences\n6.1 In England\n\nWe have already considered in some detail Samuel Clarke’s\nreaction to Collins’ views about emergent properties, personal\nidentity and issues about determinism and free will in the early\neighteenth century. The Clarke Collins correspondence of 1707–08\nwas reprinted twice and referred to many times in the course of the\neighteenth century (Martin and Barresi 2000: 33). The conservative\nreaction to Locke and Collins concerning personal identity and\nmaterialism represented by Clarke continued to be maintained by many\nthinkers in eighteenth century England as well as on the continent. In\nfact, we can see an on-going debate between the materialists and\ndualists on these topics all the way through the eighteenth and into\nthe early nineteenth century in England.\n\nBishop Joseph Butler (1692–1752) a protege of Samuel Clarke\nattacked the Locke/Collins account of personal identity in the\nAppendix on Personal Identity to his Analogy of Religion.\nButler largely accepted Clarke’s substantialist account of\nidentity and personal identity. Indeed he clarified Clarke’s\nposition by summarizing it briefly and naming the distinction Clarke\nhad been making between real and fictional identity. He called it the\ndistinction between identity in the strict and proper sense and\nidentity in the loose and popular sense (Ducharme 1986: 370). He\nreiterates Clarke’s claim that Collins’ account of\npersonal identity is dangerous to religion and in particular the\ndoctrine of the resurrection. He accused Collins of taking\nLocke’s doctrines “to a strange length” (Butler as\nquoted in Perry 2008: 102). By this Butler meant that Collins’\naccount of personal identity would not allow a person’s identity\nto persist for more than a moment and thus that Locke’s account\nof personal identity implied and that Collins explicitly stated a\ndoctrine of successive persons. Butler claimed that such a doctrine\nwould destroy both morality and any doctrine of the resurrection. This\nhas been an influential misinterpretation of Collins (see Uzgalis\n2008a: 322–326).\n\nGeorge Berkeley (1685–1753) met Collins at a freethinking coffee\nhouse meeting and later told his American follower, Samuel Johnson,\nthat Collins was an atheist. As noted earlier, Berkeley attacked the\nDiscourse of Free-Thinking in Steele’s\nGuardian, and continued his attacks on Collins in\nAlciphron. While Berkeley holds a quite distinct set of\nphilosophical views from those of Clarke, together they represent a\nconservative Anglican response to Locke and Collins on the issue of\npersonal identity. Berkeley agrees with Clarke about the substantial\nnature of persons.\n\nScholars are still debating the influence of Collins on David Hume\n(1711–1776). How much influence is attributed to Collins depends\nlargely on the interpretation given to Hume’s philosophy (see\nMcIntyre 1994, Russell 1995, and Harris 2005). McIntyre and Russell\ndespite their differences agree that in A Treatise Of Human\nNature Hume was systematically attacking Clarke’s position\non the mind/body relation as articulated both in Clarke’s Boyle\nlectures and the Clarke Collins correspondence of 1707–08 and\nthat many of Hume’s arguments resemble those of Collins. Harris,\nfocusing on the issue of free will and determinism and using the\nEnquiries to interpret the Treatise, has a\ncontrasting view. He argues that Hume’s account of necessity is\nweaker than “that defended by Collins and before him by\nHobbes”, and he goes on to claim that in giving this weaker\naccount Hume is giving the same kind of account that Bramhall and\nClarke gave in trying to find a middle way between necessitarianism\nand the liberty of indifference (Harris 2005: 73). Harris may be\ncorrect in noting a variety of ways in which Hume’s account of\ncausality and necessity differs from that of Hobbes, Locke and\nCollins. On the other hand, central to Hume’s analysis of\ncausality is the total rejection of the a priori Homogeneity\nPrinciple and the necessary connection implicit in heirloom theories\nof causality. Collins also rejects the Homogeneity Principle, and\nheirloom theories of causality that underlie it. He strenuously denies\nthat any of the contradictions that are supposed to follow from\nviolating the Principle actually occur. These are clear similarities\nbetween Collins’ account of causality and\nHume’s that Harris fails to note. I think these considerations\ntend to weaken Harris’ judgement that while Collins is a\ndogmatist on these issues, Hume is a skeptic (see Harris 2005: note 22\np. 79). \n\nThomas Reid (1710–1796) holds positions on materialism, personal\nidentity and free will that have much in common with the views of\nClarke. Reid deploys reduplication arguments in objecting to the views\nabout personal identity of Joseph Priestly (see Martin and Barresi\n2000: 47). Priestly’s views have strong connections to those of\nLocke and Collins.\n\nJoseph Priestley (1733–1804) was sufficiently impressed with\nCollins’ Philosophical Inquiry Concerning Free Will to\narrange the publication of a new edition of that work. Priestley also\nheld that matter can think, but his views were based on a different\nconception of matter than the one which Collins and Clarke shared.\nPriestley had an active conception of matter derived from Boscovich.\nPriestley was also impressed by Collins’ work on the prophecies\n(Yolton 1983: 108–113).\n6.2 On the continent\n\nCollins’ influence on the continent in the second half of the\neighteenth century was much more considerable than his influence in\nEngland. O’Higgins remarks that \n\n\nSmall though his part in English literature may have been, during his\nown lifetime there were few English writers who were more fully\nreported in the continental journals, or more noted in foreign\nuniversities. (O’Higgins 1970: 203)\n\n\nPierre Desmaizeaux knew Collins for some 26 years and was his friend\nand collaborator. Desmaizeaux played an important role in raising\nCollins’ reputation both in England and on the continent.\nCollins discussed Clarke’s response to his book on determinism\nwith Desmaizeaux and Desmaizeaux kept Collins in contact with the\nintellectual life on the continent and also served as a publicist for\nCollins. He had Collins’ Inquiry translated into French\nand handled the printing of his other books. In 1720, under\nCollins’ direction, Desmaizeaux published A collection of\nseveral pieces of Mr. John Locke, never before printed, or not extant\nin his works. Pub. by the author of the Life of the ever-memorable Mr.\nJohn Hales, &c which contained a number of Locke’s\nletters to Collins. There was considerable interest on the continent\nin the thinking-matter controversy. There is a certain amount of\ndebate about the influence of Collins’ book on free will and\ndeterminism on Voltaire. O’Higgins accepts the evidence produced\nby Torrey in Voltaire and the English Deists that Voltaire\nwas converted to determinism by reading Collins (O’Higgins 1970:\n219–20). As time passed free-thinking came out into the open in\nFrance and Collins’ name was associated with it. Finally, his\nworks on the materiality of the soul, determinism and free will and\nthe prophecies influenced the group around Baron d’Holbach. (For\na detailed treatment of Collins’ influence on the continent, see\nO’Higgins 1970: Chapter XI.) Whether Collins would have been\nhappy with this depends on whether we view him as a deist with\nO’Higgins, or as an atheist with David Berman and Jacopo\nAgnesina. This disagreement over whether to regard Collins as a deist\nor as an atheist (or someone whose views changed over time or were\nunclear even to himself) is our most serious unresolved problem in\ndetermining Collins’ proper place in the history of ideas.\n", "bibliography": {"categories": ["Primary Literature", "Secondary Literature"], "cat_ref_text": {"Primary Literature": ["</h3>\n<h4 id=\"WorkColl\">Work by Collins</h4>\n<ul class=\"hanging\">", "Collins, Anthony, 1707 [1984], <em>An Essay Concerning the Use of\nReason</em> and <em>A Discourse of Free Thinking</em>, Peter Schouls\n(ed.), 1707; republished New York: Garland Press, 1984.\n\n<p class=\"bibnote\">\nA republication of Collins’ first book and his 1713 book on free\nthinking, both in their original eighteenth century type.</p>", "–––, 1707 [1976], <em>Determinism and Free\nWill</em>, introduction by James O’Higgins, The Hague: Martinus\nNijhoff.\n\n<p class=\"bibnote\">\nProvides the facsimile text of Collins’ <em>A Philosophical\nInquiry Concerning Human Freedom</em> along with annotations and a\nuseful introduction that discusses Collins’ place in the debate\nover free will and determinism and provides an analysis of the\ntext.</p>", "–––, 1729 [1970], <em>A Discourse concerning\nRidicule and Irony in Writing</em>, Edward A. Bloom and Lillian D.\nBloom (eds.); republished, Los Angeles: The William Andrews Memorial\nClarke Library, No. 142, 1970.\n\n<p class=\"bibnote\">\nA republication of Collins’ last book with an interesting\nintroduction and notes.</p>", "Clarke, Samuel and Anthony Collins, 2011, <em>The Correspondence\nof Samuel Clarke and Anthony Collins, 1707–08</em>, William\nUzgalis (ed.), Peterborough, ON: Broadview Press.\n\n<p class=\"bibnote\">\nA new edition of the Correspondence with an introduction, notes, index\nand supplementary readings that put the correspondence in\ncontext.</p>", "Dybikowski, James (ed.), 2011, <em>The Correspondence of Anthony\nCollins (1676–1729), Freethinker</em>, Paris: Honoré\nChampion.\n\n<p class=\"bibnote\">\nA fine edition of Collins’ letters that includes an\nintroduction, extensive notes that make clear many of the references\nin the letters that would otherwise be unintelligible, and an\nindex.</p>\n</ul>\n<h4 id=\"WorkOthe\">Works by Others</h4>\n<ul class=\"hanging\">", "Bayle, Pierre, 1697 [1991], <em>Historical and Critical Dictionary\nSelections</em>, Richard Popkin (ed. and trans.), Indianapolis:\nHackett Publishing.\n\n<p class=\"bibnote\">\nThis contains a translation of the article “Diaearchus” in\nwhich Bayle attacks the thinking matter hypothesis.</p>", "Clarke, Samuel, 1738 [1928], <em>The Works of Samuel Clarke</em>,\nvolumes 1–4; republished New York: Garland Press, 1928.\n\n<p class=\"bibnote\">\nClarke’s Works have Clarke’s Boyle lectures, the Clarke\nCollins correspondence in its entirety and Clarke’s review of\nCollins’ 1717 book on determinism and free will.</p>", "Locke, John, 1690 [1975], <em>An Essay Concerning Human\nUnderstanding</em>, Peter Nidditch (ed.), Oxford: Oxford University\nPress.\n\n<p class=\"bibnote\">\nLocke’s <em>magnum opus</em> had a considerable influence on\nCollins both in respect to his epistemological views and in respect to\nparticular issues such as whether matter can think. This is currently\nthe standard edition of Locke’s Essay.</p>", "–––, 1989, <em>The Correspondence of John\nLocke</em>, volume 8, E. S. De Beer (ed.), Oxford: Oxford University\nPress.\n\n<p class=\"bibnote\">\nContains Locke’s letters to Collins during the period of their\neighteen month friendship. It is thus a major source for the study of\ntheir relationship.</p>\n</ul>\n<h3 id=\"SecoLite\">"], "Secondary Literature": ["</h3>\n<ul class=\"hanging\">", "Agnesina, Jacopo, 2009, «Sur l’attribution à\nAnthony Collins du Discourse Concerning Ridicule and Irony in\nWriting» (in French), in <em>La Lettre Clandestine</em>, 17,\nParis: Presses de l’université de Paris-Sorbonne,\n277–290.\n\n<p class=\"bibnote\">\nAgnesina argues on the basis of a comparison of the sources used in\n<em>A Discourse on Ridicule and Irony in Writing</em> and the catalog\nof Anthony Collins library that the <em>Discourse</em> is a genuine\nwork of Anthony Collins.</p>", "–––, 2011, “Anthony Collins e il\nDeterminismo Logico” (in Italian), <em>Rivista di Storia della\nFilosofia</em>, 66(3): 409–430.\n\n<p class=\"bibnote\">\nAgnesina argues that Collins was not just a determinist but a logical\ndeterminist or necessitarian who was influenced indirectly by Spinoza\nthrough Bayle and Leibniz.</p>", "–––, 2018, <em>The Philosophy of Anthony\nCollins: Free Thought and Atheism</em>, Paris: Honoré Champion\n\n<p class=\"bibnote\">\nAn account of the life and works of Anthony Collins focused on the\nquestion of whether Collins was an atheist. Agnesina fills in some of\nthe philosophical background to Collins’ work,\nidentifies previously unknown works, and often gives a\ncompelling analysis of some of the works themselves.</p>", "Attfield, Robin, 1977, “Clarke, Collins and\nCompounds”, <em>Journal of the History of Philosophy</em>,\n15(1): 45–54. doi:10.1353/hph.2008.0087\n\n<p class=\"bibnote\">\nIntroduces the Clarke Collins controversy, and focuses on the issue of\nClarke’s categories. Attfield suggests that if one does not wish\nto accept Clarke’s reductionism one should focus on the powers\nof functional objects.</p>", "Bedau, Mark A. and Paul Humphreys (ed.), 2008, <em>Emergence,\nContemporary Readings in Philosophy and Science</em>, Cambridge, MA:\nMIT Press. doi:10.7551/mitpress/9780262026215.001.0001\n\n<p class=\"bibnote\">\nWhile not dealing with emergent properties before J. S. Mill, the\ntwentieth and twenty-first century treatments of emergence in this\nbook gives some real perspective on the interest and importance of the\narguments Collins gives for such properties in the Clarke Collins\ncorrespondence of 1707–08.</p>", "Berman, David, 1975, “Anthony Collins: Aspects of His\nThought and Writings”, <em>Hermathena</em>, 119: 49–70.\n\n<p class=\"bibnote\">\nThis is, in effect, a critical review of James O’Higgins book\n<em>Anthony Collins: The Man and His Work</em>. Berman fills in the\ngaps that O’Higgins account leaves in our understanding of\nCollins. The article, then, is intended as a supplement to the book.\nBerman paints a picture of Collins as a genuine lover of truth who\nuses his wealth to create a research library used by many scholars. He\nrelates Collins to Locke and Berkeley in terms of the meaning of terms\nfor religious mysteries, e.g. the trinity, as well as in other\nways.</p>", "–––, 1980, “Hume and Collins on\nMiracles”, <em>Hume Studies</em>, 6(2): 150–154.\ndoi:10.1353/hms.2011.0618", "–––, 1988, <em>A History of Atheism in Great\nBritain: From Hobbes to Russell</em>, London, Croom Helm.\n\n<p class=\"bibnote\">\nBerman makes the case that Collins was an atheist. This is a competing\ninterpretative hypothesis to O’Higgins’ view that Collins\nbelieved in the existence of God and a future state.</p>", "Colie, Rosalie L., 1959, “Spinoza and the Early English\nDeists”, <em>Journal of the History of Ideas</em>, 20(1):\n23–46. doi:10.2307/2707965\n\n<p class=\"bibnote\">\nDevelops the political dimension of early English Deism. Colie claims\nthat Collins was the least political of the early English Deists. She\ndiscusses the relation of Collins’ views on necessity and the\nproblem of evil to those of Spinoza.</p>", "Copenhaver, Rebecca (ed.), 2018 <em>Philosophy of Mind in the\nEarly Modern and Modern Ages: The History of the Philosophy of Mind,\nVolume 4</em>, London: Routledge.\n\n<p class=\"bibnote\">\nAn anthology of works about Philosophy of Mind in the early modern and\nmodern periods, including a chapter about the Clarke Collins\ncorrespondence (Uzgalis 2018).</p>", "Cottingham, John, 1988, <em>The Rationalists</em>, Oxford: Oxford\nUniversity Press.\n\n<p class=\"bibnote\">\nExplains heirloom theories of causality</p>", "Ducharme, Howard M, 1986, “Personal Identity in Samuel\nClarke”, <em>Journal of the History of Philosophy</em>, 24(3):\n359–383. doi:10.1353/hph.1986.0062\n\n<p class=\"bibnote\">\nMakes the case that Clarke develops the metaphysical view that\nunderlies the distinction between identity in the strict and\nphilosophical sense and identity in the loose and popular sense that\nButler later named.</p>", "Edwards, Paul, 2009, <em>God and the Philosophers</em>, Amherst,\nNY: Prometheus Books.\n\n<p class=\"bibnote\">\nPuts Collins in the context of a brief history of Deism.</p>", "Fergusen, James, 1974, <em>The Philosophy of Dr. Samuel Clarke and\nits Critics</em>, New York: Vantage Press.\n\n<p class=\"bibnote\">\nFergusen deals with the Clarke Collins controversy over determinism\nand free will. He considers critically Clarke’s response to\nSpinoza and Hobbes.</p>", "Fox, Christopher, 1988, <em>Locke and the Scriblerians, Identity\nand Consciousness in Early Eighteenth Century Britain</em>, Berkeley,\nCA: University of California Press.\n\n<p class=\"bibnote\">\nA fine treatment of the seventeenth and early eighteenth century\ndebate over consciousness and personal identity that includes an\naccount of the Clarke Collins correspondence of 1707–08 and the\ninfluence it had on the Scriblerians.</p>", "Harris, James A., 2005, <em>Of Liberty and Necessity, The Free\nWill Debate in Eighteenth Century British Philosophy</em>, Oxford:\nOxford University Press. doi:10.1093/0199268606.001.0001\n\n<p class=\"bibnote\">\nPuts the views of Clarke and Collins in the context of other views\nabout free will and determinism in the eighteenth century.</p>", "Hefelbower, Samuel Gring, 1918, <em>The Relation of John Locke to\nEnglish Deism</em>, Chicago: University of Chicago Press.\n\n<p class=\"bibnote\">\nAn effort to characterize the defining features of English\nDeism</p>", "Jacob, Margaret C., 1976, <em>The Newtonians and the English\nRevolution 1689–1720</em>, Ithaca, NY: Cornell University Press\n\n<p class=\"bibnote\">\nProfiles the latitudinarian Anglicans both before and after the\nRevolution of 1688 who used Newtonian natural philosophy as a basis\nfor justifying a particular social order against a materialistic,\nHobbesian philosophy that they regarded as atheistic that justified a\ncompeting social order. Jacob thus puts the controversies between\nClarke and Collins in a meaningful and interesting historical and\nintellectual context.</p>", "Lennon, Thomas M. and Robert J. Stainton (eds), 2008, <em>The\nAchilles of Rationalist Psychology</em>, Dordrecht: Springer.\n\n<p class=\"bibnote\">\nA collection of articles dealing with a Kantian argument intended to\nshow the partless unity of the soul and variants of that argument. It\nincludes an article about the Clarke Collins correspondence focused in\npart on Collins conception of matter.</p>", "Martin, Raymond and John Barresi, 2000, <em>The Naturalization of\nthe Soul: Self and Personal Identity in Eighteenth Century</em>,\nLondon: Routledge.\n\n<p class=\"bibnote\">\nDeals with the Clarke Collins correspondence of 1707–08 in the\ncontext of the history of the debate over consciousness and personal\nidentity in the seventeenth and eighteenth centuries.</p>", "McIntyre, Jane L., 1994, “Hume: Second Newton of the Moral\nSciences”, <em>Hume Studies</em>, 20(1): 3–18.\n\n<p class=\"bibnote\">\nDeals with Hume’s relation to Clarke and Collins particularly in\nrelation to the issue of whether the self is simple or compounded, and\npersonal identity.</p>", "McLaughlin, Brian P., 1992 [2008], “The Rise and Fall of\nBritish Emergentism”, in <em>Emergence or Reduction? Essays on\nthe Prospects of Nonreductive Physicalism</em>, Ansgar Beckermann,\nHans Flohr, and Jaegwon Kim (eds), Berlin: Walter de Gruyter.\nReprinted in Bedau and Humphreys 2008: 19–59.\ndoi:10.7551/mitpress/9780262026215.003.0003\n\n<p class=\"bibnote\">\nExplains the origins of the nineteenth and twentieth centuries’\nschool of British emergentist philosophers.</p>", "Miller, Jon (ed.), 2009, <em>Topics in Early Modern Philosophy of\nMind</em> (Studies in the History of Philosophy of Mind: Volume 9),\nDordrecht: Springer. doi:10.1007/978-90-481-2381-0\n\n<p class=\"bibnote\">\nA collection of articles on European philosophers from Descartes to\nHume and including material about the Clarke Collins\ncorrespondence.</p>", "Mijuskovic, Ben Lazare, 1974, <em>The Achilles of Rationalist\nArguments</em>, The Hague: Martinus Nijhoff.\n\n<p class=\"bibnote\">\nGives a history and analysis of the simplicity argument, central to\nClarke’s claims about consciousness and the soul, that Collins\nargues against in the Clarke Collins correspondence of 1707–08.\nHe discusses its uses in arguing for immortality and in questions\nabout personal identity.</p>", "Mossner, Ernest Campbell, 1967, two articles in <em>The\nEncyclopedia of Philosophy</em>, volume 2, Paul Edwards (ed.), New\nYork: Macmillan.\n\n<ul class=\"hanging\">", "1967a, “Anthony Collins”, pp. 144–146.\n\n<p class=\"bibnote\">\nProvides a good account of Collins, though significantly shorter and\nless detailed than the one provided here.</p>", "1967b, “Deism”, pp. 326–336.\n\n<p class=\"bibnote\">\nProvides a fine overview of Deism both in England and on the continent\nwith brief biographies of both major and minor figures.</p>\n</ul>", "O’Higgins, James, 1970, <em>Anthony Collins The Man and His\nWorks</em>, The Hague: Martinus Nijhoff.\n\n<p class=\"bibnote\">\nThe first full length study of Anthony Collins. The book is strong in\nits account of Collins’ life, his predecessors, his theological\nviews, and his influence on the continent. What is missing is depth in\nthe account of Collins’ philosophical views.</p>", "Overhoff, Jurgen, 2000, <em>Hobbes’ Theory of the Will:\nIdeological Reasons and Historical Circumstances</em>, Lanham, MD:\nRowan &amp; Littlefield Publishers.\n\n<p class=\"bibnote\">\nProvides an excellent account of the nature of Hobbes’\ndeterminism and its context. This is helpful in assessing\nCollins’ place in the history of determinism.</p>", "Perry, John (ed.), 2008, <em>Personal Identity</em>, 2nd edition,\nLos Angeles, CA: University of California Press.\n\n<p class=\"bibnote\">\nThe second edition of the book includes selections on personal\nidentity from the Clarke Collins correspondence of 1707–08 and\nan essay on Collins’ views on personal identity as well as many\nof the relevant chapters on personal identity from the early modern\nperiod as well as the twentieth century.</p>", "Robertson, J. M., 1915, <em>A Short History of Freethought:\nAncient and Modern</em>, London: Watts &amp; Co.\n\n<p class=\"bibnote\">\nTreats Collins sympathetically in the context of the history of\nFreethinking.</p>", "Rowe, William L., 1987, “Causality and Free Will in the\nControversy Between Collins and Clarke”, <em>Journal of the\nHistory of Philosophy</em>, 25(1): 51–67.\ndoi:10.1353/hph.1987.0008\n\n<p class=\"bibnote\">\nExamines the debate over free will between Collins and Clarke and\ncompares both views with those of Locke. Rowe explores assumptions the\ntwo sides have in common. His aim is to develop Clarke’s free\nagent theory.</p>", "–––, 1991, <em>Thomas Reid on Freedom and\nReality</em>, Ithaca, NY: Cornell University Press.\n\n<p class=\"bibnote\">\nTreats Locke, Collins and Clarke’s views concerning free will\nand necessity as background for an exposition of the views of Thomas\nReid. Rowe sees Reid as giving the best account of libertarian free\nwill. In discussing the Clarke Collins interaction on determinism, he\nfocuses on Clarke’s account of agency as an important antecedent\nto Reid.</p>", "Rozemond, Marleen, 2008, “The Achilles Argument and the\nNature of Matter in the Clarke Collins Correspondence”, in\nLennon and Stainton 2008: 159–175.\n\n<p class=\"bibnote\">\nTreats Clarke’s original argument as a variant of the Achilles\nof Rationalist arguments, finds the fundamental disagreement between\nClarke and Collins in their differing views of matter (apart from\ntheir disagreement about emergent properties and discusses\nClarke’s emergent soul.</p>", "–––, 2009, “Can Matter Think? The\nMind–Body Problem in the Clarke–Collins\nCorrespondence”, in Miller 2009: 171–182.\ndoi:10.1007/978-90-481-2381-0_8\n\n<p class=\"bibnote\">\nDiscusses the debate between Clarke and Collins over emergent\nproperties and concludes that Collins abandoned his emergentism in\nfavor of a version of the mind-brain identity theory.</p>", "Russell, Paul, 1995, “Hume’s ‘Treatise’\nand the Clarke Collins Controversy”, <em>Hume Studies</em>,\n21(1): 95–115. doi:10.1353/hms.2011.0074\n\n<p class=\"bibnote\">\nPuts the controversies between Clarke and Collins over materialism and\nfree will and determinism in context, summarizes the controversies\nthemselves, and then considers the influence these had on\nHume.</p>", "Snobelen, Stephen, 1996, “The Argument over Prophecy: An\nEighteenth-Century Debate between William Whiston and Anthony\nCollins”, <em>Lumen: Selected Proceedings from the Canadian\nSociety for Eighteenth-Century Studies</em>, 15: 195–213.\ndoi:10.7202/1012482ar\n\n<p class=\"bibnote\">\nExplains the controversy between Collins and Whiston over the argument\nfrom prophecy and makes the point that Newton believed in the argument\nfrom prophecy and that Whiston is trying to apply Newtonian methods to\nbiblical prophecy.</p>", "Stephen, Leslie, 1936, <em>History of English Thought in the\nEighteenth Century</em>, London: Watts &amp; Co.\n\n<p class=\"bibnote\">\nGives a detailed history of English Deism in both the seventeenth and\neighteenth centuries and on the continent. There are several chapters\ndevoted to Deism and one of these to Collins.</p>", "Talbot, Ann, 2019, “Anthony Collins and China: The\nPhilosophical Impact of the Missionary Encounter”, <em>Journal\nof Early Modern History</em>, 23(4): 325–349.\ndoi:10.1163/15700658-12342629\n\n<p class=\"bibnote\">\nArgues that Collins found in the reports of the Jesuits about\nneo-Confucians, an atheistic and monistic ethic held by a government\nthat was tolerant of different religious views</p>", "Tarantino, Giovanni, 2007, <em>Lo scrittoio di Anthony Collins\n(1676–1729). I libri e i tempi di un libero pensatore</em> (in\nItalian), Milan: Franco Angeli.\n\n<p class=\"bibnote\">\nThis catalog of Collins’ library, the third largest in England\nwhen he died, allows one to see what sources were available to Collins\nthe prolific writer.</p>", "Thompson, Ann, 2008, <em>Bodies of Thought: Science, Religion and\nSoul in the Early Enlightenment</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199236190.001.0001\n\n<p class=\"bibnote\">\nProvides a detailed context for the Clarke Collins debate and follows\nthe debate up to mid-eighteenth century France.</p>", "–––, 2010, “Animals, Humans, Machines and\nThinking Matter, 1690–1707”, <em>Early Science and\nMedicine</em>, 15(1–2): 3–37.\ndoi:10.1163/138374210X12589831573027\n\n<p class=\"bibnote\">\nProvides a context for Collins’ position about the similarities\nbetween animals and humans by explaining the views of a number of\nauthors leading up to the Clarke Collins correspondence.</p>", "Toland, John, 1704 [2013], <em>Letters to Serena</em>, Ian Leask\n(ed.), Dublin, Four Court’s Press, 2013.\n\n<p class=\"bibnote\">\nA modern edition of the Letters with an interpretative introduction\nsuggesting that Toland uses arguments he learned from Leibniz to fix a\nproblem in the philosophy of Spinoza. Toland holds that motion is\nessential to matter.</p>", "Torrey, Norman L., 1930, <em>Voltaire and the English Deists</em>,\nNew Haven, CT: Yale University Press.\n\n<p class=\"bibnote\">\nDiscusses the influence Collins had on Voltaire’s conversion to\ndeterminism.</p>", "Uzgalis, William, 2008a, “Locke and Collins, Clarke and\nButler, on successive persons”, in Perry 2008: 315–326.\n\n<p class=\"bibnote\">\nArgues that Collins has a materialist Lockean theory of personal\nidentity and that nothing either Locke or Collins wrote committed them\nto a doctrine of successive persons as Bishop Butler alleged.</p>", "––– (ed.), 2008b, “Selections from the\nClarke-Collins Correspondence”, in Perry 2008: 283–314.\n\n<p class=\"bibnote\">\nThis includes all of the material in the Clarke Collins correspondence\nof 1707–08 on personal identity.</p>", "–––, 2009, “Anthony Collins on the\nEmergence of Consciousness and Personal Identity”,\n<em>Philosophy Compass</em>, 4(2): 363–379.\ndoi:10.1111/j.1747-9991.2009.00203.x\n\n<p class=\"bibnote\">\nArgues that Collins has an emergent account of consciousness and\ndefends a materialist version of Locke’s account of personal\nidentity.</p>", "–––, 2018, “Minds and Persons in the\nClarke Collins Correspondence ”, in Copenhaver 2018: ch. 12.\n\n<p class=\"bibnote\">\nExamines some of the arguments, their strengths and weaknesses of the\ntwo protagonists in the Clarke Collins Correspondence.</p>", "Vailati, Ezio, 1993, “Clarke’s Extended Soul”,\n<em>Journal of the History of Philosophy</em>, 31(3): 387–403.\ndoi:10.1353/hph.1993.0052\n\n<p class=\"bibnote\">\nArgues that Collins’ most successful arguments in the Collins\nClarke exchange of 1706–08 were against Clarke’s claim\nthat the soul is extended.</p>", "–––, 1997, <em>Leibniz and Clarke: A Study of\ntheir Correspondence</em>, Oxford: Oxford University Press.\n\n<p class=\"bibnote\">\nTalks about the Clarke Collins correspondence to set the stage for the\nLeibniz Clarke Correspondence.</p>", "Wimsatt, William C., 1997 [2008], “Aggregativity: Reductive\nHeuristics for Finding Emergence”, <em>Philosophy of\nScience</em>, 64(Suppl.2): S372–S384. Reprinted in Bedau and\nHumphreys 2008: 99–110.", "Woolhouse, Roger S., 2007, <em>Locke: A Biography</em>, Cambridge:\nCambridge University Press.\n\n<p class=\"bibnote\">\nThe most recent biography of Locke which includes an account of\nLocke’s relations with Collins in Locke’s old age and\nother valuable material.</p>", "Yolton, John W., 1956, <em>Locke and the Way of Ideas</em>,\nOxford: Oxford University Press.\n\n<p class=\"bibnote\">\nYolton’s book has a section on the beginning phases of the\n“thinking matter” controversy in which we see that there\nwere a number of writers on both sides while Locke was alive and that\nLocke discussed some of these with Collins.</p>", "–––, 1983, <em>Thinking Matter: Materialism in\nEighteenth Century Britain</em>, Minneapolis, MN: University of\nMinnesota Press.\n\n<p class=\"bibnote\">\nThis book begins with Locke’s account of the possibility of\n“thinking matter” and traces the controversy over this\nsuggestion well into the eighteenth century beginning with the Clarke\nCollins controversy of 1707–8</p>\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLite\">Primary Literature</h3>\n<h4 id=\"WorkColl\">Work by Collins</h4>\n<ul class=\"hanging\">\n<li>Collins, Anthony, 1707 [1984], <em>An Essay Concerning the Use of\nReason</em> and <em>A Discourse of Free Thinking</em>, Peter Schouls\n(ed.), 1707; republished New York: Garland Press, 1984.\n\n<p class=\"bibnote\">\nA republication of Collins’ first book and his 1713 book on free\nthinking, both in their original eighteenth century type.</p></li>\n<li>–––, 1707 [1976], <em>Determinism and Free\nWill</em>, introduction by James O’Higgins, The Hague: Martinus\nNijhoff.\n\n<p class=\"bibnote\">\nProvides the facsimile text of Collins’ <em>A Philosophical\nInquiry Concerning Human Freedom</em> along with annotations and a\nuseful introduction that discusses Collins’ place in the debate\nover free will and determinism and provides an analysis of the\ntext.</p></li>\n<li>–––, 1729 [1970], <em>A Discourse concerning\nRidicule and Irony in Writing</em>, Edward A. Bloom and Lillian D.\nBloom (eds.); republished, Los Angeles: The William Andrews Memorial\nClarke Library, No. 142, 1970.\n\n<p class=\"bibnote\">\nA republication of Collins’ last book with an interesting\nintroduction and notes.</p></li>\n<li>Clarke, Samuel and Anthony Collins, 2011, <em>The Correspondence\nof Samuel Clarke and Anthony Collins, 1707–08</em>, William\nUzgalis (ed.), Peterborough, ON: Broadview Press.\n\n<p class=\"bibnote\">\nA new edition of the Correspondence with an introduction, notes, index\nand supplementary readings that put the correspondence in\ncontext.</p></li>\n<li>Dybikowski, James (ed.), 2011, <em>The Correspondence of Anthony\nCollins (1676–1729), Freethinker</em>, Paris: Honoré\nChampion.\n\n<p class=\"bibnote\">\nA fine edition of Collins’ letters that includes an\nintroduction, extensive notes that make clear many of the references\nin the letters that would otherwise be unintelligible, and an\nindex.</p></li>\n</ul>\n<h4 id=\"WorkOthe\">Works by Others</h4>\n<ul class=\"hanging\">\n<li>Bayle, Pierre, 1697 [1991], <em>Historical and Critical Dictionary\nSelections</em>, Richard Popkin (ed. and trans.), Indianapolis:\nHackett Publishing.\n\n<p class=\"bibnote\">\nThis contains a translation of the article “Diaearchus” in\nwhich Bayle attacks the thinking matter hypothesis.</p> </li>\n<li>Clarke, Samuel, 1738 [1928], <em>The Works of Samuel Clarke</em>,\nvolumes 1–4; republished New York: Garland Press, 1928.\n\n<p class=\"bibnote\">\nClarke’s Works have Clarke’s Boyle lectures, the Clarke\nCollins correspondence in its entirety and Clarke’s review of\nCollins’ 1717 book on determinism and free will.</p></li>\n<li>Locke, John, 1690 [1975], <em>An Essay Concerning Human\nUnderstanding</em>, Peter Nidditch (ed.), Oxford: Oxford University\nPress.\n\n<p class=\"bibnote\">\nLocke’s <em>magnum opus</em> had a considerable influence on\nCollins both in respect to his epistemological views and in respect to\nparticular issues such as whether matter can think. This is currently\nthe standard edition of Locke’s Essay.</p></li>\n<li>–––, 1989, <em>The Correspondence of John\nLocke</em>, volume 8, E. S. De Beer (ed.), Oxford: Oxford University\nPress.\n\n<p class=\"bibnote\">\nContains Locke’s letters to Collins during the period of their\neighteen month friendship. It is thus a major source for the study of\ntheir relationship.</p></li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Agnesina, Jacopo, 2009, «Sur l’attribution à\nAnthony Collins du Discourse Concerning Ridicule and Irony in\nWriting» (in French), in <em>La Lettre Clandestine</em>, 17,\nParis: Presses de l’université de Paris-Sorbonne,\n277–290.\n\n<p class=\"bibnote\">\nAgnesina argues on the basis of a comparison of the sources used in\n<em>A Discourse on Ridicule and Irony in Writing</em> and the catalog\nof Anthony Collins library that the <em>Discourse</em> is a genuine\nwork of Anthony Collins.</p></li>\n<li>–––, 2011, “Anthony Collins e il\nDeterminismo Logico” (in Italian), <em>Rivista di Storia della\nFilosofia</em>, 66(3): 409–430.\n\n<p class=\"bibnote\">\nAgnesina argues that Collins was not just a determinist but a logical\ndeterminist or necessitarian who was influenced indirectly by Spinoza\nthrough Bayle and Leibniz.</p></li>\n<li>–––, 2018, <em>The Philosophy of Anthony\nCollins: Free Thought and Atheism</em>, Paris: Honoré Champion\n\n<p class=\"bibnote\">\nAn account of the life and works of Anthony Collins focused on the\nquestion of whether Collins was an atheist. Agnesina fills in some of\nthe philosophical background to Collins’ work,\nidentifies previously unknown works, and often gives a\ncompelling analysis of some of the works themselves.</p></li>\n<li>Attfield, Robin, 1977, “Clarke, Collins and\nCompounds”, <em>Journal of the History of Philosophy</em>,\n15(1): 45–54. doi:10.1353/hph.2008.0087\n\n<p class=\"bibnote\">\nIntroduces the Clarke Collins controversy, and focuses on the issue of\nClarke’s categories. Attfield suggests that if one does not wish\nto accept Clarke’s reductionism one should focus on the powers\nof functional objects.</p></li>\n<li>Bedau, Mark A. and Paul Humphreys (ed.), 2008, <em>Emergence,\nContemporary Readings in Philosophy and Science</em>, Cambridge, MA:\nMIT Press. doi:10.7551/mitpress/9780262026215.001.0001\n\n<p class=\"bibnote\">\nWhile not dealing with emergent properties before J. S. Mill, the\ntwentieth and twenty-first century treatments of emergence in this\nbook gives some real perspective on the interest and importance of the\narguments Collins gives for such properties in the Clarke Collins\ncorrespondence of 1707–08.</p></li>\n<li>Berman, David, 1975, “Anthony Collins: Aspects of His\nThought and Writings”, <em>Hermathena</em>, 119: 49–70.\n\n<p class=\"bibnote\">\nThis is, in effect, a critical review of James O’Higgins book\n<em>Anthony Collins: The Man and His Work</em>. Berman fills in the\ngaps that O’Higgins account leaves in our understanding of\nCollins. The article, then, is intended as a supplement to the book.\nBerman paints a picture of Collins as a genuine lover of truth who\nuses his wealth to create a research library used by many scholars. He\nrelates Collins to Locke and Berkeley in terms of the meaning of terms\nfor religious mysteries, e.g. the trinity, as well as in other\nways.</p></li>\n<li>–––, 1980, “Hume and Collins on\nMiracles”, <em>Hume Studies</em>, 6(2): 150–154.\ndoi:10.1353/hms.2011.0618</li>\n<li>–––, 1988, <em>A History of Atheism in Great\nBritain: From Hobbes to Russell</em>, London, Croom Helm.\n\n<p class=\"bibnote\">\nBerman makes the case that Collins was an atheist. This is a competing\ninterpretative hypothesis to O’Higgins’ view that Collins\nbelieved in the existence of God and a future state.</p></li>\n<li>Colie, Rosalie L., 1959, “Spinoza and the Early English\nDeists”, <em>Journal of the History of Ideas</em>, 20(1):\n23–46. doi:10.2307/2707965\n\n<p class=\"bibnote\">\nDevelops the political dimension of early English Deism. Colie claims\nthat Collins was the least political of the early English Deists. She\ndiscusses the relation of Collins’ views on necessity and the\nproblem of evil to those of Spinoza.</p></li>\n<li>Copenhaver, Rebecca (ed.), 2018 <em>Philosophy of Mind in the\nEarly Modern and Modern Ages: The History of the Philosophy of Mind,\nVolume 4</em>, London: Routledge.\n\n<p class=\"bibnote\">\nAn anthology of works about Philosophy of Mind in the early modern and\nmodern periods, including a chapter about the Clarke Collins\ncorrespondence (Uzgalis 2018).</p></li>\n<li>Cottingham, John, 1988, <em>The Rationalists</em>, Oxford: Oxford\nUniversity Press.\n\n<p class=\"bibnote\">\nExplains heirloom theories of causality</p></li>\n<li>Ducharme, Howard M, 1986, “Personal Identity in Samuel\nClarke”, <em>Journal of the History of Philosophy</em>, 24(3):\n359–383. doi:10.1353/hph.1986.0062\n\n<p class=\"bibnote\">\nMakes the case that Clarke develops the metaphysical view that\nunderlies the distinction between identity in the strict and\nphilosophical sense and identity in the loose and popular sense that\nButler later named.</p></li>\n<li>Edwards, Paul, 2009, <em>God and the Philosophers</em>, Amherst,\nNY: Prometheus Books.\n\n<p class=\"bibnote\">\nPuts Collins in the context of a brief history of Deism.</p></li>\n<li>Fergusen, James, 1974, <em>The Philosophy of Dr. Samuel Clarke and\nits Critics</em>, New York: Vantage Press.\n\n<p class=\"bibnote\">\nFergusen deals with the Clarke Collins controversy over determinism\nand free will. He considers critically Clarke’s response to\nSpinoza and Hobbes.</p></li>\n<li>Fox, Christopher, 1988, <em>Locke and the Scriblerians, Identity\nand Consciousness in Early Eighteenth Century Britain</em>, Berkeley,\nCA: University of California Press.\n\n<p class=\"bibnote\">\nA fine treatment of the seventeenth and early eighteenth century\ndebate over consciousness and personal identity that includes an\naccount of the Clarke Collins correspondence of 1707–08 and the\ninfluence it had on the Scriblerians.</p></li>\n<li>Harris, James A., 2005, <em>Of Liberty and Necessity, The Free\nWill Debate in Eighteenth Century British Philosophy</em>, Oxford:\nOxford University Press. doi:10.1093/0199268606.001.0001\n\n<p class=\"bibnote\">\nPuts the views of Clarke and Collins in the context of other views\nabout free will and determinism in the eighteenth century.</p></li>\n<li>Hefelbower, Samuel Gring, 1918, <em>The Relation of John Locke to\nEnglish Deism</em>, Chicago: University of Chicago Press.\n\n<p class=\"bibnote\">\nAn effort to characterize the defining features of English\nDeism</p></li>\n<li>Jacob, Margaret C., 1976, <em>The Newtonians and the English\nRevolution 1689–1720</em>, Ithaca, NY: Cornell University Press\n\n<p class=\"bibnote\">\nProfiles the latitudinarian Anglicans both before and after the\nRevolution of 1688 who used Newtonian natural philosophy as a basis\nfor justifying a particular social order against a materialistic,\nHobbesian philosophy that they regarded as atheistic that justified a\ncompeting social order. Jacob thus puts the controversies between\nClarke and Collins in a meaningful and interesting historical and\nintellectual context.</p></li>\n<li>Lennon, Thomas M. and Robert J. Stainton (eds), 2008, <em>The\nAchilles of Rationalist Psychology</em>, Dordrecht: Springer.\n\n<p class=\"bibnote\">\nA collection of articles dealing with a Kantian argument intended to\nshow the partless unity of the soul and variants of that argument. It\nincludes an article about the Clarke Collins correspondence focused in\npart on Collins conception of matter.</p></li>\n<li>Martin, Raymond and John Barresi, 2000, <em>The Naturalization of\nthe Soul: Self and Personal Identity in Eighteenth Century</em>,\nLondon: Routledge.\n\n<p class=\"bibnote\">\nDeals with the Clarke Collins correspondence of 1707–08 in the\ncontext of the history of the debate over consciousness and personal\nidentity in the seventeenth and eighteenth centuries.</p></li>\n<li>McIntyre, Jane L., 1994, “Hume: Second Newton of the Moral\nSciences”, <em>Hume Studies</em>, 20(1): 3–18.\n\n<p class=\"bibnote\">\nDeals with Hume’s relation to Clarke and Collins particularly in\nrelation to the issue of whether the self is simple or compounded, and\npersonal identity.</p></li>\n<li>McLaughlin, Brian P., 1992 [2008], “The Rise and Fall of\nBritish Emergentism”, in <em>Emergence or Reduction? Essays on\nthe Prospects of Nonreductive Physicalism</em>, Ansgar Beckermann,\nHans Flohr, and Jaegwon Kim (eds), Berlin: Walter de Gruyter.\nReprinted in Bedau and Humphreys 2008: 19–59.\ndoi:10.7551/mitpress/9780262026215.003.0003\n\n<p class=\"bibnote\">\nExplains the origins of the nineteenth and twentieth centuries’\nschool of British emergentist philosophers.</p></li>\n<li>Miller, Jon (ed.), 2009, <em>Topics in Early Modern Philosophy of\nMind</em> (Studies in the History of Philosophy of Mind: Volume 9),\nDordrecht: Springer. doi:10.1007/978-90-481-2381-0\n\n<p class=\"bibnote\">\nA collection of articles on European philosophers from Descartes to\nHume and including material about the Clarke Collins\ncorrespondence.</p></li>\n<li>Mijuskovic, Ben Lazare, 1974, <em>The Achilles of Rationalist\nArguments</em>, The Hague: Martinus Nijhoff.\n\n<p class=\"bibnote\">\nGives a history and analysis of the simplicity argument, central to\nClarke’s claims about consciousness and the soul, that Collins\nargues against in the Clarke Collins correspondence of 1707–08.\nHe discusses its uses in arguing for immortality and in questions\nabout personal identity.</p></li>\n<li>Mossner, Ernest Campbell, 1967, two articles in <em>The\nEncyclopedia of Philosophy</em>, volume 2, Paul Edwards (ed.), New\nYork: Macmillan.\n\n<ul class=\"hanging\">\n<li>1967a, “Anthony Collins”, pp. 144–146.\n\n<p class=\"bibnote\">\nProvides a good account of Collins, though significantly shorter and\nless detailed than the one provided here.</p></li>\n<li>1967b, “Deism”, pp. 326–336.\n\n<p class=\"bibnote\">\nProvides a fine overview of Deism both in England and on the continent\nwith brief biographies of both major and minor figures.</p></li>\n</ul></li>\n<li>O’Higgins, James, 1970, <em>Anthony Collins The Man and His\nWorks</em>, The Hague: Martinus Nijhoff.\n\n<p class=\"bibnote\">\nThe first full length study of Anthony Collins. The book is strong in\nits account of Collins’ life, his predecessors, his theological\nviews, and his influence on the continent. What is missing is depth in\nthe account of Collins’ philosophical views.</p></li>\n<li>Overhoff, Jurgen, 2000, <em>Hobbes’ Theory of the Will:\nIdeological Reasons and Historical Circumstances</em>, Lanham, MD:\nRowan &amp; Littlefield Publishers.\n\n<p class=\"bibnote\">\nProvides an excellent account of the nature of Hobbes’\ndeterminism and its context. This is helpful in assessing\nCollins’ place in the history of determinism.</p></li>\n<li>Perry, John (ed.), 2008, <em>Personal Identity</em>, 2nd edition,\nLos Angeles, CA: University of California Press.\n\n<p class=\"bibnote\">\nThe second edition of the book includes selections on personal\nidentity from the Clarke Collins correspondence of 1707–08 and\nan essay on Collins’ views on personal identity as well as many\nof the relevant chapters on personal identity from the early modern\nperiod as well as the twentieth century.</p></li>\n<li>Robertson, J. M., 1915, <em>A Short History of Freethought:\nAncient and Modern</em>, London: Watts &amp; Co.\n\n<p class=\"bibnote\">\nTreats Collins sympathetically in the context of the history of\nFreethinking.</p></li>\n<li>Rowe, William L., 1987, “Causality and Free Will in the\nControversy Between Collins and Clarke”, <em>Journal of the\nHistory of Philosophy</em>, 25(1): 51–67.\ndoi:10.1353/hph.1987.0008\n\n<p class=\"bibnote\">\nExamines the debate over free will between Collins and Clarke and\ncompares both views with those of Locke. Rowe explores assumptions the\ntwo sides have in common. His aim is to develop Clarke’s free\nagent theory.</p></li>\n<li>–––, 1991, <em>Thomas Reid on Freedom and\nReality</em>, Ithaca, NY: Cornell University Press.\n\n<p class=\"bibnote\">\nTreats Locke, Collins and Clarke’s views concerning free will\nand necessity as background for an exposition of the views of Thomas\nReid. Rowe sees Reid as giving the best account of libertarian free\nwill. In discussing the Clarke Collins interaction on determinism, he\nfocuses on Clarke’s account of agency as an important antecedent\nto Reid.</p></li>\n<li>Rozemond, Marleen, 2008, “The Achilles Argument and the\nNature of Matter in the Clarke Collins Correspondence”, in\nLennon and Stainton 2008: 159–175.\n\n<p class=\"bibnote\">\nTreats Clarke’s original argument as a variant of the Achilles\nof Rationalist arguments, finds the fundamental disagreement between\nClarke and Collins in their differing views of matter (apart from\ntheir disagreement about emergent properties and discusses\nClarke’s emergent soul.</p></li>\n<li>–––, 2009, “Can Matter Think? The\nMind–Body Problem in the Clarke–Collins\nCorrespondence”, in Miller 2009: 171–182.\ndoi:10.1007/978-90-481-2381-0_8\n\n<p class=\"bibnote\">\nDiscusses the debate between Clarke and Collins over emergent\nproperties and concludes that Collins abandoned his emergentism in\nfavor of a version of the mind-brain identity theory.</p></li>\n<li>Russell, Paul, 1995, “Hume’s ‘Treatise’\nand the Clarke Collins Controversy”, <em>Hume Studies</em>,\n21(1): 95–115. doi:10.1353/hms.2011.0074\n\n<p class=\"bibnote\">\nPuts the controversies between Clarke and Collins over materialism and\nfree will and determinism in context, summarizes the controversies\nthemselves, and then considers the influence these had on\nHume.</p></li>\n<li>Snobelen, Stephen, 1996, “The Argument over Prophecy: An\nEighteenth-Century Debate between William Whiston and Anthony\nCollins”, <em>Lumen: Selected Proceedings from the Canadian\nSociety for Eighteenth-Century Studies</em>, 15: 195–213.\ndoi:10.7202/1012482ar\n\n<p class=\"bibnote\">\nExplains the controversy between Collins and Whiston over the argument\nfrom prophecy and makes the point that Newton believed in the argument\nfrom prophecy and that Whiston is trying to apply Newtonian methods to\nbiblical prophecy.</p></li>\n<li>Stephen, Leslie, 1936, <em>History of English Thought in the\nEighteenth Century</em>, London: Watts &amp; Co.\n\n<p class=\"bibnote\">\nGives a detailed history of English Deism in both the seventeenth and\neighteenth centuries and on the continent. There are several chapters\ndevoted to Deism and one of these to Collins.</p></li>\n<li>Talbot, Ann, 2019, “Anthony Collins and China: The\nPhilosophical Impact of the Missionary Encounter”, <em>Journal\nof Early Modern History</em>, 23(4): 325–349.\ndoi:10.1163/15700658-12342629\n\n<p class=\"bibnote\">\nArgues that Collins found in the reports of the Jesuits about\nneo-Confucians, an atheistic and monistic ethic held by a government\nthat was tolerant of different religious views</p></li>\n<li>Tarantino, Giovanni, 2007, <em>Lo scrittoio di Anthony Collins\n(1676–1729). I libri e i tempi di un libero pensatore</em> (in\nItalian), Milan: Franco Angeli.\n\n<p class=\"bibnote\">\nThis catalog of Collins’ library, the third largest in England\nwhen he died, allows one to see what sources were available to Collins\nthe prolific writer.</p></li>\n<li>Thompson, Ann, 2008, <em>Bodies of Thought: Science, Religion and\nSoul in the Early Enlightenment</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199236190.001.0001\n\n<p class=\"bibnote\">\nProvides a detailed context for the Clarke Collins debate and follows\nthe debate up to mid-eighteenth century France.</p></li>\n<li>–––, 2010, “Animals, Humans, Machines and\nThinking Matter, 1690–1707”, <em>Early Science and\nMedicine</em>, 15(1–2): 3–37.\ndoi:10.1163/138374210X12589831573027\n\n<p class=\"bibnote\">\nProvides a context for Collins’ position about the similarities\nbetween animals and humans by explaining the views of a number of\nauthors leading up to the Clarke Collins correspondence.</p></li>\n<li>Toland, John, 1704 [2013], <em>Letters to Serena</em>, Ian Leask\n(ed.), Dublin, Four Court’s Press, 2013.\n\n<p class=\"bibnote\">\nA modern edition of the Letters with an interpretative introduction\nsuggesting that Toland uses arguments he learned from Leibniz to fix a\nproblem in the philosophy of Spinoza. Toland holds that motion is\nessential to matter.</p></li>\n<li>Torrey, Norman L., 1930, <em>Voltaire and the English Deists</em>,\nNew Haven, CT: Yale University Press.\n\n<p class=\"bibnote\">\nDiscusses the influence Collins had on Voltaire’s conversion to\ndeterminism.</p></li>\n<li>Uzgalis, William, 2008a, “Locke and Collins, Clarke and\nButler, on successive persons”, in Perry 2008: 315–326.\n\n<p class=\"bibnote\">\nArgues that Collins has a materialist Lockean theory of personal\nidentity and that nothing either Locke or Collins wrote committed them\nto a doctrine of successive persons as Bishop Butler alleged.</p></li>\n<li>––– (ed.), 2008b, “Selections from the\nClarke-Collins Correspondence”, in Perry 2008: 283–314.\n\n<p class=\"bibnote\">\nThis includes all of the material in the Clarke Collins correspondence\nof 1707–08 on personal identity.</p></li>\n<li>–––, 2009, “Anthony Collins on the\nEmergence of Consciousness and Personal Identity”,\n<em>Philosophy Compass</em>, 4(2): 363–379.\ndoi:10.1111/j.1747-9991.2009.00203.x\n\n<p class=\"bibnote\">\nArgues that Collins has an emergent account of consciousness and\ndefends a materialist version of Locke’s account of personal\nidentity.</p></li>\n<li>–––, 2018, “Minds and Persons in the\nClarke Collins Correspondence ”, in Copenhaver 2018: ch. 12.\n\n<p class=\"bibnote\">\nExamines some of the arguments, their strengths and weaknesses of the\ntwo protagonists in the Clarke Collins Correspondence.</p></li>\n<li>Vailati, Ezio, 1993, “Clarke’s Extended Soul”,\n<em>Journal of the History of Philosophy</em>, 31(3): 387–403.\ndoi:10.1353/hph.1993.0052\n\n<p class=\"bibnote\">\nArgues that Collins’ most successful arguments in the Collins\nClarke exchange of 1706–08 were against Clarke’s claim\nthat the soul is extended.</p></li>\n<li>–––, 1997, <em>Leibniz and Clarke: A Study of\ntheir Correspondence</em>, Oxford: Oxford University Press.\n\n<p class=\"bibnote\">\nTalks about the Clarke Collins correspondence to set the stage for the\nLeibniz Clarke Correspondence.</p></li>\n<li>Wimsatt, William C., 1997 [2008], “Aggregativity: Reductive\nHeuristics for Finding Emergence”, <em>Philosophy of\nScience</em>, 64(Suppl.2): S372–S384. Reprinted in Bedau and\nHumphreys 2008: 99–110.</li>\n<li>Woolhouse, Roger S., 2007, <em>Locke: A Biography</em>, Cambridge:\nCambridge University Press.\n\n<p class=\"bibnote\">\nThe most recent biography of Locke which includes an account of\nLocke’s relations with Collins in Locke’s old age and\nother valuable material.</p></li>\n<li>Yolton, John W., 1956, <em>Locke and the Way of Ideas</em>,\nOxford: Oxford University Press.\n\n<p class=\"bibnote\">\nYolton’s book has a section on the beginning phases of the\n“thinking matter” controversy in which we see that there\nwere a number of writers on both sides while Locke was alive and that\nLocke discussed some of these with Collins.</p></li>\n<li>–––, 1983, <em>Thinking Matter: Materialism in\nEighteenth Century Britain</em>, Minneapolis, MN: University of\nMinnesota Press.\n\n<p class=\"bibnote\">\nThis book begins with Locke’s account of the possibility of\n“thinking matter” and traces the controversy over this\nsuggestion well into the eighteenth century beginning with the Clarke\nCollins controversy of 1707–8</p></li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["analogy: medieval theories of", "Bayle, Pierre", "Berkeley, George", "Cambridge Platonists", "Clarke, Samuel", "consciousness", "determinism: causal", "emergent properties", "free will", "free will: divine foreknowledge and", "Hobbes, Thomas", "Locke, John", "personal identity"], "entry_link": [{"../analogy-medieval/": "analogy: medieval theories of"}, {"../bayle/": "Bayle, Pierre"}, {"../berkeley/": "Berkeley, George"}, {"../cambridge-platonists/": "Cambridge Platonists"}, {"../clarke/": "Clarke, Samuel"}, {"../consciousness/": "consciousness"}, {"../determinism-causal/": "determinism: causal"}, {"../properties-emergent/": "emergent properties"}, {"../freewill/": "free will"}, {"../free-will-foreknowledge/": "free will: divine foreknowledge and"}, {"../hobbes/": "Hobbes, Thomas"}, {"../locke/": "Locke, John"}, {"../identity-personal/": "personal identity"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=collins\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/collins/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=collins&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/collins/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=collins": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/collins/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=collins&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/collins/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"https://en.wikipedia.org/wiki/Anthony_Collins\" target=\"other\">Anthony Collins, entry in the <em>Wikipedia</em></a>.\n ", "<a href=\"https://openlibrary.org/subjects/person:anthony_collins_(1676-1729)\" target=\"other\">Anthony Collins Collection</a>,\n the Open Library’s collection of books by or related to Anthony\nCollins."], "listed_links": [{"https://en.wikipedia.org/wiki/Anthony_Collins": "Anthony Collins, entry in the Wikipedia"}, {"https://openlibrary.org/subjects/person:anthony_collins_(1676-1729)": "Anthony Collins Collection"}]}, "tokenized_text": ["1", "life", "work", "11", "life", "anthony", "collins", "born", "heston", "middlesex", "june", "21", "1676", "family", "lawyer", "went", "eton", "king", "college", "cambridge", "1693", "though", "graduated", "cambridge", "collins", "went", "middle", "temple", "1694", "study", "law", "like", "law", "never", "called", "bar", "1698", "married", "daughter", "rich", "london", "merchant", "sir", "francis", "child", "died", "childbirth", "1703", "time", "marriage", "received", "property", "essex", "father", "together", "wife", "dowry", "made", "rich", "man", "indeed", "collins", "met", "john", "locke", "visit", "oates", "essex", "1703", "visited", "locke", "five", "time", "next", "18", "month", "carried", "correspondence", "various", "philosophical", "topic", "one", "letter", "collins", "locke", "remarked", "believe", "good", "friend", "love", "truth", "truth", "sake", "principal", "part", "human", "perfection", "world", "seed", "bed", "virtue", "mistake", "much", "ever", "met", "anybody", "collins", "lifelong", "bibliophile", "large", "private", "research", "library", "article", "collins", "birch", "dictionary", "birch", "note", "large", "curious", "library", "open", "men", "letter", "readily", "communicated", "light", "assistance", "power", "even", "furnished", "antagonist", "book", "confute", "directed", "give", "argument", "force", "capable", "birch", "quoted", "berman", "1975", "50", "period", "collins", "also", "met", "samuel", "bold", "john", "toland", "1703", "1706", "wife", "death", "collins", "spent", "winter", "london", "summer", "fine", "summer", "mansion", "buckinghamshirewhere", "queen", "anne", "court", "visited", "1707", "collins", "began", "pamphlet", "controversy", "samuel", "clarke", "prominent", "british", "philosopher", "member", "newton", "inner", "circle", "question", "whether", "matter", "think", "controversy", "continued", "1708", "1707", "collins", "also", "published", "anonymously", "essay", "concerning", "use", "reason", "proposition", "evidence", "whereof", "depends", "human", "testimony", "period", "collins", "frequented", "london", "coffee", "shop", "deist", "freethinkers", "met", "berkeley", "apparently", "met", "gathering", "1713", "1710", "collins", "made", "first", "trip", "continent", "spending", "time", "buying", "book", "holland", "meeting", "john", "churchill", "first", "duke", "marlborough", "prince", "eugene", "back", "england", "collins", "met", "several", "time", "samuel", "clarke", "william", "whiston", "house", "lady", "calverly", "sir", "john", "hubern", "frequent", "friendly", "debate", "truth", "bible", "christian", "religion", "whiston", "quoted", "higgins", "1970", "77", "1713", "published", "discourse", "concerning", "freethinking", "discourse", "controversial", "work", "made", "second", "trip", "continent", "time", "discourse", "published", "went", "holland", "france", "planned", "go", "italy", "trip", "cut", "short", "death", "close", "kinsman", "1715", "collins", "effect", "took", "root", "essex", "moving", "mowdon", "hall", "collins", "probably", "owned", "good", "2000", "acre", "essex", "much", "prime", "agricultural", "land", "1717", "published", "philosophical", "enquiry", "concerning", "human", "liberty", "argues", "compatibilist", "form", "determinism", "reject", "freedom", "samuel", "clarke", "reviewed", "book", "continuing", "argument", "begun", "clarke", "collins", "correspondence", "170708", "1717", "collins", "spent", "time", "country", "still", "keen", "interest", "national", "politics", "distance", "local", "politics", "person", "collins", "whig", "became", "spokesman", "whig", "country", "collins", "took", "serious", "role", "government", "essexserving", "justice", "commissioner", "tax", "treasurer", "county", "examined", "road", "bridge", "involved", "finding", "place", "housing", "county", "record", "treasurer", "model", "integrity", "considering", "relation", "collins", "county", "official", "collins", "writer", "higgins", "note", "collins", "probably", "le", "tolerant", "towards", "catholic", "justice", "higgins", "1970", "1289", "collins", "writer", "consistently", "anticatholic", "one", "might", "hope", "use", "reason", "would", "produce", "higher", "degree", "toleration", "towards", "religious", "group", "one", "would", "expect", "find", "among", "true", "believer", "seems", "little", "conflict", "writer", "jurist", "december", "1723", "collins", "son", "suddenly", "became", "ill", "died", "father", "griefstricken", "collins", "remarried", "1724", "published", "perhaps", "successful", "book", "discourse", "ground", "reason", "christian", "religion", "well", "historical", "critical", "essay", "thirty", "nine", "article", "church", "england", "1725", "1729", "collins", "health", "began", "deteriorate", "still", "1726", "published", "scheme", "literal", "prophecy", "considered", "1729", "collins", "published", "discourse", "concerning", "ridicule", "irony", "writing", "suffering", "gall", "stone", "finally", "died", "disease", "december", "13", "1729", "second", "wife", "elisabeth", "two", "daughter", "survived", "willed", "unpublished", "manuscript", "pierre", "desmaizeaux", "desmaizeaux", "took", "offer", "collins", "widow", "buy", "desmaizeaux", "quickly", "regretted", "decision", "late", "accused", "elisabeth", "collins", "giving", "collins", "unpublished", "paper", "bishop", "lincoln", "denied", "story", "true", "willed", "collins", "unpublished", "paper", "friend", "became", "still", "mystery", "12", "chief", "work", "essay", "concerning", "use", "reason", "1707", "collins", "contribution", "clarke", "collins", "controversy", "letter", "mr", "dodwell", "1706", "reply", "mr", "clarke", "defence", "letter", "mr", "dodwell", "reflection", "mr", "clarke", "second", "defence", "letter", "mr", "dodwell", "answer", "mr", "clarke", "third", "defence", "letter", "mr", "dodwell", "1708", "priestcraft", "perfection", "1710", "vindication", "divine", "attribute", "remark", "grace", "archbishop", "dublin", "sermon", "intitled", "divine", "predestination", "consistent", "freedom", "man", "1710", "discourse", "freethinking", "1713", "philosophical", "inquiry", "concerning", "human", "liberty", "1717", "discourse", "ground", "reason", "christian", "religion", "1724", "historical", "critical", "essay", "thirty", "nine", "article", "church", "england", "1724", "scheme", "literal", "prophecy", "considered", "1726", "discourse", "concerning", "ridicule", "irony", "writing", "1729", "2", "clarke", "collins", "correspondence", "170708", "21", "background", "consciousness", "material", "system", "chief", "topic", "clarke", "collins", "controversy", "170708", "whether", "consciousness", "inhere", "material", "system", "highly", "controversial", "issue", "largely", "inspired", "case", "locke", "notorious", "speculation", "thinking", "matter", "book", "iv", "essay", "concerning", "human", "understanding", "stressing", "limit", "human", "knowledge", "substance", "locke", "writes", "idea", "matter", "thinking", "possibly", "shall", "never", "able", "know", "whether", "mere", "material", "think", "impossible", "u", "contemplation", "idea", "without", "revelation", "discover", "whether", "omnipotency", "given", "system", "matter", "fitly", "disposed", "power", "perceive", "think", "else", "joined", "fixed", "matter", "disposed", "thinking", "immaterial", "substance", "locke", "1690", "iv", "iii", "6", "1975", "5401", "locke", "went", "conjecture", "might", "easy", "god", "add", "power", "thought", "system", "matter", "organized", "right", "way", "god", "connect", "immaterial", "thinking", "thing", "body", "ibid", "clearly", "difficulty", "explaining", "immaterial", "mind", "could", "relate", "material", "body", "play", "significant", "role", "leading", "locke", "position", "thinking", "matter", "passage", "raised", "storm", "protest", "discussion", "lasted", "right", "last", "year", "eighteenth", "century", "yolton", "1983", "17", "one", "first", "protest", "came", "bishop", "stillingfleet", "locke", "response", "help", "u", "better", "understand", "thinking", "matter", "hypothesis", "starting", "god", "creation", "matter", "locke", "go", "series", "superadditions", "motion", "matter", "life", "excellency", "vegetation", "rose", "peach", "tree", "sense", "spontaneous", "motion", "property", "elephant", "note", "objection", "god", "performing", "action", "upon", "matter", "object", "next", "step", "superadding", "power", "matter", "make", "thinking", "intelligent", "material", "thing", "thus", "superaddition", "seems", "involve", "creation", "organization", "matter", "particular", "functional", "power", "characteristic", "different", "kind", "living", "thing", "locke", "collins", "discussed", "response", "thinking", "matter", "passage", "published", "locke", "death", "1704", "locke", "conjecture", "thinking", "matter", "effect", "centerpiece", "debate", "samuel", "clarke", "anthony", "collins", "1707", "1708", "although", "issue", "also", "discussed", "continent", "still", "ann", "thompson", "writes", "body", "thought", "shall", "observe", "despite", "undeniable", "importance", "locke", "hypothesis", "argument", "put", "forward", "second", "reply", "stillingfleet", "seen", "starting", "point", "speculation", "soul", "part", "ongoing", "philosophical", "theological", "discussion", "locke", "argument", "probably", "provided", "new", "stimulus", "discussion", "claim", "hypothesis", "constituted", "sole", "impetus", "late", "seventeenth", "century", "materialistic", "work", "ignore", "preceding", "theological", "debate", "thompson", "2008", "58", "diverse", "strand", "debate", "catholic", "church", "fifth", "lateran", "council", "1553", "declared", "soul", "immaterial", "therefore", "immortal", "philosopher", "invited", "produce", "proof", "soul", "immateriality", "tradition", "going", "back", "plato", "soul", "unity", "without", "part", "presumably", "part", "fall", "apart", "kind", "substance", "dualism", "one", "find", "descartes", "example", "intended", "distinguish", "human", "animal", "england", "new", "science", "regarded", "suspiciously", "religious", "conservative", "proponent", "saw", "ally", "religion", "robert", "boyle", "provided", "series", "lecture", "would", "use", "new", "science", "defend", "religious", "orthodoxy", "boyle", "lecture", "aimed", "defending", "religion", "atheist", "deist", "epicurean", "philosopher", "well", "hobbes", "spinoza", "follower", "one", "richard", "bently", "sermon", "1692", "titled", "matter", "motion", "think", "bently", "claimed", "even", "god", "omnipotence", "could", "produce", "cognitive", "body", "thompson", "2008", "61", "claim", "limit", "god", "omnipotence", "shocking", "samuel", "clarke", "gave", "boyle", "lecture", "two", "year", "row", "1704", "1705", "published", "together", "discourse", "concerning", "attribute", "god", "obligation", "natural", "religion", "truth", "certainty", "christian", "revelation", "quite", "likely", "collins", "read", "work", "opposed", "clarke", "surely", "knew", "philosophical", "position", "dealing", "side", "mechanical", "philosophy", "descartes", "mersenne", "gassendi", "played", "role", "materialist", "side", "debate", "insofar", "animal", "could", "treated", "like", "machine", "became", "possible", "one", "argue", "human", "sufficiently", "like", "animal", "could", "treated", "machine", "thus", "immaterial", "soul", "could", "dispensed", "also", "medical", "treatise", "suggested", "matter", "active", "soul", "dy", "body", "work", "hobbes", "spinoza", "argued", "materialistic", "monism", "1704", "john", "toland", "published", "letter", "serena", "argues", "motion", "essential", "matter", "finally", "christian", "mortalist", "strand", "protestantism", "one", "strand", "christian", "mortalists", "claimed", "derive", "mortalism", "scripture", "alone", "urged", "immaterial", "soul", "platonic", "invention", "foisted", "christianity", "dispensed", "england", "movement", "traced", "back", "far", "william", "tindale", "sixteenth", "century", "included", "luminary", "overton", "milton", "hobbes", "henry", "dodwell", "well", "respected", "biblical", "scholar", "one", "figure", "tradition", "22", "correspondence", "correspondence", "clarke", "collins", "took", "rise", "book", "published", "1706", "henry", "dodwell", "dodwell", "claimed", "basis", "various", "passage", "bible", "without", "divine", "intervention", "soul", "would", "perish", "death", "clarke", "wrote", "public", "refutation", "dodwell", "book", "besides", "rejecting", "dodwell", "interpretation", "scripture", "clarke", "gave", "single", "argument", "show", "consciousness", "could", "property", "material", "system", "since", "plausible", "reason", "apart", "appeal", "scripture", "soul", "naturally", "mortal", "material", "clarke", "claim", "matter", "divisible", "substance", "consisting", "always", "separablenay", "actually", "separate", "distinct", "partsit", "plain", "unless", "essentially", "consciousin", "case", "every", "particle", "matter", "must", "consist", "innumerable", "separate", "distinct", "consciousnessesno", "system", "possible", "composition", "division", "individual", "conscious", "clarke", "1738", "1928", "757", "clarke", "collins", "2011", "48", "clarke", "went", "pose", "thought", "experiment", "imagine", "three", "three", "hundred", "particle", "mile", "given", "distance", "one", "another", "ibid", "clarke", "claim", "collection", "particle", "could", "constitute", "one", "individual", "conscious", "u", "supposes", "particle", "brought", "together", "touch", "one", "another", "thereby", "motion", "composition", "whatever", "become", "whit", "le", "truly", "distinct", "being", "greatest", "distance", "disposed", "possible", "system", "make", "one", "individual", "conscious", "ibid", "clarke", "argument", "effect", "denies", "organization", "play", "role", "unifying", "part", "whole", "clarke", "argument", "without", "mentioning", "locke", "name", "refutation", "locke", "thinking", "matter", "hypothesis", "collins", "writing", "dodwell", "concerning", "matter", "disagreed", "noted", "would", "happy", "see", "dodwell", "liberty", "publish", "whatever", "think", "fit", "dybikowski", "2011", "188", "collins", "wrote", "public", "letter", "mr", "dodwell", "claimed", "show", "clarke", "philosophical", "argument", "mortality", "soul", "inconclusive", "clarke", "responded", "defence", "letter", "mr", "dodwell", "next", "two", "year", "clarke", "wrote", "three", "defense", "original", "letter", "henry", "dodwell", "collins", "wrote", "three", "reply", "longer", "predecessor", "clarke", "became", "increasingly", "irritated", "debate", "continued", "got", "final", "word", "fourth", "defence", "letter", "central", "issue", "correspondence", "whether", "possible", "consciousness", "inhere", "material", "system", "thus", "matter", "think", "discussion", "toward", "end", "turned", "issue", "free", "determinism", "adequacy", "collins", "account", "personal", "identity", "rather", "explain", "correspondence", "detail", "follows", "discussion", "collins", "position", "respect", "two", "central", "issue", "emergent", "property", "personal", "identity", "2", "221", "clarke", "category", "give", "materialist", "account", "life", "consciousness", "collins", "need", "show", "lifeless", "unthinking", "matter", "one", "get", "life", "thought", "letter", "dodwell", "collins", "claim", "material", "system", "u", "whose", "part", "property", "found", "whole", "give", "example", "rose", "power", "produce", "sweet", "scent", "u", "particle", "compose", "individually", "power", "clarke", "1738", "1928", "751", "clarke", "collins", "2011", "489", "material", "system", "provide", "model", "analogy", "understand", "life", "consciousness", "arise", "lifeless", "thoughtless", "particle", "thus", "beginning", "collins", "arguing", "consciousness", "emergent", "property", "ie", "property", "whole", "part", "compose", "whole", "first", "defence", "clarke", "responds", "giving", "argument", "show", "real", "emergent", "property", "giving", "enumeration", "kind", "property", "turn", "three", "category", "category", "correspond", "roughly", "primary", "secondary", "tertiary", "quality", "mechanical", "philosophy", "attfield", "1977", "46", "correspondence", "precise", "clarke", "claim", "categorizing", "property", "property", "belong", "matter", "thus", "includes", "consciousness", "first", "category", "though", "different", "basis", "first", "category", "property", "matter", "magnitude", "motion", "clarke", "claim", "property", "first", "kind", "real", "property", "second", "kind", "really", "quality", "system", "evidently", "proper", "sense", "belong", "effect", "occasionally", "produced", "substance", "truly", "quality", "mode", "substance", "produced", "clarke", "1738", "1928", "759", "clarke", "collins", "2011", "56", "heat", "light", "taste", "sound", "example", "class", "property", "clarke", "claim", "property", "largely", "irrelevant", "question", "consciousness", "mode", "substance", "produced", "claim", "inaccurately", "collins", "example", "smell", "rose", "belongs", "class", "property", "third", "kind", "fictional", "real", "quality", "residing", "subject", "merely", "abstract", "name", "express", "effect", "determinate", "motion", "certain", "stream", "matter", "clarke", "1738", "1928", "760", "clarke", "collins", "2011", "57", "example", "clarke", "give", "third", "category", "property", "magnetism", "electrical", "attraction", "gravity", "condition", "required", "belonging", "clarke", "first", "class", "respect", "material", "whole", "clarke", "reductionist", "hold", "whatever", "real", "property", "one", "find", "whole", "must", "found", "proportionally", "part", "height", "brick", "mortar", "wall", "sum", "height", "wall", "whole", "thus", "property", "material", "whole", "composition", "property", "part", "call", "clarke", "composition", "principle", "property", "material", "system", "fails", "conform", "pattern", "real", "property", "follows", "emergent", "property", "property", "possessed", "whole", "part", "real", "result", "examination", "kind", "category", "clarke", "claim", "property", "whole", "proportionally", "present", "part", "belong", "third", "class", "class", "fictional", "property", "follows", "since", "consciousness", "real", "property", "emergent", "property", "since", "consciousness", "real", "property", "must", "belong", "clarke", "first", "class", "property", "would", "seem", "could", "violate", "composition", "principle", "consciousness", "clarke", "account", "strongly", "unified", "either", "compounded", "divided", "belong", "material", "system", "must", "second", "sufficient", "condition", "belonging", "clarke", "first", "category", "clarke", "second", "sufficient", "condition", "individual", "power", "properly", "strictly", "speakingcan", "proceed", "reside", "individual", "clarke", "1738", "1928", "750", "clarke", "collins", "2011", "58", "individual", "power", "clarke", "tell", "u", "power", "must", "truly", "unitary", "thus", "composed", "part", "call", "individual", "power", "principle", "consciousness", "individual", "power", "belongs", "individual", "soul", "soul", "unified", "part", "magnitude", "contrast", "satisfies", "composition", "principle", "individual", "power", "matter", "belongs", "always", "divided", "precisely", "actually", "divided", "underlying", "clarke", "category", "rejection", "possibility", "whole", "property", "possessed", "part", "principle", "material", "property", "magnitude", "motion", "solidity", "material", "property", "property", "kind", "may", "result", "kind", "restriction", "said", "apply", "mental", "property", "call", "homogeneity", "principle", "principle", "turn", "related", "called", "heirloom", "theory", "causality", "idea", "whatever", "end", "effect", "must", "cause", "effect", "otherwise", "one", "get", "contradiction", "something", "come", "nothing", "given", "property", "whole", "part", "3", "later", "third", "defense", "argument", "clarke", "call", "collins", "attention", "fact", "proof", "existence", "god", "book", "iv", "essay", "concerning", "human", "understanding", "locke", "invokes", "homogeneity", "principle", "argue", "eternal", "immaterial", "thinking", "could", "arise", "matter", "clarke", "1738", "1928", "837", "clarke", "collins", "2011", "170171", "clarke", "hold", "put", "end", "locke", "claim", "god", "could", "easily", "make", "matter", "organized", "right", "way", "think", "return", "consider", "outcome", "debate", "marleen", "rozemond", "article", "2008", "writes", "clarke", "position", "something", "made", "matter", "never", "constitute", "genuine", "individual", "infinitely", "divisible", "lack", "required", "unity", "note", "similarity", "score", "clarke", "position", "leibniz", "rozemond", "2008", "175", "one", "might", "think", "whole", "least", "one", "obeyed", "composition", "principle", "would", "real", "individual", "turn", "case", "magnitude", "collected", "particle", "real", "property", "whole", "genuine", "individual", "real", "individual", "part", "locke", "collins", "agree", "clarke", "matter", "infinitely", "divisible", "disagree", "role", "organization", "play", "producing", "real", "unified", "whole", "part", "clarke", "hold", "organization", "unify", "whole", "individual", "locke", "collins", "hold", "time", "time", "notably", "case", "living", "thing", "matter", "composing", "individual", "change", "organization", "persists", "clarke", "hold", "soon", "whole", "loses", "gain", "single", "particle", "becomes", "different", "substance", "reply", "mr", "clarke", "defense", "letter", "mr", "dodwell", "collins", "challenge", "enumeration", "category", "property", "clarke", "seek", "prove", "consciousness", "belong", "material", "system", "clarke", "1738", "vol", "3", "751", "76770", "clarke", "collins", "2011", "6972", "continues", "maintain", "consciousness", "real", "emergent", "property", "also", "challenge", "individual", "power", "principle", "222", "real", "emergent", "property", "responding", "clarke", "defense", "collins", "claim", "clarke", "properly", "enumerated", "kind", "property", "claim", "clarke", "need", "show", "enumeration", "complete", "done", "may", "power", "unknown", "clarke", "need", "included", "order", "give", "complete", "enumeration", "property", "power", "matter", "order", "effectively", "defend", "materialist", "account", "consciousness", "however", "collins", "point", "new", "class", "property", "arguably", "real", "emergent", "fit", "clarke", "composition", "model", "real", "property", "matter", "collins", "chief", "strategy", "showing", "real", "emergent", "property", "likely", "derived", "locke", "claim", "chapter", "identity", "diversity", "essay", "living", "thing", "individuated", "matter", "composes", "time", "functional", "organization", "locke", "1975", "ii", "xxvii", "34", "330331", "see", "also", "attfield", "1977", "52", "4", "collins", "begin", "considering", "different", "role", "matter", "organization", "may", "play", "producing", "different", "kind", "thing", "universe", "start", "hypothesis", "different", "part", "matter", "different", "one", "another", "particle", "matter", "may", "work", "way", "different", "part", "clock", "workthe", "part", "clock", "different", "one", "another", "consequently", "different", "power", "whole", "contribute", "power", "none", "part", "clarke", "1738", "1928", "768", "clarke", "collins", "2011", "72", "second", "hypothesis", "collins", "put", "forth", "matter", "therefore", "completely", "interchangeable", "collins", "prefers", "hypothesis", "make", "easy", "argue", "difference", "various", "kind", "thing", "result", "organization", "distinction", "matter", "organization", "useful", "collins", "purpose", "property", "result", "organization", "matter", "different", "property", "particle", "collins", "note", "if", "power", "system", "matter", "may", "intirely", "cease", "upon", "least", "alteration", "part", "system", "evident", "power", "system", "inhere", "part", "sense", "magnitude", "motion", "divide", "vary", "part", "matter", "much", "magnitude", "may", "motion", "divide", "vary", "least", "part", "eye", "power", "contributing", "act", "vision", "intirely", "end", "clarke", "1738", "1928", "768", "clarke", "collins", "2011", "72", "organization", "eye", "essential", "proper", "functioning", "indeed", "eye", "clarke", "1738", "1928", "769", "clarke", "collins", "2011", "72", "emergent", "property", "collins", "explicitly", "make", "point", "since", "organization", "eye", "essential", "property", "must", "also", "real", "property", "perhaps", "thought", "obvious", "clarke", "response", "claim", "power", "eye", "see", "fictional", "real", "property", "clarke", "1738", "790", "clarke", "collins", "2011", "100", "serious", "engagement", "emergent", "property", "really", "take", "place", "nineteenth", "twentieth", "century", "variety", "different", "version", "emergentism", "scientific", "philosophical", "many", "bear", "hardly", "resemblance", "collins", "account", "property", "whole", "part", "whole", "however", "article", "aggregativity", "reductive", "heuristic", "finding", "emergence", "william", "wimsatt", "describes", "version", "distinction", "emergent", "nonemergent", "property", "coming", "complexity", "theory", "improves", "articulates", "insight", "make", "collins", "account", "interesting", "though", "wimsatt", "unaware", "historical", "precedent", "wimsatt", "1997", "2008", "insight", "property", "result", "organization", "part", "essentially", "emergent", "even", "ultimately", "explained", "change", "status", "emergent", "property", "see", "also", "uzgalis", "2018", "272", "223", "personal", "identity", "topic", "personal", "identity", "come", "early", "clarke", "second", "defence", "argument", "clarke", "object", "consciousness", "emergent", "property", "brain", "also", "object", "brain", "bearer", "seat", "personal", "identity", "clarke", "1738", "1928", "787", "clarke", "collins", "2011", "96", "correspondingly", "important", "connection", "collins", "account", "emergent", "property", "account", "personal", "identity", "consciousness", "collins", "emergent", "property", "constitutive", "personal", "identity", "addition", "collins", "claim", "mindbody", "problem", "dualist", "view", "serve", "end", "purpose", "religion", "clarke", "reply", "collins", "materialist", "view", "useless", "dangerous", "consequence", "end", "purpose", "religion", "many", "consequence", "personal", "identity", "connection", "collins", "account", "emergent", "property", "account", "personal", "identity", "important", "connection", "lockean", "distinction", "matter", "composes", "material", "thing", "given", "time", "organization", "matter", "distinction", "come", "locke", "account", "individuation", "mass", "matter", "living", "thing", "chapter", "identity", "diversity", "book", "ii", "essay", "concerning", "human", "understanding", "mass", "matter", "individuated", "particle", "compose", "however", "organized", "mass", "gain", "loses", "single", "particle", "becomes", "different", "substance", "living", "thing", "contrast", "individuated", "functional", "organization", "locke", "1690", "ii", "xxvii", "3", "1975", "330", "collins", "summary", "view", "identity", "personal", "identity", "make", "clear", "agrees", "almost", "completely", "locke", "account", "identity", "individuation", "mass", "living", "thing", "person", "clarke", "1738", "1928", "875", "clarke", "collins", "2011", "231232", "clarke", "insists", "order", "something", "remain", "must", "remain", "substance", "case", "material", "thing", "like", "oak", "mean", "matter", "composes", "must", "remain", "oak", "atom", "soul", "god", "fulfill", "substance", "condition", "clarke", "oak", "identical", "fictional", "sense", "addition", "possible", "entity", "property", "previously", "substance", "changed", "possible", "transfer", "property", "one", "substance", "another", "clarke", "1738", "1928", "798", "clarke", "collins", "2011", "113", "clarke", "hold", "emergent", "property", "fictional", "hold", "identity", "based", "identity", "substance", "fictional", "clash", "two", "metaphysical", "importance", "organization", "fundamental", "different", "view", "emergent", "property", "identity", "personal", "identity", "collins", "accepts", "locke", "revolutionary", "view", "consciousness", "substantial", "soul", "bearer", "personal", "identity", "agreeing", "locke", "regard", "memory", "crucial", "personal", "identity", "feeling", "pleasure", "pain", "important", "concomitant", "consciousness", "still", "collins", "account", "personal", "identity", "exactly", "locke", "locke", "account", "officially", "neutral", "regard", "whether", "substance", "think", "u", "material", "immaterial", "simple", "compounded", "locke", "1690", "ii", "xxvii", "17", "1975", "341", "collins", "contrast", "giving", "account", "make", "substance", "think", "u", "material", "compounded", "neutrality", "locke", "account", "personal", "identity", "ought", "allow", "collins", "adopt", "without", "significant", "change", "collins", "also", "defends", "view", "attack", "addressed", "concept", "memory", "involved", "clarke", "hold", "collins", "account", "memory", "violates", "basic", "principle", "clarke", "substantialist", "account", "identitythat", "property", "transferred", "one", "substance", "another", "particle", "brain", "changed", "memory", "veridical", "memory", "new", "substance", "locke", "collins", "contrast", "hold", "representation", "event", "transferred", "one", "substance", "another", "constitute", "genuine", "memory", "clarke", "1738", "1028", "787", "clarke", "collins", "2011", "96", "collins", "response", "claim", "annexing", "consciousness", "brain", "explains", "phenomenon", "consciousness", "far", "better", "positing", "unchanging", "immaterial", "substance", "also", "perfectly", "reasonable", "sense", "property", "transferred", "one", "substance", "another", "reflection", "mr", "clarke", "second", "defence", "writes", "utterly", "forget", "cease", "conscious", "done", "many", "thing", "former", "part", "life", "certainly", "much", "conscious", "done", "fact", "degree", "forget", "everything", "revive", "frequent", "recollection", "imprinting", "decaying", "idea", "determinate", "time", "partial", "total", "flux", "particle", "brain", "better", "account", "total", "forgetfulness", "thing", "partial", "forgetfulness", "others", "suppose", "substance", "brain", "constant", "flux", "clarke", "1738", "1928", "787", "809", "clarke", "collins", "2011", "130", "problem", "transferring", "consciousness", "one", "substance", "another", "writes", "suppose", "conscious", "forty", "carried", "market", "fair", "five", "year", "old", "without", "particle", "matter", "age", "order", "retain", "consciousness", "action", "necessary", "revive", "idea", "considerable", "flux", "particle", "otherwise", "must", "totally", "lose", "memory", "several", "thing", "done", "childhood", "reviving", "idea", "action", "imprint", "afresh", "consciousness", "done", "action", "brain", "lively", "impression", "consciousness", "though", "entirely", "composed", "particle", "day", "action", "ibid", "account", "memory", "work", "nicely", "fit", "model", "preservation", "organization", "change", "matter", "locke", "us", "explain", "identity", "living", "thing", "however", "clarke", "accept", "explanation", "hold", "theory", "substantial", "soul", "provide", "underpinnings", "account", "veridical", "memory", "clarke", "1738", "1928", "787", "clarke", "collins", "2011", "180", "23", "evaluating", "clarke", "collins", "correspondence", "one", "might", "ask", "debate", "eighteenth", "century", "answer", "largely", "depended", "whether", "dualist", "materialist", "dualist", "saw", "clarke", "winner", "materialist", "saw", "collins", "winner", "2009", "article", "focusing", "collins", "emergentism", "marleen", "rozemond", "give", "account", "way", "think", "dialogue", "proceeded", "concludes", "clarke", "victor", "hold", "collins", "fact", "conceded", "crucial", "point", "result", "subsequently", "changed", "position", "order", "understand", "think", "need", "grasp", "distinction", "collins", "make", "numerical", "generical", "power", "reflection", "mr", "clarke", "second", "defence", "letter", "mr", "dodwell", "writes", "numerical", "power", "understand", "power", "motion", "figure", "specie", "power", "eye", "contribute", "towards", "seeing", "specie", "motion", "roundness", "body", "specie", "figure", "generical", "power", "understand", "several", "specie", "numerical", "powersas", "motion", "signifies", "various", "specie", "motion", "figure", "various", "specie", "figure", "clarke", "1738", "1928", "805806", "clarke", "collins", "2011", "124125", "rozemond", "note", "making", "distinction", "collins", "admits", "generical", "power", "conform", "homogeneity", "principle", "2008", "article", "rozemond", "claim", "locke", "accept", "emergent", "property", "possible", "proof", "existence", "god", "chapter", "10", "book", "iv", "essay", "concerning", "human", "understanding", "invokes", "homogeneity", "principle", "show", "eternal", "intelligent", "could", "created", "matter", "rozemond", "2008163", "fact", "clarke", "draw", "collins", "attention", "passage", "essay", "clarke", "1738", "1928", "837", "clarke", "collins", "2011", "170171", "reference", "homogeneity", "principle", "essay", "would", "difficult", "see", "locke", "could", "also", "maintain", "would", "possible", "god", "cause", "matter", "think", "even", "arranged", "right", "way", "clarke", "point", "collins", "basis", "give", "idea", "thinking", "matter", "possible", "take", "rozemond", "point", "well", "hold", "saying", "homogeneity", "principle", "applies", "generical", "power", "collins", "conceding", "crucial", "point", "rozemond", "note", "one", "way", "collins", "could", "proceeded", "one", "way", "reject", "clarke", "position", "reject", "qualitative", "constraint", "causation", "one", "could", "becoming", "humean", "causation", "collins", "world", "wait", "another", "hume", "rozemond", "2009", "1867", "view", "collins", "give", "possibility", "emergent", "property", "kind", "empiricist", "theory", "causality", "hume", "seem", "alternative", "claim", "collins", "substantively", "change", "position", "suggesting", "consciousness", "mode", "motion", "take", "quite", "unattractive", "version", "mindbrain", "identity", "theory", "rozemond", "2009", "187", "however", "alternative", "view", "correspondence", "end", "view", "collins", "changed", "position", "least", "changed", "way", "rozemond", "suggests", "conceding", "nothing", "clarke", "introducing", "distinction", "numerical", "generical", "power", "writes", "set", "forth", "entire", "strength", "said", "instance", "answer", "set", "dispute", "clearer", "light", "possibly", "hitherto", "perhaps", "give", "mr", "clarke", "particular", "satisfaction", "relation", "inconclusiveness", "hiss", "argument", "detecting", "conceive", "previously", "imposed", "upon", "clarke", "1738", "1928", "805", "clarke", "collins", "2011", "124", "response", "clarke", "attack", "example", "make", "distinction", "numerical", "generical", "property", "hardly", "word", "someone", "concede", "decisive", "point", "debated", "couple", "possibility", "collins", "mind", "numerical", "power", "one", "numerical", "power", "would", "include", "power", "conform", "composition", "principle", "figure", "motion", "power", "power", "eye", "see", "generical", "power", "contrast", "simply", "treat", "power", "numerically", "different", "different", "kind", "motion", "motion", "thus", "material", "power", "treated", "generical", "conform", "homogeneity", "principle", "clarke", "1738", "1928", "806807", "clarke", "collins", "2011", "2830", "second", "possibility", "example", "collins", "give", "really", "suggest", "numerical", "power", "emergent", "conform", "composition", "principle", "generical", "power", "hand", "conform", "homogeneity", "principle", "second", "interpretation", "true", "collins", "think", "clarke", "first", "category", "power", "least", "favorite", "one", "treated", "whole", "property", "part", "would", "indeed", "change", "position", "opposite", "direction", "one", "rozemond", "supposes", "even", "second", "interpretation", "generical", "property", "conform", "homogeneity", "principle", "collins", "trouble", "way", "rozemond", "claim", "answer", "use", "homogeneity", "principle", "locke", "proof", "existence", "god", "reference", "principle", "locke", "essay", "replying", "clarke", "answer", "mr", "clarke", "third", "defense", "letter", "mr", "dodell", "collins", "point", "clarke", "locke", "distinguished", "two", "situation", "involving", "homogeneity", "principle", "clarke", "1738", "1928", "868", "clarke", "collins", "2011", "220221", "proof", "existence", "god", "immaterial", "intelligence", "principle", "applies", "full", "force", "show", "matter", "could", "create", "eternal", "immaterial", "intelligent", "second", "case", "creation", "human", "thought", "second", "case", "locke", "supposes", "omnipotent", "immaterial", "god", "exists", "god", "omnipotent", "could", "violate", "principle", "homogeneity", "fact", "locke", "claim", "god", "fact", "done", "case", "secondary", "property", "color", "sound", "produced", "mind", "bear", "resemblance", "cause", "idea", "material", "world", "motion", "brain", "thus", "locke", "hold", "good", "reason", "think", "god", "could", "produce", "thinking", "matter", "explicit", "contradiction", "two", "case", "knowing", "people", "thought", "use", "homogeneity", "principle", "proof", "existence", "god", "ruled", "possibility", "thinking", "matter", "locke", "1690", "iv", "iii", "6", "1975", "541", "collins", "adopts", "position", "well", "clarke", "1738", "1928", "837", "clarke", "collins", "2011", "170171", "see", "also", "uzgalis", "2018", "270271", "right", "collins", "continue", "maintain", "emergent", "property", "possible", "numerical", "property", "need", "conform", "homogeneity", "principle", "actually", "exist", "god", "omnipotence", "allows", "make", "matter", "duly", "arranged", "think", "clarke", "next", "defense", "reject", "collins", "distinction", "numerical", "generical", "power", "lockean", "distinction", "concerning", "homogeneity", "principle", "clarke", "1738", "1928", "829830", "clarke", "collins", "158159", "claim", "respect", "homogeneity", "principle", "reasoning", "case", "clarke", "view", "even", "omnipotent", "god", "violate", "homogeneity", "principle", "clarke", "1738", "901", "clarke", "collins", "2011", "268269", "consequence", "hold", "emergent", "property", "possible", "matter", "think", "alternative", "view", "debate", "criterion", "victory", "concession", "one", "side", "correspondence", "end", "victory", "clarke", "standoff", "evaluating", "controversy", "one", "would", "say", "encounter", "newtonian", "free", "thinker", "one", "collins", "clarke", "philosophically", "significant", "influential", "higgins", "hold", "collins", "important", "u", "mainly", "defends", "early", "version", "materialism", "surely", "truth", "higgins", "clearly", "damning", "collins", "faint", "praise", "recognize", "collins", "indeed", "pioneer", "trying", "show", "consciousness", "real", "emergent", "property", "brain", "regard", "certainly", "showed", "much", "originality", "higgins", "give", "credit", "see", "note", "2", "one", "need", "compare", "locke", "claim", "would", "need", "revelation", "understand", "matter", "could", "think", "use", "term", "superaddition", "collins", "account", "emergent", "property", "see", "improvement", "explanatory", "power", "latter", "former", "higgins", "also", "claim", "collins", "argument", "good", "also", "give", "collins", "enough", "credit", "true", "collins", "give", "argument", "good", "hand", "collins", "forced", "clarke", "clarify", "position", "number", "respect", "also", "uncovered", "number", "weak", "point", "clarke", "position", "clarke", "poor", "treatment", "collins", "example", "power", "rose", "produce", "sweet", "smell", "u", "one", "example", "answered", "collins", "talking", "smell", "rose", "claim", "secondary", "quality", "belongs", "second", "class", "property", "collins", "properly", "object", "talking", "organization", "particle", "rosethe", "cause", "effect", "effect", "u", "clarke", "response", "weak", "one", "collins", "strongest", "point", "critique", "clarke", "doctrine", "though", "soul", "immaterial", "extended", "vailati", "1993", "one", "also", "see", "much", "pressure", "collins", "applying", "clarke", "system", "number", "property", "clarke", "third", "classfictional", "propertiescontinues", "mount", "course", "correspondence", "respect", "central", "issue", "debate", "collins", "struggling", "articulate", "materialist", "empiricist", "metaphysics", "compete", "well", "developed", "dualist", "priori", "metaphysics", "clarke", "deploys", "barresi", "martin", "comment", "faltering", "often", "successful", "attempt", "reformulate", "traditional", "metaphysical", "issue", "empirically", "embodies", "birth", "pang", "new", "approach", "martin", "barresi", "2000", "51", "perhaps", "strikingly", "collins", "attempting", "defend", "doctrine", "emergent", "property", "become", "prominent", "english", "philosophy", "mill", "system", "logic", "1843", "twentieth", "century", "british", "emergentism", "movement", "3", "determinism", "free", "31", "background", "collins", "deal", "passing", "determinism", "freedom", "170708", "correspondence", "samuel", "clarke", "1707", "book", "essay", "concerning", "use", "reason", "philosophical", "inquiry", "concerning", "liberty", "1717", "entirely", "devoted", "issue", "beginning", "collins", "determinist", "compatibilist", "account", "free", "action", "clarke", "1738", "1928", "872", "clarke", "collins", "226227", "clarke", "attacked", "collins", "determinism", "170708", "correspondence", "also", "reviewed", "1717", "book", "defended", "doctrine", "libertarian", "free", "earlier", "correspondence", "since", "nature", "human", "choice", "action", "central", "debate", "free", "determinism", "close", "connection", "position", "issue", "position", "consciousness", "personal", "identity", "kind", "determinism", "collins", "advocate", "natural", "extension", "materialist", "empirical", "naturalistic", "account", "consciousness", "account", "consciousness", "collins", "make", "pursuit", "pleasure", "avoidance", "pain", "basic", "motif", "action", "make", "happiness", "misery", "necessary", "concomitant", "consciousness", "thus", "conscious", "being", "endowed", "desire", "happiness", "true", "much", "animal", "human", "being", "account", "large", "number", "similarity", "behavior", "human", "animal", "collins", "hold", "behavior", "animal", "determined", "human", "must", "well", "32", "determinism", "collins", "early", "work", "clarke", "collins", "correspondence", "170708", "collins", "claim", "clarke", "argument", "dualism", "useless", "religion", "morality", "problem", "explaining", "immaterial", "mind", "material", "body", "interact", "one", "clarke", "countercharges", "collins", "materialism", "useless", "dangerous", "religion", "morality", "implies", "determinism", "destructive", "religion", "morality", "clarke", "1738", "1928", "831", "clarke", "collins", "192", "collins", "claim", "human", "action", "caused", "much", "way", "action", "clock", "necessary", "agent", "though", "cause", "produce", "action", "either", "case", "different", "necessarily", "determined", "action", "one", "appearance", "good", "evil", "weight", "spring", "clarke", "1738", "1928", "872", "clarke", "collins", "2011", "226", "collins", "also", "attack", "free", "position", "hold", "cause", "always", "produce", "effect", "claim", "free", "explanation", "able", "otherwise", "violates", "basic", "principle", "causal", "explanation", "clarke", "1738", "1928", "873", "874", "clarke", "collins", "2011", "227", "230", "collins", "also", "expressed", "determinist", "view", "first", "bookan", "essay", "concerning", "use", "reason", "1707", "context", "problem", "reconciling", "god", "foreknowledge", "human", "free", "higgins", "put", "solved", "problem", "satisfaction", "saying", "thing", "including", "human", "choice", "determined", "cause", "foreseen", "allknowing", "god", "higgins", "1976", "6", "view", "also", "play", "role", "collins", "1710", "critique", "archbishop", "king", "view", "problem", "evil", "epistemological", "status", "attribute", "god", "king", "claimed", "god", "attribute", "including", "foreknowledge", "event", "analogical", "case", "god", "foreknowledge", "avoid", "contradiction", "god", "knowing", "come", "contingency", "event", "human", "free", "collins", "content", "reject", "human", "free", "suppose", "foreknowledge", "univocal", "meaning", "used", "reference", "god", "human", "33", "philosophical", "inquiry", "concerning", "human", "liberty", "1717", "beginning", "discussion", "collins", "determinism", "jacopo", "agnesina", "remark", "determinism", "aspect", "anthony", "collins", "thought", "always", "met", "success", "agnesina", "2018", "97", "philosophical", "inquiry", "concerning", "human", "liberty", "collins", "briefly", "state", "position", "reject", "view", "freedom", "necessity", "claim", "insofar", "human", "freedom", "liberty", "freedom", "outward", "impediment", "action", "freedom", "compatible", "necessity", "collins", "hold", "every", "action", "caused", "must", "necessarily", "occurred", "future", "much", "determined", "past", "give", "six", "argument", "form", "determinism", "first", "collins", "argument", "experience", "defender", "free", "hold", "experience", "even", "ordinary", "people", "show", "choose", "freely", "collins", "response", "much", "hobbes", "spinoza", "claim", "say", "thing", "either", "attending", "seeing", "cause", "action", "collins", "go", "claim", "defender", "free", "admit", "issue", "tangled", "resolved", "appeal", "vulgar", "experience", "collins", "1717", "1231", "1976", "6069", "william", "rowe", "note", "collins", "clarke", "share", "volitional", "theory", "action", "rowe", "describes", "theory", "way", "according", "theory", "action", "two", "sort", "thought", "motion", "body", "make", "thought", "bodily", "motion", "action", "preceded", "certain", "act", "volition", "bring", "thought", "motion", "volition", "action", "starter", "rowe", "1987", "54", "rowe", "also", "note", "collins", "clarke", "share", "assumption", "volition", "causally", "determined", "person", "act", "free", "rowe", "1987", "53", "rowe", "say", "two", "antagonist", "agree", "point", "play", "little", "part", "debate", "explain", "strategy", "collins", "us", "argue", "experience", "actually", "show", "determined", "examines", "experience", "four", "topic", "relating", "choice", "action", "1", "perception", "idea", "2", "judging", "proposition", "3", "willing", "4", "collins", "argues", "causally", "determined", "hold", "perception", "idea", "sensation", "reflection", "voluntary", "perception", "hardly", "free", "respect", "judging", "claim", "judge", "term", "thing", "appear", "u", "change", "appearance", "respect", "claim", "two", "question", "considered", "one", "whether", "liberty", "second", "whether", "liberty", "one", "two", "object", "respect", "first", "question", "claim", "locke", "made", "mistake", "holding", "people", "liberty", "suspend", "willing", "collins", "hold", "locke", "answer", "first", "question", "would", "affirmative", "collins", "claim", "suspense", "willing", "much", "act", "answer", "negative", "respect", "second", "question", "collins", "argues", "value", "determinism", "make", "answer", "second", "question", "negative", "well", "defining", "willing", "remark", "willing", "preferring", "respect", "good", "evil", "judging", "respect", "truth", "falsehood", "something", "seems", "better", "alternative", "choose", "collins", "thus", "moral", "determinist", "hold", "must", "seems", "best", "u", "giving", "negative", "answer", "second", "question", "collins", "also", "rejecting", "claim", "could", "done", "otherwise", "case", "decided", "alternative", "choice", "best", "collins", "1717", "3140", "1976", "6973", "collins", "proceeds", "consider", "case", "see", "difference", "object", "choose", "among", "eg", "two", "egg", "take", "collins", "response", "enough", "render", "thing", "equal", "equal", "alike", "various", "modification", "man", "opinion", "prejudice", "temper", "habit", "circumstance", "taken", "considered", "cause", "election", "le", "object", "without", "u", "among", "chuse", "ever", "incline", "determine", "will", "make", "choice", "make", "preferable", "u", "though", "external", "object", "choice", "ever", "much", "alike", "collins", "1717", "47", "1976", "77", "one", "truly", "indifferent", "one", "simply", "would", "choose", "choose", "cascade", "cause", "lead", "action", "determine", "choice", "one", "way", "collins", "mean", "consequent", "willing", "find", "freedom", "necessity", "willed", "unless", "external", "impediment", "intervening", "cause", "hinders", "u", "finally", "compare", "action", "animal", "men", "claim", "animal", "supposed", "necessary", "agent", "human", "free", "agent", "perceivable", "difference", "action", "would", "allow", "u", "make", "distinction", "collins", "1717", "5357", "1976", "8082", "collins", "second", "argument", "man", "necessary", "agent", "action", "beginning", "hold", "whatever", "beginning", "cause", "cause", "necessary", "collins", "clarke", "collins", "controversy", "also", "reject", "proposition", "cause", "could", "produce", "different", "effect", "thus", "collins", "reject", "doctrine", "free", "violates", "basic", "principle", "causal", "explanation", "third", "argument", "claimed", "liberty", "imperfection", "going", "back", "judging", "proposition", "collins", "point", "free", "would", "able", "judge", "probable", "improbable", "analog", "moral", "determinism", "epistemic", "realm", "free", "knowingly", "choose", "worse", "better", "affirm", "seems", "improbable", "u", "probable", "could", "would", "worse", "fourth", "argument", "liberty", "inconsistent", "god", "foreknowledge", "similar", "view", "hobbes", "held", "repeat", "assertion", "collins", "first", "book", "essay", "concerning", "use", "reason", "fifth", "man", "necessary", "agent", "determined", "pleasure", "pain", "would", "foundation", "reward", "punishment", "sixth", "man", "necessary", "agent", "would", "ignorant", "morality", "motive", "practice", "last", "two", "argument", "make", "point", "causality", "necessary", "operation", "morality", "world", "introduce", "causeless", "free", "make", "teaching", "morality", "motivation", "punishment", "reward", "pointless", "collins", "1717", "57108", "1976", "82108", "james", "harris", "jacopo", "agnesina", "argued", "inquiry", "concerning", "human", "liberty", "fact", "response", "dr", "clarke", "rational", "theology", "claim", "collins", "attempting", "demonstrate", "determinism", "follows", "clarke", "first", "principle", "agnesina", "2011", "2018", "105", "harris", "2005", "58", "agnesina", "also", "pain", "argue", "collins", "determinism", "logical", "causal", "determinism", "agnesina", "characterizes", "distinction", "two", "kind", "determinism", "way", "causal", "determinist", "maintain", "that", "present", "future", "event", "determined", "causally", "antecedent", "theory", "root", "principle", "causality", "principle", "sufficient", "reason", "event", "sufficient", "cause", "determines", "thus", "causal", "determinism", "excludes", "event", "arise", "ex", "abrupto", "without", "stating", "possible", "conceivable", "world", "unrealized", "possibility", "exist", "though", "logically", "contradictory", "come", "incompatible", "law", "nature", "causal", "chain", "event", "world", "necessitarianism", "strengthens", "causal", "determinism", "latter", "standpoint", "unrealized", "possibility", "excluded", "held", "current", "law", "nature", "possible", "one", "agnesina", "2018", "98", "regard", "think", "collin", "position", "logical", "determinist", "close", "spinoza", "higgins", "claimed", "possible", "collins", "understand", "spinozistic", "implication", "position", "collins", "1717", "1976", "45", "note", "114", "higgins", "seems", "suggesting", "collins", "read", "spinoza", "ethic", "might", "confused", "book", "even", "though", "collins", "also", "read", "critique", "spinoza", "pierre", "bayle", "g", "w", "leibniz", "agnesina", "counter", "even", "collins", "read", "ethic", "read", "critique", "spinoza", "bayle", "leibniz", "critic", "spinoza", "clearly", "spelled", "implication", "kind", "logical", "determinism", "collins", "seems", "perfectly", "willing", "adopt", "agnesina", "2018", "120125", "one", "problem", "taking", "collins", "logical", "determinist", "collins", "compatibilist", "thus", "regarding", "freedom", "freedom", "outside", "obstruction", "would", "seem", "compatibilism", "possible", "causal", "determinism", "logical", "determinism", "hobbes", "claimed", "compatibilist", "kind", "tendency", "towards", "logical", "determinism", "collins", "interestingly", "one", "response", "collins", "book", "england", "samuel", "clarke", "reviewed", "argued", "notion", "necessary", "agent", "incoherent", "agent", "one", "must", "active", "collins", "position", "human", "completely", "passive", "thus", "clarke", "sense", "agent", "clarke", "charge", "discussing", "able", "otherwise", "collins", "fails", "distinguish", "physical", "moral", "necessity", "see", "harris", "2005", "59", "clarke", "also", "complained", "collins", "treated", "perception", "action", "fact", "perception", "passive", "clarke", "1738", "1928", "722", "clarke", "develops", "account", "free", "arguing", "motif", "pleasure", "pain", "reason", "argument", "simply", "occasion", "selfmoving", "power", "active", "freely", "determine", "action", "competing", "set", "explanation", "phenomenon", "appears", "clarke", "failed", "take", "number", "collins", "argument", "seriously", "free", "argument", "refuted", "argument", "series", "letter", "collins", "discussed", "clarke", "review", "book", "long", "time", "friend", "collaborator", "pierre", "desmaizeaux", "written", "reply", "eventually", "however", "collins", "concluded", "clarke", "threatening", "civil", "action", "reply", "would", "provide", "clarke", "opportunity", "dybikowski", "2011", "2601", "269", "281", "consequently", "collins", "made", "reply", "clarke", "review", "1729", "short", "book", "dissertation", "liberty", "necessity", "initial", "ac", "title", "page", "published", "number", "reason", "higgins", "hold", "collins", "author", "work", "higgins", "first", "reason", "rejecting", "collins", "authorship", "book", "treat", "substance", "soul", "unknowna", "lockean", "doctrine", "collins", "rejected", "higgins", "also", "cite", "contemporary", "review", "claim", "argument", "book", "weak", "compared", "inquiry", "jacopo", "agnesina", "agrees", "higgins", "work", "collins", "give", "full", "discussion", "argument", "attribution", "agnesina", "2018", "125132", "see", "also", "harris", "2005", "60", "still", "making", "claim", "collins", "would", "make", "soul", "substance", "argument", "certainly", "consistent", "determinist", "position", "collins", "holding", "earlier", "work", "author", "also", "take", "account", "least", "one", "clarke", "criticism", "inquiry", "author", "dissertation", "remark", "attempt", "solve", "point", "free", "tracing", "progress", "soul", "operation", "conscious", "examining", "whether", "ti", "active", "passive", "collins", "1729", "1", "point", "every", "stage", "process", "perception", "action", "passive", "author", "apparently", "accepted", "clarke", "point", "review", "collins", "inquiry", "perception", "action", "call", "action", "operation", "author", "explicitly", "take", "clarke", "view", "argues", "passive", "judgment", "quote", "clarke", "length", "clarke", "hold", "judgment", "passive", "distinguishes", "judging", "acting", "author", "continues", "conceive", "doctor", "begs", "question", "asserting", "selfmotive", "power", "soul", "without", "proving", "reason", "granted", "1729", "6", "author", "dissertation", "thus", "return", "clarke", "charge", "clarke", "made", "collins", "1717", "review", "philosophical", "inquiry", "concerning", "human", "liberty", "4", "collins", "deism", "freethinking", "seventeenth", "early", "eighteenth", "century", "england", "saw", "rationalist", "treatment", "theology", "spanned", "many", "competing", "group", "latitudinarian", "dissenter", "deist", "samuel", "hefelbower", "relation", "john", "locke", "english", "deism", "remark", "among", "progressivestheologians", "philosopher", "deistsall", "accepted", "rationalistic", "religion", "question", "becomes", "exactly", "role", "reason", "vi", "à", "vi", "revelation", "discussion", "relation", "reason", "revelation", "go", "back", "least", "albertus", "magnus", "thomas", "aquinasthat", "scholastic", "authority", "albert", "held", "reason", "role", "play", "religion", "question", "philosophy", "final", "answer", "revelation", "must", "decide", "revelation", "reason", "contrary", "thomas", "similar", "position", "hefelbower", "1918", "47", "locke", "hold", "reason", "responsible", "determining", "count", "genuine", "revelation", "locke", "also", "hold", "view", "revelation", "tell", "u", "thing", "reason", "contrary", "thus", "part", "angel", "rebelled", "god", "thereby", "lost", "first", "happy", "state", "dead", "shall", "rise", "live", "like", "beyond", "discovery", "reason", "purely", "matter", "faith", "reason", "directly", "nothing", "locke", "1690", "iv", "xviii", "7", "1975", "694", "deist", "tend", "hold", "radical", "view", "one", "locke", "advocate", "samuel", "clarke", "boyle", "lecture", "1704", "distinguishes", "four", "grade", "deist", "first", "acknowledged", "future", "life", "doctrine", "natural", "religion", "second", "denying", "future", "life", "admitted", "moral", "role", "deity", "third", "acknowledged", "providence", "natural", "religion", "morality", "finally", "denied", "providence", "altogether", "collins", "fit", "grade", "deism", "according", "higgins", "book", "collins", "came", "emphasize", "part", "morality", "play", "religion", "assert", "importance", "natural", "religion", "higgins", "1970", "40", "collins", "claim", "believe", "future", "life", "natural", "immortality", "collins", "reject", "revelation", "higgins", "right", "collins", "fit", "clarke", "first", "grade", "deist", "david", "berman", "disputed", "view", "arguing", "collins", "fact", "atheist", "berman", "1988", "801", "jacopo", "agnesina", "book", "philosophy", "anthony", "collins", "free", "thought", "atheism", "strongly", "agrees", "berman", "agnesina", "strategy", "take", "whole", "collins", "work", "putting", "piece", "together", "make", "clear", "part", "partially", "displaycollins", "atheism", "agnesina", "2018", "192", "41", "essay", "concerning", "use", "reason", "1707", "essay", "concerning", "use", "reason", "collins", "first", "book", "published", "anonymously", "1707", "little", "letter", "mr", "dodwell", "main", "thrust", "book", "reject", "religious", "mystery", "collins", "start", "approach", "issue", "religion", "reason", "along", "line", "locke", "defines", "reason", "faculty", "mind", "whereby", "perceives", "truth", "falsehood", "probability", "improbability", "proposition", "1707", "1984", "3", "proposition", "consist", "word", "stand", "idea", "concerning", "agreement", "affirm", "deny", "1707", "1984", "34", "thus", "accepts", "locke", "definition", "knowledge", "also", "distinguishes", "way", "locke", "intuitive", "demonstrative", "probable", "truth", "treat", "claim", "revelation", "probable", "proposition", "largely", "derive", "testimony", "perhaps", "one", "diversion", "locke", "collins", "distinguishes", "two", "different", "kind", "probability", "stronger", "kind", "resembles", "demonstration", "connection", "idea", "merely", "probable", "weaker", "kind", "probability", "testimony", "collins", "position", "person", "expected", "believe", "anything", "comprehensible", "human", "intellect", "term", "take", "meaning", "understood", "human", "expected", "believe", "higgins", "see", "strong", "affinity", "collins", "book", "john", "toland", "christianity", "mysterious", "published", "1696", "quote", "toland", "remark", "hold", "reason", "foundation", "certitudethat", "nothing", "reveal", "whether", "manner", "existence", "exempted", "disquisition", "ordinary", "phenomenon", "naturethat", "nothing", "gospel", "contrary", "higgins", "claim", "much", "position", "collins", "taking", "essay", "essay", "concerning", "human", "understanding", "locke", "allowed", "truth", "reason", "compatible", "scholar", "regard", "mere", "verbal", "commitment", "truth", "reason", "others", "regard", "substantive", "clear", "locke", "would", "accept", "truth", "contrary", "reason", "point", "locke", "toland", "collins", "complete", "agreement", "toland", "however", "radical", "position", "locke", "reject", "truth", "reason", "even", "truth", "compatible", "reason", "see", "woolhouse", "2007", "372", "thus", "toland", "would", "accept", "story", "rebellion", "angel", "claim", "dead", "shall", "rise", "collins", "hand", "seems", "hold", "position", "locke", "quote", "approval", "passage", "robert", "boyle", "us", "analogy", "deepsea", "diver", "make", "distinction", "reason", "contrary", "reason", "plausible", "diver", "asks", "see", "bottom", "ocean", "declared", "brings", "oyster", "pearl", "objection", "claim", "oyster", "pearl", "bottom", "sea", "hand", "diver", "claim", "pearl", "show", "larger", "shell", "containing", "would", "doubtless", "judge", "asserts", "contrary", "information", "eye", "collins", "1707", "1984", "256", "sound", "like", "locke", "position", "agnesina", "point", "collins", "give", "analogy", "twist", "writes", "collins", "reduces", "boyle", "example", "conceptual", "scheme", "simply", "matter", "acquisition", "knowledge", "different", "type", "degree", "knowledge", "agnesina", "2018", "149", "thus", "agnesina", "agrees", "higgins", "collins", "hold", "position", "toland", "truth", "contrary", "reason", "turning", "analogy", "theological", "doctrine", "find", "collins", "rejecting", "transubstantiation", "1707", "1984", "24", "collins", "also", "object", "doctrine", "trinity", "understandable", "interpretation", "involves", "contradiction", "acceptance", "doctrine", "trinity", "first", "thirtynine", "article", "anglican", "supposed", "subscribe", "plain", "collins", "like", "locke", "newton", "clarke", "whiston", "toland", "others", "objected", "article", "many", "men", "concealed", "view", "trinity", "claimed", "orthodox", "anglican", "given", "collins", "reject", "mystery", "claim", "truth", "reason", "accept", "part", "holy", "scripture", "collins", "hold", "account", "testimony", "collins", "writes", "idea", "join", "proposition", "mind", "perceives", "agree", "disagree", "testimony", "others", "collins", "1707", "5", "testimony", "give", "rise", "particular", "kind", "knowledge", "faith", "learn", "fact", "current", "event", "historical", "scientific", "one", "communicated", "u", "others", "testimony", "enough", "produce", "faith", "assent", "unless", "people", "event", "credible", "collins", "like", "spinoza", "theologicalpolitical", "treatise", "concludes", "writer", "bible", "writing", "philosopher", "adapted", "expression", "capacity", "understanding", "bulk", "mankind", "collins", "1707", "14", "agnesina", "point", "similarity", "collins", "conclusion", "spinoza", "locke", "le", "clerc", "richard", "simon", "toland", "remark", "similarity", "show", "enormous", "pressure", "bible", "subjected", "year", "freed", "holiness", "made", "untouchable", "minutely", "examined", "tool", "philology", "may", "easily", "imagined", "operation", "exploited", "radical", "thinker", "discredited", "contradiction", "inconsistency", "order", "gain", "credit", "position", "opposing", "side", "sort", "contrasting", "action", "desire", "growing", "preserve", "bible", "update", "according", "finding", "science", "agnesina", "2018", "151", "besides", "kind", "pressure", "noted", "act", "toleration", "came", "along", "glorious", "revolution", "1688", "anglican", "church", "1690s", "edge", "saw", "revenue", "falling", "debate", "fundamental", "doctrine", "church", "fever", "pitch", "thus", "advent", "boyle", "lecture", "defend", "view", "anglican", "church", "show", "compatibility", "newtonian", "science", "hardly", "surprising", "42", "analogical", "language", "vindication", "divine", "attribute", "remark", "grace", "archbishop", "dublin", "sermon", "intitled", "divine", "predestination", "consistent", "freedom", "man", "published", "1710", "collins", "take", "another", "way", "evading", "demand", "whatever", "believe", "must", "comprehensible", "u", "doctrine", "analogy", "go", "back", "st", "thomas", "aquinas", "form", "collins", "find", "work", "archbishop", "king", "dublin", "doctrine", "god", "hand", "foot", "beard", "literal", "sense", "wisdom", "benevolence", "justice", "sense", "understand", "term", "thus", "king", "remarked", "follow", "hence", "properly", "literally", "god", "manner", "u", "hand", "eye", "mercy", "love", "hatred", "collins", "reject", "claim", "god", "wisdom", "benevolence", "could", "meaning", "comprehend", "asserts", "god", "knowledge", "attribute", "univocal", "higgins", "1970", "63", "david", "berman", "history", "atheism", "great", "britain", "give", "number", "reason", "take", "collins", "atheist", "rather", "deist", "see", "collins", "account", "creation", "matter", "ex", "nihilo", "answer", "mr", "clarke", "third", "defence", "clarke", "collins", "correspondence", "argument", "atheism", "disguised", "argument", "atheism", "berman", "1988", "8081", "see", "collins", "using", "bayle", "raise", "problem", "evil", "vindication", "divine", "attribute", "showing", "solution", "offered", "bayle", "dr", "king", "unacceptable", "collins", "official", "position", "end", "vindication", "king", "wrong", "atheism", "avoidable", "berman", "asks", "actual", "conclusion", "vindication", "continues", "simply", "formidable", "insuperable", "difficulty", "theistic", "conception", "godrevealed", "manichean", "problemsand", "latest", "attempt", "cope", "solve", "difficulty", "ie", "king", "theory", "failed", "medicine", "bad", "disease", "disease", "remains", "berman", "1988", "84", "collins", "clearly", "reject", "theism", "based", "revelation", "one", "could", "also", "theist", "based", "argument", "natural", "religion", "berman", "see", "vindication", "aimed", "heart", "natural", "religion", "1988", "84", "would", "good", "reason", "regard", "collins", "atheist", "one", "hand", "collins", "position", "analogical", "language", "may", "seem", "strongly", "support", "natural", "religion", "insofar", "meaning", "divine", "attribute", "univocal", "use", "word", "human", "being", "analogy", "natural", "religion", "relies", "would", "work", "best", "basic", "analogy", "natural", "religion", "depends", "human", "machine", "make", "god", "world", "archbishop", "king", "position", "hand", "would", "completely", "undermine", "analogy", "however", "second", "consideration", "insofar", "problem", "evil", "left", "unresolved", "natural", "religion", "would", "suggest", "provide", "effective", "answer", "fundamental", "difficulty", "theism", "berman", "point", "higgins", "contrast", "claim", "vindication", "collins", "simply", "set", "aside", "problem", "evil", "higgins", "1970", "63", "43", "discourse", "free", "thinking", "1713", "like", "locke", "collins", "advocate", "use", "reason", "determine", "religious", "truth", "one", "necessary", "condition", "able", "think", "freely", "persecuted", "considering", "view", "different", "accepted", "one", "environment", "one", "genuinely", "consider", "alternative", "must", "possible", "adopt", "whichever", "possibility", "turn", "reasonable", "collins", "like", "locke", "committed", "view", "one", "proportion", "assent", "proposition", "basis", "evidence", "religious", "persecution", "aim", "limit", "possibility", "evidence", "one", "consider", "though", "collins", "strongly", "anticlerical", "distinguish", "good", "priest", "bad", "priest", "good", "priest", "one", "advocate", "freedom", "thought", "bad", "priest", "hand", "persecutor", "want", "prevent", "people", "thinking", "truth", "religion", "time", "collins", "controversial", "work", "discourse", "freethinking", "1714", "concerning", "discourse", "jm", "robertson", "writes", "may", "said", "sum", "unify", "drift", "previous", "english", "freethinking", "great", "contribution", "bayle", "whose", "learning", "temper", "influence", "english", "deism", "shaftesbury", "onward", "robertson", "1915", "123", "perhaps", "motto", "discourse", "freethinking", "ought", "expert", "disagree", "person", "free", "reason", "collins", "chiefly", "concerned", "religion", "vast", "bulk", "disagreement", "cite", "religious", "issue", "whether", "one", "religion", "better", "another", "detail", "anglicanism", "looking", "conflicting", "claim", "often", "lead", "skepticism", "exactly", "approach", "lead", "collins", "question", "consider", "discourse", "freethinking", "collins", "defines", "freethinking", "use", "understanding", "endeavouring", "find", "meaning", "proposition", "whatsoever", "considering", "nature", "evidence", "judging", "according", "seeming", "force", "weakness", "evidence", "collins", "1713", "1984", "5", "collins", "claim", "right", "think", "freely", "richard", "bently", "remark", "late", "discourse", "freethinking", "charge", "definition", "broadthat", "amount", "definition", "thinking", "james", "higgins", "study", "collins", "agrees", "bently", "however", "good", "evaluation", "collins", "account", "surely", "intended", "rule", "believing", "without", "evidence", "evidence", "without", "carefully", "considering", "conflicting", "evidence", "either", "going", "admitted", "thinking", "collins", "definition", "broad", "discourse", "divided", "three", "section", "first", "two", "collins", "give", "series", "argument", "favor", "freethinking", "third", "answer", "objection", "freethinking", "give", "list", "historical", "figure", "view", "freethinkers", "argument", "treat", "thinking", "effectively", "like", "craft", "art", "number", "early", "argument", "work", "analogy", "claim", "putting", "restriction", "painting", "would", "reduce", "proficiency", "painter", "putting", "restriction", "thinking", "reduce", "proficiency", "thinker", "fail", "think", "freely", "lead", "holding", "absurd", "belief", "superstition", "collins", "give", "brief", "history", "effort", "priest", "control", "people", "believe", "fraud", "ancient", "world", "reformation", "collins", "claim", "freethinking", "responsible", "decline", "belief", "witchcraft", "section", "2", "begin", "collins", "arguing", "right", "opinion", "matter", "religion", "supposed", "essential", "salvation", "error", "lead", "damnation", "one", "think", "freely", "oneself", "subject", "one", "must", "simply", "take", "opinion", "among", "one", "happens", "live", "mean", "right", "accident", "hand", "people", "think", "freely", "evidence", "thing", "determine", "side", "truth", "collins", "1713", "1984", "33", "age", "infinite", "number", "pretender", "revelation", "heaven", "supported", "miracle", "pretender", "offer", "new", "notion", "deity", "new", "doctrine", "command", "ceremony", "mode", "worship", "decide", "genuine", "spurious", "requires", "one", "think", "freely", "competing", "evidence", "would", "show", "one", "genuine", "imposter", "collins", "remark", "since", "anglican", "church", "organization", "support", "foreign", "missionary", "society", "propagating", "gospel", "foreign", "land", "really", "requires", "supporting", "freethinking", "throughout", "world", "therefore", "home", "well", "indeed", "reasonable", "change", "opinion", "among", "men", "quitting", "old", "religion", "reception", "new", "religion", "believing", "religion", "mean", "freethinking", "holy", "scripture", "agreeably", "reason", "design", "blessed", "savior", "establishing", "religion", "throughout", "whole", "universe", "imply", "everywhere", "press", "many", "place", "duty", "free", "thinking", "collins", "1713", "1984", "4346", "finally", "collins", "claim", "conduct", "priest", "chief", "pretender", "guide", "others", "matter", "religion", "make", "freethinking", "nature", "attribute", "eternal", "god", "authority", "scripture", "sense", "scripture", "unavoidable", "collins", "1713", "1984", "46", "go", "list", "disagreement", "difference", "opinion", "among", "priest", "topic", "section", "3", "collins", "take", "various", "objection", "freethinking", "suppose", "men", "right", "think", "freely", "subject", "suppose", "capacity", "absurd", "think", "duty", "think", "freely", "collins", "reply", "suppose", "right", "thing", "also", "implies", "right", "let", "alone", "think", "fit", "collins", "1713", "1984", "100", "freethinking", "duty", "collins", "responds", "case", "contend", "necessity", "men", "assenting", "certain", "proposition", "must", "allow", "men", "qualify", "ibid", "case", "great", "bulk", "mankind", "lacked", "capacity", "think", "freely", "matter", "speculation", "priest", "conclude", "men", "way", "concerned", "truth", "falsehood", "speculative", "matter", "short", "hold", "opinion", "even", "case", "however", "right", "think", "freely", "would", "remain", "untouched", "disposed", "think", "freely", "second", "objection", "encourage", "freethinking", "produce", "endless", "division", "opinion", "consequence", "disorder", "society", "collins", "suggests", "consequence", "false", "remedy", "worse", "disease", "third", "freethinking", "may", "lead", "atheism", "collins", "point", "many", "divine", "hold", "never", "real", "atheist", "world", "bacon", "hold", "contemplative", "atheist", "rare", "still", "even", "freethinking", "produce", "many", "atheist", "number", "superstitious", "enthusiastic", "produced", "absence", "freethinking", "even", "greater", "worse", "evil", "society", "atheism", "fourthly", "priest", "expert", "relied", "upon", "subject", "doctor", "lawyer", "relied", "upon", "collins", "argues", "analogy", "doctor", "lawyer", "priest", "hold", "first", "doctor", "lawyer", "act", "u", "need", "believe", "principle", "opinion", "one", "prescribes", "act", "matter", "religion", "obliged", "believe", "certain", "opinion", "man", "belief", "save", "except", "collins", "1713", "109", "finally", "freethinkers", "infamous", "wicked", "senseless", "mankind", "collins", "1713", "118", "collins", "answer", "objection", "various", "waysarguing", "fact", "freethinking", "make", "one", "virtuous", "end", "listing", "variety", "men", "considers", "freethinkers", "whose", "moral", "character", "impeccablesocrates", "plato", "aristotle", "epicurus", "plutarch", "cicero", "varo", "others", "among", "ancient", "among", "modern", "includes", "bacon", "hobbes", "archbishop", "tillotson", "44", "interpreting", "discourse", "free", "thinking", "discourse", "leaf", "u", "variety", "question", "exactly", "collins", "trying", "achieve", "book", "reflecting", "first", "two", "section", "discourse", "james", "higgins", "note", "good", "deal", "wrote", "interpreted", "writing", "anticlerical", "protestant", "insisting", "private", "judgment", "laity", "passagessuch", "varo", "socrates", "seem", "imply", "bias", "christianity", "least", "revelation", "higgins", "1970", "89", "collins", "critic", "accused", "atheist", "unless", "one", "give", "work", "esoteric", "reading", "hardly", "seems", "warranted", "collins", "however", "clearly", "extolling", "universal", "religion", "based", "reason", "discourse", "received", "good", "number", "reply", "steele", "commented", "author", "discourse", "deserved", "denied", "common", "benefit", "air", "water", "quoted", "higgins", "1970", "78", "guardian", "campaigned", "discourse", "among", "article", "published", "young", "george", "berkeley", "certain", "amount", "scholarly", "debate", "effective", "reply", "early", "historian", "often", "claimed", "richard", "bently", "remark", "late", "discourse", "freethinking", "delivered", "crushing", "rejoinder", "collins", "james", "higgins", "booklength", "study", "collins", "probably", "give", "balanced", "assessment", "higgins", "admits", "bently", "whole", "make", "strictly", "ad", "hominem", "attack", "collins", "attacked", "collins", "scholarship", "accused", "atheism", "higgins", "think", "bently", "succeeded", "showing", "collins", "man", "produce", "critical", "edition", "bible", "higgins", "1970", "84", "higgins", "also", "remark", "bently", "correctly", "point", "collins", "understand", "role", "textual", "variant", "reducing", "rather", "increasing", "uncertainty", "meaning", "text", "since", "collins", "maintaining", "everyone", "capable", "reason", "religious", "matter", "claim", "failed", "reason", "correctly", "may", "bite", "ad", "hominem", "argument", "good", "point", "set", "fact", "bently", "completely", "failed", "address", "main", "issue", "religious", "authority", "hardly", "amount", "crushing", "rejoinder", "5", "collins", "religion", "edward", "lillian", "bloom", "note", "introduction", "discourse", "concerning", "ridicule", "irony", "writing", "several", "year", "work", "priestcraft", "perfection", "1710", "discourse", "freethinking", "1713", "flailing", "polemicist", "entire", "anglican", "hierarchy", "1724", "become", "polished", "debater", "initiated", "controversy", "made", "great", "noise", "ended", "death", "loudest", "shot", "persistent", "barrage", "sounded", "ground", "reason", "last", "fusillade", "discourse", "concerning", "ridicule", "irony", "writing", "collins", "1729", "1970", "iii", "priestcraft", "perfection", "1710", "historical", "critical", "essay", "thirty", "nine", "article", "church", "england", "1724", "collins", "attack", "first", "clause", "article", "20", "39", "article", "church", "hath", "power", "decree", "rite", "ceremony", "authority", "controversy", "faith", "collins", "go", "history", "clause", "considerable", "detail", "argue", "forgery", "clearly", "forgery", "church", "would", "power", "decree", "rite", "authority", "controversy", "faith", "point", "the", "true", "establishment", "religion", "lie", "allowing", "every", "man", "conscience", "use", "follow", "private", "judgment", "particularly", "understand", "profess", "practice", "think", "god", "teach", "holy", "scripture", "collins", "preface", "essay", "quoted", "higgins", "1970", "1434", "higgins", "note", "might", "position", "dissenting", "minister", "give", "detailed", "summary", "controversy", "chapter", "ix", "study", "collins", "discourse", "ground", "reason", "christian", "religion", "1724", "collins", "attack", "basis", "christianity", "revealed", "religion", "reasonableness", "christianity", "locke", "made", "messiahship", "christ", "single", "fundamental", "tenet", "christian", "discourse", "collins", "reject", "argument", "christianity", "founded", "judaism", "new", "testament", "old", "new", "testament", "importance", "regard", "insofar", "show", "prophecy", "old", "fulfilled", "collins", "reject", "claim", "fulfilled", "new", "testament", "asserts", "proof", "christianity", "collins", "critic", "disputed", "claim", "proof", "miracle", "collins", "rejected", "proof", "rejecting", "argument", "prophecy", "collins", "jousting", "newtonian", "william", "whiston", "16671752", "close", "associate", "newton", "probably", "influenced", "newton", "interest", "prophetic", "argument", "stephen", "snobelen", "point", "review", "controversy", "whiston", "hoped", "set", "exact", "science", "prophecy", "snobelen", "note", "whiston", "fulfilled", "prophecy", "certain", "boylean", "experiment", "newtonian", "demonstration", "snobelen", "1996", "205", "collins", "shared", "much", "whiston", "desire", "precision", "often", "allowed", "prophecy", "old", "testament", "dual", "fulfillment", "one", "prophet", "day", "one", "remote", "future", "one", "supposed", "literal", "allegorical", "whiston", "collins", "reject", "allegorical", "interpretation", "literal", "one", "whiston", "regarded", "later", "fulfillment", "literal", "earlier", "allegorical", "collins", "insisted", "earlier", "one", "regarded", "literal", "using", "catalog", "collins", "library", "produced", "giovanni", "tarantino", "jacopo", "agnesina", "persuasively", "argued", "discourse", "concerning", "ridicule", "irony", "writing", "published", "1729", "genuine", "work", "anthony", "collins", "though", "higgins", "biography", "collins", "doubted", "authenticity", "agnesina", "2009", "edward", "lillian", "bloom", "introduction", "reprint", "discourse", "remark", "modern", "reader", "discourse", "concerning", "ridicule", "irony", "satisfying", "collins", "many", "pamphlet", "book", "lack", "pretentiousness", "scheme", "snide", "convolution", "ground", "reason", "argument", "halftruth", "discourse", "freethinking", "last", "work", "free", "curious", "ambivalence", "marked", "many", "earlier", "piece", "visible", "uncertainty", "made", "fear", "repression", "yet", "court", "contrary", "last", "work", "fact", "justification", "rhetorical", "mode", "religious", "belief", "apologia", "pro", "vita", "sua", "written", "intensity", "decisiveness", "justification", "demand", "collins", "1729", "1970", "xv", "aim", "discourse", "refute", "claim", "nathanael", "marshall", "serious", "argument", "religious", "issue", "allowed", "ridicule", "irony", "attack", "established", "religion", "prosecuted", "magistrate", "clear", "indication", "much", "anglican", "opponent", "let", "collins", "irreverent", "wit", "biting", "satire", "ironical", "remark", "get", "skin", "collins", "opponent", "vulnerable", "number", "point", "collins", "make", "telling", "argument", "claim", "note", "best", "writer", "religion", "found", "committing", "crime", "disputation", "best", "punishment", "would", "either", "ignored", "return", "ridicule", "ridiculerather", "punished", "magistrate", "point", "mr", "marshall", "discovers", "many", "practice", "crime", "party", "encouraged", "practice", "give", "position", "theme", "allowing", "liberty", "discourse", "public", "debate", "religion", "overarching", "theme", "discourse", "certainly", "one", "main", "theme", "collins", "work", "throughout", "life", "6", "influence", "61", "england", "already", "considered", "detail", "samuel", "clarke", "reaction", "collins", "view", "emergent", "property", "personal", "identity", "issue", "determinism", "free", "early", "eighteenth", "century", "clarke", "collins", "correspondence", "170708", "reprinted", "twice", "referred", "many", "time", "course", "eighteenth", "century", "martin", "barresi", "2000", "33", "conservative", "reaction", "locke", "collins", "concerning", "personal", "identity", "materialism", "represented", "clarke", "continued", "maintained", "many", "thinker", "eighteenth", "century", "england", "well", "continent", "fact", "see", "ongoing", "debate", "materialist", "dualist", "topic", "way", "eighteenth", "early", "nineteenth", "century", "england", "bishop", "joseph", "butler", "16921752", "protege", "samuel", "clarke", "attacked", "lockecollins", "account", "personal", "identity", "appendix", "personal", "identity", "analogy", "religion", "butler", "largely", "accepted", "clarke", "substantialist", "account", "identity", "personal", "identity", "indeed", "clarified", "clarke", "position", "summarizing", "briefly", "naming", "distinction", "clarke", "making", "real", "fictional", "identity", "called", "distinction", "identity", "strict", "proper", "sense", "identity", "loose", "popular", "sense", "ducharme", "1986", "370", "reiterates", "clarke", "claim", "collins", "account", "personal", "identity", "dangerous", "religion", "particular", "doctrine", "resurrection", "accused", "collins", "taking", "locke", "doctrine", "strange", "length", "butler", "quoted", "perry", "2008", "102", "butler", "meant", "collins", "account", "personal", "identity", "would", "allow", "person", "identity", "persist", "moment", "thus", "locke", "account", "personal", "identity", "implied", "collins", "explicitly", "stated", "doctrine", "successive", "person", "butler", "claimed", "doctrine", "would", "destroy", "morality", "doctrine", "resurrection", "influential", "misinterpretation", "collins", "see", "uzgalis", "2008a", "322326", "george", "berkeley", "16851753", "met", "collins", "freethinking", "coffee", "house", "meeting", "later", "told", "american", "follower", "samuel", "johnson", "collins", "atheist", "noted", "earlier", "berkeley", "attacked", "discourse", "freethinking", "steele", "guardian", "continued", "attack", "collins", "alciphron", "berkeley", "hold", "quite", "distinct", "set", "philosophical", "view", "clarke", "together", "represent", "conservative", "anglican", "response", "locke", "collins", "issue", "personal", "identity", "berkeley", "agrees", "clarke", "substantial", "nature", "person", "scholar", "still", "debating", "influence", "collins", "david", "hume", "17111776", "much", "influence", "attributed", "collins", "depends", "largely", "interpretation", "given", "hume", "philosophy", "see", "mcintyre", "1994", "russell", "1995", "harris", "2005", "mcintyre", "russell", "despite", "difference", "agree", "treatise", "human", "nature", "hume", "systematically", "attacking", "clarke", "position", "mindbody", "relation", "articulated", "clarke", "boyle", "lecture", "clarke", "collins", "correspondence", "170708", "many", "hume", "argument", "resemble", "collins", "harris", "focusing", "issue", "free", "determinism", "using", "enquiry", "interpret", "treatise", "contrasting", "view", "argues", "hume", "account", "necessity", "weaker", "defended", "collins", "hobbes", "go", "claim", "giving", "weaker", "account", "hume", "giving", "kind", "account", "bramhall", "clarke", "gave", "trying", "find", "middle", "way", "necessitarianism", "liberty", "indifference", "harris", "2005", "73", "harris", "may", "correct", "noting", "variety", "way", "hume", "account", "causality", "necessity", "differs", "hobbes", "locke", "collins", "hand", "central", "hume", "analysis", "causality", "total", "rejection", "priori", "homogeneity", "principle", "necessary", "connection", "implicit", "heirloom", "theory", "causality", "collins", "also", "reject", "homogeneity", "principle", "heirloom", "theory", "causality", "underlie", "strenuously", "denies", "contradiction", "supposed", "follow", "violating", "principle", "actually", "occur", "clear", "similarity", "collins", "account", "causality", "hume", "harris", "fails", "note", "think", "consideration", "tend", "weaken", "harris", "judgement", "collins", "dogmatist", "issue", "hume", "skeptic", "see", "harris", "2005", "note", "22", "p", "79", "thomas", "reid", "17101796", "hold", "position", "materialism", "personal", "identity", "free", "much", "common", "view", "clarke", "reid", "deploys", "reduplication", "argument", "objecting", "view", "personal", "identity", "joseph", "priestly", "see", "martin", "barresi", "2000", "47", "priestly", "view", "strong", "connection", "locke", "collins", "joseph", "priestley", "17331804", "sufficiently", "impressed", "collins", "philosophical", "inquiry", "concerning", "free", "arrange", "publication", "new", "edition", "work", "priestley", "also", "held", "matter", "think", "view", "based", "different", "conception", "matter", "one", "collins", "clarke", "shared", "priestley", "active", "conception", "matter", "derived", "boscovich", "priestley", "also", "impressed", "collins", "work", "prophecy", "yolton", "1983", "108113", "62", "continent", "collins", "influence", "continent", "second", "half", "eighteenth", "century", "much", "considerable", "influence", "england", "higgins", "remark", "small", "though", "part", "english", "literature", "may", "lifetime", "english", "writer", "fully", "reported", "continental", "journal", "noted", "foreign", "university", "higgins", "1970", "203", "pierre", "desmaizeaux", "knew", "collins", "26", "year", "friend", "collaborator", "desmaizeaux", "played", "important", "role", "raising", "collins", "reputation", "england", "continent", "collins", "discussed", "clarke", "response", "book", "determinism", "desmaizeaux", "desmaizeaux", "kept", "collins", "contact", "intellectual", "life", "continent", "also", "served", "publicist", "collins", "collins", "inquiry", "translated", "french", "handled", "printing", "book", "1720", "collins", "direction", "desmaizeaux", "published", "collection", "several", "piece", "mr", "john", "locke", "never", "printed", "extant", "work", "pub", "author", "life", "evermemorable", "mr", "john", "hale", "c", "contained", "number", "locke", "letter", "collins", "considerable", "interest", "continent", "thinkingmatter", "controversy", "certain", "amount", "debate", "influence", "collins", "book", "free", "determinism", "voltaire", "higgins", "accepts", "evidence", "produced", "torrey", "voltaire", "english", "deist", "voltaire", "converted", "determinism", "reading", "collins", "higgins", "1970", "21920", "time", "passed", "freethinking", "came", "open", "france", "collins", "name", "associated", "finally", "work", "materiality", "soul", "determinism", "free", "prophecy", "influenced", "group", "around", "baron", "holbach", "detailed", "treatment", "collins", "influence", "continent", "see", "higgins", "1970", "chapter", "xi", "whether", "collins", "would", "happy", "depends", "whether", "view", "deist", "higgins", "atheist", "david", "berman", "jacopo", "agnesina", "disagreement", "whether", "regard", "collins", "deist", "atheist", "someone", "whose", "view", "changed", "time", "unclear", "even", "serious", "unresolved", "problem", "determining", "collins", "proper", "place", "history", "idea"]}