{"url": "continental-rationalism", "title": "Continental Rationalism", "authorship": {"year": "Copyright © 2017", "author_text": "Shannon Dea\n<shannon.dea@uregina.ca>\nJulie Walsh\n<julie.walsh@wellesley.edu>\nThomas M. Lennon", "author_links": [{"https://www.uregina.ca/arts/philosophy-classics/faculty-staff/faculty/dea-shannon.html": "Shannon Dea"}, {"mailto:shannon%2edea%40uregina%2eca": "shannon.dea@uregina.ca"}, {"mailto:julie%2ewalsh%40wellesley%2eedu": "julie.walsh@wellesley.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2017</a> by\n\n<br/>\n<a href=\"https://www.uregina.ca/arts/philosophy-classics/faculty-staff/faculty/dea-shannon.html\" target=\"other\">Shannon Dea</a>\n&lt;<a href=\"mailto:shannon%2edea%40uregina%2eca\"><em>shannon<abbr title=\" dot \">.</abbr>dea<abbr title=\" at \">@</abbr>uregina<abbr title=\" dot \">.</abbr>ca</em></a>&gt;<br/>\nJulie Walsh\n&lt;<a href=\"mailto:julie%2ewalsh%40wellesley%2eedu\"><em>julie<abbr title=\" dot \">.</abbr>walsh<abbr title=\" at \">@</abbr>wellesley<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nThomas M. Lennon\n\n    </p>\n</div>"}, "pubinfo": ["First published Wed Nov 21, 2007", "substantive revision Mon Nov 6, 2017"], "preamble": "\n\n\nThe expression “continental rationalism” refers to a set\nof views more or less shared by a number of philosophers active on the\nEuropean continent during the latter two thirds of the seventeenth\ncentury and the beginning of the eighteenth. Rationalism is most often\ncharacterized as an epistemological position. On this view, to be a\nrationalist requires at least one of the following: (1) a privileging\nof reason and intuition over sensation and experience, (2) regarding\nall or most ideas as innate rather than adventitious, (3) an emphasis\non certain rather than merely probable knowledge as the goal of\nenquiry. While all of the continental rationalists meet one or more of\nthese criteria, this is arguably the consequence of a deeper tie that\nbinds them together—that is, a metaphysical commitment to the\nreality of substance, and, in particular, to substance as an\nunderlying principle of unity.\n", "toc": [{"#IntrRatiSubs": "1. Introduction: Rationalism and Substance"}, {"#DescHisCrit": "2. Descartes and His Critics"}, {"#MaleCave": "3. Malebranche and Cavendish"}, {"#Spin": "4. Spinoza"}, {"#LeibConw": "5. Leibniz and Conway"}, {"#BeyoContRatiOtheVoic": "6. Beyond Continental Rationalism: Other Voices"}, {"#Bib": "Bibliography"}, {"#PrimSour": "Primary Sources"}, {"#SecoSour": "Secondary Sources"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Introduction: Rationalism and Substance\n\n\nThe seventeenth and early eighteenth centuries saw the heyday of\nmetaphysical system-building, but the expression\n“continental rationalism” primarily connotes rather a set\nof epistemological views. By contrast to British empiricism,\nwhich traces all knowledge to sensory experience, these views\nemphasize a reliance on reason (ratio in Latin, hence\nrationalism), the resources of which are taken to be sufficient in\nsome sense for what we know. Thus, a signature doctrine of rationalism\nis the doctrine of innate ideas, according to which the mind has built\ninto it not just the structure of knowledge but even its\ncontent. Nonetheless, among the philosophers comprising the extension\nof the expression, metaphysical issues, particularly the ontology of\nsubstance, occupy the central place. Certainly, this is true of\nLeibniz and Spinoza, but also of Malebranche and other Cartesians, and\neven of Descartes on some plausible understandings of him.\n\n\nTo understand the relationship between rationalism’s\nmetaphysical and epistemological commitments, it is helpful to recall\nPlato’s divided line, which establishes a parallel between\nobjects known and the means by which they are known. In fact, the\norder of objects, the ordo essendi ranging in importance down\nfrom the Good to other forms, to individual things, and to images, and\nthe order of knowing, the ordo cognoscendi, ranging from\nintuition of various sorts down to sensory experience, is itself to be\nfound in various versions among the later rationalists. The important\npoint, in any case, is that, for the continental rationalists as for\nPlato, the epistemological distinctions are grounded in ontological\ndistinctions. Or, to put it in terms that reflect rationalist thinking\non a number of issues, there is only a distinction of reason between\nthe two orders. The orders of being and knowing are not really\ndistinct; they differ only in our ways of thinking about them.\n\n\nThere is a good explanation of the close connection seen by the\nrationalists between the epistemological and ontological orders, one\nthat also accounts for their notable reliance on reason. It derives\nfrom their answer to what Leibniz called the grand metaphysical\nquestion: why is there something rather than nothing at all? There is\nsomething because there must be something; there cannot be nothing (and\nthis way of putting it shows the ultimate debt of the rationalists to a\ntradition that goes back to Parmenides). Reality, or at least some part\nof it, has necessary existence, and that necessity is something like\nlogical necessity. With this answer, a whole philosophical outlook\nfalls into place. First of all, any significant role for sensory\nexperience falls away, since what exists can be known a priori\nby logic alone. Causal connections tend to be viewed as logical\nconnections; a principle of sufficient reason falls out which tends to\nbe read as a matter of logical deduction. One result is that there is\nan impulse toward monism: if the ultimate cause must exist, then that\nfor which it is the sufficient reason must also exist, and just how the\ntwo can be distinguished becomes problematic (again, the Parmenidean\nantecedent is clear).\n\n\nThis outlook was not articulated as such by any rationalist except,\nperhaps, Spinoza—indeed most were concerned to avoid such\nconsequences of their views. But the outlook does capture the\nintuitions behind the metaphysical systems they elaborated. And it\ncertainly draws the contrast between them and the empiricists, who\ntended toward tychism, the view that the world is largely, or\neven entirely, a product of chance. On the empiricist account, the\nuniverse consists of many independent individuals, which, if they are\nconnected, are so only accidentally, reducing causation to nothing\nmore than a matter of constant conjunction. (This physical,\nmetaphysical, and logical atomism is in the tradition of Democritus,\nEpicurus, and Lucretius.) Under such circumstances, only experience of\nthe world can provide knowledge of it.\n\n\nThe early modern period of philosophy, including continental\nrationalism, is generally supposed to have been driven by the new\nscience to a radical departure from the Aristotelianism of the late\nmedieval or renaissance period immediately preceding it. (But see\nGoldstone’s 1998 problematization of the very idea of early\nmodernity, and of the view that the period was launched by the New\nScience.) The mechanization and mathematization of the world demanded\nby the inertial physics of a moving Earth led to a revolutionary\nphilosophy better described, at least in its rationalist version, as\nPlatonic, or even Pythagorean. Even so, Aristotelian concepts and\nterminology persisted. Both were appropriated and deployed to deal\nwith the new problems. The principal Aristotelian concept taken over\nby the rationalists was the concept of substance.\n\n\nAristotle’s term ousia is usually translated as\n“substance”. What exactly Aristotle meant by the term is a\nthorny matter, much debated in the literature. His account of\nsubstance in the Categories holds individual things, which he\nterms “proper substances”, to be paradigmatic of\nsubstance. On this account, substance is best understood by analogy\nwith a grammatical subject—it takes a predicate, and is not\npredicable of anything further. Thus, while animal is predicable of\nhorse, and horse of Bucephalus, Bucephalus stands by himself,\nimpredicable of, and hence, numerically different from anything\nelse. Much of Aristotle’s account in\nthe Metaphysics—written years later—seems to\naccord with this. However, Metaphysics (1017b10–26)\ncomplicates the story. Aristotle there describes four uses of the\nterm. He concludes by reducing these to two broad senses—(1)\nsubstance as hypokeimenon, the ultimate substratum, which is\nnot predicated of anything further; and (2) substance as form—\nthat which makes each thing the kind of thing that it is. Indications\nwithin the text suggest that, by the time that he was giving the\nlectures that are collected in the\nMetaphysics, Aristotle regarded not individual things but the\nmatter of which these individual things are formed as the ultimate\nsubject of predication. On this conception, there is some sense in\nwhich Bucephalus is himself predicable of matter. Thus, while the\nsubstance of the Categories serves as a principle of\nindividuation, the substance of the Metaphysics is more\ncomplicated, serving both to individuate Bucephalus and Seabiscuit and\nto capture the connection or sameness that holds between them.\n\n\nThat substance should be called upon to account for both difference\nand sameness in the world indicates an inherent tension in the\nconcept.  Certainly, the two senses of the term\n‘substance’ were in tension during the seventeenth\ncentury. The momentum of rationalist argument was to resolve the\ntension by folding the first sense into the second: there is no real\ndifferentiation in the world, only the appearance of\ndifference. Seventeenth century rationalists assigned to substance\nthree roles of connection. Substance was taken (1) to connect\nattributes as attributes of the same thing at a time (a given\nshape and a given size as the shape and size of the same thing), (2)\nto connect them over time (the later shape and size, perhaps\ndifferent from the earlier, as nonetheless the shape and size of the\nvery same thing), and (3) to connect them as somehow related to the\nthing as a certain kind of thing (for the Cartesians, shape and size\nwould indicate the thing to be of the kind “extended”).\nHowever, Spinoza alone among the continental rationalists fully\nembraced the conception of substance as a fundamental connection\nbetween things. The other members of the movement struggled to retain\na notion of substance as individuator, but did so with varying degrees\nof success.\n2. Descartes and His Critics\n\n\nThe rationalism of the most famous of the rationalists is problematic\non two counts. First, Descartes is known as the father of modern\nphilosophy precisely because he initiated the so-called\nepistemological turn that is with us still. Since Descartes,\nphilosophy has been especially concerned with the theory of knowledge,\nboth in itself and as it affects other areas of philosophy. Ethics,\nfor example, has often been concerned with how the good might be known\nrather than with what the good might be. With his fundamental\nobjective of achieving certainty for his beliefs, Descartes has thus\nbeen principally responsible for the incomplete characterization of\nrationalism as not just etymologically but essentially connected to\nthe claims of reason. While Descartes certainly sought to justify the\nclaims of reason and relied upon them, even for him there are\ncorresponding ontological views that are no less important to his\nsystem.\n\n\nThe second problematic aspect of Descartes’s rationalism is more\ndifficult to resolve. Descartes was a radical voluntarist who thought\nthat all truth, including what we take to be necessary truth, depends\non the will of God. Care needs to be taken in how this view is\nexpressed, for Descartes did not hold simply that what we take to be\nnecessary in fact is contingent. He held that actually necessary truth\ndepends on God’s unconstrained will, such that even propositions\nthat are logically contradictory might have been simultaneously\ntrue. Reason itself thus seems no longer reliable, and experience\nwould seem to be the only way of determining which of the worlds even\nbeyond logic such a powerful and unconstrained God has created. Not\nmany of the rationalists, even among the Cartesians, followed\nDescartes in this radical voluntarism, and some in recent times have\nseen the view as ultimately incoherent. Even so, Descartes seems to\nhave taken the view as the basis at least of his physics, and perhaps\nof his whole system. Indeed, on some accounts, it was this doctrine of\ncreated truth that enabled Descartes to frame the most radical doubt\nhitherto conceived, when in the Meditations he entertained\nthe possibility that he was always deceived by a mendacious deity,\neven when considering what appeared to him most obviously true, to\nwit, the existence of the “simplest things” that are the\nsubjects of arithmetic and geometry. (Against this view, Margaret\nWilson (1982, 105–114), observes that, in Meditation 1, God need\nonly have the power to deceive me about the eternal truths, not to\ncreate them.) While a doubt (and a doctrine) this radical might lead\none to despair of ever achieving sure knowledge, for Descartes, it was\nthe catalyst for his discovery of the cogito, and with it,\nhis first indubitable truth—the truth of his own existence.\n\n\nAt every stage of Descartes’s argument in\nthe Meditations, there are ontological implications: the\nmind’s independence of sensory perceptions (perceptions whose\nreliability is ultimately upset by the possibility that he is\ndreaming), the literally unimaginable sort of thing that a physical\nobject such as a piece of wax must be, the existence of a veracious\nGod, who provides a guarantee for the reliability of reason, and\nfinally the existence of a physical world consisting of extended\nthings. Arnauld immediately suggested to Descartes that his argument\ncontained a circle: we can rely on reason only if we know that God\nexists, but we know that God exists only by relying on reason. Thus,\nDescartes has established the certainty only of his own existence, but\nnothing beyond that. Descartes thought that he had a response to this\ncriticism, but whether he did, and how cogent it is as a rebuttal,\nhave been perennial questions of debate among Descartes scholars. One\nway to understand Descartes’s procedure is that while he does\nnot claim to prove even that he exists, he does claim to show that it\nis unreasonable to think otherwise. That is, he shows that the\nargument of the skeptic fails because the consistent application of\nreason leads to the view not that reason is unreliable, but precisely\nthe opposite. The skeptic might be right, but he is unreasonable. A\nparallel case in the moral realm might be brought out here. Over the\ncourse of an exchange with Mesland about the nature of human freedom,\nDescartes notes that we can, absolutely speaking, act against against\nour reason and judgment. However, morally speaking, we cannot (CSM III\n245/AT 4:173). When explaining what he means by this, Descartes\nsuggests that we can only act against our better judgment and reason\nin the case where we take it to be a good thing to demonstrate our\nfreedom by doing so. This is what Kenny has called the “freedom\nof perversity” (Kenny 1998). In other words, only with the\nattitude of perversion can we act against what we take to be best. So,\nas in the epistemological realm, so too in the moral realm: it is\nunreasonable or even perverse to deny the results of the consistent\nuse of reason. Descartes thus emerges at least as a bootstrap\nrationalist—using innate reason and a disinclination to\nperversity to assert the truth of his own existence, which, in turn,\nserves as a foundation for a more extensive search after\ntruth—in a way that mirrors the non-absolute status of his\nnecessary truths. The rationalist connection between the orders of\nbeing and knowing is thus preserved.\n\n\nBut what sense can be made of the doctrine of created truth? By what\nkind of causality did God create the eternal (necessary) truths? In\nresponse to this very question Descartes replied that God did so in\njust the way that He created everything else, that He is the total and\nefficient cause not only of the existence of created things, but also\nof their essence. The eternal truths are just this essence of created\nthings. As before, Descartes did not elaborate his answer, but, once\nagain, he provided enough elsewhere for us to do so. It is clear that\nfor Descartes, as for many other theologically orthodox thinkers, the\nexistence of things results from an unconstrained exercise of God’s\nomnipotent will to create ex nihilo. What Descartes might be\nsaying, then, is that an eternal truth or essence is also something\nthat is created ex nihilo. The eternal truths might thus be\ninstances of what Descartes called substance.\n\n\nIn the Principles, Descartes defined “substance”\nas a thing that exists such that its existence does not depend on any\nother thing. He immediately added that, strictly speaking, the term\napplies only to God, who, as uncreated, alone depends on nothing else\nto exist. However, he allowed that in an extended sense it applies to\nthings that depend only on God’s creation and continuing\nconservation. These created substances are really distinct from other\nsubstances insofar as they are conceivable apart from each other. They\ndo not require a subject of inherence, and are thus ontologically, if\nnot causally, independent. These created substances are distinguished\nfrom other things, such as qualities, which not only depend on God\ncausally, but also depend ontologically on other things, ultimately on\ncreated substances, as subjects of inherence. In this sense, a created\nsubstance for Descartes is like the hypokeimenon of\nAristotle, playing both its roles, as individuator and bearer of\nqualities. However, with his definition of the real distinction, he\nbuilt in an unintended tendency toward monism—a tendency that\nSpinoza exploited. For Descartes, one thing is really distinct from\nanother just in case it can be conceived apart from that other. But,\nif this test of independence is applied to causal relations, it\nproduces the result that there is but one substance, God.\n\n\nWhat types of things counted as created substances for Descartes?\nClearly, he takes an individual mind to be a created substance. If a\nmind did not have this status, then Descartes’s argument for its\nimmortality, that it can be conceived apart from all else except God,\nand a fortiori from the body, would collapse. Beyond minds,\nhowever, an ambiguity appears. Although there are texts in which\nDescartes speaks of individual things like a piece of wax as\nsubstances, there are others—most famously, the Synopsis to\nthe Meditations—that indicate that there is but a\nsingle extended substance, of which individual things are the\nmodes. At a minimum, there is an asymmetry in his treatment of minds\nand material things, perhaps reflecting the tension between\na hypokeimenon, accounting for difference, and the other\nsense of ousia, accounting for sameness. To say that Peter\nand Paul are substances is to say that their minds are numerically\ndistinct; but to say that a piece of wax and a piece of wood are\nsubstances might be to say that they are both extended things.\n\n\nHowever many instances of each kind there might be, there is a\ndualism of two kinds of substance, according to Descartes: thinking\nthings, or minds, and extended things, or bodies. This dualism\ngenerated two well-known problems, resolved by Descartes with only\npartial success. One of his most incisive critics, Elisabeth of\nBohemia, wanted to know how in voluntary action the will, which is a\nproperty of the unextended mind, could have an effect on the body,\ngiven that, according to Descartes’s mechanistic physics, a material\nthing can be affected only by what is in contact with it. Descartes\nreplied with a rather mysterious account of how the mind and body\nformed a unique kind of composite. Over the course of the letters of\ntheir correspondence that focus on this issue, Elisabeth presses\nDescartes for an explanation of how mind and body interact.\nDescartes’s responses do not satisfy Elisabeth, and rightly so.\nFor, the mysterious composite that he suggests involves the concept of\na primitive notion (Shapiro, 65/AT 3:665), a concept that is\nnot present in any other of his writings. Descartes states that we have\nprimitive notions for the body, “extension”, for the mind,\n“thought”, and for the mind/body composite,\n“union.” He explains that each of these notions is best\nunderstood by using a faculty that is particularly well-suited to grasp\nit. The primitive notion for the mind, he states, is best understood by\nthe understanding alone; the primitive notion of the body is best\nunderstood by the understanding aided by the imagination; and the\nprimitive notion of the composite is best understood by the senses\n(Shapiro, 69/AT 3:691). Armed with the distinction in methodology for\nknowing each of these notions, Descartes diagnoses Elisabeth’s\ndifficulty in understanding his explanation in the following way: She\nis trying too hard to understand the union of her mind and body by her\nunderstanding alone. The remedy to this problem, he suggests, is for\nthe Princess to stop meditating on the problem, and to instead focus on\n“life and ordinary conversations” in order to conceive the\nunion (Shapiro, 70/AT 3:692). But, of course, this recommendation does\nnot adequately address Elisabeth’s question. For, while focusing\non “life” and “ordinary conversations” may well\nhelp to conceive that the mind and body interact, a point that\nElisabeth does not call into question, it furnishes nothing towards an\nanswer to the question of how such an interaction occurs. The\ndiscussion of this topic comes to an end with Elisabeth’s\nsuggestion that she is better able to understand the how of\ninteraction by thinking that part of the soul is extended (Shapiro,\n72/AT 4:1). On this model, a necessary condition for motion, contact,\nis possible.\n\n\nDescartes’s effort to resolve a second difficulty is more promising,\nand also exemplifies the rationalistic character of his thought. The\nproblem is to show how the mind can know something such as a material\nthing that is different in kind from it, given a longstanding principle\nthat only like can know like. He rejected this essentially Aristotelian\nprinciple, but still had to give an account of such knowledge. From\nscholastic sources, Descartes was able to construct a theory of ideas\naccording to which to know something is to have an idea of it, the idea\nbeing the very thing known in so far as it is known. He saw the term\n“idea” as ambiguous: taken materially, it has formal\nreality, as a mode of the mind; taken in another sense, it has\nobjective reality, as the thing represented. But there is no real\ndistinction between these realities, only a rational distinction. They\nare really the same thing considered differently. A welcome\nepistemological upshot of this rationalist gambit is that Descartes has\nno skeptical problems generated by ideas standing as a tertium\nquid between the knower and what is known.\n\n\nThis result is indicated by Descartes’s use of the term, picked up\nand emphasized by Malebranche, according to which there are no\nfalse ideas; every idea in this sense is materially true in\nthat it has an object, and that is the object it appears to have. This\nconception of an idea is the basis for Descartes of what has been\ncalled the transparency of mind: I cannot be mistaken that I am\nthinking about what I am thinking about. Malebranche (whose entire\nphilosophy was colored by his struggles with Descartes’s theory\nof ideas), in fact, later erected such incorrigible intentionality\ninto the fundamental principle of his epistemology. Meanwhile,\nDescartes’s view that material or formal reality and objective\nreality are only rationally distinct might be taken to mean that minds\nare intrinsically intentional. A mind just is the sort of thing whose\nstates are about something else. Arnauld extended this thesis, which\nadumbrates later thinkers such as Brentano, to include all mental\nphenomena, even sensations.\n\n\nAnother line of discussion that relates to the problem of dualism and\nthe nature of ideas is advanced in 1734 by Ghanaian philosopher Anton\nAmo. An extraordinarily interesting thinker in his own right, Amo\nadvances a critique of Descartes’s assertion that the mind can\nsense, that is, that the immaterial mind can passively receive sensory\ninformation. In his dissertation, On the Apatheia of the Human\nMind, or The Absence of Sensation and the Faculty of Sense in\nthe Human Mind and Their Presence in our Organic and Living Body,\nAmo states that the human mind is spirit, and that spirit is that\nsubstance that is purely active. Following the narrative of the\ncommitment to the metaphysical reality of substance as the common\nfeature of rationalists through this period, Amo sits firmly in the\nrationalist camp. But it is on the basis of this particular definition\nof substance that Amo distinguishes his view from\nDescartes’s. According to Descartes, the mind can sense. For\nAmo, sensation, which is purely passive, cannot be a feature of the\nspiritual, purely active substance of mind. There are two threads of\nAmo’s critique. First, he is concerned to uphold the soul in the\nlofty position that it deserves given its status as purely active. His\ncritique of Descartes on this point intersects with the objections\nraised by Elisabeth: the mind, being immaterial, cannot interact with\nmaterial things. Thus, the mind cannot have sensation of material\nobjects (Amo, 75). Second, Amo wishes to emphasize the essential\nnature of the body for human beings. On his view, “to live and\nto have sensation” are inseparable predicates. All living things\nfeel; all feeling things live. But, on his view, “to live”\nis to be embodied. This allows Amo to call into question\nDescartes’s claim, in Meditations II, that he is\nnothing but a thinking thing. For Amo, it is impossible for the\n“thinking thing” to live without a body. Amo is thus a\ndualist, like Descartes, but with the important difference of removing\nsensation from the mind, and locating it in the body. This move\nsimultaneously preserves the pure activity of the mind and boosts the\nimportance of the body in the entity that is a human being.\n\n\nBut Amo’s dualism faces the same problem as Descartes’s:\nif we accept the fact that the body senses and the mind does not, then\nAmo must provide an explanation for how the mind and body communicate.\nIn particular, he must provide an explanation for how the body can\nsense, for instance, pain, and communicate this sensation to the\npurely active mind. While Amo might seem no better situated than\nDescartes to offer such an explanation, he does endorse an interesting\ndefinition of “idea” that may provide a starting point for\nsuch an explanation. Amo states that when we think of the manner in\nwhich a human being functions, there are four elements that must be\nkept separate: mind, the operation of the mind, idea, and immediate\nsensation. Both the mind and its operations are immaterial, he says,\nand immediate sensation is a property of body. However, on Amo’s\nview, “idea” is to be understood as “a composite\nentity; for there is an idea when the mind makes present to itself a\nsensation pre-existing in the body, and thereby brings the feeling\nbefore the mind” (Amo, 74). If by “composite”, Amo\nmeans a composite of material and immaterial substance, then this\nsuggestion bears some resemblance to Elisabeth’s claim, above,\nthat she thinks that there could be a material part of the soul that\ncould account for its ability to interact with the body. Of course,\nexplaining just how the mind makes a sensation present to itself and\nthus brings a feeling before it, will determine the success of any\nsuch explanation.\n3. Malebranche and Cavendish\n\n\nThe battle between the Cartesians and their opponents in the latter\nhalf of the seventeenth century was one of the great struggles in the\nhistory of philosophy, but it was one in which the lines were not\nclearly drawn. For, although those in the Cartesian camp claimed the\nbanner of Descartes, there were as many differences among them as\nbetween them and their opponents. Perhaps the most important\ndifference among them hinged on whether or not they accepted\nDescartes’s doctrine of created truth. Desgabets and his student\nRégis were the most important among the few who did accept the\ndoctrine. Along with their acceptance of the doctrine, however, came\nnascent tendencies toward empiricism. On the other hand, Malebranche,\nthe most notable among the Cartesians who rejected the doctrine of\ncreated truth, developed a philosophical system with a purer\nrationalistic character than Descartes’s own. Descartes had\nadvised his followers to follow not him but their own\nreason. Malebranche, like other heterodox Cartesians, justified his\ndifferences from Descartes as the result of following this\ninjunction. On his view, his rejection of the doctrine of created\ntruth followed from his commitment to other, deeper views in\nDescartes. He thus represented himself as more Cartesian than\nDescartes himself.\n\n\nThe philosophy of Malebranche is sometimes portrayed as a synthesis of\nDescartes and Augustine, but a more precise way to put this relation\nis that Malebranche used Augustine to rectify shortcomings he\nperceived in the philosophy of Descartes. Chief among these was\nDescartes’s theory of ideas, which, according to Malebranche,\nnot only fails to reflect human beings’ proper dependence on God\nbut also leads inevitably to skepticism. Initially, Malebranche\nthought that he agreed with Descartes’s theory, but in the long\ndebate over the nature of ideas he had with Arnauld, who held a close\nversion of Descartes’s theory, Malebranche came to see a need\nfor a different account.\n\n\nNot implausibly, Arnauld took Descartes’s claim about the\nambiguity of the term “idea” to mean that\n“idea”, or “perception”, refers to one and the\nsame thing, a thing which stands in two different relations. Insofar\nas it is related to what is known, it is called an idea; insofar as it\nis related to the mind, it is called a perception. This (act of)\nperception he took to be related to the mind as a mode of it. It is at\nthis point that Malebranche detected the threat of skepticism. What we\nknow, indeed what we know in the most important instances of\nknowledge, is universal, necessary, and infinite, as in the case of\ncertain mathematical knowledge. But nothing that is the mode of a\nparticular, contingent and finite mind can be universal, necessary or\ninfinite. If ideas were modes of the mind, then we would not have such\nknowledge; but since we do have such knowledge, ideas must be\nsomething else.  Malebranche argued that the only being in which such\nideas could exist is God. Following Augustine, he took ideas to be the\nexemplars in the mind of God after which He creates the world. This\nconstrual had the additional advantage for Malebranche of guarding\nagainst skepticism because, although idea and object are no longer\nidentical, they are nonetheless necessarily connected as exemplar and\nexemplum. Even so, it remained true for Malebranche that, when we look\nat a material thing, what we in fact see is not that thing but its\nidea. This is the core of his view of “vision of all things in\nGod”, which he welcomed as an indication of human beings’\ndependence on the deity. The immediate vehicle whereby we have such\nknowledge is a particular, contingent, and finite mode of the mind;\nbut the universal, necessary, and infinite object of that mode can\nexist only in some other kind of being. How are these ideas known to\nthe mind if they are not in it, at least not as modes of it? Although\nideas are not innate to the mind, for that would make them modes of\nit, they are nonetheless always present to it. In seeking to know,\nwhether we realize it or not, we are consulting Reason, which\nMalebranche identifies with the second person of the Trinity,\nthe logos of Neoplatonic theology. Our effort to know is a\n“natural prayer” that Reason always answers.\n\n\nAs for individual substances, Malebranche clearly thought that every\nmaterial thing and every mind is a substance in the sense of a\nhypokeimenon. But when pressed late in his life to show how\nthis status for them comported with the rest of his system, how they\ncould be anything but modes of a single substance, in short how he\navoided the drift into Spinozistic monism, he was in fact hard\npressed.  In the Search After Truth, Malebranche clearly\ncommitted himself to the view that everything is either a substance or\na mode. In addition, he accepted Descartes’s criterion for a\nsubstance that it be conceivable apart from everything else. However,\nhe maintained that any given portion of extension is conceivable apart\nfrom the rest of extension and is thus a substance. (Descartes did not\nthink this, otherwise void space would be possible for him.) Since\nextension is conceptually divisible to infinity, Malebranche is\ncommitted to an infinite number of extended substances. Apart from the\nwhole of extension, moreover, every substance contains an infinite\nnumber of substances, of (each of) which it is a mode. It is also a\npart of an infinite number of substances, which are modes of it. The\nexplanatory value of the concept of substance would seem to have been\nlost with such results as these. Malebranche’s view seems to be\na degenerate version of Descartes’s texts to the effect,\nsurprising but coherent, that there is but one material\nsubstance, res extensa, whose modes are particular material\nthings. Here the effect is to reverse the Aristotelian logic of\nsubstance. To say of \\(x\\), a particular thing, that it is extended\n\\(E\\), is to say not that a substance \\(x\\) has a property \\(E\\), but\nthat \\(x\\) is a mode of\nres extensa.\n\n\nThese difficulties in accounting for substance on Malebranche’s\npart seem to derive from his Platonism. As a Platonist, he was\ninterested less in substance as the hypokeimenon, which\naccounts for difference, than in its other sense of ousia,\nwhich accounts for sameness. Thus, Malebranche’s skid to\nSpinozism is greased even when he talks about mind, the essence of\nwhich is thought—not this or that thought, “but\nsubstantial thought, thought capable of all sorts of modifications or\nthoughts”. Since the same substantial thought is had by all\npossessed of a mind, Malebranche’s view smacks even of the\nsingle intellectual soul for all human beings of the Latin\nAverroists. In this sense too, then, his heterodoxy as a Cartesian is\npart and parcel with his deep commitment to rationalism, and in\nparticular with his rationalistic reduction of phenomenal difference\nto real sameness.\n\n\nThe final rationalistic aspect of Malebranche’s thought that\ndeserves attention here is his theory of causation. For Malebranche, a\ncause is that between which and whose effect there is a necessary\nconnection. On his view, the causal connection that is characterized by\nthis kind of necessity is that between God’s will and its effects.\nThus, for Malebranche, only God has causal efficacy. What we take to be\nreal causes—for example the motion of a billiard ball that\ncollides with another that then begins to move—are in fact only\noccasional causes, the occasions for the operation of the only real\ncause.\n\n\nA cousin of Malebranche’s occasionalism is worth noting here.\nMargaret Cavendish agrees with Malebranche that bodies do not cause\nchange in one another, but she disagrees with him about whether nature\nis self-moving. Where Malebranche takes created things to possess no\ncausal power at all, Cavendish takes them to possess the power of\nself-motion. On her view, when bodies interact, there is no transfer\nof motion. Cavendish’s commitment to this view is grounded in\nher belief that properties cannot be transferred between\nbodies. Because motion is a property, she argues, motion cannot be\ntransferred between bodies. Following this line of reasoning, when\nbodies come into contact, they act as occasional causes, that is,\ncauses that merely occasion a change. In an interaction, one body will\nserve as occasional cause, and the second body will serve as a\n“principal” cause, which brings about, in itself, the\n appropriate effect (see Detlefsen 2006 and the entry on\n Cavendish).\n Both thinkers also hold the view, ubiquitous in the period, that motion\nis issued into the created world as a result of God’s willing it.\nCavendish is careful to note that this issuance is the result not of\n“an immediate action of God” but rather by an\n“all-powerful command” (Cavendish, 209). She rejects the\nformer option on the grounds that such continual, immediate action is\nunsuitable to “an immovable and immutable essence”\n(Cavendish, 209). On this point, she and Malebranche are in\nagreement.\n\n\nThe difference in the way that they conceive of occasional causation\nis in how they understand the content of the “all-powerful\ncommand” that introduces motion into the system. On\nMalebranche’s view, a true cause is one where we can perceive a\nnecessary connection between it and its effect. The only candidate for\nsuch a connection is between the infinite will as cause, and its\neffects. Moreover, he seems to also endorse the claim that for a cause\nto bring out its effect, it must possess the knowledge of how to bring\nit about. In the case of the relationship between a finite mind and\nthe body to which it is joined, our ignorance of how the mind\n“causes” the body to move is enough to deny that there is\ncausal connection. In short, only God has the required knowledge to\neffect these kinds of changes. These arguments undergird the central\nMalebranchean commitment: the utter dependence of all created things\non God. As such, it makes sense, on his system, to deny causal\nefficacy to anything other than God. Such a denial of causal efficacy\nentrenches the dependence of created things on their creator.\n\n\nCavendish tells a different kind of story here. She notes that those\nwho show discomfort with the notion that God, through His command,\ngave the power of self-motion to all created things, are clouded by\ntheir “ambition” (Cavendish, 209). Ambition leads certain\nthinkers to imagine that the immaterial substance of their souls is\nthe only created thing that possesses self-motion. On this\nunderstanding of causation, they feel closer to God, who is radically\nself-moving, and superior to material things, which do not possess the\nability to self-move. However, Cavendish notes, the decree from God\nthat introduces motion into the created world is just as easily\nimparted to material things as to immaterial things. As such, there is\nno reason to suppose that He did not give the power of self-motion to\nmaterial things.\n\n\nCavendish’s criticism of those whose ambition clouds the way\nthey think about self-motion does not apply to Malebranche, however.\nFor, on his view, no created thing, human souls included, possesses\nthe power to self-move. Given Malebranche’s combined\nrationalistic and theological commitments, none of this is\nsurprising. The surprise, or at least irony, comes when\nMalebranche’s arguments that natural causes—even and\nespecially human volitions—cannot be real causes cross the\nchannel and are deployed by Hume. The radical empiricist account of\ncausation that Hume gave in terms of constant conjunction is just\nMalebranche’s rationalist occasionalism without the role\nassigned to God. For Hume, Malebranche’s occasional causes are\nthe only causes.\n4. Spinoza\n\n\nThe centrality of substance for the continental rationalists is\nfurther borne out by the importance of that concept for Spinoza,\nespecially within his Ethics. Spinoza devoted the entire\nfirst part of that work to a consideration of substance, or, as he\nalso termed it “Deus sive Natura” (“God, in\nother words, Nature”). The remaining parts trace the\nconsequences of his conception of substance for epistemology,\npsychology, physics, and ethics. While Spinoza’s account of\nsubstance is quite rightly regarded as a development and working-out\nof Descartes’s metaphysics, there are also (as with Descartes\nand Malebranche) considerable, and important, differences between the\ntwo. What is important for our present purposes, however, is that (as\nwith Malebranche) Spinoza’s departures from Descartes are almost\nalways the manifestation of a form of rationalism purer than\nDescartes’s own. Most radically, Spinoza replaced\nDescartes’s substance pluralism with a monistic account modelled\non Cartesian extended substance. Just as, in some places, Descartes\ntreats bodies as mere modes of a single extended substance, so, for\nSpinoza, all individuals—both bodies and minds—are modes\nof a single substance.\n\n\nSpinoza arrived at this position by way of a decidedly uncartesian\naccount of attributes. While Descartes held that two substances of the\nsame type can share the same principal attribute, Spinoza rejected\nthis. Any two substances, argued Spinoza, must be distinguished either\nby their attributes (Spinoza dropped the modifier\n“principal”) or by their modes. But, since modes are\nthemselves both ontologically and causally dependent on the substances\nof which they are affections, they cannot be the individuating\nprinciple for them. Thus, it must be the attributes themselves that\nindividuate substances (and not just types of substances, as\nDescartes argued). Similarly, while Descartes held that each substance\nis characterized by one and only one principal attribute, Spinoza\ninvoked the principle of plenitude to show that substance must have\ninfinite attributes. Based on a variation of the ontological argument,\nhe maintained that substance is pure, utterly unlimited being. It must\ntherefore, he argued, possess infinite attributes, in the dual sense\nof possessing unlimited attributes and of possessing all\nattributes. Since substance is characterized by infinite attributes,\nand since no two substances can share a single attribute, there can be\nonly one substance. This radical monism was repugnant to many who,\nlike English philosopher Anne Conway, saw that it eliminated any and\nall distinction between the creator, God, and His creation.\n\n\nSpinoza’s one substance is at the farthest possible remove from\nAristotle’s proper substances. Whereas, for Aristotle,\nindividual things, such as Bucephalus, are paradigmatic substances,\nSpinoza denies their substantiality. But does this mean that, unlike\nAristotelian proper substances, which are not predicable of anything\nelse, Spinoza’s finite modes are predicable of substance?\nScholars are divided on this point. Curley has argued that Spinoza\nretains the conception of the substance-mode distinction as a\ndistinction between independent and dependent being, but rejects the\nview that the substance-mode distinction correlates to the distinction\nbetween a subject of predication and its predicate. Bennett, however,\nargues that Spinoza does indeed regard finite modes as predicable of\nsubstance, or, as he puts it, as “adjectival on the\nworld”. Bennett characterizes Spinoza’s account of\nsubstance as a “field metaphysic” in which individual\nthings are simply clusters of qualities within regions of space. Just\nas a blush is merely a confluence of properties on a region of a face,\nso the face—indeed, the person whose face it is—is a\nconfluence of properties “on a region” of substance.\n\n\nWhether or not Spinoza rejected the predicability of finite modes, it\nis clear that he did not regard them as either causally or\nconceptually independent in the way that is requisite for substance.\nFor Spinoza, substance is “in itself and is conceived through\nitself”, whereas a mode is “in something else and is\nconceived through something else”. The “in itself/in\nsomething else” aspect of these two definitions captures\nDescartes’s conception of causal independence, while the\n“conceived through itself/through something else” aspect\nrefers to Descartes’s conceivability-apart criterion for\nontological independence. Descartes, it will be recalled, regarded\ndivine substance as both causally and ontologically independent, but\ncreated substances as ontologically, but not causally, independent,\nsince they depend on God’s creative (and conservative) power for\ntheir existence. It is in this sense that, for Descartes, the term\n“substance” is used equivocally for God and created\nsubstances. Spinoza, however, denied that “substance” is\nan equivocal term. In so doing, he eliminated two asymmetries in\nDescartes’s metaphysics—that between divine and created\nsubstance, and the asymmetry between extended and thinking substance\nthat Descartes expresses in the Synopsis to\nthe Meditations. For Spinoza, finite minds are not themselves\nsubstances, but rather modes of thinking substance. That is, for\nSpinoza, at the most fundamental level, all minds reduce to the\nthinking substance of which they are affections.\n\n\nSpinoza’s account of the eternal verities marks a similar\nrationalistic advance over Descartes’s metaphysics. For Spinoza,\nGod is just substance simpliciter. He lacks volition and personality;\nhis only characteristics are pure being, infinity, necessity, and\nactivity. While Spinoza agreed with Descartes that God is the cause of\nall things, he regarded him not as a transeunt cause, creating the\nuniverse “from the outside” through an act of will, but as\nan immanent cause, from whom the universe unfolds out of his own\nnecessity. For Spinoza, all things therefore follow by logical (and\nnot merely causal) necessity from God’s eternal and infinite\nnature. In this sense, not only mathematical truths but indeed such\napparently contingent facts as Caesar’s having crossed the\nRubicon are necessary truths for Spinoza. The difference between them\nis not the necessity of the truths themselves but rather the route\nthat we take to arrive at them. While mathematical truths, for\ninstance, are deducible by reason alone, Spinoza recognized that the\nfinitude of human understanding prevents, or at least impedes, our\nsimilarly deducing empirical facts about the world. In contrast with\nsome empiricists, who regard cause and effect as mere constant\nconjunction, for Spinoza, the relationship between cause and effect\nhas the force of a logical entailment; empirical facts are themselves\nnecessary truths. The universe is thus, in principle at least,\nperfectly intelligible to reason.\n\n\nFor Spinoza, as for Descartes, the metaphysical commitment to\nsubstance underwrote a rationalist epistemology that strongly\nprivileges reason and intuition over sensation and imagination. The\ndistinctive character of Spinoza’s epistemological rationalism\nis rooted in his principle that “the order and connection of\nideas is the order and connection of things”. For Descartes, the\nmind and the body are, though intimately connected, radically\nheterogeneous.  How it is that the mind comes to know things about the\nphysical world therefore remains, despite his best efforts, a somewhat\nmurky business.  By rejecting the substantiality of both minds and\nbodies, and by regarding them both as modes of a single substance,\nSpinoza obviated this difficulty. For Spinoza, the mind and the body\nare the very same thing conceived in two different ways. Persistent\nclusters of qualities in space are bodies. The ideas—or, in\nDescartes’s terminology, the objective reality—of these\nbodies are minds. Just as a single body has a corresponding objective\nreality, so collections of bodies characterized by various relations\nalso have a corresponding objective reality with isomorphic parts and\nrelations. Since there is no gap between minds and bodies, there is\ntherefore no difficulty in principle in perceiving the physical\nworld. On Spinoza’s account, we perceive the physical world in\ntwo ways—(1) by perceiving the actions of our own bodies, and\n(2) by perceiving the effects of other bodies on ours. Thus, when\none’s body runs, the correlative ideas are in one’s mind.\nLikewise, when someone steps on one’s toe, the physical effects\non the toe likewise have their counterparts in the mind’s\nideas.\n\n\nDespite the necessary connection the mind has with the body, argued\nSpinoza, sensation and imagination are inherently limited. The idea of\nsubstance qua substance must be a perfect unity. However, the idea\nwhich constitutes the human mind is complex—not a unity but a\nplurality of ideas. That idea is therefore confused, rather than clear\nand distinct. Clear and distinct understanding, on Spinoza’s\naccount, must partake of the unity of the idea of substance, and not of\nthe fragmentary nature of the idea of the human body and its\naffects. This cognitive unity is achieved in two ways—through\nreason (which Spinoza termed “knowledge of the second\nkind”) and through intuition (“knowledge of the third\nkind”). When we cognize through sensation and imagination\n(“knowledge of the first kind”), we try to grasp many\nideas at once, and thereby produce confusion. Reason and intuition, by\ncontrast, provide us with access to just one idea—the\nsubstantial unity underlying our body and our mind. Reason does this\nfrom “the fact that we have common notions and adequate ideas of\nthe properties of things”, while intuition proceeds “from\nan adequate idea of the formal essence of certain attributes of\nGod”. To understand the substantial unity that is the necessary\ncause of our body and our mind is to grasp them sub specie\naeternitatis.\n\n\nThis epistemological ideal forms the core of Spinoza’s rationalistic\nethics—and, hence, on one plausible account, the core of his\nEthics. Spinoza’s monism entails that the sort of\nindividuals that Aristotle regarded as primary substances are\ndistinguished not by their own substantial unity, but by their\nconatus—their striving to persist. Thus, self-preservation is\nnot just one possible goal of ethical agents; it is the very thing\nthat makes those agents individuals. Our essence, and our ethical\ntask, is thus to be active, whereas, by contrast, to be passive\nthreatens our persistence. The mind persists through activity and is\nthreatened by passivity. It is therefore in our self-interest to\npursue adequate ideas through knowledge of the second and third\nkinds. The more we join our minds with God through adequate knowledge\nof things under the form of eternity, the less we are affected by\nexternal things and, hence, by our own passions, which are nothing but\nour passivity in the face of forces external to us. Adequate knowledge\nof God gives us equanimity and calm, and literally ensures our\npersistence. Ethical virtue is thus fundamentally epistemological. For\nSpinoza, the most rationalist of figures discussed here, the good life\nis the utterly rational life.\n5. Leibniz and Conway\n\n\nAs we have seen, rationalist epistemology is grounded in a\nmetaphysical commitment to substance. The concept of substance allowed\nthe rationalists to reduce all complexity and plurality to an\nunderlying simplicity and unity, versus the empiricists, who, in their\nskepticism about substance, were committed to regarding reality as\nfundamentally plural and complex. Spinoza’s metaphysics marked\nthe culmination of this rationalist momentum. In Leibniz, the last\ngreat continental rationalist, we see its final movement. Leibniz,\nlike other rationalists before him, regarded quotidian things as\nphenomena that ultimately reduce to perfectly simple\nsubstances. However, for Leibniz, there is an infinite number of these\nsimple substances, each of them causally and perceptually isolated\nfrom all of the others. Leibniz reasoned that this is the best of all\npossible worlds because it balances the maximal possible complexity\nwith the maximal possible order. In thus privileging neither unity nor\nplurality, neither simplicity nor complexity, and in striking the\nbalance that he did on purely rational principles, Leibniz exemplified\na more complex, more comprehensive and, ultimately, more mature\nrationalism than that of his predecessors.\n\n\nFor Leibniz, at the most fundamental level, reality is characterized\nby simple substances, or “monads”, a term that Leibniz\npicked up from Francis Mercury van Helmont and Anne Conway in 1696\n(Merchant 1979). Since there are composites, Leibniz argued, there\nmust be simple substances that, together, constitute these\ncomposites. Being simple, monads have neither parts, nor extension,\nnor form, nor divisibility. Leibniz saw them as the “true Atoms\nof nature”. While Leibniz thus retained a strong commitment to\nsubstance, he resisted rationalism’s synechistic momentum, which\nprivileged the metaphysical and methodological stance of the\ncontinuity of the universe, by rehabilitating substance’s\nAristotelian role as an individuator. However, while, for Aristotle,\nBucephalus is a proper substance, Leibniz regarded Bucephalus not as a\nsubstance but as himself comprising a collection of simple\nsubstances. Leibniz agreed with Aristotle’s characterization of\nsubstance as the grammatical subject of predication and not itself\npredicable of anything else. However, he complained that this account\ndoes not go far enough. For Leibniz, the essence of substance lies not\nin the fact that it is the subject of predication, but in the fact\nthat every possible predicate may be asserted or denied of it. In this\nway, every individual substance has a complete concept, a conception\nso complete (that is, so fully determinate) that every fact about the\nsubstance, and about its situation in the universe—past, present\nor future —follows from it analytically.\n\n\nLeibniz’s insistence that every individual substance has a\ncomplete concept entailed that, unlike Spinoza, he regarded Cartesian\nthinking substance and not Cartesian extended substance as\nparadigmatic of substance. Descartes’s extended substance (like\nSpinozistic substance) is, on Leibniz’s account, not a substance\nat all since it does not afford a principle of individuation. Leibniz\nargued that, whereas a real substance has a complete concept, the\nCartesian notion of extended substance is an abstraction arrived at\nthrough an incomplete concept. Matter on its own is insufficient to\nform or to constitute a substance. For Leibniz, a body could never be\na candidate for substance since bodies are susceptible to alteration\nand are infinitely divisible. We can thus never arrive at a body of\nwhich it can be said, “Here really is an entity.”\nMoreover, whereas Cartesian extended substance is totally inert,\nLeibniz insisted that activity is the hallmark of substance. Anything\nthat acts is a substance; every substance constantly and\nuninterruptedly acts. For Leibniz, this position follows from\nGod’s perfection. God’s planning of the universe was so\nperfect that it only required to be set in motion by him. True\nsubstances (that is, entia per se) are active and\nself-causing. On Leibniz’s account, God would lack all dignity\nwere he the sole cause in the universe—that is, if occasionalism\nor interventionism were necessary. God’s perfect planning\navoids the necessity for (continual or continuous) extraordinary\nconcourse. Thus, God’s perfection entails that all substances\nare active; passive extension is only matter, not substance.\n\n\nThe activity, or appetition, that Leibniz regards as\ncharacterizing the monads is intimately bound up with his Principle of\nSufficient Reason. For Leibniz, a monad contains its whole history\nbecause each monadic state (except for those states—creation is\nparadigmatic of these—that are the result of divine causation)\nhas its sufficient cause in the preceding state. In turn, the present\nstate is the sufficient cause of all succeeding states. Despite this\nemphasis on the inherent activity of substance, Leibniz, like Spinoza,\nrejected the possibility of transeunt causation among substances.\nMonads are “windowless” and neither admit nor emit causal\ninfluence. Moreover, being thus windowless, monads can no more receive\nperceptions from the world than they can any other external causation.\nRather, a monad’s perceptions are built-in at creation. By\npreestablished harmony, these perceptions perfectly align with the\nuniverse’s infinite monadic states. This entails that while\nthere is no genuine transeunt causation at the monadic level, a kind\nof pseudocausation results from monads’ harmonized perceptions\nof each other as their respective appetitions convey them through\nsuccessive changes. For Leibniz, causal relations thus reduce to\nlogical relations in that every change in a substance follows from its\nconcept.\n\n\nWhile Leibniz’s view that every substance has a complete concept\nreinforces the centrality of reason in his epistemology, in doing so,\nit seems to undercut human and even divine volition, and thereby to\nslide toward Spinozism. If every fact about Julius Caesar, and indeed,\nevery other fact about the universe is rationally deducible from the\nRoman Dictator’s complete concept, then it would seem that only\none course for the universe is possible. However, this is not a step\nthat Leibniz was willing to take. Were there no distinction between\ncontingent and necessary truths, argued Leibniz, fatalism would be\ntrue, and human liberty of the will would be impossible. Leibniz\nsought to avert this result by distinguishing between hypothetical and\nabsolute necessity. Absolute necessity, he argued, is governed by the\nprinciple of contradiction. Something is absolutely necessary if its\nnegation is logically impossible. Hypothetical necessity, on the other\nhand, describes a state of affairs that is necessary ex\nhypothesi—that is, just in case a particular antecedent\nholds—but not logically necessary. On Leibniz’s account,\nthe fact that Caesar crossed the Rubicon is only hypothetically\nnecessary; it follows necessarily from the existence of the individual\nsubstance that is Caesar, but its denial is not logically\nimpossible. According to Leibniz, God at creation conceived of an\ninfinite array of possible worlds. The myriad contingent facts of each\nof these worlds are only hypothetically necessary. That is, they would\nonly be necessary if God were to instantiate that world. Since the\npresent world is the one that God chose to instantiate, all of the\ncontingent facts of this world are certain. However, they are\nnonetheless contingent since their negation implies no absurdity. That\nis, there was no logical impossibility preventing Caesar from deciding\nnot to cross the Rubicon. In this sense, his will—and, indeed,\nhuman will generally—is free.  Leibniz’s argument for\nhypothetical necessity has an obvious antecedent in Descartes’s\ndoctrine of created truth. However, unlike Descartes, Leibniz limited\nthe doctrine’s scope to contingent truths. He nonetheless hoped\nto avoid Spinozist necessitarianism. Whether or not he succeeded in\ndoing so is a matter of debate in the literature.\n\n\nInasmuch as it characterizes the universe as composed of a plurality\nof individual existences, none of which has any genuine causal\nefficacy over any other, Leibniz’s position shows considerable\naffinities with Hume’s empiricism. However, while Hume inferred\nfrom this the importance of experience, Leibniz instead took this\nontology to preclude adventitious knowledge. He thus remained\ncommitted on metaphysical grounds to the doctrine of innate ideas. In\nhis rejection of transeunt causation among substances, Leibniz\nrejected the notion that we can learn new things about the world in\nthe sense of gaining new ideas that do not already exist in our\nsouls. On Leibniz’s account, the temporal coincidence of a\ncertain phenomenon with one’s “learning” of the\nphenomenon was preestablished at creation in the same way that all\nmonadic states were. Leibniz admitted that it is idiomatically\nacceptable to speak about acquiring knowledge via the senses. However,\nhe regarded all sensory reports as reducible to, and explicable as,\ndescriptions of logical relations. Leibniz’s theory of knowledge\nthus relegates the Aristotelian idea of human beings as blank slates\nwho learn through induction to a mere façon de\nparler. By contrast, he strongly endorsed Plato’s doctrine\nof recollection to the extent that it locates all knowledge in ideas\nalready residing in the soul. Socrates’s exchange with\nMeno’s slave boy, argued Leibniz, shows that the soul already\npossesses the ideas upon which truths about the universe depend, and\nneeds only to be reminded of them.\n\n\nOn Leibniz’s account, substances have built into them\nperceptions of the whole universe. Every substance, he argued, is a\nmirror of the whole universe to the extent that everything that has\never happened or existed or will ever happen or exist are included in\nits complete concept. The perceptions of all substances, he\nmaintained, thus resemble God’s infinite perception in their\nunlimited scope. It is with respect to clarity and distinctness that\nthe perceptions of created substance fall short of God’s. For\nLeibniz, the best of all possible worlds is that world that balances\nthe maximal possible complexity with the maximal possible order. The\nexisting world satisfies this through the infinite variety of\nperspectives taken by the monads. By the principle of order, each\nmonad reflects the very same world as do the other monads. However, by\nthe principle of complexity, the monads reflect the world from an\ninfinite number of unique perspectives. This infinite variety in\nperspectives entails that each monad reflects all of the others with\nvarying degrees of clarity and distinctness. In this way, the universe\nis replete with an infinite number of different representations of\nGod’s works. Among these, only God’s perceptions are\nuniversally clear and distinct. While the complexity requirement for\nthe best of all possible worlds would seem to preclude in principle\nthe possibility of human beings achieving knowledge of the\nuniverse sub specie aeternitatis, Leibniz made a special\nexception for human souls. On Leibniz’s account, all monads have\nlow-level perceptions, of the kind that we experience when we are in a\nstupor. However, the souls of living things have, over and above this,\nfeelings and memories. Human souls have, besides this, through divine\nelection, the power of reason. It is reason that allows us to\nunderstand the universe as a system, through the use of models and\nidealizations, and thereby to grasp the eternal truths. In this way,\nargued Leibniz, human minds are not only mirrors of the universe of\ncreated things, but indeed mirror God himself.\n\n\nLeibniz is committed to the view that, given God’s perfection,\nanything God creates must also be perfect—this is why the\ncreated world is the best possible world. This means that a large part\nof his writings are theodicean in spirit. Leibniz shares this spirit\nwith his close contemporary, Anne Conway. Conway’s system is\nmotivated by her desire to reject Cartesian dualism, Spinozism, and\nHobbesian materialism. On her view, any commitment to the existence of\nmaterial substance is a commitment to the existence of “dead\nmass”. Any such view is gravely mistaken. For, she holds that\nnature is shot through with the “vital principle of\nmotion”, which has life and perception, qualities befitting any\ncreation of God (Chapter IX, section 2). Conway thus rejects\nDescartes’s dualism, while nevertheless noting that because he\naccepts the immateriality of God, he is at least better than Hobbes,\nwho holds that God is material. Finally, she registers that her\ndisagreement with Spinoza has to do with his monism, which effaces any\ndistinction between God and creatures (Chapter IX, section 3).\n\n\nTo avoid the problem that she identifies with Descartes and Hobbes,\nConway asserts a monism: all creatures are composed of one kind of\nsubstance—spiritual. To avoid the problem she associates with\nSpinoza, Conway asserts that while only one (spiritual) substance\nexists, the universe is divided into three “species” that\ndiffer in their essences: creatures, Christ, and God. This tripartite\nseparation is grounded on the basis of the changeability of the\nmember(s) of the species: the essential feature of creatures is that\nthey can change for the better and for the worse, the essential\nfeature of Christ is that he can only change for the better, and\nGod’s essence is that He is unchanging (Chapter VI, section\n4). In postulating these three “species” of the one\nsubstance, Conway is able to assert God’s separation from\ncreation, as well as a metaphysically and morally mediating role for\nChrist. This mediating role for Christ is of central importance to\nConway’s theodicy. On her view, accepting this tripartite\ndivision of species “will contribute greatly to the propagation\nof the true faith and Christian religion among Jews and Turks and\nother infidel nations” (Chapter VI, section 5). This is because\nonce we appreciate the reasoning in favor of a mediator between\ncreatures and God, and we accept this reasoning, we believe in Christ\nwhether we call the mediator by that name or not. In this way, Conway\ncan answer a particularly difficult challenge to any Christian\nthinker: how can Christianity be the universal religion, in which\nsalvation depends on knowing Christ, when so much of the Earth’s\npopulation is ignorant of Christ? On her system, she can assert that\nmany people may know Christ as mediator, without knowing him by name\nor even by role in the Christian religion.\n\n\nWhile the rise of British empiricism and of Kant’s critical\nphilosophy marked the end of continental rationalism as a movement,\nthe elegant visions of Leibniz and Conway are a fitting paean to the\nmovement and, indeed, to the power of human reason.\n6. Beyond Continental Rationalism: Other Voices\n\n\nSince the early twentieth century, “continental\nrationalism” has been profitably juxtaposed with “British\nempiricism”. The juxtaposition turns on the notion that the\nrationalist views that were popular on the “continent”\nwere contemporaneous with the empiricist views that dominated the\nphilosophical conversations in Britain.\n\n\nWhile the demarcation between rationalism and empiricism may be useful\nas an interpretive and pedagogical tool, it should be borne in mind\nthat it is a construction in retrospect. The distinction between\nEmpirici and Dogmatici is traceable from ancient\nRoman medicine to Baconian (both Roger and Francis) philosophy of\nscience. While Kant and his early commentators imported the\ndistinction into philosophy, the terminology of\n“rationalism” and “empiricism”, and the\nassociation of these terms with, respectively, the Continent and\nBritain emerged at the end of the nineteenth century (Aaron Wilson,\n16–20).\n\n\nIn recent years scholars have problematized both the general\nrationalist/empiricist distinction and the “continental\nrationalism”/“British empiricism” divide. As Norton\nhas shown, the “British” in “British\nEmpiricism” can be called into question when we take notice of\nthe important role played by the French philosopher Pierre Gassendi in\nthe propagation of empiricist thinking in the period (Norton 1981).\nIndeed, British philosophers in the relevant historical period were\nfar less disconnected from the Continent than they are\ntoday. Philosophical crossings from Britain were frequent and\nfruitful. In particular, Locke, Berkeley, and Hume all crossed the\nChannel. Further, Loeb (1981) argues with some plausibility that the\nrationalist-empiricist divide neglects strong rationalist strands in\nLocke’s and Berkeley’s thought. Increasingly, scholars of\nthe early modern period (but again, recall Goldstone’s critique\nof early modernity as a periodization) are looking outside the bounds\nof the rationalist/empiricist distinction in order to more accurately\ncapture the intersections and divergences present in the constellation\nof ideas in the period.\n\n\nIndeed, problematizing the distinction between continental rationalism\nand British empiricism offers benefits beyond the possibility for\ngreater interpretative nuance and accuracy. In earlier sections of\nthis entry, we troubled the association of rationalism with the\nContinent by considering British philosophers Margaret Cavendish and\nAnne Conway alongside Malebranche and Leibniz, and Ghanaian\nphilosopher Anton Amo alongside Descartes. A focus on seventeenth and\neighteenth century rationalists, broadly conceived, as opposed to\ncontinental rationalists in particular, makes possible the\ninclusion in the conversation of other figures—notably, women\nand non-Europeans—who did not live on the Continent but who mark\nnodes of influence and importance in rationalist thought. Thus, an\nadditional strong motivation to call the distinction into question is\nin an effort to include other voices in this period.\n\n\nBefore we consider two final rationalist women philosophers from\nBritain, a brief digression is in order on the degree to which\nrationalism permitted the philosophical participation of women (and to\na lesser extent of racialized others).\n\n\nIt is by now a familiar trope that rationalism excludes women.\nGenevieve Lloyd famously argues that Descartes’s\nreconceptualization of reason as an attainment, and as an attainment\nachieved by pure mind uncorrupted by sensuality and society,\nunintentionally (but significantly) excludes women—whose\ndomestic roles inevitably involved the sensual and the social (Lloyd\n1984/1993, 40–51). Susan Bordo characterizes Cartesian\n“objectivism and mechanism” as a “flight\nfrom the female cosmos and ‘feminine’ orientation towards\nthe world” (Bordo 1987, 100, emphasis in the original). Whether\nor not rationalism constitutively excludes women, it is clear that\nsome individual rationalists do so. See, for instance, Hasana\nSharp’s argument that Spinoza sees the better but does the worse\nin his assertion in the\nPolitical Treatise that women are naturally unequal to men\n(Sharp 2012).\n\n\nAgainst the characterization of rationalism as excluding women,\nMargaret Atherton draws on Mary Astell and Damaris Lady Masham to\nargue that in fact rationalism offered a framework in which women\n(and, one presumes, members of non-European cultures) could do\nphilosophy. By prescribing a method of reasoning that doesn’t hinge on\na particular education or social standing, argues Atherton (after\nAstell), rationalism reconceptualizes reason as in principle possible\nfor all humans—man and woman, Plow-man and Doctor (Atherton,\n32). Erica Harth traces the history of sixteenth and seventeenth\ncentury French “salon women” and offers evidence that\nDescartes’s clear, jargon-free French and commitment to being\nintelligible by lay people made Cartesianism appealing to the women\nwho regularly participated in philosophical salons. Further, Harth\nreconstructs the thought of the prominent salon women to show that\nthey extend Cartesianism in novel ways (Harth 1991). However, she\nnotes that most of what comes down to us from French Cartesianism of\nthe day originated in the male-only academy, and not the salons.\n\n\nWhatever the remaining legacy of Cartesian women in France, Astell\nremains an important interpreter and proponent of Descartes’s\nepistemological method, a method she explicitly endorses as the basis\nfor supporting the education of, and philosophical inquiry by, women.\nIn her two-part 1694 and 1697 A Serious Proposal to the Ladies:\nWherein a Method is offer’d for the Improvement of their\nMinds, Astell urges that meditation (in Descartes’s sense\nof that term) avails itself to all who apply themselves to it with\ndedication. She admits that those (women or labourers, for instance)\nwhose circumstances do not permit them to contemplate truth may at\nfirst find such contemplation unfruitful. However, she proposes\nreading, discoursing, and serious meditation as remedies to this\nsituation. While Astell rejects the view that some people’s\nembodiment make them more suited for practical than intellectual\npursuits, she acknowledges that some reasoners’ animal spirits\nmay incline them to volatility of thought; she therefore counsels\nreasoners to withdraw their minds from their bodies and the material\nworld. Alice Sowaal identifies in Astell three central rationalist\nthemes: “an emphasis of the mind over the body; a theory of\ninnate ideas as the origin of knowledge; and a methodology that leads\nthe novice from confusion to clarity” (Sowaal). Astell bolsters\nher Cartesian method with a theological argument that God would not\ncreate naturally defective rational beings, and hence that all human\nbeings are capable of rational thought. If women are at first unable\nto reason well, it is the result of their circumstances and not their\nnature, she argues. Astell thus both draws on Descartes and\nanticipates Wollstonecraft.\n\n\nRelaxing the criteria for inclusion in the “rationalist”\ncamp also invites us to appropriately situate the rationalism of\nScottish philosopher Mary Shepherd. Shepherd was a sharp critic of\nHume’s endorsement of the causal system we might call\n“Malebranche without God”. Shepherd raised her objections\nto Hume’s theory on the basis of her commitment to the\nsuperiority of reason for knowledge, and in particular knowledge of\nthe truths of causation. Here we see that she shares at least one\ncharacteristic of those typically ascribed to rationalists, the\nexaltation of reason over the senses in knowledge acquisition. In\nAn Essay Upon the Relation of Cause and Effect (1824),\nShepherd seeks to dismantle Hume’s causal theory of constant\nconjunction by arguing that we can indeed have intuitive knowledge\nthat everything that exists requires a cause. Moreover, on her view,\nit is reason, not “custom” or “habit”, that is\nour chief guide in the understanding of our daily lives (27–28).\nShepherd’s critique of Hume is important in its own right as a\nvaluable contribution to the philosophical conversation of her age. It\nis also, however, representative of the way that the rationalist\nperspective was being articulated in the first quarter of the 19th\ncentury. As such, it marks a moment in the history of rationalism.\nPutting Shepherd into conversation with her fellow rationalists across\ntime only serves to deepen and broaden our understanding of this line\nof thinking.\n\n\nIn sum then, while the notion of continental rationalism can be a\nuseful heuristic, especially for teaching and learning, it ought not\nto be a strict criterion. A less restrictive conception of rationalism\nnot only supports a more historically accurate, nuanced understanding\nof philosophical movements in the period; it also renders the\nrationalist canon more diverse. As historians of philosophy\nincreasingly work to develop more inclusive canons, such a\nreconceptualization is all to the good.\n", "bibliography": {"categories": ["Primary Sources", "Secondary Sources"], "cat_ref_text": {"Primary Sources": ["</h3>\n<h4>Amo</h4>\n<ul class=\"hanging\">", "<em>The Apatheia of the Human Mind</em>, <em>or The Absence of\nSensation and the Faculty of Sense in the Human Mind and Their Presence\nin our Organic and Living Body</em>, William Abraham (trans.), in\n<em>Antonius Gviliemus Amo, Afer of Axim, Translation of his\nWorks</em>, Halle: Martin Luther University, Halle-Wittenberg,\n1968.\n</ul>\n<h4>Astell</h4>\n<ul class=\"hanging\">", "<em>Astell: Political Writings</em>, P. Springborg (ed.), Cambridge:\nCambridge University Press, 1996.", "<em>A Serious Proposal to the Ladies. Parts I and II</em>, P.\nSpringborg (ed.), Ontario: Broadview Literary Texts, 2002.", "<em>The Christian Religion, As Professed by a Daughter of the Church\nof England</em>, J. Broad (ed.), Toronto, ON: Centre for Reformation\nand Renaissance Studies and Iter Publishing, 2013.\n</ul>\n<h4>Cavendish</h4>\n<ul class=\"hanging\">", "<em>Observations upon Experimental Philosophy</em>, Eileen\nO’Neill (ed.). Cambridge: Cambridge University Press, 2001.\n</ul>\n<h4>Conway</h4>\n<ul class=\"hanging\">", "<em>Principles of the Most Ancient and Modern Philosophy</em>, Allison\nP. Coudert and Taylor Corse (eds.). Cambridge: Cambridge University\nPress, 1996.\n</ul>\n<h4>Descartes</h4>\n<ul class=\"hanging\">", "<em>Oeuvres De Descartes</em>, 11 vols., C. Adam and P. Tannery, Eds.,\nParis: Librairie Philosophique J. Vrin, 1983.", "<em>The Philosophical Writings of Descartes</em>, 3 vols., J.\nCottingham, R. Stoothoff, and D. Murdoch, Trans. Vol. 3 including A.\nKenny, Trans., Cambridge: Cambridge University Press, 1984–88.", "<em>The Correspondence Between Princess Elisabeth of Bohemia and\nRené Descartes</em>, Lisa Shapiro (ed. and trans.), Chicago:\nUniversity of Chicago Press, 2007.\n</ul>\n<h4>Malebranche</h4>\n<ul class=\"hanging\">", "<em>Œuvres complètes de Malebranche</em>, 20 vols.,\nA. Robinet (ed.), Paris: J. Vrin, 1958–84.", "<em>Dialogues on Metaphysics</em>, W. Doney, Trans., New York: Abaris\nBooks, 1980.", "<em>Dialogue between a Christian Philosopher and a Chinese Philosopher\non the Existence and Nature of God</em>, D. A. Iorio (trans.),\nWashington: Catholic University Press, 1980.", "<em>Treatise on Ethics</em>, C. Walton (trans.), Dordrecht: Kluwer,\n1993.", "<em>Dialogues on Metaphysics and on Religion</em>, N. Jolley and D.\nScott (trans.), Cambridge: Cambridge University Press, 1997.", "<em>The Search after Truth</em>, T. M. Lennon and P. J. Olscamp\n(trans.), Cambridge: Cambridge University Press, 1997.\n</ul>\n<h4>Spinoza</h4>\n<ul class=\"hanging\">", "<em>Spinoza Opera</em>, 5 volumes. C. Gebhardt (Ed.), Heidelberg:\nCarl Winter, 1925–87.", "<em>The Collected Writings of Spinoza</em>, E. Curley (trans. and ed.),\nPrinceton: Princeton University Press, 1985. <em>Complete Works</em>,\nS. Shirley (trans.), M. Morgan (ed.), Indianapolis: Hackett, 2002.\n</ul>\n<h4>Leibniz</h4>\n<ul class=\"hanging\">", "<em>Gottfried Wilhelm Leibniz: Sämtliche Schriften und\nBriefe</em>, German Academy of Science, Darmstadt and Berlin: Berlin\nAcademy, 1923–.", "<em>Philosophical Essays</em>, R. Ariew and D. Garber (eds. and\ntrans.), Indianapolis: Hackett, 1989.", "<em>Opuscules et Fragments In</em><em>é</em><em>dits de\nLeibniz</em>, L. Couturat (ed.), Paris: Felix Alcan, 1903.", "<em>Leibnizens Mathematische Schriften</em>, C. I. Gerhardt (ed.),\nBerlin: Weidman, 1875–90.", "<em>Die Philosophischen Schriften von Gottfried Wilhelm Leibniz</em>,\nC.I. Gerhardt (ed.), Berlin: Weidman, 1875–90. <em>Theodicy</em>,\nA. Farrer (ed.) and E. Huggard (trans.), New Haven: Yale University\nPress, 1952.", "<em>Philosophical Papers and Letters</em>, L. Loemker (ed.), 2nd\ned., Dordrecht: Reidel, 1969. <em>Philosophical Writings</em>, M.\nMorris and G. Parkinson (eds. and trans.), London: Dent, 1973.", "<em>New Essays on Human Understanding</em>, P. Remnant and J.\nBennett (ed. and trans.), Cambridge: Cambridge University Press,\n1982.", "<em>Leibniz: Selections</em>, P. Wiener (Ed.), New York: Charles\nScribner’s Sons, 1951.\n</ul>\n<h3 id=\"SecoSour\">"], "Secondary Sources": ["</h3>\n<ul class=\"hanging\">", "Abraham, William, 1964, “The Life and Times of Anton Wilhelm\nAmo”, <em>Transactions of the Historical Society of Ghana</em>,\n7: 60–81. [A biography of Amo.]", "Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, Oxford: Oxford University Press. [A careful and\npenetrating study that benefits from the author’s extensive of\nknowledge of Leibniz’s <em>oeuvre</em>.]", "Allison, Henry, 1987, <em>Benedict de Spinoza: An Introduction</em>,\nNew Haven: Yale University Press. [A classic work by an eminent\nSpinoza scholar. Suitable for beginners, but also useful for those\nwell-versed in Spinoza.]", "Atherton, Margaret, 1993, “Cartesian Reason and Gendered\nReason”, <em>A Mind of One’s Own: Feminist Essays on Reason\nand Objectivity</em>, Eds. Louise Antony and Charlotte Witt, Boulder:\nWestview Press. [Against arguments that Descartes’s conception of\nrationality served to exclude women, Atherton here adduces evidence\nthat some early modern women philosophers regarded Cartesian reason as\negalitarian, and were encouraged by it in their work.]", "–––, 1996, “Lady Mary Shepherd’s Case\nAgainst George Berkeley”, <em>British Journal for the History of\nPhilosophy</em>, 4(2): 347–366. [An analysis of Shepherd’s\nobjections to Hume, and the manner in which she distinguishes her view\nfrom Berkeley’s.]", "–––, 2005, “Reading Lady Mary\nShepherd”, <em>The Harvard Review of Philosophy</em>,\n13(2):73–85. [An introduction to both Shepherd’s biography\nand her philosophical disputes with Dugald Stewart and John\nFearn.]", "Bennett, Jonathan, 1984, <em>A Study of Spinoza’s Ethics</em>,\nIndianapolis: Hackett Publishing. [A clear, penetrating study of\nSpinoza whose arguments and analogies have entered the scholarly idiom.\nEssential reading for Spinozists.]", "Bermúdez, José Luis, 1997, “Scepticism and Science\nin Descartes”, <em>Philosophy and Phenomenological\nResearch</em>, 57(4): 743–772. [An argument for separating the\nimportance of scepticism for motivating Descartes’s project and\nour interpretation of him as a canonical rationalist.]", "Bolton, Martha Brandt, 201, “Causality and Causal Induction:\nThe Necessitarian Theory of Lady Mary Shepherd”, in <em>Causation\nand Modern Philosophy</em>, Keith Allen and Tom Stoneham (eds.),\n242–261. New York/Routledge. [A detailed look at Shepherd’s views\nof cause, causal principles, and mathematical induction. The latter\ntopic includes some discussion of Shepherd’s dispute with Dugald\nStewart.]", "Bordo, Susan, 1987, <em>The Flight to Objectivity: Essays on\nCartesianism and Cultu</em>re, Albany: State University of New York\nPress. [A classic feminist psychoanalytic study of Descartes’s\n<em>Meditations</em>. <em>Inter alia</em>, Bordo argues that Descartes\nreconceives rationality as paradigmatically masculine.]", "Boyle, Deborah, 2009, <em>Descartes on Innate Ideas</em>, London:\nContinuum. [A comprehensive study of Descartes’s nativism. Boyle argues\nthat, for Descartes, we have implicit knowledge of our innate ideas,\nand that reflection is required to make the knowledge explicit. The\nvolume includes a thorough survey and critique of the secondary\nliterature on innate ideas in Descartes.]", "Bryson, Cynthia B, 1998, “Mary Astell: Defender of the\n‘Disembodied Mind’”, <em>Hypatia</em>, 13(4):\n40–62. [An argument in favor of Astell being the first English,\nwoman feminist. Bryson argues that Astell’s version of\nCartesian dualism allows her to reject the subordination of women, and\nher rejection of the possibility of “thinking matter”\nallows her to reject the kinds of social contracts between men and\nwomen that Locke endorsed in his political system.]", "Carriero, John, 1995, “On the Relationship Between Mode and\nSubstance in Spinoza’s Metaphysics”, <em>Journal of the\nHistory of Philosophy</em>, 33(2): 245–73. [Carriero traces the\nmedieval Aristotelian influence of Spinoza’s substance/mode\ndistinction, and in so doing challenges Curley’s argument that\nSpinozist modal dependence is causal dependence.]", "Cottingham, John, 1984, <em>Rationalism</em>, London: Paladin Books.\n[A concise, accessible survey of issues in both early modern and\ncontemporary rationalism.]", "Curley, Edwin, 1988, <em>Behind the Geometric Method</em>,\nPrinceton: Princeton University Press. [A brief, persuasive argument\nfor a naturalistic understanding of Spinoza’s <em>Ethics</em> by a\nleader in the field.]", "Della Rocca, Michael, 1996, <em>Representation and the Mind-Body\nProblem in Spinoza</em>, Oxford: Oxford University Press. [The\nauthoritative work on Spinoza’s theory of ideas.]", "–––, 2005, “Descartes, the Cartesian Circle,\nand Epistemology without God”, <em>Philosophy and\nPhenomenological Research</em>, 70(1): 1–33. [An interpretation\nof Descartes’s system that would allow him to escape the circle\nobjection.]", "–––, 2008, <em>Spinoza</em>, London and New York:\nRoutledge. [An accessible introduction to Spinoza’s main\ndoctrines, with a useful sketch of the historical context.]", "Detlefsen, Karen, 2006, “Atomism, Monism, and Causation in the\nNatural Philosophy of Margaret Cavendish”, <em>Oxford Studies in\nEarly Modern Philosophy</em>, 3: 199–240. [A discussion of the tension\nbetween Cavendish’s monism and her anti-atomism.]", "Donagan, Alan, 1988, <em>Spinoza</em>, Chicago: University of\nChicago Press. [A spare, compulsively readable interpretation of\nSpinoza’s mature work as a whole, with an emphasis on his\nnaturalism.]", "Fantl, Jeremy, 2016, “Mary Shepherd on Causal\nNecessity”, <em>Metaphysica</em>, 17(1): 87–108. [An\nargument that Shepherd’s anti-Humeanism is actually stronger\nthan has been heretofore appreciated.]", "Fraenkel, Carlos, Dario Perinetti, and Justin Smith, Eds, 2010,\n<em>The Rationalists: Between Tradition and Innovation</em>, Dordrecht:\nSpringer. [Essays on varied topics by key thinkers in the field, all of\nthem devoted to understanding and problematizing the category of\nrationalism by considering aspects of key rationalist figures in their\nhistorical contexts.]", "Frankfurt, Harry, 1965, “Descartes’ Validation of\nReason”, <em>American Philosophical Quarterly</em>, 2:\n149–56. [A seminal work dealing with the alleged circularity of\nDescartes’s <em>Meditations</em>.]", "Garber, Daniel and Michael Ayers, Eds., 1998, <em>The Cambridge\nHistory of Seventeenth</em> <em>Century Philosophy</em>, 2 vols.,\nCambridge: Cambridge University Press. [This collection provides a\ncomprehensive look at the relevant philosophical period, with\ninvaluable material about the historical and social context.]", "Garrett, Don, Ed., 1996, <em>The Cambridge Companion to\nSpinoza</em>, Cambridge and New York: Cambridge University Press.\n[Essays on all aspects of Spinoza’s thought by top Spinoza\nscholars.]", "Goldstone, Jack, 1998, “The Problem of the ‘Early\nModern’ World”, <em>Journal of the Economic and Social\nHistory of the Orient</em>, 41(3): 249–284. [An influential\nproblematization of the “early modern” periodization that\nin particular identifies the eurocentrism and the myth of progress on\nwhich the periodization trades. Goldstone also explores\ninconsistencies between the manner in which the boundaries of the\nearly modern era are drawn and usual conventions in historical\nperiodization.]", "Guéroult, Martial, 1968, <em>Spinoza I: Dieu</em>, Paris: Georg\nOlms. [Guéroult is credited with having dealt Wolfson’s\nsubjectivist account of Spinoza’s attributes its death\nblow.]", "Hagengruber, Ruth, 2015, “Cutting Through the Veil of\nIgnorance: Rewriting the History of Philosophy”, <em>The\nMonist</em>, 98: 34–42. [An argument in favor of taking the\nphilosophical writings of women through the history of philosophy as\ncontributions of general relevance to this history.]", "Harth, Erica, 1991, “Cartesian Women”, <em>Yale French\nStudies</em> 80: 146–164. [A useful study of the thought of French\nCartesian women, especially those who were prominent in the\nphilosophical salons of the seventeenth century.]", "Huenemann, Charles, 2008, <em>Understanding Rationalism</em>,\nDurham, UK: Acumen. [A clear and helpful introduction to Descartes,\nSpinoza and Leibniz, written for college juniors.]", "Ishiguro, Hidé, 1972, <em>Leibniz’s Philosophy of Logic and\nLanguage</em>, Ithaca, New York: Cornell University Press. [A clear,\nuntechnical discussion of Leibniz’s arguments considered in light of\ncontemporary angloamerican logic.]", "Jolley, Nicholas (editor), 1995, <em>The Cambridge Companion to\nLeibniz</em>, Cambridge: Cambridge University Press. [Essays on all\naspects of Leibniz’s thought by top Leibniz scholars.]", "Kenny, Anthony, 1998, “Descartes on the Will”, in John\nCottingham (ed.), <em>Descartes</em>, Oxford: Oxford University Press,\npages 132–60. First appeared in R.J. Butler (ed.),\n1973, <em>Cartesian Studies</em>, New York: Barnes and\nNoble. [Articulation of the “freedom of perversity”\ninterpretation of Descartes’s discussions with Mesland on\nfreedom.]", "Kenny, Anthony (editor), 1986, <em>Rationalism, Empiricism and\nIdealism</em>, Oxford: Oxford University Press. [A useful collection,\nmostly of lectures delivered at the British Academy by leading\nscholars of early modern philosophy.]", "Krause, Andrej, 2009, “Amo’s\nOntology”, <em>Philosophia Africana</em>, 12(2):\n141–157. [A discussion of Amo’s general ontology and how\nit informs his commitment to the insensitivity of the human\nsoul.]", "Lascano, Marcy, 2013, “Anne Conway: Bodies in the Spiritual\nWorld”, <em>Philosophy Compass</em>, 8(4): 327–336. [A\ndefense of Conway’s articulation of her monism, with an emphasis\non the important role for “body” in a system where the\nonly substance is spirit.]", "Lennon, Thomas M., 1993, <em>The Battle of the Gods and Giants: The\nLegacies of Descartes and Gassendi, 1655–1715</em>, Princeton:\nPrinceton University Press. [An account of the contest between the\nCartesians and their principal opponents as an extension of the battle\nthat Plato depicts in the <em>Sophist</em> between the materialists\nand the friends of the forms.]", "Lewis, Geneviève (Rodis), 1950,\n<em>L’individualité selon Descartes</em>, Paris:\nJ.Vrin. [Discusses all the texts on both sides of the question of the\nuniqueness of extended substance.]", "Lin, Martin, 2011, “Rationalism and Necessitarianism”,\n<em>Noûs</em>, 46(3): 418–448. [A discussion of\nSpinoza’s and Leibniz’s disagreement over whether\nmetaphysical rationalism leads to necessitarianism.]", "Lloyd, Genevieve, 1993, <em>The Man of Reason: “Male”\nand “Female” in Western Philosophy</em>, 2nd Ed., London:\nRoutledge [This influential feminist study traces the construction of\nreason as masculine in the history of Western philosophy. Lloyd sees\nDescartes’s method as a crucial move in the historical\nphilosophical centering of masculine thought.]", "Loeb, Louis, 1981, <em>From Descartes to Hume: Continental\nMetaphysics and the Development of Modern Philosophy</em>, Ithaca and\nLondon: Cornell University Press. [Loeb famously challenges the\nrationalist-empiricist divide, arguing that important aspects of\nLocke’s and Berkeley’s thought are rationalist in\ncharacter.]", "Mates, Benson, 1986, <em>The Philosophy of Leibniz: Metaphysics\n&amp; Language</em>, Oxford: Oxford University Press. [An internalist\nreading of Leibniz focusing in particular on logical issues and on\nLeibniz’s nominalism.]", "McCracken, Charles J., 1983, <em>Malebranche and British\nPhilosophy</em>, Oxford: Clarendon Press. [A classic account of\nMalebranche’s influence on British philosophy, which also contains a\nwonderful 100 page account of Malebranche’s system.]", "Melamed, Yitzhak, 2013, “Spinoza’s Metaphysics of Thought:\nParallelisms and the Multifaceted Structure of Ideas”,\n<em>Philosophy and Phenomenological Research</em>, 86(3):\n636–683. [A reinterpretation of Spinozist parallelism that seeks\nto resolve why human beings can only know two of substance’s\ninfinite attributes.]", "Merchant, Carolyn, 1979, “The Vitalism of Anne Conway: Its\nImpact on Leibniz’s Concept of the Monad”, <em>Journal of\nthe History of Philosophy</em>, 17(3): 255–269. [A discussion of\nConway’s system, and her influence on Leibniz.]", "Moreau, Joseph, 1947, “Malebranche et le spinozisme”, in\nJoseph Moreau (ed.), <em>Malebranche: Correspondance avec\nJ.-J. Dortous de Mairan</em>, Paris: Vrin, pages 1–99. [Moreau\nprovides an excellent introduction to and analysis of this\ncorrespondence in his introduction to this edition of the\ncorrespondence.]", "Nadler, Steven., Ed., 1993, <em>Causation in Early Modern\nPhilosophy: Cartesianism, Occasionalism, and Preestablished\nHarmony</em>, University Park: Pennsylvania State University Press. [A\ncollection of essays concerning the three main rationalist theories of\ncausation. The essays in this collection consider not only the major\nfigures discussed in the above article, but also a number of\nintermediate and minor figures.]", "Nelson, Alan, Ed., 2005, <em>A Companion to Rationalism</em>,\nOxford, Blackwell. [An ably edited collection of essays devoted to the\nhistorical antecedents of rationalism, to the movement’s “golden\nage” and to rationalist elements in contemporary thought.]", "Norton, David Fate, 1981, “The Myth of British\nEmpiricism”, <em>History of European Ideas</em>, 1(4):\n331–344. [An argument problematizing the very category of\n“British Empiricism.”]", "Okruhlik, Kathleen and James R. Brown, Eds., 1985, <em>The Natural\nPhilosophy of Leibniz</em>, Dordrecht: D. Reidel. [A challenging\ncollection devoted to the role of physics and natural philosophy in the\ndevelopment of Leibniz’s thought.]", "Perry, Ruth, 1986, <em>The Celebrated Mary Astell: An Early English\nFeminist,</em> Chicago, University of Chicago Press. [An influential\nintellectual biography of Astell.]", "Peterman, Alison, 2015, “Spinoza on Extension”,\n<em>Philosophers’ Imprint</em>, 15(14): 1–23. [An argument\nagainst the interpretation that Spinoza takes extension in space to be\na fundamental property of physical things.]", "Rozemond, Marleen, 1998, <em>Descartes’s Dualism</em>, Cambridge:\nHarvard University Press. [A thorough account of the topic indicated,\nincluding valuable scholastic background.]", "Russell, Bertrand, 1992, <em>A Critical Exposition of the Philosophy\nof Leibniz</em>, London: Routledge. [First published in 1900, this work\nincludes Russell’s classic arguments that the basis of Leibniz’s\nthought lies in his Aristotelian logic, and that, for Leibniz,\nrelational properties are merely ideal.]", "Schmaltz, Tad, 2002, <em>Radical Cartesianism: The French reception of\nDescartes</em>, Cambridge: Cambridge University Press. [A treatment of\nthose few—specifically, Desgabets and Régis—who\naccepted Descartes’s doctrine of created truth.]", "Shapiro, Lisa, 2007, “Volume Editor’s Introduction”,\nin Lisa Shapiro (ed. &amp; trans.), <em>The Correspondence Between\nPrincess Elisabeth of Bohemia and René Descartes</em>, Chicago:\nUniversity of Chicago Press. [The definitive analysis of this\ncorrespondence.]", "–––, 2008, “Princess Elisabeth and Descartes:\nThe Union of Soul and Body and the Practice of\nPhilosophy”, <em>British Journal for the History of\nPhilosophy</em>, 7(3): 503–520. [An argument in favor of viewing\nElisabeth as a philosopher in her own right, and not merely a\ncorrespondent of Descartes.]", "Sharp, Hasana, 2012, “Eve’s Perfection: Spinoza on Sexual\n(In)Equality”, <em>Journal of the History of Philosophy</em>\n50(4): 559–580. [A study of inconsistencies in Spinoza’s\naccount of women’s capacities.]", "Smith, Justin, 2015, <em>Nature, Human Nature, &amp; Human Difference:\nRace in Early Modern Philosophy</em>, Princeton: Princeton University\nPress. [A useful study of the construction of race in early modernity\nand its interactions with the philosophical thought of the day.]", "Sowaal, Alice, 2004, “Cartesian Bodies”, <em>Canadian\nJournal of Philosophy</em>, 34(2): 217–40. [This useful article\nsorts Descartes’s inconsistent language about substance in terms\nof levels.]", "–––, 2007, “Mary Astell’s Serious\nProposal: Mind, Method, and Custom”, <em>Philosophy\nCompass</em>, 2(2): 227–243. [A discussion of Astell’s\ntheory of mind.]", "–––, 2015, “Mary Astell”, The Stanford\nEncyclopedia of Philosophy (Winter 2015 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2015/entries/astell/\">https://plato.stanford.edu/archives/win2015/entries/astell/</a>&gt;.", "Sutherland, Christine Mason, 2005, <em>The Eloquence of Mary\nAstell</em>, Calgary: University of Calgary Press. [A recent study of\nAstell’s importance as a rhetorician.]", "Tollefsen, Deborah, 1999, “Princess Elisabeth and the Problem of\nMind-Body Interaction”, <em>Hypatia</em>, 14(3): 59–77. [A\ndiscussion of Elisabeth’s objections to Descartes’s\ndualism.]", "Wilson, Aaron, 2016, Peirce’s Empiricism: Its Roots and Its\nOriginality, Lanham: Lexington Books. [This study of American\nPragmatist Charles Sanders Peirce contains a useful chapter on the\nhistory of the rationalism-empiricism distinction.]", "Wilson, Margaret Dauler, 1982, <em>Descartes</em>, New York:\nRoutledge. [See Chapter Three for a clear and useful discussion of\nDescartes’s doctrine of created truths.]", "Wiredu, Kwasi, 2004, “Amo’s Critique of Descartes’\nPhilosophy of Mind”, in Kwasi Wiredu (ed.), <em>A Companion to\nAfrican Philosophy</em>, Malden, Massachusetts: Blackwell Publishing,\nLtd., pages 200–206. [Introduction to Amo’s biography, and\nmain lines of his critique against Descartes’s theory of\nmind.]", "Wolfson, Harry, 1934, <em>The Philosophy of Spinoza</em>, 2 vols.,\nCambridge, MA: Harvard University Press. [Wolfson’s is still the\nclassic argument for the subjectivist account of attributes in\nSpinoza.]", "Woolhouse, R.S., 1993, <em>Descartes, Spinoza, Leibniz: The Concept of\nSubstance in Seventeenth Century Metaphysics</em>, London and New\nYork: Routledge. [A deep account of many of the themes covered here,\nwith something of value for readers at all levels.]\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<h4>Amo</h4>\n<ul class=\"hanging\">\n<li><em>The Apatheia of the Human Mind</em>, <em>or The Absence of\nSensation and the Faculty of Sense in the Human Mind and Their Presence\nin our Organic and Living Body</em>, William Abraham (trans.), in\n<em>Antonius Gviliemus Amo, Afer of Axim, Translation of his\nWorks</em>, Halle: Martin Luther University, Halle-Wittenberg,\n1968.</li>\n</ul>\n<h4>Astell</h4>\n<ul class=\"hanging\">\n<li><em>Astell: Political Writings</em>, P. Springborg (ed.), Cambridge:\nCambridge University Press, 1996.</li>\n<li><em>A Serious Proposal to the Ladies. Parts I and II</em>, P.\nSpringborg (ed.), Ontario: Broadview Literary Texts, 2002.</li>\n<li><em>The Christian Religion, As Professed by a Daughter of the Church\nof England</em>, J. Broad (ed.), Toronto, ON: Centre for Reformation\nand Renaissance Studies and Iter Publishing, 2013.</li>\n</ul>\n<h4>Cavendish</h4>\n<ul class=\"hanging\">\n<li><em>Observations upon Experimental Philosophy</em>, Eileen\nO’Neill (ed.). Cambridge: Cambridge University Press, 2001.</li>\n</ul>\n<h4>Conway</h4>\n<ul class=\"hanging\">\n<li><em>Principles of the Most Ancient and Modern Philosophy</em>, Allison\nP. Coudert and Taylor Corse (eds.). Cambridge: Cambridge University\nPress, 1996.</li>\n</ul>\n<h4>Descartes</h4>\n<ul class=\"hanging\">\n<li><em>Oeuvres De Descartes</em>, 11 vols., C. Adam and P. Tannery, Eds.,\nParis: Librairie Philosophique J. Vrin, 1983.</li>\n<li><em>The Philosophical Writings of Descartes</em>, 3 vols., J.\nCottingham, R. Stoothoff, and D. Murdoch, Trans. Vol. 3 including A.\nKenny, Trans., Cambridge: Cambridge University Press, 1984–88.\n</li>\n<li><em>The Correspondence Between Princess Elisabeth of Bohemia and\nRené Descartes</em>, Lisa Shapiro (ed. and trans.), Chicago:\nUniversity of Chicago Press, 2007.</li>\n</ul>\n<h4>Malebranche</h4>\n<ul class=\"hanging\">\n<li><em>Œuvres complètes de Malebranche</em>, 20 vols.,\nA. Robinet (ed.), Paris: J. Vrin, 1958–84.\n</li>\n<li><em>Dialogues on Metaphysics</em>, W. Doney, Trans., New York: Abaris\nBooks, 1980.\n</li>\n<li><em>Dialogue between a Christian Philosopher and a Chinese Philosopher\non the Existence and Nature of God</em>, D. A. Iorio (trans.),\nWashington: Catholic University Press, 1980.\n</li>\n<li><em>Treatise on Ethics</em>, C. Walton (trans.), Dordrecht: Kluwer,\n1993.\n</li>\n<li><em>Dialogues on Metaphysics and on Religion</em>, N. Jolley and D.\nScott (trans.), Cambridge: Cambridge University Press, 1997.\n</li>\n<li><em>The Search after Truth</em>, T. M. Lennon and P. J. Olscamp\n(trans.), Cambridge: Cambridge University Press, 1997.</li>\n</ul>\n<h4>Spinoza</h4>\n<ul class=\"hanging\">\n<li><em>Spinoza Opera</em>, 5 volumes. C. Gebhardt (Ed.), Heidelberg:\nCarl Winter, 1925–87.\n</li>\n<li><em>The Collected Writings of Spinoza</em>, E. Curley (trans. and ed.),\nPrinceton: Princeton University Press, 1985. <em>Complete Works</em>,\nS. Shirley (trans.), M. Morgan (ed.), Indianapolis: Hackett, 2002.</li>\n</ul>\n<h4>Leibniz</h4>\n<ul class=\"hanging\">\n<li><em>Gottfried Wilhelm Leibniz: Sämtliche Schriften und\nBriefe</em>, German Academy of Science, Darmstadt and Berlin: Berlin\nAcademy, 1923–.</li>\n<li><em>Philosophical Essays</em>, R. Ariew and D. Garber (eds. and\ntrans.), Indianapolis: Hackett, 1989.\n</li>\n<li><em>Opuscules et Fragments In</em><em>é</em><em>dits de\nLeibniz</em>, L. Couturat (ed.), Paris: Felix Alcan, 1903.\n</li>\n<li><em>Leibnizens Mathematische Schriften</em>, C. I. Gerhardt (ed.),\nBerlin: Weidman, 1875–90.\n</li>\n<li><em>Die Philosophischen Schriften von Gottfried Wilhelm Leibniz</em>,\nC.I. Gerhardt (ed.), Berlin: Weidman, 1875–90. <em>Theodicy</em>,\nA. Farrer (ed.) and E. Huggard (trans.), New Haven: Yale University\nPress, 1952.</li>\n<li><em>Philosophical Papers and Letters</em>, L. Loemker (ed.), 2nd\ned., Dordrecht: Reidel, 1969. <em>Philosophical Writings</em>, M.\nMorris and G. Parkinson (eds. and trans.), London: Dent, 1973.</li>\n<li><em>New Essays on Human Understanding</em>, P. Remnant and J.\nBennett (ed. and trans.), Cambridge: Cambridge University Press,\n1982.</li>\n<li><em>Leibniz: Selections</em>, P. Wiener (Ed.), New York: Charles\nScribner’s Sons, 1951.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Abraham, William, 1964, “The Life and Times of Anton Wilhelm\nAmo”, <em>Transactions of the Historical Society of Ghana</em>,\n7: 60–81. [A biography of Amo.]</li>\n<li>Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, Oxford: Oxford University Press. [A careful and\npenetrating study that benefits from the author’s extensive of\nknowledge of Leibniz’s <em>oeuvre</em>.]</li>\n<li>Allison, Henry, 1987, <em>Benedict de Spinoza: An Introduction</em>,\nNew Haven: Yale University Press. [A classic work by an eminent\nSpinoza scholar. Suitable for beginners, but also useful for those\nwell-versed in Spinoza.]</li>\n<li>Atherton, Margaret, 1993, “Cartesian Reason and Gendered\nReason”, <em>A Mind of One’s Own: Feminist Essays on Reason\nand Objectivity</em>, Eds. Louise Antony and Charlotte Witt, Boulder:\nWestview Press. [Against arguments that Descartes’s conception of\nrationality served to exclude women, Atherton here adduces evidence\nthat some early modern women philosophers regarded Cartesian reason as\negalitarian, and were encouraged by it in their work.]</li>\n<li>–––, 1996, “Lady Mary Shepherd’s Case\nAgainst George Berkeley”, <em>British Journal for the History of\nPhilosophy</em>, 4(2): 347–366. [An analysis of Shepherd’s\nobjections to Hume, and the manner in which she distinguishes her view\nfrom Berkeley’s.]</li>\n<li>–––, 2005, “Reading Lady Mary\nShepherd”, <em>The Harvard Review of Philosophy</em>,\n13(2):73–85. [An introduction to both Shepherd’s biography\nand her philosophical disputes with Dugald Stewart and John\nFearn.]</li>\n<li>Bennett, Jonathan, 1984, <em>A Study of Spinoza’s Ethics</em>,\nIndianapolis: Hackett Publishing. [A clear, penetrating study of\nSpinoza whose arguments and analogies have entered the scholarly idiom.\nEssential reading for Spinozists.]</li>\n<li>Bermúdez, José Luis, 1997, “Scepticism and Science\nin Descartes”, <em>Philosophy and Phenomenological\nResearch</em>, 57(4): 743–772. [An argument for separating the\nimportance of scepticism for motivating Descartes’s project and\nour interpretation of him as a canonical rationalist.]</li>\n<li>Bolton, Martha Brandt, 201, “Causality and Causal Induction:\nThe Necessitarian Theory of Lady Mary Shepherd”, in <em>Causation\nand Modern Philosophy</em>, Keith Allen and Tom Stoneham (eds.),\n242–261. New York/Routledge. [A detailed look at Shepherd’s views\nof cause, causal principles, and mathematical induction. The latter\ntopic includes some discussion of Shepherd’s dispute with Dugald\nStewart.]</li>\n<li>Bordo, Susan, 1987, <em>The Flight to Objectivity: Essays on\nCartesianism and Cultu</em>re, Albany: State University of New York\nPress. [A classic feminist psychoanalytic study of Descartes’s\n<em>Meditations</em>. <em>Inter alia</em>, Bordo argues that Descartes\nreconceives rationality as paradigmatically masculine.]</li>\n<li>Boyle, Deborah, 2009, <em>Descartes on Innate Ideas</em>, London:\nContinuum. [A comprehensive study of Descartes’s nativism. Boyle argues\nthat, for Descartes, we have implicit knowledge of our innate ideas,\nand that reflection is required to make the knowledge explicit. The\nvolume includes a thorough survey and critique of the secondary\nliterature on innate ideas in Descartes.]</li>\n<li>Bryson, Cynthia B, 1998, “Mary Astell: Defender of the\n‘Disembodied Mind’”, <em>Hypatia</em>, 13(4):\n40–62. [An argument in favor of Astell being the first English,\nwoman feminist.  Bryson argues that Astell’s version of\nCartesian dualism allows her to reject the subordination of women, and\nher rejection of the possibility of “thinking matter”\nallows her to reject the kinds of social contracts between men and\nwomen that Locke endorsed in his political system.]</li>\n<li>Carriero, John, 1995, “On the Relationship Between Mode and\nSubstance in Spinoza’s Metaphysics”, <em>Journal of the\nHistory of Philosophy</em>, 33(2): 245–73. [Carriero traces the\nmedieval Aristotelian influence of Spinoza’s substance/mode\ndistinction, and in so doing challenges Curley’s argument that\nSpinozist modal dependence is causal dependence.]</li>\n<li>Cottingham, John, 1984, <em>Rationalism</em>, London: Paladin Books.\n[A concise, accessible survey of issues in both early modern and\ncontemporary rationalism.]</li>\n<li>Curley, Edwin, 1988, <em>Behind the Geometric Method</em>,\nPrinceton: Princeton University Press. [A brief, persuasive argument\nfor a naturalistic understanding of Spinoza’s <em>Ethics</em> by a\nleader in the field.]</li>\n<li>Della Rocca, Michael, 1996, <em>Representation and the Mind-Body\nProblem in Spinoza</em>, Oxford: Oxford University Press. [The\nauthoritative work on Spinoza’s theory of ideas.]</li>\n<li>–––, 2005, “Descartes, the Cartesian Circle,\nand Epistemology without God”, <em>Philosophy and\nPhenomenological Research</em>, 70(1): 1–33. [An interpretation\nof Descartes’s system that would allow him to escape the circle\nobjection.]</li>\n<li>–––, 2008, <em>Spinoza</em>, London and New York:\nRoutledge. [An accessible introduction to Spinoza’s main\ndoctrines, with a useful sketch of the historical context.]</li>\n<li>Detlefsen, Karen, 2006, “Atomism, Monism, and Causation in the\nNatural Philosophy of Margaret Cavendish”, <em>Oxford Studies in\nEarly Modern Philosophy</em>, 3: 199–240. [A discussion of the tension\nbetween Cavendish’s monism and her anti-atomism.]</li>\n<li>Donagan, Alan, 1988, <em>Spinoza</em>, Chicago: University of\nChicago Press. [A spare, compulsively readable interpretation of\nSpinoza’s mature work as a whole, with an emphasis on his\nnaturalism.]</li>\n<li>Fantl, Jeremy, 2016, “Mary Shepherd on Causal\nNecessity”, <em>Metaphysica</em>, 17(1): 87–108. [An\nargument that Shepherd’s anti-Humeanism is actually stronger\nthan has been heretofore appreciated.]</li>\n<li>Fraenkel, Carlos, Dario Perinetti, and Justin Smith, Eds, 2010,\n<em>The Rationalists: Between Tradition and Innovation</em>, Dordrecht:\nSpringer. [Essays on varied topics by key thinkers in the field, all of\nthem devoted to understanding and problematizing the category of\nrationalism by considering aspects of key rationalist figures in their\nhistorical contexts.]</li>\n<li>Frankfurt, Harry, 1965, “Descartes’ Validation of\nReason”, <em>American Philosophical Quarterly</em>, 2:\n149–56. [A seminal work dealing with the alleged circularity of\nDescartes’s <em>Meditations</em>.]</li>\n<li>Garber, Daniel and Michael Ayers, Eds., 1998, <em>The Cambridge\nHistory of Seventeenth</em> <em>Century Philosophy</em>, 2 vols.,\nCambridge: Cambridge University Press. [This collection provides a\ncomprehensive look at the relevant philosophical period, with\ninvaluable material about the historical and social context.]</li>\n<li>Garrett, Don, Ed., 1996, <em>The Cambridge Companion to\nSpinoza</em>, Cambridge and New York: Cambridge University Press.\n[Essays on all aspects of Spinoza’s thought by top Spinoza\nscholars.]</li>\n<li>Goldstone, Jack, 1998, “The Problem of the ‘Early\nModern’ World”, <em>Journal of the Economic and Social\nHistory of the Orient</em>, 41(3): 249–284. [An influential\nproblematization of the “early modern” periodization that\nin particular identifies the eurocentrism and the myth of progress on\nwhich the periodization trades. Goldstone also explores\ninconsistencies between the manner in which the boundaries of the\nearly modern era are drawn and usual conventions in historical\nperiodization.]</li>\n<li>Guéroult, Martial, 1968, <em>Spinoza I: Dieu</em>, Paris: Georg\nOlms. [Guéroult is credited with having dealt Wolfson’s\nsubjectivist account of Spinoza’s attributes its death\nblow.]</li>\n<li>Hagengruber, Ruth, 2015, “Cutting Through the Veil of\nIgnorance: Rewriting the History of Philosophy”, <em>The\nMonist</em>, 98: 34–42. [An argument in favor of taking the\nphilosophical writings of women through the history of philosophy as\ncontributions of general relevance to this history.]</li>\n<li>Harth, Erica, 1991, “Cartesian Women”, <em>Yale French\nStudies</em> 80: 146–164. [A useful study of the thought of French\nCartesian women, especially those who were prominent in the\nphilosophical salons of the seventeenth century.]</li>\n<li>Huenemann, Charles, 2008, <em>Understanding Rationalism</em>,\nDurham, UK: Acumen. [A clear and helpful introduction to Descartes,\nSpinoza and Leibniz, written for college juniors.]</li>\n<li>Ishiguro, Hidé, 1972, <em>Leibniz’s Philosophy of Logic and\nLanguage</em>, Ithaca, New York: Cornell University Press. [A clear,\nuntechnical discussion of Leibniz’s arguments considered in light of\ncontemporary angloamerican logic.]</li>\n<li>Jolley, Nicholas (editor), 1995, <em>The Cambridge Companion to\nLeibniz</em>, Cambridge: Cambridge University Press. [Essays on all\naspects of Leibniz’s thought by top Leibniz scholars.]</li>\n<li>Kenny, Anthony, 1998, “Descartes on the Will”, in John\nCottingham (ed.), <em>Descartes</em>, Oxford: Oxford University Press,\npages 132–60. First appeared in R.J. Butler (ed.),\n1973, <em>Cartesian Studies</em>, New York: Barnes and\nNoble. [Articulation of the “freedom of perversity”\ninterpretation of Descartes’s discussions with Mesland on\nfreedom.]</li>\n<li>Kenny, Anthony (editor), 1986, <em>Rationalism, Empiricism and\nIdealism</em>, Oxford: Oxford University Press. [A useful collection,\nmostly of lectures delivered at the British Academy by leading\nscholars of early modern philosophy.]</li>\n<li>Krause, Andrej, 2009, “Amo’s\nOntology”, <em>Philosophia Africana</em>, 12(2):\n141–157. [A discussion of Amo’s general ontology and how\nit informs his commitment to the insensitivity of the human\nsoul.]</li>\n<li>Lascano, Marcy, 2013, “Anne Conway: Bodies in the Spiritual\nWorld”, <em>Philosophy Compass</em>, 8(4): 327–336. [A\ndefense of Conway’s articulation of her monism, with an emphasis\non the important role for “body” in a system where the\nonly substance is spirit.]</li>\n<li>Lennon, Thomas M., 1993, <em>The Battle of the Gods and Giants: The\nLegacies of Descartes and Gassendi, 1655–1715</em>, Princeton:\nPrinceton University Press. [An account of the contest between the\nCartesians and their principal opponents as an extension of the battle\nthat Plato depicts in the <em>Sophist</em> between the materialists\nand the friends of the forms.]</li>\n<li>Lewis, Geneviève (Rodis), 1950,\n<em>L’individualité selon Descartes</em>, Paris:\nJ.Vrin. [Discusses all the texts on both sides of the question of the\nuniqueness of extended substance.]</li>\n<li>Lin, Martin, 2011, “Rationalism and Necessitarianism”,\n<em>Noûs</em>, 46(3): 418–448. [A discussion of\nSpinoza’s and Leibniz’s disagreement over whether\nmetaphysical rationalism leads to necessitarianism.]</li>\n<li>Lloyd, Genevieve, 1993, <em>The Man of Reason: “Male”\nand “Female” in Western Philosophy</em>, 2nd Ed., London:\nRoutledge [This influential feminist study traces the construction of\nreason as masculine in the history of Western philosophy. Lloyd sees\nDescartes’s method as a crucial move in the historical\nphilosophical centering of masculine thought.]</li>\n<li>Loeb, Louis, 1981, <em>From Descartes to Hume: Continental\nMetaphysics and the Development of Modern Philosophy</em>, Ithaca and\nLondon: Cornell University Press. [Loeb famously challenges the\nrationalist-empiricist divide, arguing that important aspects of\nLocke’s and Berkeley’s thought are rationalist in\ncharacter.]</li>\n<li>Mates, Benson, 1986, <em>The Philosophy of Leibniz: Metaphysics\n&amp; Language</em>, Oxford: Oxford University Press. [An internalist\nreading of Leibniz focusing in particular on logical issues and on\nLeibniz’s nominalism.]</li>\n<li>McCracken, Charles J., 1983, <em>Malebranche and British\nPhilosophy</em>, Oxford: Clarendon Press. [A classic account of\nMalebranche’s influence on British philosophy, which also contains a\nwonderful 100 page account of Malebranche’s system.]</li>\n<li>Melamed, Yitzhak, 2013, “Spinoza’s Metaphysics of Thought:\nParallelisms and the Multifaceted Structure of Ideas”,\n<em>Philosophy and Phenomenological Research</em>, 86(3):\n636–683. [A reinterpretation of Spinozist parallelism that seeks\nto resolve why human beings can only know two of substance’s\ninfinite attributes.]</li>\n<li>Merchant, Carolyn, 1979, “The Vitalism of Anne Conway: Its\nImpact on Leibniz’s Concept of the Monad”, <em>Journal of\nthe History of Philosophy</em>, 17(3): 255–269. [A discussion of\nConway’s system, and her influence on Leibniz.]</li>\n<li>Moreau, Joseph, 1947, “Malebranche et le spinozisme”, in\nJoseph Moreau (ed.), <em>Malebranche: Correspondance avec\nJ.-J. Dortous de Mairan</em>, Paris: Vrin, pages 1–99. [Moreau\nprovides an excellent introduction to and analysis of this\ncorrespondence in his introduction to this edition of the\ncorrespondence.]</li>\n<li>Nadler, Steven., Ed., 1993, <em>Causation in Early Modern\nPhilosophy: Cartesianism, Occasionalism, and Preestablished\nHarmony</em>, University Park: Pennsylvania State University Press. [A\ncollection of essays concerning the three main rationalist theories of\ncausation. The essays in this collection consider not only the major\nfigures discussed in the above article, but also a number of\nintermediate and minor figures.]</li>\n<li>Nelson, Alan, Ed., 2005, <em>A Companion to Rationalism</em>,\nOxford, Blackwell. [An ably edited collection of essays devoted to the\nhistorical antecedents of rationalism, to the movement’s “golden\nage” and to rationalist elements in contemporary thought.]</li>\n<li>Norton, David Fate, 1981, “The Myth of British\nEmpiricism”, <em>History of European Ideas</em>, 1(4):\n331–344. [An argument problematizing the very category of\n“British Empiricism.”]</li>\n<li>Okruhlik, Kathleen and James R. Brown, Eds., 1985, <em>The Natural\nPhilosophy of Leibniz</em>, Dordrecht: D. Reidel. [A challenging\ncollection devoted to the role of physics and natural philosophy in the\ndevelopment of Leibniz’s thought.]</li>\n<li>Perry, Ruth, 1986, <em>The Celebrated Mary Astell: An Early English\nFeminist,</em> Chicago, University of Chicago Press. [An influential\nintellectual biography of Astell.]</li>\n<li>Peterman, Alison, 2015, “Spinoza on Extension”,\n<em>Philosophers’ Imprint</em>, 15(14): 1–23. [An argument\nagainst the interpretation that Spinoza takes extension in space to be\na fundamental property of physical things.]</li>\n<li>Rozemond, Marleen, 1998, <em>Descartes’s Dualism</em>, Cambridge:\nHarvard University Press. [A thorough account of the topic indicated,\nincluding valuable scholastic background.]</li>\n<li>Russell, Bertrand, 1992, <em>A Critical Exposition of the Philosophy\nof Leibniz</em>, London: Routledge. [First published in 1900, this work\nincludes Russell’s classic arguments that the basis of Leibniz’s\nthought lies in his Aristotelian logic, and that, for Leibniz,\nrelational properties are merely ideal.]</li>\n<li>Schmaltz, Tad, 2002, <em>Radical Cartesianism: The French reception of\nDescartes</em>, Cambridge: Cambridge University Press. [A treatment of\nthose few—specifically, Desgabets and Régis—who\naccepted Descartes’s doctrine of created truth.]</li>\n<li>Shapiro, Lisa, 2007, “Volume Editor’s Introduction”,\nin Lisa Shapiro (ed. &amp; trans.), <em>The Correspondence Between\nPrincess Elisabeth of Bohemia and René Descartes</em>, Chicago:\nUniversity of Chicago Press. [The definitive analysis of this\ncorrespondence.]</li>\n<li>–––, 2008, “Princess Elisabeth and Descartes:\nThe Union of Soul and Body and the Practice of\nPhilosophy”, <em>British Journal for the History of\nPhilosophy</em>, 7(3): 503–520. [An argument in favor of viewing\nElisabeth as a philosopher in her own right, and not merely a\ncorrespondent of Descartes.]</li>\n<li>Sharp, Hasana, 2012, “Eve’s Perfection: Spinoza on Sexual\n(In)Equality”, <em>Journal of the History of Philosophy</em>\n50(4): 559–580. [A study of inconsistencies in Spinoza’s\naccount of women’s capacities.]</li>\n<li>Smith, Justin, 2015, <em>Nature, Human Nature, &amp; Human Difference:\nRace in Early Modern Philosophy</em>, Princeton: Princeton University\nPress. [A useful study of the construction of race in early modernity\nand its interactions with the philosophical thought of the day.]</li>\n<li>Sowaal, Alice, 2004, “Cartesian Bodies”, <em>Canadian\nJournal of Philosophy</em>, 34(2): 217–40. [This useful article\nsorts Descartes’s inconsistent language about substance in terms\nof levels.]</li>\n<li>–––, 2007, “Mary Astell’s Serious\nProposal: Mind, Method, and Custom”, <em>Philosophy\nCompass</em>, 2(2): 227–243.  [A discussion of Astell’s\ntheory of mind.]</li>\n<li>–––, 2015, “Mary Astell”, The Stanford\nEncyclopedia of Philosophy (Winter 2015 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2015/entries/astell/\">https://plato.stanford.edu/archives/win2015/entries/astell/</a>&gt;.</li>\n<li>Sutherland, Christine Mason, 2005, <em>The Eloquence of Mary\nAstell</em>, Calgary: University of Calgary Press. [A recent study of\nAstell’s importance as a rhetorician.]</li>\n<li>Tollefsen, Deborah, 1999, “Princess Elisabeth and the Problem of\nMind-Body Interaction”, <em>Hypatia</em>, 14(3): 59–77. [A\ndiscussion of Elisabeth’s objections to Descartes’s\ndualism.]</li>\n<li>Wilson, Aaron, 2016, Peirce’s Empiricism: Its Roots and Its\nOriginality, Lanham: Lexington Books. [This study of American\nPragmatist Charles Sanders Peirce contains a useful chapter on the\nhistory of the rationalism-empiricism distinction.]</li>\n<li>Wilson, Margaret Dauler, 1982, <em>Descartes</em>, New York:\nRoutledge. [See Chapter Three for a clear and useful discussion of\nDescartes’s doctrine of created truths.]</li>\n<li>Wiredu, Kwasi, 2004, “Amo’s Critique of Descartes’\nPhilosophy of Mind”, in Kwasi Wiredu (ed.), <em>A Companion to\nAfrican Philosophy</em>, Malden, Massachusetts: Blackwell Publishing,\nLtd., pages 200–206. [Introduction to Amo’s biography, and\nmain lines of his critique against Descartes’s theory of\nmind.]</li>\n<li>Wolfson, Harry, 1934, <em>The Philosophy of Spinoza</em>, 2 vols.,\nCambridge, MA: Harvard University Press. [Wolfson’s is still the\nclassic argument for the subjectivist account of attributes in\nSpinoza.]</li>\n<li>Woolhouse, R.S., 1993, <em>Descartes, Spinoza, Leibniz: The Concept of\nSubstance in Seventeenth Century Metaphysics</em>, London and New\nYork: Routledge. [A deep account of many of the themes covered here,\nwith something of value for readers at all levels.]</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Aristotle, General Topics: metaphysics", "Arnauld, Antoine", "Astell, Mary", "Conway, Lady Anne", "Descartes, René", "Descartes, René: and the pineal gland", "Descartes, René: epistemology", "Descartes, René: ethics", "Descartes, René: life and works", "Descartes, René: mathematics", "Descartes, René: modal metaphysics", "Descartes, René: ontological argument", "Descartes, René: physics", "Descartes, René: theory of ideas", "Desgabets, Robert", "dualism", "Elisabeth, Princess of Bohemia", "feminist philosophy, interventions: history of philosophy", "Gassendi, Pierre", "German Philosophy: in the 18th century, prior to Kant", "Hume, David", "Kant, Immanuel: and Leibniz", "Leibniz, Gottfried Wilhelm", "Leibniz, Gottfried Wilhelm: ethics", "Leibniz, Gottfried Wilhelm: on causation", "Leibniz, Gottfried Wilhelm: on the problem of evil", "Leibniz, Gottfried Wilhelm: philosophy of mind", "Malebranche, Nicolas", "Malebranche, Nicolas: theory of ideas and vision in God", "monism", "Platonism: in metaphysics", "rationalism vs. empiricism", "Shepherd, Mary", "Spinoza, Baruch", "Spinoza, Baruch: physical theory", "Spinoza, Baruch: psychological theory", "substance"], "entry_link": [{"../aristotle-metaphysics/": "Aristotle, General Topics: metaphysics"}, {"../arnauld/": "Arnauld, Antoine"}, {"../astell/": "Astell, Mary"}, {"../conway/": "Conway, Lady Anne"}, {"../descartes/": "Descartes, René"}, {"../pineal-gland/": "Descartes, René: and the pineal gland"}, {"../descartes-epistemology/": "Descartes, René: epistemology"}, {"../descartes-ethics/": "Descartes, René: ethics"}, {"../descartes-works/": "Descartes, René: life and works"}, {"../descartes-mathematics/": "Descartes, René: mathematics"}, {"../descartes-modal/": "Descartes, René: modal metaphysics"}, {"../descartes-ontological/": "Descartes, René: ontological argument"}, {"../descartes-physics/": "Descartes, René: physics"}, {"../descartes-ideas/": "Descartes, René: theory of ideas"}, {"../desgabets/": "Desgabets, Robert"}, {"../dualism/": "dualism"}, {"../elisabeth-bohemia/": "Elisabeth, Princess of Bohemia"}, {"../feminism-femhist/": "feminist philosophy, interventions: history of philosophy"}, {"../gassendi/": "Gassendi, Pierre"}, {"../18thGerman-preKant/": "German Philosophy: in the 18th century, prior to Kant"}, {"../hume/": "Hume, David"}, {"../kant-leibniz/": "Kant, Immanuel: and Leibniz"}, {"../leibniz/": "Leibniz, Gottfried Wilhelm"}, {"../leibniz-ethics/": "Leibniz, Gottfried Wilhelm: ethics"}, {"../leibniz-causation/": "Leibniz, Gottfried Wilhelm: on causation"}, {"../leibniz-evil/": "Leibniz, Gottfried Wilhelm: on the problem of evil"}, {"../leibniz-mind/": "Leibniz, Gottfried Wilhelm: philosophy of mind"}, {"../malebranche/": "Malebranche, Nicolas"}, {"../malebranche-ideas/": "Malebranche, Nicolas: theory of ideas and vision in God"}, {"../monism/": "monism"}, {"../platonism/": "Platonism: in metaphysics"}, {"../rationalism-empiricism/": "rationalism vs. empiricism"}, {"../mary-shepherd/": "Shepherd, Mary"}, {"../spinoza/": "Spinoza, Baruch"}, {"../spinoza-physics/": "Spinoza, Baruch: physical theory"}, {"../spinoza-psychological/": "Spinoza, Baruch: psychological theory"}, {"../substance/": "substance"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=continental-rationalism\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/continental-rationalism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=continental-rationalism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"http://philpapers.org/sep/continental-rationalism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=continental-rationalism": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/continental-rationalism/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=continental-rationalism&redirect=True": "Look up topics and thinkers related to this entry"}, {"http://philpapers.org/sep/continental-rationalism/": "Enhanced bibliography for this entry"}, {"http://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [" <a href=\"http://www.newadvent.org/cathen/index.html\" target=\"other\">Catholic Encyclopedia</a>,\n maintained by Kevin Knight of the New Advent Catholic\nwebsite. Includes entries on all of the figures discussed in the above\narticle.", " <a href=\"http://www.cartesius.net/\" target=\"other\">Descartes E Il Seicento</a>,\n maintained by Giulia Belgioioso (Director, Centro Interdipartmentali Di\nStudi Su Descartes E Il Seicento), Jean-Robert Armogathe (Centre\nd’études cartésiennes) et al.", " <a href=\"http://www.gwleibniz.com/\" target=\"other\">Leibnitiana</a>, \n  maintained by Gregory Brown at the University of Houston.", " <a href=\"http://web.ics.purdue.edu/~jacover/Leibniz.htm\" target=\"other\">Leibniz</a>,\n maintained by Jan Cover of the Purdue University Department of\nPhilosophy.", " <a href=\"http://www.perturbedintellect.typepad.com/\" target=\"other\">Necessarily Eternal</a>,\n this so-called “Catablog of (All) Things Spinoza” has not been updated\nsince 2009. Nonetheless, it houses a very impressive linked list of\nactive Spinoza scholars and other useful resources.", " <a href=\"http://projectvox.library.duke.edu/\" target=\"other\">Project Vox</a>,\n maintained by Duke University, is a valuable online resource\nthat aims to give voice to Early Modern women philosophers, whose\nvoices have been unjustly ignored through most of history. You can\nfind bibliographies, biographies, teaching tools, and images\nhere.", " <a href=\"http://www.mtsu.edu/~rbombard/RB/spinoza.new.html\" target=\"other\">Studia Spinoziana</a>,\n maintained by Ron Bombardi, Department of Philosophy,\nMiddle Tennessee State University."], "listed_links": [{"http://www.newadvent.org/cathen/index.html": "Catholic Encyclopedia"}, {"http://www.cartesius.net/": "Descartes E Il Seicento"}, {"http://www.gwleibniz.com/": "Leibnitiana"}, {"http://web.ics.purdue.edu/~jacover/Leibniz.htm": "Leibniz"}, {"http://www.perturbedintellect.typepad.com/": "Necessarily Eternal"}, {"http://projectvox.library.duke.edu/": "Project Vox"}, {"http://www.mtsu.edu/~rbombard/RB/spinoza.new.html": "Studia Spinoziana"}]}, "tokenized_text": ["1", "introduction", "rationalism", "substance", "seventeenth", "early", "eighteenth", "century", "saw", "heyday", "metaphysical", "systembuilding", "expression", "continental", "rationalism", "primarily", "connotes", "rather", "set", "epistemological", "view", "contrast", "british", "empiricism", "trace", "knowledge", "sensory", "experience", "view", "emphasize", "reliance", "reason", "ratio", "latin", "hence", "rationalism", "resource", "taken", "sufficient", "sense", "know", "thus", "signature", "doctrine", "rationalism", "doctrine", "innate", "idea", "according", "mind", "built", "structure", "knowledge", "even", "content", "nonetheless", "among", "philosopher", "comprising", "extension", "expression", "metaphysical", "issue", "particularly", "ontology", "substance", "occupy", "central", "place", "certainly", "true", "leibniz", "spinoza", "also", "malebranche", "cartesian", "even", "descartes", "plausible", "understanding", "understand", "relationship", "rationalism", "metaphysical", "epistemological", "commitment", "helpful", "recall", "plato", "divided", "line", "establishes", "parallel", "object", "known", "mean", "known", "fact", "order", "object", "ordo", "essendi", "ranging", "importance", "good", "form", "individual", "thing", "image", "order", "knowing", "ordo", "cognoscendi", "ranging", "intuition", "various", "sort", "sensory", "experience", "found", "various", "version", "among", "later", "rationalist", "important", "point", "case", "continental", "rationalist", "plato", "epistemological", "distinction", "grounded", "ontological", "distinction", "put", "term", "reflect", "rationalist", "thinking", "number", "issue", "distinction", "reason", "two", "order", "order", "knowing", "really", "distinct", "differ", "way", "thinking", "good", "explanation", "close", "connection", "seen", "rationalist", "epistemological", "ontological", "order", "one", "also", "account", "notable", "reliance", "reason", "derives", "answer", "leibniz", "called", "grand", "metaphysical", "question", "something", "rather", "nothing", "something", "must", "something", "nothing", "way", "putting", "show", "ultimate", "debt", "rationalist", "tradition", "go", "back", "parmenides", "reality", "least", "part", "necessary", "existence", "necessity", "something", "like", "logical", "necessity", "answer", "whole", "philosophical", "outlook", "fall", "place", "first", "significant", "role", "sensory", "experience", "fall", "away", "since", "exists", "known", "priori", "logic", "alone", "causal", "connection", "tend", "viewed", "logical", "connection", "principle", "sufficient", "reason", "fall", "tends", "read", "matter", "logical", "deduction", "one", "result", "impulse", "toward", "monism", "ultimate", "cause", "must", "exist", "sufficient", "reason", "must", "also", "exist", "two", "distinguished", "becomes", "problematic", "parmenidean", "antecedent", "clear", "outlook", "articulated", "rationalist", "except", "perhaps", "spinozaindeed", "concerned", "avoid", "consequence", "view", "outlook", "capture", "intuition", "behind", "metaphysical", "system", "elaborated", "certainly", "draw", "contrast", "empiricist", "tended", "toward", "tychism", "view", "world", "largely", "even", "entirely", "product", "chance", "empiricist", "account", "universe", "consists", "many", "independent", "individual", "connected", "accidentally", "reducing", "causation", "nothing", "matter", "constant", "conjunction", "physical", "metaphysical", "logical", "atomism", "tradition", "democritus", "epicurus", "lucretius", "circumstance", "experience", "world", "provide", "knowledge", "early", "modern", "period", "philosophy", "including", "continental", "rationalism", "generally", "supposed", "driven", "new", "science", "radical", "departure", "aristotelianism", "late", "medieval", "renaissance", "period", "immediately", "preceding", "see", "goldstone", "1998", "problematization", "idea", "early", "modernity", "view", "period", "launched", "new", "science", "mechanization", "mathematization", "world", "demanded", "inertial", "physic", "moving", "earth", "led", "revolutionary", "philosophy", "better", "described", "least", "rationalist", "version", "platonic", "even", "pythagorean", "even", "aristotelian", "concept", "terminology", "persisted", "appropriated", "deployed", "deal", "new", "problem", "principal", "aristotelian", "concept", "taken", "rationalist", "concept", "substance", "aristotle", "term", "ousia", "usually", "translated", "substance", "exactly", "aristotle", "meant", "term", "thorny", "matter", "much", "debated", "literature", "account", "substance", "category", "hold", "individual", "thing", "term", "proper", "substance", "paradigmatic", "substance", "account", "substance", "best", "understood", "analogy", "grammatical", "subjectit", "take", "predicate", "predicable", "anything", "thus", "animal", "predicable", "horse", "horse", "bucephalus", "bucephalus", "stand", "impredicable", "hence", "numerically", "different", "anything", "else", "much", "aristotle", "account", "metaphysicswritten", "year", "laterseems", "accord", "however", "metaphysics", "1017b1026", "complicates", "story", "aristotle", "describes", "four", "us", "term", "concludes", "reducing", "two", "broad", "senses", "1", "substance", "hypokeimenon", "ultimate", "substratum", "predicated", "anything", "2", "substance", "form", "make", "thing", "kind", "thing", "indication", "within", "text", "suggest", "time", "giving", "lecture", "collected", "metaphysics", "aristotle", "regarded", "individual", "thing", "matter", "individual", "thing", "formed", "ultimate", "subject", "predication", "conception", "sense", "bucephalus", "predicable", "matter", "thus", "substance", "category", "serf", "principle", "individuation", "substance", "metaphysics", "complicated", "serving", "individuate", "bucephalus", "seabiscuit", "capture", "connection", "sameness", "hold", "substance", "called", "upon", "account", "difference", "sameness", "world", "indicates", "inherent", "tension", "concept", "certainly", "two", "sens", "term", "substance", "tension", "seventeenth", "century", "momentum", "rationalist", "argument", "resolve", "tension", "folding", "first", "sense", "second", "real", "differentiation", "world", "appearance", "difference", "seventeenth", "century", "rationalist", "assigned", "substance", "three", "role", "connection", "substance", "taken", "1", "connect", "attribute", "attribute", "thing", "time", "given", "shape", "given", "size", "shape", "size", "thing", "2", "connect", "time", "later", "shape", "size", "perhaps", "different", "earlier", "nonetheless", "shape", "size", "thing", "3", "connect", "somehow", "related", "thing", "certain", "kind", "thing", "cartesian", "shape", "size", "would", "indicate", "thing", "kind", "extended", "however", "spinoza", "alone", "among", "continental", "rationalist", "fully", "embraced", "conception", "substance", "fundamental", "connection", "thing", "member", "movement", "struggled", "retain", "notion", "substance", "individuator", "varying", "degree", "success", "2", "descartes", "critic", "rationalism", "famous", "rationalist", "problematic", "two", "count", "first", "descartes", "known", "father", "modern", "philosophy", "precisely", "initiated", "socalled", "epistemological", "turn", "u", "still", "since", "descartes", "philosophy", "especially", "concerned", "theory", "knowledge", "affect", "area", "philosophy", "ethic", "example", "often", "concerned", "good", "might", "known", "rather", "good", "might", "fundamental", "objective", "achieving", "certainty", "belief", "descartes", "thus", "principally", "responsible", "incomplete", "characterization", "rationalism", "etymologically", "essentially", "connected", "claim", "reason", "descartes", "certainly", "sought", "justify", "claim", "reason", "relied", "upon", "even", "corresponding", "ontological", "view", "le", "important", "system", "second", "problematic", "aspect", "descartes", "rationalism", "difficult", "resolve", "descartes", "radical", "voluntarist", "thought", "truth", "including", "take", "necessary", "truth", "depends", "god", "care", "need", "taken", "view", "expressed", "descartes", "hold", "simply", "take", "necessary", "fact", "contingent", "held", "actually", "necessary", "truth", "depends", "god", "unconstrained", "even", "proposition", "logically", "contradictory", "might", "simultaneously", "true", "reason", "thus", "seems", "longer", "reliable", "experience", "would", "seem", "way", "determining", "world", "even", "beyond", "logic", "powerful", "unconstrained", "god", "created", "many", "rationalist", "even", "among", "cartesian", "followed", "descartes", "radical", "voluntarism", "recent", "time", "seen", "view", "ultimately", "incoherent", "even", "descartes", "seems", "taken", "view", "basis", "least", "physic", "perhaps", "whole", "system", "indeed", "account", "doctrine", "created", "truth", "enabled", "descartes", "frame", "radical", "doubt", "hitherto", "conceived", "meditation", "entertained", "possibility", "always", "deceived", "mendacious", "deity", "even", "considering", "appeared", "obviously", "true", "wit", "existence", "simplest", "thing", "subject", "arithmetic", "geometry", "view", "margaret", "wilson", "1982", "105114", "observes", "meditation", "1", "god", "need", "power", "deceive", "eternal", "truth", "create", "doubt", "doctrine", "radical", "might", "lead", "one", "despair", "ever", "achieving", "sure", "knowledge", "descartes", "catalyst", "discovery", "cogito", "first", "indubitable", "truththe", "truth", "existence", "every", "stage", "descartes", "argument", "meditation", "ontological", "implication", "mind", "independence", "sensory", "perception", "perception", "whose", "reliability", "ultimately", "upset", "possibility", "dreaming", "literally", "unimaginable", "sort", "thing", "physical", "object", "piece", "wax", "must", "existence", "veracious", "god", "provides", "guarantee", "reliability", "reason", "finally", "existence", "physical", "world", "consisting", "extended", "thing", "arnauld", "immediately", "suggested", "descartes", "argument", "contained", "circle", "rely", "reason", "know", "god", "exists", "know", "god", "exists", "relying", "reason", "thus", "descartes", "established", "certainty", "existence", "nothing", "beyond", "descartes", "thought", "response", "criticism", "whether", "cogent", "rebuttal", "perennial", "question", "debate", "among", "descartes", "scholar", "one", "way", "understand", "descartes", "procedure", "claim", "prove", "even", "exists", "claim", "show", "unreasonable", "think", "otherwise", "show", "argument", "skeptic", "fails", "consistent", "application", "reason", "lead", "view", "reason", "unreliable", "precisely", "opposite", "skeptic", "might", "right", "unreasonable", "parallel", "case", "moral", "realm", "might", "brought", "course", "exchange", "mesland", "nature", "human", "freedom", "descartes", "note", "absolutely", "speaking", "act", "reason", "judgment", "however", "morally", "speaking", "csm", "iii", "245at", "4173", "explaining", "mean", "descartes", "suggests", "act", "better", "judgment", "reason", "case", "take", "good", "thing", "demonstrate", "freedom", "kenny", "called", "freedom", "perversity", "kenny", "1998", "word", "attitude", "perversion", "act", "take", "best", "epistemological", "realm", "moral", "realm", "unreasonable", "even", "perverse", "deny", "result", "consistent", "use", "reason", "descartes", "thus", "emerges", "least", "bootstrap", "rationalistusing", "innate", "reason", "disinclination", "perversity", "assert", "truth", "existence", "turn", "serf", "foundation", "extensive", "search", "truthin", "way", "mirror", "nonabsolute", "status", "necessary", "truth", "rationalist", "connection", "order", "knowing", "thus", "preserved", "sense", "made", "doctrine", "created", "truth", "kind", "causality", "god", "create", "eternal", "necessary", "truth", "response", "question", "descartes", "replied", "god", "way", "created", "everything", "else", "total", "efficient", "cause", "existence", "created", "thing", "also", "essence", "eternal", "truth", "essence", "created", "thing", "descartes", "elaborate", "answer", "provided", "enough", "elsewhere", "u", "clear", "descartes", "many", "theologically", "orthodox", "thinker", "existence", "thing", "result", "unconstrained", "exercise", "god", "omnipotent", "create", "ex", "nihilo", "descartes", "might", "saying", "eternal", "truth", "essence", "also", "something", "created", "ex", "nihilo", "eternal", "truth", "might", "thus", "instance", "descartes", "called", "substance", "principle", "descartes", "defined", "substance", "thing", "exists", "existence", "depend", "thing", "immediately", "added", "strictly", "speaking", "term", "applies", "god", "uncreated", "alone", "depends", "nothing", "else", "exist", "however", "allowed", "extended", "sense", "applies", "thing", "depend", "god", "creation", "continuing", "conservation", "created", "substance", "really", "distinct", "substance", "insofar", "conceivable", "apart", "require", "subject", "inherence", "thus", "ontologically", "causally", "independent", "created", "substance", "distinguished", "thing", "quality", "depend", "god", "causally", "also", "depend", "ontologically", "thing", "ultimately", "created", "substance", "subject", "inherence", "sense", "created", "substance", "descartes", "like", "hypokeimenon", "aristotle", "playing", "role", "individuator", "bearer", "quality", "however", "definition", "real", "distinction", "built", "unintended", "tendency", "toward", "monisma", "tendency", "spinoza", "exploited", "descartes", "one", "thing", "really", "distinct", "another", "case", "conceived", "apart", "test", "independence", "applied", "causal", "relation", "produce", "result", "one", "substance", "god", "type", "thing", "counted", "created", "substance", "descartes", "clearly", "take", "individual", "mind", "created", "substance", "mind", "status", "descartes", "argument", "immortality", "conceived", "apart", "else", "except", "god", "fortiori", "body", "would", "collapse", "beyond", "mind", "however", "ambiguity", "appears", "although", "text", "descartes", "speaks", "individual", "thing", "like", "piece", "wax", "substance", "othersmost", "famously", "synopsis", "meditationsthat", "indicate", "single", "extended", "substance", "individual", "thing", "mode", "minimum", "asymmetry", "treatment", "mind", "material", "thing", "perhaps", "reflecting", "tension", "hypokeimenon", "accounting", "difference", "sense", "ousia", "accounting", "sameness", "say", "peter", "paul", "substance", "say", "mind", "numerically", "distinct", "say", "piece", "wax", "piece", "wood", "substance", "might", "say", "extended", "thing", "however", "many", "instance", "kind", "might", "dualism", "two", "kind", "substance", "according", "descartes", "thinking", "thing", "mind", "extended", "thing", "body", "dualism", "generated", "two", "wellknown", "problem", "resolved", "descartes", "partial", "success", "one", "incisive", "critic", "elisabeth", "bohemia", "wanted", "know", "voluntary", "action", "property", "unextended", "mind", "could", "effect", "body", "given", "according", "descartes", "mechanistic", "physic", "material", "thing", "affected", "contact", "descartes", "replied", "rather", "mysterious", "account", "mind", "body", "formed", "unique", "kind", "composite", "course", "letter", "correspondence", "focus", "issue", "elisabeth", "press", "descartes", "explanation", "mind", "body", "interact", "descartes", "response", "satisfy", "elisabeth", "rightly", "mysterious", "composite", "suggests", "involves", "concept", "primitive", "notion", "shapiro", "65at", "3665", "concept", "present", "writing", "descartes", "state", "primitive", "notion", "body", "extension", "mind", "thought", "mindbody", "composite", "union", "explains", "notion", "best", "understood", "using", "faculty", "particularly", "wellsuited", "grasp", "primitive", "notion", "mind", "state", "best", "understood", "understanding", "alone", "primitive", "notion", "body", "best", "understood", "understanding", "aided", "imagination", "primitive", "notion", "composite", "best", "understood", "sens", "shapiro", "69at", "3691", "armed", "distinction", "methodology", "knowing", "notion", "descartes", "diagnosis", "elisabeth", "difficulty", "understanding", "explanation", "following", "way", "trying", "hard", "understand", "union", "mind", "body", "understanding", "alone", "remedy", "problem", "suggests", "princess", "stop", "meditating", "problem", "instead", "focus", "life", "ordinary", "conversation", "order", "conceive", "union", "shapiro", "70at", "3692", "course", "recommendation", "adequately", "address", "elisabeth", "question", "focusing", "life", "ordinary", "conversation", "may", "well", "help", "conceive", "mind", "body", "interact", "point", "elisabeth", "call", "question", "furnishes", "nothing", "towards", "answer", "question", "interaction", "occurs", "discussion", "topic", "come", "end", "elisabeth", "suggestion", "better", "able", "understand", "interaction", "thinking", "part", "soul", "extended", "shapiro", "72at", "41", "model", "necessary", "condition", "motion", "contact", "possible", "descartes", "effort", "resolve", "second", "difficulty", "promising", "also", "exemplifies", "rationalistic", "character", "thought", "problem", "show", "mind", "know", "something", "material", "thing", "different", "kind", "given", "longstanding", "principle", "like", "know", "like", "rejected", "essentially", "aristotelian", "principle", "still", "give", "account", "knowledge", "scholastic", "source", "descartes", "able", "construct", "theory", "idea", "according", "know", "something", "idea", "idea", "thing", "known", "far", "known", "saw", "term", "idea", "ambiguous", "taken", "materially", "formal", "reality", "mode", "mind", "taken", "another", "sense", "objective", "reality", "thing", "represented", "real", "distinction", "reality", "rational", "distinction", "really", "thing", "considered", "differently", "welcome", "epistemological", "upshot", "rationalist", "gambit", "descartes", "skeptical", "problem", "generated", "idea", "standing", "tertium", "quid", "knower", "known", "result", "indicated", "descartes", "use", "term", "picked", "emphasized", "malebranche", "according", "false", "idea", "every", "idea", "sense", "materially", "true", "object", "object", "appears", "conception", "idea", "basis", "descartes", "called", "transparency", "mind", "mistaken", "thinking", "thinking", "malebranche", "whose", "entire", "philosophy", "colored", "struggle", "descartes", "theory", "idea", "fact", "later", "erected", "incorrigible", "intentionality", "fundamental", "principle", "epistemology", "meanwhile", "descartes", "view", "material", "formal", "reality", "objective", "reality", "rationally", "distinct", "might", "taken", "mean", "mind", "intrinsically", "intentional", "mind", "sort", "thing", "whose", "state", "something", "else", "arnauld", "extended", "thesis", "adumbrates", "later", "thinker", "brentano", "include", "mental", "phenomenon", "even", "sensation", "another", "line", "discussion", "relates", "problem", "dualism", "nature", "idea", "advanced", "1734", "ghanaian", "philosopher", "anton", "amo", "extraordinarily", "interesting", "thinker", "right", "amo", "advance", "critique", "descartes", "assertion", "mind", "sense", "immaterial", "mind", "passively", "receive", "sensory", "information", "dissertation", "apatheia", "human", "mind", "absence", "sensation", "faculty", "sense", "human", "mind", "presence", "organic", "living", "body", "amo", "state", "human", "mind", "spirit", "spirit", "substance", "purely", "active", "following", "narrative", "commitment", "metaphysical", "reality", "substance", "common", "feature", "rationalist", "period", "amo", "sits", "firmly", "rationalist", "camp", "basis", "particular", "definition", "substance", "amo", "distinguishes", "view", "descartes", "according", "descartes", "mind", "sense", "amo", "sensation", "purely", "passive", "feature", "spiritual", "purely", "active", "substance", "mind", "two", "thread", "amo", "critique", "first", "concerned", "uphold", "soul", "lofty", "position", "deserves", "given", "status", "purely", "active", "critique", "descartes", "point", "intersects", "objection", "raised", "elisabeth", "mind", "immaterial", "interact", "material", "thing", "thus", "mind", "sensation", "material", "object", "amo", "75", "second", "amo", "wish", "emphasize", "essential", "nature", "body", "human", "being", "view", "live", "sensation", "inseparable", "predicate", "living", "thing", "feel", "feeling", "thing", "live", "view", "live", "embodied", "allows", "amo", "call", "question", "descartes", "claim", "meditation", "ii", "nothing", "thinking", "thing", "amo", "impossible", "thinking", "thing", "live", "without", "body", "amo", "thus", "dualist", "like", "descartes", "important", "difference", "removing", "sensation", "mind", "locating", "body", "move", "simultaneously", "preserve", "pure", "activity", "mind", "boost", "importance", "body", "entity", "human", "amo", "dualism", "face", "problem", "descartes", "accept", "fact", "body", "sens", "mind", "amo", "must", "provide", "explanation", "mind", "body", "communicate", "particular", "must", "provide", "explanation", "body", "sense", "instance", "pain", "communicate", "sensation", "purely", "active", "mind", "amo", "might", "seem", "better", "situated", "descartes", "offer", "explanation", "endorse", "interesting", "definition", "idea", "may", "provide", "starting", "point", "explanation", "amo", "state", "think", "manner", "human", "function", "four", "element", "must", "kept", "separate", "mind", "operation", "mind", "idea", "immediate", "sensation", "mind", "operation", "immaterial", "say", "immediate", "sensation", "property", "body", "however", "amo", "view", "idea", "understood", "composite", "entity", "idea", "mind", "make", "present", "sensation", "preexisting", "body", "thereby", "brings", "feeling", "mind", "amo", "74", "composite", "amo", "mean", "composite", "material", "immaterial", "substance", "suggestion", "bear", "resemblance", "elisabeth", "claim", "think", "could", "material", "part", "soul", "could", "account", "ability", "interact", "body", "course", "explaining", "mind", "make", "sensation", "present", "thus", "brings", "feeling", "determine", "success", "explanation", "3", "malebranche", "cavendish", "battle", "cartesian", "opponent", "latter", "half", "seventeenth", "century", "one", "great", "struggle", "history", "philosophy", "one", "line", "clearly", "drawn", "although", "cartesian", "camp", "claimed", "banner", "descartes", "many", "difference", "among", "opponent", "perhaps", "important", "difference", "among", "hinged", "whether", "accepted", "descartes", "doctrine", "created", "truth", "desgabets", "student", "régis", "important", "among", "accept", "doctrine", "along", "acceptance", "doctrine", "however", "came", "nascent", "tendency", "toward", "empiricism", "hand", "malebranche", "notable", "among", "cartesian", "rejected", "doctrine", "created", "truth", "developed", "philosophical", "system", "purer", "rationalistic", "character", "descartes", "descartes", "advised", "follower", "follow", "reason", "malebranche", "like", "heterodox", "cartesian", "justified", "difference", "descartes", "result", "following", "injunction", "view", "rejection", "doctrine", "created", "truth", "followed", "commitment", "deeper", "view", "descartes", "thus", "represented", "cartesian", "descartes", "philosophy", "malebranche", "sometimes", "portrayed", "synthesis", "descartes", "augustine", "precise", "way", "put", "relation", "malebranche", "used", "augustine", "rectify", "shortcoming", "perceived", "philosophy", "descartes", "chief", "among", "descartes", "theory", "idea", "according", "malebranche", "fails", "reflect", "human", "being", "proper", "dependence", "god", "also", "lead", "inevitably", "skepticism", "initially", "malebranche", "thought", "agreed", "descartes", "theory", "long", "debate", "nature", "idea", "arnauld", "held", "close", "version", "descartes", "theory", "malebranche", "came", "see", "need", "different", "account", "implausibly", "arnauld", "took", "descartes", "claim", "ambiguity", "term", "idea", "mean", "idea", "perception", "refers", "one", "thing", "thing", "stand", "two", "different", "relation", "insofar", "related", "known", "called", "idea", "insofar", "related", "mind", "called", "perception", "act", "perception", "took", "related", "mind", "mode", "point", "malebranche", "detected", "threat", "skepticism", "know", "indeed", "know", "important", "instance", "knowledge", "universal", "necessary", "infinite", "case", "certain", "mathematical", "knowledge", "nothing", "mode", "particular", "contingent", "finite", "mind", "universal", "necessary", "infinite", "idea", "mode", "mind", "would", "knowledge", "since", "knowledge", "idea", "must", "something", "else", "malebranche", "argued", "idea", "could", "exist", "god", "following", "augustine", "took", "idea", "exemplar", "mind", "god", "creates", "world", "construal", "additional", "advantage", "malebranche", "guarding", "skepticism", "although", "idea", "object", "longer", "identical", "nonetheless", "necessarily", "connected", "exemplar", "exemplum", "even", "remained", "true", "malebranche", "look", "material", "thing", "fact", "see", "thing", "idea", "core", "view", "vision", "thing", "god", "welcomed", "indication", "human", "being", "dependence", "deity", "immediate", "vehicle", "whereby", "knowledge", "particular", "contingent", "finite", "mode", "mind", "universal", "necessary", "infinite", "object", "mode", "exist", "kind", "idea", "known", "mind", "least", "mode", "although", "idea", "innate", "mind", "would", "make", "mode", "nonetheless", "always", "present", "seeking", "know", "whether", "realize", "consulting", "reason", "malebranche", "identifies", "second", "person", "trinity", "logo", "neoplatonic", "theology", "effort", "know", "natural", "prayer", "reason", "always", "answer", "individual", "substance", "malebranche", "clearly", "thought", "every", "material", "thing", "every", "mind", "substance", "sense", "hypokeimenon", "pressed", "late", "life", "show", "status", "comported", "rest", "system", "could", "anything", "mode", "single", "substance", "short", "avoided", "drift", "spinozistic", "monism", "fact", "hard", "pressed", "search", "truth", "malebranche", "clearly", "committed", "view", "everything", "either", "substance", "mode", "addition", "accepted", "descartes", "criterion", "substance", "conceivable", "apart", "everything", "else", "however", "maintained", "given", "portion", "extension", "conceivable", "apart", "rest", "extension", "thus", "substance", "descartes", "think", "otherwise", "void", "space", "would", "possible", "since", "extension", "conceptually", "divisible", "infinity", "malebranche", "committed", "infinite", "number", "extended", "substance", "apart", "whole", "extension", "moreover", "every", "substance", "contains", "infinite", "number", "substance", "mode", "also", "part", "infinite", "number", "substance", "mode", "explanatory", "value", "concept", "substance", "would", "seem", "lost", "result", "malebranche", "view", "seems", "degenerate", "version", "descartes", "text", "effect", "surprising", "coherent", "one", "material", "substance", "re", "extensa", "whose", "mode", "particular", "material", "thing", "effect", "reverse", "aristotelian", "logic", "substance", "say", "x", "particular", "thing", "extended", "e", "say", "substance", "x", "property", "e", "x", "mode", "re", "extensa", "difficulty", "accounting", "substance", "malebranche", "part", "seem", "derive", "platonism", "platonist", "interested", "le", "substance", "hypokeimenon", "account", "difference", "sense", "ousia", "account", "sameness", "thus", "malebranche", "skid", "spinozism", "greased", "even", "talk", "mind", "essence", "thoughtnot", "thought", "substantial", "thought", "thought", "capable", "sort", "modification", "thought", "since", "substantial", "thought", "possessed", "mind", "malebranche", "view", "smack", "even", "single", "intellectual", "soul", "human", "being", "latin", "averroists", "sense", "heterodoxy", "cartesian", "part", "parcel", "deep", "commitment", "rationalism", "particular", "rationalistic", "reduction", "phenomenal", "difference", "real", "sameness", "final", "rationalistic", "aspect", "malebranche", "thought", "deserves", "attention", "theory", "causation", "malebranche", "cause", "whose", "effect", "necessary", "connection", "view", "causal", "connection", "characterized", "kind", "necessity", "god", "effect", "thus", "malebranche", "god", "causal", "efficacy", "take", "real", "causesfor", "example", "motion", "billiard", "ball", "collides", "another", "begin", "moveare", "fact", "occasional", "cause", "occasion", "operation", "real", "cause", "cousin", "malebranche", "occasionalism", "worth", "noting", "margaret", "cavendish", "agrees", "malebranche", "body", "cause", "change", "one", "another", "disagrees", "whether", "nature", "selfmoving", "malebranche", "take", "created", "thing", "posse", "causal", "power", "cavendish", "take", "posse", "power", "selfmotion", "view", "body", "interact", "transfer", "motion", "cavendish", "commitment", "view", "grounded", "belief", "property", "transferred", "body", "motion", "property", "argues", "motion", "transferred", "body", "following", "line", "reasoning", "body", "come", "contact", "act", "occasional", "cause", "cause", "merely", "occasion", "change", "interaction", "one", "body", "serve", "occasional", "cause", "second", "body", "serve", "principal", "cause", "brings", "appropriate", "effect", "see", "detlefsen", "2006", "entry", "cavendish", "thinker", "also", "hold", "view", "ubiquitous", "period", "motion", "issued", "created", "world", "result", "god", "willing", "cavendish", "careful", "note", "issuance", "result", "immediate", "action", "god", "rather", "allpowerful", "command", "cavendish", "209", "reject", "former", "option", "ground", "continual", "immediate", "action", "unsuitable", "immovable", "immutable", "essence", "cavendish", "209", "point", "malebranche", "agreement", "difference", "way", "conceive", "occasional", "causation", "understand", "content", "allpowerful", "command", "introduces", "motion", "system", "malebranche", "view", "true", "cause", "one", "perceive", "necessary", "connection", "effect", "candidate", "connection", "infinite", "cause", "effect", "moreover", "seems", "also", "endorse", "claim", "cause", "bring", "effect", "must", "posse", "knowledge", "bring", "case", "relationship", "finite", "mind", "body", "joined", "ignorance", "mind", "cause", "body", "move", "enough", "deny", "causal", "connection", "short", "god", "required", "knowledge", "effect", "kind", "change", "argument", "undergird", "central", "malebranchean", "commitment", "utter", "dependence", "created", "thing", "god", "make", "sense", "system", "deny", "causal", "efficacy", "anything", "god", "denial", "causal", "efficacy", "entrenches", "dependence", "created", "thing", "creator", "cavendish", "tell", "different", "kind", "story", "note", "show", "discomfort", "notion", "god", "command", "gave", "power", "selfmotion", "created", "thing", "clouded", "ambition", "cavendish", "209", "ambition", "lead", "certain", "thinker", "imagine", "immaterial", "substance", "soul", "created", "thing", "posse", "selfmotion", "understanding", "causation", "feel", "closer", "god", "radically", "selfmoving", "superior", "material", "thing", "posse", "ability", "selfmove", "however", "cavendish", "note", "decree", "god", "introduces", "motion", "created", "world", "easily", "imparted", "material", "thing", "immaterial", "thing", "reason", "suppose", "give", "power", "selfmotion", "material", "thing", "cavendish", "criticism", "whose", "ambition", "cloud", "way", "think", "selfmotion", "apply", "malebranche", "however", "view", "created", "thing", "human", "soul", "included", "posse", "power", "selfmove", "given", "malebranche", "combined", "rationalistic", "theological", "commitment", "none", "surprising", "surprise", "least", "irony", "come", "malebranche", "argument", "natural", "causeseven", "especially", "human", "volitions", "real", "cause", "cross", "channel", "deployed", "hume", "radical", "empiricist", "account", "causation", "hume", "gave", "term", "constant", "conjunction", "malebranche", "rationalist", "occasionalism", "without", "role", "assigned", "god", "hume", "malebranche", "occasional", "cause", "cause", "4", "spinoza", "centrality", "substance", "continental", "rationalist", "borne", "importance", "concept", "spinoza", "especially", "within", "ethic", "spinoza", "devoted", "entire", "first", "part", "work", "consideration", "substance", "also", "termed", "deus", "sive", "natura", "god", "word", "nature", "remaining", "part", "trace", "consequence", "conception", "substance", "epistemology", "psychology", "physic", "ethic", "spinoza", "account", "substance", "quite", "rightly", "regarded", "development", "workingout", "descartes", "metaphysics", "also", "descartes", "malebranche", "considerable", "important", "difference", "two", "important", "present", "purpose", "however", "malebranche", "spinoza", "departure", "descartes", "almost", "always", "manifestation", "form", "rationalism", "purer", "descartes", "radically", "spinoza", "replaced", "descartes", "substance", "pluralism", "monistic", "account", "modelled", "cartesian", "extended", "substance", "place", "descartes", "treat", "body", "mere", "mode", "single", "extended", "substance", "spinoza", "individualsboth", "body", "mindsare", "mode", "single", "substance", "spinoza", "arrived", "position", "way", "decidedly", "uncartesian", "account", "attribute", "descartes", "held", "two", "substance", "type", "share", "principal", "attribute", "spinoza", "rejected", "two", "substance", "argued", "spinoza", "must", "distinguished", "either", "attribute", "spinoza", "dropped", "modifier", "principal", "mode", "since", "mode", "ontologically", "causally", "dependent", "substance", "affection", "individuating", "principle", "thus", "must", "attribute", "individuate", "substance", "type", "substance", "descartes", "argued", "similarly", "descartes", "held", "substance", "characterized", "one", "one", "principal", "attribute", "spinoza", "invoked", "principle", "plenitude", "show", "substance", "must", "infinite", "attribute", "based", "variation", "ontological", "argument", "maintained", "substance", "pure", "utterly", "unlimited", "must", "therefore", "argued", "posse", "infinite", "attribute", "dual", "sense", "possessing", "unlimited", "attribute", "possessing", "attribute", "since", "substance", "characterized", "infinite", "attribute", "since", "two", "substance", "share", "single", "attribute", "one", "substance", "radical", "monism", "repugnant", "many", "like", "english", "philosopher", "anne", "conway", "saw", "eliminated", "distinction", "creator", "god", "creation", "spinoza", "one", "substance", "farthest", "possible", "remove", "aristotle", "proper", "substance", "whereas", "aristotle", "individual", "thing", "bucephalus", "paradigmatic", "substance", "spinoza", "denies", "substantiality", "mean", "unlike", "aristotelian", "proper", "substance", "predicable", "anything", "else", "spinoza", "finite", "mode", "predicable", "substance", "scholar", "divided", "point", "curley", "argued", "spinoza", "retains", "conception", "substancemode", "distinction", "distinction", "independent", "dependent", "reject", "view", "substancemode", "distinction", "correlate", "distinction", "subject", "predication", "predicate", "bennett", "however", "argues", "spinoza", "indeed", "regard", "finite", "mode", "predicable", "substance", "put", "adjectival", "world", "bennett", "characterizes", "spinoza", "account", "substance", "field", "metaphysic", "individual", "thing", "simply", "cluster", "quality", "within", "region", "space", "blush", "merely", "confluence", "property", "region", "face", "faceindeed", "person", "whose", "face", "isis", "confluence", "property", "region", "substance", "whether", "spinoza", "rejected", "predicability", "finite", "mode", "clear", "regard", "either", "causally", "conceptually", "independent", "way", "requisite", "substance", "spinoza", "substance", "conceived", "whereas", "mode", "something", "else", "conceived", "something", "else", "itselfin", "something", "else", "aspect", "two", "definition", "capture", "descartes", "conception", "causal", "independence", "conceived", "itselfthrough", "something", "else", "aspect", "refers", "descartes", "conceivabilityapart", "criterion", "ontological", "independence", "descartes", "recalled", "regarded", "divine", "substance", "causally", "ontologically", "independent", "created", "substance", "ontologically", "causally", "independent", "since", "depend", "god", "creative", "conservative", "power", "existence", "sense", "descartes", "term", "substance", "used", "equivocally", "god", "created", "substance", "spinoza", "however", "denied", "substance", "equivocal", "term", "eliminated", "two", "asymmetry", "descartes", "metaphysicsthat", "divine", "created", "substance", "asymmetry", "extended", "thinking", "substance", "descartes", "express", "synopsis", "meditation", "spinoza", "finite", "mind", "substance", "rather", "mode", "thinking", "substance", "spinoza", "fundamental", "level", "mind", "reduce", "thinking", "substance", "affection", "spinoza", "account", "eternal", "verity", "mark", "similar", "rationalistic", "advance", "descartes", "metaphysics", "spinoza", "god", "substance", "simpliciter", "lack", "volition", "personality", "characteristic", "pure", "infinity", "necessity", "activity", "spinoza", "agreed", "descartes", "god", "cause", "thing", "regarded", "transeunt", "cause", "creating", "universe", "outside", "act", "immanent", "cause", "universe", "unfolds", "necessity", "spinoza", "thing", "therefore", "follow", "logical", "merely", "causal", "necessity", "god", "eternal", "infinite", "nature", "sense", "mathematical", "truth", "indeed", "apparently", "contingent", "fact", "caesar", "crossed", "rubicon", "necessary", "truth", "spinoza", "difference", "necessity", "truth", "rather", "route", "take", "arrive", "mathematical", "truth", "instance", "deducible", "reason", "alone", "spinoza", "recognized", "finitude", "human", "understanding", "prevents", "least", "impedes", "similarly", "deducing", "empirical", "fact", "world", "contrast", "empiricist", "regard", "cause", "effect", "mere", "constant", "conjunction", "spinoza", "relationship", "cause", "effect", "force", "logical", "entailment", "empirical", "fact", "necessary", "truth", "universe", "thus", "principle", "least", "perfectly", "intelligible", "reason", "spinoza", "descartes", "metaphysical", "commitment", "substance", "underwrote", "rationalist", "epistemology", "strongly", "privilege", "reason", "intuition", "sensation", "imagination", "distinctive", "character", "spinoza", "epistemological", "rationalism", "rooted", "principle", "order", "connection", "idea", "order", "connection", "thing", "descartes", "mind", "body", "though", "intimately", "connected", "radically", "heterogeneous", "mind", "come", "know", "thing", "physical", "world", "therefore", "remains", "despite", "best", "effort", "somewhat", "murky", "business", "rejecting", "substantiality", "mind", "body", "regarding", "mode", "single", "substance", "spinoza", "obviated", "difficulty", "spinoza", "mind", "body", "thing", "conceived", "two", "different", "way", "persistent", "cluster", "quality", "space", "body", "ideasor", "descartes", "terminology", "objective", "realityof", "body", "mind", "single", "body", "corresponding", "objective", "reality", "collection", "body", "characterized", "various", "relation", "also", "corresponding", "objective", "reality", "isomorphic", "part", "relation", "since", "gap", "mind", "body", "therefore", "difficulty", "principle", "perceiving", "physical", "world", "spinoza", "account", "perceive", "physical", "world", "two", "ways", "1", "perceiving", "action", "body", "2", "perceiving", "effect", "body", "thus", "one", "body", "run", "correlative", "idea", "one", "mind", "likewise", "someone", "step", "one", "toe", "physical", "effect", "toe", "likewise", "counterpart", "mind", "idea", "despite", "necessary", "connection", "mind", "body", "argued", "spinoza", "sensation", "imagination", "inherently", "limited", "idea", "substance", "qua", "substance", "must", "perfect", "unity", "however", "idea", "constitutes", "human", "mind", "complexnot", "unity", "plurality", "idea", "idea", "therefore", "confused", "rather", "clear", "distinct", "clear", "distinct", "understanding", "spinoza", "account", "must", "partake", "unity", "idea", "substance", "fragmentary", "nature", "idea", "human", "body", "affect", "cognitive", "unity", "achieved", "two", "waysthrough", "reason", "spinoza", "termed", "knowledge", "second", "kind", "intuition", "knowledge", "third", "kind", "cognize", "sensation", "imagination", "knowledge", "first", "kind", "try", "grasp", "many", "idea", "thereby", "produce", "confusion", "reason", "intuition", "contrast", "provide", "u", "access", "one", "ideathe", "substantial", "unity", "underlying", "body", "mind", "reason", "fact", "common", "notion", "adequate", "idea", "property", "thing", "intuition", "proceeds", "adequate", "idea", "formal", "essence", "certain", "attribute", "god", "understand", "substantial", "unity", "necessary", "cause", "body", "mind", "grasp", "sub", "specie", "aeternitatis", "epistemological", "ideal", "form", "core", "spinoza", "rationalistic", "ethicsand", "hence", "one", "plausible", "account", "core", "ethic", "spinoza", "monism", "entail", "sort", "individual", "aristotle", "regarded", "primary", "substance", "distinguished", "substantial", "unity", "conatustheir", "striving", "persist", "thus", "selfpreservation", "one", "possible", "goal", "ethical", "agent", "thing", "make", "agent", "individual", "essence", "ethical", "task", "thus", "active", "whereas", "contrast", "passive", "threatens", "persistence", "mind", "persists", "activity", "threatened", "passivity", "therefore", "selfinterest", "pursue", "adequate", "idea", "knowledge", "second", "third", "kind", "join", "mind", "god", "adequate", "knowledge", "thing", "form", "eternity", "le", "affected", "external", "thing", "hence", "passion", "nothing", "passivity", "face", "force", "external", "u", "adequate", "knowledge", "god", "give", "u", "equanimity", "calm", "literally", "ensures", "persistence", "ethical", "virtue", "thus", "fundamentally", "epistemological", "spinoza", "rationalist", "figure", "discussed", "good", "life", "utterly", "rational", "life", "5", "leibniz", "conway", "seen", "rationalist", "epistemology", "grounded", "metaphysical", "commitment", "substance", "concept", "substance", "allowed", "rationalist", "reduce", "complexity", "plurality", "underlying", "simplicity", "unity", "versus", "empiricist", "skepticism", "substance", "committed", "regarding", "reality", "fundamentally", "plural", "complex", "spinoza", "metaphysics", "marked", "culmination", "rationalist", "momentum", "leibniz", "last", "great", "continental", "rationalist", "see", "final", "movement", "leibniz", "like", "rationalist", "regarded", "quotidian", "thing", "phenomenon", "ultimately", "reduce", "perfectly", "simple", "substance", "however", "leibniz", "infinite", "number", "simple", "substance", "causally", "perceptually", "isolated", "others", "leibniz", "reasoned", "best", "possible", "world", "balance", "maximal", "possible", "complexity", "maximal", "possible", "order", "thus", "privileging", "neither", "unity", "plurality", "neither", "simplicity", "complexity", "striking", "balance", "purely", "rational", "principle", "leibniz", "exemplified", "complex", "comprehensive", "ultimately", "mature", "rationalism", "predecessor", "leibniz", "fundamental", "level", "reality", "characterized", "simple", "substance", "monad", "term", "leibniz", "picked", "francis", "mercury", "van", "helmont", "anne", "conway", "1696", "merchant", "1979", "since", "composite", "leibniz", "argued", "must", "simple", "substance", "together", "constitute", "composite", "simple", "monad", "neither", "part", "extension", "form", "divisibility", "leibniz", "saw", "true", "atom", "nature", "leibniz", "thus", "retained", "strong", "commitment", "substance", "resisted", "rationalism", "synechistic", "momentum", "privileged", "metaphysical", "methodological", "stance", "continuity", "universe", "rehabilitating", "substance", "aristotelian", "role", "individuator", "however", "aristotle", "bucephalus", "proper", "substance", "leibniz", "regarded", "bucephalus", "substance", "comprising", "collection", "simple", "substance", "leibniz", "agreed", "aristotle", "characterization", "substance", "grammatical", "subject", "predication", "predicable", "anything", "else", "however", "complained", "account", "go", "far", "enough", "leibniz", "essence", "substance", "lie", "fact", "subject", "predication", "fact", "every", "possible", "predicate", "may", "asserted", "denied", "way", "every", "individual", "substance", "complete", "concept", "conception", "complete", "fully", "determinate", "every", "fact", "substance", "situation", "universepast", "present", "future", "follows", "analytically", "leibniz", "insistence", "every", "individual", "substance", "complete", "concept", "entailed", "unlike", "spinoza", "regarded", "cartesian", "thinking", "substance", "cartesian", "extended", "substance", "paradigmatic", "substance", "descartes", "extended", "substance", "like", "spinozistic", "substance", "leibniz", "account", "substance", "since", "afford", "principle", "individuation", "leibniz", "argued", "whereas", "real", "substance", "complete", "concept", "cartesian", "notion", "extended", "substance", "abstraction", "arrived", "incomplete", "concept", "matter", "insufficient", "form", "constitute", "substance", "leibniz", "body", "could", "never", "candidate", "substance", "since", "body", "susceptible", "alteration", "infinitely", "divisible", "thus", "never", "arrive", "body", "said", "really", "entity", "moreover", "whereas", "cartesian", "extended", "substance", "totally", "inert", "leibniz", "insisted", "activity", "hallmark", "substance", "anything", "act", "substance", "every", "substance", "constantly", "uninterruptedly", "act", "leibniz", "position", "follows", "god", "perfection", "god", "planning", "universe", "perfect", "required", "set", "motion", "true", "substance", "entia", "per", "se", "active", "selfcausing", "leibniz", "account", "god", "would", "lack", "dignity", "sole", "cause", "universethat", "occasionalism", "interventionism", "necessary", "god", "perfect", "planning", "avoids", "necessity", "continual", "continuous", "extraordinary", "concourse", "thus", "god", "perfection", "entail", "substance", "active", "passive", "extension", "matter", "substance", "activity", "appetition", "leibniz", "regard", "characterizing", "monad", "intimately", "bound", "principle", "sufficient", "reason", "leibniz", "monad", "contains", "whole", "history", "monadic", "state", "except", "statescreation", "paradigmatic", "thesethat", "result", "divine", "causation", "sufficient", "cause", "preceding", "state", "turn", "present", "state", "sufficient", "cause", "succeeding", "state", "despite", "emphasis", "inherent", "activity", "substance", "leibniz", "like", "spinoza", "rejected", "possibility", "transeunt", "causation", "among", "substance", "monad", "windowless", "neither", "admit", "emit", "causal", "influence", "moreover", "thus", "windowless", "monad", "receive", "perception", "world", "external", "causation", "rather", "monad", "perception", "builtin", "creation", "preestablished", "harmony", "perception", "perfectly", "align", "universe", "infinite", "monadic", "state", "entail", "genuine", "transeunt", "causation", "monadic", "level", "kind", "pseudocausation", "result", "monad", "harmonized", "perception", "respective", "appetitions", "convey", "successive", "change", "leibniz", "causal", "relation", "thus", "reduce", "logical", "relation", "every", "change", "substance", "follows", "concept", "leibniz", "view", "every", "substance", "complete", "concept", "reinforces", "centrality", "reason", "epistemology", "seems", "undercut", "human", "even", "divine", "volition", "thereby", "slide", "toward", "spinozism", "every", "fact", "julius", "caesar", "indeed", "every", "fact", "universe", "rationally", "deducible", "roman", "dictator", "complete", "concept", "would", "seem", "one", "course", "universe", "possible", "however", "step", "leibniz", "willing", "take", "distinction", "contingent", "necessary", "truth", "argued", "leibniz", "fatalism", "would", "true", "human", "liberty", "would", "impossible", "leibniz", "sought", "avert", "result", "distinguishing", "hypothetical", "absolute", "necessity", "absolute", "necessity", "argued", "governed", "principle", "contradiction", "something", "absolutely", "necessary", "negation", "logically", "impossible", "hypothetical", "necessity", "hand", "describes", "state", "affair", "necessary", "ex", "hypothesithat", "case", "particular", "antecedent", "holdsbut", "logically", "necessary", "leibniz", "account", "fact", "caesar", "crossed", "rubicon", "hypothetically", "necessary", "follows", "necessarily", "existence", "individual", "substance", "caesar", "denial", "logically", "impossible", "according", "leibniz", "god", "creation", "conceived", "infinite", "array", "possible", "world", "myriad", "contingent", "fact", "world", "hypothetically", "necessary", "would", "necessary", "god", "instantiate", "world", "since", "present", "world", "one", "god", "chose", "instantiate", "contingent", "fact", "world", "certain", "however", "nonetheless", "contingent", "since", "negation", "implies", "absurdity", "logical", "impossibility", "preventing", "caesar", "deciding", "cross", "rubicon", "sense", "willand", "indeed", "human", "generallyis", "free", "leibniz", "argument", "hypothetical", "necessity", "obvious", "antecedent", "descartes", "doctrine", "created", "truth", "however", "unlike", "descartes", "leibniz", "limited", "doctrine", "scope", "contingent", "truth", "nonetheless", "hoped", "avoid", "spinozist", "necessitarianism", "whether", "succeeded", "matter", "debate", "literature", "inasmuch", "characterizes", "universe", "composed", "plurality", "individual", "existence", "none", "genuine", "causal", "efficacy", "leibniz", "position", "show", "considerable", "affinity", "hume", "empiricism", "however", "hume", "inferred", "importance", "experience", "leibniz", "instead", "took", "ontology", "preclude", "adventitious", "knowledge", "thus", "remained", "committed", "metaphysical", "ground", "doctrine", "innate", "idea", "rejection", "transeunt", "causation", "among", "substance", "leibniz", "rejected", "notion", "learn", "new", "thing", "world", "sense", "gaining", "new", "idea", "already", "exist", "soul", "leibniz", "account", "temporal", "coincidence", "certain", "phenomenon", "one", "learning", "phenomenon", "preestablished", "creation", "way", "monadic", "state", "leibniz", "admitted", "idiomatically", "acceptable", "speak", "acquiring", "knowledge", "via", "sens", "however", "regarded", "sensory", "report", "reducible", "explicable", "description", "logical", "relation", "leibniz", "theory", "knowledge", "thus", "relegates", "aristotelian", "idea", "human", "being", "blank", "slate", "learn", "induction", "mere", "façon", "de", "parler", "contrast", "strongly", "endorsed", "plato", "doctrine", "recollection", "extent", "locates", "knowledge", "idea", "already", "residing", "soul", "socrates", "exchange", "meno", "slave", "boy", "argued", "leibniz", "show", "soul", "already", "posse", "idea", "upon", "truth", "universe", "depend", "need", "reminded", "leibniz", "account", "substance", "built", "perception", "whole", "universe", "every", "substance", "argued", "mirror", "whole", "universe", "extent", "everything", "ever", "happened", "existed", "ever", "happen", "exist", "included", "complete", "concept", "perception", "substance", "maintained", "thus", "resemble", "god", "infinite", "perception", "unlimited", "scope", "respect", "clarity", "distinctness", "perception", "created", "substance", "fall", "short", "god", "leibniz", "best", "possible", "world", "world", "balance", "maximal", "possible", "complexity", "maximal", "possible", "order", "existing", "world", "satisfies", "infinite", "variety", "perspective", "taken", "monad", "principle", "order", "monad", "reflects", "world", "monad", "however", "principle", "complexity", "monad", "reflect", "world", "infinite", "number", "unique", "perspective", "infinite", "variety", "perspective", "entail", "monad", "reflects", "others", "varying", "degree", "clarity", "distinctness", "way", "universe", "replete", "infinite", "number", "different", "representation", "god", "work", "among", "god", "perception", "universally", "clear", "distinct", "complexity", "requirement", "best", "possible", "world", "would", "seem", "preclude", "principle", "possibility", "human", "being", "achieving", "knowledge", "universe", "sub", "specie", "aeternitatis", "leibniz", "made", "special", "exception", "human", "soul", "leibniz", "account", "monad", "lowlevel", "perception", "kind", "experience", "stupor", "however", "soul", "living", "thing", "feeling", "memory", "human", "soul", "besides", "divine", "election", "power", "reason", "reason", "allows", "u", "understand", "universe", "system", "use", "model", "idealization", "thereby", "grasp", "eternal", "truth", "way", "argued", "leibniz", "human", "mind", "mirror", "universe", "created", "thing", "indeed", "mirror", "god", "leibniz", "committed", "view", "given", "god", "perfection", "anything", "god", "creates", "must", "also", "perfectthis", "created", "world", "best", "possible", "world", "mean", "large", "part", "writing", "theodicean", "spirit", "leibniz", "share", "spirit", "close", "contemporary", "anne", "conway", "conway", "system", "motivated", "desire", "reject", "cartesian", "dualism", "spinozism", "hobbesian", "materialism", "view", "commitment", "existence", "material", "substance", "commitment", "existence", "dead", "mass", "view", "gravely", "mistaken", "hold", "nature", "shot", "vital", "principle", "motion", "life", "perception", "quality", "befitting", "creation", "god", "chapter", "ix", "section", "2", "conway", "thus", "reject", "descartes", "dualism", "nevertheless", "noting", "accepts", "immateriality", "god", "least", "better", "hobbes", "hold", "god", "material", "finally", "register", "disagreement", "spinoza", "monism", "effaces", "distinction", "god", "creature", "chapter", "ix", "section", "3", "avoid", "problem", "identifies", "descartes", "hobbes", "conway", "asserts", "monism", "creature", "composed", "one", "kind", "substancespiritual", "avoid", "problem", "associate", "spinoza", "conway", "asserts", "one", "spiritual", "substance", "exists", "universe", "divided", "three", "specie", "differ", "essence", "creature", "christ", "god", "tripartite", "separation", "grounded", "basis", "changeability", "member", "specie", "essential", "feature", "creature", "change", "better", "worse", "essential", "feature", "christ", "change", "better", "god", "essence", "unchanging", "chapter", "vi", "section", "4", "postulating", "three", "specie", "one", "substance", "conway", "able", "assert", "god", "separation", "creation", "well", "metaphysically", "morally", "mediating", "role", "christ", "mediating", "role", "christ", "central", "importance", "conway", "theodicy", "view", "accepting", "tripartite", "division", "specie", "contribute", "greatly", "propagation", "true", "faith", "christian", "religion", "among", "jew", "turk", "infidel", "nation", "chapter", "vi", "section", "5", "appreciate", "reasoning", "favor", "mediator", "creature", "god", "accept", "reasoning", "believe", "christ", "whether", "call", "mediator", "name", "way", "conway", "answer", "particularly", "difficult", "challenge", "christian", "thinker", "christianity", "universal", "religion", "salvation", "depends", "knowing", "christ", "much", "earth", "population", "ignorant", "christ", "system", "assert", "many", "people", "may", "know", "christ", "mediator", "without", "knowing", "name", "even", "role", "christian", "religion", "rise", "british", "empiricism", "kant", "critical", "philosophy", "marked", "end", "continental", "rationalism", "movement", "elegant", "vision", "leibniz", "conway", "fitting", "paean", "movement", "indeed", "power", "human", "reason", "6", "beyond", "continental", "rationalism", "voice", "since", "early", "twentieth", "century", "continental", "rationalism", "profitably", "juxtaposed", "british", "empiricism", "juxtaposition", "turn", "notion", "rationalist", "view", "popular", "continent", "contemporaneous", "empiricist", "view", "dominated", "philosophical", "conversation", "britain", "demarcation", "rationalism", "empiricism", "may", "useful", "interpretive", "pedagogical", "tool", "borne", "mind", "construction", "retrospect", "distinction", "empirici", "dogmatici", "traceable", "ancient", "roman", "medicine", "baconian", "roger", "francis", "philosophy", "science", "kant", "early", "commentator", "imported", "distinction", "philosophy", "terminology", "rationalism", "empiricism", "association", "term", "respectively", "continent", "britain", "emerged", "end", "nineteenth", "century", "aaron", "wilson", "1620", "recent", "year", "scholar", "problematized", "general", "rationalistempiricist", "distinction", "continental", "rationalism", "british", "empiricism", "divide", "norton", "shown", "british", "british", "empiricism", "called", "question", "take", "notice", "important", "role", "played", "french", "philosopher", "pierre", "gassendi", "propagation", "empiricist", "thinking", "period", "norton", "1981", "indeed", "british", "philosopher", "relevant", "historical", "period", "far", "le", "disconnected", "continent", "today", "philosophical", "crossing", "britain", "frequent", "fruitful", "particular", "locke", "berkeley", "hume", "crossed", "channel", "loeb", "1981", "argues", "plausibility", "rationalistempiricist", "divide", "neglect", "strong", "rationalist", "strand", "locke", "berkeley", "thought", "increasingly", "scholar", "early", "modern", "period", "recall", "goldstone", "critique", "early", "modernity", "periodization", "looking", "outside", "bound", "rationalistempiricist", "distinction", "order", "accurately", "capture", "intersection", "divergence", "present", "constellation", "idea", "period", "indeed", "problematizing", "distinction", "continental", "rationalism", "british", "empiricism", "offer", "benefit", "beyond", "possibility", "greater", "interpretative", "nuance", "accuracy", "earlier", "section", "entry", "troubled", "association", "rationalism", "continent", "considering", "british", "philosopher", "margaret", "cavendish", "anne", "conway", "alongside", "malebranche", "leibniz", "ghanaian", "philosopher", "anton", "amo", "alongside", "descartes", "focus", "seventeenth", "eighteenth", "century", "rationalist", "broadly", "conceived", "opposed", "continental", "rationalist", "particular", "make", "possible", "inclusion", "conversation", "figuresnotably", "woman", "noneuropeanswho", "live", "continent", "mark", "node", "influence", "importance", "rationalist", "thought", "thus", "additional", "strong", "motivation", "call", "distinction", "question", "effort", "include", "voice", "period", "consider", "two", "final", "rationalist", "woman", "philosopher", "britain", "brief", "digression", "order", "degree", "rationalism", "permitted", "philosophical", "participation", "woman", "lesser", "extent", "racialized", "others", "familiar", "trope", "rationalism", "excludes", "woman", "genevieve", "lloyd", "famously", "argues", "descartes", "reconceptualization", "reason", "attainment", "attainment", "achieved", "pure", "mind", "uncorrupted", "sensuality", "society", "unintentionally", "significantly", "excludes", "womenwhose", "domestic", "role", "inevitably", "involved", "sensual", "social", "lloyd", "19841993", "4051", "susan", "bordo", "characterizes", "cartesian", "objectivism", "mechanism", "flight", "female", "cosmos", "feminine", "orientation", "towards", "world", "bordo", "1987", "100", "emphasis", "original", "whether", "rationalism", "constitutively", "excludes", "woman", "clear", "individual", "rationalist", "see", "instance", "hasana", "sharp", "argument", "spinoza", "see", "better", "worse", "assertion", "political", "treatise", "woman", "naturally", "unequal", "men", "sharp", "2012", "characterization", "rationalism", "excluding", "woman", "margaret", "atherton", "draw", "mary", "astell", "damaris", "lady", "masham", "argue", "fact", "rationalism", "offered", "framework", "woman", "one", "presumes", "member", "noneuropean", "culture", "could", "philosophy", "prescribing", "method", "reasoning", "hinge", "particular", "education", "social", "standing", "argues", "atherton", "astell", "rationalism", "reconceptualizes", "reason", "principle", "possible", "humansman", "woman", "plowman", "doctor", "atherton", "32", "erica", "harth", "trace", "history", "sixteenth", "seventeenth", "century", "french", "salon", "woman", "offer", "evidence", "descartes", "clear", "jargonfree", "french", "commitment", "intelligible", "lay", "people", "made", "cartesianism", "appealing", "woman", "regularly", "participated", "philosophical", "salon", "harth", "reconstructs", "thought", "prominent", "salon", "woman", "show", "extend", "cartesianism", "novel", "way", "harth", "1991", "however", "note", "come", "u", "french", "cartesianism", "day", "originated", "maleonly", "academy", "salon", "whatever", "remaining", "legacy", "cartesian", "woman", "france", "astell", "remains", "important", "interpreter", "proponent", "descartes", "epistemological", "method", "method", "explicitly", "endorses", "basis", "supporting", "education", "philosophical", "inquiry", "woman", "twopart", "1694", "1697", "serious", "proposal", "lady", "wherein", "method", "offer", "improvement", "mind", "astell", "urge", "meditation", "descartes", "sense", "term", "avail", "apply", "dedication", "admits", "woman", "labourer", "instance", "whose", "circumstance", "permit", "contemplate", "truth", "may", "first", "find", "contemplation", "unfruitful", "however", "proposes", "reading", "discoursing", "serious", "meditation", "remedy", "situation", "astell", "reject", "view", "people", "embodiment", "make", "suited", "practical", "intellectual", "pursuit", "acknowledges", "reasoner", "animal", "spirit", "may", "incline", "volatility", "thought", "therefore", "counsel", "reasoner", "withdraw", "mind", "body", "material", "world", "alice", "sowaal", "identifies", "astell", "three", "central", "rationalist", "theme", "emphasis", "mind", "body", "theory", "innate", "idea", "origin", "knowledge", "methodology", "lead", "novice", "confusion", "clarity", "sowaal", "astell", "bolster", "cartesian", "method", "theological", "argument", "god", "would", "create", "naturally", "defective", "rational", "being", "hence", "human", "being", "capable", "rational", "thought", "woman", "first", "unable", "reason", "well", "result", "circumstance", "nature", "argues", "astell", "thus", "draw", "descartes", "anticipates", "wollstonecraft", "relaxing", "criterion", "inclusion", "rationalist", "camp", "also", "invite", "u", "appropriately", "situate", "rationalism", "scottish", "philosopher", "mary", "shepherd", "shepherd", "sharp", "critic", "hume", "endorsement", "causal", "system", "might", "call", "malebranche", "without", "god", "shepherd", "raised", "objection", "hume", "theory", "basis", "commitment", "superiority", "reason", "knowledge", "particular", "knowledge", "truth", "causation", "see", "share", "least", "one", "characteristic", "typically", "ascribed", "rationalist", "exaltation", "reason", "sens", "knowledge", "acquisition", "essay", "upon", "relation", "cause", "effect", "1824", "shepherd", "seek", "dismantle", "hume", "causal", "theory", "constant", "conjunction", "arguing", "indeed", "intuitive", "knowledge", "everything", "exists", "requires", "cause", "moreover", "view", "reason", "custom", "habit", "chief", "guide", "understanding", "daily", "life", "2728", "shepherd", "critique", "hume", "important", "right", "valuable", "contribution", "philosophical", "conversation", "age", "also", "however", "representative", "way", "rationalist", "perspective", "articulated", "first", "quarter", "19th", "century", "mark", "moment", "history", "rationalism", "putting", "shepherd", "conversation", "fellow", "rationalist", "across", "time", "serf", "deepen", "broaden", "understanding", "line", "thinking", "sum", "notion", "continental", "rationalism", "useful", "heuristic", "especially", "teaching", "learning", "ought", "strict", "criterion", "le", "restrictive", "conception", "rationalism", "support", "historically", "accurate", "nuanced", "understanding", "philosophical", "movement", "period", "also", "render", "rationalist", "canon", "diverse", "historian", "philosophy", "increasingly", "work", "develop", "inclusive", "canon", "reconceptualization", "good"]}