{"url": "deleuze", "title": "Gilles Deleuze", "authorship": {"year": "Copyright © 2022", "author_text": "Daniel Smith\n<smith132@purdue.edu>\nJohn Protevi\n\nDaniela Voss\n<vossda@uni-hildesheim.de>", "author_links": [{"http://www.cla.purdue.edu/philosophy/directory/?personid=129": "Daniel Smith"}, {"mailto:smith132%40purdue%2eedu": "smith132@purdue.edu"}, {"mailto:vossda%40uni-hildesheim%2ede": "vossda@uni-hildesheim.de"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.cla.purdue.edu/philosophy/directory/?personid=129\" target=\"other\">Daniel Smith</a>\n&lt;<a href=\"mailto:smith132%40purdue%2eedu\"><em>smith132<abbr title=\" at \">@</abbr>purdue<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nJohn Protevi\n<br/>\nDaniela Voss\n&lt;<a href=\"mailto:vossda%40uni-hildesheim%2ede\"><em>vossda<abbr title=\" at \">@</abbr>uni-hildesheim<abbr title=\" dot \">.</abbr>de</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Fri May 23, 2008", "substantive revision Fri Jun 3, 2022"], "preamble": "\n\nGilles Deleuze (January 18, 1925–November 4, 1995) was one of\nthe most influential and prolific French philosophers of the second\nhalf of the twentieth century. Deleuze conceived of philosophy as the\nproduction of concepts, and he characterized himself as a “pure\nmetaphysician.” In his magnum opus Difference and\nRepetition, he tries to develop a metaphysics adequate to\ncontemporary mathematics and science—a metaphysics in which the\nconcept of multiplicity replaces that of substance, event replaces\nessence and virtuality replaces possibility. Deleuze also produced\nstudies in the history of philosophy (on Hume, Nietzsche, Kant,\nBergson, Spinoza, Foucault, and Leibniz), and on the arts (a\ntwo-volume study of the cinema, books on Proust and Sacher-Masoch, a\nwork on the painter Francis Bacon, and a collection of essays on\nliterature.) Deleuze considered these latter works as pure philosophy,\nand not criticism, since he sought to create the concepts that\ncorrespond to the artistic practices of painters, filmmakers, and\nwriters. In 1968, he met Félix Guattari, a political activist\nand radical psychoanalyst, with whom he wrote several works, among\nthem the two-volume Capitalism and Schizophrenia, comprised\nof Anti-Oedipus (1972) and A Thousand Plateaus\n(1980). Their final collaboration was What is Philosophy?\n(1991).\n\nDeleuze is noteworthy for his rejection of the Heideggerian notion of\nthe “end of metaphysics.” In an interview, he once offered\nthis self-assessment: “I feel myself to be a pure\nmetaphysician.... Bergson says that modern science hasn’t found\nits metaphysics, the metaphysics it would need. It is this metaphysics\nthat interests me.” (Villani 1999: 130) We should also point to\nthe extent of his non-philosophical references (inter alia,\ndifferential calculus, thermodynamics, geology, molecular biology,\npopulation genetics, ethology, embryology, anthropology,\npsychoanalysis, economics, linguistics, and even esoteric thought);\nhis colleague Jean-François Lyotard spoke of him as a\n“library of Babel.” Deleuze’s influence reaches\nbeyond philosophy; his work is approvingly cited by, and his concepts\nput to use by, researchers in architecture, urban studies, geography,\nfilm studies, musicology, anthropology, gender studies, literary\nstudies and other fields.\n\nDeleuze meant for his style to keep readers on their toes, or even to\n“force” them to rethink their philosophical assumptions.\n(We will discuss this notion of being “forced” to think\nbelow in 3.1.) We will concentrate on the conceptual architecture of\nhis thought, though readers should be aware that, perhaps more than\nwith most philosophers, such a treatment of Deleuze’s work\nremoves much of the performative effect of reading the original.\n", "toc": [{"#LifeWork": "1. Life and Works"}, {"#DeleReadOthePhil": "2. Deleuze’s Readings of Other Philosophers"}, {"#PhilDiff": "3. The Philosophy of Difference"}, {"#DiffRepe": "3.1 Difference and Repetition"}, {"#LogiSens": "3.2 Logic of Sense"}, {"#CollGuat": "4. Collaboration with Guattari"}, {"#AntiOedi": "4.1 Anti-Oedipus"}, {"#ThouPlat": "4.2 A Thousand Plateaus"}, {"#WhatPhil": "4.3 What is Philosophy?"}, {"#DeleArts": "5. Deleuze and the Arts"}, {"#ReceDele": "6. The Reception of Deleuze"}, {"#FemiCrit": "6.1 The feminist critique"}, {"#BadiCrit": "6.2 The Badiouan critique"}, {"#DeleScie": "6.3 Deleuze and science"}, {"#DeleEffe": "6.4 Deleuze Effects"}, {"#Bib": "Bibliography"}, {"#PrimLite": "Primary Literature"}, {"#SecoLite": "Secondary Literature"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Life and Works\n\nDeleuze was born in Paris to conservative, middle-class parents, who\nsent him to public schools for his elementary education; except for\none year of school in Normandy during the Occupation, he lived in the\nsame section of Paris his entire life. His personal life was\nunremarkable; he remained married to the same woman he wed at age 31,\nFanny (Denise Paul) Grandjouan, a French translator of D. H. Lawrence,\nand raised two children with her. He rarely traveled abroad, although\nhe did take a trip to the United States in 1975; for the most part he\nminimized his attendance at academic conferences and colloquia,\ninsisting that the activity of thought took place primarily in\nwriting, and not in dialogue and discussion. The most dramatic event\nin his life occurred early, when, during the Occupation,\nDeleuze’s older brother was arrested by the Nazis for resistance\nactivities and deported; he died on the train to Auschwitz.\n\nWhen the Germans began their occupation of France in June 1940,\nDeleuze’s family was on vacation in Normandy, and he spent a\nyear being schooled there. Deleuze traced his initiation into\nliterature and philosophy to his encounter with a teacher at Deauville\nnamed Pierre Halbwachs (son of the sociologist Maurice Halbwachs), who\nintroduced him to writers such as Gide and Baudelaire. Early on, he\nrecalled, philosophical concepts struck him with the same force as\nliterary characters, having their own autonomy and style. After the\nLiberation, Deleuze returned to Paris and undertook his\nkhâgne (an intensive year of preparatory studies) at\nthe well-known Lycée Henri IV, and then studied the history of\nphilosophy at the Sorbonne. He was taught by Jean Hippolyte and\nFerdinand Alquié, whom he “loved and admired\nenormously,” as well as by Georges Canguilhem and Maurice de\nGandillac. Like many of his peers he was as influenced by the writings\nof Jean-Paul Sartre as he was by the work of his academic mentors.\n\nDeleuze’s historically oriented study at the Sorbonne led him to\ndevote his first book, Empiricism and Subjectivity (1953), to\nHume. In an era in which peers like Foucault and Derrida, students at\nthe École Normale Supérieure, concentrated on “the\nthree ‘H’s” (Hegel, Husserl, Heidegger),\nDeleuze’s decision to write on empiricism and Hume was already a\nprovocation, early evidence of the heterodox tendencies of his\nthought. From 1953 to 1962—which he later referred to as\n“a hole in my life”—Deleuze published little, moving\namong various teaching positions in Paris and the provinces. It was\nalso during this time that he contracted the recurring respiratory\nailment that would plague him for the rest of his life. In 1962,\nNietzsche and Philosophy was published to considerable\nacclaim, cementing Deleuze’s reputation in academic circles. He\nfollowed this initial success with Kant’s Critical\nPhilosophy (1963); Proust and Signs (1964); and\nBergsonism (1966). In 1968 he published Difference and\nRepetition as his primary thesis for the doctorat\nd’État, with Spinoza and the Problem of\nExpression as the secondary thesis.\n\nThe next year, 1969, proved to be an important one for Deleuze. First,\nhe found a permanent teaching position in Paris, at the experimental\ncampus of the University of Paris VIII in Vincennes (which later moved\nto its current location in St. Denis); he gave weekly seminars at this\ninstitution until his retirement in 1987. Second, he published another\nmajor text in his own name, Logic of Sense. But most\nimportantly, it was then that he met Félix Guattari, a radical\npsychoanalyst and political militant, with whom he began a long\ncollaboration. Their first joint volume, Anti-Oedipus (1972),\nwas a best seller in France, a veritable succès de\nscandale, and thrust Deleuze into the limelight as a public\nintellectual. They followed this with Kafka: Toward a Minor\nLiterature (1975), and then a book which, at least in the eyes of\nsome, rivals Difference and Repetition for the title of\nDeleuze’s masterwork, A Thousand Plateaus (1980).\n\nThe 1980s were a decade of independent works for Deleuze: Francis\nBacon: Logic of Sensation (1981); Cinema I: The\nMovement-Image (1983); Cinema II: The Time-Image (1985);\nFoucault (1986); and The Fold: Leibniz and the\nBaroque (1988). He then resumed his collaboration with Guattari\nfor their final joint work, What is Philosophy? (1991). His\nfinal years were spent in very ill health, although he did manage to\npublish a remarkable short essay, “Immanence: A Life” in\n1995, before taking his own life on November 4, 1995.\n2. Deleuze’s Readings of Other Philosophers\n\nBefore he ever wrote “in his own name” in Difference\nand Repetition and Logic of Sense, Deleuze wrote a\nseries of works on figures in the history of philosophy (Hume,\nBergson, Nietzsche, Kant, and Spinoza). In writing these works,\nDeleuze sought to unearth the presuppositions he absorbed in his\neducation; chief among them, he felt, was a deep-seated privilege of\nidentity over difference. Deleuze thus set about trying to accelerate\nhowever he could a departure from Hegel, whom he saw as emblematic of\nthat privilege. Deleuze attacks Hegel and others in what we can\ncall—though Deleuze did not—the “identitarian”\ntradition first of all by means of a radicalized reading of Kant,\nwhose genius, as Deleuze explains in Kant’s Critical\nPhilosophy (1963), was to have conceived of a purely\nimmanent critique of reason—a critique that did not\nseek “errors” of reason produced by external causes, but\nrather “illusions” that arise from within reason itself by\nthe illegitimate (transcendent) uses of the syntheses of\nconsciousness. Deleuze characterized his own work as a philosophy of\nimmanence, arguing that Kant himself had failed to realize fully the\nambitions of his critique, for at least two reasons: first, the\nfailure to pursue a fully immanent critique, and second, the failure\nto propose a genetic account of real experience, resting content with\nthe account of the conditions of possible experience.\n\nFirst, Kant made the field of consciousness immanent to a\ntranscendental subject, thereby reintroducing an element of identity\nthat is transcendent (that is, external) to the field itself, and\nreserving all power of synthesis (that is, identity-formation) in the\nfield to the activity of the always already unified and transcendent\nsubject. (Deleuze was influenced in this regard by his reading of\nSartre’s 1937 essay “The Transcendence of the Ego.”)\nAlready in his Hume book, Empiricism and Subjectivity (1953),\nDeleuze had pointed to an empiricist reversal of Kant. Where\nKant’s question had been “How can the given be given to a\nsubject?” Hume’s question had been “How is the\nsubject (human nature) constituted within the given?” In his\nmature work, Deleuze argues for an “impersonal and\npre-individual” transcendental field in which the subject as\nidentity pole which produces empirical identities by active synthesis\nis itself the result or product of differential passive\nsyntheses (for instance, in what Deleuze calls the syntheses of\nhabit, we find bodily, desiring, and unconscious\n“contractions” which unify a series of experiences,\nextracting that which is to be retained in the habit and allowing the\nrest to be “forgotten”). Together the passive syntheses at\nall these levels form a differential field within which subject\nformation takes place as an integration or resolution of that field;\nin other words, subjects are roughly speaking the patterns of these\nmultiple and serial syntheses which fold in on themselves producing a\nsite of self-awareness. Of course, Deleuze never simply proclaims this\nas a bald thesis, but develops a genetic account of subjectivity in\nmany of his books. Taking all this into account, Deleuze summarized\nhis differential, immanent and genetic position by the at first glance\nodd phrase of “transcendental empiricism.” This is cashed\nout in terms of two characteristics: (1) the abstract (e.g.,\n“subject,” “object,” “State,” the\n“whole,” and so on) does not explain, but must itself be\nexplained; and (2) the aim of philosophy is not to rediscover the\neternal or the universal, but to find the singular conditions under\nwhich something new is produced. In other words—and this is a\npragmatic perspective from which Deleuze never\ndeviated—philosophy aims not at stating the conditions of\nknowledge qua representation, but at finding and fostering the\nconditions of creative production.\n\nDeleuze’s second criticism of Kant claims that he had simply\npresumed the existence of knowledge and morality as\n“facts” and then sought their conditions of possibility in\nthe transcendental. But already in 1789, Salomon Maimon, whose early\ncritiques of Kant helped generate the post-Kantian tradition, had\nargued that Kant’s critical project required a method of\ngenesis—and not merely a method of conditioning—that would\naccount for the production of knowledge, morality, and indeed reason\nitself. In other words, Maimon called for a genetic method that would\nbe able to reach the conditions of real and not merely possible\nexperience. Maimon found a solution to this problem in a principle of\ndifference: whereas identity is the condition of possibility of\nthought in general, it is difference that constitutes the genetic and\nproductive principle of real thought.\n\nThese two Maimonian exigencies—the search for the genetic\nconditions of real experience and the positing of a principle\nof difference—appear in almost every one of Deleuze’s\nearly monographs. Nietzsche and Philosophy (1962), for\ninstance, suggests that Nietzsche completed and inverted Kantianism by\nbringing critique to bear, not simply on false claims to knowledge or\nmorality, but on true knowledge and true morality, and indeed on truth\nitself: “genealogy” constituted Nietzsche’s genetic\nmethod, and the will-to-power was his principle of difference.\nDeleuze’s anti-Hegelianism is shown in his focus on the\nproductivity of the non-dialectical (“affirmative”)\ndifferential forces termed by Nietzsche “noble.” These\nforces affirm themselves, and thereby differentiate themselves first,\nand only secondarily consider that from which they have differentiated\nthemselves.\n\nIn Bergsonism (1966), Deleuze develops the ideas of\nvirtuality and multiplicity that will serve as the backbone of his\nlater work. From Maimon’s reading of Kant, we know that Deleuze\nneeds to substitute the notion of the condition of the genesis of the\nreal for the notion of conditions of possibility of representational\nknowledge. The positive name for that genetic condition is the\nvirtual, which Deleuze adopts from the following Bergsonian argument.\nThe notion of the possible, Bergson holds in Creative\nEvolution, is derived from a false problem that confuses the\n“more” with the “less” and ignores differences\nin kind; there is not less but more in the idea of the possible than\nin the real, just as there is more in the idea of nonbeing than in\nthat of being, or more in the idea of disorder than in that of order.\nWhen we think of the possible as somehow “pre-existing”\nthe real, we think of the real, then we add to it the negation of its\nexistence, and then we project the “image” of the possible\ninto the past. We then reverse the procedure and think of the real as\nsomething more than possible, that is, as the possible with existence\nadded to it. We then say that the possible has been\n“realized” in the real. By contrast, Deleuze will reject\nthe notion of the possible in favor of that of the virtual. Rather\nthan awaiting realization, the virtual is fully real; what happens in\ngenesis is that the virtual is actualized.\n\nThe fundamental characteristic of the virtual, that which means it\nmust be actualized rather than realized, is its differential makeup.\nDeleuze always held the critical axiom that the ground cannot resemble\nthat which it grounds; he constantly critiques the\n“tracing” operation by which identities in real experience\nare said to be conditioned by identities in the transcendental. For\ninstance, Deleuze criticizes Kant for copying the transcendental field\nin the image of the empirical field. That is, empirical experience is\npersonal, identitarian and centripetal; there is a central focus, the\nsubject, in which all our experiences are tagged as belonging to us.\nKant says this empirical identity is only possible if we can posit the\nTranscendental Unity of Apperception, that is, the possibility of\nadding “I think” to all our judgments. Instead of this\nsmuggled-in or “traced” identity, Deleuze will want to\nhave the transcendental field be differential. Deleuze still wants to\nwork back from experience, but since the condition cannot resemble the\nconditioned, and since the empirical is personal and individuated, the\ntranscendental must be impersonal and pre-individual. The virtual is\nthe condition for real experience, but it has no identity; identities\nof the subject and the object are products of processes that resolve,\nintegrate, or actualize (the three terms are synonymous for Deleuze) a\ndifferential field. The Deleuzean virtual is thus not the condition of\npossibility of any rational experience, but the condition of genesis\nof real experience.\n\nAs we have seen, the virtual, as genetic ground of the actual, cannot\nresemble that which it grounds; thus, if we are confronted with actual\nidentities in experience, then the virtual ground of those identities\nmust be purely differential. Deleuze adopts “multiplicity”\nfrom Bergson as the name for such a purely differential field. In this\nusage, Deleuze later clarifies, “multiplicity” designates\nthe multiple as a substantive, rather than as a predicate. The\nmultiple as predicate generates a set of philosophical problems under\nthe rubric of “the one and the many” (a thing is one or\nmultiple, one and multiple, and so on). With multiplicity, or the\nmultiple as substantive, the question of the relation between the\npredicates one/multiple is replaced by the question of distinguishing\ntypes of multiplicities (as with Bergson’s distinction of\nqualitative and quantitative multiplicities in Time and Free\nWill). A typological difference between substantive\nmultiplicities, in short, is substituted for the dialectical\nopposition of the one and the multiple.\n\nIn sum, then, against the “major” post-Kantian tradition\nof Fichte, Schelling, and Hegel, Deleuze in effect posited his own\n“minor” post-Kantian trio of Maimon, Nietzsche, and\nBergson. To these he added a trio of pre-Kantians, Spinoza, Leibniz\nand Hume, but read through a post-Kantian lens.\n\nWe have already touched on Deleuze’s reading of Hume. Let us now\nturn to Spinoza, for whom Deleuze’s admiration was seemingly\nlimitless; for Deleuze, Spinoza was the “prince” or even\nthe “Christ” of philosophers. There are many Spinozist\ninheritances in Deleuze, but one of the most important is certainly\nthe notion of univocity in ontology. Univocity—as opposed to its\ngreat rivals, equivocity and analogy—is the key to developing a\n“philosophy of difference” (Deleuze’s term for his\nproject in Difference and Repetition), in which difference\nwould no longer be subordinated to identity. The result is a Spinozism\nminus substance, a purely modal or differential universe. In\nunivocity, as Deleuze reads Spinoza, being is said in a single sense\nof all of which it is said, but it is said of difference itself. What\nis that difference? Difference is difference in degrees of\n“power”; in interpreting this term we must distinguish the\ntwo French words puissance and pouvoir. In social\nterms, puissance is immanent power, power to act rather than\npower to dominate another; we could say that puissance is\npraxis (in which equals clash or act together) rather than\npoiesis (in which others are matter to be formed by the\ncommand of a superior, a sense of transcendent power that matches what\npouvoir indicates for Deleuze). In the most general terms\nDeleuze develops throughout his career, puissance is the\nability to affect and to be affected, to form assemblages or\nconsistencies, that is, to form emergent unities that nonetheless\nrespect the heterogeneity of their components.\n\nThe final important figure in Deleuze’s readings of other\nphilosophers is Leibniz, to whom, it must be recalled, Maimon appealed\nin his criticism of Kant. In 1988, Deleuze published a book on Leibniz\nentitled The Fold: Leibniz and the Baroque, which added new\nelements to the reading of Leibniz that appeared in Deleuze’s\nearlier books: an interpretation centered on the concept of the fold,\na development of a concept of the Baroque, and an attempt to define a\nneo-Leibnizianism in terms of contemporary artistic and scientific\npractices. While The Fold is a fascinating work, we will\nconcentrate here on Deleuze’s early reading of Leibniz, which\nplays an important role in Difference and Repetition.\n\nDeleuze pushes Leibniz’s thought to a point where Leibniz could\nnever have taken it, given his theological presuppositions. This is\nthe point where one begins to consider the virtual domain on its own\naccount, freed from its actualization in a world and its individuals.\nOn this score, Deleuze often likes to cite Jorge Luis Borges’s\nfamous story, “The Garden of the Forking Paths,” in which\nsuch a virtual world is described in the labyrinthine book of a\nChinese philosopher named Ts’ui Pên: “In all\nfiction, when a man is faced with alternatives, he chooses one at the\nexpense of others. In the almost unfathomable Ts’ui Pên,\nhe chooses—simultaneously—all of them… In\nTs’ui Pên’s work, all the possible solutions occur,\neach one being the point of departure for other bifurcations.”\nLeibniz had in fact given a similar presentation of the world at the\nconclusion of the Theodicy.\n\nIn Deleuze’s transformation of the Leibnizian / Borgesian image,\nthe three Kantian transcendent Ideas of God, World, and Self all take\non a completely different demeanor. First, God is no longer a Being\nwho compares and chooses the richest compossible world; he has now\nbecome a pure Process that affirms incompossibilities and passes\nthrough them.\n\nSecond, the world is no longer a continuous world defined by its\npre-established harmony; instead, divergences, bifurcations, and\nincompossibles must now be seen to belong to one and the same\nuniverse, a chaotic universe in which divergent series trace endlessly\nbifurcating paths, and give rise to violent discords and dissonances\nthat are never resolved into a harmonic tonality: a\n“chaosmos,” as Deleuze puts it (borrowing a word from\nJoyce) and no longer a world. In contrast, Leibniz could only save the\n“harmony” of this world by relegating discordances and\ndisharmonies to other possible worlds—this was his theological\nsleight of hand.\n\nThird, selves or individuals, rather than being closed upon the\ncompossible and convergent world they express from within, are now\ntorn open, and kept open through the divergent series and\nincompossible ensembles that continually pull them outside themselves.\nThe “monadic” subject, as Deleuze puts it, becomes the\n“nomadic” subject. In other words, if Deleuze is\nLeibnizian, it is only by eliminating the idea of a God who chooses\nthe best of all possible worlds, with its pre-established harmony and\nwell-established selves; in Deleuze, incompossibilities and\ndissonances belong to one and the same world, the only world, our\nworld. But they belong to our world as its virtual register;\ndeveloping the thought of the virtual is one of the great challenges\nof Deleuze’s masterpiece, Difference and Repetition, to\nwhich we now turn.\n3. The Philosophy of Difference\n3.1 Difference and Repetition\n\nDeleuze’s historical monographs were, in a sense, preliminary\nsketches for the great canvas of Difference and Repetition\n(1968), which marshaled these resources from the history of philosophy\nin an ambitious project to construct a “philosophy of\ndifference.” Following Maimon’s critique, Difference\nand Repetition produces a two-fold shift from the Kantian project\nof providing the universal and necessary conditions for possible\nexperience. First, rather than seeking the conditions for\npossible experience, Deleuze wants to provide an account of\nthe genesis of real experience, that is, the experience of\nthis concretely existing individual here and now. Second, to respect\nthe demands of the philosophy of difference, the genetic principle\nmust itself be a differential principle.\n\nHowever, despite these departures, Deleuze maintains a crucial\nalignment with Kant; Difference and Repetition is still a\ntranscendental approach. Here we should remind ourselves that the\nterms “transcendent” and “transcendental” have\nopposing significations. Transcendental philosophy in fact critiques\nthe pretensions of other philosophies to transcend experience by\nproviding strict criteria for the use of syntheses immanent to\nexperience. On this score, at least, Deleuze aligns himself with\nKant’s critical philosophy.\n\nThree further preliminary notes are in order here. First, as we will\ndiscuss in section 4 below, the Capitalism and Schizophrenia\nproject of Deleuze and Guattari will bring to the fore naturalist\ntendencies that are only implicitly present in the still-Kantian\nframework of Difference and Repetition. So, although there is\nsome risk of reading backwards in this formulation, we can say that\nthe “of” in the phrase “the experience of this\nconcretely existing individual here and now” is both subjective\nand objective. It is the experience by human subjects of this\nindividual object in front of it, and it is the experience enjoyed by\nthe concretely existing individual itself, even when that individual\nis non-human or even non-living. (Deleuze’s panpsychism is\ntreated briefly in Protevi 2011.) Second, then, in the demand for\ngenetic principles to account for the real experience of concrete\nindividuals, Deleuze is working in the tradition of the Principle of\nSufficient Reason. Third, the notion of “genesis” is\nitself double; in Chapter 3, Deleuze lays out a dynamic genesis that\nmoves from an encounter with intensity in sensation to the thinking of\nvirtual Ideas, while Chapters 4 and 5 lay out a static genesis that\nmoves from the virtual Idea through an intensive individuation process\nto an actual entity.\n\nWe are now ready to discuss the book itself. Murphy 1992 suggests that\nthe first part of the book (the Introduction and Chapters 1 and 2)\nconstitutes Deleuze’s treatment of the history of philosophy,\nwhile in the second part of the book (Chapters 4 and 5) Deleuze is\ndoing philosophy in his own name. From this point of view, Chapter 3,\non the “image of thought,” plays a pivotal role, leading\nus into Deleuze’s own philosophy. This transitional role of\nChapter 3 is confirmed elsewhere when Deleuze says that the study of\nthe image of thought is the “prolegomena to philosophy”\n(Negotiations, 149).\n\nIn Chapters 1 and 2, to find a differential genetic principle, Deleuze\nworks through the history of philosophy to isolate the concepts of\n“difference in itself” and “repetition for\nitself” that the assumptions of previous philosophies had\nprevented from being formulated. “Difference in itself” is\ndifference that is freed from identities seen as metaphysically\nprimary. Normally, difference is conceived of as an empirical relation\nbetween two terms which each has a prior identity of its own (“x\nis different from y”). Deleuze inverts this priority: identity\npersists, but is now a something produced by a prior relation between\ndifferentials (dx rather than not-x). Difference is no longer\nan empirical relation but becomes a transcendental principle that\nconstitutes the sufficient reason of empirical diversity (for example,\nit is the difference of electrical potential between cloud and ground\nthat constitutes the sufficient reason of the phenomenon of\nlightning).\n\nIn Chapter 2, the concept of “repetition for itself” is\nproduced as repetition that is freed from being repetition of an\noriginal self-identical thing so that it can be the repetition of\ndifference. Following the formula of Deleuze’s reading of\nNietzsche’s eternal return, repetition is the return of the\ndifferential genetic condition of real experience each time there is\nan individuation of a concrete entity. Ultimately, then,\nDifference and Repetition will show that the individuation of\nentities is produced by the actualization, integration, or resolution\n(the terms are synonymous for Deleuze) of a differentiated virtual\nfield of Ideas or “multiplicities” that are themselves\nchanged, via “counter-effectuation,” in each individuating\nevent.\n\nChapter 3 lays out 8 postulates of the “dogmatic image of\nthought.” Between the first four and last four postulates we\nfind a theory of the faculties, which is thus at the crossroads of\nboth the chapter and the book.\n\nLet us take up the first four postulates. The first postulate concerns\nour supposed natural disposition to think; the denial of this is what\nnecessitates our being forced to think. The second and third\npostulates concern subjective and objective unity. Subjective unity is\ncaptured by the notion of “common sense” such that our\nfaculties of sensation, memory, imagination, and thought work in\nharmony, while objective unity is captured by the notion of\n“recognition” such that it is the same object that is\nsensed, remembered, imagined, and thought. The fourth postulate\nconcerns “representation”, a key target of Deleuze’s\ncritique. Here difference is submitted to a fourfold structure that\nrenders difference subordinate to identity: 1) identity in the\nconcept; 2) opposition of predicates; 3) analogy in judgment; and 4)\nresemblance in perception. A good way to approach Deleuze’s\nnotion of representation is via Aristotle and Porphyry. Specific\ndifferences are the opposed predicates that function on a horizon of\nidentity in the concept under division; thus animal is the genus that\nis divided into rational and irrational as specific differences that\nenable the isolation of the species “human.” Then, we find\nthat the difference between individuals of the same species is\ninfra-conceptual and can only be made via the perception of\nresemblances; Theaetetus looks like Socrates but not so much that they\ncannot be distinguished. Finally, the relation of substance to the\nother categories is analogical, such that being is said in many ways,\nbut with substance as the primary way in which it is said.\n\nAfter the first four postulates, we find the theory of the faculties,\nwhich will be Deleuze’s account of what it means to be\n“forced” to think in differential rather than identitarian\nterms. To free a notion of “difference in itself” such\nthat difference need not be thought on the basis of a prior horizon of\nidentity, Deleuze looks for an “encounter,” a sensation\nthat cannot be thought, that cannot find the empirical category under\nwhich an object can be recognized, and thus forces the\n“transcendent exercise” of the faculty of sensibility,\nwhen something can only be sensed.\n\nHere we see the dynamic genesis from intensity in sensation to the\nthinking of virtual Ideas. Each step here has a distinct Kantian echo.\nThe faculties are linked in order; here Deleuze as well as Kant look\nto the privilege of sensibility as the origin of knowledge—the\n“truth of empiricism.” With sensibility, pure difference\nin intensity is grasped immediately in the encounter as the\nsentiendum, that which can only be sensed. In the\ndifferential theory of the faculties, sensibility, imagination,\nmemory, and thought all “communicate a violence” from one\nto the other—here Deleuze works with the Kantian notion of the\nsublime as discordant accord of the faculties. The “free form of\ndifference” in intensity moves each faculty and communicates its\nviolence to the next, though in this case there is no supernatural\nvocation that will redeem the conflict of imagination and reason, as\nthere is in the resolution to the discussion of the sublime in the\nCritique of Judgment. Rather than a reconciliation of the\nfaculties, with thought, a “fractured self”—here\nDeleuze takes up Kant’s notion of the split between the\nempirical ego and the Transcendental subject—is constrained to\nthink “difference in itself” in Ideas.\n\nWe won’t discuss the last four postulates in detail, as they\nconcern the theory of Ideas, the topic of Chapter 4, which we will\nshortly discuss. For now, let us note that two of Deleuze’s\ntechnical terms, intensity and virtuality, occupy two different places\non this line of dynamic genesis. Intensity is the characteristic of\nthe encounter, and sets off the process of thinking, while virtuality\nis the characteristic of the Idea.\n\nWith the notions of intensive and extensive we come upon a crucial\ndistinction for Deleuze that is explored in Chapters 4 and 5 of\nDifference and Repetition. Extensive quantities, such as\nlength, area or volume, are divisible. A volume of matter divided into\ntwo equal halves produces two volumes, each having half the extent of\nthe original one. Intensive magnitudes, by contrast, refer to\nproperties such as temperature or pressure that cannot be so divided.\nIf a volume of water whose temperature is 90º is divided in half,\nthe result is two volumes at the original temperature, not two volumes\nat 45º. However, the important property of intensity is not that\nit is indivisible, but that it is a property that cannot be divided\nwithout involving a change in kind. The temperature of a volume of\nwater, for instance, can be “divided” by heating the\ncontainer from below, causing a temperature difference between the top\nand the bottom. In so doing, however, we change the system\nqualitatively; moreover, if the temperature differences reach a\ncertain threshold (if they attain a certain “intensity” in\nDeleuze’s terms), the system will undergo a “phase\ntransition,” losing symmetry and changing its dynamics, entering\ninto a periodic pattern of motion—convection—which\ndisplays extensive properties of size: X centimeters of length and\nbreadth. Drawing on these kinds of analyses, Deleuze will assign a\ntranscendental status to the intensive: intensity, he argues,\nconstitutes the genetic condition of extensive space. Intensive\nprocesses are themselves in turn structured by Ideas or\nmultiplicities.\n\nAn Idea or multiplicity is really a process of progressive\ndetermination of differential elements, differential relations, and\nsingularities. Let us take these step-by-step. “Elements”\nmust have no independent existence from the system in which they\ninhere; phonemes as the elements of the virtual linguistic Idea are an\nexample Deleuze uses in Difference and Repetition. When\nphonemes are actualized, they enter into differential relations that\ndetermine the patterns of individual languages; thus the English\nphoneme /p/ is reciprocally determined by its differences from /t/,\n/b/, /d/, and so on. Finally, these differential relations of an\nindividual language determine singularities or remarkable points at\nwhich the pattern of that language can shift: the Great Vowel Shift of\nMiddle English being an example, or more prosaically, dialect\npronunciation shifts.\n\nFor another example—and here, in the applicability of his schema\nto widely divergent registers, is one of the aspects of Deleuze as\nmetaphysician—let us try to construct the Idea of hurricanes.\nThe differential elements would be material “flows” driven\nby intensive differences in temperature and pressure but undetermined\nin form (neither smooth nor turbulent, neither big nor small) and\nfunction (neither forming nor destroying of weather events). These\nflows qua differential elements enter into relations of reciprocal\ndetermination linking changes in any one element to changes in the\nothers; thus temperature and pressure differences will link changes in\nair and water currents to each other: updrafts are related to\ndowndrafts even if the exact relations (the tightness of the links,\nthe velocity of the flows) are not yet determined. Finally, at\nsingular points in these relations singularities are determined that\nmark qualitative shifts in the system, such as the formation of\nthunderstorm cells, the eye wall, and so on. But this is still the\nvirtual Idea of hurricanes; real existent hurricanes will have\nmeasurable values of these variables so that we can move from the\nphilosophical realm of sufficient reason to that of scientific\ncausation. A hurricane is explained by its Idea, but it is caused by\nreal wind currents driven by real temperature supplied by the sun to\ntropical waters.\n\nTo see how Ideas are transcendental and immanent, we have to\nappreciate that an Idea is a concrete universal. In an early article\non Bergson (“The Conception of Difference in Bergson”\n[1956]), Deleuze gave a particularly helpful example of this notion.\nIn La Pensée et le Mouvant, Bergson had shown that\nthere are two ways of determining what the spectrum of\n“colors” have in common. (1) You can extract from\nparticular colors an abstract and general idea of color (“by\nremoving from the red that which makes it red, from the blue what\nmakes it blue, from the green what makes it green”). Or, (2) you\ncan make all these colors “pass through a convergent lens,\nbringing them to a single point,” in which case a “pure\nwhite light” is obtained that “makes the differences\nbetween the shades stand out.” The former case defines a single\ngeneric “concept” with a plurality of objects; the\nrelation between concept and object is one of subsumption; and the\nstate of difference remains exterior to the thing. The second case, on\nthe contrary, defines a differential Idea in the Deleuzean sense: the\ndifferent colors are no longer objects under a concept, but constitute\nan order of mixture in coexistence and succession within the Idea; the\nrelation between the Idea and a given color is not one of subsumption,\nbut one of actualization and differenciation; and the state of\ndifference between the concept and the object is internalized in the\nIdea itself, so that the concept itself has become the object. White\nlight is still a universal, but it is a concrete universal, and not a\ngenus or generality.\n\nThe Idea of color is thus like white light, which\n“perplexes” within itself the genetic elements and\nrelations of all the colors, but which is actualized in the diverse\ncolors and their respective spaces. (Like the word\n“problem,” Deleuze uses the word “perplexion”\nto signify, not a coefficient of doubt, hesitation, or astonishment,\nbut the multiple and virtual state of Ideas. Indeed, Deleuze adopts a\nnumber of Neoplatonic notions to indicate the structure of Ideas, all\nof which are derived from the root word pli [fold]:\nperplication, complication, implication, explication, and\nreplication.) Similarly, the Idea of sound could be conceived of as a\nwhite noise, just as there is also a white society or a white\nlanguage, which contains in its virtuality all the phonemes and\nrelations destined to be actualized in the diverse languages and in\nthe remarkable parts of a same language.\n\nWe can now move to discuss Chapter 5, on the individuation of\nconcretely existing real entities as the actualization of a virtual\nIdea. In isolating the conditions of genesis, Deleuze sets up a\ntripartite ontological scheme, positing three interdependent\nregisters: the virtual, intensive, and actual. Deleuze’s basic\nnotion is that in all realms of being intensive morphogenetic\nprocesses follow differential virtual multiplicities to produce\nlocalized and individuated actual substances with extensive\nproperties. Simply put, the actualization of the virtual proceeds by\nway of intensive processes. Beneath the actual (any one state of a\nsystem), we find “impersonal individuations” or intensive\nmorphogenetic processes that produce system states and beneath these\nwe find “pre-individual singularities” (that is, the key\nelements in virtual fields, marking system thresholds that structure\nthe intensive morphogenetic processes). We thus have to distinguish\nthe intense “impersonal” field of individuation and its\nprocesses from the virtual “pre-individual” field of\ndifferential relations and singularities that make up an Idea or\nmultiplicity.\n\nTying together the themes of difference, multiplicity, virtuality and\nintensity, at the heart of Difference and Repetition we find\na theory of Ideas (dialectics) based neither on an essential model of\nidentity (Plato), nor a regulative model of unity (Kant), nor a\ndialectical model of contradiction (Hegel), but rather on a\nproblematic and genetic model of difference. Ideas define the being of\na thing, but one cannot attain an Idea through the Socratic question\n“What is … ?” (which posits Ideas as transcendent\nand eternal), but rather through “minor” questions such as\n“Which one?” “Where?” “When?”\n“How?” “How many?” “In which\ncase?” “From which viewpoint?”—all of which\nallow one to define the differential Ideas immanent in the intensive\nprocesses they structure.\n\nFrom these examples we can see that Ideas structure the intensive\nprocesses that give rise to the behavior patterns of systems, and\ntheir singularities mark the thresholds at which systems change\nbehavior patterns. In a word, the virtual Idea is the transformation\nmatrix for material systems or bodies. Bodies are determined\n“solutions” to the “problem” that lays out the\nmanifold options for incarnating bodies of that nature. Ideas then\nrespond to the question “who?” (who is it that incarnates\nthe Idea in this case?) rather than the essentialist “what\nis?” (what are the properties of the substance that provide the\nnecessary and sufficient conditions for membership in the class of\nwhich the object is a member?)\n\nFor orientation purposes, it’s useful to consider Gilbert\nSimondon’s theory of individuation as a very simple model for\nwhat Deleuze calls “actualization.” For Simondon,\ncrystallization is a paradigm of individuation: a supersaturated\nsolution is metastable; from that pre-individual field, replete with\ngradients of density that are only implicit “forms” or\n“potential functions,” individual crystals precipitate\nout. The Deleuzean virtual is composed of “Ideas” or\n“multiplicities” involving differential relations among\nheterogeneous components, whose rates of change are connected with\neach other. For an example of such heterogeneity, let us return to\nhurricane formation, the Idea of which we sketched above. Here it\nshould be intuitively clear that there is no central command, but a\nself-organization of multiple processes of air and water movement\npropelled by temperature and pressure differences. All hurricanes form\nwhen intensive processes of wind and ocean currents reach singular\npoints. These singular points, however, are not unique to any one\nhurricane, but are virtual for each actual hurricane, just as the\nboiling point of water is virtual for each actual pot of tea on the\nstove. In other words, all hurricanes share the same virtual structure\neven as they are singular individuations or actualizations of that\nstructure.\n\nIn this treatment, we have concentrated on only some of the\nmetaphysics in Difference and Repetition; much more could be\nsaid about the role that Nietzsche’s thought of the eternal\nreturn plays therein, in addition to Deleuze’s remarks on a\ndizzying array of figures from Plato and Scotus to Freud and Artaud.\nIn the interests of space, however, let us move to a brief treatment\nof Deleuze’s second major work of the late 1960s, Logic of\nSense.\n3.2 Logic of Sense\n\nWhile Difference and Repetition ranges over a wide field of\nphilosophical topics, Logic of Sense focuses on two aspects\nof a single issue, the structure and genesis of sense. The genius of\nFrege and Russell was to have discovered that the condition of truth\n(denotation) lies in the domain of sense. In order for a proposition\nto be true (or false) it must have a sense; a nonsensical proposition\ncan be neither true nor false. Yet they betrayed this insight, Deleuze\nargues, because they—like Kant before them—remained\ncontent with establishing the condition of truth rather than its\ngenesis. In Logic of Sense, Deleuze attacks this problem,\nfirst developing the paradoxes that result from the structure of sense\nand then sketching a theory of its genesis. He does this using\nresources from analytic philosophy and the Stoics in the course of a\nreading of Lewis Carroll—a typically innovative, if not quirky,\nset of Deleuzean references.\n\nIn the first part of the book, Deleuze analyzes the structure of\nsense. He begins by identifying three types of relation within\npropositions:\n\nDesignation or denotation, which is the relation of a proposition\nto an external state of affairs (theory of reference, with its\ncriterion of truth or falsity).\nManifestation, which marks the relation of the proposition to the\nbeliefs and desires of the person who is speaking (with its values of\nveracity or illusion).\nSignification or demonstration, which is the relation of the\nproposition to other propositions (the domain of logic, with its\nrelations of implication and assertion).\n\n\nPropositions, in other words, can be related either to the objects to\nwhich they refer, or to the subjects who utter them, or to other\npropositions. But each of these relations, in turn, can be taken to be\nprimary. (1) In the domain of speech, it is the “I” that\nbegins: manifestation not only makes denotation possible (Hume), but\nis also prior to signification (Descartes’ cogito). (2)\nIn the domain of language, however, it is signification that is\nprimary, since one is always born into a preexisting language, and\nsignified concepts are always primary in relation to the self as a\nmanifested person or to things as designated objects. (3) Yet in the\ndomain of logic we see the primacy of designation: as shown by the\nhypothetical mode of implications, the logical value of demonstration\nis not the truth, but rather the conditions of truth (the conditions\nof possibility under which the proposition would be true); the\npremises must thus be posited as effectively true, which forces one to\nleave the pure order of implication in order to relate the premises to\na denoted state of affairs. Logical designation, in other words,\ncannot fulfill its putative role as foundation, since it presupposes\nan irreducible denotation.\n\nThe theory of the proposition is thus caught in a circle, with each\ncondition in turn being conditioned by what it supposedly conditions.\n“For the condition of truth to avoid this defect,” Deleuze\nargues, “it would have to have something unconditioned capable\nof assuring a real genesis of designation and the other dimensions of\nthe proposition: the condition of truth would then be defined, no\nlonger as the form of conceptual possibility, but as an ideal matter\nor ‘medium’ [matière ou ‘couche’\nidéelle], that is, no longer as signification, but as\nsense” (LS 19). Sense, then, would be a fourth dimension of\npropositions, for which Deleuze reserves the term expression. For\nDeleuze as for Frege, sense is what is expressed in a proposition; the\ntwo senses of “morning star” and “evening\nstar” are two ways in which the same denotatum may be\nexpressed in propositions.\n\nDeleuze’s contribution to the philosophy of sense really begins\nto take off when he shows that the attempt to make this fourth\ndimension evident is akin to Lewis Carroll’s Hunt for the Snark,\nor to unraveling a Möbius strip, since sense has neither a\nphysical nor a mental existence. Deleuze suggests that it was the\nStoics who first discovered the dimension of sense when they\ndistinguished between corporeal mixtures and incorporeal events. I can\nattribute the proper name “Battle of Waterloo” to a\nparticular state of affairs, but the battle itself is an incorporeal\nevent (or sense) with no other reality than that of the expression of\nmy proposition; what we find in the state of affairs are bodies mixing\nwith one another—spears stabbing flesh, bullets flying through\nthe air, cannons firing, bodies being ripped apart—and the\nbattle itself is the effect or the result of this\nintermingling of bodies. Sense thus has a complex status. On the one\nhand, it does not exist outside the proposition that expresses it, but\nit cannot be confused with the proposition, since it has a distinct\n“objectity” of its own (it does not exist, but rather\n“subsists” or “insists”). On the other hand,\nit is attributed to states of affairs or things, but it cannot be\nconfused or identified with states of affairs, nor with a quality or\nrelation of these states. “Sense is both the expressible or the\nexpressed of the proposition, and the attribute of the state of\naffairs. It turns one side toward things, and another side toward\npropositions. But it cannot be confused with the proposition which\nexpressed it any more than with the state of affairs or the quality\nwhich the proposition denotes. It is exactly the boundary between\npropositions and things” (LS 22).\n\nThe structure of sense generates a number of paradoxes, which Deleuze\ndistinguishes from the paradoxes of signification discovered by\nRussell in set theory (the set of all sets, and the “barber of\nthe regiment”). The first is the paradox of regress, or\nindefinite proliferation: I can never state the sense of what I am\nsaying, but I can take the sense of what I am saying as the object of\nanother proposition, whose sense in turn I cannot state, ad infinitum.\nThis first paradox points both to the impotence of the speaker (my\ninability to state the sense of what I am saying) and to the highest\npower of language (its infinite capability to speak about words). The\nsecond paradox is that of sterile reiteration or doubling: one can\navoid the infinite regress by extracting sense as the mere double of a\nproposition, but at the price of catapulting us into a third paradox\nof neutrality or sterility—sense is necessarily neutral with\nregard to the various modes of the proposition: quality (affirmation,\nnegation), quantity (all, some, none), relation, and modality\n(possibility, reality, necessity).\n\nThus extracted from the proposition, Deleuze argues that sense has the\nstatus of a pure ideational event, irreducible to\npropositions and their three dimensions: (1) the states of affairs the\npropositions denote; (2) the experiences or mental activities\n(beliefs, desires, images, representations) of persons who express\nthemselves in the proposition; and (3) universals or general concepts.\nBut how can sense be said to engender the other dimensions of the\nproposition? This is the second task of a logic of sense: “to\ncombine the sterility of sense in relation to the proposition from\nwhich it was extracted with its power of genesis in relation to the\ndimensions of the proposition” (LS 32).\n\nIn the second half of Logic of Sense, Deleuze analyzes what\nhe calls the dynamic genesis of language, drawing in part from texts\nin developmental psychology and psychoanalysis. “What renders\nlanguage possible,” he writes, “is that which separates\nsounds from bodies and organizes them into propositions, freeing them\nfor the expressive function” (LS 181). Deleuze distinguishes\nthree stages in the dynamic genesis, which at the same time constitute\nthree dimensions of language: (1) the primary order is the noise\nproduced in the depths of the body; (2) the secondary organization\nconstitutes the surface of sense (and non-sense); and (3) the tertiary\narrangement [ordonnance] is found in fully-formed\npropositions, with their functions of denotation, manifestation, and\nsignification.\n\nThe first stage of the dynamic genesis of sense, the primary order of\nlanguage, is found in the newborn infant. Deleuze draws from a\ntradition of developmental psychology whose insights are expressed in\nthe vivid image of Daniel N. Stern: the infant’s experience is a\nkind of human “weatherscape,” made up entirely of\nsequences of risings and fallings of intensity—the jolting of a\nbright light or a sharp noise, the calming of a voice, or the\nexplosive breakout of a storm of hunger (The Interpersonal World\nof the Infant, 1985). Deleuze will draw upon the writings of the\nFrench writer Antonin Artaud and call this life of\nintensities-in-motion the “body without organs.” This\nprimary order of language (pure Noise as a dimension of the body)\nconstitutes a first type of nonsense. But in the midst of this world\nof intensities, there also appears a particular noise: the sound of\nthe child’s parents, or other adults. Long before the infant can\nunderstand words and sentences, it grasps language as something that\npre-exists itself, as something always-already there, like a Voice on\nhigh. But for the child the Voice has the dimensions of language\nwithout having its condition. (Adults have the same experience when\nthey hear a foreign language being spoken.) For the infant to accede\nto the tertiary arrangement of language (denotation, manifestation,\nsignification), it must pass through its secondary organization, which\nis the production of the surface dimension of sense. How does this\nconstruction take place? From the flow of the Voice, the child will\nextract differential elements of various orders (phonemes, morphemes,\nsemantemes) and begin to synthesize them into diverse series.\n\nAt this point, Deleuze isolates three series or syntheses: connective,\nconjunctive, and disjunctive. In the first, the child connects\nphonemes in a concatenation of successive entities\n(“mama,” “dada”); in the second, there is the\nconstruction of esoteric words out of these phonemes through their\nintegration and conjunction (“your royal highness” is\ncontracted into “y’reince”); in the third, the child\nstarts making these esoteric words ramify and enter into relation with\nother divergent and independent series. We can clearly see that the\nconstructions of this secondary organization of sense are not yet the\nfully formed units of the tertiary arrangement of language on high,\nbut they are no longer merely the bodily noises of the primary order.\nBefore the child has any understanding of linguistic units, it\nundertakes a vast apprenticeship in their formative elements. This is\nwhy the domain of sense is the condition or ground of propositions,\nnot as their form of possibility, but as their “ideal matter or\n‘medium’”: we are positioned immediately within\nsense whenever we denote, manifest, or signify. Moreover, since sense\nlies at the frontier of words and things—it is expressed in\npropositions and attributed to states of affairs, but it cannot be\nconfused with either propositions or states of affairs—it\nengenders both the determinate dimensions of the proposition\n(denotation, manifestation, signification) as well as its objective\ncorrelates (the denoted, the manifested, and the signified).\n\nThe domain of sense is necessarily subject to a fundamental fragility,\ncapable of toppling over into nonsense: the ground gives way to a\ngroundlessness, a sans-fond. The reason for this is clear.\nSense is never a principle or an origin; rather, it is an effect, it\nis produced, and it is produced out of elements that do not, in\nthemselves, have a sense. Sense, in other words, has a determinate\nrelation with nonsense. Deleuze, however, distinguishes between two\nvery different types of nonsense. The first is that of Lewis Carroll,\nwho remains at the surface of sense and, like children, makes use of\nthe non-signifying elements of language in order to construct the\nportmanteau words (snark = shark + snake; frumious = furious + fuming)\nand nonsensical phrases (“’Twas brillig, and the slithy\ntoves did gyre and gimble in the wabe”) that populate his\nwriting. If Logic of Sense is in part a reading of\nCarroll’s work, it is because no one knew better than Carroll\nabout the conditions for the production of sense, which Deleuze\nelucidates in detail: the extraction of differential elements or pure\nevent, their organization in multiple series, and most importantly,\nthe aleatory point or paradoxical element that links the series (the\nideal “quasi-cause” that produces the effect of sense out\nof nonsense).\n\nBut there is a second type of nonsense, which is more profound than\nthe surface nonsense found in Lewis Carroll. This is the terrifying\nnonsense of the primary order, which found expression in the writings\nof Antonin Artaud. Sense is what prevents the sonorous language from\nbeing confused with the physical body (noise). But in the primary\norder of schizophrenia experienced by Artaud, there is no longer\nanything to prevent propositions from falling back onto bodies, which\nmingle their sonorous elements with the olfactory, gustatory, and\ndigestive effects of the body (Artaud’s cris-souffles:\n“ratara ratara ratara Atara tatara rana Otara otara\nkatara”).\n\nDeleuze will develop his theory of the body-without-organs in his\ncollaboration with Félix Guattari, to which we now turn. As we\nshall see, the concept of the body-without-organs is put to work in a\ncomplex naturalistic philosophy of “desiring-production”\nthat moves far beyond the question of sense into the realms of nature,\nhistory, and politics. In other words, if Logic of Sense\nrepresents Deleuze’s confrontation with the “linguistic\nturn” that was so important for twentieth-century philosophy, it\nis a confrontation that he quickly put behind him as he came to\nembrace fully his materialist and naturalistic leanings.\n4. Collaboration with Guattari\n\nFollowing his work in the philosophy of difference, Deleuze meets\nGuattari in the aftermath of May 1968. These famous\n“events,” which have marked French culture and politics\never since, brought together students and workers, to the befuddlement\nof the established guardians of the revolution, the French Communist\nParty. Days of general strikes and standoffs with the police led the\nFrench President Charles de Gaulle to call a general election. De\nGaulle’s call for a parliamentary solution to the crisis was\nbacked by the Communists, who were evidently as scared of any\nrevolution from below—which by definition would lack the party\ndiscipline they so craved—as were the official holders of State\npower, to whose position they aspired. The worker-student movement\neventually collapsed, leaving memories of non-scripted social\ninteractions and revealing the investments of the Party, lampooned\nthereafter as “bureaucrats of the revolution,” in\nFoucault’s words in his Preface to the English translation of\nAnti-Oedipus. The French Communist Party’s agreement\nwith De Gaulle to allow a parliamentary solution to the social crisis\nwas a glaring example of the horizon of identity (the desire that\nsomeone be in control of a central State bureaucracy) that allowed an\nopposition (of the Gaullists and the Communists as rivals for control\nof the State) to shackle difference.\n\nThe government response to May 1968 changed French academic life in\ntwo ways. First, institutionally, by the creation of Paris VIII\n(Vincennes) where Deleuze taught; and second, in the direction of the\nphilosophy of difference, which became explicitly political post-1968.\nIt became, in fact, a politics of philosophy dedicated to exposing the\nhistorical force relations producing identity in all its ontological\nand epistemological forms. In other words, the philosophy of\ndifference now set out to show how the unified objects of the world,\nthe unified subjects who know and hence control them, the unified\nbodies of knowledge that codify this knowledge, and the unified\ninstitution of philosophy that polices the whole affair, are products\nof historical, political forces in combat with other forces.\n\nIn purely philosophical terms, the works with Guattari naturalize the\nstill-Kantian framework of Difference and Repetition. By the\ntime of Anti-Oedipus and A Thousand Plateaus Deleuze\nand Guattari explicitly thematize that the syntheses they investigate\nare fully material syntheses, syntheses of nature in geological as\nwell as biological, social, and psychological registers (Welchman\n2009). Not just organic syntheses, but inorganic ones as well, are\n“spatio-temporal dynamisms.” With this full naturalization\nof syntheses, the question of panpsychism is brought into full relief\n(Protevi 2011), since material syntheses are as much syntheses of\nexperience as they are syntheses of things, as we see in the title of\nChapter 3 of A Thousand Plateaus: “The Geology of\nMorals: Who does the earth think it is?”\n4.1 Anti-Oedipus\n\nIn considering Anti-Oedipus we should first discuss its\nperformative effect, which attempts to “force us to\nthink,” that is, to fight against a tendency to cliché.\nReading Anti-Oedipus can indeed be a shocking experience.\nFirst, we find a bizarre collection of sources; for example, the\nschizophrenic ranting of Antonin Artaud provides one of the basic\nconcepts of the work, the “body without organs.” Second is\nthe book’s vulgarity, as in the infamous opening lines about the\nunconscious (the Id): “It is at work everywhere, functioning\nsmoothly at times, at other times in fits and starts. It breathes, it\nheats, it eats. It shits and fucks [Ça chie, ça\nbaise]. What a mistake to have ever said the id”\n(7 / 1). A third performative effect is humor, as in the mocking of\nMelanie Klein’s analysis of children: “Say it’s\nOedipus, or I’ll slap you upside the head [sinon\nt’auras un gifle]” (54 / 45; trans. modified). There\nare many more passages like this; it’s safe to say very few\nphilosophy books contain as many jokes, puns, and double\nentendres as Anti-Oedipus. A fourth element is the\ngleeful coarseness of the polemics. Among many other examples,\nthinkers of the signifier are associated with the lap dogs of tyrants,\nmembers of the French Communist Party are said to have fascist\nlibidinal investments, and Freud is described as a “masked Al\nCapone.” All in all, the performative effect of reading\nAnti-Oedipus is unforgettable.\n\nPassing to the conceptual structure of the book, the key term of\nAnti-Oedipus is “desiring-production,” which\ncrisscrosses Marx and Freud, putting desire in the eco-social realm of\nproduction and production in the unconscious realm of desire. Rather\nthan attempting to synthesize Marx and Freud in the usual way, that\nis, by a reductionist strategy that either (1) operates in favor of\nFreud, by positing that the libidinal investment of social figures and\npatterns requires sublimating an original investment in family figures\nand patterns, or (2) operates in favor of Marx by positing neuroses\nand psychoses as mere super-structural by-products of unjust social\nstructures, Deleuze and Guattari will call desiring-production a\n“universal primary process” underlying the seemingly\nseparate natural, social and psychological realms. Desiring-production\nis thus not anthropocentric; it is the very heart of the world.\nBesides its universal scope, we need to realize two things about\ndesiring-production right away: (1) there is no subject that lies\nbehind the production, that performs the production; and (2) the\n“desire” in desiring-production is not oriented to making\nup a lack, but is purely positive. Desiring-production is autonomous,\nself-constituting, and creative: it is the natura naturans of\nSpinoza or the will-to-power of Nietzsche.\n\nAnti-Oedipus is, along with its conceptual and terminological\ninnovation, a work of grand ambitions: among them, (1) an eco-social\ntheory of production, encompassing both sides of the nature/culture\nsplit, which functions as an ontology of change, transformation, or\n“becoming”; (2) a “universal history” of\nsocial formations—the “savage” or tribal, the\n“barbarian” or imperial, and the capitalist—which\nfunctions as a synthetic social science; (3) and to clear the ground\nfor these functions, a critique of the received versions of Marx and\nFreud—and the attempts to synthesize them by analogizing their\nrealms of application. In pursuing its ambitions,\nAnti-Oedipus has the virtues and the faults of the tour\nde force: unimagined connections between disparate elements are\nmade possible, but at the cost of a somewhat strained conceptual\nscheme.\n\nAnti-Oedipus identifies two primary registers of\ndesiring-production, the natural or “metaphysical” and the\nsocial or “historical.” They are related in the following\nway: natural desiring-production is that which social machines\nrepress, but also that which is revealed in capitalism, at the end of\nhistory (a contingent history, that is, one that avoids dialectical\nlaws of history). Capitalism sets free desiring-production even as it\nattempts to rein it in with the institution of private property and\nthe familial or “Oedipal” patterning of desire;\nschizophrenics are propelled by the charge of desiring-production thus\nset free but fail at the limits capitalist society proposes, thus\nproviding a clue to the workings of desiring-production.\n\nIt’s important at the start to realize that Deleuze and Guattari\ndo not advocate schizophrenia as a “lifestyle” or as the\nmodel for a political program. The schizophrenic, as a clinical\nentity, is the result of the interruption or the blocking of the\nprocess of desiring-production, its having been taken out of nature\nand society and restricted to the body of an individual where it spins\nin the void rather than make the connections that constitute reality.\nDesiring-production does not connect “with” reality, as in\nescaping a subjective prison to touch the objective, but it makes\nreality, it is the Real, in a twisting of the Lacanian sense of the\nterm. In Lacan, the real is produced as an illusory and retrojected\nremainder to a signifying system; for Deleuze and Guattari, the Real\nis reality itself in its process of self-making. The schizophrenic is\na sick person in need of help, but schizophrenia is an avenue into the\nunconscious, the unconscious not of an individual, but the\n“transcendental unconscious,” an unconscious that is\nsocial, historical, and natural all at once.\n\nIn studying the schizophrenic process, Deleuze and Guattari posit that\nin both the natural and social registers desiring-production is\ncomposed of three syntheses, the connective, disjunctive, and\nconjunctive; the syntheses perform three functions: production,\nrecording, and enjoyment. We can associate production with the\nphysiological, recording with the semiotic, and enjoyment with the\npsychological registers. While it is important to catch the Kantian\nresonance of “synthesis,” it is equally important to note,\nin keeping with the post-structuralist angle we discussed above, that\nthere is no subject performing the syntheses; instead, subjects are\nthemselves one of the products of the syntheses. The syntheses have no\nunderlying subject; they just are the immanent process of\ndesiring-production. Positing a subject behind the syntheses would be\na transcendent use of the syntheses. Here we see another reference to\nthe Kantian principle of immanence. Deleuze and Guattari propose to\nstudy the immanent use of the syntheses in a “materialist\npsychoanalysis,” or “schizoanalysis”; by contrast,\npsychoanalysis is transcendent use of the syntheses, producing five\n“paralogisms” or “transcendental illusions,”\nall of which involve assigning the characteristics of the extensive\nproperties of actual products to the intensive production process, or,\nto put it in the terms of the philosophy of difference, all the\nparalogisms subordinate differential processes to identities derived\nfrom products.\n\nAccording to the “universal history” undertaken in\nAnti-Oedipus, social life has three forms of\n“socius,” the social body that takes credit for\nproduction: the earth for the tribe, the body of the despot for the\nempire, and capital for capitalism. According to Deleuze and\nGuattari’s reading of the anthropological literature, tribal\nsocieties mark bodies in initiation ceremonies, so that the products\nof an organ are traced to a clan, which is mythically traced to the\nearth or, more precisely, one of its enchanted regions, which function\nas the organs on the full body of the earth. Material flows are thus\n“territorialized,” that is, traced onto the earth, which\nis credited as the source of all production. The signs in tribal\ninscription are not signifiers: they do not map onto a voice, but\nenact a “savage triangle forming … a theater of cruelty\nthat implies the triple independence of the articulated voice, the\ngraphic hand and the appreciative eye” (189). Empires overcode\nthese tribal meaning codes, tracing production back to the despot, the\ndivine father of his people. Material flows in despotic empires are\nthus “deterritorialized” (they are no longer credited to\nthe earth), and then immediately “reterritorialized” on\nthe body of the despot, who assumes credit for all production. When\ntribal signs are overcoded, the signifier is formed as a\n“deterritorialized sign” allowing for communication\nbetween the conquered and the conquerors. Signifiers are a\n“flattening” or “bi-univocalization”: two\nchains are lined up, one to one, the written and the spoken\n(205–6; cf. Derrida’s notion of\n“phonocentrism”). The body of the despot as imperial\nsocius means that workers are the “hands” of the emperor,\nspies are his “eyes,” and so on.\n\nCapitalism is the radical decoding and deterritorialization of the\nmaterial flows that previous social machines had zealously coded on\nthe earth or the body of the despot. Production is credited to the\n“body” of capital, but this form of recording works by the\nsubstitution of an “axiomatic” for a code: in this context\nan “axiomatic” means a set of simple principles for the\nquantitative calculation of the difference between flows (of\ndeterritorialized labor and capital) rather than elaborate rules for\nthe qualitative judgments that map flows onto the socius.\nCapitalism’s command is utterly simple: connect\ndeterritorialized flows of labor and capital and extract a surplus\nfrom that connection. Thus capitalism sets loose an enormous\nproductive charge—connect those flows! Faster, faster!—the\nsurpluses of which the institutions of private property try to\nregister as belonging to individuals. Now those individuals are\nprimarily social (as figures of capitalist or laborer) and only\nsecondarily private (family members). Whereas organs of bodies were\nsocially marked in previous regimes (as belonging to the clan and\nearth, or as belonging to the emperor, as in the jus primae\nnoctis), body organs are privatized under capitalism and attached\nto persons as members of the family. In Deleuze and Guattari’s\nterms, capitalism’s decoded flows are reterritorialized on\n“persons,” that is, on family members as figures in the\nOedipal triangle.\n4.2 A Thousand Plateaus\n\nThree differences between this work and its predecessor are\nimmediately apparent. First, A Thousand Plateaus has a much\nwider range of registers than Anti-Oedipus: cosmic, geologic,\nevolutionary, developmental, ethological, anthropological,\nmythological, historical, economic, political, literary, musical, and\neven more. Second, the results of the paralogisms of\nAnti-Oedipus become “strata” in A Thousand\nPlateaus: the organism (the unification and totalization of the\nconnective synthesis of production, or the physiological register),\nthe signifying totality or signifiance, which we can perhaps\nrender as “signifier-ness” (the flattening or\n“bi-univocalizing” of the disjunctive synthesis of\nrecording, the semiotic register), and the subject (the reification of\nthe conjunctive synthesis of consummation, the psychological\nregister). Finally, while Anti-Oedipus has a classical\nconceptual architecture, that is, chapters that develop a single\nargument, A Thousand Plateaus is written as a\n“rhizome,” that is, as allowing immediate connections\nbetween any of its points. Because of this rhizomatic structure, a\ntraditional summary of the “theses” and arguments of A\nThousand Plateaus is either downright impossible, or at best,\nwould be much too complex to attempt in an encyclopedia article. We\nwill therefore have to limit ourselves to the following remarks.\n\nIn fourteen plateaus, or planes of intensity—productive\nconnections between immanently arrayed material systems without\nreference to an external governing source—Deleuze and Guattari\ndevelop a new materialism in which a politicized philosophy of\ndifference joins forces with the sciences explored in Difference\nand Repetition. A Thousand Plateaus is a book of strange\nnew questions: “Who Does the Earth Think It Is?,”\n“How Do You make Yourself a Body Without Organs?,”\n“How does the war-machine ward off the apparatus of capture of\nthe State?” and so on. To over-simplify, Deleuze and Guattari\ntake up the insights of dynamical systems theory, which explores the\nvarious thresholds at which material systems self-organize (that is,\nreduce their degrees of freedom, as in our previous example of\nconvection currents). Deleuze and Guattari then extend the notion of\nself-organizing material systems—those with no need of\ntranscendent organizing agents such as gods, leaders, capital, or\nsubjects—to the social, linguistic, political-economic, and\npsychological realms. The resultant “rhizome” or\nde-centered network that is A Thousand Plateaus provides\nhints for experimentation with the more and more de-regulated flows of\nenergy and matter, ideas and actions—and the attendant attempts\nat binding them—that make up the contemporary world.\n\nA Thousand Plateaus maintains the tripartite ontological\nscheme of all of Deleuze’s work, but, as the title indicates,\nwith geological terms of reference. Deleuze and Guattari call the\nvirtual “the Earth,” the intensive is called\n“consistency,” and the actual is called “the system\nof the strata.” As the latter term indicates, one of the foci of\ntheir investigations is the tendency of some systems to head toward\ncongealment or stratification. More precisely put, any concrete system\nis composed of intensive processes tending toward the (virtual) plane\nof consistency and/or toward (actual) stratification. We can say that\nall that exists is the intensive, tending towards the limits of\nvirtuality and actuality; these last two ontological registers do not\n“exist,” but they do “insist,” to use one of\nDeleuze’s terms.\n\nNothing ever instantiates the sheer frozen stasis of the actual nor\nthe sheer differential dispersion of the virtual; rather, natural or\nworldly processes are always and only actualizations, that is, they\nare processes of actualization structured by virtual multiplicities\nand heading toward an actual state they never quite attain. More\nprecisely, systems also contain tendencies moving in the other\ndirection, toward virtuality; systems are more or less stable sets of\nprocesses moving in different directions, toward actuality and toward\nvirtuality. In still other words, Deleuze and Guattari are process\nphilosophers; neither the structures of such processes nor their\ncompleted products merit the same ontological status as processes\nthemselves. With this perspective, Deleuze and Guattari offer a\ndetailed and complex “open system” which is\nextraordinarily rich and complex. A useful way into it is to follow\nthe concepts of coding, stratification and territorialization. They\nare related in the following manner. Coding is the process of ordering\nmatter as it is drawn into a body; by contrast, stratification is the\nprocess of creating hierarchal bodies, while territorialization is the\nordering of those bodies in “assemblages,” that is to say,\nan emergent unity joining together heterogeneous bodies in a\n“consistency.”\n\nThese concepts, and several other networks of concepts considerations\nof space preclude us from considering, are put to work in addressing\nthe following topics. After a discussion of the notion of\n“rhizome” in the first chapter (or “plateau”\nas they call it), Deleuze and Guattari quickly dismiss psychoanalysis\nin the second. In the third chapter they discuss the process of\nstratification in physical, organic, and social strata, with special\nattention to questions in population genetics, where speciation can be\nthought to stratify or channel the flow of genes. In chapters 4 and 5\nthey intervene in debates in linguistics in favor of pragmatics, that\nis to say, highlighting the “incorporeal transformations”\n(labels that prompt a different form of action to be applied to a\nbody: “I now pronounce you man and wife”) that socially\nsanctioned “order words” bring about (Deleuze and Guattari\nalso refer to speech act theory in this regard).\n\nThey also lay out the theory of “territories” or sets of\nenvironmentally embedded triggers of self-organizing processes, and\nthe concomitant processes of deterritorialization (breaking of habits)\nand reterritorialization (formation of habits). Chapters 6 and 7\ndiscuss methods of experimenting with the strata in which we found\nourselves. Chapter 6 deals with the organic stratum or the\n“organism”; the notorious term of art “Body without\nOrgans” can be at least partially glossed as the reservoir of\npotentials for different patterns of bodily affect. Chapter 7 deals\nwith the intersection of signifiance\n(“signifier-ness”) and subjectification in\n“faciality”; the face arrests the drift of signification\nby tying meaning to the expressive gestures of a subject. Chapters 8\nand 9 deal with the social organizing practices they name\n“lines” and “segments”; of particular interest\nhere is their treatment of fascism.\n\nChapter 10 returns to the question of intensive experimentation, now\ndiscussed in terms of “becoming,” in which (at least) two\nsystems come together to form an emergent system or\n“assemblage.” Chapter 11 discusses the\n“refrain” or rhythm as a means of escaping from and\nforming new territories, or even existing in a process of continual\ndeterritorialization, what they call “consistency.”\nChapters 12 and 13 discuss the relation of the “war\nmachine” and the State; the former is a form of social\norganization that fosters creativity (it “reterritorializes on\ndeterritorialization itself”), while the latter is an\n“apparatus of capture” living vampirically off of labor\n(here Deleuze and Guattari’s basically Marxist perspective is\napparent). Finally, Chapter 14 discusses types of social constitution\nof space, primarily the “smooth” space of war machines and\nthe “striated” space of States.\n4.3 What is Philosophy?\n\nAfter a long period in which each pursued his own interests, Deleuze\nand Guattari published a last collaboration in 1991, What Is\nPhilosophy? In answering their title question, Deleuze and\nGuattari seek to place philosophy in relation to science and art, all\nthree being modes of thought, with no subordination among them.\nThought, in all its modes, struggles with chaos against opinion.\nPhilosophy is the creation or construction of concepts; a concept is\nan intensive multiplicity, inscribed on a plane of immanence, and\npeopled by “conceptual personae” which operate the\nconceptual machinery. A conceptual persona is not a subject, for\nthinking is not subjective, but takes place in the relationship of\nterritory and earth. Science creates functions on a plane of\nreference. Art creates “a bloc of sensation, that is to say, a\ncompound of percepts and affects” (WP 164).\n\nWe will deal with Deleuze and the arts in some detail below. In\ndiscussing What is Philosophy?, let us concentrate on the\ntreatment of the relation of philosophy and science. We should\nremember at the outset that the nomad or minor science evoked in A\nThousand Plateaus is not the Royal or major science that makes up\nthe entirety of what Deleuze and Guattari call ‘science’\nin What is Philosophy?. The motives for this conflation are\nunclear; in the eyes of some, this change considerably weakens the\nvalue of the latter work.\n\nBe that as it may, in What is Philosophy? Deleuze and\nGuattari vigorously deny that philosophy is needed to help science\nthink about its own presuppositions (“no one needs philosophy to\nreflect on anything” [WP 6]). Instead, they emphasize the\ncomplementary nature of the two. First, they point out a number of\nsimilarities between philosophy and science: both are approaches to\n“chaos” that attempt to bring order to it, both are\ncreative modes of thought, and both are complementary to each other,\nas well as to a third mode of creative thought, art.\n\nBeyond these similarities, Deleuze and Guattari distinguish between\nphilosophy as the creation of concepts on a plane of immanence and\nscience as the creation of functions on a plane of reference. Both\nrelate to the virtual, the differential field of potential\ntransformations of material systems, but in different ways. Philosophy\ngives consistency to the virtual, mapping the forces composing a\nsystem as pure potentials, what the system is capable of. Meanwhile,\nscience gives it reference, determining the conditions by which\nsystems behave the way they actually do. Philosophy is the\n“counter-effectuation of the event,” abstracting an event\nor change of pattern from bodies and states of affairs and thereby\nlaying out the transformative potentials inherent in things, the roads\nnot taken that coexist as compossibles or as inclusive disjunctions\n(differentiation, in the terms of Difference and Repetition),\nwhile science tracks the actualization of the virtual, explaining why\nthis one road was chosen in a divergent series or exclusive\ndisjunction (differenciation, according to Difference and\nRepetition). Functions predict the behavior of constituted\nsystems, laying out their patterns and predicting change based on\ncausal chains, while concepts “speak the event” (WP 21),\nmapping out the multiplicity structuring the possible patterns of\nbehavior of a system—and the points at which the system can\nchange its habits and develop new ones.\n\nFor Deleuze and Guattari in What is Philosophy?, then,\nscience deals with properties of constituted things, while philosophy\ndeals with the constitution of events. Roughly speaking, philosophy\nexplores the plane of immanence composed of constellations of\nconstitutive forces that can be abstracted from bodies and states of\naffairs. It thus maps the range of connections a thing is capable of,\nits “becomings” or “affects.” Science, on the\nother hand, explores the concretization of these forces into bodies\nand states of affairs, tracking the behavior of things in relation to\nalready constituted things in a certain delimited region of space and\ntime (the “plane of reference”). How do concepts relate to\nfunctions? Just as there is a “concept of concept” there\nare also “concepts of functions,” but these are purely\nphilosophical creations “without the least scientific\nvalue” (WP 117). Thus concrete concepts like that of\n“deterritorialization” are philosophical concepts, not\nscientific functions, even though they might resonate with, or echo,\nscientific functions. Nor are they metaphors, as Deleuze and Guattari\nrepeatedly insist:\n\n“Of course, we realize the dangers of citing scientific\npropositions outside their own sphere. It is the danger of arbitrary\nmetaphor or of forced application. But perhaps these dangers are\naverted if we restrict ourselves to taking from scientific operators a\nparticular conceptualizable character which itself refers to\nnon-scientific areas, and converges with science without applying it\nor making it a metaphor” (Deleuze 1989: 129).\n\nDeleuze and Guattari’s refusal to recognize that their work\ncontains metaphors is due to their struggle against the\n“imperialism” of the signifying regime, a major theme in\nboth Anti-Oedipus and A Thousand Plateaus: not every\nrelation between different intellectual fields can be grasped by the\nmost common notions of “metaphor,” reliant as they are on\nthe notion of a transfer of sense from primary to secondary\nsignification.\n5. Deleuze and the Arts\n\nKant had dissociated aesthetics into two halves: the theory of\nsensibility as the form of possible experience (the\n“Transcendental Aesthetic” of the Critique of Pure\nReason), and the theory of art as a reflection on real experience\n(the “Critique of Aesthetic Judgment” in the Critique\nof Judgment). In Deleuze’s work, these two halves of\naesthetics are reunited: if the most general aim of art is to\n“produce a sensation,” then the genetic principles of\nsensation are at the same time the principles of composition for works\nof art; conversely, it is works of art that are best capable of\nrevealing these conditions of sensibility. Deleuze therefore writes on\nthe arts not as a critic but as a philosopher, and his books and\nessays on the various arts—including the cinema (Cinema\nI and II), literature (Essays Critical and Clinical), and\npainting (Francis Bacon: The Logic of Sensation)—must\nbe read as philosophical explorations of this transcendental domain of\nsensibility.\n\nThe cinema, for instance, produces images that move, and that move in\ntime, and it is these two aspects of film that Deleuze set out to\nanalyze in The Movement-Image and The Time-Image:\n“What exactly does the cinema show us about space and time that\nthe other arts don’t show?” Deleuze thus describes his\ntwo-volume Cinema as “a book of logic, a logic of the\ncinema” that sets out “to isolate certain cinematographic\nconcepts,” concepts which are specific to the cinema, but which\ncan only be formed philosophically. Francis Bacon: The Logic of\nSensation likewise creates a series of philosophical concepts,\neach of which relates to a particular aspect of Bacon’s\npaintings, but which also find a place in “a general logic of\nsensation.”\n\nIn general, Deleuze will locate the conditions of sensibility in an\nintensive conception of space and a virtual conception of time, which\nare necessarily actualized in a plurality of spaces and a complex\nrhythm of times (for instance, in the non-extended spaces and\nnon-linear times of modern mathematics and physics).\n\nFor Deleuze, the task of art is to produce “signs” that\nwill push us out of our habits of perception into the conditions of\ncreation. When we perceive via the re-cognition of the properties of\nsubstances, we see with a stale eye pre-loaded with clichés; we\norder the world in what Deleuze calls “representation.” In\nthis regard, Deleuze cites Francis Bacon: we’re after an artwork\nthat produces an effect on the nervous system, not on the brain. What\nhe means by this figure of speech is that in an art encounter we are\nforced to experience the “being of the sensible.” We get\nsomething that we cannot re-cognize, something that is\n“imperceptible”—it doesn’t fit the hylomorphic\nproduction model of perception in which sense data, the\n“matter” or hyle of sensation, is ordered by\nsubmission to conceptual form. Art however cannot be re-cognized, but\ncan only be sensed; in other words, art splits perceptual processing,\nforbidding the move to conceptual ordering. This is exactly what Kant\nin the Third Critique called reflective judgment: when the concept is\nnot immediately given in the presentation of art. With art we reach\n“sensation,” or the “being of the sensible,”\nthe sentiendum.\n\nDeleuze talks about this effect of sensation as the\n“transcendent exercise” of the faculty of sensibility;\nhere we could refer to the third chapter of Difference and\nRepetition, where Deleuze lays out a non-Kantian\n“differential theory of the faculties.” In this remarkable\ntheory, intensity is “difference in itself,” that which\ncarries the faculties to their limits. The faculties are linked in\norder; here we see what Deleuze calls the privilege of sensibility as\norigin of knowledge—the “truth of empiricism.” In\nthe differential theory of the faculties, sensibility, imagination,\nmemory, and thought all “communicate a violence” from one\nto the other. With sensibility, pure difference in intensity is\ngrasped immediately in the encounter as the sentiendum; with\nimagination, the disparity in the phantasm is that which can only be\nimagined. With memory, in turn, the memorandum is the\ndissimilar in the pure form of time, or the immemorial of transcendent\nmemory. With thought, a fractured self is constrained to think\n“difference in itself” in Ideas. Thus the “free form\nof difference” moves each faculty and communicates its violence\nto the next. You have to be forced to think, starting with an art\nencounter in which intensity is transmitted in signs or sensation.\nRather than a “common sense” in which all the faculties\nagree in recognizing the “same” object, we find in this\ncommunicated violence a “discordant harmony” (compare the\nKantian sublime) that tears apart the subject (here we find the notion\nof “cruelty” Deleuze picks up from Artaud).\n6. The Reception of Deleuze\n\nThe writings of Deleuze have provoked a large literature of\nexplication and introduction in both French and English; more\nrecently, works in German, Italian, and other European languages have\nappeared. There have also been noteworthy critiques. Rather than\nattempt a complete survey of the voluminous secondary literature, we\nwill concentrate on a few of the major critiques.\n6.1 The feminist critique\n\nAn early wave of criticism was directed in the 1980s at\nDeleuze’s collaborations with Guattari by feminists such as\nAlice Jardine and Luce Irigaray. Jardine 1985 criticized the concept\nof “becoming-woman” in A Thousand Plateaus, which\nDeleuze and Guattari position as the first step towards a\nde-subjectivizing “becoming-indiscernible.” Jardine argued\nthat Deleuze and Guattari’s claim that even women must undergo a\n“becoming-woman” amounts to a threat to the hard-fought\nvictories of concrete feminist struggle that allowed women to claim a\nsubjectivity in the first place. According to Grosz 1994’s\nsurvey of the early feminist critiques, Irigaray argued that the use\nof “becoming-woman” as a figure of change incumbent upon\nall, including men, amounts to a masculinist and desexualizing\nappropriation of feminist struggle. In the 1990s and now into the\n2000s, a number of feminists associated with the “corporeal\nfeminism” movement have attempted positive connections with\nDeleuze in the name of an open and experimental attitude toward bodily\npotentials, in both the singular and political registers, as in the\nphrase “body politic.” See among others Braidotti 1994 and\n2002; Gatens 1996; Grosz 1994 and 1995; Olkowski 1999; Lorraine 1999;\nand the essays in Buchanan and Colebrook 2002.\n6.2 The Badiouan critique\n\nOne of the most important criticisms of Deleuze was put forth in\nBadiou 1997. Badiou claimed, contrary to the dominant perception, that\nDeleuze is not so much a philosopher of the multiple as of the One.\nConducted in the highly technical idiom for which he is known, Badiou\ncriticizes Deleuze for a certain vitalism, which in Badiou’s\neyes falls short of the axiomatic austerity demanded of philosophy.\nWhereas Badiou merely ignored the collaborative works with Guattari,\nŽižek 2003 conducts a polemic against the Guattari\ncollaborations in favor of a Deleuzean logic of Being characterized as\nan “immaterial affect generated by interacting bodies as a\nsterile surface of pure Becoming” (as in Logic of\nSense). A third critical work in this vein is Hallward 2005. For\nHallward, the singular logic of Deleuze’s thought is analogous\nto the tradition of theophantic thinkers, whereby the divine spark of\ncreation is entombed in creatures; the task of the creature is to\nredeem that divine spark from its creatural prison. But this\nredemption is not annihilation; Deleuze’s philosophy is not that\nof Lacanian-Žižekian\n“renunciation-extinction.”\n\nIn response to the Badiouan critique, we can note that one of the most\npromising leads for future research in discussing the relation of\nBadiou and Deleuze is to concentrate on the type of mathematics each\nthinker prefers. Rather than accepting Badiou’s characterization\nof Deleuze as a thinker of reality in biological terms (as opposed to\nBadiou’s mathematical orientation), we should see Deleuze as\nproposing a “problematic” version of mathematics, versus\nBadiou’s axiomatic conception. This tack has been taken by Smith\n2003.\n6.3 Deleuze and science\n\nDeleuze was aware of the finitist revolution in the history of the\ndifferential calculus, despite Sokal and Bricmont’s 1999\nintimations otherwise. He writes in Difference and\nRepetition, “it is a mistake to tie the value of the symbol\ndx to the existence of infinitesimals; but it is also a\nmistake to refuse it any ontological or gnoseological value in the\nname of a refusal of the latter. In fact, there is a treasure buried\nwithin the old so-called barbaric or pre-scientific interpretations of\nthe differential calculus, which must be separated from its\ninfinitesimal matrix. A great deal of heart and a great deal of truly\nphilosophical naivety is needed in order to take the symbol\ndx seriously …” (170). It seems obvious here\nthat Deleuze’s treatment of early forms of the differential\ncalculus is not meant as an intervention into the history of\nmathematics, or an attempt at a philosophy of mathematics, but as an\ninvestigation seeking to form a properly philosophical concept of\ndifference by means of extracting certain forms of thought from what\nhe clearly labels as antiquated mathematical methods. (For positive\nviews of Deleuze’s use of mathematics as provocations for the\nformation of his philosophical concepts, see the essays in Duffy\n2006.)\n\nMassumi 1992 and DeLanda 2003 attempt to show that Deleuze’s\nepistemology and ontology can be brought together with the results of\ncontemporary dynamical systems theory (popularly known as\n“chaos” and “complexity” theory). Bell 2006\nfollows up on this work. Protevi 2001 looks at the accompanying\nnotions of hylomorphism and self-organization in the history of\nphilosophy; Bonta and Protevi 2004 treat Deleuze and dynamic systems\ntheory with regard to its potentials for geographical work. For other\nissues on Deleuze and science, see the essays in Marks 2006. Finally,\nAnsell Pearson 1999 brought attention to Deleuze and biology; see also\nToscano 2006 in this regard.\n6.4 Deleuze Effects\n\nAs the interest in Deleuze continues to grow, three of its effects are\nof interest to us, one of which is sociological and the other two of\nwhich are philosophical.\n\nThe sociological effect is the globalization of institutions devoted\nto the study of Deleuze’s thought and its application in various\nfields. A noteworthy institutional initiative is the series of\nconferences sponsored by the journal Deleuze and Guattari\nStudies (see Other Internet Resources) under the leadership of\nIan Buchanan. In addition to numerous conferences in Europe and North\nAmerica, an index of Deleuze’s widespread impact is the success\nof a number of conferences in Asia (to date, Taiwan, India, Singapore,\nSouth Korea, China and Japan).\n\nThe two philosophical effects are that of reviving interest in those\nwhom Deleuze discusses explicitly or those whose influence on Deleuze\ncan be discerned, and that of providing a foil or counterpoint or\nreference point in readings of other philosophers.\n\nThe most prominent example of the revivifying effect is Bergson,\nrelatively forgotten at the time of Deleuze’s\nBergsonism (1966), but now the subject of a growing\nphilosophical literature. Of course, we cannot attribute all this\ninterest to Deleuze’s book and to the subsequent secondary\nliterature on Deleuze that stresses the contribution of Bergson to\nDeleuze’s system (as we ourselves do above on the concept of the\nvirtual and the critique of the possible), but it is not implausible\nto consider the counterfactual whereby without Deleuze’s work\nthe interest in Bergson would not be as strong as it currently is.\nAmong the Bergson commentaries Mullarkey 1999, Guerlac 2006,\nMoulard-Leonard 2009, Grosz 2017, and Lundy 2018 all link the two\nthinkers in their works.\n\nThe post-Kantian Salomon Maimon has been for some time now a subject\nof specialist interest by historians of philosophy; see the entry on\n Maimon;\n see also the recent English translation of his major work [Maimon\n1790 [2010]). Maimon’s relation to Deleuze is explored in Jones\n& Roffe (eds.) 2009, Smith 2010, and Voss 2011.\n\nAnother example of thinker whose current level of interest was\narguably catalyzed by being noticed as an influence on Deleuze is the\nmid-20th century French philosopher Gilbert Simondon, whose notions of\nthe “pre-individual” and of “crystallization”\nwere influential in the development of Deleuze’s notions of the\nvirtual and actualization, respectively. An English translation of his\nworks is Simondon 2020. Among others, see Toscano 2006 and 2009, Scott\n2014, Sauvagnargues 2016, Swan 2016, Alloa and Michalet 2017, and Voss\n2018 and 2020 for treatments of the Deleuze-Simondon relation.\n\nYet another would be the early 20th century French sociologist Gabriel\nTarde, whose notion of microsociology is referred to approvingly in\nDeleuze and Guattari’s development of their notion of\n“micropolitics” (Deleuze and Guattari 1980 [1987,\n216–219]). For Deleuze-inspired treatments, see Alliez 2001,\nBrighenti 2010, Read 2015, Tonkonoff 2017.\n\nMore recently and to a still muted extent is the revival of interest\nin mid-20th century French thinker Raymond Ruyer, whose notion of\nsurvol or “self-survey” is mentioned by Deleuze\nand Guattari in their brief remarks on the consistency of the concept\nin its neural instantiation in What is Philosophy? (Deleuze\nand Guattari 1991 [1994, 210]). English translations of Ruyer’s\nworks are Ruyer 2016 and 2018. Ruyer’s relation to Deleuze is\nexplored in Bains 2002, Bogue 2009 and 2017, and Roffe 2017. Other\ntreatments of Ruyer that are relevant would be Massumi 2014 and Grosz\n2017.\n\nFinally, while it’s certainly the case that Whitehead has\ngarnered continuous interest on his own, a good bit of current\nWhitehead scholarship includes reference to Deleuze as a leitmotif, as\nin Stengers 2011. A noteworthy new work influenced by both Deleuze and\nWhitehead is Williams 2016. See also Shaviro 2009, Robinson 2010, and\nBell 2011 and 2012, on the Deleuze and Whitehead connection.\n", "bibliography": {"categories": ["Primary Literature", "Secondary Literature"], "cat_ref_text": {"Primary Literature": ["</h3>\n<h4>Works by Deleuze</h4>\n<ul class=\"hanging\">", "(1953) <em>Empirisme et subjectivité</em> (Paris: PUF); tr.\nas <em>Empiricism and Subjectivity</em>, by Constantin Boundas, New\nYork: Columbia University Press, 1991.", "(1956) “La Conception de la différence chez\nBergson,” <em>Etudes bergsoniennes</em> 4 (1956): 77–112;\ntr. as “Bergson’s Conception of Difference,” by\nMelissa McMahon, in John Mullarkey (ed.), <em>The New Bergson</em>,\nManchester: Manchester University Press, 1999.", "(1962) <em>Nietzsche et la philosophie</em> (Paris: PUF); tr. as\n<em>Nietzsche and Philosophy</em>, by Hugh Tomlinson, Minneapolis:\nUniversity of Minnesota Press, 1983.", "(1963) <em>La philosophie critique de Kant</em> (Paris: PUF); tr.\nas <em>The Critical Philosophy of Kant</em>, by Hugh Tomlinson and\nBarbara Habberjam, Minneapolis: University of Minnesota Press,\n1984.", "(1966) <em>Le Bergsonisme</em> (Paris: PUF); tr. as\n<em>Bergsonism</em>, by Hugh Tomlinson and Barbara Habberjam, New\nYork: Zone Books, 1988.", "(1967) <em>Présentation de Sacher-Masoch</em> (Paris:\nMinuit); tr. as <em>Masochism: An Interpretation of Coldness and\nCruelty</em>, by Jean McNeil, New York: G. Braziller, 1971.", "(1968) <em>Différence et répétition</em>\n(Paris: PUF); tr. as <em>Difference and Repetition</em>, by Paul\nPatton, New York: Columbia University Press, 1994.", "(1968) <em>Spinoza et le problème de\nl’expression</em> (Paris: Minuit); tr. as <em>Expressionism in\nPhilosophy: Spinoza</em>, by Martin Joughin, New York: Zone Books,\n1990.", "(1969) <em>Logique du sens</em> (Paris: Minuit); tr. as <em>The\nLogic of Sense</em>, by Mark Lester with Charles Stivale, New York:\nColumbia University Press, 1990.", "(1972) “A quoi reconnaît-on le structuralisme?”\nin Francois Châtelet, ed., <em>Histoire de la philosophie</em>,\ntome 8: Le XXe siècle (Paris: Hachette, 1972): 299–335;\ntr. as “How Do We Recognize Structuralism?” in <em>Desert\nIslands</em>, New York: Semiotext(e), 2003.", "(1964 [1970, 1976]) <em>Proust et les signes</em> (Paris: PUF);\ntr. (of 1976 ed) as <em>Proust and Signs: The Complete Text</em>, by\nRichard Howard, Minneapolis: University of Minnesota Press, 2003.", "(1977) <em>Dialogues (avec Claire Parnet)</em> (Paris:\nFlammarion); tr. as <em>Dialogues</em>, by Hugh Tomlinson and Barbara\nHabberjam, New York: Columbia University Press, 1987.", "(1981 [1970]) <em>Spinoza: Philosophie pratique</em>; (Paris:\nPUF); tr. as <em>Spinoza: Practical Philosophy</em>, by Robert Hurley,\nSan Francisco: City Lights Books, 1988.", "(1981) <em>Francis Bacon: Logique de la sensation</em> (Paris:\nEditions de la différence); tr. as <em>Francis Bacon: Logic of\nSensation</em>, by Daniel W. Smith, Minneapolis: University of\nMinnesota Press, 2005.", "(1983) <em>Cinéma I: l’Image-mouvement</em> (Paris:\nMinuit); tr. as <em>Cinema I: The Movement-Image</em>, tr. Hugh\nTomlinson and Barbara Habberjam, Minneapolis: University of Minnesota\nPress, 1986.", "(1985) <em>Cinéma II: l’Image-temps</em> (Paris:\nMinuit); tr. as <em>Cinema II: The Time-Image</em>, by Hugh Tomlinson\nand Barbara Habberjam, Minneapolis: University of Minnesota Press,\n1989.", "(1986) <em>Foucault</em> (Paris: Minuit); tr. as\n<em>Foucault</em>, by Sean Hand, Minneapolis: University of Minnesota\nPress, 1988.", "(1988) <em>Le Pli: Leibniz et le Baroque</em> (Paris: Minuit); tr.\nas <em>The Fold: Leibniz and the Baroque</em>, by Tom Conley,\nMinneapolis: University of Minnesota Press, 1993.", "(1990) <em>Pourparlers</em> (Paris: Minuit); tr. as\n<em>Negotiations</em>, by Martin Joughin, New York: Columbia\nUniversity Press, 1995.", "(1993) <em>Critique et clinique</em> (Paris: Minuit); tr. as\n<em>Essays Critical and Clinical</em>, by Daniel Smith and Michael\nGreco, Minneapolis: University of Minnesota Press, 1997.", "(1995) “L’immanence: une vie,”\n<em>Philosophie</em> 47 (septembre 1), 3–7; tr. as\n“Immanence: A Life” in <em>Two Regimes of Madness</em>,\nNew York: Semiotext(e), 2006.", "(2002) <em>L’Île déserte et autres textes:\ntextes et entretiens 1953–1974</em>, ed. David Lapoujade (Paris:\nMinuit, 2002); tr. as <em>Desert Islands and Other Texts\n(1953–1974)</em>, by Mike Taormina, New York: Semiotext(e),\n2003.", "(2003) <em>Deux régimes de fous: textes et entretiens\n1975–1995</em>, ed. David Lapoujade (Paris: Minuit); tr. as\n<em>Two Regimes of Madness: Texts and Interviews 1975–1995</em>,\nby Ames Hodges and Mike Taormina, New York: Semiotext(e), 2006.", "(2015) <em>Lettres et autres textes</em>, ed. David Lapoujade\n(Paris: Minuit); tr. as <em>Letters and Other Texts</em>, by Ames\nHodges, New York: Semiotext(e), 2020.\n</ul>\n<h4>Works by Deleuze with Félix Guattari</h4>\n<ul class=\"hanging\">", "(1972) <em>L’Anti-Oedipe</em> (Paris: Minuit); tr. as\n<em>Anti-Oedipus</em>, by Robert Hurley, Mark Seem and Helen R. Lane,\nNew York: Viking, 1977; reprint University of Minnesota Press,\n1983.", "(1975) <em>Kafka: pour une littérature mineure</em> (Paris:\nMinuit); tr. as <em>Kafka: For a Minor Literature</em>, by Dana Polan,\nMinneapolis: University of Minnesota Press, 1986.", "(1980) <em>Mille plateaux</em> (Paris: Minuit); tr. as <em>A\nThousand Plateaus</em>, by Brian Massumi, Minneapolis: University of\nMinnesota Press, 1987.", "(1991) <em>Qu’est-ce que la philosophie?</em> (Paris:\nMinuit); tr. as <em>What is Philosophy?</em>, by Hugh Tomlinson and\nGraham Burchell, New York: Columbia University Press, 1994.\n</ul>\n<h3 id=\"SecoLite\">"], "Secondary Literature": ["</h3>\n<ul class=\"hanging\">", "Alliez, Eric (ed.), 1998, <em>Gilles Deleuze: une vie\nphilosophique</em>, Paris: Synthélabo.", "–––, 2001, “Différence et\nrépétition de Gabriel Tarde,” <em>Multitudes</em>,\n7 (4): 171–176.", "–––, 2004, <em>Signature of the World: What is\nDeleuze and Guattari’s Philosophy?</em>, Eliot Ross Albert\n(trans.), London: Continuum.", "Alloa, Emmanuel and Michalet, Judith, 2017, “Differences in\nBecoming: Gilbert Simondon and Gilles Deleuze on Individuation,”\n<em>Philosophy Today</em>, 61 (3): 475–502.", "Ansell Pearson, Keith (ed.), 1997, <em>Deleuze and Philosophy: The\nDifference Engineer</em>, London: Routledge.", "–––, 1999, <em>Germinal Life: The Difference and\nRepetition of Deleuze</em>, London: Routledge.", "Antonioli, Manola, 1999, <em>Deleuze et l’histoire de la\nphilosophie</em>, Paris: Kimé.", "–––, 2003, <em>Géophilosophie de Deleuze\net Guattari</em>, Paris: L’Harmattan.", "Badiou, Alain, 2000, <em>Deleuze: The Clamor of Being</em>, Louise\nBurchill (trans.), Minneapolis: University of Minnesota Press.", "Bains, Paul, 2002, “Subjectless Subjectivities,” in\nBrian Massumi (ed.), <em>A Shock to Thought: Expression after Deleuze\nand Guattari</em>, New York: Routledge, pp. 101–116.", "Beistegui, Miguel de, 2004, <em>Truth and Genesis: Philosophy as\nDifferential Ontology</em>, Bloomington: Indiana University\nPress.", "–––, 2010, <em>Immanence: Deleuze and\nPhilosophy</em>, Edinburgh: Edinburgh University Press.", "Bell, Jeffrey, 2006, <em>Philosophy at the Edge of Chaos: Deleuze\nand the Philosophy of Difference</em>, Toronto: University of Toronto\nPress.", "–––, 2009, <em>Deleuze’s Hume: Philosophy,\nCulture, and the Scottish Enlightenment</em>, Edinburgh: Edinburgh\nUniversity Press.", "–––, 2011, “Nomad Thought: Deleuze,\nWhitehead, and the Adventure of Thinking”, in Roland Faber and\nAndrea Stephenson (eds.), <em>Secrets of Becoming: Negotiating\nWhitehead, Deleuze and Butler</em>, New York: Fordham University\nPress.", "–––, 2012, “Modes of Violence: Whitehead,\nDeleuze, and the Displacement of Neoliberalism,” in Roland\nFaber, Michael Halewood, and Deena Lin (eds.), <em>Butler on\nWhitehead: On the Occasion</em>, Lanham MD: Lexington Books,\n127–145.", "Bergen, Veronique, 2003, <em>L’Ontologie de Gilles\nDeleuze</em>, Paris: L’Harmattan.", "Bogue, Ronald, 1989, <em>Deleuze and Guattari</em>, New York:\nRoutledge.", "–––, 2003, <em>Deleuze on Cinema</em>, New York:\nRoutledge.", "–––, 2003, <em>Deleuze on Literature</em>, New\nYork: Routledge.", "–––, 2003, <em>Deleuze on Music, Painting, and\nthe Arts</em>, New York: Routledge.", "–––, 2009, “Raymond Ruyer,” in\nGraham Jones and Jon Roffe, <em>Deleuze’s Philosophical\nLineage</em>, Edinburgh: Edinburgh University Press, pp.\n300–320.", "–––, 2017, “The Force that Is but Does Not\nAct: Ruyer, Leibniz and Deleuze,” <em>Deleuze Studies</em>, 11\n(4): 518–537.", "Bonta, Mark, and John Protevi, 2004, <em>Deleuze and\nGeophilosophy: A Guide and Glossary</em>, Edinburgh: Edinburgh\nUniversity Press.", "Boundas, Constantin, 2011, <em>Gilles Deleuze: The Intensive\nReduction</em>, London: Continuum.", "––– (ed.), 2006, <em>Deleuze and\nPhilosophy</em>, Edinburgh: Edinburgh University Press.", "–––, and Dorothea Olkowski (eds.), 1994,\n<em>Gilles Deleuze and the Theatre of Philosophy</em>, New York:\nRoutledge.", "Braidotti, Rosi, 1994, “Toward a New Nomadism: Feminist\nDeleuzian Tracks; or, Metaphysics and Metabolism,” in Boundas\nand Olkowski (eds.) 1994, pp. 159–186.", "–––, 2002, <em>Metamorphoses: Towards a\nMaterialist Theory of Becoming</em>, Cambridge: Polity.", "Brighenti, Andrea, 2010, “Tarde, Canetti, and Deleuze on\nCrowds and Packs,” <em>Journal of Classical Sociology</em>, 10\n(4): 291–314.", "Broadhurst, Joan (ed.), 1992, <em>Deleuze and the Transcendental\nUnconscious</em>, in <em>PLI: Warwick Journal of Philosophy</em>\n(Volume 4).", "Brusseau, James, 1998, <em>Isolated Experiences: Gilles Deleuze\nand the Solitudes of Reversed Platonism</em>, Albany: SUNY Press.", "Bryant, Levi, 2008, <em>Difference and Givenness: Deleuze’s\nTranscendental Empiricism and the Ontology of Immanence</em>,\nEvanston: Northwestern University Press.", "Bryden, Mary (ed.), 2002, <em>Deleuze and Religion</em>, London:\nRoutledge.", "Buchanan, Ian, 2000, <em>Deleuzism: A Metacommentary</em>, Durham:\nDuke University Press.", "–––, 2008, <em>Deleuze and Guattari’s\n‘Anti-Oedipus’: A Reader’s Guide</em>, London:\nContinuum.", "–––, and Claire Colebrook (eds.), 2000,\n<em>Deleuze and Feminist Theory</em>, Edinburgh: Edinburgh University\nPress.", "Chamois, Camille, 2022, <em>Un autre monde possible: Gilles\nDeleuze face aux perspectivismes contemporains</em>, Rennes: Presses\nuniversitaires de Rennes.", "Colebrook, Claire, 2001, <em>Gilles Deleuze</em> (Routledge\nCritical Thinkers). New York: Routledge.", "–––, 2010, <em>Deleuze and the Meaning of\nLife</em>, London: Continuum.", "Colman, Felicity, 2011, <em>Deleuze and Cinema: The Film\nConcepts</em>, London: Berg.", "DeLanda, Manuel, 2003, <em>Intensive Science and Virtual\nPhilosophy</em>, London: Continuum.", "Dosse, François, 2010, <em>Gilles Deleuze and Félix\nGuattari: Intersecting Lives</em>, trans. Deborah Glassman. New York:\nColumbia University Press.", "Due, Reidar, 2007, <em>Deleuze</em>, Cambridge: Polity Press.", "Duffy, Simon (ed.), 2006, <em>Intensive Mathematics: The Logic of\nDifference</em>, Manchester: Clinamen Press.", "–––. 2006, <em>The Logic of Expression: Quality,\nQuantity and Intensity in Spinoza, Hegel and Deleuze</em>, London:\nAshgate.", "Faulkner, Keith, 2007, <em>The Force of Time: An Introduction to\nDeleuze through Proust</em>, Lanham MD: University Press of\nAmerica.", "Flaxman, Gregory, 2000, <em>The Brain is the Screen: Deleuze and\nthe Philosophy of Cinema</em>, Minneapolis: University of Minnesota\nPress.", "–––, 2011, <em>Gilles Deleuze and the Fabulation\nof Philosophy</em>, Minneapolis: University of Minnesota Press.", "Gaffney, Peter (ed.), 2010, <em>The Force of the Virtual: Deleuze,\nScience, and Philosophy</em>, Minneapolis: University of Minnesota\nPress.", "Gatens, Moira, 1996, “Through a Spinozist Lens: Ethology,\nDifference, Power,” in Patton 1996, pp. 162–187.", "Genosko, Gary, 2002, <em>Félix Guattari: An Aberrant\nIntroduction</em>, London: Continuum.", "Goodchild, Philip, 1997, <em>Deleuze and Guattari: An Introduction\nto the Politics of Desire</em>, Thousand Oaks: Sage.", "Grosz, Elizabeth, 1994, “A Thousand Tiny Sexes,” in\nConstatin Boundas and Dorothea Olkowski (eds.), <em>Gilles Deleuze and\nthe Theatre of Philosophy</em>, New York: Routledge, pp.\n187–210.", "–––, 1995, <em>Space, Time, and Perversion:\nEssays on the Politics of Bodies</em>, New York: Routledge.", "–––, 2017, <em>The Incorporeal: Ontology,\nEthics, and the Limits of Materialism</em>, New York: Columbia\nUniversity Press.", "Gualandi, Alberto, 1998, <em>Deleuze</em>, Paris: Les Belles\nLettres.", "Guerlac, Suzanne, 2006, <em>Thinking in Time: An Introduction to\nHenri Bergson</em>, Ithaca NY: Cornell University Press.", "Gueroult, Martial, 1930, <em>La philosophie transcendentale de\nSalomon Maimon</em>, Paris: Société\nd’édition.", "Hallward, Peter, 2006, <em>Out of This World: Deleuze and the\nPhilosophy of Creation</em>, London: Verso.", "Hardt, Michael, 1993, <em>Gilles Deleuze: An Apprenticeship in\nPhilosophy</em>, Minneapolis: University of Minnesota Press.", "Holland, Eugene, 1999, <em>Deleuze and Guattari’s\nAnti-Oedipus: Introduction to Schizoanalysis</em>, New York:\nRoutledge.", "Hughes, Joe, 2009, <em>Deleuze’s Difference and Repetition:\nA Reader’s Guide</em>, London: Continuum.", "–––, 2009, <em>Deleuze and the Genesis of\nRepresentation</em>, London: Continuum.", "–––, 2012, <em>Philosophy After Deleuze</em>,\nLondon: Continuum.", "Jardine, Alice, 1986, <em>Gynesis: Configurations of Woman and\nModernity</em>, Ithaca: Cornell University Press.", "Jones, Graham, and Jon Roffe (eds.), 2009, <em>Deleuze’s\nPhilosophical Lineage</em>, vol. 1, Edinburgh: Edinburgh University\nPress.", "–––, 2019, <em>Deleuze’s Philosophical\nLineage</em>, vol. 2, Edinburgh: Edinburgh University Press.", "Kaufman, Eleanor, 2012, <em>Deleuze, the Dark Precursor:\nDialectic, Structure, Being</em>, Baltimore: Johns Hopkins University\nPress.", "–––, and Jon Heller (eds.), 1998, <em>Deleuze\n&amp; Guattari: New Mappings in Philosophy, Politics and Culture</em>,\nMinneapolis: University of Minnesota.", "Kerslake, Christian, 2007, <em>Deleuze and the Unconscious</em>,\nLondon: Continuum.", "Khalfa, Jean (ed.), 2003, <em>An Introduction to the Philosophy of\nGilles Deleuze</em>, London: Continuum.", "Lambert, Gregg, 2002, <em>The Non-Philosophy of Gilles\nDeleuze</em>, London: Continuum.", "–––, 2012, <em>In Search of a New Image of\nThought: Gilles Deleuze and Philosophical Expressionism</em>,\nMinneapolis: University of Minnesota Press.", "Lampert, Jay, 2006, <em>Deleuze and Guattari’s Philosophy of\nHistory</em>, London: Continuum.", "Lapoujade, David, 2017, <em>Aberrant Mouvements: The Philosophy of\nGilles Deleuze</em>, translated by Joshua David Jordan, South\nPasadena, CA: Semiotext(e).", "Lecercle, Jean-Jacques, 1985, <em>Philosophy through the Looking\nGlass</em>, Chicago: Open Court.", "–––, 2002, <em>Deleuze and Language</em>,\nLondon: Palgrave Macmillan.", "Lefebvre, Alexandre, 2008, <em>The Image of Law: Deleuze, Bergson,\nSpinoza</em>, Stanford: Stanford University Press.", "Lorraine, Tamsin, 1999, <em>Irigaray and Deleuze: Experiments in\nVisceral Philosophy</em>, Ithaca: Cornell University Press.", "Lundy, Craig, 2018, <em>Deleuze’s Bergsonism</em>,\nEdinburgh: Edinburgh University Press.", "Marks, John, 1998, <em>Gilles Deleuze: Vitalism and\nMultiplicity</em>, Pluto Press: London.", "–––, (ed.), 2006. <em>Deleuze and Science</em>,\nEdinburgh: Edinburgh University Press.", "Maimon, Salomon, 1790 [2010], <em>Essay on Transcendental\nPhilosophy</em>, translated by Nick Midgley, Henry Somers-Hall,\nAlistair Welchman, and Merten Reglitz, London: Continuum, 2010.", "Martin, Jean-Clet, 1993, <em>Variations: La philosophie de Gilles\nDeleuze</em>, Paris: Payot &amp; Rivages.", "Massumi, Brian, 1992, <em>A User’s Guide to Capitalism and\nSchizophrenia</em>, Cambridge, MA: MIT Press.", "–––, 2014, <em>What Animals Teach Us about\nPolitics</em>, Durham, NC: Duke University Press.", "May, Todd, 2005, <em>Gilles Deleuze: An Introduction</em>,\nCambridge: Cambridge University Press.", "Mengue, Phillipe, 1994, <em>Gilles Deleuze ou le système du\nmultiple</em>, Paris: Kimé", "–––, 2003, <em>Deleuze et la question de la\ndémocratie</em>, Paris: L’Harmattan.", "Moulard-Leonard, Valentine, 2009, <em>Deleuze-Bergson Encounters:\nTranscendental Experience and the Thought of the Virtual</em>, Albany\nNY: SUNY Press.", "Murphy, Timothy S., 1992, “The Philosophy (of the Theatre)\nof Cruelty in Gilles Deleuze’s <em>Difference and\nRepetition</em>,” in Broadhurst 1992, pp. 105–135.", "Olkowski, Dorothea, 1999, <em>Gilles Deleuze and the Ruin of\nRepresentation</em>, Berkeley: University of California Press.", "–––, 2007, <em>The Universal (In the Realm of\nthe Sensible): Beyond Continental Philosophy</em>, New York: Columbia\nUniversity Press.", "O’Sullivan, Simon, 2006, <em>Art Encounters Deleuze and\nGuattari: Thought Beyond Representation</em>, London: Palgrave\nMacmillan.", "Patton, Paul (ed.), 1996, <em>Deleuze: A Critical Reader</em>,\nOxford: Blackwell.", "–––, 1999, <em>Deleuze and the Political</em>,\nLondon: Routledge.", "–––, 2010, <em>Deleuzian Concepts: Philosophy,\nColonization, Politics</em>, Stanford: Stanford University Press.", "Patton, Paul, and John Protevi (eds.), 2003, <em>Between Deleuze\nand Derrida</em>, London: Continuum.", "Pisters, Patricia, 2012, <em>The Neuro-Image: A Deleuzian\nFilm-Philosophy of Digital Culture</em>, Stanford: Stanford University\nPress.", "Protevi, John, 2001, <em>Political Physics: Deleuze, Derrida, and\nthe Body Politic</em>, London: Athlone.", "–––, 2009, <em>Political Affect: Connecting the\nSocial and the Somatic</em>, Minneapolis: University of Minnesota\nPress.", "–––, 2011, “Mind in Life, Mind in Process:\nToward a New Transcendental Aesthetic and a New Question of\nPanpsychism.” <em>Journal of Consciousness Studies</em>,\n18(5–6): 94–116.", "–––, 2013, <em>Life, War, Earth: Deleuze and the\nSciences</em>, Minneapolis: University of Minnesota Press.", "Rajchman, John, 2000, <em>The Deleuze Connections</em>, Cambridge\nMA: MIT Press.", "Ramey, Joshua, 2012, <em>The Hermetic Deleuze: Philosophy and\nSpiritual Ordeal</em>, Durham NC: Duke University Press.", "Read, Jason, 2015, <em>The Politics of Transindividuality</em>,\nChicago: Haymarket Books.", "Reynolds, Jack, 2011, <em>Chronopathologies: Time and Politics in\nDeleuze, Derrida, Analytic Philosophy, and Phenomenology</em>, Lanham\nMD: Lexington Books.", "Robinson, Keith, 2010, “Towards a Political Ontology of the\nFold: Deleuze, Heidegger, Whitehead and the ‘Fourfold’\nEvent,” in Sjoerd van Tuinen, and Niamh McDonnell (eds.),\n<em>Deleuze and the Fold: A Critical Reader</em>, London: Palgrave\nMacmillan pp. 184–202.", "Rodowick, David, 1997, <em>Gilles Deleuze’s Time\nMachine</em>, Durham: Duke University Press.", "Roffe, Jon, 2012, <em>Badiou’s Deleuze</em>, Montreal:\nMcGill Queen’s University Press.", "–––, 2017, “Form IV: From Ruyer’s\nPsychobiology to Deleuze and Guattari’s Socius,”\n<em>Deleuze Studies</em>, 11 (4): 580–599.", "–––, 2020, <em>The Works of Gilles Deleuze I:\n1953–1969</em>, Melbourne: re.press.", "Rolli, Marc, 2016, <em>Gilles Deleuze’s Transcendental\nEmpiricism: From Tradition to Difference</em>, translated by Peter\nHertz-Ohmes, Edinburgh: Edinburgh University Press.", "Ruyer, Raymond, 2016, <em>Neo-Finalism</em>, translated by Alyosha\nEdlebi, Minneapolis: University of Minnesota Press.", "–––, 2018, <em>The Genesis of Living Forms</em>,\ntranslated by Jon Roffe and Nicholas B. de Weydenthal, Lanham MD:\nRowman &amp; Littlefield.", "Sartre, Jean-Paul, 1937 [1991], <em>The Transcendence of the Ego:\nAn Existentialist Theory of Consciousness</em>, New York: Hill and\nWang, 1991", "Sauvagnargues, Anne, 2009, <em>Deleuze. L’empirisme\ntranscendental</em>, Paris: Presses Universitaires de France.", "–––, 2013, <em>Deleuze and Art</em>, translated\nby Samantha Bankston, London: Bloomsbury Academic.", "–––, 2016, <em>Artmachines: Deleuze, Guattari,\nSimondon</em>, translated by Suzanne Verderber and Eugene W. Holland,\nEdinburgh: Edinburgh University Press.", "Schaub, Mirjam, 2003, <em>Gilles Deleuze im Wunderland: Zeit als\nEreignisphilosophie</em>, Munich: Wilhelm Fink.", "–––, 2003, <em>Gilles Deleuze im Kino: Das\nSichtbare und das Sagbare</em>, Munich: Wilhelm Fink.", "Scott, David, 2014, <em>Gilbert Simondon’s</em> Psychic and\nCollective Individuation<em>: A Critical Introduction and Guide</em>,\nEdinburgh: Edinburgh University Press.", "Shaviro, Steven, 2009, <em>Without Criteria: Kant, Whitehead,\nDeleuze, and Aesthetics</em>, Cambridge MA: MIT Press.", "Sibertin-Blanc, Guillaume, 2016, <em>State and Politics, Deleuze\nand Guattari on Marx</em>, translated by Ames Hodges, South Pasadena,\nCA: Semiotext(e).", "Simondon, Gilbert, 2020, <em>Individuation in Light of Notions of\nForm and Information</em>, 2 vols, Minneapolis: University of\nMinnesota Press.", "Simont, Juliette, 1997, <em>Essai sur la quantité, la\nqualité, la relation chez Kant, Hegel, Deleuze: Les\n“fleurs noires” de la logique philosophique</em>, Paris:\nL’Harmattan.", "Sokal, Alan and Jean Bricmont, 1999, <em>Fashionable Nonsense:\nPostmodern Intellectuals’ Abuse of Science</em>, New York:\nPicador.", "Smith, Daniel W., 2010, “Genesis and Difference: Deleuze,\nMaimon, and the Post-Kantian Reading of Leibniz,” in Sjoerd van\nTuinen, and Niamh McDonnell (eds.), <em>Deleuze and the Fold: A\nCritical Reader</em>, London: Palgrave Macmillan, pp.\n132–154.", "–––, 2012, <em>Essays on Deleuze</em>,\nEdinburgh: Edinburgh University Press.", "–––, and Henry Somers-Hall (eds.), 2012, <em>The\nCambridge Companion to Deleuze</em>, Cambridge: Cambridge University\nPress.", "Somers-Hall, Henry, 2012, <em>Hegel, Deleuze, and the Critique of\nRepresentation: Dialectics of Negative and Difference</em>, Albany NY:\nSUNY Press.", "–––, 2013, <em>Deleuze’s Difference and\nRepetition</em>, Edinburgh: Edinburgh University Press.", "Stengers, Isabelle, 2011, <em>Thinking with Whitehead: A Free and\nWild Creation of Concepts</em>, Cambridge MA: Harvard University\nPress.", "Stivale, Charles, 1998, <em>The Two Fold Thought of Deleuze and\nGuattari</em>, New York: Guilford.", "–––, 2005, <em>Gilles Deleuze: Key\nConcepts</em>, London: Continuum.", "–––, 2008, <em>Gilles Deleuze’s ABCs: The\nFolds of Friendship</em>, Baltimore: Johns Hopkins University\nPress.", "Swan, Melanie, 2016, <em>Cognitive Enhancement as Subjectivation:\nBergson, Deleuze &amp; Simondon</em>, Saarbrücken: Lambert\nAcademic Publishing.", "Thoburn, Nick, 2003, <em>Deleuze, Marx and Politics</em>, London:\nRoutledge.", "Tonkonoff, Sergio, 2017, <em>From Tarde to Deleuze and Foucault:\nThe Infinitesimal Revolution</em>, London: Palgrave Macmillan.", "Toscano, Alberto, 2006, <em>Theatre of Production: Philosophy and\nIndividuation Between Kant and Deleuze</em>, London: Palgrave\nMacmillan.", "–––, 2009, “Gilbert Simondon,” in\nGraham Jones and Jon Roffe, <em>Deleuze’s Philosophical\nLineage</em>, Edinburgh: Edinburgh University Press, pp.\n380–398.", "Tuinen, Sjoerd van, and Niamh McDonnell (eds.), 2010, <em>Deleuze\nand the Fold: A Critical Reader</em>, London: Palgrave Macmillan.", "Villani, Arnaud, 1999, <em>La guêpe et\nl’orchidée: Essai sur Gilles Deleuze</em>, Paris:\nBelin.", "Voss, Daniela, 2011, “Maimon and Deleuze: The Viewpoint of\nInternal Genesis and the Concept of Differentials,”\n<em>Parrhesia</em>, 11: 62–74.", "–––, 2018, “Simondon on the Notion of the\nProblem: A Genetic Schema of Individuation,” <em>Angelaki</em>,\n23(2): 94–112.", "–––, 2020, “The Problem of Method: Deleuze\nand Simondon,” <em>Deleuze and Guattari Studies</em> 14(1):\n87–108.", "Welchman, Alistair, 2009, “Deleuze’s Post-Critical\nMetaphysics,” <em>Symposium</em>: <em>Canadian Journal of\nContinental Philosophy</em>, 13(2): 25–54.", "Widder, Nathan, 2002, <em>Genealogies of Difference</em>, Urbana:\nUniversity of Illinois Press.", "–––, 2012, <em>Political Theory after\nDeleuze</em>, London: Continuum.", "Williams, James, 2004, <em>Gilles Deleuze’s Difference and\nRepetition: A Critical Introduction and Guide</em>, Edinburgh:\nEdinburgh University Press.", "–––, 2005, <em>The Transversal Thought of Gilles\nDeleuze: Encounters and Influences</em>, Manchester: Clinamen\nPress.", "–––, 2008, <em>Gilles Deleuze’s Logic of\nSense: A Critical Introduction and Guide</em>, Edinburgh: Edinburgh\nUniversity Press.", "–––, 2011, <em>Gilles Deleuze’s Philosophy\nof Time: A Critical Introduction and Guide</em>, Edinburgh: Edinburgh\nUniversity Press.", "–––, 2016, <em>A Process Philosophy of\nSigns</em>, Edinburgh: Edinburgh University Press.", "Zepke, Stephen, 2005, <em>Art as Abstract Machine: Ontology and\nAesthetics in Deleuze and Guattari</em>, London: Routledge.", "Žižek, Slavoj, 2003, <em>Organs Without Bodies: On\nDeleuze and Consequences</em>, New York: Routledge.", "Zourabichvili, François, 2012, <em>Deleuze: A Philosophy of\nthe Event</em>, Kieran Aarons (trans.), Gregg Lambert and Daniel W.\nSmith (eds.), Edinburgh: Edinburgh University Press.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLite\">Primary Literature</h3>\n<h4>Works by Deleuze</h4>\n<ul class=\"hanging\">\n<li>(1953) <em>Empirisme et subjectivité</em> (Paris: PUF); tr.\nas <em>Empiricism and Subjectivity</em>, by Constantin Boundas, New\nYork: Columbia University Press, 1991.</li>\n<li>(1956) “La Conception de la différence chez\nBergson,” <em>Etudes bergsoniennes</em> 4 (1956): 77–112;\ntr. as “Bergson’s Conception of Difference,” by\nMelissa McMahon, in John Mullarkey (ed.), <em>The New Bergson</em>,\nManchester: Manchester University Press, 1999.</li>\n<li>(1962) <em>Nietzsche et la philosophie</em> (Paris: PUF); tr. as\n<em>Nietzsche and Philosophy</em>, by Hugh Tomlinson, Minneapolis:\nUniversity of Minnesota Press, 1983.</li>\n<li>(1963) <em>La philosophie critique de Kant</em> (Paris: PUF); tr.\nas <em>The Critical Philosophy of Kant</em>, by Hugh Tomlinson and\nBarbara Habberjam, Minneapolis: University of Minnesota Press,\n1984.</li>\n<li>(1966) <em>Le Bergsonisme</em> (Paris: PUF); tr. as\n<em>Bergsonism</em>, by Hugh Tomlinson and Barbara Habberjam, New\nYork: Zone Books, 1988.</li>\n<li>(1967) <em>Présentation de Sacher-Masoch</em> (Paris:\nMinuit); tr. as <em>Masochism: An Interpretation of Coldness and\nCruelty</em>, by Jean McNeil, New York: G. Braziller, 1971.</li>\n<li>(1968) <em>Différence et répétition</em>\n(Paris: PUF); tr. as <em>Difference and Repetition</em>, by Paul\nPatton, New York: Columbia University Press, 1994.</li>\n<li>(1968) <em>Spinoza et le problème de\nl’expression</em> (Paris: Minuit); tr. as <em>Expressionism in\nPhilosophy: Spinoza</em>, by Martin Joughin, New York: Zone Books,\n1990.</li>\n<li>(1969) <em>Logique du sens</em> (Paris: Minuit); tr. as <em>The\nLogic of Sense</em>, by Mark Lester with Charles Stivale, New York:\nColumbia University Press, 1990.</li>\n<li>(1972) “A quoi reconnaît-on le structuralisme?”\nin Francois Châtelet, ed., <em>Histoire de la philosophie</em>,\ntome 8: Le XXe siècle (Paris: Hachette, 1972): 299–335;\ntr. as “How Do We Recognize Structuralism?” in <em>Desert\nIslands</em>, New York: Semiotext(e), 2003.</li>\n<li>(1964 [1970, 1976]) <em>Proust et les signes</em> (Paris: PUF);\ntr. (of 1976 ed) as <em>Proust and Signs: The Complete Text</em>, by\nRichard Howard, Minneapolis: University of Minnesota Press, 2003.</li>\n<li>(1977) <em>Dialogues (avec Claire Parnet)</em> (Paris:\nFlammarion); tr. as <em>Dialogues</em>, by Hugh Tomlinson and Barbara\nHabberjam, New York: Columbia University Press, 1987.</li>\n<li>(1981 [1970]) <em>Spinoza: Philosophie pratique</em>; (Paris:\nPUF); tr. as <em>Spinoza: Practical Philosophy</em>, by Robert Hurley,\nSan Francisco: City Lights Books, 1988.</li>\n<li>(1981) <em>Francis Bacon: Logique de la sensation</em> (Paris:\nEditions de la différence); tr. as <em>Francis Bacon: Logic of\nSensation</em>, by Daniel W. Smith, Minneapolis: University of\nMinnesota Press, 2005.</li>\n<li>(1983) <em>Cinéma I: l’Image-mouvement</em> (Paris:\nMinuit); tr. as <em>Cinema I: The Movement-Image</em>, tr. Hugh\nTomlinson and Barbara Habberjam, Minneapolis: University of Minnesota\nPress, 1986.</li>\n<li>(1985) <em>Cinéma II: l’Image-temps</em> (Paris:\nMinuit); tr. as <em>Cinema II: The Time-Image</em>, by Hugh Tomlinson\nand Barbara Habberjam, Minneapolis: University of Minnesota Press,\n1989.</li>\n<li>(1986) <em>Foucault</em> (Paris: Minuit); tr. as\n<em>Foucault</em>, by Sean Hand, Minneapolis: University of Minnesota\nPress, 1988.</li>\n<li>(1988) <em>Le Pli: Leibniz et le Baroque</em> (Paris: Minuit); tr.\nas <em>The Fold: Leibniz and the Baroque</em>, by Tom Conley,\nMinneapolis: University of Minnesota Press, 1993.</li>\n<li>(1990) <em>Pourparlers</em> (Paris: Minuit); tr. as\n<em>Negotiations</em>, by Martin Joughin, New York: Columbia\nUniversity Press, 1995.</li>\n<li>(1993) <em>Critique et clinique</em> (Paris: Minuit); tr. as\n<em>Essays Critical and Clinical</em>, by Daniel Smith and Michael\nGreco, Minneapolis: University of Minnesota Press, 1997.</li>\n<li>(1995) “L’immanence: une vie,”\n<em>Philosophie</em> 47 (septembre 1), 3–7; tr. as\n“Immanence: A Life” in <em>Two Regimes of Madness</em>,\nNew York: Semiotext(e), 2006.</li>\n<li>(2002) <em>L’Île déserte et autres textes:\ntextes et entretiens 1953–1974</em>, ed. David Lapoujade (Paris:\nMinuit, 2002); tr. as <em>Desert Islands and Other Texts\n(1953–1974)</em>, by Mike Taormina, New York: Semiotext(e),\n2003.</li>\n<li>(2003) <em>Deux régimes de fous: textes et entretiens\n1975–1995</em>, ed. David Lapoujade (Paris: Minuit); tr. as\n<em>Two Regimes of Madness: Texts and Interviews 1975–1995</em>,\nby Ames Hodges and Mike Taormina, New York: Semiotext(e), 2006.</li>\n<li>(2015) <em>Lettres et autres textes</em>, ed. David Lapoujade\n(Paris: Minuit); tr. as <em>Letters and Other Texts</em>, by Ames\nHodges, New York: Semiotext(e), 2020.</li>\n</ul>\n<h4>Works by Deleuze with Félix Guattari</h4>\n<ul class=\"hanging\">\n<li>(1972) <em>L’Anti-Oedipe</em> (Paris: Minuit); tr. as\n<em>Anti-Oedipus</em>, by Robert Hurley, Mark Seem and Helen R. Lane,\nNew York: Viking, 1977; reprint University of Minnesota Press,\n1983.</li>\n<li>(1975) <em>Kafka: pour une littérature mineure</em> (Paris:\nMinuit); tr. as <em>Kafka: For a Minor Literature</em>, by Dana Polan,\nMinneapolis: University of Minnesota Press, 1986.</li>\n<li>(1980) <em>Mille plateaux</em> (Paris: Minuit); tr. as <em>A\nThousand Plateaus</em>, by Brian Massumi, Minneapolis: University of\nMinnesota Press, 1987.</li>\n<li>(1991) <em>Qu’est-ce que la philosophie?</em> (Paris:\nMinuit); tr. as <em>What is Philosophy?</em>, by Hugh Tomlinson and\nGraham Burchell, New York: Columbia University Press, 1994.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Alliez, Eric (ed.), 1998, <em>Gilles Deleuze: une vie\nphilosophique</em>, Paris: Synthélabo.</li>\n<li>–––, 2001, “Différence et\nrépétition de Gabriel Tarde,” <em>Multitudes</em>,\n7 (4): 171–176.</li>\n<li>–––, 2004, <em>Signature of the World: What is\nDeleuze and Guattari’s Philosophy?</em>, Eliot Ross Albert\n(trans.), London: Continuum.</li>\n<li>Alloa, Emmanuel and Michalet, Judith, 2017, “Differences in\nBecoming: Gilbert Simondon and Gilles Deleuze on Individuation,”\n<em>Philosophy Today</em>, 61 (3): 475–502.</li>\n<li>Ansell Pearson, Keith (ed.), 1997, <em>Deleuze and Philosophy: The\nDifference Engineer</em>, London: Routledge.</li>\n<li>–––, 1999, <em>Germinal Life: The Difference and\nRepetition of Deleuze</em>, London: Routledge.</li>\n<li>Antonioli, Manola, 1999, <em>Deleuze et l’histoire de la\nphilosophie</em>, Paris: Kimé.</li>\n<li>–––, 2003, <em>Géophilosophie de Deleuze\net Guattari</em>, Paris: L’Harmattan.</li>\n<li>Badiou, Alain, 2000, <em>Deleuze: The Clamor of Being</em>, Louise\nBurchill (trans.), Minneapolis: University of Minnesota Press.</li>\n<li>Bains, Paul, 2002, “Subjectless Subjectivities,” in\nBrian Massumi (ed.), <em>A Shock to Thought: Expression after Deleuze\nand Guattari</em>, New York: Routledge, pp. 101–116.</li>\n<li>Beistegui, Miguel de, 2004, <em>Truth and Genesis: Philosophy as\nDifferential Ontology</em>, Bloomington: Indiana University\nPress.</li>\n<li>–––, 2010, <em>Immanence: Deleuze and\nPhilosophy</em>, Edinburgh: Edinburgh University Press.</li>\n<li>Bell, Jeffrey, 2006, <em>Philosophy at the Edge of Chaos: Deleuze\nand the Philosophy of Difference</em>, Toronto: University of Toronto\nPress.</li>\n<li>–––, 2009, <em>Deleuze’s Hume: Philosophy,\nCulture, and the Scottish Enlightenment</em>, Edinburgh: Edinburgh\nUniversity Press.</li>\n<li>–––, 2011, “Nomad Thought: Deleuze,\nWhitehead, and the Adventure of Thinking”, in Roland Faber and\nAndrea Stephenson (eds.), <em>Secrets of Becoming: Negotiating\nWhitehead, Deleuze and Butler</em>, New York: Fordham University\nPress.</li>\n<li>–––, 2012, “Modes of Violence: Whitehead,\nDeleuze, and the Displacement of Neoliberalism,” in Roland\nFaber, Michael Halewood, and Deena Lin (eds.), <em>Butler on\nWhitehead: On the Occasion</em>, Lanham MD: Lexington Books,\n127–145.</li>\n<li>Bergen, Veronique, 2003, <em>L’Ontologie de Gilles\nDeleuze</em>, Paris: L’Harmattan.</li>\n<li>Bogue, Ronald, 1989, <em>Deleuze and Guattari</em>, New York:\nRoutledge.</li>\n<li>–––, 2003, <em>Deleuze on Cinema</em>, New York:\nRoutledge.</li>\n<li>–––, 2003, <em>Deleuze on Literature</em>, New\nYork: Routledge.</li>\n<li>–––, 2003, <em>Deleuze on Music, Painting, and\nthe Arts</em>, New York: Routledge.</li>\n<li>–––, 2009, “Raymond Ruyer,” in\nGraham Jones and Jon Roffe, <em>Deleuze’s Philosophical\nLineage</em>, Edinburgh: Edinburgh University Press, pp.\n300–320.</li>\n<li>–––, 2017, “The Force that Is but Does Not\nAct: Ruyer, Leibniz and Deleuze,” <em>Deleuze Studies</em>, 11\n(4): 518–537.</li>\n<li>Bonta, Mark, and John Protevi, 2004, <em>Deleuze and\nGeophilosophy: A Guide and Glossary</em>, Edinburgh: Edinburgh\nUniversity Press.</li>\n<li>Boundas, Constantin, 2011, <em>Gilles Deleuze: The Intensive\nReduction</em>, London: Continuum.</li>\n<li>––– (ed.), 2006, <em>Deleuze and\nPhilosophy</em>, Edinburgh: Edinburgh University Press.</li>\n<li>–––, and Dorothea Olkowski (eds.), 1994,\n<em>Gilles Deleuze and the Theatre of Philosophy</em>, New York:\nRoutledge.</li>\n<li>Braidotti, Rosi, 1994, “Toward a New Nomadism: Feminist\nDeleuzian Tracks; or, Metaphysics and Metabolism,” in Boundas\nand Olkowski (eds.) 1994, pp. 159–186.</li>\n<li>–––, 2002, <em>Metamorphoses: Towards a\nMaterialist Theory of Becoming</em>, Cambridge: Polity.</li>\n<li>Brighenti, Andrea, 2010, “Tarde, Canetti, and Deleuze on\nCrowds and Packs,” <em>Journal of Classical Sociology</em>, 10\n(4): 291–314.</li>\n<li>Broadhurst, Joan (ed.), 1992, <em>Deleuze and the Transcendental\nUnconscious</em>, in <em>PLI: Warwick Journal of Philosophy</em>\n(Volume 4).</li>\n<li>Brusseau, James, 1998, <em>Isolated Experiences: Gilles Deleuze\nand the Solitudes of Reversed Platonism</em>, Albany: SUNY Press.</li>\n<li>Bryant, Levi, 2008, <em>Difference and Givenness: Deleuze’s\nTranscendental Empiricism and the Ontology of Immanence</em>,\nEvanston: Northwestern University Press.</li>\n<li>Bryden, Mary (ed.), 2002, <em>Deleuze and Religion</em>, London:\nRoutledge.</li>\n<li>Buchanan, Ian, 2000, <em>Deleuzism: A Metacommentary</em>, Durham:\nDuke University Press.</li>\n<li>–––, 2008, <em>Deleuze and Guattari’s\n‘Anti-Oedipus’: A Reader’s Guide</em>, London:\nContinuum.</li>\n<li>–––, and Claire Colebrook (eds.), 2000,\n<em>Deleuze and Feminist Theory</em>, Edinburgh: Edinburgh University\nPress.</li>\n<li>Chamois, Camille, 2022, <em>Un autre monde possible: Gilles\nDeleuze face aux perspectivismes contemporains</em>, Rennes: Presses\nuniversitaires de Rennes.</li>\n<li>Colebrook, Claire, 2001, <em>Gilles Deleuze</em> (Routledge\nCritical Thinkers). New York: Routledge.</li>\n<li>–––, 2010, <em>Deleuze and the Meaning of\nLife</em>, London: Continuum.</li>\n<li>Colman, Felicity, 2011, <em>Deleuze and Cinema: The Film\nConcepts</em>, London: Berg.</li>\n<li>DeLanda, Manuel, 2003, <em>Intensive Science and Virtual\nPhilosophy</em>, London: Continuum.</li>\n<li>Dosse, François, 2010, <em>Gilles Deleuze and Félix\nGuattari: Intersecting Lives</em>, trans. Deborah Glassman. New York:\nColumbia University Press.</li>\n<li>Due, Reidar, 2007, <em>Deleuze</em>, Cambridge: Polity Press.</li>\n<li>Duffy, Simon (ed.), 2006, <em>Intensive Mathematics: The Logic of\nDifference</em>, Manchester: Clinamen Press.</li>\n<li>–––. 2006, <em>The Logic of Expression: Quality,\nQuantity and Intensity in Spinoza, Hegel and Deleuze</em>, London:\nAshgate.</li>\n<li>Faulkner, Keith, 2007, <em>The Force of Time: An Introduction to\nDeleuze through Proust</em>, Lanham MD: University Press of\nAmerica.</li>\n<li>Flaxman, Gregory, 2000, <em>The Brain is the Screen: Deleuze and\nthe Philosophy of Cinema</em>, Minneapolis: University of Minnesota\nPress.</li>\n<li>–––, 2011, <em>Gilles Deleuze and the Fabulation\nof Philosophy</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Gaffney, Peter (ed.), 2010, <em>The Force of the Virtual: Deleuze,\nScience, and Philosophy</em>, Minneapolis: University of Minnesota\nPress.</li>\n<li>Gatens, Moira, 1996, “Through a Spinozist Lens: Ethology,\nDifference, Power,” in Patton 1996, pp. 162–187.</li>\n<li>Genosko, Gary, 2002, <em>Félix Guattari: An Aberrant\nIntroduction</em>, London: Continuum.</li>\n<li>Goodchild, Philip, 1997, <em>Deleuze and Guattari: An Introduction\nto the Politics of Desire</em>, Thousand Oaks: Sage.</li>\n<li>Grosz, Elizabeth, 1994, “A Thousand Tiny Sexes,” in\nConstatin Boundas and Dorothea Olkowski (eds.), <em>Gilles Deleuze and\nthe Theatre of Philosophy</em>, New York: Routledge, pp.\n187–210.</li>\n<li>–––, 1995, <em>Space, Time, and Perversion:\nEssays on the Politics of Bodies</em>, New York: Routledge.</li>\n<li>–––, 2017, <em>The Incorporeal: Ontology,\nEthics, and the Limits of Materialism</em>, New York: Columbia\nUniversity Press.</li>\n<li>Gualandi, Alberto, 1998, <em>Deleuze</em>, Paris: Les Belles\nLettres.</li>\n<li>Guerlac, Suzanne, 2006, <em>Thinking in Time: An Introduction to\nHenri Bergson</em>, Ithaca NY: Cornell University Press.</li>\n<li>Gueroult, Martial, 1930, <em>La philosophie transcendentale de\nSalomon Maimon</em>, Paris: Société\nd’édition.</li>\n<li>Hallward, Peter, 2006, <em>Out of This World: Deleuze and the\nPhilosophy of Creation</em>, London: Verso.</li>\n<li>Hardt, Michael, 1993, <em>Gilles Deleuze: An Apprenticeship in\nPhilosophy</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Holland, Eugene, 1999, <em>Deleuze and Guattari’s\nAnti-Oedipus: Introduction to Schizoanalysis</em>, New York:\nRoutledge.</li>\n<li>Hughes, Joe, 2009, <em>Deleuze’s Difference and Repetition:\nA Reader’s Guide</em>, London: Continuum.</li>\n<li>–––, 2009, <em>Deleuze and the Genesis of\nRepresentation</em>, London: Continuum.</li>\n<li>–––, 2012, <em>Philosophy After Deleuze</em>,\nLondon: Continuum.</li>\n<li>Jardine, Alice, 1986, <em>Gynesis: Configurations of Woman and\nModernity</em>, Ithaca: Cornell University Press.</li>\n<li>Jones, Graham, and Jon Roffe (eds.), 2009, <em>Deleuze’s\nPhilosophical Lineage</em>, vol. 1, Edinburgh: Edinburgh University\nPress.</li>\n<li>–––, 2019, <em>Deleuze’s Philosophical\nLineage</em>, vol. 2, Edinburgh: Edinburgh University Press.</li>\n<li>Kaufman, Eleanor, 2012, <em>Deleuze, the Dark Precursor:\nDialectic, Structure, Being</em>, Baltimore: Johns Hopkins University\nPress.</li>\n<li>–––, and Jon Heller (eds.), 1998, <em>Deleuze\n&amp; Guattari: New Mappings in Philosophy, Politics and Culture</em>,\nMinneapolis: University of Minnesota.</li>\n<li>Kerslake, Christian, 2007, <em>Deleuze and the Unconscious</em>,\nLondon: Continuum.</li>\n<li>Khalfa, Jean (ed.), 2003, <em>An Introduction to the Philosophy of\nGilles Deleuze</em>, London: Continuum.</li>\n<li>Lambert, Gregg, 2002, <em>The Non-Philosophy of Gilles\nDeleuze</em>, London: Continuum.</li>\n<li>–––, 2012, <em>In Search of a New Image of\nThought: Gilles Deleuze and Philosophical Expressionism</em>,\nMinneapolis: University of Minnesota Press.</li>\n<li>Lampert, Jay, 2006, <em>Deleuze and Guattari’s Philosophy of\nHistory</em>, London: Continuum.</li>\n<li>Lapoujade, David, 2017, <em>Aberrant Mouvements: The Philosophy of\nGilles Deleuze</em>, translated by Joshua David Jordan, South\nPasadena, CA: Semiotext(e).</li>\n<li>Lecercle, Jean-Jacques, 1985, <em>Philosophy through the Looking\nGlass</em>, Chicago: Open Court.</li>\n<li>–––, 2002, <em>Deleuze and Language</em>,\nLondon: Palgrave Macmillan.</li>\n<li>Lefebvre, Alexandre, 2008, <em>The Image of Law: Deleuze, Bergson,\nSpinoza</em>, Stanford: Stanford University Press.</li>\n<li>Lorraine, Tamsin, 1999, <em>Irigaray and Deleuze: Experiments in\nVisceral Philosophy</em>, Ithaca: Cornell University Press.</li>\n<li>Lundy, Craig, 2018, <em>Deleuze’s Bergsonism</em>,\nEdinburgh: Edinburgh University Press.</li>\n<li>Marks, John, 1998, <em>Gilles Deleuze: Vitalism and\nMultiplicity</em>, Pluto Press: London.</li>\n<li>–––, (ed.), 2006. <em>Deleuze and Science</em>,\nEdinburgh: Edinburgh University Press.</li>\n<li>Maimon, Salomon, 1790 [2010], <em>Essay on Transcendental\nPhilosophy</em>, translated by Nick Midgley, Henry Somers-Hall,\nAlistair Welchman, and Merten Reglitz, London: Continuum, 2010.</li>\n<li>Martin, Jean-Clet, 1993, <em>Variations: La philosophie de Gilles\nDeleuze</em>, Paris: Payot &amp; Rivages.</li>\n<li>Massumi, Brian, 1992, <em>A User’s Guide to Capitalism and\nSchizophrenia</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2014, <em>What Animals Teach Us about\nPolitics</em>, Durham, NC: Duke University Press.</li>\n<li>May, Todd, 2005, <em>Gilles Deleuze: An Introduction</em>,\nCambridge: Cambridge University Press.</li>\n<li>Mengue, Phillipe, 1994, <em>Gilles Deleuze ou le système du\nmultiple</em>, Paris: Kimé</li>\n<li>–––, 2003, <em>Deleuze et la question de la\ndémocratie</em>, Paris: L’Harmattan.</li>\n<li>Moulard-Leonard, Valentine, 2009, <em>Deleuze-Bergson Encounters:\nTranscendental Experience and the Thought of the Virtual</em>, Albany\nNY: SUNY Press.</li>\n<li>Murphy, Timothy S., 1992, “The Philosophy (of the Theatre)\nof Cruelty in Gilles Deleuze’s <em>Difference and\nRepetition</em>,” in Broadhurst 1992, pp. 105–135.</li>\n<li>Olkowski, Dorothea, 1999, <em>Gilles Deleuze and the Ruin of\nRepresentation</em>, Berkeley: University of California Press.</li>\n<li>–––, 2007, <em>The Universal (In the Realm of\nthe Sensible): Beyond Continental Philosophy</em>, New York: Columbia\nUniversity Press.</li>\n<li>O’Sullivan, Simon, 2006, <em>Art Encounters Deleuze and\nGuattari: Thought Beyond Representation</em>, London: Palgrave\nMacmillan.</li>\n<li>Patton, Paul (ed.), 1996, <em>Deleuze: A Critical Reader</em>,\nOxford: Blackwell.</li>\n<li>–––, 1999, <em>Deleuze and the Political</em>,\nLondon: Routledge.</li>\n<li>–––, 2010, <em>Deleuzian Concepts: Philosophy,\nColonization, Politics</em>, Stanford: Stanford University Press.</li>\n<li>Patton, Paul, and John Protevi (eds.), 2003, <em>Between Deleuze\nand Derrida</em>, London: Continuum.</li>\n<li>Pisters, Patricia, 2012, <em>The Neuro-Image: A Deleuzian\nFilm-Philosophy of Digital Culture</em>, Stanford: Stanford University\nPress.</li>\n<li>Protevi, John, 2001, <em>Political Physics: Deleuze, Derrida, and\nthe Body Politic</em>, London: Athlone.</li>\n<li>–––, 2009, <em>Political Affect: Connecting the\nSocial and the Somatic</em>, Minneapolis: University of Minnesota\nPress.</li>\n<li>–––, 2011, “Mind in Life, Mind in Process:\nToward a New Transcendental Aesthetic and a New Question of\nPanpsychism.” <em>Journal of Consciousness Studies</em>,\n18(5–6): 94–116.</li>\n<li>–––, 2013, <em>Life, War, Earth: Deleuze and the\nSciences</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Rajchman, John, 2000, <em>The Deleuze Connections</em>, Cambridge\nMA: MIT Press.</li>\n<li>Ramey, Joshua, 2012, <em>The Hermetic Deleuze: Philosophy and\nSpiritual Ordeal</em>, Durham NC: Duke University Press.</li>\n<li>Read, Jason, 2015, <em>The Politics of Transindividuality</em>,\nChicago: Haymarket Books.</li>\n<li>Reynolds, Jack, 2011, <em>Chronopathologies: Time and Politics in\nDeleuze, Derrida, Analytic Philosophy, and Phenomenology</em>, Lanham\nMD: Lexington Books.</li>\n<li>Robinson, Keith, 2010, “Towards a Political Ontology of the\nFold: Deleuze, Heidegger, Whitehead and the ‘Fourfold’\nEvent,” in Sjoerd van Tuinen, and Niamh McDonnell (eds.),\n<em>Deleuze and the Fold: A Critical Reader</em>, London: Palgrave\nMacmillan pp. 184–202.</li>\n<li>Rodowick, David, 1997, <em>Gilles Deleuze’s Time\nMachine</em>, Durham: Duke University Press.</li>\n<li>Roffe, Jon, 2012, <em>Badiou’s Deleuze</em>, Montreal:\nMcGill Queen’s University Press.</li>\n<li>–––, 2017, “Form IV: From Ruyer’s\nPsychobiology to Deleuze and Guattari’s Socius,”\n<em>Deleuze Studies</em>, 11 (4): 580–599.</li>\n<li>–––, 2020, <em>The Works of Gilles Deleuze I:\n1953–1969</em>, Melbourne: re.press.</li>\n<li>Rolli, Marc, 2016, <em>Gilles Deleuze’s Transcendental\nEmpiricism: From Tradition to Difference</em>, translated by Peter\nHertz-Ohmes, Edinburgh: Edinburgh University Press.</li>\n<li>Ruyer, Raymond, 2016, <em>Neo-Finalism</em>, translated by Alyosha\nEdlebi, Minneapolis: University of Minnesota Press.</li>\n<li>–––, 2018, <em>The Genesis of Living Forms</em>,\ntranslated by Jon Roffe and Nicholas B. de Weydenthal, Lanham MD:\nRowman &amp; Littlefield.</li>\n<li>Sartre, Jean-Paul, 1937 [1991], <em>The Transcendence of the Ego:\nAn Existentialist Theory of Consciousness</em>, New York: Hill and\nWang, 1991</li>\n<li>Sauvagnargues, Anne, 2009, <em>Deleuze. L’empirisme\ntranscendental</em>, Paris: Presses Universitaires de France.</li>\n<li>–––, 2013, <em>Deleuze and Art</em>, translated\nby Samantha Bankston, London: Bloomsbury Academic.</li>\n<li>–––, 2016, <em>Artmachines: Deleuze, Guattari,\nSimondon</em>, translated by Suzanne Verderber and Eugene W. Holland,\nEdinburgh: Edinburgh University Press.</li>\n<li>Schaub, Mirjam, 2003, <em>Gilles Deleuze im Wunderland: Zeit als\nEreignisphilosophie</em>, Munich: Wilhelm Fink.</li>\n<li>–––, 2003, <em>Gilles Deleuze im Kino: Das\nSichtbare und das Sagbare</em>, Munich: Wilhelm Fink.</li>\n<li>Scott, David, 2014, <em>Gilbert Simondon’s</em> Psychic and\nCollective Individuation<em>: A Critical Introduction and Guide</em>,\nEdinburgh: Edinburgh University Press.</li>\n<li>Shaviro, Steven, 2009, <em>Without Criteria: Kant, Whitehead,\nDeleuze, and Aesthetics</em>, Cambridge MA: MIT Press.</li>\n<li>Sibertin-Blanc, Guillaume, 2016, <em>State and Politics, Deleuze\nand Guattari on Marx</em>, translated by Ames Hodges, South Pasadena,\nCA: Semiotext(e).</li>\n<li>Simondon, Gilbert, 2020, <em>Individuation in Light of Notions of\nForm and Information</em>, 2 vols, Minneapolis: University of\nMinnesota Press.</li>\n<li>Simont, Juliette, 1997, <em>Essai sur la quantité, la\nqualité, la relation chez Kant, Hegel, Deleuze: Les\n“fleurs noires” de la logique philosophique</em>, Paris:\nL’Harmattan.</li>\n<li>Sokal, Alan and Jean Bricmont, 1999, <em>Fashionable Nonsense:\nPostmodern Intellectuals’ Abuse of Science</em>, New York:\nPicador.</li>\n<li>Smith, Daniel W., 2010, “Genesis and Difference: Deleuze,\nMaimon, and the Post-Kantian Reading of Leibniz,” in Sjoerd van\nTuinen, and Niamh McDonnell (eds.), <em>Deleuze and the Fold: A\nCritical Reader</em>, London: Palgrave Macmillan, pp.\n132–154.</li>\n<li>–––, 2012, <em>Essays on Deleuze</em>,\nEdinburgh: Edinburgh University Press.</li>\n<li>–––, and Henry Somers-Hall (eds.), 2012, <em>The\nCambridge Companion to Deleuze</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Somers-Hall, Henry, 2012, <em>Hegel, Deleuze, and the Critique of\nRepresentation: Dialectics of Negative and Difference</em>, Albany NY:\nSUNY Press.</li>\n<li>–––, 2013, <em>Deleuze’s Difference and\nRepetition</em>, Edinburgh: Edinburgh University Press.</li>\n<li>Stengers, Isabelle, 2011, <em>Thinking with Whitehead: A Free and\nWild Creation of Concepts</em>, Cambridge MA: Harvard University\nPress.</li>\n<li>Stivale, Charles, 1998, <em>The Two Fold Thought of Deleuze and\nGuattari</em>, New York: Guilford.</li>\n<li>–––, 2005, <em>Gilles Deleuze: Key\nConcepts</em>, London: Continuum.</li>\n<li>–––, 2008, <em>Gilles Deleuze’s ABCs: The\nFolds of Friendship</em>, Baltimore: Johns Hopkins University\nPress.</li>\n<li>Swan, Melanie, 2016, <em>Cognitive Enhancement as Subjectivation:\nBergson, Deleuze &amp; Simondon</em>, Saarbrücken: Lambert\nAcademic Publishing.</li>\n<li>Thoburn, Nick, 2003, <em>Deleuze, Marx and Politics</em>, London:\nRoutledge.</li>\n<li>Tonkonoff, Sergio, 2017, <em>From Tarde to Deleuze and Foucault:\nThe Infinitesimal Revolution</em>, London: Palgrave Macmillan.</li>\n<li>Toscano, Alberto, 2006, <em>Theatre of Production: Philosophy and\nIndividuation Between Kant and Deleuze</em>, London: Palgrave\nMacmillan.</li>\n<li>–––, 2009, “Gilbert Simondon,” in\nGraham Jones and Jon Roffe, <em>Deleuze’s Philosophical\nLineage</em>, Edinburgh: Edinburgh University Press, pp.\n380–398.</li>\n<li>Tuinen, Sjoerd van, and Niamh McDonnell (eds.), 2010, <em>Deleuze\nand the Fold: A Critical Reader</em>, London: Palgrave Macmillan.</li>\n<li>Villani, Arnaud, 1999, <em>La guêpe et\nl’orchidée: Essai sur Gilles Deleuze</em>, Paris:\nBelin.</li>\n<li>Voss, Daniela, 2011, “Maimon and Deleuze: The Viewpoint of\nInternal Genesis and the Concept of Differentials,”\n<em>Parrhesia</em>, 11: 62–74.</li>\n<li>–––, 2018, “Simondon on the Notion of the\nProblem: A Genetic Schema of Individuation,” <em>Angelaki</em>,\n23(2): 94–112.</li>\n<li>–––, 2020, “The Problem of Method: Deleuze\nand Simondon,” <em>Deleuze and Guattari Studies</em> 14(1):\n87–108.</li>\n<li>Welchman, Alistair, 2009, “Deleuze’s Post-Critical\nMetaphysics,” <em>Symposium</em>: <em>Canadian Journal of\nContinental Philosophy</em>, 13(2): 25–54.</li>\n<li>Widder, Nathan, 2002, <em>Genealogies of Difference</em>, Urbana:\nUniversity of Illinois Press.</li>\n<li>–––, 2012, <em>Political Theory after\nDeleuze</em>, London: Continuum.</li>\n<li>Williams, James, 2004, <em>Gilles Deleuze’s Difference and\nRepetition: A Critical Introduction and Guide</em>, Edinburgh:\nEdinburgh University Press.</li>\n<li>–––, 2005, <em>The Transversal Thought of Gilles\nDeleuze: Encounters and Influences</em>, Manchester: Clinamen\nPress.</li>\n<li>–––, 2008, <em>Gilles Deleuze’s Logic of\nSense: A Critical Introduction and Guide</em>, Edinburgh: Edinburgh\nUniversity Press.</li>\n<li>–––, 2011, <em>Gilles Deleuze’s Philosophy\nof Time: A Critical Introduction and Guide</em>, Edinburgh: Edinburgh\nUniversity Press.</li>\n<li>–––, 2016, <em>A Process Philosophy of\nSigns</em>, Edinburgh: Edinburgh University Press.</li>\n<li>Zepke, Stephen, 2005, <em>Art as Abstract Machine: Ontology and\nAesthetics in Deleuze and Guattari</em>, London: Routledge.</li>\n<li>Žižek, Slavoj, 2003, <em>Organs Without Bodies: On\nDeleuze and Consequences</em>, New York: Routledge.</li>\n<li>Zourabichvili, François, 2012, <em>Deleuze: A Philosophy of\nthe Event</em>, Kieran Aarons (trans.), Gregg Lambert and Daniel W.\nSmith (eds.), Edinburgh: Edinburgh University Press.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Bergson, Henri", "Maimon, Salomon", "Nietzsche, Friedrich", "Spinoza, Baruch"], "entry_link": [{"../bergson/": "Bergson, Henri"}, {"../maimon/": "Maimon, Salomon"}, {"../nietzsche/": "Nietzsche, Friedrich"}, {"../spinoza/": "Spinoza, Baruch"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=deleuze\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/deleuze/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=deleuze&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/deleuze/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=deleuze": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/deleuze/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=deleuze&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/deleuze/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"http://www.euppublishing.com/loi/dls\" target=\"other\">Deleuze and Guattari Studies</a>", "<a href=\"https://www.webdeleuze.com/sommaire\" target=\"other\">Deleuze Web</a>\n (includes Deleuze’s lectures at Vincennes in French, English,\nand other languages)", "<a href=\"http://deleuze.cla.purdue.edu\" target=\"other\">The Deleuze Seminars</a>\n (includes transcripts and English translations of the seminars\nDeleuze gave at the University of Paris, Saint-Denis between 1971 and\n1987)", "<a href=\"http://www.protevi.com/john/DG/index.html\" target=\"other\">Course page on Deleuze and Guattari</a>,\n including lectures and outlines of texts by Deleuze and Deleuze and\nGuattari (John Protevi)", "<a href=\"http://www.iep.utm.edu/d/deleuze.htm\" target=\"other\">Entry on Deleuze</a>,\n Internet Encyclopedia of Philosophy", "<a href=\"http://www2.univ-paris8.fr/deleuze\" target=\"other\">La voix de Gilles Deleuze</a>,\n Transcripts and sound files (MP3) of Deleuze lectures"], "listed_links": [{"http://www.euppublishing.com/loi/dls": "Deleuze and Guattari Studies"}, {"https://www.webdeleuze.com/sommaire": "Deleuze Web"}, {"http://deleuze.cla.purdue.edu": "The Deleuze Seminars"}, {"http://www.protevi.com/john/DG/index.html": "Course page on Deleuze and Guattari"}, {"http://www.iep.utm.edu/d/deleuze.htm": "Entry on Deleuze"}, {"http://www2.univ-paris8.fr/deleuze": "La voix de Gilles Deleuze"}]}, "tokenized_text": ["1", "life", "work", "deleuze", "born", "paris", "conservative", "middleclass", "parent", "sent", "public", "school", "elementary", "education", "except", "one", "year", "school", "normandy", "occupation", "lived", "section", "paris", "entire", "life", "personal", "life", "unremarkable", "remained", "married", "woman", "wed", "age", "31", "fanny", "denise", "paul", "grandjouan", "french", "translator", "d", "h", "lawrence", "raised", "two", "child", "rarely", "traveled", "abroad", "although", "take", "trip", "united", "state", "1975", "part", "minimized", "attendance", "academic", "conference", "colloquium", "insisting", "activity", "thought", "took", "place", "primarily", "writing", "dialogue", "discussion", "dramatic", "event", "life", "occurred", "early", "occupation", "deleuze", "older", "brother", "arrested", "nazi", "resistance", "activity", "deported", "died", "train", "auschwitz", "german", "began", "occupation", "france", "june", "1940", "deleuze", "family", "vacation", "normandy", "spent", "year", "schooled", "deleuze", "traced", "initiation", "literature", "philosophy", "encounter", "teacher", "deauville", "named", "pierre", "halbwachs", "son", "sociologist", "maurice", "halbwachs", "introduced", "writer", "gide", "baudelaire", "early", "recalled", "philosophical", "concept", "struck", "force", "literary", "character", "autonomy", "style", "liberation", "deleuze", "returned", "paris", "undertook", "khâgne", "intensive", "year", "preparatory", "study", "wellknown", "lycée", "henri", "iv", "studied", "history", "philosophy", "sorbonne", "taught", "jean", "hippolyte", "ferdinand", "alquié", "loved", "admired", "enormously", "well", "george", "canguilhem", "maurice", "de", "gandillac", "like", "many", "peer", "influenced", "writing", "jeanpaul", "sartre", "work", "academic", "mentor", "deleuze", "historically", "oriented", "study", "sorbonne", "led", "devote", "first", "book", "empiricism", "subjectivity", "1953", "hume", "era", "peer", "like", "foucault", "derrida", "student", "école", "normale", "supérieure", "concentrated", "three", "h", "hegel", "husserl", "heidegger", "deleuze", "decision", "write", "empiricism", "hume", "already", "provocation", "early", "evidence", "heterodox", "tendency", "thought", "1953", "1962which", "later", "referred", "hole", "life", "deleuze", "published", "little", "moving", "among", "various", "teaching", "position", "paris", "province", "also", "time", "contracted", "recurring", "respiratory", "ailment", "would", "plague", "rest", "life", "1962", "nietzsche", "philosophy", "published", "considerable", "acclaim", "cementing", "deleuze", "reputation", "academic", "circle", "followed", "initial", "success", "kant", "critical", "philosophy", "1963", "proust", "sign", "1964", "bergsonism", "1966", "1968", "published", "difference", "repetition", "primary", "thesis", "doctorat", "état", "spinoza", "problem", "expression", "secondary", "thesis", "next", "year", "1969", "proved", "important", "one", "deleuze", "first", "found", "permanent", "teaching", "position", "paris", "experimental", "campus", "university", "paris", "viii", "vincennes", "later", "moved", "current", "location", "st", "denis", "gave", "weekly", "seminar", "institution", "retirement", "1987", "second", "published", "another", "major", "text", "name", "logic", "sense", "importantly", "met", "félix", "guattari", "radical", "psychoanalyst", "political", "militant", "began", "long", "collaboration", "first", "joint", "volume", "antioedipus", "1972", "best", "seller", "france", "veritable", "succès", "de", "scandale", "thrust", "deleuze", "limelight", "public", "intellectual", "followed", "kafka", "toward", "minor", "literature", "1975", "book", "least", "eye", "rival", "difference", "repetition", "title", "deleuze", "masterwork", "thousand", "plateau", "1980", "1980s", "decade", "independent", "work", "deleuze", "francis", "bacon", "logic", "sensation", "1981", "cinema", "movementimage", "1983", "cinema", "ii", "timeimage", "1985", "foucault", "1986", "fold", "leibniz", "baroque", "1988", "resumed", "collaboration", "guattari", "final", "joint", "work", "philosophy", "1991", "final", "year", "spent", "ill", "health", "although", "manage", "publish", "remarkable", "short", "essay", "immanence", "life", "1995", "taking", "life", "november", "4", "1995", "2", "deleuze", "reading", "philosopher", "ever", "wrote", "name", "difference", "repetition", "logic", "sense", "deleuze", "wrote", "series", "work", "figure", "history", "philosophy", "hume", "bergson", "nietzsche", "kant", "spinoza", "writing", "work", "deleuze", "sought", "unearth", "presupposition", "absorbed", "education", "chief", "among", "felt", "deepseated", "privilege", "identity", "difference", "deleuze", "thus", "set", "trying", "accelerate", "however", "could", "departure", "hegel", "saw", "emblematic", "privilege", "deleuze", "attack", "hegel", "others", "callthough", "deleuze", "notthe", "identitarian", "tradition", "first", "mean", "radicalized", "reading", "kant", "whose", "genius", "deleuze", "explains", "kant", "critical", "philosophy", "1963", "conceived", "purely", "immanent", "critique", "reasona", "critique", "seek", "error", "reason", "produced", "external", "cause", "rather", "illusion", "arise", "within", "reason", "illegitimate", "transcendent", "us", "synthesis", "consciousness", "deleuze", "characterized", "work", "philosophy", "immanence", "arguing", "kant", "failed", "realize", "fully", "ambition", "critique", "least", "two", "reason", "first", "failure", "pursue", "fully", "immanent", "critique", "second", "failure", "propose", "genetic", "account", "real", "experience", "resting", "content", "account", "condition", "possible", "experience", "first", "kant", "made", "field", "consciousness", "immanent", "transcendental", "subject", "thereby", "reintroducing", "element", "identity", "transcendent", "external", "field", "reserving", "power", "synthesis", "identityformation", "field", "activity", "always", "already", "unified", "transcendent", "subject", "deleuze", "influenced", "regard", "reading", "sartre", "1937", "essay", "transcendence", "ego", "already", "hume", "book", "empiricism", "subjectivity", "1953", "deleuze", "pointed", "empiricist", "reversal", "kant", "kant", "question", "given", "given", "subject", "hume", "question", "subject", "human", "nature", "constituted", "within", "given", "mature", "work", "deleuze", "argues", "impersonal", "preindividual", "transcendental", "field", "subject", "identity", "pole", "produce", "empirical", "identity", "active", "synthesis", "result", "product", "differential", "passive", "synthesis", "instance", "deleuze", "call", "synthesis", "habit", "find", "bodily", "desiring", "unconscious", "contraction", "unify", "series", "experience", "extracting", "retained", "habit", "allowing", "rest", "forgotten", "together", "passive", "synthesis", "level", "form", "differential", "field", "within", "subject", "formation", "take", "place", "integration", "resolution", "field", "word", "subject", "roughly", "speaking", "pattern", "multiple", "serial", "synthesis", "fold", "producing", "site", "selfawareness", "course", "deleuze", "never", "simply", "proclaims", "bald", "thesis", "develops", "genetic", "account", "subjectivity", "many", "book", "taking", "account", "deleuze", "summarized", "differential", "immanent", "genetic", "position", "first", "glance", "odd", "phrase", "transcendental", "empiricism", "cashed", "term", "two", "characteristic", "1", "abstract", "eg", "subject", "object", "state", "whole", "explain", "must", "explained", "2", "aim", "philosophy", "rediscover", "eternal", "universal", "find", "singular", "condition", "something", "new", "produced", "wordsand", "pragmatic", "perspective", "deleuze", "never", "deviatedphilosophy", "aim", "stating", "condition", "knowledge", "qua", "representation", "finding", "fostering", "condition", "creative", "production", "deleuze", "second", "criticism", "kant", "claim", "simply", "presumed", "existence", "knowledge", "morality", "fact", "sought", "condition", "possibility", "transcendental", "already", "1789", "salomon", "maimon", "whose", "early", "critique", "kant", "helped", "generate", "postkantian", "tradition", "argued", "kant", "critical", "project", "required", "method", "genesisand", "merely", "method", "conditioningthat", "would", "account", "production", "knowledge", "morality", "indeed", "reason", "word", "maimon", "called", "genetic", "method", "would", "able", "reach", "condition", "real", "merely", "possible", "experience", "maimon", "found", "solution", "problem", "principle", "difference", "whereas", "identity", "condition", "possibility", "thought", "general", "difference", "constitutes", "genetic", "productive", "principle", "real", "thought", "two", "maimonian", "exigenciesthe", "search", "genetic", "condition", "real", "experience", "positing", "principle", "differenceappear", "almost", "every", "one", "deleuze", "early", "monograph", "nietzsche", "philosophy", "1962", "instance", "suggests", "nietzsche", "completed", "inverted", "kantianism", "bringing", "critique", "bear", "simply", "false", "claim", "knowledge", "morality", "true", "knowledge", "true", "morality", "indeed", "truth", "genealogy", "constituted", "nietzsche", "genetic", "method", "willtopower", "principle", "difference", "deleuze", "antihegelianism", "shown", "focus", "productivity", "nondialectical", "affirmative", "differential", "force", "termed", "nietzsche", "noble", "force", "affirm", "thereby", "differentiate", "first", "secondarily", "consider", "differentiated", "bergsonism", "1966", "deleuze", "develops", "idea", "virtuality", "multiplicity", "serve", "backbone", "later", "work", "maimon", "reading", "kant", "know", "deleuze", "need", "substitute", "notion", "condition", "genesis", "real", "notion", "condition", "possibility", "representational", "knowledge", "positive", "name", "genetic", "condition", "virtual", "deleuze", "adopts", "following", "bergsonian", "argument", "notion", "possible", "bergson", "hold", "creative", "evolution", "derived", "false", "problem", "confuses", "le", "ignores", "difference", "kind", "le", "idea", "possible", "real", "idea", "nonbeing", "idea", "disorder", "order", "think", "possible", "somehow", "preexisting", "real", "think", "real", "add", "negation", "existence", "project", "image", "possible", "past", "reverse", "procedure", "think", "real", "something", "possible", "possible", "existence", "added", "say", "possible", "realized", "real", "contrast", "deleuze", "reject", "notion", "possible", "favor", "virtual", "rather", "awaiting", "realization", "virtual", "fully", "real", "happens", "genesis", "virtual", "actualized", "fundamental", "characteristic", "virtual", "mean", "must", "actualized", "rather", "realized", "differential", "makeup", "deleuze", "always", "held", "critical", "axiom", "ground", "resemble", "ground", "constantly", "critique", "tracing", "operation", "identity", "real", "experience", "said", "conditioned", "identity", "transcendental", "instance", "deleuze", "criticizes", "kant", "copying", "transcendental", "field", "image", "empirical", "field", "empirical", "experience", "personal", "identitarian", "centripetal", "central", "focus", "subject", "experience", "tagged", "belonging", "u", "kant", "say", "empirical", "identity", "possible", "posit", "transcendental", "unity", "apperception", "possibility", "adding", "think", "judgment", "instead", "smuggledin", "traced", "identity", "deleuze", "want", "transcendental", "field", "differential", "deleuze", "still", "want", "work", "back", "experience", "since", "condition", "resemble", "conditioned", "since", "empirical", "personal", "individuated", "transcendental", "must", "impersonal", "preindividual", "virtual", "condition", "real", "experience", "identity", "identity", "subject", "object", "product", "process", "resolve", "integrate", "actualize", "three", "term", "synonymous", "deleuze", "differential", "field", "deleuzean", "virtual", "thus", "condition", "possibility", "rational", "experience", "condition", "genesis", "real", "experience", "seen", "virtual", "genetic", "ground", "actual", "resemble", "ground", "thus", "confronted", "actual", "identity", "experience", "virtual", "ground", "identity", "must", "purely", "differential", "deleuze", "adopts", "multiplicity", "bergson", "name", "purely", "differential", "field", "usage", "deleuze", "later", "clarifies", "multiplicity", "designates", "multiple", "substantive", "rather", "predicate", "multiple", "predicate", "generates", "set", "philosophical", "problem", "rubric", "one", "many", "thing", "one", "multiple", "one", "multiple", "multiplicity", "multiple", "substantive", "question", "relation", "predicate", "onemultiple", "replaced", "question", "distinguishing", "type", "multiplicity", "bergson", "distinction", "qualitative", "quantitative", "multiplicity", "time", "free", "typological", "difference", "substantive", "multiplicity", "short", "substituted", "dialectical", "opposition", "one", "multiple", "sum", "major", "postkantian", "tradition", "fichte", "schelling", "hegel", "deleuze", "effect", "posited", "minor", "postkantian", "trio", "maimon", "nietzsche", "bergson", "added", "trio", "prekantians", "spinoza", "leibniz", "hume", "read", "postkantian", "lens", "already", "touched", "deleuze", "reading", "hume", "let", "u", "turn", "spinoza", "deleuze", "admiration", "seemingly", "limitless", "deleuze", "spinoza", "prince", "even", "christ", "philosopher", "many", "spinozist", "inheritance", "deleuze", "one", "important", "certainly", "notion", "univocity", "ontology", "univocityas", "opposed", "great", "rival", "equivocity", "analogyis", "key", "developing", "philosophy", "difference", "deleuze", "term", "project", "difference", "repetition", "difference", "would", "longer", "subordinated", "identity", "result", "spinozism", "minus", "substance", "purely", "modal", "differential", "universe", "univocity", "deleuze", "read", "spinoza", "said", "single", "sense", "said", "said", "difference", "difference", "difference", "difference", "degree", "power", "interpreting", "term", "must", "distinguish", "two", "french", "word", "puissance", "pouvoir", "social", "term", "puissance", "immanent", "power", "power", "act", "rather", "power", "dominate", "another", "could", "say", "puissance", "praxis", "equal", "clash", "act", "together", "rather", "poiesis", "others", "matter", "formed", "command", "superior", "sense", "transcendent", "power", "match", "pouvoir", "indicates", "deleuze", "general", "term", "deleuze", "develops", "throughout", "career", "puissance", "ability", "affect", "affected", "form", "assemblage", "consistency", "form", "emergent", "unity", "nonetheless", "respect", "heterogeneity", "component", "final", "important", "figure", "deleuze", "reading", "philosopher", "leibniz", "must", "recalled", "maimon", "appealed", "criticism", "kant", "1988", "deleuze", "published", "book", "leibniz", "entitled", "fold", "leibniz", "baroque", "added", "new", "element", "reading", "leibniz", "appeared", "deleuze", "earlier", "book", "interpretation", "centered", "concept", "fold", "development", "concept", "baroque", "attempt", "define", "neoleibnizianism", "term", "contemporary", "artistic", "scientific", "practice", "fold", "fascinating", "work", "concentrate", "deleuze", "early", "reading", "leibniz", "play", "important", "role", "difference", "repetition", "deleuze", "push", "leibniz", "thought", "point", "leibniz", "could", "never", "taken", "given", "theological", "presupposition", "point", "one", "begin", "consider", "virtual", "domain", "account", "freed", "actualization", "world", "individual", "score", "deleuze", "often", "like", "cite", "jorge", "luis", "borges", "famous", "story", "garden", "forking", "path", "virtual", "world", "described", "labyrinthine", "book", "chinese", "philosopher", "named", "t", "ui", "pên", "fiction", "man", "faced", "alternative", "chooses", "one", "expense", "others", "almost", "unfathomable", "t", "ui", "pên", "choosessimultaneouslyall", "them", "t", "ui", "pên", "work", "possible", "solution", "occur", "one", "point", "departure", "bifurcations", "leibniz", "fact", "given", "similar", "presentation", "world", "conclusion", "theodicy", "deleuze", "transformation", "leibnizian", "borgesian", "image", "three", "kantian", "transcendent", "idea", "god", "world", "self", "take", "completely", "different", "demeanor", "first", "god", "longer", "compare", "chooses", "richest", "compossible", "world", "become", "pure", "process", "affirms", "incompossibilities", "pass", "second", "world", "longer", "continuous", "world", "defined", "preestablished", "harmony", "instead", "divergence", "bifurcation", "incompossibles", "must", "seen", "belong", "one", "universe", "chaotic", "universe", "divergent", "series", "trace", "endlessly", "bifurcating", "path", "give", "rise", "violent", "discord", "dissonance", "never", "resolved", "harmonic", "tonality", "chaosmos", "deleuze", "put", "borrowing", "word", "joyce", "longer", "world", "contrast", "leibniz", "could", "save", "harmony", "world", "relegating", "discordance", "disharmony", "possible", "worldsthis", "theological", "sleight", "hand", "third", "self", "individual", "rather", "closed", "upon", "compossible", "convergent", "world", "express", "within", "torn", "open", "kept", "open", "divergent", "series", "incompossible", "ensemble", "continually", "pull", "outside", "monadic", "subject", "deleuze", "put", "becomes", "nomadic", "subject", "word", "deleuze", "leibnizian", "eliminating", "idea", "god", "chooses", "best", "possible", "world", "preestablished", "harmony", "wellestablished", "self", "deleuze", "incompossibilities", "dissonance", "belong", "one", "world", "world", "world", "belong", "world", "virtual", "register", "developing", "thought", "virtual", "one", "great", "challenge", "deleuze", "masterpiece", "difference", "repetition", "turn", "3", "philosophy", "difference", "31", "difference", "repetition", "deleuze", "historical", "monograph", "sense", "preliminary", "sketch", "great", "canvas", "difference", "repetition", "1968", "marshaled", "resource", "history", "philosophy", "ambitious", "project", "construct", "philosophy", "difference", "following", "maimon", "critique", "difference", "repetition", "produce", "twofold", "shift", "kantian", "project", "providing", "universal", "necessary", "condition", "possible", "experience", "first", "rather", "seeking", "condition", "possible", "experience", "deleuze", "want", "provide", "account", "genesis", "real", "experience", "experience", "concretely", "existing", "individual", "second", "respect", "demand", "philosophy", "difference", "genetic", "principle", "must", "differential", "principle", "however", "despite", "departure", "deleuze", "maintains", "crucial", "alignment", "kant", "difference", "repetition", "still", "transcendental", "approach", "remind", "term", "transcendent", "transcendental", "opposing", "signification", "transcendental", "philosophy", "fact", "critique", "pretension", "philosophy", "transcend", "experience", "providing", "strict", "criterion", "use", "synthesis", "immanent", "experience", "score", "least", "deleuze", "aligns", "kant", "critical", "philosophy", "three", "preliminary", "note", "order", "first", "discus", "section", "4", "capitalism", "schizophrenia", "project", "deleuze", "guattari", "bring", "fore", "naturalist", "tendency", "implicitly", "present", "stillkantian", "framework", "difference", "repetition", "although", "risk", "reading", "backwards", "formulation", "say", "phrase", "experience", "concretely", "existing", "individual", "subjective", "objective", "experience", "human", "subject", "individual", "object", "front", "experience", "enjoyed", "concretely", "existing", "individual", "even", "individual", "nonhuman", "even", "nonliving", "deleuze", "panpsychism", "treated", "briefly", "protevi", "2011", "second", "demand", "genetic", "principle", "account", "real", "experience", "concrete", "individual", "deleuze", "working", "tradition", "principle", "sufficient", "reason", "third", "notion", "genesis", "double", "chapter", "3", "deleuze", "lay", "dynamic", "genesis", "move", "encounter", "intensity", "sensation", "thinking", "virtual", "idea", "chapter", "4", "5", "lay", "static", "genesis", "move", "virtual", "idea", "intensive", "individuation", "process", "actual", "entity", "ready", "discus", "book", "murphy", "1992", "suggests", "first", "part", "book", "introduction", "chapter", "1", "2", "constitutes", "deleuze", "treatment", "history", "philosophy", "second", "part", "book", "chapter", "4", "5", "deleuze", "philosophy", "name", "point", "view", "chapter", "3", "image", "thought", "play", "pivotal", "role", "leading", "u", "deleuze", "philosophy", "transitional", "role", "chapter", "3", "confirmed", "elsewhere", "deleuze", "say", "study", "image", "thought", "prolegomenon", "philosophy", "negotiation", "149", "chapter", "1", "2", "find", "differential", "genetic", "principle", "deleuze", "work", "history", "philosophy", "isolate", "concept", "difference", "repetition", "assumption", "previous", "philosophy", "prevented", "formulated", "difference", "difference", "freed", "identity", "seen", "metaphysically", "primary", "normally", "difference", "conceived", "empirical", "relation", "two", "term", "prior", "identity", "x", "different", "deleuze", "inverts", "priority", "identity", "persists", "something", "produced", "prior", "relation", "differential", "dx", "rather", "notx", "difference", "longer", "empirical", "relation", "becomes", "transcendental", "principle", "constitutes", "sufficient", "reason", "empirical", "diversity", "example", "difference", "electrical", "potential", "cloud", "ground", "constitutes", "sufficient", "reason", "phenomenon", "lightning", "chapter", "2", "concept", "repetition", "produced", "repetition", "freed", "repetition", "original", "selfidentical", "thing", "repetition", "difference", "following", "formula", "deleuze", "reading", "nietzsche", "eternal", "return", "repetition", "return", "differential", "genetic", "condition", "real", "experience", "time", "individuation", "concrete", "entity", "ultimately", "difference", "repetition", "show", "individuation", "entity", "produced", "actualization", "integration", "resolution", "term", "synonymous", "deleuze", "differentiated", "virtual", "field", "idea", "multiplicity", "changed", "via", "countereffectuation", "individuating", "event", "chapter", "3", "lay", "8", "postulate", "dogmatic", "image", "thought", "first", "four", "last", "four", "postulate", "find", "theory", "faculty", "thus", "crossroad", "chapter", "book", "let", "u", "take", "first", "four", "postulate", "first", "postulate", "concern", "supposed", "natural", "disposition", "think", "denial", "necessitates", "forced", "think", "second", "third", "postulate", "concern", "subjective", "objective", "unity", "subjective", "unity", "captured", "notion", "common", "sense", "faculty", "sensation", "memory", "imagination", "thought", "work", "harmony", "objective", "unity", "captured", "notion", "recognition", "object", "sensed", "remembered", "imagined", "thought", "fourth", "postulate", "concern", "representation", "key", "target", "deleuze", "critique", "difference", "submitted", "fourfold", "structure", "render", "difference", "subordinate", "identity", "1", "identity", "concept", "2", "opposition", "predicate", "3", "analogy", "judgment", "4", "resemblance", "perception", "good", "way", "approach", "deleuze", "notion", "representation", "via", "aristotle", "porphyry", "specific", "difference", "opposed", "predicate", "function", "horizon", "identity", "concept", "division", "thus", "animal", "genus", "divided", "rational", "irrational", "specific", "difference", "enable", "isolation", "specie", "human", "find", "difference", "individual", "specie", "infraconceptual", "made", "via", "perception", "resemblance", "theaetetus", "look", "like", "socrates", "much", "distinguished", "finally", "relation", "substance", "category", "analogical", "said", "many", "way", "substance", "primary", "way", "said", "first", "four", "postulate", "find", "theory", "faculty", "deleuze", "account", "mean", "forced", "think", "differential", "rather", "identitarian", "term", "free", "notion", "difference", "difference", "need", "thought", "basis", "prior", "horizon", "identity", "deleuze", "look", "encounter", "sensation", "thought", "find", "empirical", "category", "object", "recognized", "thus", "force", "transcendent", "exercise", "faculty", "sensibility", "something", "sensed", "see", "dynamic", "genesis", "intensity", "sensation", "thinking", "virtual", "idea", "step", "distinct", "kantian", "echo", "faculty", "linked", "order", "deleuze", "well", "kant", "look", "privilege", "sensibility", "origin", "knowledgethe", "truth", "empiricism", "sensibility", "pure", "difference", "intensity", "grasped", "immediately", "encounter", "sentiendum", "sensed", "differential", "theory", "faculty", "sensibility", "imagination", "memory", "thought", "communicate", "violence", "one", "otherhere", "deleuze", "work", "kantian", "notion", "sublime", "discordant", "accord", "faculty", "free", "form", "difference", "intensity", "move", "faculty", "communicates", "violence", "next", "though", "case", "supernatural", "vocation", "redeem", "conflict", "imagination", "reason", "resolution", "discussion", "sublime", "critique", "judgment", "rather", "reconciliation", "faculty", "thought", "fractured", "self", "here", "deleuze", "take", "kant", "notion", "split", "empirical", "ego", "transcendental", "subjectis", "constrained", "think", "difference", "idea", "discus", "last", "four", "postulate", "detail", "concern", "theory", "idea", "topic", "chapter", "4", "shortly", "discus", "let", "u", "note", "two", "deleuze", "technical", "term", "intensity", "virtuality", "occupy", "two", "different", "place", "line", "dynamic", "genesis", "intensity", "characteristic", "encounter", "set", "process", "thinking", "virtuality", "characteristic", "idea", "notion", "intensive", "extensive", "come", "upon", "crucial", "distinction", "deleuze", "explored", "chapter", "4", "5", "difference", "repetition", "extensive", "quantity", "length", "area", "volume", "divisible", "volume", "matter", "divided", "two", "equal", "half", "produce", "two", "volume", "half", "extent", "original", "one", "intensive", "magnitude", "contrast", "refer", "property", "temperature", "pressure", "divided", "volume", "water", "whose", "temperature", "90º", "divided", "half", "result", "two", "volume", "original", "temperature", "two", "volume", "45º", "however", "important", "property", "intensity", "indivisible", "property", "divided", "without", "involving", "change", "kind", "temperature", "volume", "water", "instance", "divided", "heating", "container", "causing", "temperature", "difference", "top", "bottom", "however", "change", "system", "qualitatively", "moreover", "temperature", "difference", "reach", "certain", "threshold", "attain", "certain", "intensity", "deleuze", "term", "system", "undergo", "phase", "transition", "losing", "symmetry", "changing", "dynamic", "entering", "periodic", "pattern", "motionconvectionwhich", "display", "extensive", "property", "size", "x", "centimeter", "length", "breadth", "drawing", "kind", "analysis", "deleuze", "assign", "transcendental", "status", "intensive", "intensity", "argues", "constitutes", "genetic", "condition", "extensive", "space", "intensive", "process", "turn", "structured", "idea", "multiplicity", "idea", "multiplicity", "really", "process", "progressive", "determination", "differential", "element", "differential", "relation", "singularity", "let", "u", "take", "stepbystep", "element", "must", "independent", "existence", "system", "inhere", "phoneme", "element", "virtual", "linguistic", "idea", "example", "deleuze", "us", "difference", "repetition", "phoneme", "actualized", "enter", "differential", "relation", "determine", "pattern", "individual", "language", "thus", "english", "phoneme", "p", "reciprocally", "determined", "difference", "t", "b", "d", "finally", "differential", "relation", "individual", "language", "determine", "singularity", "remarkable", "point", "pattern", "language", "shift", "great", "vowel", "shift", "middle", "english", "example", "prosaically", "dialect", "pronunciation", "shift", "another", "exampleand", "applicability", "schema", "widely", "divergent", "register", "one", "aspect", "deleuze", "metaphysicianlet", "u", "try", "construct", "idea", "hurricane", "differential", "element", "would", "material", "flow", "driven", "intensive", "difference", "temperature", "pressure", "undetermined", "form", "neither", "smooth", "turbulent", "neither", "big", "small", "function", "neither", "forming", "destroying", "weather", "event", "flow", "qua", "differential", "element", "enter", "relation", "reciprocal", "determination", "linking", "change", "one", "element", "change", "others", "thus", "temperature", "pressure", "difference", "link", "change", "air", "water", "current", "updraft", "related", "downdraft", "even", "exact", "relation", "tightness", "link", "velocity", "flow", "yet", "determined", "finally", "singular", "point", "relation", "singularity", "determined", "mark", "qualitative", "shift", "system", "formation", "thunderstorm", "cell", "eye", "wall", "still", "virtual", "idea", "hurricane", "real", "existent", "hurricane", "measurable", "value", "variable", "move", "philosophical", "realm", "sufficient", "reason", "scientific", "causation", "hurricane", "explained", "idea", "caused", "real", "wind", "current", "driven", "real", "temperature", "supplied", "sun", "tropical", "water", "see", "idea", "transcendental", "immanent", "appreciate", "idea", "concrete", "universal", "early", "article", "bergson", "conception", "difference", "bergson", "1956", "deleuze", "gave", "particularly", "helpful", "example", "notion", "la", "pensée", "et", "le", "mouvant", "bergson", "shown", "two", "way", "determining", "spectrum", "color", "common", "1", "extract", "particular", "color", "abstract", "general", "idea", "color", "removing", "red", "make", "red", "blue", "make", "blue", "green", "make", "green", "2", "make", "color", "pas", "convergent", "lens", "bringing", "single", "point", "case", "pure", "white", "light", "obtained", "make", "difference", "shade", "stand", "out", "former", "case", "defines", "single", "generic", "concept", "plurality", "object", "relation", "concept", "object", "one", "subsumption", "state", "difference", "remains", "exterior", "thing", "second", "case", "contrary", "defines", "differential", "idea", "deleuzean", "sense", "different", "color", "longer", "object", "concept", "constitute", "order", "mixture", "coexistence", "succession", "within", "idea", "relation", "idea", "given", "color", "one", "subsumption", "one", "actualization", "differenciation", "state", "difference", "concept", "object", "internalized", "idea", "concept", "become", "object", "white", "light", "still", "universal", "concrete", "universal", "genus", "generality", "idea", "color", "thus", "like", "white", "light", "perplexes", "within", "genetic", "element", "relation", "color", "actualized", "diverse", "color", "respective", "space", "like", "word", "problem", "deleuze", "us", "word", "perplexion", "signify", "coefficient", "doubt", "hesitation", "astonishment", "multiple", "virtual", "state", "idea", "indeed", "deleuze", "adopts", "number", "neoplatonic", "notion", "indicate", "structure", "idea", "derived", "root", "word", "pli", "fold", "perplication", "complication", "implication", "explication", "replication", "similarly", "idea", "sound", "could", "conceived", "white", "noise", "also", "white", "society", "white", "language", "contains", "virtuality", "phoneme", "relation", "destined", "actualized", "diverse", "language", "remarkable", "part", "language", "move", "discus", "chapter", "5", "individuation", "concretely", "existing", "real", "entity", "actualization", "virtual", "idea", "isolating", "condition", "genesis", "deleuze", "set", "tripartite", "ontological", "scheme", "positing", "three", "interdependent", "register", "virtual", "intensive", "actual", "deleuze", "basic", "notion", "realm", "intensive", "morphogenetic", "process", "follow", "differential", "virtual", "multiplicity", "produce", "localized", "individuated", "actual", "substance", "extensive", "property", "simply", "put", "actualization", "virtual", "proceeds", "way", "intensive", "process", "beneath", "actual", "one", "state", "system", "find", "impersonal", "individuation", "intensive", "morphogenetic", "process", "produce", "system", "state", "beneath", "find", "preindividual", "singularity", "key", "element", "virtual", "field", "marking", "system", "threshold", "structure", "intensive", "morphogenetic", "process", "thus", "distinguish", "intense", "impersonal", "field", "individuation", "process", "virtual", "preindividual", "field", "differential", "relation", "singularity", "make", "idea", "multiplicity", "tying", "together", "theme", "difference", "multiplicity", "virtuality", "intensity", "heart", "difference", "repetition", "find", "theory", "idea", "dialectic", "based", "neither", "essential", "model", "identity", "plato", "regulative", "model", "unity", "kant", "dialectical", "model", "contradiction", "hegel", "rather", "problematic", "genetic", "model", "difference", "idea", "define", "thing", "one", "attain", "idea", "socratic", "question", "posit", "idea", "transcendent", "eternal", "rather", "minor", "question", "one", "many", "case", "viewpoint", "all", "allow", "one", "define", "differential", "idea", "immanent", "intensive", "process", "structure", "example", "see", "idea", "structure", "intensive", "process", "give", "rise", "behavior", "pattern", "system", "singularity", "mark", "threshold", "system", "change", "behavior", "pattern", "word", "virtual", "idea", "transformation", "matrix", "material", "system", "body", "body", "determined", "solution", "problem", "lay", "manifold", "option", "incarnating", "body", "nature", "idea", "respond", "question", "incarnates", "idea", "case", "rather", "essentialist", "property", "substance", "provide", "necessary", "sufficient", "condition", "membership", "class", "object", "member", "orientation", "purpose", "useful", "consider", "gilbert", "simondon", "theory", "individuation", "simple", "model", "deleuze", "call", "actualization", "simondon", "crystallization", "paradigm", "individuation", "supersaturated", "solution", "metastable", "preindividual", "field", "replete", "gradient", "density", "implicit", "form", "potential", "function", "individual", "crystal", "precipitate", "deleuzean", "virtual", "composed", "idea", "multiplicity", "involving", "differential", "relation", "among", "heterogeneous", "component", "whose", "rate", "change", "connected", "example", "heterogeneity", "let", "u", "return", "hurricane", "formation", "idea", "sketched", "intuitively", "clear", "central", "command", "selforganization", "multiple", "process", "air", "water", "movement", "propelled", "temperature", "pressure", "difference", "hurricane", "form", "intensive", "process", "wind", "ocean", "current", "reach", "singular", "point", "singular", "point", "however", "unique", "one", "hurricane", "virtual", "actual", "hurricane", "boiling", "point", "water", "virtual", "actual", "pot", "tea", "stove", "word", "hurricane", "share", "virtual", "structure", "even", "singular", "individuation", "actualization", "structure", "treatment", "concentrated", "metaphysics", "difference", "repetition", "much", "could", "said", "role", "nietzsche", "thought", "eternal", "return", "play", "therein", "addition", "deleuze", "remark", "dizzying", "array", "figure", "plato", "scotus", "freud", "artaud", "interest", "space", "however", "let", "u", "move", "brief", "treatment", "deleuze", "second", "major", "work", "late", "1960s", "logic", "sense", "32", "logic", "sense", "difference", "repetition", "range", "wide", "field", "philosophical", "topic", "logic", "sense", "focus", "two", "aspect", "single", "issue", "structure", "genesis", "sense", "genius", "frege", "russell", "discovered", "condition", "truth", "denotation", "lie", "domain", "sense", "order", "proposition", "true", "false", "must", "sense", "nonsensical", "proposition", "neither", "true", "false", "yet", "betrayed", "insight", "deleuze", "argues", "theylike", "kant", "themremained", "content", "establishing", "condition", "truth", "rather", "genesis", "logic", "sense", "deleuze", "attack", "problem", "first", "developing", "paradox", "result", "structure", "sense", "sketching", "theory", "genesis", "using", "resource", "analytic", "philosophy", "stoic", "course", "reading", "lewis", "carrolla", "typically", "innovative", "quirky", "set", "deleuzean", "reference", "first", "part", "book", "deleuze", "analyzes", "structure", "sense", "begin", "identifying", "three", "type", "relation", "within", "proposition", "designation", "denotation", "relation", "proposition", "external", "state", "affair", "theory", "reference", "criterion", "truth", "falsity", "manifestation", "mark", "relation", "proposition", "belief", "desire", "person", "speaking", "value", "veracity", "illusion", "signification", "demonstration", "relation", "proposition", "proposition", "domain", "logic", "relation", "implication", "assertion", "proposition", "word", "related", "either", "object", "refer", "subject", "utter", "proposition", "relation", "turn", "taken", "primary", "1", "domain", "speech", "begin", "manifestation", "make", "denotation", "possible", "hume", "also", "prior", "signification", "descartes", "cogito", "2", "domain", "language", "however", "signification", "primary", "since", "one", "always", "born", "preexisting", "language", "signified", "concept", "always", "primary", "relation", "self", "manifested", "person", "thing", "designated", "object", "3", "yet", "domain", "logic", "see", "primacy", "designation", "shown", "hypothetical", "mode", "implication", "logical", "value", "demonstration", "truth", "rather", "condition", "truth", "condition", "possibility", "proposition", "would", "true", "premise", "must", "thus", "posited", "effectively", "true", "force", "one", "leave", "pure", "order", "implication", "order", "relate", "premise", "denoted", "state", "affair", "logical", "designation", "word", "fulfill", "putative", "role", "foundation", "since", "presupposes", "irreducible", "denotation", "theory", "proposition", "thus", "caught", "circle", "condition", "turn", "conditioned", "supposedly", "condition", "condition", "truth", "avoid", "defect", "deleuze", "argues", "would", "something", "unconditioned", "capable", "assuring", "real", "genesis", "designation", "dimension", "proposition", "condition", "truth", "would", "defined", "longer", "form", "conceptual", "possibility", "ideal", "matter", "medium", "matière", "ou", "couche", "idéelle", "longer", "signification", "sense", "l", "19", "sense", "would", "fourth", "dimension", "proposition", "deleuze", "reserve", "term", "expression", "deleuze", "frege", "sense", "expressed", "proposition", "two", "sens", "morning", "star", "evening", "star", "two", "way", "denotatum", "may", "expressed", "proposition", "deleuze", "contribution", "philosophy", "sense", "really", "begin", "take", "show", "attempt", "make", "fourth", "dimension", "evident", "akin", "lewis", "carroll", "hunt", "snark", "unraveling", "möbius", "strip", "since", "sense", "neither", "physical", "mental", "existence", "deleuze", "suggests", "stoic", "first", "discovered", "dimension", "sense", "distinguished", "corporeal", "mixture", "incorporeal", "event", "attribute", "proper", "name", "battle", "waterloo", "particular", "state", "affair", "battle", "incorporeal", "event", "sense", "reality", "expression", "proposition", "find", "state", "affair", "body", "mixing", "one", "anotherspears", "stabbing", "flesh", "bullet", "flying", "air", "cannon", "firing", "body", "ripped", "apartand", "battle", "effect", "result", "intermingling", "body", "sense", "thus", "complex", "status", "one", "hand", "exist", "outside", "proposition", "express", "confused", "proposition", "since", "distinct", "objectity", "exist", "rather", "subsists", "insists", "hand", "attributed", "state", "affair", "thing", "confused", "identified", "state", "affair", "quality", "relation", "state", "sense", "expressible", "expressed", "proposition", "attribute", "state", "affair", "turn", "one", "side", "toward", "thing", "another", "side", "toward", "proposition", "confused", "proposition", "expressed", "state", "affair", "quality", "proposition", "denotes", "exactly", "boundary", "proposition", "thing", "l", "22", "structure", "sense", "generates", "number", "paradox", "deleuze", "distinguishes", "paradox", "signification", "discovered", "russell", "set", "theory", "set", "set", "barber", "regiment", "first", "paradox", "regress", "indefinite", "proliferation", "never", "state", "sense", "saying", "take", "sense", "saying", "object", "another", "proposition", "whose", "sense", "turn", "state", "ad", "infinitum", "first", "paradox", "point", "impotence", "speaker", "inability", "state", "sense", "saying", "highest", "power", "language", "infinite", "capability", "speak", "word", "second", "paradox", "sterile", "reiteration", "doubling", "one", "avoid", "infinite", "regress", "extracting", "sense", "mere", "double", "proposition", "price", "catapulting", "u", "third", "paradox", "neutrality", "sterilitysense", "necessarily", "neutral", "regard", "various", "mode", "proposition", "quality", "affirmation", "negation", "quantity", "none", "relation", "modality", "possibility", "reality", "necessity", "thus", "extracted", "proposition", "deleuze", "argues", "sense", "status", "pure", "ideational", "event", "irreducible", "proposition", "three", "dimension", "1", "state", "affair", "proposition", "denote", "2", "experience", "mental", "activity", "belief", "desire", "image", "representation", "person", "express", "proposition", "3", "universal", "general", "concept", "sense", "said", "engender", "dimension", "proposition", "second", "task", "logic", "sense", "combine", "sterility", "sense", "relation", "proposition", "extracted", "power", "genesis", "relation", "dimension", "proposition", "l", "32", "second", "half", "logic", "sense", "deleuze", "analyzes", "call", "dynamic", "genesis", "language", "drawing", "part", "text", "developmental", "psychology", "psychoanalysis", "render", "language", "possible", "writes", "separate", "sound", "body", "organizes", "proposition", "freeing", "expressive", "function", "l", "181", "deleuze", "distinguishes", "three", "stage", "dynamic", "genesis", "time", "constitute", "three", "dimension", "language", "1", "primary", "order", "noise", "produced", "depth", "body", "2", "secondary", "organization", "constitutes", "surface", "sense", "nonsense", "3", "tertiary", "arrangement", "ordonnance", "found", "fullyformed", "proposition", "function", "denotation", "manifestation", "signification", "first", "stage", "dynamic", "genesis", "sense", "primary", "order", "language", "found", "newborn", "infant", "deleuze", "draw", "tradition", "developmental", "psychology", "whose", "insight", "expressed", "vivid", "image", "daniel", "n", "stern", "infant", "experience", "kind", "human", "weatherscape", "made", "entirely", "sequence", "rising", "fallings", "intensitythe", "jolting", "bright", "light", "sharp", "noise", "calming", "voice", "explosive", "breakout", "storm", "hunger", "interpersonal", "world", "infant", "1985", "deleuze", "draw", "upon", "writing", "french", "writer", "antonin", "artaud", "call", "life", "intensitiesinmotion", "body", "without", "organs", "primary", "order", "language", "pure", "noise", "dimension", "body", "constitutes", "first", "type", "nonsense", "midst", "world", "intensity", "also", "appears", "particular", "noise", "sound", "child", "parent", "adult", "long", "infant", "understand", "word", "sentence", "grasp", "language", "something", "preexists", "something", "alwaysalready", "like", "voice", "high", "child", "voice", "dimension", "language", "without", "condition", "adult", "experience", "hear", "foreign", "language", "spoken", "infant", "accede", "tertiary", "arrangement", "language", "denotation", "manifestation", "signification", "must", "pas", "secondary", "organization", "production", "surface", "dimension", "sense", "construction", "take", "place", "flow", "voice", "child", "extract", "differential", "element", "various", "order", "phoneme", "morpheme", "semantemes", "begin", "synthesize", "diverse", "series", "point", "deleuze", "isolates", "three", "series", "synthesis", "connective", "conjunctive", "disjunctive", "first", "child", "connects", "phoneme", "concatenation", "successive", "entity", "mama", "dada", "second", "construction", "esoteric", "word", "phoneme", "integration", "conjunction", "royal", "highness", "contracted", "reince", "third", "child", "start", "making", "esoteric", "word", "ramify", "enter", "relation", "divergent", "independent", "series", "clearly", "see", "construction", "secondary", "organization", "sense", "yet", "fully", "formed", "unit", "tertiary", "arrangement", "language", "high", "longer", "merely", "bodily", "noise", "primary", "order", "child", "understanding", "linguistic", "unit", "undertakes", "vast", "apprenticeship", "formative", "element", "domain", "sense", "condition", "ground", "proposition", "form", "possibility", "ideal", "matter", "medium", "positioned", "immediately", "within", "sense", "whenever", "denote", "manifest", "signify", "moreover", "since", "sense", "lie", "frontier", "word", "thingsit", "expressed", "proposition", "attributed", "state", "affair", "confused", "either", "proposition", "state", "affairsit", "engenders", "determinate", "dimension", "proposition", "denotation", "manifestation", "signification", "well", "objective", "correlate", "denoted", "manifested", "signified", "domain", "sense", "necessarily", "subject", "fundamental", "fragility", "capable", "toppling", "nonsense", "ground", "give", "way", "groundlessness", "sansfond", "reason", "clear", "sense", "never", "principle", "origin", "rather", "effect", "produced", "produced", "element", "sense", "sense", "word", "determinate", "relation", "nonsense", "deleuze", "however", "distinguishes", "two", "different", "type", "nonsense", "first", "lewis", "carroll", "remains", "surface", "sense", "like", "child", "make", "use", "nonsignifying", "element", "language", "order", "construct", "portmanteau", "word", "snark", "shark", "snake", "frumious", "furious", "fuming", "nonsensical", "phrase", "twas", "brillig", "slithy", "toves", "gyre", "gimble", "wabe", "populate", "writing", "logic", "sense", "part", "reading", "carroll", "work", "one", "knew", "better", "carroll", "condition", "production", "sense", "deleuze", "elucidates", "detail", "extraction", "differential", "element", "pure", "event", "organization", "multiple", "series", "importantly", "aleatory", "point", "paradoxical", "element", "link", "series", "ideal", "quasicause", "produce", "effect", "sense", "nonsense", "second", "type", "nonsense", "profound", "surface", "nonsense", "found", "lewis", "carroll", "terrifying", "nonsense", "primary", "order", "found", "expression", "writing", "antonin", "artaud", "sense", "prevents", "sonorous", "language", "confused", "physical", "body", "noise", "primary", "order", "schizophrenia", "experienced", "artaud", "longer", "anything", "prevent", "proposition", "falling", "back", "onto", "body", "mingle", "sonorous", "element", "olfactory", "gustatory", "digestive", "effect", "body", "artaud", "crissouffles", "ratara", "ratara", "ratara", "atara", "tatara", "rana", "otara", "otara", "katara", "deleuze", "develop", "theory", "bodywithoutorgans", "collaboration", "félix", "guattari", "turn", "shall", "see", "concept", "bodywithoutorgans", "put", "work", "complex", "naturalistic", "philosophy", "desiringproduction", "move", "far", "beyond", "question", "sense", "realm", "nature", "history", "politics", "word", "logic", "sense", "represents", "deleuze", "confrontation", "linguistic", "turn", "important", "twentiethcentury", "philosophy", "confrontation", "quickly", "put", "behind", "came", "embrace", "fully", "materialist", "naturalistic", "leaning", "4", "collaboration", "guattari", "following", "work", "philosophy", "difference", "deleuze", "meet", "guattari", "aftermath", "may", "1968", "famous", "event", "marked", "french", "culture", "politics", "ever", "since", "brought", "together", "student", "worker", "befuddlement", "established", "guardian", "revolution", "french", "communist", "party", "day", "general", "strike", "standoff", "police", "led", "french", "president", "charles", "de", "gaulle", "call", "general", "election", "de", "gaulle", "call", "parliamentary", "solution", "crisis", "backed", "communist", "evidently", "scared", "revolution", "belowwhich", "definition", "would", "lack", "party", "discipline", "cravedas", "official", "holder", "state", "power", "whose", "position", "aspired", "workerstudent", "movement", "eventually", "collapsed", "leaving", "memory", "nonscripted", "social", "interaction", "revealing", "investment", "party", "lampooned", "thereafter", "bureaucrat", "revolution", "foucault", "word", "preface", "english", "translation", "antioedipus", "french", "communist", "party", "agreement", "de", "gaulle", "allow", "parliamentary", "solution", "social", "crisis", "glaring", "example", "horizon", "identity", "desire", "someone", "control", "central", "state", "bureaucracy", "allowed", "opposition", "gaullists", "communist", "rival", "control", "state", "shackle", "difference", "government", "response", "may", "1968", "changed", "french", "academic", "life", "two", "way", "first", "institutionally", "creation", "paris", "viii", "vincennes", "deleuze", "taught", "second", "direction", "philosophy", "difference", "became", "explicitly", "political", "post1968", "became", "fact", "politics", "philosophy", "dedicated", "exposing", "historical", "force", "relation", "producing", "identity", "ontological", "epistemological", "form", "word", "philosophy", "difference", "set", "show", "unified", "object", "world", "unified", "subject", "know", "hence", "control", "unified", "body", "knowledge", "codify", "knowledge", "unified", "institution", "philosophy", "police", "whole", "affair", "product", "historical", "political", "force", "combat", "force", "purely", "philosophical", "term", "work", "guattari", "naturalize", "stillkantian", "framework", "difference", "repetition", "time", "antioedipus", "thousand", "plateau", "deleuze", "guattari", "explicitly", "thematize", "synthesis", "investigate", "fully", "material", "synthesis", "synthesis", "nature", "geological", "well", "biological", "social", "psychological", "register", "welchman", "2009", "organic", "synthesis", "inorganic", "one", "well", "spatiotemporal", "dynamisms", "full", "naturalization", "synthesis", "question", "panpsychism", "brought", "full", "relief", "protevi", "2011", "since", "material", "synthesis", "much", "synthesis", "experience", "synthesis", "thing", "see", "title", "chapter", "3", "thousand", "plateau", "geology", "moral", "earth", "think", "41", "antioedipus", "considering", "antioedipus", "first", "discus", "performative", "effect", "attempt", "force", "u", "think", "fight", "tendency", "cliché", "reading", "antioedipus", "indeed", "shocking", "experience", "first", "find", "bizarre", "collection", "source", "example", "schizophrenic", "ranting", "antonin", "artaud", "provides", "one", "basic", "concept", "work", "body", "without", "organs", "second", "book", "vulgarity", "infamous", "opening", "line", "unconscious", "id", "work", "everywhere", "functioning", "smoothly", "time", "time", "fit", "start", "breathes", "heat", "eats", "shit", "fuck", "ça", "chie", "ça", "baise", "mistake", "ever", "said", "id", "7", "1", "third", "performative", "effect", "humor", "mocking", "melanie", "klein", "analysis", "child", "say", "oedipus", "slap", "upside", "head", "sinon", "aura", "un", "gifle", "54", "45", "trans", "modified", "many", "passage", "like", "safe", "say", "philosophy", "book", "contain", "many", "joke", "pun", "double", "entendres", "antioedipus", "fourth", "element", "gleeful", "coarseness", "polemic", "among", "many", "example", "thinker", "signifier", "associated", "lap", "dog", "tyrant", "member", "french", "communist", "party", "said", "fascist", "libidinal", "investment", "freud", "described", "masked", "al", "capone", "performative", "effect", "reading", "antioedipus", "unforgettable", "passing", "conceptual", "structure", "book", "key", "term", "antioedipus", "desiringproduction", "crisscross", "marx", "freud", "putting", "desire", "ecosocial", "realm", "production", "production", "unconscious", "realm", "desire", "rather", "attempting", "synthesize", "marx", "freud", "usual", "way", "reductionist", "strategy", "either", "1", "operates", "favor", "freud", "positing", "libidinal", "investment", "social", "figure", "pattern", "requires", "sublimating", "original", "investment", "family", "figure", "pattern", "2", "operates", "favor", "marx", "positing", "neurosis", "psychosis", "mere", "superstructural", "byproduct", "unjust", "social", "structure", "deleuze", "guattari", "call", "desiringproduction", "universal", "primary", "process", "underlying", "seemingly", "separate", "natural", "social", "psychological", "realm", "desiringproduction", "thus", "anthropocentric", "heart", "world", "besides", "universal", "scope", "need", "realize", "two", "thing", "desiringproduction", "right", "away", "1", "subject", "lie", "behind", "production", "performs", "production", "2", "desire", "desiringproduction", "oriented", "making", "lack", "purely", "positive", "desiringproduction", "autonomous", "selfconstituting", "creative", "natura", "naturans", "spinoza", "willtopower", "nietzsche", "antioedipus", "along", "conceptual", "terminological", "innovation", "work", "grand", "ambition", "among", "1", "ecosocial", "theory", "production", "encompassing", "side", "natureculture", "split", "function", "ontology", "change", "transformation", "becoming", "2", "universal", "history", "social", "formationsthe", "savage", "tribal", "barbarian", "imperial", "capitalistwhich", "function", "synthetic", "social", "science", "3", "clear", "ground", "function", "critique", "received", "version", "marx", "freudand", "attempt", "synthesize", "analogizing", "realm", "application", "pursuing", "ambition", "antioedipus", "virtue", "fault", "tour", "de", "force", "unimagined", "connection", "disparate", "element", "made", "possible", "cost", "somewhat", "strained", "conceptual", "scheme", "antioedipus", "identifies", "two", "primary", "register", "desiringproduction", "natural", "metaphysical", "social", "historical", "related", "following", "way", "natural", "desiringproduction", "social", "machine", "repress", "also", "revealed", "capitalism", "end", "history", "contingent", "history", "one", "avoids", "dialectical", "law", "history", "capitalism", "set", "free", "desiringproduction", "even", "attempt", "rein", "institution", "private", "property", "familial", "oedipal", "patterning", "desire", "schizophrenic", "propelled", "charge", "desiringproduction", "thus", "set", "free", "fail", "limit", "capitalist", "society", "proposes", "thus", "providing", "clue", "working", "desiringproduction", "important", "start", "realize", "deleuze", "guattari", "advocate", "schizophrenia", "lifestyle", "model", "political", "program", "schizophrenic", "clinical", "entity", "result", "interruption", "blocking", "process", "desiringproduction", "taken", "nature", "society", "restricted", "body", "individual", "spin", "void", "rather", "make", "connection", "constitute", "reality", "desiringproduction", "connect", "reality", "escaping", "subjective", "prison", "touch", "objective", "make", "reality", "real", "twisting", "lacanian", "sense", "term", "lacan", "real", "produced", "illusory", "retrojected", "remainder", "signifying", "system", "deleuze", "guattari", "real", "reality", "process", "selfmaking", "schizophrenic", "sick", "person", "need", "help", "schizophrenia", "avenue", "unconscious", "unconscious", "individual", "transcendental", "unconscious", "unconscious", "social", "historical", "natural", "studying", "schizophrenic", "process", "deleuze", "guattari", "posit", "natural", "social", "register", "desiringproduction", "composed", "three", "synthesis", "connective", "disjunctive", "conjunctive", "synthesis", "perform", "three", "function", "production", "recording", "enjoyment", "associate", "production", "physiological", "recording", "semiotic", "enjoyment", "psychological", "register", "important", "catch", "kantian", "resonance", "synthesis", "equally", "important", "note", "keeping", "poststructuralist", "angle", "discussed", "subject", "performing", "synthesis", "instead", "subject", "one", "product", "synthesis", "synthesis", "underlying", "subject", "immanent", "process", "desiringproduction", "positing", "subject", "behind", "synthesis", "would", "transcendent", "use", "synthesis", "see", "another", "reference", "kantian", "principle", "immanence", "deleuze", "guattari", "propose", "study", "immanent", "use", "synthesis", "materialist", "psychoanalysis", "schizoanalysis", "contrast", "psychoanalysis", "transcendent", "use", "synthesis", "producing", "five", "paralogism", "transcendental", "illusion", "involve", "assigning", "characteristic", "extensive", "property", "actual", "product", "intensive", "production", "process", "put", "term", "philosophy", "difference", "paralogism", "subordinate", "differential", "process", "identity", "derived", "product", "according", "universal", "history", "undertaken", "antioedipus", "social", "life", "three", "form", "socius", "social", "body", "take", "credit", "production", "earth", "tribe", "body", "despot", "empire", "capital", "capitalism", "according", "deleuze", "guattari", "reading", "anthropological", "literature", "tribal", "society", "mark", "body", "initiation", "ceremony", "product", "organ", "traced", "clan", "mythically", "traced", "earth", "precisely", "one", "enchanted", "region", "function", "organ", "full", "body", "earth", "material", "flow", "thus", "territorialized", "traced", "onto", "earth", "credited", "source", "production", "sign", "tribal", "inscription", "signifier", "map", "onto", "voice", "enact", "savage", "triangle", "forming", "theater", "cruelty", "implies", "triple", "independence", "articulated", "voice", "graphic", "hand", "appreciative", "eye", "189", "empire", "overcode", "tribal", "meaning", "code", "tracing", "production", "back", "despot", "divine", "father", "people", "material", "flow", "despotic", "empire", "thus", "deterritorialized", "longer", "credited", "earth", "immediately", "reterritorialized", "body", "despot", "assumes", "credit", "production", "tribal", "sign", "overcoded", "signifier", "formed", "deterritorialized", "sign", "allowing", "communication", "conquered", "conqueror", "signifier", "flattening", "biunivocalization", "two", "chain", "lined", "one", "one", "written", "spoken", "2056", "cf", "derrida", "notion", "phonocentrism", "body", "despot", "imperial", "socius", "mean", "worker", "hand", "emperor", "spy", "eye", "capitalism", "radical", "decoding", "deterritorialization", "material", "flow", "previous", "social", "machine", "zealously", "coded", "earth", "body", "despot", "production", "credited", "body", "capital", "form", "recording", "work", "substitution", "axiomatic", "code", "context", "axiomatic", "mean", "set", "simple", "principle", "quantitative", "calculation", "difference", "flow", "deterritorialized", "labor", "capital", "rather", "elaborate", "rule", "qualitative", "judgment", "map", "flow", "onto", "socius", "capitalism", "command", "utterly", "simple", "connect", "deterritorialized", "flow", "labor", "capital", "extract", "surplus", "connection", "thus", "capitalism", "set", "loose", "enormous", "productive", "chargeconnect", "flow", "faster", "faster", "the", "surplus", "institution", "private", "property", "try", "register", "belonging", "individual", "individual", "primarily", "social", "figure", "capitalist", "laborer", "secondarily", "private", "family", "member", "whereas", "organ", "body", "socially", "marked", "previous", "regime", "belonging", "clan", "earth", "belonging", "emperor", "jus", "primae", "noctis", "body", "organ", "privatized", "capitalism", "attached", "person", "member", "family", "deleuze", "guattari", "term", "capitalism", "decoded", "flow", "reterritorialized", "person", "family", "member", "figure", "oedipal", "triangle", "42", "thousand", "plateau", "three", "difference", "work", "predecessor", "immediately", "apparent", "first", "thousand", "plateau", "much", "wider", "range", "register", "antioedipus", "cosmic", "geologic", "evolutionary", "developmental", "ethological", "anthropological", "mythological", "historical", "economic", "political", "literary", "musical", "even", "second", "result", "paralogism", "antioedipus", "become", "stratum", "thousand", "plateau", "organism", "unification", "totalization", "connective", "synthesis", "production", "physiological", "register", "signifying", "totality", "signifiance", "perhaps", "render", "signifierness", "flattening", "biunivocalizing", "disjunctive", "synthesis", "recording", "semiotic", "register", "subject", "reification", "conjunctive", "synthesis", "consummation", "psychological", "register", "finally", "antioedipus", "classical", "conceptual", "architecture", "chapter", "develop", "single", "argument", "thousand", "plateau", "written", "rhizome", "allowing", "immediate", "connection", "point", "rhizomatic", "structure", "traditional", "summary", "thesis", "argument", "thousand", "plateau", "either", "downright", "impossible", "best", "would", "much", "complex", "attempt", "encyclopedia", "article", "therefore", "limit", "following", "remark", "fourteen", "plateau", "plane", "intensityproductive", "connection", "immanently", "arrayed", "material", "system", "without", "reference", "external", "governing", "sourcedeleuze", "guattari", "develop", "new", "materialism", "politicized", "philosophy", "difference", "join", "force", "science", "explored", "difference", "repetition", "thousand", "plateau", "book", "strange", "new", "question", "earth", "think", "make", "body", "without", "organ", "warmachine", "ward", "apparatus", "capture", "state", "oversimplify", "deleuze", "guattari", "take", "insight", "dynamical", "system", "theory", "explores", "various", "threshold", "material", "system", "selforganize", "reduce", "degree", "freedom", "previous", "example", "convection", "current", "deleuze", "guattari", "extend", "notion", "selforganizing", "material", "systemsthose", "need", "transcendent", "organizing", "agent", "god", "leader", "capital", "subjectsto", "social", "linguistic", "politicaleconomic", "psychological", "realm", "resultant", "rhizome", "decentered", "network", "thousand", "plateau", "provides", "hint", "experimentation", "deregulated", "flow", "energy", "matter", "idea", "actionsand", "attendant", "attempt", "binding", "themthat", "make", "contemporary", "world", "thousand", "plateau", "maintains", "tripartite", "ontological", "scheme", "deleuze", "work", "title", "indicates", "geological", "term", "reference", "deleuze", "guattari", "call", "virtual", "earth", "intensive", "called", "consistency", "actual", "called", "system", "strata", "latter", "term", "indicates", "one", "focus", "investigation", "tendency", "system", "head", "toward", "congealment", "stratification", "precisely", "put", "concrete", "system", "composed", "intensive", "process", "tending", "toward", "virtual", "plane", "consistency", "andor", "toward", "actual", "stratification", "say", "exists", "intensive", "tending", "towards", "limit", "virtuality", "actuality", "last", "two", "ontological", "register", "exist", "insist", "use", "one", "deleuze", "term", "nothing", "ever", "instantiates", "sheer", "frozen", "stasis", "actual", "sheer", "differential", "dispersion", "virtual", "rather", "natural", "worldly", "process", "always", "actualization", "process", "actualization", "structured", "virtual", "multiplicity", "heading", "toward", "actual", "state", "never", "quite", "attain", "precisely", "system", "also", "contain", "tendency", "moving", "direction", "toward", "virtuality", "system", "le", "stable", "set", "process", "moving", "different", "direction", "toward", "actuality", "toward", "virtuality", "still", "word", "deleuze", "guattari", "process", "philosopher", "neither", "structure", "process", "completed", "product", "merit", "ontological", "status", "process", "perspective", "deleuze", "guattari", "offer", "detailed", "complex", "open", "system", "extraordinarily", "rich", "complex", "useful", "way", "follow", "concept", "coding", "stratification", "territorialization", "related", "following", "manner", "coding", "process", "ordering", "matter", "drawn", "body", "contrast", "stratification", "process", "creating", "hierarchal", "body", "territorialization", "ordering", "body", "assemblage", "say", "emergent", "unity", "joining", "together", "heterogeneous", "body", "consistency", "concept", "several", "network", "concept", "consideration", "space", "preclude", "u", "considering", "put", "work", "addressing", "following", "topic", "discussion", "notion", "rhizome", "first", "chapter", "plateau", "call", "deleuze", "guattari", "quickly", "dismiss", "psychoanalysis", "second", "third", "chapter", "discus", "process", "stratification", "physical", "organic", "social", "stratum", "special", "attention", "question", "population", "genetics", "speciation", "thought", "stratify", "channel", "flow", "gene", "chapter", "4", "5", "intervene", "debate", "linguistics", "favor", "pragmatic", "say", "highlighting", "incorporeal", "transformation", "label", "prompt", "different", "form", "action", "applied", "body", "pronounce", "man", "wife", "socially", "sanctioned", "order", "word", "bring", "deleuze", "guattari", "also", "refer", "speech", "act", "theory", "regard", "also", "lay", "theory", "territory", "set", "environmentally", "embedded", "trigger", "selforganizing", "process", "concomitant", "process", "deterritorialization", "breaking", "habit", "reterritorialization", "formation", "habit", "chapter", "6", "7", "discus", "method", "experimenting", "stratum", "found", "chapter", "6", "deal", "organic", "stratum", "organism", "notorious", "term", "art", "body", "without", "organ", "least", "partially", "glossed", "reservoir", "potential", "different", "pattern", "bodily", "affect", "chapter", "7", "deal", "intersection", "signifiance", "signifierness", "subjectification", "faciality", "face", "arrest", "drift", "signification", "tying", "meaning", "expressive", "gesture", "subject", "chapter", "8", "9", "deal", "social", "organizing", "practice", "name", "line", "segment", "particular", "interest", "treatment", "fascism", "chapter", "10", "return", "question", "intensive", "experimentation", "discussed", "term", "becoming", "least", "two", "system", "come", "together", "form", "emergent", "system", "assemblage", "chapter", "11", "discus", "refrain", "rhythm", "mean", "escaping", "forming", "new", "territory", "even", "existing", "process", "continual", "deterritorialization", "call", "consistency", "chapter", "12", "13", "discus", "relation", "war", "machine", "state", "former", "form", "social", "organization", "foster", "creativity", "reterritorializes", "deterritorialization", "latter", "apparatus", "capture", "living", "vampirically", "labor", "deleuze", "guattari", "basically", "marxist", "perspective", "apparent", "finally", "chapter", "14", "discus", "type", "social", "constitution", "space", "primarily", "smooth", "space", "war", "machine", "striated", "space", "state", "43", "philosophy", "long", "period", "pursued", "interest", "deleuze", "guattari", "published", "last", "collaboration", "1991", "philosophy", "answering", "title", "question", "deleuze", "guattari", "seek", "place", "philosophy", "relation", "science", "art", "three", "mode", "thought", "subordination", "among", "thought", "mode", "struggle", "chaos", "opinion", "philosophy", "creation", "construction", "concept", "concept", "intensive", "multiplicity", "inscribed", "plane", "immanence", "peopled", "conceptual", "persona", "operate", "conceptual", "machinery", "conceptual", "persona", "subject", "thinking", "subjective", "take", "place", "relationship", "territory", "earth", "science", "creates", "function", "plane", "reference", "art", "creates", "bloc", "sensation", "say", "compound", "percept", "affect", "wp", "164", "deal", "deleuze", "art", "detail", "discussing", "philosophy", "let", "u", "concentrate", "treatment", "relation", "philosophy", "science", "remember", "outset", "nomad", "minor", "science", "evoked", "thousand", "plateau", "royal", "major", "science", "make", "entirety", "deleuze", "guattari", "call", "science", "philosophy", "motif", "conflation", "unclear", "eye", "change", "considerably", "weakens", "value", "latter", "work", "may", "philosophy", "deleuze", "guattari", "vigorously", "deny", "philosophy", "needed", "help", "science", "think", "presupposition", "one", "need", "philosophy", "reflect", "anything", "wp", "6", "instead", "emphasize", "complementary", "nature", "two", "first", "point", "number", "similarity", "philosophy", "science", "approach", "chaos", "attempt", "bring", "order", "creative", "mode", "thought", "complementary", "well", "third", "mode", "creative", "thought", "art", "beyond", "similarity", "deleuze", "guattari", "distinguish", "philosophy", "creation", "concept", "plane", "immanence", "science", "creation", "function", "plane", "reference", "relate", "virtual", "differential", "field", "potential", "transformation", "material", "system", "different", "way", "philosophy", "give", "consistency", "virtual", "mapping", "force", "composing", "system", "pure", "potential", "system", "capable", "meanwhile", "science", "give", "reference", "determining", "condition", "system", "behave", "way", "actually", "philosophy", "countereffectuation", "event", "abstracting", "event", "change", "pattern", "body", "state", "affair", "thereby", "laying", "transformative", "potential", "inherent", "thing", "road", "taken", "coexist", "compossibles", "inclusive", "disjunction", "differentiation", "term", "difference", "repetition", "science", "track", "actualization", "virtual", "explaining", "one", "road", "chosen", "divergent", "series", "exclusive", "disjunction", "differenciation", "according", "difference", "repetition", "function", "predict", "behavior", "constituted", "system", "laying", "pattern", "predicting", "change", "based", "causal", "chain", "concept", "speak", "event", "wp", "21", "mapping", "multiplicity", "structuring", "possible", "pattern", "behavior", "systemand", "point", "system", "change", "habit", "develop", "new", "one", "deleuze", "guattari", "philosophy", "science", "deal", "property", "constituted", "thing", "philosophy", "deal", "constitution", "event", "roughly", "speaking", "philosophy", "explores", "plane", "immanence", "composed", "constellation", "constitutive", "force", "abstracted", "body", "state", "affair", "thus", "map", "range", "connection", "thing", "capable", "becomings", "affects", "science", "hand", "explores", "concretization", "force", "body", "state", "affair", "tracking", "behavior", "thing", "relation", "already", "constituted", "thing", "certain", "delimited", "region", "space", "time", "plane", "reference", "concept", "relate", "function", "concept", "concept", "also", "concept", "function", "purely", "philosophical", "creation", "without", "least", "scientific", "value", "wp", "117", "thus", "concrete", "concept", "like", "deterritorialization", "philosophical", "concept", "scientific", "function", "even", "though", "might", "resonate", "echo", "scientific", "function", "metaphor", "deleuze", "guattari", "repeatedly", "insist", "course", "realize", "danger", "citing", "scientific", "proposition", "outside", "sphere", "danger", "arbitrary", "metaphor", "forced", "application", "perhaps", "danger", "averted", "restrict", "taking", "scientific", "operator", "particular", "conceptualizable", "character", "refers", "nonscientific", "area", "converges", "science", "without", "applying", "making", "metaphor", "deleuze", "1989", "129", "deleuze", "guattari", "refusal", "recognize", "work", "contains", "metaphor", "due", "struggle", "imperialism", "signifying", "regime", "major", "theme", "antioedipus", "thousand", "plateau", "every", "relation", "different", "intellectual", "field", "grasped", "common", "notion", "metaphor", "reliant", "notion", "transfer", "sense", "primary", "secondary", "signification", "5", "deleuze", "art", "kant", "dissociated", "aesthetic", "two", "half", "theory", "sensibility", "form", "possible", "experience", "transcendental", "aesthetic", "critique", "pure", "reason", "theory", "art", "reflection", "real", "experience", "critique", "aesthetic", "judgment", "critique", "judgment", "deleuze", "work", "two", "half", "aesthetic", "reunited", "general", "aim", "art", "produce", "sensation", "genetic", "principle", "sensation", "time", "principle", "composition", "work", "art", "conversely", "work", "art", "best", "capable", "revealing", "condition", "sensibility", "deleuze", "therefore", "writes", "art", "critic", "philosopher", "book", "essay", "various", "artsincluding", "cinema", "cinema", "ii", "literature", "essay", "critical", "clinical", "painting", "francis", "bacon", "logic", "sensation", "must", "read", "philosophical", "exploration", "transcendental", "domain", "sensibility", "cinema", "instance", "produce", "image", "move", "move", "time", "two", "aspect", "film", "deleuze", "set", "analyze", "movementimage", "timeimage", "exactly", "cinema", "show", "u", "space", "time", "art", "show", "deleuze", "thus", "describes", "twovolume", "cinema", "book", "logic", "logic", "cinema", "set", "isolate", "certain", "cinematographic", "concept", "concept", "specific", "cinema", "formed", "philosophically", "francis", "bacon", "logic", "sensation", "likewise", "creates", "series", "philosophical", "concept", "relates", "particular", "aspect", "bacon", "painting", "also", "find", "place", "general", "logic", "sensation", "general", "deleuze", "locate", "condition", "sensibility", "intensive", "conception", "space", "virtual", "conception", "time", "necessarily", "actualized", "plurality", "space", "complex", "rhythm", "time", "instance", "nonextended", "space", "nonlinear", "time", "modern", "mathematics", "physic", "deleuze", "task", "art", "produce", "sign", "push", "u", "habit", "perception", "condition", "creation", "perceive", "via", "recognition", "property", "substance", "see", "stale", "eye", "preloaded", "clichés", "order", "world", "deleuze", "call", "representation", "regard", "deleuze", "cite", "francis", "bacon", "artwork", "produce", "effect", "nervous", "system", "brain", "mean", "figure", "speech", "art", "encounter", "forced", "experience", "sensible", "get", "something", "recognize", "something", "imperceptible", "it", "fit", "hylomorphic", "production", "model", "perception", "sense", "data", "matter", "hyle", "sensation", "ordered", "submission", "conceptual", "form", "art", "however", "recognized", "sensed", "word", "art", "split", "perceptual", "processing", "forbidding", "move", "conceptual", "ordering", "exactly", "kant", "third", "critique", "called", "reflective", "judgment", "concept", "immediately", "given", "presentation", "art", "art", "reach", "sensation", "sensible", "sentiendum", "deleuze", "talk", "effect", "sensation", "transcendent", "exercise", "faculty", "sensibility", "could", "refer", "third", "chapter", "difference", "repetition", "deleuze", "lay", "nonkantian", "differential", "theory", "faculties", "remarkable", "theory", "intensity", "difference", "carry", "faculty", "limit", "faculty", "linked", "order", "see", "deleuze", "call", "privilege", "sensibility", "origin", "knowledgethe", "truth", "empiricism", "differential", "theory", "faculty", "sensibility", "imagination", "memory", "thought", "communicate", "violence", "one", "sensibility", "pure", "difference", "intensity", "grasped", "immediately", "encounter", "sentiendum", "imagination", "disparity", "phantasm", "imagined", "memory", "turn", "memorandum", "dissimilar", "pure", "form", "time", "immemorial", "transcendent", "memory", "thought", "fractured", "self", "constrained", "think", "difference", "idea", "thus", "free", "form", "difference", "move", "faculty", "communicates", "violence", "next", "forced", "think", "starting", "art", "encounter", "intensity", "transmitted", "sign", "sensation", "rather", "common", "sense", "faculty", "agree", "recognizing", "object", "find", "communicated", "violence", "discordant", "harmony", "compare", "kantian", "sublime", "tear", "apart", "subject", "find", "notion", "cruelty", "deleuze", "pick", "artaud", "6", "reception", "deleuze", "writing", "deleuze", "provoked", "large", "literature", "explication", "introduction", "french", "english", "recently", "work", "german", "italian", "european", "language", "appeared", "also", "noteworthy", "critique", "rather", "attempt", "complete", "survey", "voluminous", "secondary", "literature", "concentrate", "major", "critique", "61", "feminist", "critique", "early", "wave", "criticism", "directed", "1980s", "deleuze", "collaboration", "guattari", "feminist", "alice", "jardine", "luce", "irigaray", "jardine", "1985", "criticized", "concept", "becomingwoman", "thousand", "plateau", "deleuze", "guattari", "position", "first", "step", "towards", "desubjectivizing", "becomingindiscernible", "jardine", "argued", "deleuze", "guattari", "claim", "even", "woman", "must", "undergo", "becomingwoman", "amount", "threat", "hardfought", "victory", "concrete", "feminist", "struggle", "allowed", "woman", "claim", "subjectivity", "first", "place", "according", "grosz", "1994", "survey", "early", "feminist", "critique", "irigaray", "argued", "use", "becomingwoman", "figure", "change", "incumbent", "upon", "including", "men", "amount", "masculinist", "desexualizing", "appropriation", "feminist", "struggle", "1990s", "2000s", "number", "feminist", "associated", "corporeal", "feminism", "movement", "attempted", "positive", "connection", "deleuze", "name", "open", "experimental", "attitude", "toward", "bodily", "potential", "singular", "political", "register", "phrase", "body", "politic", "see", "among", "others", "braidotti", "1994", "2002", "gatens", "1996", "grosz", "1994", "1995", "olkowski", "1999", "lorraine", "1999", "essay", "buchanan", "colebrook", "2002", "62", "badiouan", "critique", "one", "important", "criticism", "deleuze", "put", "forth", "badiou", "1997", "badiou", "claimed", "contrary", "dominant", "perception", "deleuze", "much", "philosopher", "multiple", "one", "conducted", "highly", "technical", "idiom", "known", "badiou", "criticizes", "deleuze", "certain", "vitalism", "badiou", "eye", "fall", "short", "axiomatic", "austerity", "demanded", "philosophy", "whereas", "badiou", "merely", "ignored", "collaborative", "work", "guattari", "žižek", "2003", "conduct", "polemic", "guattari", "collaboration", "favor", "deleuzean", "logic", "characterized", "immaterial", "affect", "generated", "interacting", "body", "sterile", "surface", "pure", "becoming", "logic", "sense", "third", "critical", "work", "vein", "hallward", "2005", "hallward", "singular", "logic", "deleuze", "thought", "analogous", "tradition", "theophantic", "thinker", "whereby", "divine", "spark", "creation", "entombed", "creature", "task", "creature", "redeem", "divine", "spark", "creatural", "prison", "redemption", "annihilation", "deleuze", "philosophy", "lacanianžižekian", "renunciationextinction", "response", "badiouan", "critique", "note", "one", "promising", "lead", "future", "research", "discussing", "relation", "badiou", "deleuze", "concentrate", "type", "mathematics", "thinker", "prefers", "rather", "accepting", "badiou", "characterization", "deleuze", "thinker", "reality", "biological", "term", "opposed", "badiou", "mathematical", "orientation", "see", "deleuze", "proposing", "problematic", "version", "mathematics", "versus", "badiou", "axiomatic", "conception", "tack", "taken", "smith", "2003", "63", "deleuze", "science", "deleuze", "aware", "finitist", "revolution", "history", "differential", "calculus", "despite", "sokal", "bricmont", "1999", "intimation", "otherwise", "writes", "difference", "repetition", "mistake", "tie", "value", "symbol", "dx", "existence", "infinitesimal", "also", "mistake", "refuse", "ontological", "gnoseological", "value", "name", "refusal", "latter", "fact", "treasure", "buried", "within", "old", "socalled", "barbaric", "prescientific", "interpretation", "differential", "calculus", "must", "separated", "infinitesimal", "matrix", "great", "deal", "heart", "great", "deal", "truly", "philosophical", "naivety", "needed", "order", "take", "symbol", "dx", "seriously", "170", "seems", "obvious", "deleuze", "treatment", "early", "form", "differential", "calculus", "meant", "intervention", "history", "mathematics", "attempt", "philosophy", "mathematics", "investigation", "seeking", "form", "properly", "philosophical", "concept", "difference", "mean", "extracting", "certain", "form", "thought", "clearly", "label", "antiquated", "mathematical", "method", "positive", "view", "deleuze", "use", "mathematics", "provocation", "formation", "philosophical", "concept", "see", "essay", "duffy", "2006", "massumi", "1992", "delanda", "2003", "attempt", "show", "deleuze", "epistemology", "ontology", "brought", "together", "result", "contemporary", "dynamical", "system", "theory", "popularly", "known", "chaos", "complexity", "theory", "bell", "2006", "follows", "work", "protevi", "2001", "look", "accompanying", "notion", "hylomorphism", "selforganization", "history", "philosophy", "bonta", "protevi", "2004", "treat", "deleuze", "dynamic", "system", "theory", "regard", "potential", "geographical", "work", "issue", "deleuze", "science", "see", "essay", "mark", "2006", "finally", "ansell", "pearson", "1999", "brought", "attention", "deleuze", "biology", "see", "also", "toscano", "2006", "regard", "64", "deleuze", "effect", "interest", "deleuze", "continues", "grow", "three", "effect", "interest", "u", "one", "sociological", "two", "philosophical", "sociological", "effect", "globalization", "institution", "devoted", "study", "deleuze", "thought", "application", "various", "field", "noteworthy", "institutional", "initiative", "series", "conference", "sponsored", "journal", "deleuze", "guattari", "study", "see", "internet", "resource", "leadership", "ian", "buchanan", "addition", "numerous", "conference", "europe", "north", "america", "index", "deleuze", "widespread", "impact", "success", "number", "conference", "asia", "date", "taiwan", "india", "singapore", "south", "korea", "china", "japan", "two", "philosophical", "effect", "reviving", "interest", "deleuze", "discus", "explicitly", "whose", "influence", "deleuze", "discerned", "providing", "foil", "counterpoint", "reference", "point", "reading", "philosopher", "prominent", "example", "revivifying", "effect", "bergson", "relatively", "forgotten", "time", "deleuze", "bergsonism", "1966", "subject", "growing", "philosophical", "literature", "course", "attribute", "interest", "deleuze", "book", "subsequent", "secondary", "literature", "deleuze", "stress", "contribution", "bergson", "deleuze", "system", "concept", "virtual", "critique", "possible", "implausible", "consider", "counterfactual", "whereby", "without", "deleuze", "work", "interest", "bergson", "would", "strong", "currently", "among", "bergson", "commentary", "mullarkey", "1999", "guerlac", "2006", "moulardleonard", "2009", "grosz", "2017", "lundy", "2018", "link", "two", "thinker", "work", "postkantian", "salomon", "maimon", "time", "subject", "specialist", "interest", "historian", "philosophy", "see", "entry", "maimon", "see", "also", "recent", "english", "translation", "major", "work", "maimon", "1790", "2010", "maimon", "relation", "deleuze", "explored", "jones", "roffe", "ed", "2009", "smith", "2010", "voss", "2011", "another", "example", "thinker", "whose", "current", "level", "interest", "arguably", "catalyzed", "noticed", "influence", "deleuze", "mid20th", "century", "french", "philosopher", "gilbert", "simondon", "whose", "notion", "preindividual", "crystallization", "influential", "development", "deleuze", "notion", "virtual", "actualization", "respectively", "english", "translation", "work", "simondon", "2020", "among", "others", "see", "toscano", "2006", "2009", "scott", "2014", "sauvagnargues", "2016", "swan", "2016", "alloa", "michalet", "2017", "voss", "2018", "2020", "treatment", "deleuzesimondon", "relation", "yet", "another", "would", "early", "20th", "century", "french", "sociologist", "gabriel", "tarde", "whose", "notion", "microsociology", "referred", "approvingly", "deleuze", "guattari", "development", "notion", "micropolitics", "deleuze", "guattari", "1980", "1987", "216219", "deleuzeinspired", "treatment", "see", "alliez", "2001", "brighenti", "2010", "read", "2015", "tonkonoff", "2017", "recently", "still", "muted", "extent", "revival", "interest", "mid20th", "century", "french", "thinker", "raymond", "ruyer", "whose", "notion", "survol", "selfsurvey", "mentioned", "deleuze", "guattari", "brief", "remark", "consistency", "concept", "neural", "instantiation", "philosophy", "deleuze", "guattari", "1991", "1994", "210", "english", "translation", "ruyer", "work", "ruyer", "2016", "2018", "ruyer", "relation", "deleuze", "explored", "bains", "2002", "bogue", "2009", "2017", "roffe", "2017", "treatment", "ruyer", "relevant", "would", "massumi", "2014", "grosz", "2017", "finally", "certainly", "case", "whitehead", "garnered", "continuous", "interest", "good", "bit", "current", "whitehead", "scholarship", "includes", "reference", "deleuze", "leitmotif", "stengers", "2011", "noteworthy", "new", "work", "influenced", "deleuze", "whitehead", "williams", "2016", "see", "also", "shaviro", "2009", "robinson", "2010", "bell", "2011", "2012", "deleuze", "whitehead", "connection"]}