{"url": "feminism-class", "title": "Feminist Perspectives on Class and Work", "authorship": {"year": "Copyright © 2022", "author_text": "Ann Ferguson\n\nRosemary Hennessy\n\nMechthild Nagel\n<Mecke.Nagel@cortland.edu>", "author_links": [{"http://web.cortland.edu/nagelm/": "Mechthild Nagel"}, {"mailto:Mecke%2eNagel%40cortland%2eedu": "Mecke.Nagel@cortland.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nAnn Ferguson\n<br/>\nRosemary Hennessy\n<br/>\n<a href=\"http://web.cortland.edu/nagelm/\" target=\"other\">Mechthild Nagel</a>\n&lt;<a href=\"mailto:Mecke%2eNagel%40cortland%2eedu\"><em>Mecke<abbr title=\" dot \">.</abbr>Nagel<abbr title=\" at \">@</abbr>cortland<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Fri Oct 1, 2004", "substantive revision Wed Apr 13, 2022"], "preamble": "\n\nA good place to situate the start of theoretical debates about women,\nclass and work is in the intersection with Marxism and feminism. Such\ndebates were shaped not only by academic inquiries but as questions\nabout the relation between women’s oppression and liberation and\nthe class politics of the left, trade union and feminist movements in\nthe late 19th and 20th centuries, particularly\nin the U.S., Britain and Europe. It will also be necessary to consider\nvarious philosophical approaches to the concept of work, the way that\nwomen’s work and household activities are subsumed or not under\nthis category, how the specific features of this work may or may not\nconnect to different “ways of knowing” and different\napproaches to ethics, and the debate between essentialist and social\nconstructionist approaches to differences between the sexes as a base\nfor the sexual division of labor in most known human societies.\n\nThe relation of women as a social group to the analysis of economic\nclass has spurred political debates within both Marxist and feminist\ncircles as to whether women’s movements challenging male\ndomination can assume a common set of women’s interests across\nrace, ethnicity, and class. If there are no such interests, on what\ncan a viable women’s movement be based, and how can it evade\npromoting primarily the interests of white middle class and wealthy\nwomen? To the extent to which women do organize themselves as a\npolitical group cutting across traditional class lines, under what\nconditions are they a conservative influence as opposed to a\nprogressive force for social change? If poor and working class\nwomen’s issues are different than middle and upper class\nwomen’s issues, how can middle class women’s movements be\ntrusted to address them? In addition to these questions, there is a\nset of issues related to cross-cultural comparative studies of women,\nwork and relative power in different societies, as well as analyses of\nhow women’s work is connected to processes of globalization.\n\nConsiderable research in the past 30 years has been devoted to women\nand work in the context of shifting divisions of labor globally\n(Ehrenreich and Hochschild 2004). Some of this feminist work proceeds\nfrom the development perspectives promoted by the UN and other policy\nmaking institutions (Chen et al. 2005), while other research\ntakes a more critical view (Beneria 2003; Pyle and Ward 2007). Many\nstudies address changes in the gender division of labor within\nspecific national economies (Freeman 1999; George 2005; Rofel;\nSangster 1995) while others consider the impact of transnational\nmigration on women’s class position (Pratt 2004; Romero 1992;\nStephen 2007; Keogh 2015) and women’s opportunities for\ncross-class solidarity and grassroots-based organizing (Mohanty 2003).\nMore recent feminist research has addressed the restructuring of work\nand its impact on women and gender culture as an effect of neo-liberal\neconomic adjustments (Adkins 2002; Enloe 2004; Federici 2008 [Other\nInternet Resources]; McRobbie 2002; Skeggs 2003).\n", "toc": [{"#MarxWorkHumaNatu": "1. Marxism, Work, and Human Nature"}, {"#MarxFemiAnal": "2. Marxist-Feminist Analyses"}, {"#FirsWaveFemiAnalWomeWork": "3. First Wave Feminist Analyses of Women and Work"}, {"#SecoWaveFemiAnalHous": "4. Second Wave Feminist Analyses of Housework"}, {"#PublSpliImpl": "5. The Public/Private Split and Its Implications"}, {"#PsycTheoWomeWork": "6. Psychological Theories of Women and Work"}, {"#EthiTheoWomeCariWork": "7. Ethical Theories of Women’s Caring Work"}, {"#ModeVsPostFemiTheo": "8. Modernist vs. Postmodernist Feminist Theory"}, {"#RaceClasInteFemiAnal": "9. Race, Class, and Intersectional Feminist Analyses"}, {"#AnarPersWorkOthe": "10. Anarchist Perspectives on Work and its Other"}, {"#PuniPersWorkNonWork": "11. Punitive Perspectives on Work and Non-Work"}, {"#ConcRema": "12. Concluding Remarks"}, {"#Bib": "Bibliography"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Marxism, Work, and Human Nature\n\nMarxism as a philosophy of human nature stresses the centrality of\nwork in the creation of human nature itself and human\nself-understanding.  Both the changing historical relations between\nhuman work and nature, and the relations of humans to each other in\nthe production and distribution of goods to meet material needs\nconstruct human nature differently in different historical periods:\nnomadic humans are different than agrarian or industrial\nhumans. Marxism as a philosophy of history and social change\nhighlights the social relations of work in different economic modes of\nproduction in its analysis of social inequalities and exploitation,\nincluding relations of domination such as racism and sexism. (Marx\n1844, 1950, 1906–9; Marx and Engels 1848, 1850; Engels\n1942). Within capitalism, the system they most analyzed, the logic of\nprofit drives the bourgeois class into developing the productive\nforces of land, labor and capital by expanding markets, turning land\ninto a commodity and forcing the working classes from feudal and\nindependent agrarian production into wage labor. Marx and Engels argue\nthat turning all labor into a commodity to be bought and sold not only\nalienates workers by taking the power of production away from them, it\nalso collectivizes workers into factories and mass assembly\nlines. This provides the opportunity for workers to unite against the\ncapitalists and to demand the collectivization of property, i.e.,\nsocialism, or communism.\n\nAccording to Engels’s famous analysis of women’s situation\nin the history of different economic modes production in The\nOrigin of the Family, Private Property and the State (1942),\nwomen are originally equal to, if not more powerful than, men in\ncommunal forms of production with matrilineal family organizations.\nWomen lose power when private property comes into existence as a mode\nof production. Men’s control of private property, and the\nability thereby to generate a surplus, changes the family form to a\npatriarchal one where women, and often slaves,\n [1]\n become the property of the father and husband.\n\nThe rise of capitalism, in separating the family household from\ncommodity production, further solidifies this control of men over\nwomen in the family when the latter become economic dependents of the\nformer in the male breadwinner-female housewife nuclear family form.\nImportantly, capitalism also creates the possibility of women’s\nliberation from family-based patriarchy by creating possibilities for\nwomen to work in wage labor and become economically independent of\nhusbands and fathers. Engels stresses, however, that because of the\nproblem of unpaid housework, a private task allocated to women in the\nsexual division of labor of capitalism, full women’s liberation\ncan only be achieved with the development of socialism and the\nsocialization of housework and childrearing in social services\nprovided by the state. For this reason, most contemporary Marxists\nhave argued that women’s liberation requires feminists to join\nthe working class struggle against capitalism (Cliff 1984).\n2. Marxist-Feminist Analyses\n\nMany Marxist-feminists thinkers, prominent among them sociologists and\nanthropologists, have done cross-cultural and historical studies of\nearlier forms of kinship and economy and the role of the sexual or\ngender division of labor in supporting or undermining women’s\nsocial power (cf. Reed 1973, Leacock 1972, Rosaldo and Lamphere 1974).\nThey have also attempted to assess the world economic development of\ncapitalism as a contradictory force for the liberation of women\n(Federici 2004; Mies 1986; Saffioti 1978) and to argue that universal\nwomen’s liberation requires attention to the worse off: poor\nwomen workers in poor post-colonial countries (Sen & Grown 1987).\nOther feminist anthropologists have argued that other variables in\naddition to women’s role in production are key to understanding\nwomen’s social status and power (Sanday 1981; Leghorn and Parker\n1981). Yet other feminist economic historians have done historical\nstudies of the ways that race, class and ethnicity have situated women\ndifferently in relation to production, for example in the history of\nthe United States (Davis 1983; Amott and Matthaei 1991). Finally some\nMarxist-feminists have argued that women’s work in biological\nand social reproduction is a necessary element of all modes of\nproduction and one often ignored by Marxist economists (Benston 1969;\nHennessy 2003; Vogel 1995).\n3. First Wave Feminist Analyses of Women and Work\n\nThose feminist analyses which have highlighted the role of\nwomen’s work in the social construction of gender and the\nperpetuation of male dominance have been termed liberal, radical,\nMarxist, and socialist feminism by such influential categorizers as\nJaggar and Rothenberg [Struhl] (1978), Tong (2000), Barrett (1980),\nJaggar (1983) and Walby\n (1990)[2].\n However, the pigeonhole categories of liberal, radical, Marxist, or\nsocialist categories apply poorly to both to first wave women’s\nmovement feminist predecessors and contemporary deconstructionist,\npost-structuralist and post-colonialist perspectives.\n\nA number of first wave feminists write about work and class as key\nissues for women’s liberation, such as socialist-feminist\nCharlotte Perkins Gilman, heavily influenced by Darwinism and\n19th century utopian modernism (Gilman 1898, 1910, 1979),\nanarchist Emma Goldman (1969), and existentialist, radical feminist\nand Marxist of sorts Simone de Beauvoir (1952). This is because the\ndebates that arose around the place of the women’s movement in\nclass politics were different in the early and mid-twentieth century\nthan they were in the 1960s when many feminist theorists were trying\nto define themselves independently of the left anti-Vietnam war and\ncivil rights movements of the time.\n\nThe debate about the economic and social function of housework and its\nrelation to women’s oppression is an old one that has been a\nfeature of both the first and second wave women’s movements in\nthe US, Britain and Europe. In both eras, the underlying issue is how\nto handle the public/private split of capitalist societies in which\nwomen’s reproductive functions have either limited their work to\nthe home or created a “second shift” problem of unpaid\nhousework and childcare as well as waged work. In the first wave,\nlocated as it was in the Victorian period where the dominant ideology\nfor middle and upper class women was purity, piety and domesticity\n(also called the “cult of true womanhood”), the debate\ncentered on whether to keep housework in the private sphere yet make\nit more scientific and efficient (Beecher 1841; Richards 1915 ), or\nwhether to “socialize” it by bringing it into the public\nsphere, as socialist Charlotte Perkins Gilman advocated (1898).\n\nIn the US, the “public housekeeping” aspect of the\nProgressive movement of the 1890s through early 1900s advocated that\nwomen bring the positive values associated with motherhood into the\npublic sphere — by obtaining the vote, cleaning out corruption\nin politics, creating settlement houses to educate and support\nimmigrants, and forming the women’s peace movement, etc. (cf.\nJane Addams 1914). Disagreements about whether to downplay or valorize\nthe distinctive function and skills in motherhood as work for which\nwomen are naturally superior, or to see motherhood as restricting\nwomen’s chances for economic independence and equality with men\nin the public sphere, were also evident in debates between Ellen Keys\n(1909, 1914) and Gilman. Keys represented the difference side, that\nwomen are superior humans because of mothering; while Gilman and\nGoldman took the equality side of the debate, that is, that, women are\nrestricted, and made socially unequal to men, by unpaid housework and\n mothering[3].\n4. Second Wave Feminist Analyses of Housework\n\nIn the second wave movement, theorists can be grouped by their theory\nof how housework oppresses women. Typically, liberal feminists\ncritique housework because it is unpaid. This makes women dependent on\nmen and devalued, since their work is outside the meaningful sphere of\npublic economic production (Friedan 1963). Marxist feminist theorists\nsee this as part of the problem, but some go further to maintain that\nhousework is part of a household feudal mode of production of goods\nfor use that persists under capitalism and gives men feudal powers\nover women’s work (Benston 1969, Fox 1980). Other Marxist\nfeminists argue that women’s housework is part of the social\nreproduction of capitalism (Federici 1975, 2004; Malos 1975; Vogel\n1995). That the necessary work of reproducing the working class is\nunpaid allows more profits to capitalists. It is the sexual division\nof labor in productive and reproductive work that makes woman unequal\nto men and allows capitalists to exploit women’s unpaid labor.\nSome even make this analysis the basis for a demand for wages for\nhousework (Dalla Costa 1974; Federici 1975). More recently, Federici\nhas done an analysis of the transition to capitalism in Europe. She\nargues that it was the emerging capitalist class need to control\nworking class reproduction, to eliminate working class women’s\ncontrol over biological reproduction, and to assure their unpaid\nreproductive work in the home by restricting abortions, that fueled\nthe campaign against witches during this period (Federici 2004).\n\nOne of the philosophical problems raised by the housework debate is\nhow to draw the line between work and play or leisure activity when\nthe activity is not paid: is a mother playing with her baby working or\nengaged in play? If the former, then her hours in such activity may be\ncompared with those of her husband or partner to see if there is an\nexploitation relation present, for example, if his total hours of\nproductive and reproductive work for the family are less than hers\n(cf. Delphy 1984). But to the extent that childrearing counts as\nleisure activity, as play, as activity held to be intrinsically\nvaluable (Ferguson 2004), no exploitation is involved. Perhaps\nchildrearing and other caring activity is both work and play, but only\nthat portion which is necessary for the psychological growth of the\nchild and the worker(s) counts as work. If so, who determines when\nthat line is crossed? Since non-market activity does not have a clear\ncriterion to distinguish work from non-work, nor necessary from\nnon-necessary social labor, an arbitrary element seems to creep in\nthat makes standards of fairness difficult to apply to gendered\nhousehold bargains between men and women dividing up waged and\nnon-waged work. (Barrett 1980).\n\nOne solution to this problem is simply to take all household activity\nthat could also be done by waged labor (nannies, domestic servants,\ngardeners, chauffeurs, etc.) as work and to figure its comparable\nworth by the waged labor necessary to replace it (Folbre 1982, 1983).\nAnother is to reject altogether the attempts to base women’s\noppression on social relations of work, on the grounds that such\ntheories are overly generalizing and ignore the discrete meanings that\nkinship activities have for women in different contexts (Nicholson\n1991; Fraser and Nicholson 1991; Marchand 1995). Or, one can argue\nthat although the line between work and leisure changes historically,\nthose doing the activity should have the decisive say as to whether\ntheir activity counts as work, i.e., labor necessary to promote human\nwelfare. The existence of second wave women’s movements\ncritiques of the “second shift” of unpaid household\nactivity indicates that a growing number of women see most of it as\nwork, not play (cf. Hochschild 1989). Finally, one can argue that since\nthe human care involved in taking care of children and elders creates\na public good, it should clearly be characterized as work, and those\nwho are caretakers, primarily women, should be fairly compensated for\nit by society or the state (Ferguson and Folbre 2000: Folbre 2000,\nFerguson 2004).\n5. The Public/Private Split and Its Implications\n\nLiberal, Marxist and radical feminists have all characterized women as\ndoubly alienated in capitalism because of the public/private split\nthat relegates their work as mothers and houseworkers to the home, and\npsychologically denies them full personhood, citizenship and human\nrights (Foreman 1974, Okin 1989, Pateman 1988, Goldman 1969). Noting\nthat women workers on average only have about 70% of the average\nsalary of men in the contemporary U.S., feminists have claimed this is\nbecause women’s work, tied stereotypically to housework and\nhence thought unskilled is undervalued, whether it is cleaning or rote\nservice work, or nurturing work thought to be connected to natural\nmaternal motivations and aptitudes. Hence some feminists have\norganized in campaigns for “comparable worth” to raise\nwomen’s wages to the same as men’s wages involving\ncomparable skills (Brenner 2000; cf. also articles in Hansen and\nPhilipson eds. 1990).\n\nMany radical feminists maintain that women’s work is part of a\nseparate patriarchal mode of reproduction that underlies all economic\nsystems of production and in which men exploit women’s\nreproductive labor (Delphy 1984; O’Brien 1981; Leghorn and\nParker 1981; Rich 1980; Mies 1986). Smith (1974), O’Brien\n(1981), Hartsock (1983 a,b), Haraway (1985) and Harding (1986)\npioneered in combining this radical feminist assumption with a\nperspectival Marxist theory of knowledge to argue that one’s\nrelation to the work of production and reproduction gave each gender\nand each social class a different way of knowing the social totality.\nWomen’s work, they argued, ties them to nature and human needs\nin a different way than men’s work does, which creates the\npossibility of a less alienated and more comprehensive understanding\nof the workings of the social totality. Patricia Hill Collins argues\nfurther that the racial division of labor, institutional racism and\ndifferent family structures put African American women in yet a\ndifferent epistemic relation to society than white and other women\n(2000). Writing in a post-modernist re-articulation of this feminist\nstandpoint theory, Donna Haraway argues that the breakdown of the\nnature/culture distinction because of scientific technology and its\nalteration of the human body makes us into “cyborgs”.\nHence our perspectives are so intersectional that they cannot be\nunified simply by a common relation to work. What is required for a\nfeminist politics is not a situated identity politics, whether of\ngender and/or race and/or class, but an affinity politics based on\nalliances and coalitions that combine epistemic perspectives (Haraway\n1985).\n\nLike these radical feminists, some socialist-feminists have tried to\ndevelop a “dual systems” theory (cf. Young 1981). This\ninvolves theorizing a separate system of work relations that organizes\nand directs human sexuality, nurturance, affection and biological\nreproduction. Rather than seeing this as an unchanging universal base\nfor patriarchy, however, they have argued that this system, thought of\nas the “sex/gender system” (Rubin 1975; Hartmann 1978,\n1981a,b), or as “sex/affective production” (Ferguson 1989,\n1991; Ferguson and Folbre 1981) has different historical modes, just\nas Marx argued that economies do. Rubin argues that sex/gender systems\nhave been based in different kinship arrangements, most of which have\nsupported the exchange of women by men in marriage, and hence have\nsupported male domination and compulsory heterosexuality. She is\nhopeful that since capitalism shifted the organization of the economy\nfrom kinship to commodity production, the power of fathers and\nhusbands over daughters and wives, and the ability to enforce\nheterosexuality, will continue to decline, and women’s\nincreasing ability to be economically independent will lead to\nwomen’s liberation and equality with men.\n\nWith a different historical twist, Hartmann argues that a historical\nbargain was cemented between capitalist and working class male\npatriarchs to shore up patriarchal privileges that were being weakened\nby the entrance of women into wage labor in the 19th\ncentury by the creation of the “family wage” to allow men\nsufficient wages to support a non-wage-earning wife and children at\nhome (1981a). While Ferguson and Folbre (1981) agree that there is no\ninevitable fit between capitalism and patriarchy, they argue that\nthere are conflicts, and that the family wage bargain has broken down\nat present. Indeed, both Ferguson and Smart (1984) argue that welfare\nstate capitalism and the persistent sexual division of wage labor in\nwhich work coded as women’s is paid less than men’s with\nless job security are ways that a “public patriarchy” has\nreplaced different systems of family patriarchy that were operating in\nearly and pre-capitalist societies. Walby (1990) has a similar\nanalysis, but to her the connection between forms of capitalism and\nforms of patriarchy is more functional and less accidental than it\nappears to Ferguson and Smart.\n\nWalby argues that there are two different basic forms of patriarchy\nwhich emerge in response to the tensions between capitalist economies\nand patriarchal household economies: private and public patriarchy.\nPrivate patriarchy as a form is marked by excluding women from\neconomic and political power while public patriarchy works by\nsegregating women. There is a semi-automatic re-adjustment of the dual\nsystems when the older private father patriarchy based on the\npatriarchal family is broken down due to the pressures of early\nindustrial capitalism. The family wage and women’s second class\ncitizenship that marked that initial re-adjustment are then\nfunctionally replaced by a public form of patriarchy, the patriarchal\nwelfare state, where women enter the wage labor force permanently but\nin segregated less well paid jobs. But Ferguson (1989,1991), Smart\n(1984) and Folbre (1994) suggest that although the patriarchal control\nof fathers and husbands over wife and children as economic assets has\nbeen diminished in advanced capitalism, there is always a dialectical\nand contradictory tension between patriarchy and capitalism in which\nboth advances and retreats for women’s equality as citizens and\nin work relations are constantly occurring in the new form of public\npatriarchy. Thus, the new “marriage” of patriarchal\ncapitalism operates to relegate women to unpaid or lesser paid caring\nlabor, whether in the household or in wage labor, thus keeping women\nby and large unequal to men. This is especially notable in the rise of\npoor single-mother-headed families. However, as it forces more and\nmore women into wage labor, women are given opportunities for some\nindependence from men and the possibility to challenge male dominance\nand sex segregation in all spheres of social life. Examples are the\nrise of the first and second wave women’s movements and\nconsequent gains in civil rights for women.\n\nThe work of feminist sociologist Dorothy Smith (1989) has been a\nnotable intervention into the public-private split by bringing into\nview the institutions and power regimes that regulate the everyday\nworld, their gender subtext, and basis in a gendered division of\nlabor. Legal feminist critics expand on the biopolitics of the\npatriarchal welfare state, which psychiatrizes as it threatens mothers\nwith the loss of child custody. This represents a new eugenics twist\non the enduring mistrust of working-class mothers and casting those\nwho are imprisoned as undeserving parent (Guggenheim 2007; Law 2012).\nAfrican American mothers bear the brunt of punitive and racist family\nand criminal law (Roberts 2022; Thompson 2010; Solinger et\nal. 2010).\n6. Psychological Theories of Women and Work\n\nThe socialist-feminist idea that there are two interlocking systems\nthat structure gender and the economy, and thus are jointly\nresponsible for male domination, has been developed in a psychological\ndirection by the psychoanalytic school of feminist theorists.\nParticularly relevant to the question of women and work are the\ntheories of Mitchell (1972, 1974), Kuhn and Wolpe (1978), Chodorow\n(1978, 1979, 1982) and Ruddick (1989). Mothering, or, taking care of\nbabies and small children, as a type of work done overwhelmingly by\nwomen, socializes women and men to have different identities,\npersonalities and skills. In her first work (1972), Mitchell argues\nthat women’s different relations to productive work,\nreproduction, socialization of children and sexuality in patriarchy\ngive her lesser economic and psychological power in relation to men.\nIn a Freudian vein, Mitchell later argues (1974) that women learn that\nthey are not full symbolic subjects because compulsory heterosexuality\nand the incest taboo bar them from meeting either the desire of their\nmother or any other woman. Chodorow, also reading Freud from a\nfeminist perspective, suggests that women’s predominance in\nmothering work is the basis for the learned gender distinction between\nwomen and men. The sexual division of infant care gives boys, who must\nlearn their masculine identity by separating from their mother and the\nfeminine, a motive for deprecating, as well as dominating, women.\nRuddick from a more Aristotelian perspective suggests that it is the\nskills and virtues required in the practice of mothering work which\nnot only socially construct feminine gender differently from\nmen’s, but could ground an alternative vision for peace and\nresolving human conflicts, if a peace movement were led by women.\n\nFerguson argues that the “sex/affective” work of mothering\nand wifely nurturing is exploitative of women: women give more\nnurturance and satisfaction (including sexual satisfaction) to men and\nchildren than they receive, and do much more of the work of providing\nthese important human goods (cf. also Bartky 1990). The gendered\ndivision of labor has both economic and psychological consequences,\nsince women’s caring labor creates women less capable of or\nmotivated to separate from others, and hence less likely to protest\nsuch gender exploitation (Ferguson 1989, 1991). Folbre argues by\ncontrast that it is only because women’s bargaining power is\nless than men’s because of the power relations involved in the\ngender division of labor and property that women acquiesce to such\ninequalities (Folbre 1982). Ferguson argues that gendered exploitation\nin a system of meeting human needs suggests that women can be seen as\na “sex class” (or gender class) which cuts across economic\nclass lines (1979, 1989, 1991). This line of thought is also developed\nby Christine Delphy (1984), Monique Wittig (1980) and Luce Irigaray\n(1975).\n\nOn the other side of the debate, Brenner (2000) argues that women are\nnot uniformly exploited by men across economic class lines: indeed,\nfor working class women their unpaid work as housewives serves the\nworking class as a whole, because the whole class benefits when its\ndaily and future reproduction needs are met by women’s nurturing\nand childcare work. They argue further that middle and upper class\nwomen’s economic privileges will inevitably lead them to betray\nworking class women in any cross-class alliance that is not explicitly\nanti-capitalist. Hochschild (2000) and hooks (2000) point out that\ncareer women tend to pay working class women to do the second shift\nwork in the home so they can avoid that extra work, and they have an\ninterest in keeping such wages, e.g., for house cleaning and nannies,\nas low as possible to keep the surplus for themselves. Kollias (1981)\nargues further that working class women are in a stronger political\nposition to work effectively for women’s liberation than middle\nclass women, while McKenny (1981) argues that professional women have\nto overcome myths of professionalism that keep them feeling superior\nto working class women and hence unable to learn from or work with\nthem for social change.\n7. Ethical Theories of Women’s Caring Work\n\nSeveral authors have explored the ethical implications of the sexual\ndivision of labor in which it is primarily women who do caring labor.\nNancy Fraser (1997) and Susan Moller Okin (1989) formulate ethical\narguments to maintain that a just model of society would have to\nre-structure work relations so that the unpaid and underpaid caring\nlabor now done primarily by women would be given a status equivalent\nto (other) wage labor by various means. In her council socialist\nvision, Ferguson (1989, 1991) argues that an ideal society would\nrequire both women and men to do the hitherto private unpaid work of\ncaring or “sex/affective labor.” For example, such work\nwould be shared by men, either in the family and/or provided by the\nstate where appropriate (as for elders and children’s\nchildcare), and compensated fairly by family allowances (for those,\nwomen or men, doing the major share of housework), and by higher pay\nfor caring wage work (such as daycare workers, nurses, and\nteachers).\n\nCarol Gilligan (1982) claims that women and girls tend to use a\ndifferent form of ethical reasoning — she terms this the\n“ethics of care” — than men and boys who use an\nethics of justice. Some have argued that this different ethical\napproach is due to women’s caring sensibilities that have been\ndeveloped by the sexual division of labor (Ruddick 1989).\nInterestingly, the debate between feminist theorists of justice, e.g.,\nFraser and Okin, and ethics of care feminists such as Gilligan and\nRuddick, is less about substance than a meta-ethical dispute as to\nwhether ethics should concern principles or judgments in particular\ncases. All of these theorists seem to have ideal visions of society\nwhich dovetail: all would support the elimination of the sexual\ndivision of labor so that both men and women could become equally\nsensitized to particular others through caring work.\n\nAsha Bhandary (2020) proposes an integrative approach, enlargening the\nRawlsian distributive justice theory with liberal dependency care.\nTaking into account Eva Feder Kittay’s (2019, 1998) emphasis on\nhuman dependency, Bhandary argues that Rawls’s framework must be\nexpanded to include caring considerations as part of the basic\nstructure of society. To address feminist critiques, she adds that\nboys must be taught the value of care work and voluntary participation\nin it. Bhandary develops an arrow of care map to account for\ndistributive inequalities (race, class, etc.) within countries and\ncross-culturally. In Meaningful Work, Andrea Veltman (2016)\nalso provides a liberal normative account of care, endorsing Paul\nGomberg’s (2007) concept of contributive justice, where each\ncommunity and family member pulls together voluntarily using a system\nof job rotation, rather than relying on state provisions of goods.\n\nBy contrast, the authors of the Care Manifesto (Chatzidakis\net al., 2020) build on political theorists who call for a\ncentering of care and a decentering of economics (Tronto 2013; 1993)\nand a universal care giver model (Fraser, 2013) in democratic\nsocieties. Caring work is not only important at the level of\ninterpersonal care but also at the macroscopic level of “theorising\ncaring infrastructures and the nature of an overarching politics of\ncare” grounded in “feminist, queer, anti-racist and eco-socialist\nperspective” (Chatzidakis et al., p. 22). Such perspective\nalso critiques the exploitative nature of transnational care chains\nwhere Global North upper class women exploit the labor of women and\ngirls from the Global South (Anderson, 2000). Reproductive labor has\nalso become transactional and exploitative in another sense: surrogacy\narrangements in the global biomarkets, where Indian women carry babies\nand are contractually required to give up the newborn on terms dictated\nby Global North couples, which may include selective abortion during\npregnancy (Saravanah, 2018). By centering care in the commons, these\ntheorists call attention to a politics of interdependence.\n8. Modernist vs. Postmodernist Feminist Theory\n\nUseful anthologies of the first stage of second wave socialist\nfeminist writings which include discussions of women, class and work\nfrom psychological as well as sociological and economic perspectives\nare Eisenstein (1979), Hansen and Philipson (1990), Hennessy and\nIngraham (1997), and Holmstrom (2002). Jaggar (1983) wrote perhaps the\nfirst philosophy text explaining the categories of liberal, radical,\nMarxist and socialist-feminist thought and defending a\nsocialist-feminist theory of male domination based on the notion of\nwomen’s alienated labor. Others such as Jaggar and Rothenberg\n(1978), Tuana and Tong (1995) and Herrmann and Stewart (1993) include\nclassic socialist feminist analyses in their collections, inviting\ncomparisons of the authors to others grouped under the categories of\nliberal, radical, psychoanalytic, Marxist, postmodern, postcolonial\nand multicultural feminisms.\n\nVarious post-modern critiques of these earlier feminist schools of\nthought such as post-colonialism as well as deconstruction and\npost-structuralism challenge the over-generalizations and economic\nreductionism of many of those constructing feminist theories that fall\nunder the early categories of liberal, radical, Marxist or socialist\nfeminism (cf. Grewal and Kaplan 1992; Kaplan et al. 1999;\nNicholson 1991; Fraser and Nicholson 1991; hooks 1984, 2000;\nAnzaldúa and Moraga 1981; Sandoval 2000). Others argue that\npart of the problem is the master narratives of liberalism or Marxism,\nthe first of which sees all domination relations due to traditional\nhierarchies and undermined by capitalism, thus ignoring the\nindependent effectivity of racism (Joseph 1981); and the second of\nwhich ties all domination relations to the structure of contemporary\ncapitalism and ignores the non-capitalist economics contexts in which\nmany women work, even within so-called capitalist economies, such as\nhousework and voluntary community work (Gibson-Graham 1996).\n\nIn spite of the “pomo” critiques, there are some powerful\nthinkers within this tendency who have not completely rejected a more\ngeneral starting point of analysis based on women, class and work. For\nexample, Spivak (1988), Mohanty (1997), Carby (1997), and Hennessy\n(1993, 2000) are creating and re-articulating forms of Marxist and\nsocialist-feminism less susceptible to charges of over-generalization\nand reductionism, and more compatible with close contextual analysis\nof the power relations of gender and class as they relate to work.\nThey can be grouped loosely with a tendency called materialist\nfeminism that incorporates some of the methods of deconstruction and\npost-structuralism (Hennessy 1993; Landry and MacLean 1993).\n9. Race, Class, and Intersectional Feminist Analyses\n\nMany in the contemporary feminist theory debate are interested in\ndeveloping concrete “intersectional” or “integrative\nfeminist” analyses of particular issues which try to give equal\nweight to gender, race, class and sexuality in a global context\nwithout defining themselves by the categories, such as liberal,\nradical or materialist, of the earlier feminist debate categories (cf.\nwork by Davis 1983; Brewer 1995; Crenshaw 1997; Stanlie and James\n1997; Anzaldúa 1999; hooks 1984, 2000). Nonetheless strong\nemphasis on issues of race and ethnicity can be found in their work on\nwomen, class and work. For example, Brewer shows that white and\nAfrican-American working class women are divided by race in the\nworkforce, and that even changes in the occupational structure\nhistorically tend to maintain this racial division of labor. Hooks\nargues that women of color and some radical feminists were more\nsensitive to class and race issues than those, primarily white,\nfeminists whom she labels “reformist feminists” (hooks\n2000).\n\nPresupposed in the general theoretical debates concerning the\nrelations between gender, social and economic class, and work are\nusually definitions of each of these categories that some thinkers\nwould argue are problematic. For example, Tokarczyk and Fay have an\nexcellent anthology on working class women in the academy (1993) in\nwhich various contributors discuss the ambiguous positions in which\nthey find themselves by coming from poor family backgrounds and\nbecoming academics. One problem is whether they are still members of\nthe working class in so doing, and if not, whether they are betraying\ntheir families of origin by a rise to middle class status. Another is,\nwhether they have the same status in the academy, as workers, thinkers\nand women, as those men or women whose families of origin were middle\nclass or above. Rita Mae Brown wrote an early article on this, arguing\nthat education and academic status did not automatically change a\nworking class woman’s identity, which is based not just on\none’s relation to production, but one’s behavior, basic\nassumptions about life, and experiences in childhood (Brown 1974).\nJoanna Kadi (1999) describes herself as cultural worker who tackles\nelitism in the white academy, including in women’s studies\ncourses. Tokarczyk and Fay acknowledge that the definition of\n“class” is vague in the U.S. Rather than provide a\nstandard philosophical definition in terms of necessary and sufficient\nconditions for membership in the working class, they provide a cluster\nof characteristics and examples of jobs, such as physically demanding,\nrepetitive and dangerous jobs, jobs that lack autonomy and are\ngenerally paid badly. Examples of working class jobs they give are\ncleaning women, waitresses, lumberjacks, janitors and police officers.\nThey then define their term “working class women\nacademics” to include women whose parents had jobs such as these\nand are in the first generation in their family to attend college\n(Tokarczyk and Fay, 5). They challenge those that would argue that\nfamily origin can be overcome by the present position one has in the\nsocial division of labor: simply performing a professional job and\nearning a salary does not eradicate the class identity formed in\none’s “family class” (cf. Ferguson 1979).\n\nMore recent work in socio-legal studies also has begun to question the\nlimits of intersectional analysis (Grabham et al. 2009). It\nacknowledges the importance of intersectionality, a term coined by law\nprofessor Kimberlé Crenshaw (1989) to shed light on epistemic\ninjustice done to Black women in anti-discrimination law. Yet, despite\nits merit for overcoming the dual system’s theoretical impasse,\nJoanna Conaghan also critiques the essentializing tendencies of\nintersectional analysis which succeeds mainly dealing with race and\ngender oppression at an individual level, but it has little to offer\nto remedy structural injustice. Furthermore, because such method is\nidentity-focused it will not get at the dimension of class which has\nbeen traditionally thought in relational not locational terms (2008,\n29–30).\n\nTo theorize the problematic relation of women to social class,\nFerguson (1979, 1989, 1991) argues that there are at least three\ndifferent variables — an individual’s work, family of\norigin, and present household economic unit — which relate an\nindividual to a specific socio-economic class. For example, a woman\nmay work on two levels: as a day care worker (working class), but also\nas a member of a household where she does the housework and\nmothering/child care, while her husband is a wealthy contractor (petit\nbourgeois, small capitalist class). If in addition her family of\norigin is professional middle class (because, say, her parents were\ncollege educated academics), the woman may be seen and see herself as\neither working class or middle class, depending on whether she and\nothers emphasize her present relations of wage work (her individual\neconomic class, which in this case is working class), her household\nincome (middle class) or her family of origin (middle class).\n\nSylvia Walby deals with this ambiguity of economic class as applying\nto women as unpaid houseworkers by claiming against Delphy (1984) that\nthe relevant economic sex classes are those who are housewives vs.\nthose who are husbands benefiting from such work, not those of\nall women and men, whether or not they do or receive\nhousework services (Walby 1990). Ferguson, however, sides with Delphy\nin putting all women into “sex class”, since all women,\nsince trained into the gender roles of patriarchal wife and\nmotherhood, are potentially those whose unpaid housework can be so\nexploited. But seeing herself as a member of a fourth class category,\n“sex class,” and hence, in a patriarchal capitalist\nsystem, seeing herself exploited as a woman worker in her wage work\nand unpaid second shift housework,\n [4]\n is thus not a given but an achieved social identity. Such an identity\nis usually formed through political organizing and coalitions with\nother women at her place of employment, in her home and her community.\nIn this sense the concept of sex class is exactly analogous to the\nconcept of a feminist epistemological standpoint: not a given identity\nor perspective, but one that is achievable under the right\nconditions.\n\nRealizing the importance of this disjuncture between economic class\nand sex class for women, Maxine Molyneux (1984) argues in a often\ncited article that there are no “women’s interests”\nin the abstract that can unify women in political struggle. Instead,\nshe theorizes that women have both “practical gender\ninterests” and “strategic gender interests.”\nPractical gender interests are those that women develop because of the\nsexual division of labor, which makes them responsible for the\nnurturant work of sustaining the physical and psychological well-being\nof children, partners and relatives through caring labor. Such\npractical gender interests, because they tie a woman’s\nconception of her own interests as a woman to those of her family,\nsupport women’s popular movements for food, water, child and\nhealth care, even defense against state violence, which ally them with\nthe economic class interests of their family. Strategic gender\ninterests, on the contrary, may ally women across otherwise divided\neconomic class interests, since they are those, like rights against\nphysical male violence and reproductive rights, which women have as a\nsex class to eliminate male domination.\n\nMolyneux used her distinctions between practical and strategic gender\ninterests to distinguish between the popular women’s movement in\nNicaragua based on demands for economic justice for workers and\nfarmers against the owning classes, demands such as education, health\nand maternity care, clean water, food and housing, and the feminist\nmovement which emphasized the fight for legal abortion, fathers’\nobligation to pay child support to single mothers, and rights against\nrape and domestic violence. She and others have used this distinction\nbetween practical and strategic gender interests to characterize the\ntension between popular women’s movements and feminist movements\nin Latin America (Molyneux 2001; Alvarez 1998; Foweraker 1998).\n\nA similar distinction between different types of women’s\ninterests was developed further as a critique of interest group\nparadigms of politics by Anna Jónasdóttir (1988, 1994).\nJónasdóttir argues that women have a common formal\ninterest in votes for women, women’s political caucuses, gender\nparity demands, and other mechanisms which allow women a way to\ndevelop a collective political voice, even though their content\ninterests, that is, their specific needs and priorities, may vary by\nrace and economic class, among others. Her distinctions, and those of\nMolyneux, have been changed slightly — practical vs. strategic\ngender needs, rather than interests — to compare and contrast\ndifferent paradigms of economic development by World Bank feminist\ntheorist Carolyn Moser (1993). Most recently the\nJónasdóttir distinctions have been used by Mohanty\n(1997) to defend and maintain, in spite of postmodernists’\nemphasis on intersectional differences, that commonalities in\nwomen’s gendered work can create a cross-class base for\ndemanding a collective political voice for women: a transnational\nfeminism which creates a demand for women’s political\nrepresentation, developing the platform of women’s human rights\nas women and as workers. Nonetheless, the tension between\nwomen’s economic class-based interests or needs and their\nvisionary/strategic gender interests or needs is still always present,\nand must therefore always be negotiated concretely by popular\nmovements for social justice involving women’s issues.\n\nAnother approach to the problematic nature of socio-economic class as\nit relates to women are empirical studies which show how class\ndistinctions are still important for women in their daily lives as a\nway to compare and contrast themselves with other women and men, even\nif they do not use the concepts of “working class,”\n“professional class” or “capitalist class”.\nMany have pointed out that the concept of class itself is mystified in\nthe U.S. context, but that nonetheless class distinctions still\noperate because of different structural economic constraints, which\nact on some differently from others. The Ehrenreichs (1979), in a\nclassic article, argue that this mystification is due to the emergence\nof a professional-managerial class that has some interests in common\nwith the capitalist class and some with the working class. Whatever\nits causes, there are empirical studies which show that class\ndistinctions still operate between women, albeit in an indirect way.\nBarbara Ehrenreich (2001), by adopting the material life conditions of\na poor woman, did an empirical study of the lives of women working for\nminimum wages and found their issues to be quite different from and\nignored by middle and upper-class women. Diane Reay (2004) does an\nempirical study of women from manual labor family backgrounds and\ntheir relation to the schooling of their children, and discovers that\nthey use a discourse that acknowledges class differences of\neducational access and career possibilities, even though it does not\nspecifically define these by class per se. Similarly, Julie Bettie\n(2000) does an impressive discourse analysis of the way that Latina\nhigh school students create their own class distinctions through\nconcepts such as “chicas,” “cholas” and\n“trash” to refer to themselves and their peers. These\ncategories pick out girls as having middle class, working class or\npoor aspirations by performance indicators such as dress, speech,\nterritorial hang-outs and school achievement, while never mentioning\n“class” by name. Women’s experiences of growing up\nworking class are presented in the anthology edited by Tea (2003).\n\nDrawing on a socialist feminist framework, Margaret McLaren (2019)\noffers an ethnographic study of cross-border feminist solidarity. She\nfocuses on SEWA, the largest women’s union in the world with\nover 700,000 members and its own cooperative bank. This Indian\norganization of self-employed women has ties with a sister\norganization in South Africa and builds global grassroots trading\nnetworks in addition to fostering cross-cultural dialogues and\npeace-building. Utilizing traditional gendered expectations, married\nwomen leave the home to work in women-only groups where the artisans\norganize beyond the workplace for public health, sewage treatment and\nother social justice issues such as violence prevention. Such\ncooperatives which also forge ties with Global North consumers\nshowcase the possibilities for transnational feminist organizing in\nthe face of neoliberalist finance and resource extraction. \n10. Anarchist Perspectives on Work and its Other\n\nSo far, it has been assumed that work is an intrinsic good.\n\nWhat if waged or unwaged work itself were to be considered problematic\nor oppressive? Autonomous Marxists contest that liberal or socialist\nfeminist perspectives have unnecessarily mystified work and have\noperated with a moralism. Autonomists are associated with the\nOperaismo, post-Operaismo and Autonomia movements, the Midnight Notes\nCollective, Zerowork, Lotta Feminista, and the Wages for Housework\nmovement (Weeks 2011, 241). Whether one ought to be paid for housework\nor reproductive labor or seek equal employment opportunities,\nfeminists have not sufficiently opposed the sanctification of work.\nChampioning the refusal of work means to abandon a narrow focus on the\ncritique of the extraction of surplus value or of the process of\ndeskilling. Furthermore, it is imperative to interrogate how work\ndominates our lives (Weeks 2011, 13). Kathi Weeks charges that a\nproductivist bias is common to feminist and Marxist analysis. The\ncredo of autonomists then is liberation from work, in\ncontradistinction to Marxist humanists such as Erich Fromm’s\nadvocacy for liberation of work.\n\nThe Wages for Housework campaign demanded purposefully the impossible.\nThese feminists did not only ask for compensation for unpaid domestic\nlabor, but also postulated the end of such work (Federici 1975).\nPost-work also means post-domestic care, something that gets lost in\nsome of the ethic of care analysis, which inadvertently fosters a\nromantic attachment to endowing meaning to such work. Furthermore,\npost-work also appeals to carving out space for “queer\ntime” and queer resistant agency (Halberstam 2005, Lehr 1999),\nan appeal to unscripted life. A wholesale critique of housework is not\neasily understood; even Arlie Hochschild’s (1997) own analysis\nof her ethnographic studies of diverse family practices comes to the\nconclusion that authentic housework should be sanctified and set apart\nfrom mere alienating factory production (Weeks 2011,\n157–59).\n\nA post-work ethic entails a playful commitment to leisure and\nunstructured activities such as day-dreaming. Joseph Trullinger (2016)\nextends Kathi Weeks’ analysis by drawing on Marcuse’s\nconcept of great refusal and playful labor defying commodity fetishism\nand productivism. By ignoring the liberatory power of play, Weeks\ninsufficiently engages the meaning of work and the asceticism of the\nwork ethic (Trullinger 2016, 469). Still, the danger of play morphing\ninto (unpaid) labor is real, as evinced by social media corporate\ngiant FaceBook exploiting play-labor for capitalist gains (Fuchs 2016)\nand a corporate feminism may ask us to “lean in” (Sandberg\n2013) rather than “lean out.”\n11. Punitive Perspectives on Work and Non-Work\n\nWhile it is reasonable to champion daydreams and play as intrinsic\ngoods, idle time itself is often not felt as a good or luxury, but\ninstead a psychic imposition. This is why one speaks of “doing\ntime,” when one is sentenced to a prison term or worse, to death\nrow (Moses 2007). Imprisonment is anathema to Indigenous,\nsocio-centric peoples in the Global South, and imprisonment is closely\nconnected to the disciplinary apparatus of western colonization of the\nAmericas and Africa (Nagel 2007). The birth of the western modern\nprison focused on self-discipline, known as the “separate\nsystem” of Philadelphia, PA, leading to enforced isolation and\nseparate celling. Day-dreaming in a solitary cell becomes positively\ndangerous and suicides and mental illness increase exponentially\n(Casella et al. 2016). Idle time is thus countered by another\nprison regime, the Auburn, NY, factory system, also known as the\n“silent system,” where prisoners worked in a factory, but\nthey were forbidden to talk with each other. Under the notorious\nSouthern U.S. convict lease system, representing the shift “from\nthe prison of slavery to the slavery of prisons” (Davis 1998),\nBlack female and male prisoners were toiling in chain gangs, a\nvisceral legacy of chattel slavery. Slavery or indentured servitude is\ncodified in the U.S. Constitution, turning the nation-state into a\npenal democracy (James, 2007). \n\nAnother haunting reminder of chattel slavery is the neoliberal welfare\nstate’s intrusion in the family, charging parents with poor work\nethic and neglect of their children. In the US, poor children of\ncolor, especially Black, Latine, and American Indians living on\nreservations, are at higher risk of being taken away from their kin\nand carers and turned over to the family regulation system (Goldberg\n2015). The world over, parents who are socially displaced such as\nRomanian immigrants in Norway, are under greater scrutiny by state\nactors, e.g., child protective services. In the U.S., social\nworkers’ own white middle class (protestant) work ideology is\nenforced paradoxically on working-class mothers: these stigmatized\nwomen are summoned to comply with social programming, a penal version\nof the cult of domesticity and are thus effectively forced out of a\npaid job, made dependent on the good will of the social worker and\nfamily court judge, who may grant access to child-supervised visits.\nParents charged with child abuse and/or neglect are thus unable to\npursue education or a job, often creating an intergenerational cycle\nof the violence of poverty (Nagel 2018). In ideological terms, this is\ncoded as welfare dependency and racialized as a controlling image,\nthus stereotyping young Black mothers (Fraser and Gordon 1994; Hill\nCollins 2000). In response, the National Welfare Rights Organization\nwas created to destigmatize welfare by postulating it as a human right\n(Toney 2000) and by also demanding a basic income, as alternative to\npunitive welfare (Weeks 2011, 138). The proposal for universal basic\nincome has gained traction in recent years (Chatzidakis et\nal. 2020). Migrant workers, worker-mothers who serve as domestic\nworkers are also at risk (of deportation and/or imprisonment) for\nfacing frivolous neglect charges or simply for lacking proper visa\nstatus. Gendered moral economies operate across national, racial and\ngeographic borders in enforcing a domestic and domesticating\npatriarchal ideology and determining who is a good victim and deserves\nto be rescued (Keogh 2015; Nagel 2013; Gutiérrez\nRodríguez 2010; Grewal and Kaplan 1992; Kaplan et al.\n1999).\n\nStigmatized work such as erotic labor or sex work has divided\nfeminists into two camps: those who support sex workers’ rights\nto organize and seek labor law protection and carceral feminists who\nadvocate “rescuing” women trafficked into sex work\n(Bernstein 2007; Nagel 2015). Some sex worker rights approaches focus\non eschewing the moralizing rallying cry of choice versus coercion and\nseek to destigmatize such labor and offer a postcolonial critique of\nprohibitionist ideology (Kempadoo and Doezema 1995). Others also focus\non the lived experiences and agencies of such workers and\ncontextualize their lives within structural constraints of the\nfeminization of poverty (Dewey 2010; Zheng 2009). Paradoxically, by\nfocusing narrowly on income-generating activities, Dewey (2010)\ncontents that such advocates actually reinscribe stigmatization. And\nsome sex workers’ rights organizations such as COYOTE\n(“Call Off Your Old Tired Ethics”) also inadvertently\nendorse a traditional work-ethic ideology by appealing to a moralizing\ndiscourse of respectability (Weeks 2011, pp. 67–68).\n12. Concluding Remarks\n\nTheoretical and empirical debates about the relation of women to class\nand work, and the implications of these relations for theories of male\ndomination and women’s oppression as well as for other systems\nof social domination, continue to be important sources of theories and\ninvestigations of gender identities, roles and powers in the field of\nwomen and gender studies, as well as in history, sociology,\nanthropology and economics. They also have important implications for\nepistemology, metaphysics and political theory in the discipline of\nphilosophy, and consequently other disciplines in humanities and the\nsocial sciences.\n", "bibliography": {"categories": [], "cat_ref_text": {"ref_list": ["Addams, Jane, 1914, “Women and Public Housekeeping,”\nin <em>Women and Public Life</em>, in James P. Lichtenberger (ed.),\n<em>Annuals of the American Academy of Political and Social Science,\nv. 56</em>.", "Alvarez, Sonia, 1998, “Latin American Feminisms ‘Go\nGlobal’: Trends of the 1990s and Challenges for the New\nMillennium,” in S. Alvarez, E. Dagnin and A. Escobar (eds.),\n<em>Cultures of Politics/Politics of Cultures: Revisioning Latin\nAmerican Social Movements</em>, Boulder Co: Westview, pp.\n93–115.", "Amott, Teresa and Julie Matthaei, 1991, <em>Race, Gender and Work:\nA Multicultural Economic History of Women in the United States</em>,\nBoston: South End Press.", "Anderson, Bridget, 2000, <em>Doing the Dirty Work? The Global\nPolitics of Domestic Labour</em>, London: Zed. ", "Anzaldúa, Gloria, 1999, <em>Borderlands/La Frontera</em>,\nSan Francisco: Aunt Lute Press.", "Anzaldúa, Gloria and Cherrie Moraga (eds.), 1981, <em>This\nBridge Called My Back: Writings by Radical Women of Color</em>,\nWatertown MA: Persephone Press.", "Barrett, Michele, 1980, <em>Women’s Oppression Today:\nProblems in Marxist Feminist Analysis</em>, London: Verso.", "Bartky, Sandra, 1990, <em>Femininity and Domination: Studies in\nthe Phenomenology of Oppression</em>, New York: Routledge.", "Beauvoir, Simone De, 1978, <em>The Second Sex</em>, tr. &amp; ed.\nby. HM Parsley, New York: Knopf.", "Beecher, Catherine, [1841] 1970, <em>A Treatise on Domestic\nEconomy</em>, New York: Source Book Press.", "Beneria, Lourdes, 2003, <em>Gender, Development, and\nGlobalization: Economics As If All People Mattered</em>, London:\nRoutledge.", "Benston, Margaret, 1969, “The Political Economy of\nWomen’s Liberation,” <em>Monthly Review</em>, 21 (4),\nSeptember.", "Bernstein, Elizabeth, 2007, “The Sexual Politics of the\n‘New Abolitionism’,” <em>Differences</em>, 18(5):\n128–151.", "Bettie, Julie, 2000, “Women without Class: <em>Chicas,\nCholas</em>, Trash and the Presence/Absence of Class Identity,”\n<em>Signs: Journal of Women in Culture and Society</em>, 6(1):\n1–35.", "Brenner, Johanna, 2000, <em>Women and the Politics of Class</em>,\nNew York: Monthly Review.", "Brewer, Rose, 1993,“Theorizing Race, Class and\nGender,” in Stanlie James and Abena Busia, pp. 13–30.", "Brown, Rita Mae, 1974, “The Last Straw”, in Bunch and\nMyron 1974, pp. 13–23.", "Bunch, Charlotte and Nancy Myron (eds.), 1974, <em>Class and\nFeminism</em>, Baltimore: Diana Press.", "Capella, Jean, James Ridgeway, and Sarah Shourd, 2016, <em>Hell is\na Very Small Place: Voices from Solitary Confinement</em>. New York:\nThe New Press.", "Carby, Hazel, 1997, “White Woman Listen!!” in Hennessy\nand Ingraham (eds.), pp. 110–128.", "Chatzidakis, Andrea, <em>et al</em>., 2020, <em>The Care\nManifesto: The Politics of Interdependence</em>, London: Verso.", "Chen, Martha, <em>et al</em>., 2005, <em>Progress of the\nWorld’s Women: Women, Work, and Poverty</em>, New York:\nUNIFEM.", "Chodorow, Nancy, 1978, <em>The Reproduction of Mothering</em>,\nBerkeley: University of California.", "–––, 1979, “Mothering, Male Dominance, and\nCapitalism,” in Zillah Eisenstein (ed.), <em>Capitalist\nPatriarchy and the Case for Socialist Feminism</em>, New York: Monthly\nReview Press, pp. 83–106.", "–––, 1989, “Toward a Relational\nIndividualism,” in <em>Feminism and Psychoanalytic Theory</em>,\nLondon: Polity Press, pp. 154–162.", "Cliff, Tony, 1984, <em>Class Struggle and Women’s\nLiberation</em>, London: Blackwell.", "Conaghan, Joanna, 2009, “Intersectionality and the Feminist\nProject in Law,” in Graham <em>et al</em>. (eds.),\n21–48.", "Crenshaw, Kimberlé, 1989, “Demarginalizing the\nIntersection between Race and Sex: A Black Feminist Critique of\nAnti-Discrimination Doctrine, Feminist Theory and Anti-Racist\nPolitics,” <em>University of Chicago Legal Forum</em>:\n139–67.", "–––, 1992, “Whose Story is it Anyway?\nFeminist and Anti-racist Appropriations of Anita Hill”, in Toni\nMorrison (ed.), <em>Race-ing Justice, Engendering Power</em>, New\nYork: Pantheon, pp. 402–41.", "Dalla Costa, Maria, 1974, <em>The Power of Women and the\nSubversion of the Community</em>, Bristol, England: Falling Wall\nPress.", "Davis, Angela Y., 1983, <em>Women, Race, and Class</em>, New York:\nVintage Press.", "–––, 1998, “From the Prison of Slavery to\nthe Slavery of Prisons: Frederick Douglass and the Convict Lease\nSystem,” in Joy A. James (ed.), <em>The Angela Y. Davis\nReader</em>, Malden, MA: Blackwell.", "Delphy, Christine, 1984, <em>Close to Home: A Materialist Analysis\nof Women’s Oppression</em>, Amherst, MA: University of\nMassachusetts.", "Dewey, Susan, 2010, <em>Neon Wasteland: On Love, Motherhood, and\nSex Work in a Rust Belt Town</em>, Berkeley: University of California\nPress.", "DiQuinzio, Patrice, 1999, <em>The Impossibility of Motherhood:\nFeminism, Individualism, and the Problem of Mothering</em>, New York:\nRoutledge.", "Eddy, Pamela L. and Kelly Ward, 2015, “Lean In or Opt Out:\nCareer Paths of Academic Women,” <em>Change: The Magazine of\nHigher Learning</em>, 47(2): 6–13.", "Ehrenreich, Barbara and John Ehrenreich, 1979, “The\nProfessional-Managerial Class,” in Walker (ed.) 1979, pp.\n5–49.", "Ehrenreich, Barbara and Arlie Hochschild (eds.), 2004, <em>Global\nWoman: Nannies, Maids, and Sex Workers in the New Economy</em>, New\nYork: Holt.", "–––, 2001, <em>Nickled and Dimed: On (Not)\nGetting By in America</em>, New York: Metropolitan Books.", "Eisenstein, Zillah (ed.), 1979, <em>Capitalist Patriarchy and the\nCase for Socialist Feminism</em>, New York: Monthly Review.", "Engels, Friedrich, 1972, <em>The Origin of the Family, Private\nProperty and the State, in the light of the researches of Lewis H.\nMorgan</em>, New York: International Publishers [1942]", "Enloe, Cynthia, 2004, <em>The Curious Feminist: Searching for\nWomen in the New Age of Empire</em>, Berkeley: University of\nCalifornia Press.", "Federici, Silvia, 1975, “Wages Against Housework”, in\nMalos (ed.) 1975, pp. 187–194.", "–––, 2004, <em>Caliban and the Witch: Women, the\nBody and Primitive Accumulation</em>, Brooklyn, NY: Autonomedia.", "Ferguson, Ann, 1979, “Women as a New Revolutionary Class in\nthe US,” in Walker (ed.) 1979, pp. 279–309.", "–––, 1989, <em>Blood at the Root: Motherhood,\nSexuality and Male Domination</em>, New York: Pandora/Unwin and\nHyman.", "–––, 1991, <em>Sexual Democracy: Women,\nOppression and Revolution</em>, Boulder CO: Westview Press.", "–––, 1996, “Sex and Work”, in Kai\nNielson and Robert Ware (eds.), <em>Exploitation</em>, New York:\nHumanities Press, pp. 272–280.", "–––, 1998, “Feminism and Socialism”,\nin Alison Jaggar and Iris Young (eds.), <em>Blackwell’s\nCompanion to Feminist Philosophy</em>, Oxford: Blackwell, pp.\n520–529.", "–––, 2004. “A Feminist Analysis of the\nCare Crisis,” in Fina Birulés and Maria Isabel\nPeña Aguado (eds.), <em>La Passió per la Libertat/A\nPassion for Freedom</em>, The Proceedings of the International\nWomen’s Philosophy Association (IAPh) conference, October\n1–5, 2002, Barcelona, Spain: Universitat de Barcelona.", "Ferguson, Ann and Nancy Folbre, 1981, “The Unhappy Marriage\nof Capitalism and Patriarchy,” in Sargent 1981, pp.\n313–338.", "–––, 2000. “Women, Care and the Public\nGood: A Dialogue,” in Anatole Anton, Milton Fisk and Nancy\nHolmstrom (eds.), <em>Not for Sale: In Defense of Public Goods</em>,\nBoulder CO: Westview Press, pp. 95–108.", "Folbre, Nancy, 1982, “Exploitation Comes Home: A Critique of\nthe Marxian Theory of Family Labor,” <em>Cambridge Journal of\nEconomics</em>, 6(4): 317–29.", "–––, 1983, “Of Patriarchy Born: The\nPolitical Economy of Fertility Decisions,” <em>Feminist\nStudies</em>, 9(2): 261–84.", "–––, 1987, “Patriarchy as a Mode of\nProduction,” in Randy Albelda and C. Gunn (eds.), <em>New\nDirections in Political Economy</em>, New York: M.E. Sharpe.", "–––, 1993, “Socialism: Feminist or\nScientific?” in M. Ferber and Julie Nelson (eds.), <em>Beyond\nEconomic Man</em>, Chicago: University of Chicago Press.", "–––, 1994, <em>Who Pays for the Kids? Gender and\nthe Structures of Constraint</em>, New York: Routledge.", "–––, 2000, <em>The Invisible Heart: Economics\nand Family Values</em>, New York: The New Press.", "Foreman, Ann, 1977, <em>Femininity as Alienation: Women and the\nFamily in Marxism and Psychoanalysis</em>, London: Pluto.", "Foweraker, Joe, 1998, “Ten Theses on Women in the Political\nLife of Latin America,” in Victoria Rodriguez (ed.),\n<em>Women’s Participation in Mexican Political Life</em>,\nBoulder CO: Westview: 63–73.", "Fox, Bonnie (ed.), 1980, <em>Hidden in the Household:\nWomen’s Domestic Labour under Capitalism</em>, Toronto: The\nWomen’s Press.", "Fraser, Nancy, 1997, <em>Justice Interruptus: Critical Reflections\non the “Post-Socialist” Condition</em>, New York:\nRoutledge.", "–––, 2013, <em>Fortunes of Feminism: From\nState-Managed Capitalism to Neoliberal Crisis</em>, London:\nVerso.", "Fraser, Nancy and Linda Gordon, 1994. “A Genealogy of\nDependency: Tracing a Keyword of the U.S. Welfare State”,\n<em>Signs</em>, 19(2): 309–336.", "Fraser, Nancy and Linda Nicholson, 1991, “Social Criticism\nwithout Philosophy: An Encounter between Feminism and\nPostmodernism”, in Nicholson (ed.) 1991, pp. 19–38.", "Freeman, Carla, 1999, <em>High Tech and High Heels in the Global\nEconomy: Women, Work, and Pink-Collar Identities in the\nCaribbean</em>, Raleigh and Durham, NC: Duke University Press.", "Friedan, Betty, 1963, <em>The Feminine Mystique</em>, New York:\nNorton.", "Fuchs, Christian, 2016, “Herbert Marcuse and Social\nMedia”, <em>Radical Philosophy Review</em>, 19(1):\n111–141.", "George, Sheba, 2005, <em>When Women Come First</em>, Berkeley, CA:\nUniversity of California Press.", "Gibson-Graham, J.K., 1996, <em>The End of Capitalism (as we knew\nit)</em>, Cambridge MA: Blackwell Publishers.", "Gilligan, Carol, 1982, <em>In a Different Voice: Psychological\nTheory and Women’s Development</em>, Cambridge: Harvard\nUniversity.", "Gilman, Charlotte Perkins, 1898, <em>Women and Economics: A Study\nof the Economic Relation between Men and Women as a Factor in Social\nEvolution</em>, Boston: Small, Mayard and Co.", "–––, [1903] 1910, <em>The Home, Its Work and\nInfluence</em>, New York: Charlton Company", "–––, 1979, <em>Herland</em>, New York:\nPantheon.", "Goldberg, Michelle, 2015, “Has Child Protective Services\nGone Too Far?” <em>The Nation</em>, Sept. 30,\n <a href=\"https://lockerdome.com/thenation.com/8078031935782164\" target=\"other\">Goldberg 2015 available online</a>", "Goldman, Emma, 1969, <em>Anarchism and Other Essays</em>, New\nYork: Dover.", "Gomberg, Paul, 2007, <em>How to Make Opportunity Equal: Race and\nContributive Justice</em>, Malden, MA: Blackwell.", "Grabham, Emily, Davina Cooper, Jane Krishnadas, and Didi Herman\n(eds.), 2009. <em>Intersectionality and Beyond</em>, London:\nRoutledge-Cavandish.", "Grewal, Inderpal and Caren Kaplan, 1994, <em>Scattered Hegemonies:\nPostmodernity and Transnational Feminist Practices</em>, Minneapolis:\nUniversity of Minnesota Press.", "Guggenheim, Martin, <em>What’s Wrong with Children’s\nRights</em>, Cambridge: Harvard University Press.", "Gutiérrez Rodríguez, Encarnación, 2010,\n<em>Migration, Domestic Work and Affect</em>, New York:\nRoutledge.", "Halberstam, Judith, 2005, <em>In a Queer Time and Place:\nTransgender Bodies, Subcultural Lives</em>, New York: New York\nUniversity Press.", "Hansen, Karen V. and Ilene J. Philipson (eds.), 1990, <em>Women,\nClass and the Feminist Imagination: A Socialist-Feminist Reader</em>,\nPhiladelphia: Temple University.", "Haraway, Donna, 1985, “A Manifesto for Cybourgs: Science,\nTechnology and Socialist-Feminism in the 1980s”, <em>Socialist\nReview</em>, 15 (2): 65–107.", "Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca: Cornell University.", "Hartmann, Heidi, 1979, “Capitalism, Patriarchy and Job\nSegregation by Sex,” in Eisenstein (ed.), pp.\n206–247.", "–––, 1981a, “The Unhappy Marriage of\nMarxism and Feminism: Toward a More Progressive Union,” in\nSargent (ed.) 1981, pp. 1–42.", "–––, 1981b, “The Family as the Locus of\nGender, Class and Political Struggle: The Example of Housework,”\n<em>Signs</em>, 6(3): 366–394.", "Hartsock, Nancy, 1983a, “The Feminist Standpoint: Developing\nthe Ground for a Specifically Feminist Historical Materialism,”\nin Sandra Harding and Merle Hintikka (eds.), <em>Discovering Reality:\nFeminist Perspectives in Epistemology, Metaphysics and the Philosophy\nof Science</em>, Dordrecht, Holland: Reidel Publishers, pp.\n283–310.", "–––, 1983b, <em>Money, Sex and Power</em>, New\nYork: Longman.", "Hayden, Dolores, 1981, <em>The Grand Domestic Revolution: A\nHistory of Feminist Designs for American Homes, Neighborhoods and\nCities</em>, Cambridge MA: MIT Press.", "Hennessy, Rosemary, 2003, “Class,” in Mary Eagleton\n(ed.), <em>A Concise Companion to Feminist Theory</em>, Malden, MA:\nBlackwell.", "–––, 1993, <em>Materialist Feminism and the\nPolitics of Discourse</em>, New York: Routledge.", "–––, 2000, <em>Profit and Pleasure: Sexual\nIdentities in Late Capitalism</em>, New York: Routledge.", "Hennessy, Rosemary and Chrys Ingraham (eds.), 1997,\n<em>Materialist Feminism: A Reader in Class, Difference, and\nWomen’s Lives</em>, New York: Routledge.", "Herrmann, Anne C. and Abigail J. Stewart (eds.), 1994,\n“Theorizing Feminism: Parallel Trends in the Humanities and\nSocial Sciences”, Boulder: Westview Press.", "Hill Collins, Patricia, 1990, 2000, <em>Black Feminist\nThought</em>, 1<sup>st</sup> and 2<sup>nd</sup> editions, New York:\nRoutledge.", "Hochschild, Arlie, 1989, <em>The Second Shift: Working Parents and\nthe Revolution at Home</em>, New York: Penguin.", "–––, 1997, <em>The Time Bind: When Work Becomes\nHome and Home becomes Work</em>, New York: Metropolitan.", "–––, 2000, “Global Care Chains and\nEmotional Surplus Value,” in Will Hutton and Anthony Middens\n(eds.), <em>Global Capitalism</em>, New York: The New Press, pp.\n130–146.", "Holmstrom, Nancy (ed.), 2002, <em>The Socialist Feminist Project:\nA Contemporary Reader in Theory and Politics</em>, New York: Monthly\nReview.", "hooks, bell, 1984, <em>Feminist Theory from Margin to Center</em>,\nBoston: South End.", "–––, 2000, <em>Where We Stand:</em> <em>Class\nMatters</em>, New York: Routledge.", "Irigaray, Luce, 1985, <em>This Sex Which is not One</em>, tr.\nCatherine Porter, Ithaca NY: Cornell University, pp. 23–33.", "Jaggar, Alison, 1983, <em>Feminist Politics and Human Nature</em>,\nTotowa NJ: Rowman and Allenheld.", "Jaggar, Alison and Paula Rothenberg [Struhl] (eds.), 1978,\n<em>Feminist Frameworks: Alternative Theoretical Accounts of the\nRelations between Women and Men</em>, New York: McGraw Hill.", "James, Joy A., 2007, <em>Warfare in the American Homeland: Policing\nand Prison in a Penal Democracy</em>, Durham: Duke University\nPress.", "James, Stanlie and Abena Busia (eds.), 1993, <em>Theorizing Black\nFeminisms: The Visionary Pragmatism of Black Women</em>, New York:\nRoutledge.", "Jónasdóttir, Anna, 1988. “On the Concept of\nInterest, Women’s Interests and the Limitations of Interest\nTheory,” in Kathleen Jones and Anna Jónasdóttir.\n(eds.), <em>The Political Interests of Gender</em>, London: Sage.", "–––, 1994, <em>Why Women Are Oppressed</em>,\nPhiladelphia: Temple University Press.", "Jones, Bernie D. (ed.), 2012, <em>Women Who Opt Out: The Debate\nover Working Mothers and Work-Family Balance</em>, New York: New York\nUniversity Press.", "Joseph, Gloria, 1981, “The Incompatible Menage à\nTrois: Marxism, Feminism and Racism,” in Sargent (ed.), 1981,\npp. 91–108.", "Kadi, Joanna, 1999, <em>Thinking Class: Sketches from a Cultural\nWorker</em>, Boston: South End Press.", "Kaplan, Caren, Norma Alarcón and Minoo Moallen, 1999,\n<em>Between Woman and Nation: Nationalisms, Transnational Feminisms,\nand the State</em>, Durham, NC: Duke University Press.", "Kempadoo, Kamala and Jo Doezema, 1998, <em>Global Sex Workers:\nRights, Resistance and Redefinition</em>, New York: Routledge.", "Keogh, Leyla J., 2015, <em>Worker-Mothers on the Margins of\nEurope: Gender and Migration between Moldova and Istanbul</em>,\nBloomington, IN: Indiana University Press.", "Key, Ellen, 1909, <em>The Century of the Child</em>, New York:\nG.P. Putnam’s Sons.", "–––, 1914, <em>The Renaissance of\nMotherhood</em>, New York: G.P. Putnam’s Sons.", "Kittay, Eva Feder, 2019, <em>Learning from My Daughter: The Value\nand Care of Disabled Minds</em>, New York: Oxford University\nPress.", "–––, 1998, <em>Love’s Labor: Essays on\nWomen, Equality, and Dependency</em>, New York: Routledge.", "Kollias, Karen, 1975, “Class Realities: Create a New Power\nBase,” <em>Quest: a Feminist Quarterly</em>, 1 (3) (Winter\n1975), reprinted in Quest (eds.) 1981, <em>Building Feminist Theory:\nEssays from Quest</em>, New York: Longmans, pp. 125–138.", "Kuhn, Annette and AnnMarie Wolpe (eds.), 1978, <em>Feminism and\nMaterialism: Women and Modes of Production</em>, London: Routledge and\nKegan Paul Ltd.", "Landry, Donna and Gerald MacLean, 1993, <em>Materialist\nFeminisms</em>, Oxford: Blackwell Publishers.", "Law, Victoria, 2012, <em>Resistance behind Bars: Struggles of\nIncarcerated Women</em>, 2nd ed., Oakland: PM Press.", "Leacock, Eleanor, 1972, “Introduction,” in Engels\n1972.", "Leghorn, Lisa and Katherine Parker, 1981, <em>Woman’s Worth:\nSexual Economics and the World of Women</em>, London: Routledge and\nKegan Paul.", "Lehr, Valerie, 1999, <em>Queer Family Values: Debunking the Myth\nof the Nuclear Family</em>, Philadelphia: Temple University\nPress.", "Lerner, Gerda, 1986, <em>Women and History</em>, New York: Oxford\nUniversity Press.", "McKenney, Mary, 1981, “Class Attitudes and\nProfessionalism,” <em>Quest</em>: 139–148.", "Malos, Ellen (ed.), 1975, <em>The Politics of Housework</em>, New\nYork: The New Clarion Press.", "Marchand, Marianne, 1995, “Latin American Women Speak on\nDevelopment: Are We Listening Yet?”, in Marianne Marchand and\nJane Parapet (eds.), <em>Feminism/Postmodernism/Development</em>, New\nYork: Rutledge, pp. 56–72.", "Marx, Karl, [1844], <em>Economic and Philosophical\nManuscripts</em>, in Lewis S. Feuer (ed.), 1989. <em>Basic Writings on\nPolitics and Philosophy/Karl Marx, Friedrich Engels</em>, New York:\nAnchor Books.", "–––, [1850], 1970, <em>Introduction to the\nCritique of Political Economy</em>, trans. S.W. Ryazanskaya, ed.\nMaurice Dobb, New York: International Publishers.", "–––, 1906–09, <em>Capital: A Critique of\nPolitical Economy, vols. 1–3</em>, Chicago: C.H. Kerr and\nCompany.", "Marx, Karl and Friedrich Engels, 1848. <em>Manifesto of the\nCommunist Party</em>, authorized English translation edited and\nannotated by Friedrich Engels, New York: International.", "–––, [1850] 1970, <em>German Ideology</em>, Part\nI. New York: International.", "McLaren Margaret A., 2019, <em>Women’s Activism, Feminism,\nand Social Justice</em>, New York: Oxford University Press.", "McRobbie, Angela, 2002. <em>Feminism and Youth Culture</em>, 2nd\nedition, New York: Routledge.", "Mies, Maria, 1986, <em>Patriarchy and Accumulation on a World\nScale</em>, London: Zed.", "Mitchell, Juliet, 1972, <em>Women’s Estate</em>, New York:\nRandom House.", "–––, 1974, <em>Psychoanalysis and Feminism</em>,\nNew York: Pantheon.", "Mohanty, Chandra Talpade, 2003, <em>Feminism Without Borders:\nDecolonizing Theory, Practicing Solidarity</em>, Raleigh and Durham,\nNC: Duke University Press.", "–––, 1997, “Women Workers and Capitalist\nScripts: Ideologies of Domination, Common Interests and the Politics\nof Solidarity,” in M. Jacqui Alexander and Chandra Talpade\nMohanty (eds.), <em>Feminist Genealogies, Colonial Legacies,\nDemocratic Futures</em>, New York: Routledge, pp. 3–29.", "Molyneux, Maxine, 1985, “Mobilization without Emancipation?\nWomen’s Interests, State and Revolution,” <em>Feminist\nStudies</em>, 11(2): 227–254. Reprinted in Molyneux 2001:\n38–59.", "–––, 2001, <em>Women’s Movements in\nInternational Perspective</em>, New York: Palgrave.", "Moser, Caroline O. N., 1993, <em>Gender Planning and Development:\nTheory, Practice and Training</em>, New York: Routledge.", "Moses, Greg, 2007, “Time and Punishment in an Unesthetic\nWorld Order,” in Mechthild Nagel &amp; Seth N. Asumah (eds.),\n<em>Prisons and Punishment: Reconsidering Global Penality</em>,\nTrenton, NJ: Africa World Press, pp. 71–75.", "Nagel, Mechthild, 2007, “Gender, Incarcerating and\nPeacemaking: Lessons from Germany and Mali,” in Mechthild Nagel\n&amp; Seth N. Asumah (eds.), <em>Prisons and Punishment: Reconsidering\nGlobal Penality</em>, Trenton, NJ: Africa World Press, pp.\n43–51.", "–––, 2013, “Patriarchal Ideologies and\nWomen’s Domestication,” in Mechthild Nagel &amp; Anthony\nJ. Nocella (eds.), <em>The End of Prisons: Reflections from the\nDecarceration Movement</em>, Amsterdam: Rodopi, pp.\n147–167.", "–––, 2015, “Trafficking with Abolitionism:\nAn Examination of Anti-slavery Discourses,” <em>Champ\nPenal/Penal Field</em>, 12,\n <a href=\"https://champpenal.revues.org/9141\" target=\"other\">Nagel 2007 available online</a>.", "–––, 2018, “Policing Families: The\nMany-Headed Hydra of Surveillance,” <em>APA Newsletter for\nFeminism and Philosophy</em>, 17(2): 2–11.", "Nicholson, Linda (ed.), 1997, <em>The Second Wave: A Reader in\nFeminist Theory</em>, New York: Routledge.", "–––, (ed.), 1990,\n<em>Feminism/Postmodernism</em>, New York: Routledge.", "–––, 1986, <em>Gender and History: The Limits of\nSocial Theory in the Age of the Family</em>, New York: Columbia\nUniversity Press.", "Oakley, Ann, 1976, <em>Woman’s Work: The Housewife, Past and\nPresent</em>, New York: Random/Vintage.", "O’Brien, Mary, 1981, <em>The Politics of Reproduction</em>,\nLondon: Routledge.", "Okin, Susan Moller, 1989, <em>Gender, Justice and the Family</em>,\nNew York: Basic Books.", "Pateman, Carole, 1988, <em>The Sexual Contract</em>, Stanford:\nStanford University Press.", "Pratt, Geraldine, 2004, <em>Working Feminism</em>, Philadelphia:\nTemple University Press.", "Pyle, Jean and Kathryn Ward, 2003, “Recasting Our\nUnderstanding of Gender and Work During Global Restructuring,”\n<em>International Sociology</em>, 18(3): 461–489.", "Quest Staff (eds.), 1981, <em>Building Feminist Theory: Essays\nfrom Quest</em>, New York: Longman.", "Reay, Diane, 2004, “Rethinking Social Class: Qualitative\nPerspectives on Class and Gender,” in Sharlene Nagy Hesse-Biber\nand Michelle L. Yaiser (eds.), <em>Feminist Perspectives on Social\nResearch</em>, New York: Oxford University Press, pp.\n149–154.", "Reed, Evelyn, 1973, <em>Woman’s Evolution from Matriarchal\nClan to Patriarchal Family</em>, New York: Pathfinder Press.", "Rich, Adrienne, 1980, “Compulsory Heterosexuality and\nLesbian Existence,” <em>Signs</em>, 5(4): 631–660.", "Richards, Ellen, 1915, <em>The Art of Right Living</em>, Boston:\nWhitcomb and Barrow.", "Roberts, Dorothy, 2022, <em>Torn Apart: How the Child Welfare\nSystem Destroys Black Families – and How Abolition Can Build a\nSafer World</em>, New York: Basic Books.", "Romero, Mary, 1992, <em>Maid in the USA</em>, London: Chapman and\nHall.", "Rofel, Lisa, 1999, <em>Other Modernities: Gendered Yearnings in\nChina After Socialism</em>, Berkeley, CA: University of California\nPress.", "Rosaldo, Michelie Zimbalist and Louise Lamphere (eds.), 1974,\n<em>Woman, Culture and Society</em>, Stanford: Stanford University\nPress.", "Rowbotham, Sheila, 1972, <em>Women, Resistance and\nRevolution</em>, New York: Random/Vintage Books.", "Rubin, Gayle, 1975, “The Traffic in Women,” in Rayna\nReiner (ed.), <em>Toward a New Anthropology of Women</em>, New York:\nMonthly Review, pp. 157–210", "Ruddick, Sara, 1989, <em>Maternal Thinking: Toward a Politics of\nPeace</em>, Boston: Beacon.", "Saffioti, Helen I. B., 1978, <em>Women in Class Society</em>, New\nYork: Monthly Review.", "Sanday, Peggy, 1981, <em>Female Power and Male Dominance: On the\nOrigins of Sexual Inequality</em>, Cambridge: Cambridge University\nPress.", "Sandberg, Sheryl, 2013, <em>Lean In: Women, Work and the Will to\nLead</em>, New York: Knopf.", "Sandoval, Chela, 2000, <em>Methodology of the Oppressed</em>,\nMinneapolis: University of Minnesota Press.", "Sangster, Joan, 1995, <em>Earning Respect: The Lives of Working\nWomen in Small-Town Ontario, 1920–1960</em>, Toronto:\nUniversity of Toronto Press.", "Saravanah, Sheela, 2018, <em>A Transnational Feminist View of\nSurrogacy Biomarkets in India</em>, New York: Springer.", "Sargent, Lydia (ed.), 1981, <em>Women and Revolution</em>, Boston:\nSouth End Press.", "Sen, Gita and Caren Grown, 1987, <em>Development, Crises and\nAlternative Visions</em>, New York: Monthly Review.", "Smart, Carol, 1984, <em>The Ties that Bind: Marriage and the\nReproduction of Patriarchal Relations</em>, London: Routledge.", "Smith, Dorothy E., 1989, <em>The Everyday World as Problematic: A\nFeminist Sociology</em>, Boston: Northeastern University Press.", "–––, 1974, “Women’s Perspective as a\nRadical Critique of Sociology,” <em>Sociological Inquiry</em>,\n4(1): 1–13.", "Solinger, Rickie, Paula C. Johnson, Martha L. Raimon, Tina\nReynolds, and Ruby C. Tapia (eds.), 2010, <em>Interrupted Life:\nExperiences of Incarcerated Women in the United States</em>, Berkeley:\nUniversity of California Press.", "Spivak, Gayatri Chakravorty, 1988, “Can the Subaltern\nSpeak?”, in Cary Nelson and Lawrence Grossberg (eds.),\n<em>Marxism and the Interpretation of Culture</em>, Urbana: University\nof Illinois Press, pp. 271–313.", "Stephen, Lynn, 2007, <em>Transborder Lives: Indigenous Oaxacans in\nMexico, California, and Orgeon</em>, Raleigh and Durham, NC: Duke\nUniversity Press.", "Tea, Michelle (ed.), 2003, <em>Without a Net: The Female\nExperience of Growing Up Working Class</em>, Emeryville, CA: Seal\nPress.", "Thompson, Melissa, 2010, <em>Mad or Bad? Race, Class, Gender, and\nMental Disorder in the Criminal Justice System</em>, El Paso: LFB\nScholarly Publishing.", "Tokarczyk, Michelle M. and Elizabeth A. Fay (eds.), 1993,\n<em>Working-Class Women in the Academy: Laborers in the Knowledge\nFactory</em>, Amherst, MA: University of Massachusetts.", "Toney, Mark, 2000, Revisiting the National Welfare Rights\nOrganization, <em>Colorlines</em>, Nov. 29,\n <a href=\"http://www.colorlines.com/articles/revisiting-national-welfare-rights-organization\" target=\"other\">available online</a>.", "Tronto, Joan, 2013, <em>Caring Democracy: Markets, Equality, and\nJustice</em>, New York: New York University Press.", "–––, 1993, <em>Moral Boundaries: A Political\nArgument for an Ethic of Care</em>, New York: Routledge.", "Trullinger, Joseph, 2016, “Leisure Is Not a Luxury: The\nRevolutionary Promise of Reverie in Marcuse,” <em>Radical\nPhilosophy Review</em>, 19(2): 453–473.", "Tuana, Nancy and Rosemarie Tong (eds.), 1995, <em>Feminism and\nPhilosophy</em>, Boulder: Westview.", "Veltman, Andrea, 2017, <em>Meaningful Work</em>, New York: Oxford\nUniversity Press.", "Vogel, Lise, 1995, <em>Woman Questions: Essays for a Materialist\nFeminism</em>, New York: Routledge.", "Walby, Sylvia, 1990, <em>Theorizing Patriarchy</em>, Oxford: Basil\nBlackwell.", "Walker, Pat (ed.), 1979, <em>Between Labor and Capital</em>,\nBoston: South End.", "Weeks, Kathi, 2011, <em>The Problem with Work: Feminism, Marxism,\nAntiwar Politics, and Postwork Imaginaries</em>, Durham, NC: Duke\nUniversity Press.", "Wittig, Monique, 1992, “One is not Born a Woman”, in\n<em>The Straight Mind and Other Essays</em>, Boston: Beacon\nPress.", "Young, Iris, 1981, “The Limits of Dual Systems\nTheory,” in Sargent 1981, pp. 43–70.", "Zheng, Tiantian, 2009, <em>Red Lights: The Lives of Sex Workers in\nPostsocialist China</em>, Minneapolis: University of Minnesota\nPress."]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Addams, Jane, 1914, “Women and Public Housekeeping,”\nin <em>Women and Public Life</em>, in James P. Lichtenberger (ed.),\n<em>Annuals of the American Academy of Political and Social Science,\nv. 56</em>.</li>\n<li>Alvarez, Sonia, 1998, “Latin American Feminisms ‘Go\nGlobal’: Trends of the 1990s and Challenges for the New\nMillennium,” in S. Alvarez, E. Dagnin and A. Escobar (eds.),\n<em>Cultures of Politics/Politics of Cultures: Revisioning Latin\nAmerican Social Movements</em>, Boulder Co: Westview, pp.\n93–115.</li>\n<li>Amott, Teresa and Julie Matthaei, 1991, <em>Race, Gender and Work:\nA Multicultural Economic History of Women in the United States</em>,\nBoston: South End Press.</li>\n<li>Anderson, Bridget, 2000, <em>Doing the Dirty Work? The Global\nPolitics of Domestic Labour</em>, London: Zed. </li>\n<li>Anzaldúa, Gloria, 1999, <em>Borderlands/La Frontera</em>,\nSan Francisco: Aunt Lute Press.</li>\n<li>Anzaldúa, Gloria and Cherrie Moraga (eds.), 1981, <em>This\nBridge Called My Back: Writings by Radical Women of Color</em>,\nWatertown MA: Persephone Press.</li>\n<li>Barrett, Michele, 1980, <em>Women’s Oppression Today:\nProblems in Marxist Feminist Analysis</em>, London: Verso.</li>\n<li>Bartky, Sandra, 1990, <em>Femininity and Domination: Studies in\nthe Phenomenology of Oppression</em>, New York: Routledge.</li>\n<li>Beauvoir, Simone De, 1978, <em>The Second Sex</em>, tr. &amp; ed.\nby. HM Parsley, New York: Knopf.</li>\n<li>Beecher, Catherine, [1841] 1970, <em>A Treatise on Domestic\nEconomy</em>, New York: Source Book Press.</li>\n<li>Beneria, Lourdes, 2003, <em>Gender, Development, and\nGlobalization: Economics As If All People Mattered</em>, London:\nRoutledge.</li>\n<li>Benston, Margaret, 1969, “The Political Economy of\nWomen’s Liberation,” <em>Monthly Review</em>, 21 (4),\nSeptember.</li>\n<li>Bernstein, Elizabeth, 2007, “The Sexual Politics of the\n‘New Abolitionism’,” <em>Differences</em>, 18(5):\n128–151.</li>\n<li>Bettie, Julie, 2000, “Women without Class: <em>Chicas,\nCholas</em>, Trash and the Presence/Absence of Class Identity,”\n<em>Signs: Journal of Women in Culture and Society</em>, 6(1):\n1–35.</li>\n<li>Brenner, Johanna, 2000, <em>Women and the Politics of Class</em>,\nNew York: Monthly Review.</li>\n<li>Brewer, Rose, 1993,“Theorizing Race, Class and\nGender,” in Stanlie James and Abena Busia, pp. 13–30.</li>\n<li>Brown, Rita Mae, 1974, “The Last Straw”, in Bunch and\nMyron 1974, pp. 13–23.</li>\n<li>Bunch, Charlotte and Nancy Myron (eds.), 1974, <em>Class and\nFeminism</em>, Baltimore: Diana Press.</li>\n<li>Capella, Jean, James Ridgeway, and Sarah Shourd, 2016, <em>Hell is\na Very Small Place: Voices from Solitary Confinement</em>. New York:\nThe New Press.</li>\n<li>Carby, Hazel, 1997, “White Woman Listen!!” in Hennessy\nand Ingraham (eds.), pp. 110–128.</li>\n<li>Chatzidakis, Andrea, <em>et al</em>., 2020, <em>The Care\nManifesto: The Politics of Interdependence</em>, London: Verso.</li>\n<li>Chen, Martha, <em>et al</em>., 2005, <em>Progress of the\nWorld’s Women: Women, Work, and Poverty</em>, New York:\nUNIFEM.</li>\n<li>Chodorow, Nancy, 1978, <em>The Reproduction of Mothering</em>,\nBerkeley: University of California.</li>\n<li>–––, 1979, “Mothering, Male Dominance, and\nCapitalism,” in Zillah Eisenstein (ed.), <em>Capitalist\nPatriarchy and the Case for Socialist Feminism</em>, New York: Monthly\nReview Press, pp. 83–106.</li>\n<li>–––, 1989, “Toward a Relational\nIndividualism,” in <em>Feminism and Psychoanalytic Theory</em>,\nLondon: Polity Press, pp. 154–162.</li>\n<li>Cliff, Tony, 1984, <em>Class Struggle and Women’s\nLiberation</em>, London: Blackwell.</li>\n<li>Conaghan, Joanna, 2009, “Intersectionality and the Feminist\nProject in Law,” in Graham <em>et al</em>. (eds.),\n21–48.</li>\n<li>Crenshaw, Kimberlé, 1989, “Demarginalizing the\nIntersection between Race and Sex: A Black Feminist Critique of\nAnti-Discrimination Doctrine, Feminist Theory and Anti-Racist\nPolitics,” <em>University of Chicago Legal Forum</em>:\n139–67.</li>\n<li>–––, 1992, “Whose Story is it Anyway?\nFeminist and Anti-racist Appropriations of Anita Hill”, in Toni\nMorrison (ed.), <em>Race-ing Justice, Engendering Power</em>, New\nYork: Pantheon, pp. 402–41.</li>\n<li>Dalla Costa, Maria, 1974, <em>The Power of Women and the\nSubversion of the Community</em>, Bristol, England: Falling Wall\nPress.</li>\n<li>Davis, Angela Y., 1983, <em>Women, Race, and Class</em>, New York:\nVintage Press.</li>\n<li>–––, 1998, “From the Prison of Slavery to\nthe Slavery of Prisons: Frederick Douglass and the Convict Lease\nSystem,” in Joy A. James (ed.), <em>The Angela Y. Davis\nReader</em>, Malden, MA: Blackwell.</li>\n<li>Delphy, Christine, 1984, <em>Close to Home: A Materialist Analysis\nof Women’s Oppression</em>, Amherst, MA: University of\nMassachusetts.</li>\n<li>Dewey, Susan, 2010, <em>Neon Wasteland: On Love, Motherhood, and\nSex Work in a Rust Belt Town</em>, Berkeley: University of California\nPress.</li>\n<li>DiQuinzio, Patrice, 1999, <em>The Impossibility of Motherhood:\nFeminism, Individualism, and the Problem of Mothering</em>, New York:\nRoutledge.</li>\n<li>Eddy, Pamela L. and Kelly Ward, 2015, “Lean In or Opt Out:\nCareer Paths of Academic Women,” <em>Change: The Magazine of\nHigher Learning</em>, 47(2): 6–13.</li>\n<li>Ehrenreich, Barbara and John Ehrenreich, 1979, “The\nProfessional-Managerial Class,” in Walker (ed.) 1979, pp.\n5–49.</li>\n<li>Ehrenreich, Barbara and Arlie Hochschild (eds.), 2004, <em>Global\nWoman: Nannies, Maids, and Sex Workers in the New Economy</em>, New\nYork: Holt.</li>\n<li>–––, 2001, <em>Nickled and Dimed: On (Not)\nGetting By in America</em>, New York: Metropolitan Books.</li>\n<li>Eisenstein, Zillah (ed.), 1979, <em>Capitalist Patriarchy and the\nCase for Socialist Feminism</em>, New York: Monthly Review.</li>\n<li>Engels, Friedrich, 1972, <em>The Origin of the Family, Private\nProperty and the State, in the light of the researches of Lewis H.\nMorgan</em>, New York: International Publishers [1942]</li>\n<li>Enloe, Cynthia, 2004, <em>The Curious Feminist: Searching for\nWomen in the New Age of Empire</em>, Berkeley: University of\nCalifornia Press.</li>\n<li>Federici, Silvia, 1975, “Wages Against Housework”, in\nMalos (ed.) 1975, pp. 187–194.</li>\n<li>–––, 2004, <em>Caliban and the Witch: Women, the\nBody and Primitive Accumulation</em>, Brooklyn, NY: Autonomedia.</li>\n<li>Ferguson, Ann, 1979, “Women as a New Revolutionary Class in\nthe US,” in Walker (ed.) 1979, pp. 279–309.</li>\n<li>–––, 1989, <em>Blood at the Root: Motherhood,\nSexuality and Male Domination</em>, New York: Pandora/Unwin and\nHyman.</li>\n<li>–––, 1991, <em>Sexual Democracy: Women,\nOppression and Revolution</em>, Boulder CO: Westview Press.</li>\n<li>–––, 1996, “Sex and Work”, in Kai\nNielson and Robert Ware (eds.), <em>Exploitation</em>, New York:\nHumanities Press, pp. 272–280.</li>\n<li>–––, 1998, “Feminism and Socialism”,\nin Alison Jaggar and Iris Young (eds.), <em>Blackwell’s\nCompanion to Feminist Philosophy</em>, Oxford: Blackwell, pp.\n520–529.</li>\n<li>–––, 2004. “A Feminist Analysis of the\nCare Crisis,” in Fina Birulés and Maria Isabel\nPeña Aguado (eds.), <em>La Passió per la Libertat/A\nPassion for Freedom</em>, The Proceedings of the International\nWomen’s Philosophy Association (IAPh) conference, October\n1–5, 2002, Barcelona, Spain: Universitat de Barcelona.</li>\n<li>Ferguson, Ann and Nancy Folbre, 1981, “The Unhappy Marriage\nof Capitalism and Patriarchy,” in Sargent 1981, pp.\n313–338.</li>\n<li>–––, 2000. “Women, Care and the Public\nGood: A Dialogue,” in Anatole Anton, Milton Fisk and Nancy\nHolmstrom (eds.), <em>Not for Sale: In Defense of Public Goods</em>,\nBoulder CO: Westview Press, pp. 95–108.</li>\n<li>Folbre, Nancy, 1982, “Exploitation Comes Home: A Critique of\nthe Marxian Theory of Family Labor,” <em>Cambridge Journal of\nEconomics</em>, 6(4): 317–29.</li>\n<li>–––, 1983, “Of Patriarchy Born: The\nPolitical Economy of Fertility Decisions,” <em>Feminist\nStudies</em>, 9(2): 261–84.</li>\n<li>–––, 1987, “Patriarchy as a Mode of\nProduction,” in Randy Albelda and C. Gunn (eds.), <em>New\nDirections in Political Economy</em>, New York: M.E. Sharpe.</li>\n<li>–––, 1993, “Socialism: Feminist or\nScientific?” in M. Ferber and Julie Nelson (eds.), <em>Beyond\nEconomic Man</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1994, <em>Who Pays for the Kids? Gender and\nthe Structures of Constraint</em>, New York: Routledge.</li>\n<li>–––, 2000, <em>The Invisible Heart: Economics\nand Family Values</em>, New York: The New Press.</li>\n<li>Foreman, Ann, 1977, <em>Femininity as Alienation: Women and the\nFamily in Marxism and Psychoanalysis</em>, London: Pluto.</li>\n<li>Foweraker, Joe, 1998, “Ten Theses on Women in the Political\nLife of Latin America,” in Victoria Rodriguez (ed.),\n<em>Women’s Participation in Mexican Political Life</em>,\nBoulder CO: Westview: 63–73.</li>\n<li>Fox, Bonnie (ed.), 1980, <em>Hidden in the Household:\nWomen’s Domestic Labour under Capitalism</em>, Toronto: The\nWomen’s Press.</li>\n<li>Fraser, Nancy, 1997, <em>Justice Interruptus: Critical Reflections\non the “Post-Socialist” Condition</em>, New York:\nRoutledge.</li>\n<li>–––, 2013, <em>Fortunes of Feminism: From\nState-Managed Capitalism to Neoliberal Crisis</em>, London:\nVerso.</li>\n<li>Fraser, Nancy and Linda Gordon, 1994. “A Genealogy of\nDependency: Tracing a Keyword of the U.S. Welfare State”,\n<em>Signs</em>, 19(2): 309–336.</li>\n<li>Fraser, Nancy and Linda Nicholson, 1991, “Social Criticism\nwithout Philosophy: An Encounter between Feminism and\nPostmodernism”, in Nicholson (ed.) 1991, pp. 19–38.</li>\n<li>Freeman, Carla, 1999, <em>High Tech and High Heels in the Global\nEconomy: Women, Work, and Pink-Collar Identities in the\nCaribbean</em>, Raleigh and Durham, NC: Duke University Press.</li>\n<li>Friedan, Betty, 1963, <em>The Feminine Mystique</em>, New York:\nNorton.</li>\n<li>Fuchs, Christian, 2016, “Herbert Marcuse and Social\nMedia”, <em>Radical Philosophy Review</em>, 19(1):\n111–141.</li>\n<li>George, Sheba, 2005, <em>When Women Come First</em>, Berkeley, CA:\nUniversity of California Press.</li>\n<li>Gibson-Graham, J.K., 1996, <em>The End of Capitalism (as we knew\nit)</em>, Cambridge MA: Blackwell Publishers.</li>\n<li>Gilligan, Carol, 1982, <em>In a Different Voice: Psychological\nTheory and Women’s Development</em>, Cambridge: Harvard\nUniversity.</li>\n<li>Gilman, Charlotte Perkins, 1898, <em>Women and Economics: A Study\nof the Economic Relation between Men and Women as a Factor in Social\nEvolution</em>, Boston: Small, Mayard and Co.</li>\n<li>–––, [1903] 1910, <em>The Home, Its Work and\nInfluence</em>, New York: Charlton Company</li>\n<li>–––, 1979, <em>Herland</em>, New York:\nPantheon.</li>\n<li>Goldberg, Michelle, 2015, “Has Child Protective Services\nGone Too Far?” <em>The Nation</em>, Sept. 30,\n <a href=\"https://lockerdome.com/thenation.com/8078031935782164\" target=\"other\">Goldberg 2015 available online</a></li>\n<li>Goldman, Emma, 1969, <em>Anarchism and Other Essays</em>, New\nYork: Dover.</li>\n<li>Gomberg, Paul, 2007, <em>How to Make Opportunity Equal: Race and\nContributive Justice</em>, Malden, MA: Blackwell.</li>\n<li>Grabham, Emily, Davina Cooper, Jane Krishnadas, and Didi Herman\n(eds.), 2009. <em>Intersectionality and Beyond</em>, London:\nRoutledge-Cavandish.</li>\n<li>Grewal, Inderpal and Caren Kaplan, 1994, <em>Scattered Hegemonies:\nPostmodernity and Transnational Feminist Practices</em>, Minneapolis:\nUniversity of Minnesota Press.</li>\n<li>Guggenheim, Martin, <em>What’s Wrong with Children’s\nRights</em>, Cambridge: Harvard University Press.</li>\n<li>Gutiérrez Rodríguez, Encarnación, 2010,\n<em>Migration, Domestic Work and Affect</em>, New York:\nRoutledge.</li>\n<li>Halberstam, Judith, 2005, <em>In a Queer Time and Place:\nTransgender Bodies, Subcultural Lives</em>, New York: New York\nUniversity Press.</li>\n<li>Hansen, Karen V. and Ilene J. Philipson (eds.), 1990, <em>Women,\nClass and the Feminist Imagination: A Socialist-Feminist Reader</em>,\nPhiladelphia: Temple University.</li>\n<li>Haraway, Donna, 1985, “A Manifesto for Cybourgs: Science,\nTechnology and Socialist-Feminism in the 1980s”, <em>Socialist\nReview</em>, 15 (2): 65–107.</li>\n<li>Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca: Cornell University.</li>\n<li>Hartmann, Heidi, 1979, “Capitalism, Patriarchy and Job\nSegregation by Sex,” in Eisenstein (ed.), pp.\n206–247.</li>\n<li>–––, 1981a, “The Unhappy Marriage of\nMarxism and Feminism: Toward a More Progressive Union,” in\nSargent (ed.) 1981, pp. 1–42.</li>\n<li>–––, 1981b, “The Family as the Locus of\nGender, Class and Political Struggle: The Example of Housework,”\n<em>Signs</em>, 6(3): 366–394.</li>\n<li>Hartsock, Nancy, 1983a, “The Feminist Standpoint: Developing\nthe Ground for a Specifically Feminist Historical Materialism,”\nin Sandra Harding and Merle Hintikka (eds.), <em>Discovering Reality:\nFeminist Perspectives in Epistemology, Metaphysics and the Philosophy\nof Science</em>, Dordrecht, Holland: Reidel Publishers, pp.\n283–310.</li>\n<li>–––, 1983b, <em>Money, Sex and Power</em>, New\nYork: Longman.</li>\n<li>Hayden, Dolores, 1981, <em>The Grand Domestic Revolution: A\nHistory of Feminist Designs for American Homes, Neighborhoods and\nCities</em>, Cambridge MA: MIT Press.</li>\n<li>Hennessy, Rosemary, 2003, “Class,” in Mary Eagleton\n(ed.), <em>A Concise Companion to Feminist Theory</em>, Malden, MA:\nBlackwell.</li>\n<li>–––, 1993, <em>Materialist Feminism and the\nPolitics of Discourse</em>, New York: Routledge.</li>\n<li>–––, 2000, <em>Profit and Pleasure: Sexual\nIdentities in Late Capitalism</em>, New York: Routledge.</li>\n<li>Hennessy, Rosemary and Chrys Ingraham (eds.), 1997,\n<em>Materialist Feminism: A Reader in Class, Difference, and\nWomen’s Lives</em>, New York: Routledge.</li>\n<li>Herrmann, Anne C. and Abigail J. Stewart (eds.), 1994,\n“Theorizing Feminism: Parallel Trends in the Humanities and\nSocial Sciences”, Boulder: Westview Press.</li>\n<li>Hill Collins, Patricia, 1990, 2000, <em>Black Feminist\nThought</em>, 1<sup>st</sup> and 2<sup>nd</sup> editions, New York:\nRoutledge.</li>\n<li>Hochschild, Arlie, 1989, <em>The Second Shift: Working Parents and\nthe Revolution at Home</em>, New York: Penguin.</li>\n<li>–––, 1997, <em>The Time Bind: When Work Becomes\nHome and Home becomes Work</em>, New York: Metropolitan.</li>\n<li>–––, 2000, “Global Care Chains and\nEmotional Surplus Value,” in Will Hutton and Anthony Middens\n(eds.), <em>Global Capitalism</em>, New York: The New Press, pp.\n130–146.</li>\n<li>Holmstrom, Nancy (ed.), 2002, <em>The Socialist Feminist Project:\nA Contemporary Reader in Theory and Politics</em>, New York: Monthly\nReview.</li>\n<li>hooks, bell, 1984, <em>Feminist Theory from Margin to Center</em>,\nBoston: South End.</li>\n<li>–––, 2000, <em>Where We Stand:</em> <em>Class\nMatters</em>, New York: Routledge.</li>\n<li>Irigaray, Luce, 1985, <em>This Sex Which is not One</em>, tr.\nCatherine Porter, Ithaca NY: Cornell University, pp. 23–33.</li>\n<li>Jaggar, Alison, 1983, <em>Feminist Politics and Human Nature</em>,\nTotowa NJ: Rowman and Allenheld.</li>\n<li>Jaggar, Alison and Paula Rothenberg [Struhl] (eds.), 1978,\n<em>Feminist Frameworks: Alternative Theoretical Accounts of the\nRelations between Women and Men</em>, New York: McGraw Hill.</li>\n<li>James, Joy A., 2007, <em>Warfare in the American Homeland: Policing\nand Prison in a Penal Democracy</em>, Durham: Duke University\nPress.</li>\n<li>James, Stanlie and Abena Busia (eds.), 1993, <em>Theorizing Black\nFeminisms: The Visionary Pragmatism of Black Women</em>, New York:\nRoutledge.</li>\n<li>Jónasdóttir, Anna, 1988. “On the Concept of\nInterest, Women’s Interests and the Limitations of Interest\nTheory,” in Kathleen Jones and Anna Jónasdóttir.\n(eds.), <em>The Political Interests of Gender</em>, London: Sage.</li>\n<li>–––, 1994, <em>Why Women Are Oppressed</em>,\nPhiladelphia: Temple University Press.</li>\n<li>Jones, Bernie D. (ed.), 2012, <em>Women Who Opt Out: The Debate\nover Working Mothers and Work-Family Balance</em>, New York: New York\nUniversity Press.</li>\n<li>Joseph, Gloria, 1981, “The Incompatible Menage à\nTrois: Marxism, Feminism and Racism,” in Sargent (ed.), 1981,\npp. 91–108.</li>\n<li>Kadi, Joanna, 1999, <em>Thinking Class: Sketches from a Cultural\nWorker</em>, Boston: South End Press.</li>\n<li>Kaplan, Caren, Norma Alarcón and Minoo Moallen, 1999,\n<em>Between Woman and Nation: Nationalisms, Transnational Feminisms,\nand the State</em>, Durham, NC: Duke University Press.</li>\n<li>Kempadoo, Kamala and Jo Doezema, 1998, <em>Global Sex Workers:\nRights, Resistance and Redefinition</em>, New York: Routledge.</li>\n<li>Keogh, Leyla J., 2015, <em>Worker-Mothers on the Margins of\nEurope: Gender and Migration between Moldova and Istanbul</em>,\nBloomington, IN: Indiana University Press.</li>\n<li>Key, Ellen, 1909, <em>The Century of the Child</em>, New York:\nG.P. Putnam’s Sons.</li>\n<li>–––, 1914, <em>The Renaissance of\nMotherhood</em>, New York: G.P. Putnam’s Sons.</li>\n<li>Kittay, Eva Feder, 2019, <em>Learning from My Daughter: The Value\nand Care of Disabled Minds</em>, New York: Oxford University\nPress.</li>\n<li>–––, 1998, <em>Love’s Labor: Essays on\nWomen, Equality, and Dependency</em>, New York: Routledge.</li>\n<li>Kollias, Karen, 1975, “Class Realities: Create a New Power\nBase,” <em>Quest: a Feminist Quarterly</em>, 1 (3) (Winter\n1975), reprinted in Quest (eds.) 1981, <em>Building Feminist Theory:\nEssays from Quest</em>, New York: Longmans, pp. 125–138.</li>\n<li>Kuhn, Annette and AnnMarie Wolpe (eds.), 1978, <em>Feminism and\nMaterialism: Women and Modes of Production</em>, London: Routledge and\nKegan Paul Ltd.</li>\n<li>Landry, Donna and Gerald MacLean, 1993, <em>Materialist\nFeminisms</em>, Oxford: Blackwell Publishers.</li>\n<li>Law, Victoria, 2012, <em>Resistance behind Bars: Struggles of\nIncarcerated Women</em>, 2nd ed., Oakland: PM Press.</li>\n<li>Leacock, Eleanor, 1972, “Introduction,” in Engels\n1972.</li>\n<li>Leghorn, Lisa and Katherine Parker, 1981, <em>Woman’s Worth:\nSexual Economics and the World of Women</em>, London: Routledge and\nKegan Paul.</li>\n<li>Lehr, Valerie, 1999, <em>Queer Family Values: Debunking the Myth\nof the Nuclear Family</em>, Philadelphia: Temple University\nPress.</li>\n<li>Lerner, Gerda, 1986, <em>Women and History</em>, New York: Oxford\nUniversity Press.</li>\n<li>McKenney, Mary, 1981, “Class Attitudes and\nProfessionalism,” <em>Quest</em>: 139–148.</li>\n<li>Malos, Ellen (ed.), 1975, <em>The Politics of Housework</em>, New\nYork: The New Clarion Press.</li>\n<li>Marchand, Marianne, 1995, “Latin American Women Speak on\nDevelopment: Are We Listening Yet?”, in Marianne Marchand and\nJane Parapet (eds.), <em>Feminism/Postmodernism/Development</em>, New\nYork: Rutledge, pp. 56–72.</li>\n<li>Marx, Karl, [1844], <em>Economic and Philosophical\nManuscripts</em>, in Lewis S. Feuer (ed.), 1989. <em>Basic Writings on\nPolitics and Philosophy/Karl Marx, Friedrich Engels</em>, New York:\nAnchor Books.</li>\n<li>–––, [1850], 1970, <em>Introduction to the\nCritique of Political Economy</em>, trans. S.W. Ryazanskaya, ed.\nMaurice Dobb, New York: International Publishers.</li>\n<li>–––, 1906–09, <em>Capital: A Critique of\nPolitical Economy, vols. 1–3</em>, Chicago: C.H. Kerr and\nCompany.</li>\n<li>Marx, Karl and Friedrich Engels, 1848. <em>Manifesto of the\nCommunist Party</em>, authorized English translation edited and\nannotated by Friedrich Engels, New York: International.</li>\n<li>–––, [1850] 1970, <em>German Ideology</em>, Part\nI. New York: International.</li>\n<li>McLaren Margaret A., 2019, <em>Women’s Activism, Feminism,\nand Social Justice</em>, New York: Oxford University Press.</li>\n<li>McRobbie, Angela, 2002. <em>Feminism and Youth Culture</em>, 2nd\nedition, New York: Routledge.</li>\n<li>Mies, Maria, 1986, <em>Patriarchy and Accumulation on a World\nScale</em>, London: Zed.</li>\n<li>Mitchell, Juliet, 1972, <em>Women’s Estate</em>, New York:\nRandom House.</li>\n<li>–––, 1974, <em>Psychoanalysis and Feminism</em>,\nNew York: Pantheon.</li>\n<li>Mohanty, Chandra Talpade, 2003, <em>Feminism Without Borders:\nDecolonizing Theory, Practicing Solidarity</em>, Raleigh and Durham,\nNC: Duke University Press.</li>\n<li>–––, 1997, “Women Workers and Capitalist\nScripts: Ideologies of Domination, Common Interests and the Politics\nof Solidarity,” in M. Jacqui Alexander and Chandra Talpade\nMohanty (eds.), <em>Feminist Genealogies, Colonial Legacies,\nDemocratic Futures</em>, New York: Routledge, pp. 3–29.</li>\n<li>Molyneux, Maxine, 1985, “Mobilization without Emancipation?\nWomen’s Interests, State and Revolution,” <em>Feminist\nStudies</em>, 11(2): 227–254. Reprinted in Molyneux 2001:\n38–59.</li>\n<li>–––, 2001, <em>Women’s Movements in\nInternational Perspective</em>, New York: Palgrave.</li>\n<li>Moser, Caroline O. N., 1993, <em>Gender Planning and Development:\nTheory, Practice and Training</em>, New York: Routledge.</li>\n<li>Moses, Greg, 2007, “Time and Punishment in an Unesthetic\nWorld Order,” in Mechthild Nagel &amp; Seth N. Asumah (eds.),\n<em>Prisons and Punishment: Reconsidering Global Penality</em>,\nTrenton, NJ: Africa World Press, pp. 71–75.</li>\n<li>Nagel, Mechthild, 2007, “Gender, Incarcerating and\nPeacemaking: Lessons from Germany and Mali,” in Mechthild Nagel\n&amp; Seth N. Asumah (eds.), <em>Prisons and Punishment: Reconsidering\nGlobal Penality</em>, Trenton, NJ: Africa World Press, pp.\n43–51.</li>\n<li>–––, 2013, “Patriarchal Ideologies and\nWomen’s Domestication,” in Mechthild Nagel &amp; Anthony\nJ. Nocella (eds.), <em>The End of Prisons: Reflections from the\nDecarceration Movement</em>, Amsterdam: Rodopi, pp.\n147–167.</li>\n<li>–––, 2015, “Trafficking with Abolitionism:\nAn Examination of Anti-slavery Discourses,” <em>Champ\nPenal/Penal Field</em>, 12,\n <a href=\"https://champpenal.revues.org/9141\" target=\"other\">Nagel 2007 available online</a>.</li>\n<li>–––, 2018, “Policing Families: The\nMany-Headed Hydra of Surveillance,” <em>APA Newsletter for\nFeminism and Philosophy</em>, 17(2): 2–11.</li>\n<li>Nicholson, Linda (ed.), 1997, <em>The Second Wave: A Reader in\nFeminist Theory</em>, New York: Routledge.</li>\n<li>–––, (ed.), 1990,\n<em>Feminism/Postmodernism</em>, New York: Routledge.</li>\n<li>–––, 1986, <em>Gender and History: The Limits of\nSocial Theory in the Age of the Family</em>, New York: Columbia\nUniversity Press.</li>\n<li>Oakley, Ann, 1976, <em>Woman’s Work: The Housewife, Past and\nPresent</em>, New York: Random/Vintage.</li>\n<li>O’Brien, Mary, 1981, <em>The Politics of Reproduction</em>,\nLondon: Routledge.</li>\n<li>Okin, Susan Moller, 1989, <em>Gender, Justice and the Family</em>,\nNew York: Basic Books.</li>\n<li>Pateman, Carole, 1988, <em>The Sexual Contract</em>, Stanford:\nStanford University Press.</li>\n<li>Pratt, Geraldine, 2004, <em>Working Feminism</em>, Philadelphia:\nTemple University Press.</li>\n<li>Pyle, Jean and Kathryn Ward, 2003, “Recasting Our\nUnderstanding of Gender and Work During Global Restructuring,”\n<em>International Sociology</em>, 18(3): 461–489.</li>\n<li>Quest Staff (eds.), 1981, <em>Building Feminist Theory: Essays\nfrom Quest</em>, New York: Longman.</li>\n<li>Reay, Diane, 2004, “Rethinking Social Class: Qualitative\nPerspectives on Class and Gender,” in Sharlene Nagy Hesse-Biber\nand Michelle L. Yaiser (eds.), <em>Feminist Perspectives on Social\nResearch</em>, New York: Oxford University Press, pp.\n149–154.</li>\n<li>Reed, Evelyn, 1973, <em>Woman’s Evolution from Matriarchal\nClan to Patriarchal Family</em>, New York: Pathfinder Press.</li>\n<li>Rich, Adrienne, 1980, “Compulsory Heterosexuality and\nLesbian Existence,” <em>Signs</em>, 5(4): 631–660.</li>\n<li>Richards, Ellen, 1915, <em>The Art of Right Living</em>, Boston:\nWhitcomb and Barrow.</li>\n<li>Roberts, Dorothy, 2022, <em>Torn Apart: How the Child Welfare\nSystem Destroys Black Families – and How Abolition Can Build a\nSafer World</em>, New York: Basic Books.</li>\n<li>Romero, Mary, 1992, <em>Maid in the USA</em>, London: Chapman and\nHall.</li>\n<li>Rofel, Lisa, 1999, <em>Other Modernities: Gendered Yearnings in\nChina After Socialism</em>, Berkeley, CA: University of California\nPress.</li>\n<li>Rosaldo, Michelie Zimbalist and Louise Lamphere (eds.), 1974,\n<em>Woman, Culture and Society</em>, Stanford: Stanford University\nPress.</li>\n<li>Rowbotham, Sheila, 1972, <em>Women, Resistance and\nRevolution</em>, New York: Random/Vintage Books.</li>\n<li>Rubin, Gayle, 1975, “The Traffic in Women,” in Rayna\nReiner (ed.), <em>Toward a New Anthropology of Women</em>, New York:\nMonthly Review, pp. 157–210</li>\n<li>Ruddick, Sara, 1989, <em>Maternal Thinking: Toward a Politics of\nPeace</em>, Boston: Beacon.</li>\n<li>Saffioti, Helen I. B., 1978, <em>Women in Class Society</em>, New\nYork: Monthly Review.</li>\n<li>Sanday, Peggy, 1981, <em>Female Power and Male Dominance: On the\nOrigins of Sexual Inequality</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Sandberg, Sheryl, 2013, <em>Lean In: Women, Work and the Will to\nLead</em>, New York: Knopf.</li>\n<li>Sandoval, Chela, 2000, <em>Methodology of the Oppressed</em>,\nMinneapolis: University of Minnesota Press.</li>\n<li>Sangster, Joan, 1995, <em>Earning Respect: The Lives of Working\nWomen in Small-Town Ontario, 1920–1960</em>, Toronto:\nUniversity of Toronto Press.</li>\n<li>Saravanah, Sheela, 2018, <em>A Transnational Feminist View of\nSurrogacy Biomarkets in India</em>, New York: Springer.</li>\n<li>Sargent, Lydia (ed.), 1981, <em>Women and Revolution</em>, Boston:\nSouth End Press.</li>\n<li>Sen, Gita and Caren Grown, 1987, <em>Development, Crises and\nAlternative Visions</em>, New York: Monthly Review.</li>\n<li>Smart, Carol, 1984, <em>The Ties that Bind: Marriage and the\nReproduction of Patriarchal Relations</em>, London: Routledge.</li>\n<li>Smith, Dorothy E., 1989, <em>The Everyday World as Problematic: A\nFeminist Sociology</em>, Boston: Northeastern University Press.</li>\n<li>–––, 1974, “Women’s Perspective as a\nRadical Critique of Sociology,” <em>Sociological Inquiry</em>,\n4(1): 1–13.</li>\n<li>Solinger, Rickie, Paula C. Johnson, Martha L. Raimon, Tina\nReynolds, and Ruby C. Tapia (eds.), 2010, <em>Interrupted Life:\nExperiences of Incarcerated Women in the United States</em>, Berkeley:\nUniversity of California Press.</li>\n<li>Spivak, Gayatri Chakravorty, 1988, “Can the Subaltern\nSpeak?”, in Cary Nelson and Lawrence Grossberg (eds.),\n<em>Marxism and the Interpretation of Culture</em>, Urbana: University\nof Illinois Press, pp. 271–313.</li>\n<li>Stephen, Lynn, 2007, <em>Transborder Lives: Indigenous Oaxacans in\nMexico, California, and Orgeon</em>, Raleigh and Durham, NC: Duke\nUniversity Press.</li>\n<li>Tea, Michelle (ed.), 2003, <em>Without a Net: The Female\nExperience of Growing Up Working Class</em>, Emeryville, CA: Seal\nPress.</li>\n<li>Thompson, Melissa, 2010, <em>Mad or Bad? Race, Class, Gender, and\nMental Disorder in the Criminal Justice System</em>, El Paso: LFB\nScholarly Publishing.</li>\n<li>Tokarczyk, Michelle M. and Elizabeth A. Fay (eds.), 1993,\n<em>Working-Class Women in the Academy: Laborers in the Knowledge\nFactory</em>, Amherst, MA: University of Massachusetts.</li>\n<li>Toney, Mark, 2000, Revisiting the National Welfare Rights\nOrganization, <em>Colorlines</em>, Nov. 29,\n <a href=\"http://www.colorlines.com/articles/revisiting-national-welfare-rights-organization\" target=\"other\">available online</a>.</li>\n<li>Tronto, Joan, 2013, <em>Caring Democracy: Markets, Equality, and\nJustice</em>, New York: New York University Press.</li>\n<li>–––, 1993, <em>Moral Boundaries: A Political\nArgument for an Ethic of Care</em>, New York: Routledge.</li>\n<li>Trullinger, Joseph, 2016, “Leisure Is Not a Luxury: The\nRevolutionary Promise of Reverie in Marcuse,” <em>Radical\nPhilosophy Review</em>, 19(2): 453–473.</li>\n<li>Tuana, Nancy and Rosemarie Tong (eds.), 1995, <em>Feminism and\nPhilosophy</em>, Boulder: Westview.</li>\n<li>Veltman, Andrea, 2017, <em>Meaningful Work</em>, New York: Oxford\nUniversity Press.</li>\n<li>Vogel, Lise, 1995, <em>Woman Questions: Essays for a Materialist\nFeminism</em>, New York: Routledge.</li>\n<li>Walby, Sylvia, 1990, <em>Theorizing Patriarchy</em>, Oxford: Basil\nBlackwell.</li>\n<li>Walker, Pat (ed.), 1979, <em>Between Labor and Capital</em>,\nBoston: South End.</li>\n<li>Weeks, Kathi, 2011, <em>The Problem with Work: Feminism, Marxism,\nAntiwar Politics, and Postwork Imaginaries</em>, Durham, NC: Duke\nUniversity Press.</li>\n<li>Wittig, Monique, 1992, “One is not Born a Woman”, in\n<em>The Straight Mind and Other Essays</em>, Boston: Beacon\nPress.</li>\n<li>Young, Iris, 1981, “The Limits of Dual Systems\nTheory,” in Sargent 1981, pp. 43–70.</li>\n<li>Zheng, Tiantian, 2009, <em>Red Lights: The Lives of Sex Workers in\nPostsocialist China</em>, Minneapolis: University of Minnesota\nPress.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["anarchism", "Beauvoir, Simone de", "Engels, Friedrich", "feminist philosophy, interventions: ethics", "feminist philosophy, interventions: political philosophy", "feminist philosophy, topics: perspectives on reproduction and the family", "feminist philosophy, topics: perspectives on sex and gender", "feminist philosophy, topics: perspectives on sex markets", "feminist philosophy, topics: perspectives on the self", "Marx, Karl"], "entry_link": [{"../anarchism/": "anarchism"}, {"../beauvoir/": "Beauvoir, Simone de"}, {"../feminism-ethics/": "feminist philosophy, interventions: ethics"}, {"../feminism-political/": "feminist philosophy, interventions: political philosophy"}, {"../feminism-family/": "feminist philosophy, topics: perspectives on reproduction and the family"}, {"../feminism-gender/": "feminist philosophy, topics: perspectives on sex and gender"}, {"../feminist-sex-markets/": "feminist philosophy, topics: perspectives on sex markets"}, {"../feminism-self/": "feminist philosophy, topics: perspectives on the self"}, {"../marx/": "Marx, Karl"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-class\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-class/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=feminism-class&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/feminism-class/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-class": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/feminism-class/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=feminism-class&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/feminism-class/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["Ferguson, Ann, 2004,\n <a href=\"https://www.globaljusticecenter.org/sites/default/files/pdfs/dev1.pdf\" target=\"other\">Can Development Create Empowerment and Women’s Liberation</a>,\n presented at <em>Another World is Possible: Workshop on\nAlterGlobalizations</em>, San Miguel de Allende, Guanajuato, Mexico,\nAugust 5–12, 2004.", "<a href=\"http://basicincome.org\" target=\"other\">Basic Income Earth network</a>\n (BIEN).", "<a href=\"https://www.uml.edu/research/cww/\" target=\"other\">Center for Women and Work</a>", "<a href=\"http://www.cluw.org/\" target=\"other\">Coalition of Labor Union Women</a>.", "<a href=\"https://combaheerivercollective.weebly.com/the-combahee-river-collective-statement.html\" target=\"other\">Combahee River Collective</a>,\n The Combahee River Collective Statement.", "<a href=\"http://www.ohchr.org/EN/HRBodies/CEDAW/Pages/CEDAWIndex.aspx\" target=\"other\">Committee on the Elimination of Discrimination against Women</a>.", "Federici, Sylvia, 2008,\n <a href=\"http://inthemiddleofthewhirlwind.wordpress.com/precarious-labor-a-feminist-viewpoint/\" target=\"other\">Precarious Labor: A Feminist Viewpoint</a>,\n lecture, October 28th 2006, at Bluestockings Radical Bookstore, New\nYork City.", "<a href=\"http://www.iwpr.org\" target=\"other\">Institute for Women’s Policy Research</a>.", "<a href=\"http://www.bayswan.org/orgs.html\" target=\"other\">Sex Worker Rights Organizations and Projects around the World</a>.", "<a href=\"https://www.perlego.com/knowledge/study-guides/what-is-marxist-feminism/\" target=\"other\">What is Marxist Feminism?</a>, study guide."], "listed_links": [{"https://www.globaljusticecenter.org/sites/default/files/pdfs/dev1.pdf": "Can Development Create Empowerment and Women’s Liberation"}, {"http://basicincome.org": "Basic Income Earth network"}, {"https://www.uml.edu/research/cww/": "Center for Women and Work"}, {"http://www.cluw.org/": "Coalition of Labor Union Women"}, {"https://combaheerivercollective.weebly.com/the-combahee-river-collective-statement.html": "Combahee River Collective"}, {"http://www.ohchr.org/EN/HRBodies/CEDAW/Pages/CEDAWIndex.aspx": "Committee on the Elimination of Discrimination against Women"}, {"http://inthemiddleofthewhirlwind.wordpress.com/precarious-labor-a-feminist-viewpoint/": "Precarious Labor: A Feminist Viewpoint"}, {"http://www.iwpr.org": "Institute for Women’s Policy Research"}, {"http://www.bayswan.org/orgs.html": "Sex Worker Rights Organizations and Projects around the World"}, {"https://www.perlego.com/knowledge/study-guides/what-is-marxist-feminism/": "What is Marxist Feminism?"}]}, "tokenized_text": ["1", "marxism", "work", "human", "nature", "marxism", "philosophy", "human", "nature", "stress", "centrality", "work", "creation", "human", "nature", "human", "selfunderstanding", "changing", "historical", "relation", "human", "work", "nature", "relation", "human", "production", "distribution", "good", "meet", "material", "need", "construct", "human", "nature", "differently", "different", "historical", "period", "nomadic", "human", "different", "agrarian", "industrial", "human", "marxism", "philosophy", "history", "social", "change", "highlight", "social", "relation", "work", "different", "economic", "mode", "production", "analysis", "social", "inequality", "exploitation", "including", "relation", "domination", "racism", "sexism", "marx", "1844", "1950", "19069", "marx", "engels", "1848", "1850", "engels", "1942", "within", "capitalism", "system", "analyzed", "logic", "profit", "drive", "bourgeois", "class", "developing", "productive", "force", "land", "labor", "capital", "expanding", "market", "turning", "land", "commodity", "forcing", "working", "class", "feudal", "independent", "agrarian", "production", "wage", "labor", "marx", "engels", "argue", "turning", "labor", "commodity", "bought", "sold", "alienates", "worker", "taking", "power", "production", "away", "also", "collectivizes", "worker", "factory", "mass", "assembly", "line", "provides", "opportunity", "worker", "unite", "capitalist", "demand", "collectivization", "property", "ie", "socialism", "communism", "according", "engels", "famous", "analysis", "woman", "situation", "history", "different", "economic", "mode", "production", "origin", "family", "private", "property", "state", "1942", "woman", "originally", "equal", "powerful", "men", "communal", "form", "production", "matrilineal", "family", "organization", "woman", "lose", "power", "private", "property", "come", "existence", "mode", "production", "men", "control", "private", "property", "ability", "thereby", "generate", "surplus", "change", "family", "form", "patriarchal", "one", "woman", "often", "slave", "1", "become", "property", "father", "husband", "rise", "capitalism", "separating", "family", "household", "commodity", "production", "solidifies", "control", "men", "woman", "family", "latter", "become", "economic", "dependent", "former", "male", "breadwinnerfemale", "housewife", "nuclear", "family", "form", "importantly", "capitalism", "also", "creates", "possibility", "woman", "liberation", "familybased", "patriarchy", "creating", "possibility", "woman", "work", "wage", "labor", "become", "economically", "independent", "husband", "father", "engels", "stress", "however", "problem", "unpaid", "housework", "private", "task", "allocated", "woman", "sexual", "division", "labor", "capitalism", "full", "woman", "liberation", "achieved", "development", "socialism", "socialization", "housework", "childrearing", "social", "service", "provided", "state", "reason", "contemporary", "marxist", "argued", "woman", "liberation", "requires", "feminist", "join", "working", "class", "struggle", "capitalism", "cliff", "1984", "2", "marxistfeminist", "analysis", "many", "marxistfeminists", "thinker", "prominent", "among", "sociologist", "anthropologist", "done", "crosscultural", "historical", "study", "earlier", "form", "kinship", "economy", "role", "sexual", "gender", "division", "labor", "supporting", "undermining", "woman", "social", "power", "cf", "reed", "1973", "leacock", "1972", "rosaldo", "lamphere", "1974", "also", "attempted", "ass", "world", "economic", "development", "capitalism", "contradictory", "force", "liberation", "woman", "federici", "2004", "mies", "1986", "saffioti", "1978", "argue", "universal", "woman", "liberation", "requires", "attention", "worse", "poor", "woman", "worker", "poor", "postcolonial", "country", "sen", "grown", "1987", "feminist", "anthropologist", "argued", "variable", "addition", "woman", "role", "production", "key", "understanding", "woman", "social", "status", "power", "sanday", "1981", "leghorn", "parker", "1981", "yet", "feminist", "economic", "historian", "done", "historical", "study", "way", "race", "class", "ethnicity", "situated", "woman", "differently", "relation", "production", "example", "history", "united", "state", "davis", "1983", "amott", "matthaei", "1991", "finally", "marxistfeminists", "argued", "woman", "work", "biological", "social", "reproduction", "necessary", "element", "mode", "production", "one", "often", "ignored", "marxist", "economist", "benston", "1969", "hennessy", "2003", "vogel", "1995", "3", "first", "wave", "feminist", "analysis", "woman", "work", "feminist", "analysis", "highlighted", "role", "woman", "work", "social", "construction", "gender", "perpetuation", "male", "dominance", "termed", "liberal", "radical", "marxist", "socialist", "feminism", "influential", "categorizers", "jaggar", "rothenberg", "struhl", "1978", "tong", "2000", "barrett", "1980", "jaggar", "1983", "walby", "1990", "2", "however", "pigeonhole", "category", "liberal", "radical", "marxist", "socialist", "category", "apply", "poorly", "first", "wave", "woman", "movement", "feminist", "predecessor", "contemporary", "deconstructionist", "poststructuralist", "postcolonialist", "perspective", "number", "first", "wave", "feminist", "write", "work", "class", "key", "issue", "woman", "liberation", "socialistfeminist", "charlotte", "perkins", "gilman", "heavily", "influenced", "darwinism", "19th", "century", "utopian", "modernism", "gilman", "1898", "1910", "1979", "anarchist", "emma", "goldman", "1969", "existentialist", "radical", "feminist", "marxist", "sort", "simone", "de", "beauvoir", "1952", "debate", "arose", "around", "place", "woman", "movement", "class", "politics", "different", "early", "midtwentieth", "century", "1960s", "many", "feminist", "theorist", "trying", "define", "independently", "left", "antivietnam", "war", "civil", "right", "movement", "time", "debate", "economic", "social", "function", "housework", "relation", "woman", "oppression", "old", "one", "feature", "first", "second", "wave", "woman", "movement", "u", "britain", "europe", "era", "underlying", "issue", "handle", "publicprivate", "split", "capitalist", "society", "woman", "reproductive", "function", "either", "limited", "work", "home", "created", "second", "shift", "problem", "unpaid", "housework", "childcare", "well", "waged", "work", "first", "wave", "located", "victorian", "period", "dominant", "ideology", "middle", "upper", "class", "woman", "purity", "piety", "domesticity", "also", "called", "cult", "true", "womanhood", "debate", "centered", "whether", "keep", "housework", "private", "sphere", "yet", "make", "scientific", "efficient", "beecher", "1841", "richards", "1915", "whether", "socialize", "bringing", "public", "sphere", "socialist", "charlotte", "perkins", "gilman", "advocated", "1898", "u", "public", "housekeeping", "aspect", "progressive", "movement", "1890s", "early", "1900s", "advocated", "woman", "bring", "positive", "value", "associated", "motherhood", "public", "sphere", "obtaining", "vote", "cleaning", "corruption", "politics", "creating", "settlement", "house", "educate", "support", "immigrant", "forming", "woman", "peace", "movement", "etc", "cf", "jane", "addams", "1914", "disagreement", "whether", "downplay", "valorize", "distinctive", "function", "skill", "motherhood", "work", "woman", "naturally", "superior", "see", "motherhood", "restricting", "woman", "chance", "economic", "independence", "equality", "men", "public", "sphere", "also", "evident", "debate", "ellen", "key", "1909", "1914", "gilman", "key", "represented", "difference", "side", "woman", "superior", "human", "mothering", "gilman", "goldman", "took", "equality", "side", "debate", "woman", "restricted", "made", "socially", "unequal", "men", "unpaid", "housework", "mothering", "3", "4", "second", "wave", "feminist", "analysis", "housework", "second", "wave", "movement", "theorist", "grouped", "theory", "housework", "oppresses", "woman", "typically", "liberal", "feminist", "critique", "housework", "unpaid", "make", "woman", "dependent", "men", "devalued", "since", "work", "outside", "meaningful", "sphere", "public", "economic", "production", "friedan", "1963", "marxist", "feminist", "theorist", "see", "part", "problem", "go", "maintain", "housework", "part", "household", "feudal", "mode", "production", "good", "use", "persists", "capitalism", "give", "men", "feudal", "power", "woman", "work", "benston", "1969", "fox", "1980", "marxist", "feminist", "argue", "woman", "housework", "part", "social", "reproduction", "capitalism", "federici", "1975", "2004", "malos", "1975", "vogel", "1995", "necessary", "work", "reproducing", "working", "class", "unpaid", "allows", "profit", "capitalist", "sexual", "division", "labor", "productive", "reproductive", "work", "make", "woman", "unequal", "men", "allows", "capitalist", "exploit", "woman", "unpaid", "labor", "even", "make", "analysis", "basis", "demand", "wage", "housework", "dalla", "costa", "1974", "federici", "1975", "recently", "federici", "done", "analysis", "transition", "capitalism", "europe", "argues", "emerging", "capitalist", "class", "need", "control", "working", "class", "reproduction", "eliminate", "working", "class", "woman", "control", "biological", "reproduction", "assure", "unpaid", "reproductive", "work", "home", "restricting", "abortion", "fueled", "campaign", "witch", "period", "federici", "2004", "one", "philosophical", "problem", "raised", "housework", "debate", "draw", "line", "work", "play", "leisure", "activity", "activity", "paid", "mother", "playing", "baby", "working", "engaged", "play", "former", "hour", "activity", "may", "compared", "husband", "partner", "see", "exploitation", "relation", "present", "example", "total", "hour", "productive", "reproductive", "work", "family", "le", "cf", "delphy", "1984", "extent", "childrearing", "count", "leisure", "activity", "play", "activity", "held", "intrinsically", "valuable", "ferguson", "2004", "exploitation", "involved", "perhaps", "childrearing", "caring", "activity", "work", "play", "portion", "necessary", "psychological", "growth", "child", "worker", "count", "work", "determines", "line", "crossed", "since", "nonmarket", "activity", "clear", "criterion", "distinguish", "work", "nonwork", "necessary", "nonnecessary", "social", "labor", "arbitrary", "element", "seems", "creep", "make", "standard", "fairness", "difficult", "apply", "gendered", "household", "bargain", "men", "woman", "dividing", "waged", "nonwaged", "work", "barrett", "1980", "one", "solution", "problem", "simply", "take", "household", "activity", "could", "also", "done", "waged", "labor", "nanny", "domestic", "servant", "gardener", "chauffeur", "etc", "work", "figure", "comparable", "worth", "waged", "labor", "necessary", "replace", "folbre", "1982", "1983", "another", "reject", "altogether", "attempt", "base", "woman", "oppression", "social", "relation", "work", "ground", "theory", "overly", "generalizing", "ignore", "discrete", "meaning", "kinship", "activity", "woman", "different", "context", "nicholson", "1991", "fraser", "nicholson", "1991", "marchand", "1995", "one", "argue", "although", "line", "work", "leisure", "change", "historically", "activity", "decisive", "say", "whether", "activity", "count", "work", "ie", "labor", "necessary", "promote", "human", "welfare", "existence", "second", "wave", "woman", "movement", "critique", "second", "shift", "unpaid", "household", "activity", "indicates", "growing", "number", "woman", "see", "work", "play", "cf", "hochschild", "1989", "finally", "one", "argue", "since", "human", "care", "involved", "taking", "care", "child", "elder", "creates", "public", "good", "clearly", "characterized", "work", "caretaker", "primarily", "woman", "fairly", "compensated", "society", "state", "ferguson", "folbre", "2000", "folbre", "2000", "ferguson", "2004", "5", "publicprivate", "split", "implication", "liberal", "marxist", "radical", "feminist", "characterized", "woman", "doubly", "alienated", "capitalism", "publicprivate", "split", "relegates", "work", "mother", "houseworkers", "home", "psychologically", "denies", "full", "personhood", "citizenship", "human", "right", "foreman", "1974", "okin", "1989", "pateman", "1988", "goldman", "1969", "noting", "woman", "worker", "average", "70", "average", "salary", "men", "contemporary", "us", "feminist", "claimed", "woman", "work", "tied", "stereotypically", "housework", "hence", "thought", "unskilled", "undervalued", "whether", "cleaning", "rote", "service", "work", "nurturing", "work", "thought", "connected", "natural", "maternal", "motivation", "aptitude", "hence", "feminist", "organized", "campaign", "comparable", "worth", "raise", "woman", "wage", "men", "wage", "involving", "comparable", "skill", "brenner", "2000", "cf", "also", "article", "hansen", "philipson", "ed", "1990", "many", "radical", "feminist", "maintain", "woman", "work", "part", "separate", "patriarchal", "mode", "reproduction", "underlies", "economic", "system", "production", "men", "exploit", "woman", "reproductive", "labor", "delphy", "1984", "brien", "1981", "leghorn", "parker", "1981", "rich", "1980", "mies", "1986", "smith", "1974", "brien", "1981", "hartsock", "1983", "b", "haraway", "1985", "harding", "1986", "pioneered", "combining", "radical", "feminist", "assumption", "perspectival", "marxist", "theory", "knowledge", "argue", "one", "relation", "work", "production", "reproduction", "gave", "gender", "social", "class", "different", "way", "knowing", "social", "totality", "woman", "work", "argued", "tie", "nature", "human", "need", "different", "way", "men", "work", "creates", "possibility", "le", "alienated", "comprehensive", "understanding", "working", "social", "totality", "patricia", "hill", "collins", "argues", "racial", "division", "labor", "institutional", "racism", "different", "family", "structure", "put", "african", "american", "woman", "yet", "different", "epistemic", "relation", "society", "white", "woman", "2000", "writing", "postmodernist", "rearticulation", "feminist", "standpoint", "theory", "donna", "haraway", "argues", "breakdown", "natureculture", "distinction", "scientific", "technology", "alteration", "human", "body", "make", "u", "cyborg", "hence", "perspective", "intersectional", "unified", "simply", "common", "relation", "work", "required", "feminist", "politics", "situated", "identity", "politics", "whether", "gender", "andor", "race", "andor", "class", "affinity", "politics", "based", "alliance", "coalition", "combine", "epistemic", "perspective", "haraway", "1985", "like", "radical", "feminist", "socialistfeminists", "tried", "develop", "dual", "system", "theory", "cf", "young", "1981", "involves", "theorizing", "separate", "system", "work", "relation", "organizes", "directs", "human", "sexuality", "nurturance", "affection", "biological", "reproduction", "rather", "seeing", "unchanging", "universal", "base", "patriarchy", "however", "argued", "system", "thought", "sexgender", "system", "rubin", "1975", "hartmann", "1978", "1981a", "b", "sexaffective", "production", "ferguson", "1989", "1991", "ferguson", "folbre", "1981", "different", "historical", "mode", "marx", "argued", "economy", "rubin", "argues", "sexgender", "system", "based", "different", "kinship", "arrangement", "supported", "exchange", "woman", "men", "marriage", "hence", "supported", "male", "domination", "compulsory", "heterosexuality", "hopeful", "since", "capitalism", "shifted", "organization", "economy", "kinship", "commodity", "production", "power", "father", "husband", "daughter", "wife", "ability", "enforce", "heterosexuality", "continue", "decline", "woman", "increasing", "ability", "economically", "independent", "lead", "woman", "liberation", "equality", "men", "different", "historical", "twist", "hartmann", "argues", "historical", "bargain", "cemented", "capitalist", "working", "class", "male", "patriarch", "shore", "patriarchal", "privilege", "weakened", "entrance", "woman", "wage", "labor", "19th", "century", "creation", "family", "wage", "allow", "men", "sufficient", "wage", "support", "nonwageearning", "wife", "child", "home", "1981a", "ferguson", "folbre", "1981", "agree", "inevitable", "fit", "capitalism", "patriarchy", "argue", "conflict", "family", "wage", "bargain", "broken", "present", "indeed", "ferguson", "smart", "1984", "argue", "welfare", "state", "capitalism", "persistent", "sexual", "division", "wage", "labor", "work", "coded", "woman", "paid", "le", "men", "le", "job", "security", "way", "public", "patriarchy", "replaced", "different", "system", "family", "patriarchy", "operating", "early", "precapitalist", "society", "walby", "1990", "similar", "analysis", "connection", "form", "capitalism", "form", "patriarchy", "functional", "le", "accidental", "appears", "ferguson", "smart", "walby", "argues", "two", "different", "basic", "form", "patriarchy", "emerge", "response", "tension", "capitalist", "economy", "patriarchal", "household", "economy", "private", "public", "patriarchy", "private", "patriarchy", "form", "marked", "excluding", "woman", "economic", "political", "power", "public", "patriarchy", "work", "segregating", "woman", "semiautomatic", "readjustment", "dual", "system", "older", "private", "father", "patriarchy", "based", "patriarchal", "family", "broken", "due", "pressure", "early", "industrial", "capitalism", "family", "wage", "woman", "second", "class", "citizenship", "marked", "initial", "readjustment", "functionally", "replaced", "public", "form", "patriarchy", "patriarchal", "welfare", "state", "woman", "enter", "wage", "labor", "force", "permanently", "segregated", "le", "well", "paid", "job", "ferguson", "19891991", "smart", "1984", "folbre", "1994", "suggest", "although", "patriarchal", "control", "father", "husband", "wife", "child", "economic", "asset", "diminished", "advanced", "capitalism", "always", "dialectical", "contradictory", "tension", "patriarchy", "capitalism", "advance", "retreat", "woman", "equality", "citizen", "work", "relation", "constantly", "occurring", "new", "form", "public", "patriarchy", "thus", "new", "marriage", "patriarchal", "capitalism", "operates", "relegate", "woman", "unpaid", "lesser", "paid", "caring", "labor", "whether", "household", "wage", "labor", "thus", "keeping", "woman", "large", "unequal", "men", "especially", "notable", "rise", "poor", "singlemotherheaded", "family", "however", "force", "woman", "wage", "labor", "woman", "given", "opportunity", "independence", "men", "possibility", "challenge", "male", "dominance", "sex", "segregation", "sphere", "social", "life", "example", "rise", "first", "second", "wave", "woman", "movement", "consequent", "gain", "civil", "right", "woman", "work", "feminist", "sociologist", "dorothy", "smith", "1989", "notable", "intervention", "publicprivate", "split", "bringing", "view", "institution", "power", "regime", "regulate", "everyday", "world", "gender", "subtext", "basis", "gendered", "division", "labor", "legal", "feminist", "critic", "expand", "biopolitics", "patriarchal", "welfare", "state", "psychiatrizes", "threatens", "mother", "loss", "child", "custody", "represents", "new", "eugenics", "twist", "enduring", "mistrust", "workingclass", "mother", "casting", "imprisoned", "undeserving", "parent", "guggenheim", "2007", "law", "2012", "african", "american", "mother", "bear", "brunt", "punitive", "racist", "family", "criminal", "law", "robert", "2022", "thompson", "2010", "solinger", "et", "al", "2010", "6", "psychological", "theory", "woman", "work", "socialistfeminist", "idea", "two", "interlocking", "system", "structure", "gender", "economy", "thus", "jointly", "responsible", "male", "domination", "developed", "psychological", "direction", "psychoanalytic", "school", "feminist", "theorist", "particularly", "relevant", "question", "woman", "work", "theory", "mitchell", "1972", "1974", "kuhn", "wolpe", "1978", "chodorow", "1978", "1979", "1982", "ruddick", "1989", "mothering", "taking", "care", "baby", "small", "child", "type", "work", "done", "overwhelmingly", "woman", "socializes", "woman", "men", "different", "identity", "personality", "skill", "first", "work", "1972", "mitchell", "argues", "woman", "different", "relation", "productive", "work", "reproduction", "socialization", "child", "sexuality", "patriarchy", "give", "lesser", "economic", "psychological", "power", "relation", "men", "freudian", "vein", "mitchell", "later", "argues", "1974", "woman", "learn", "full", "symbolic", "subject", "compulsory", "heterosexuality", "incest", "taboo", "bar", "meeting", "either", "desire", "mother", "woman", "chodorow", "also", "reading", "freud", "feminist", "perspective", "suggests", "woman", "predominance", "mothering", "work", "basis", "learned", "gender", "distinction", "woman", "men", "sexual", "division", "infant", "care", "give", "boy", "must", "learn", "masculine", "identity", "separating", "mother", "feminine", "motive", "deprecating", "well", "dominating", "woman", "ruddick", "aristotelian", "perspective", "suggests", "skill", "virtue", "required", "practice", "mothering", "work", "socially", "construct", "feminine", "gender", "differently", "men", "could", "ground", "alternative", "vision", "peace", "resolving", "human", "conflict", "peace", "movement", "led", "woman", "ferguson", "argues", "sexaffective", "work", "mothering", "wifely", "nurturing", "exploitative", "woman", "woman", "give", "nurturance", "satisfaction", "including", "sexual", "satisfaction", "men", "child", "receive", "much", "work", "providing", "important", "human", "good", "cf", "also", "bartky", "1990", "gendered", "division", "labor", "economic", "psychological", "consequence", "since", "woman", "caring", "labor", "creates", "woman", "le", "capable", "motivated", "separate", "others", "hence", "le", "likely", "protest", "gender", "exploitation", "ferguson", "1989", "1991", "folbre", "argues", "contrast", "woman", "bargaining", "power", "le", "men", "power", "relation", "involved", "gender", "division", "labor", "property", "woman", "acquiesce", "inequality", "folbre", "1982", "ferguson", "argues", "gendered", "exploitation", "system", "meeting", "human", "need", "suggests", "woman", "seen", "sex", "class", "gender", "class", "cut", "across", "economic", "class", "line", "1979", "1989", "1991", "line", "thought", "also", "developed", "christine", "delphy", "1984", "monique", "wittig", "1980", "luce", "irigaray", "1975", "side", "debate", "brenner", "2000", "argues", "woman", "uniformly", "exploited", "men", "across", "economic", "class", "line", "indeed", "working", "class", "woman", "unpaid", "work", "housewife", "serf", "working", "class", "whole", "whole", "class", "benefit", "daily", "future", "reproduction", "need", "met", "woman", "nurturing", "childcare", "work", "argue", "middle", "upper", "class", "woman", "economic", "privilege", "inevitably", "lead", "betray", "working", "class", "woman", "crossclass", "alliance", "explicitly", "anticapitalist", "hochschild", "2000", "hook", "2000", "point", "career", "woman", "tend", "pay", "working", "class", "woman", "second", "shift", "work", "home", "avoid", "extra", "work", "interest", "keeping", "wage", "eg", "house", "cleaning", "nanny", "low", "possible", "keep", "surplus", "kollias", "1981", "argues", "working", "class", "woman", "stronger", "political", "position", "work", "effectively", "woman", "liberation", "middle", "class", "woman", "mckenny", "1981", "argues", "professional", "woman", "overcome", "myth", "professionalism", "keep", "feeling", "superior", "working", "class", "woman", "hence", "unable", "learn", "work", "social", "change", "7", "ethical", "theory", "woman", "caring", "work", "several", "author", "explored", "ethical", "implication", "sexual", "division", "labor", "primarily", "woman", "caring", "labor", "nancy", "fraser", "1997", "susan", "moller", "okin", "1989", "formulate", "ethical", "argument", "maintain", "model", "society", "would", "restructure", "work", "relation", "unpaid", "underpaid", "caring", "labor", "done", "primarily", "woman", "would", "given", "status", "equivalent", "wage", "labor", "various", "mean", "council", "socialist", "vision", "ferguson", "1989", "1991", "argues", "ideal", "society", "would", "require", "woman", "men", "hitherto", "private", "unpaid", "work", "caring", "sexaffective", "labor", "example", "work", "would", "shared", "men", "either", "family", "andor", "provided", "state", "appropriate", "elder", "child", "childcare", "compensated", "fairly", "family", "allowance", "woman", "men", "major", "share", "housework", "higher", "pay", "caring", "wage", "work", "daycare", "worker", "nurse", "teacher", "carol", "gilligan", "1982", "claim", "woman", "girl", "tend", "use", "different", "form", "ethical", "reasoning", "term", "ethic", "care", "men", "boy", "use", "ethic", "justice", "argued", "different", "ethical", "approach", "due", "woman", "caring", "sensibility", "developed", "sexual", "division", "labor", "ruddick", "1989", "interestingly", "debate", "feminist", "theorist", "justice", "eg", "fraser", "okin", "ethic", "care", "feminist", "gilligan", "ruddick", "le", "substance", "metaethical", "dispute", "whether", "ethic", "concern", "principle", "judgment", "particular", "case", "theorist", "seem", "ideal", "vision", "society", "dovetail", "would", "support", "elimination", "sexual", "division", "labor", "men", "woman", "could", "become", "equally", "sensitized", "particular", "others", "caring", "work", "asha", "bhandary", "2020", "proposes", "integrative", "approach", "enlargening", "rawlsian", "distributive", "justice", "theory", "liberal", "dependency", "care", "taking", "account", "eva", "feder", "kittay", "2019", "1998", "emphasis", "human", "dependency", "bhandary", "argues", "rawls", "framework", "must", "expanded", "include", "caring", "consideration", "part", "basic", "structure", "society", "address", "feminist", "critique", "add", "boy", "must", "taught", "value", "care", "work", "voluntary", "participation", "bhandary", "develops", "arrow", "care", "map", "account", "distributive", "inequality", "race", "class", "etc", "within", "country", "crossculturally", "meaningful", "work", "andrea", "veltman", "2016", "also", "provides", "liberal", "normative", "account", "care", "endorsing", "paul", "gomberg", "2007", "concept", "contributive", "justice", "community", "family", "member", "pull", "together", "voluntarily", "using", "system", "job", "rotation", "rather", "relying", "state", "provision", "good", "contrast", "author", "care", "manifesto", "chatzidakis", "et", "al", "2020", "build", "political", "theorist", "call", "centering", "care", "decentering", "economics", "tronto", "2013", "1993", "universal", "care", "giver", "model", "fraser", "2013", "democratic", "society", "caring", "work", "important", "level", "interpersonal", "care", "also", "macroscopic", "level", "theorising", "caring", "infrastructure", "nature", "overarching", "politics", "care", "grounded", "feminist", "queer", "antiracist", "ecosocialist", "perspective", "chatzidakis", "et", "al", "p", "22", "perspective", "also", "critique", "exploitative", "nature", "transnational", "care", "chain", "global", "north", "upper", "class", "woman", "exploit", "labor", "woman", "girl", "global", "south", "anderson", "2000", "reproductive", "labor", "also", "become", "transactional", "exploitative", "another", "sense", "surrogacy", "arrangement", "global", "biomarkets", "indian", "woman", "carry", "baby", "contractually", "required", "give", "newborn", "term", "dictated", "global", "north", "couple", "may", "include", "selective", "abortion", "pregnancy", "saravanah", "2018", "centering", "care", "common", "theorist", "call", "attention", "politics", "interdependence", "8", "modernist", "vs", "postmodernist", "feminist", "theory", "useful", "anthology", "first", "stage", "second", "wave", "socialist", "feminist", "writing", "include", "discussion", "woman", "class", "work", "psychological", "well", "sociological", "economic", "perspective", "eisenstein", "1979", "hansen", "philipson", "1990", "hennessy", "ingraham", "1997", "holmstrom", "2002", "jaggar", "1983", "wrote", "perhaps", "first", "philosophy", "text", "explaining", "category", "liberal", "radical", "marxist", "socialistfeminist", "thought", "defending", "socialistfeminist", "theory", "male", "domination", "based", "notion", "woman", "alienated", "labor", "others", "jaggar", "rothenberg", "1978", "tuana", "tong", "1995", "herrmann", "stewart", "1993", "include", "classic", "socialist", "feminist", "analysis", "collection", "inviting", "comparison", "author", "others", "grouped", "category", "liberal", "radical", "psychoanalytic", "marxist", "postmodern", "postcolonial", "multicultural", "feminism", "various", "postmodern", "critique", "earlier", "feminist", "school", "thought", "postcolonialism", "well", "deconstruction", "poststructuralism", "challenge", "overgeneralizations", "economic", "reductionism", "many", "constructing", "feminist", "theory", "fall", "early", "category", "liberal", "radical", "marxist", "socialist", "feminism", "cf", "grewal", "kaplan", "1992", "kaplan", "et", "al", "1999", "nicholson", "1991", "fraser", "nicholson", "1991", "hook", "1984", "2000", "anzaldúa", "moraga", "1981", "sandoval", "2000", "others", "argue", "part", "problem", "master", "narrative", "liberalism", "marxism", "first", "see", "domination", "relation", "due", "traditional", "hierarchy", "undermined", "capitalism", "thus", "ignoring", "independent", "effectivity", "racism", "joseph", "1981", "second", "tie", "domination", "relation", "structure", "contemporary", "capitalism", "ignores", "noncapitalist", "economics", "context", "many", "woman", "work", "even", "within", "socalled", "capitalist", "economy", "housework", "voluntary", "community", "work", "gibsongraham", "1996", "spite", "pomo", "critique", "powerful", "thinker", "within", "tendency", "completely", "rejected", "general", "starting", "point", "analysis", "based", "woman", "class", "work", "example", "spivak", "1988", "mohanty", "1997", "carby", "1997", "hennessy", "1993", "2000", "creating", "rearticulating", "form", "marxist", "socialistfeminism", "le", "susceptible", "charge", "overgeneralization", "reductionism", "compatible", "close", "contextual", "analysis", "power", "relation", "gender", "class", "relate", "work", "grouped", "loosely", "tendency", "called", "materialist", "feminism", "incorporates", "method", "deconstruction", "poststructuralism", "hennessy", "1993", "landry", "maclean", "1993", "9", "race", "class", "intersectional", "feminist", "analysis", "many", "contemporary", "feminist", "theory", "debate", "interested", "developing", "concrete", "intersectional", "integrative", "feminist", "analysis", "particular", "issue", "try", "give", "equal", "weight", "gender", "race", "class", "sexuality", "global", "context", "without", "defining", "category", "liberal", "radical", "materialist", "earlier", "feminist", "debate", "category", "cf", "work", "davis", "1983", "brewer", "1995", "crenshaw", "1997", "stanlie", "james", "1997", "anzaldúa", "1999", "hook", "1984", "2000", "nonetheless", "strong", "emphasis", "issue", "race", "ethnicity", "found", "work", "woman", "class", "work", "example", "brewer", "show", "white", "africanamerican", "working", "class", "woman", "divided", "race", "workforce", "even", "change", "occupational", "structure", "historically", "tend", "maintain", "racial", "division", "labor", "hook", "argues", "woman", "color", "radical", "feminist", "sensitive", "class", "race", "issue", "primarily", "white", "feminist", "label", "reformist", "feminist", "hook", "2000", "presupposed", "general", "theoretical", "debate", "concerning", "relation", "gender", "social", "economic", "class", "work", "usually", "definition", "category", "thinker", "would", "argue", "problematic", "example", "tokarczyk", "fay", "excellent", "anthology", "working", "class", "woman", "academy", "1993", "various", "contributor", "discus", "ambiguous", "position", "find", "coming", "poor", "family", "background", "becoming", "academic", "one", "problem", "whether", "still", "member", "working", "class", "whether", "betraying", "family", "origin", "rise", "middle", "class", "status", "another", "whether", "status", "academy", "worker", "thinker", "woman", "men", "woman", "whose", "family", "origin", "middle", "class", "rita", "mae", "brown", "wrote", "early", "article", "arguing", "education", "academic", "status", "automatically", "change", "working", "class", "woman", "identity", "based", "one", "relation", "production", "one", "behavior", "basic", "assumption", "life", "experience", "childhood", "brown", "1974", "joanna", "kadi", "1999", "describes", "cultural", "worker", "tackle", "elitism", "white", "academy", "including", "woman", "study", "course", "tokarczyk", "fay", "acknowledge", "definition", "class", "vague", "us", "rather", "provide", "standard", "philosophical", "definition", "term", "necessary", "sufficient", "condition", "membership", "working", "class", "provide", "cluster", "characteristic", "example", "job", "physically", "demanding", "repetitive", "dangerous", "job", "job", "lack", "autonomy", "generally", "paid", "badly", "example", "working", "class", "job", "give", "cleaning", "woman", "waitress", "lumberjack", "janitor", "police", "officer", "define", "term", "working", "class", "woman", "academic", "include", "woman", "whose", "parent", "job", "first", "generation", "family", "attend", "college", "tokarczyk", "fay", "5", "challenge", "would", "argue", "family", "origin", "overcome", "present", "position", "one", "social", "division", "labor", "simply", "performing", "professional", "job", "earning", "salary", "eradicate", "class", "identity", "formed", "one", "family", "class", "cf", "ferguson", "1979", "recent", "work", "sociolegal", "study", "also", "begun", "question", "limit", "intersectional", "analysis", "grabham", "et", "al", "2009", "acknowledges", "importance", "intersectionality", "term", "coined", "law", "professor", "kimberlé", "crenshaw", "1989", "shed", "light", "epistemic", "injustice", "done", "black", "woman", "antidiscrimination", "law", "yet", "despite", "merit", "overcoming", "dual", "system", "theoretical", "impasse", "joanna", "conaghan", "also", "critique", "essentializing", "tendency", "intersectional", "analysis", "succeeds", "mainly", "dealing", "race", "gender", "oppression", "individual", "level", "little", "offer", "remedy", "structural", "injustice", "furthermore", "method", "identityfocused", "get", "dimension", "class", "traditionally", "thought", "relational", "locational", "term", "2008", "2930", "theorize", "problematic", "relation", "woman", "social", "class", "ferguson", "1979", "1989", "1991", "argues", "least", "three", "different", "variable", "individual", "work", "family", "origin", "present", "household", "economic", "unit", "relate", "individual", "specific", "socioeconomic", "class", "example", "woman", "may", "work", "two", "level", "day", "care", "worker", "working", "class", "also", "member", "household", "housework", "motheringchild", "care", "husband", "wealthy", "contractor", "petit", "bourgeois", "small", "capitalist", "class", "addition", "family", "origin", "professional", "middle", "class", "say", "parent", "college", "educated", "academic", "woman", "may", "seen", "see", "either", "working", "class", "middle", "class", "depending", "whether", "others", "emphasize", "present", "relation", "wage", "work", "individual", "economic", "class", "case", "working", "class", "household", "income", "middle", "class", "family", "origin", "middle", "class", "sylvia", "walby", "deal", "ambiguity", "economic", "class", "applying", "woman", "unpaid", "houseworkers", "claiming", "delphy", "1984", "relevant", "economic", "sex", "class", "housewife", "vs", "husband", "benefiting", "work", "woman", "men", "whether", "receive", "housework", "service", "walby", "1990", "ferguson", "however", "side", "delphy", "putting", "woman", "sex", "class", "since", "woman", "since", "trained", "gender", "role", "patriarchal", "wife", "motherhood", "potentially", "whose", "unpaid", "housework", "exploited", "seeing", "member", "fourth", "class", "category", "sex", "class", "hence", "patriarchal", "capitalist", "system", "seeing", "exploited", "woman", "worker", "wage", "work", "unpaid", "second", "shift", "housework", "4", "thus", "given", "achieved", "social", "identity", "identity", "usually", "formed", "political", "organizing", "coalition", "woman", "place", "employment", "home", "community", "sense", "concept", "sex", "class", "exactly", "analogous", "concept", "feminist", "epistemological", "standpoint", "given", "identity", "perspective", "one", "achievable", "right", "condition", "realizing", "importance", "disjuncture", "economic", "class", "sex", "class", "woman", "maxine", "molyneux", "1984", "argues", "often", "cited", "article", "woman", "interest", "abstract", "unify", "woman", "political", "struggle", "instead", "theorizes", "woman", "practical", "gender", "interest", "strategic", "gender", "interests", "practical", "gender", "interest", "woman", "develop", "sexual", "division", "labor", "make", "responsible", "nurturant", "work", "sustaining", "physical", "psychological", "wellbeing", "child", "partner", "relative", "caring", "labor", "practical", "gender", "interest", "tie", "woman", "conception", "interest", "woman", "family", "support", "woman", "popular", "movement", "food", "water", "child", "health", "care", "even", "defense", "state", "violence", "ally", "economic", "class", "interest", "family", "strategic", "gender", "interest", "contrary", "may", "ally", "woman", "across", "otherwise", "divided", "economic", "class", "interest", "since", "like", "right", "physical", "male", "violence", "reproductive", "right", "woman", "sex", "class", "eliminate", "male", "domination", "molyneux", "used", "distinction", "practical", "strategic", "gender", "interest", "distinguish", "popular", "woman", "movement", "nicaragua", "based", "demand", "economic", "justice", "worker", "farmer", "owning", "class", "demand", "education", "health", "maternity", "care", "clean", "water", "food", "housing", "feminist", "movement", "emphasized", "fight", "legal", "abortion", "father", "obligation", "pay", "child", "support", "single", "mother", "right", "rape", "domestic", "violence", "others", "used", "distinction", "practical", "strategic", "gender", "interest", "characterize", "tension", "popular", "woman", "movement", "feminist", "movement", "latin", "america", "molyneux", "2001", "alvarez", "1998", "foweraker", "1998", "similar", "distinction", "different", "type", "woman", "interest", "developed", "critique", "interest", "group", "paradigm", "politics", "anna", "jónasdóttir", "1988", "1994", "jónasdóttir", "argues", "woman", "common", "formal", "interest", "vote", "woman", "woman", "political", "caucus", "gender", "parity", "demand", "mechanism", "allow", "woman", "way", "develop", "collective", "political", "voice", "even", "though", "content", "interest", "specific", "need", "priority", "may", "vary", "race", "economic", "class", "among", "others", "distinction", "molyneux", "changed", "slightly", "practical", "vs", "strategic", "gender", "need", "rather", "interest", "compare", "contrast", "different", "paradigm", "economic", "development", "world", "bank", "feminist", "theorist", "carolyn", "moser", "1993", "recently", "jónasdóttir", "distinction", "used", "mohanty", "1997", "defend", "maintain", "spite", "postmodernists", "emphasis", "intersectional", "difference", "commonality", "woman", "gendered", "work", "create", "crossclass", "base", "demanding", "collective", "political", "voice", "woman", "transnational", "feminism", "creates", "demand", "woman", "political", "representation", "developing", "platform", "woman", "human", "right", "woman", "worker", "nonetheless", "tension", "woman", "economic", "classbased", "interest", "need", "visionarystrategic", "gender", "interest", "need", "still", "always", "present", "must", "therefore", "always", "negotiated", "concretely", "popular", "movement", "social", "justice", "involving", "woman", "issue", "another", "approach", "problematic", "nature", "socioeconomic", "class", "relates", "woman", "empirical", "study", "show", "class", "distinction", "still", "important", "woman", "daily", "life", "way", "compare", "contrast", "woman", "men", "even", "use", "concept", "working", "class", "professional", "class", "capitalist", "class", "many", "pointed", "concept", "class", "mystified", "us", "context", "nonetheless", "class", "distinction", "still", "operate", "different", "structural", "economic", "constraint", "act", "differently", "others", "ehrenreichs", "1979", "classic", "article", "argue", "mystification", "due", "emergence", "professionalmanagerial", "class", "interest", "common", "capitalist", "class", "working", "class", "whatever", "cause", "empirical", "study", "show", "class", "distinction", "still", "operate", "woman", "albeit", "indirect", "way", "barbara", "ehrenreich", "2001", "adopting", "material", "life", "condition", "poor", "woman", "empirical", "study", "life", "woman", "working", "minimum", "wage", "found", "issue", "quite", "different", "ignored", "middle", "upperclass", "woman", "diane", "reay", "2004", "empirical", "study", "woman", "manual", "labor", "family", "background", "relation", "schooling", "child", "discovers", "use", "discourse", "acknowledges", "class", "difference", "educational", "access", "career", "possibility", "even", "though", "specifically", "define", "class", "per", "se", "similarly", "julie", "bettie", "2000", "impressive", "discourse", "analysis", "way", "latina", "high", "school", "student", "create", "class", "distinction", "concept", "chicas", "cholas", "trash", "refer", "peer", "category", "pick", "girl", "middle", "class", "working", "class", "poor", "aspiration", "performance", "indicator", "dress", "speech", "territorial", "hangouts", "school", "achievement", "never", "mentioning", "class", "name", "woman", "experience", "growing", "working", "class", "presented", "anthology", "edited", "tea", "2003", "drawing", "socialist", "feminist", "framework", "margaret", "mclaren", "2019", "offer", "ethnographic", "study", "crossborder", "feminist", "solidarity", "focus", "sewa", "largest", "woman", "union", "world", "700000", "member", "cooperative", "bank", "indian", "organization", "selfemployed", "woman", "tie", "sister", "organization", "south", "africa", "build", "global", "grassroots", "trading", "network", "addition", "fostering", "crosscultural", "dialogue", "peacebuilding", "utilizing", "traditional", "gendered", "expectation", "married", "woman", "leave", "home", "work", "womenonly", "group", "artisan", "organize", "beyond", "workplace", "public", "health", "sewage", "treatment", "social", "justice", "issue", "violence", "prevention", "cooperative", "also", "forge", "tie", "global", "north", "consumer", "showcase", "possibility", "transnational", "feminist", "organizing", "face", "neoliberalist", "finance", "resource", "extraction", "10", "anarchist", "perspective", "work", "far", "assumed", "work", "intrinsic", "good", "waged", "unwaged", "work", "considered", "problematic", "oppressive", "autonomous", "marxist", "contest", "liberal", "socialist", "feminist", "perspective", "unnecessarily", "mystified", "work", "operated", "moralism", "autonomists", "associated", "operaismo", "postoperaismo", "autonomia", "movement", "midnight", "note", "collective", "zerowork", "lotta", "feminista", "wage", "housework", "movement", "week", "2011", "241", "whether", "one", "ought", "paid", "housework", "reproductive", "labor", "seek", "equal", "employment", "opportunity", "feminist", "sufficiently", "opposed", "sanctification", "work", "championing", "refusal", "work", "mean", "abandon", "narrow", "focus", "critique", "extraction", "surplus", "value", "process", "deskilling", "furthermore", "imperative", "interrogate", "work", "dominates", "life", "week", "2011", "13", "kathi", "week", "charge", "productivist", "bias", "common", "feminist", "marxist", "analysis", "credo", "autonomists", "liberation", "work", "contradistinction", "marxist", "humanist", "erich", "fromm", "advocacy", "liberation", "work", "wage", "housework", "campaign", "demanded", "purposefully", "impossible", "feminist", "ask", "compensation", "unpaid", "domestic", "labor", "also", "postulated", "end", "work", "federici", "1975", "postwork", "also", "mean", "postdomestic", "care", "something", "get", "lost", "ethic", "care", "analysis", "inadvertently", "foster", "romantic", "attachment", "endowing", "meaning", "work", "furthermore", "postwork", "also", "appeal", "carving", "space", "queer", "time", "queer", "resistant", "agency", "halberstam", "2005", "lehr", "1999", "appeal", "unscripted", "life", "wholesale", "critique", "housework", "easily", "understood", "even", "arlie", "hochschild", "1997", "analysis", "ethnographic", "study", "diverse", "family", "practice", "come", "conclusion", "authentic", "housework", "sanctified", "set", "apart", "mere", "alienating", "factory", "production", "week", "2011", "15759", "postwork", "ethic", "entail", "playful", "commitment", "leisure", "unstructured", "activity", "daydreaming", "joseph", "trullinger", "2016", "extends", "kathi", "week", "analysis", "drawing", "marcuse", "concept", "great", "refusal", "playful", "labor", "defying", "commodity", "fetishism", "productivism", "ignoring", "liberatory", "power", "play", "week", "insufficiently", "engages", "meaning", "work", "asceticism", "work", "ethic", "trullinger", "2016", "469", "still", "danger", "play", "morphing", "unpaid", "labor", "real", "evinced", "social", "medium", "corporate", "giant", "facebook", "exploiting", "playlabor", "capitalist", "gain", "fuchs", "2016", "corporate", "feminism", "may", "ask", "u", "lean", "sandberg", "2013", "rather", "lean", "out", "11", "punitive", "perspective", "work", "nonwork", "reasonable", "champion", "daydream", "play", "intrinsic", "good", "idle", "time", "often", "felt", "good", "luxury", "instead", "psychic", "imposition", "one", "speaks", "time", "one", "sentenced", "prison", "term", "worse", "death", "row", "moses", "2007", "imprisonment", "anathema", "indigenous", "sociocentric", "people", "global", "south", "imprisonment", "closely", "connected", "disciplinary", "apparatus", "western", "colonization", "america", "africa", "nagel", "2007", "birth", "western", "modern", "prison", "focused", "selfdiscipline", "known", "separate", "system", "philadelphia", "pa", "leading", "enforced", "isolation", "separate", "celling", "daydreaming", "solitary", "cell", "becomes", "positively", "dangerous", "suicide", "mental", "illness", "increase", "exponentially", "casella", "et", "al", "2016", "idle", "time", "thus", "countered", "another", "prison", "regime", "auburn", "ny", "factory", "system", "also", "known", "silent", "system", "prisoner", "worked", "factory", "forbidden", "talk", "notorious", "southern", "us", "convict", "lease", "system", "representing", "shift", "prison", "slavery", "slavery", "prison", "davis", "1998", "black", "female", "male", "prisoner", "toiling", "chain", "gang", "visceral", "legacy", "chattel", "slavery", "slavery", "indentured", "servitude", "codified", "us", "constitution", "turning", "nationstate", "penal", "democracy", "james", "2007", "another", "haunting", "reminder", "chattel", "slavery", "neoliberal", "welfare", "state", "intrusion", "family", "charging", "parent", "poor", "work", "ethic", "neglect", "child", "u", "poor", "child", "color", "especially", "black", "latine", "american", "indian", "living", "reservation", "higher", "risk", "taken", "away", "kin", "carers", "turned", "family", "regulation", "system", "goldberg", "2015", "world", "parent", "socially", "displaced", "romanian", "immigrant", "norway", "greater", "scrutiny", "state", "actor", "eg", "child", "protective", "service", "us", "social", "worker", "white", "middle", "class", "protestant", "work", "ideology", "enforced", "paradoxically", "workingclass", "mother", "stigmatized", "woman", "summoned", "comply", "social", "programming", "penal", "version", "cult", "domesticity", "thus", "effectively", "forced", "paid", "job", "made", "dependent", "good", "social", "worker", "family", "court", "judge", "may", "grant", "access", "childsupervised", "visit", "parent", "charged", "child", "abuse", "andor", "neglect", "thus", "unable", "pursue", "education", "job", "often", "creating", "intergenerational", "cycle", "violence", "poverty", "nagel", "2018", "ideological", "term", "coded", "welfare", "dependency", "racialized", "controlling", "image", "thus", "stereotyping", "young", "black", "mother", "fraser", "gordon", "1994", "hill", "collins", "2000", "response", "national", "welfare", "right", "organization", "created", "destigmatize", "welfare", "postulating", "human", "right", "toney", "2000", "also", "demanding", "basic", "income", "alternative", "punitive", "welfare", "week", "2011", "138", "proposal", "universal", "basic", "income", "gained", "traction", "recent", "year", "chatzidakis", "et", "al", "2020", "migrant", "worker", "workermothers", "serve", "domestic", "worker", "also", "risk", "deportation", "andor", "imprisonment", "facing", "frivolous", "neglect", "charge", "simply", "lacking", "proper", "visa", "status", "gendered", "moral", "economy", "operate", "across", "national", "racial", "geographic", "border", "enforcing", "domestic", "domesticating", "patriarchal", "ideology", "determining", "good", "victim", "deserves", "rescued", "keogh", "2015", "nagel", "2013", "gutiérrez", "rodríguez", "2010", "grewal", "kaplan", "1992", "kaplan", "et", "al", "1999", "stigmatized", "work", "erotic", "labor", "sex", "work", "divided", "feminist", "two", "camp", "support", "sex", "worker", "right", "organize", "seek", "labor", "law", "protection", "carceral", "feminist", "advocate", "rescuing", "woman", "trafficked", "sex", "work", "bernstein", "2007", "nagel", "2015", "sex", "worker", "right", "approach", "focus", "eschewing", "moralizing", "rallying", "cry", "choice", "versus", "coercion", "seek", "destigmatize", "labor", "offer", "postcolonial", "critique", "prohibitionist", "ideology", "kempadoo", "doezema", "1995", "others", "also", "focus", "lived", "experience", "agency", "worker", "contextualize", "life", "within", "structural", "constraint", "feminization", "poverty", "dewey", "2010", "zheng", "2009", "paradoxically", "focusing", "narrowly", "incomegenerating", "activity", "dewey", "2010", "content", "advocate", "actually", "reinscribe", "stigmatization", "sex", "worker", "right", "organization", "coyote", "call", "old", "tired", "ethic", "also", "inadvertently", "endorse", "traditional", "workethic", "ideology", "appealing", "moralizing", "discourse", "respectability", "week", "2011", "pp", "6768", "12", "concluding", "remark", "theoretical", "empirical", "debate", "relation", "woman", "class", "work", "implication", "relation", "theory", "male", "domination", "woman", "oppression", "well", "system", "social", "domination", "continue", "important", "source", "theory", "investigation", "gender", "identity", "role", "power", "field", "woman", "gender", "study", "well", "history", "sociology", "anthropology", "economics", "also", "important", "implication", "epistemology", "metaphysics", "political", "theory", "discipline", "philosophy", "consequently", "discipline", "humanity", "social", "science"]}