{"url": "history", "title": "Philosophy of History", "authorship": {"year": "Copyright © 2020", "author_text": "Daniel Little\n<delittle@umd.umich.edu>", "author_links": [{"mailto:delittle%40umd%2eumich%2eedu": "delittle@umd.umich.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nDaniel Little\n&lt;<a href=\"mailto:delittle%40umd%2eumich%2eedu\"><em>delittle<abbr title=\" at \">@</abbr>umd<abbr title=\" dot \">.</abbr>umich<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Sun Feb 18, 2007", "substantive revision Tue Nov 24, 2020"], "preamble": "\n\nThe concept of history plays a fundamental role in human thought. It\ninvokes notions of human agency, change, the role of material\ncircumstances in human affairs, and the putative meaning of historical\nevents. It raises the possibility of “learning from\nhistory.” And it suggests the possibility of better\nunderstanding ourselves in the present, by understanding the forces,\nchoices, and circumstances that brought us to our current situation.\nIt is therefore unsurprising that philosophers have sometimes turned\ntheir attention to efforts to examine history itself and the nature of\nhistorical knowledge. These reflections can be grouped together into a\nbody of work called “philosophy of history.” This work is\nheterogeneous, comprising analyses and arguments of idealists,\npositivists, logicians, theologians, and others, and moving back and\nforth over the divides between European and Anglo-American philosophy,\nand between hermeneutics and positivism.\n\nGiven the plurality of voices within the “philosophy of\nhistory,” it is impossible to give one definition of the field\nthat suits all these approaches. In fact, it is misleading to imagine\nthat we refer to a single philosophical tradition when we invoke the\nphrase, “philosophy of history,” because the strands of\nresearch characterized here rarely engage in dialogue with each other.\nStill, we can usefully think of philosophers’ writings about\nhistory as clustering around several large questions, involving\nmetaphysics, hermeneutics, epistemology, and ethics: (1) What does\nhistory consist of—individual actions, social structures,\nperiods and regions, civilizations, large causal processes, divine\nintervention? (2) Does history as a whole have meaning, structure, or\ndirection, beyond the individual events and actions that make it up?\n(3) What is involved in our knowing, representing, and explaining\nhistory? (4) To what extent do facts about human history create moral\nresponsibilities for the present generation?\n", "toc": [{"#HisRep": "1. History and its representation"}, {"#Actors": "1.1 Actors, structures, and causes in history"}, {"#Scale": "1.2 Selectivity and scale in history"}, {"#Memory": "1.3 Memory, history, and narrative"}, {"#ConHis": "2. Continental philosophy of history"}, {"#UniHisHumNat": "2.1 Universal or historical human nature?"}, {"#DoeHisPosDir": "2.2 Does history possess directionality?"}, {"#HegHis": "2.3 Hegel’s philosophy of history"}, {"#HerAppHis": "2.4 Hermeneutic approaches to history"}, {"#ConcHis": "2.5 Conceptual philosophy of history"}, {"#AngAmeHis": "3. Anglo-American philosophy of history"}, {"#GenLawHis": "3.1 General laws in history?"}, {"#HisObj": "3.2 Historical objectivity"}, {"#CauHis": "3.3 Causation in history"}, {"#RecTopHis": "3.4 Recent topics in the philosophy of history"}, {"#HistPhilHis": "4. Historiography and the philosophy of history"}, {"#HistUnde": "5. Historical understanding and the twentieth century"}, {"#RetHis": "6. Ethics, history, and memory"}, {"#Bib": "Bibliography"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. History and its representation\n\nWhat are the intellectual tasks that define the historian’s\nwork? In a sense, this question is best answered on the basis of a\ncareful reading of some good historians. But it will be useful to\noffer several simple answers to this foundational question as a sort\nof conceptual map of the nature of historical knowing.\n\nFirst, historians are interested in providing conceptualizations and\nfactual descriptions of events and circumstances in the past. This\neffort is an answer to questions like these: “What happened?\nWhat was it like? What were some of the circumstances and happenings\nthat took place during this period in the past?” Sometimes this\nmeans simply reconstructing a complicated story from scattered\nhistorical sources—for example, in constructing a narrative of\nthe Spanish Civil War or attempting to sort out the series of events\nthat culminated in the Detroit race riot / uprising of 1967. But\nsometimes it means engaging in substantial conceptual work in order to\narrive at a vocabulary in terms of which to characterize “what\nhappened.” Concerning the disorders of 1967 in Detroit: was this\na riot or an uprising? How did participants and contemporaries think\nabout it?\n\nSecond, historians often want to answer “why” questions:\n“Why did this event occur? What were the conditions and forces\nthat brought it about?” What were the motivations of the\nparticipants? This body of questions invites the historian to provide\nan explanation of the event or pattern he or she describes: the rise\nof fascism in Spain, the collapse of the Ottoman Empire, the\noccurrence of ethnic cleansing in Bosnia in 1992 and later. And\nproviding an explanation requires, most basically, an account of the\ncausal mechanisms, background circumstances, and human choices that\nbrought the outcome about. We explain an historical outcome when we\nidentify the social causes, forces, events, and actions that brought\nit about, or made it more likely.\n\nThird, and related to the previous point, historians are sometimes\ninterested in answering a “how” question: “How did\nthis outcome come to pass? What were the processes through which the\noutcome occurred?” How did the Prussian Army succeed in\ndefeating the superior French Army in 1870? How did the Polish trade\nunion Solidarity manage to bring about the end of Communist rule in\nPoland in 1989? Here the pragmatic interest of the historian’s\naccount derives from the antecedent unlikelihood of the event in\nquestion: how was this outcome possible? This too is an explanation;\nbut it is an answer to a “how possible” question rather\nthan a “why necessary” question.\n\nFourth, often historians are interested in piecing together the human\nmeanings and intentions that underlie a given complex series of\nhistorical actions. They want to help the reader make sense of the\nhistorical events and actions, in terms of the thoughts, motives, and\nstates of mind of the participants. For example: Why did Napoleon III\ncarelessly provoke Prussia into war in 1870? Why did the parties of\nthe far right in Germany gain popular support among German citizens in\nthe 1990s? Why did northern cities in the United States develop such\nmarked patterns of racial segregation after World War II? Answers to\nquestions like these require interpretation of actions, meanings, and\nintentions—of individual actors and of cultures that\ncharacterize whole populations. This aspect of historical thinking is\n“hermeneutic,” interpretive, and ethnographic.\n\nAnd, of course, the historian faces an even more basic intellectual\ntask: that of discovering and making sense of the archival and\nhistorical information that exists about a given event or time in the\npast. Historical data do not speak for themselves; archives are\nincomplete, ambiguous, contradictory, and confusing. The historian\nneeds to interpret individual pieces of evidence, and he or she needs\nto be able to somehow fit the mass of evidence into a coherent and\ntruthful story. Complex events like the Spanish Civil War present the\nhistorian with an ocean of historical traces in repositories and\narchives all over the world; these collections sometimes reflect\nspecific efforts at concealment by the powerful (for example,\nFranco’s efforts to conceal all evidence of mass killings of\nRepublicans after the end of fighting); and the historian’s task\nis to find ways of using this body of evidence to discern some of the\ntruth about the past.\n\nIn short, historians conceptualize, describe, contextualize, explain,\nand interpret events and circumstances of the past. They sketch out\nways of representing the complex activities and events of the past;\nthey explain and interpret significant outcomes; and they base their\nfindings on evidence in the present that bears upon facts about the\npast. Their accounts need to be grounded on the evidence of the\navailable historical record, and their explanations and\ninterpretations require that the historian arrive at hypotheses about\nsocial causes and cultural meanings. Historians can turn to the best\navailable theories in the social and behavioral sciences to arrive at\ntheories about causal mechanisms and human behavior; so historical\nstatements depend ultimately upon factual inquiry and theoretical\nreasoning. Ultimately, the historian’s task is to shed light on\nthe what, why, and how of the past, based on inferences from the\nevidence of the present.\n\nThree preliminary issues are relevant to almost all discussions of\nhistory and the philosophy of history. The first is a set of issues\nhaving to do with the \"ontology\" of history, the kinds of entities,\nprocesses, and events that make up the historical past. This topic\nconcerns the entities, forces, and structures that we postulate in\ndescribing the historical phenomena, whether the medieval manor or the\nWeimar Republic, and the theory we have of how these social entities\ndepend upon the actions of the historical actors who embody them. The\nsecond issue has to do with the problems of selectivity unavoidable\nfor the historian of any period or epoch. Here we take up the question\nof how the unavoidable selectivity of historical inquiry in terms of\ntheme, location, scope, and scale influences the nature of historical\nknowledge. The third issue has to do with the complicated relationship\nthat exists between history, narrative, and collective memory. This\ntopic addresses the point that real human beings make history. And, as\nMarc Bloch insists (1953), we humans are historical beings, we tell\nstories about ourselves, and those stories sometimes themselves have\nmajor historical consequences. The collective memories and identities\nof Serb nationalism were a historical fact in the 1990s, and these\nelements of mythic collective identity led to massive bloodshed,\nethnic cleansing, and murder during the violent breakup of Yugoslavia\n(Judt and Snyder, 2012; Judt, 2006).\n1.1 Actors, structures, and causes in history\n\nAn important problem for the philosophy of history is how to\nconceptualize “history” happenings. What are the \"objects\"\nof which history consists? Are there social structures or systems that\nplay a role in history? Are there causes at work in the historical\nprocess? Or is history simply an concatenation of the actions and\nmental frameworks of myriad individuals, high and low? If both\nstructures and actors are crucial to understanding history, what is\nthe relationship between them?\n\nMarc Bloch (1953) provided a very simple and penetrating definition of\nhistory. History is \"man in time\". By this he meant that history is\nthe product of human action, creativity, invention, conflict, and\ninteraction. Bloch was skeptical about many other categories commonly\nused to analyze history—periods, epochs, civilizations, reigns,\nand centuries. Instead, he advocated for what can be called an\n\"actor-centered\" conception of history. If there are structures and\nsystems in history, they depend upon the beliefs, attitudes, and\nactions of individual actors. If there are causes in history, they\nlikewise depend upon the actions and interactions of human actors\nwithin a setting of humanly created institutions and norms. The task\nof the historian is to reconstruct the meanings, beliefs, values,\npurposes, constraints, and actions that jointly explain the moments of\nhistory, from the meaning of an ancient stele to the causes of the\nrapid defeat of France in 1940.\n\nThis perspective does not diminish the ontological importance of\nstructures, systems, and ideologies in history. It simply forces the\nhistorian, like the social scientist, to be attentive to the problem\nof articulating the relationship that exists between actors and\nstructures. A system of norms, a property system, and a moral ideology\nof feudal loyalty can all be understood as being both objectively\npresent at a time and place, and being ontologically dependent upon\nthe mental frameworks, actions, and relationships of the individual\nactors who make up these systems. This problem has been thoroughly\ndiscussed in the philosophy of social science under the rubric of\n\"ontological individualism\" (Zahle and Collin, 2014). Higher-level\nsocial entities are indeed causally powerful in the social world; and\nthey depend entirely for their causal powers on the characteristics of\nthe individual actors who constitute them. This is the requirement of\nmicrofoundations: extended social structures and causes depend upon\nmicrofoundations at the level of the individuals who constitute them\n(Little 2017). In particular, we need to have some idea about how\nindividuals have been brought to think and act in the ways required by\nthe structures and ideologies in which they function as adults. On\nthis approach, history is the result of the actions and thoughts of\nvast numbers of actors, and institutions, structures, and norms are\nlikewise embodied in the actions and mental frameworks of historically\nsituated individuals. Such an approach helps to inoculate us against\nthe error of reification of historical structures, periods, or forces,\nin favor of a more disaggregated conception of multiple actors and\nshifting conditions of action. This is the conception to which we are\ndrawn when we understand history along the lines proposed by\nBloch.\n\nThis orientation brings along with it the importance of analyzing\nclosely the social and natural environment in which actors frame their\nchoices. A historian’s account of the flow of human action\neventuating in historical change unavoidably needs to take into\naccount the institutional and situational environment in which these\nactions take place. Part of the social environment of a period of\nhistorical change is the ensemble of institutions that exist more or\nless stably in the period: property relations, political institutions,\nfamily structures, educational practices, religious and moral values.\nSo historical explanations need to be sophisticated in their treatment\nof institutions, cultures, and practices. It is an important fact that\na given period in time possesses a fund of scientific and technical\nknowledge, a set of social relationships of power, and a level of\nmaterial productivity. It is also an important fact that knowledge is\nlimited; that coercion exists; and that resources for action are\nlimited. Within these opportunities and limitations, individuals, from\nleaders to ordinary people, make out their lives and ambitions through\naction.\n\nSimilar microfoundational accounts must be given in support of the\nidea of \"causes in history\". Once established, it is reasonably\nstraightforward to see how a social structure such as a property\nsystem or an ideology \"causes\" a historical outcome: by constraining\nthe choices of actors and contributing to their motivations and values\nin the choices they make, a structure or an ideology influences\nhistorically important events like social movements, market crashes,\nor outbreaks of ethnic violence. Structures influence individual\nactors, and individual actors collectively constitute structures. This\napproach gives a basis for judging that such-and-so circumstance\n“caused” a given historical change; but it also provides\nan understanding of the way in which this kind of historical cause is\nembodied and conveyed—through the actions and thoughts of\nindividuals in response to given natural and social circumstances.\n\nAre there large scale causes at work in historical processes?\nHistorians often pose questions like these: “What were some of\nthe causes of the fall of Rome?”, “what were the causes of\nthe rise of fascism?”, or “what were the causes of the\nIndustrial Revolution?”. These kinds of questions presuppose\nthat there were grand causes at work that had grand effects. However,\nit is more plausible to believe that the causes of some very large and\nsignificant historical events are themselves small, granular, gradual,\nand cumulative. If this is the case, then there is no satisfyingly\nsimple and high-level answer to the question, why did Rome fall?\nMoreover, astute historians like Bloch and his contemporaries\nrecognized that there is a very large amount of contingency and path\ndependency in historical change (Pierson, 2004). Historical outcomes\nare not determined by a few large scale causes; instead, multiple\nlocal, contingent, and conjunctural processes and happening jointly\ncome together in the production of the outcome of interest. It is\npossible, for example, that the collapse of the Roman Empire resulted\nfrom a myriad of very different contingencies and organizational\nfeatures in different parts of the empire. A contingent account of the\nfall of Rome might refer to logistical difficulties in supplying\narmies in the German winter, particularly stubborn local resistance in\nPalestine, administrative decay in Roman Britain, population pressure\nin Egypt, and a particularly inept series of commanders in Gaul.\nWithout drama, administrative and military collapse ensues. The best\nwe can do sometimes is to identify a swarm of independent, small-scale\nprocesses and contingencies that eventually produced the large outcome\nof interest.\n\nThis approach might be called \"actor-centered history\": we explain a\nhistorical moment or event when we have an account of what people\nthought and believed; what they wanted; and what social,\ninstitutional, and environmental conditions framed their choices. It\nis a view of history that gives close attention to states of\nknowledge, ideology, and agency, as well as institutions,\norganizations, and structures, and examines the actions and practices\nof individuals as they lived their lives within these constraining and\nenabling circumstances. Further, it emphasizes the contingency and\npath-dependency of history, and it acknowledges the fact of\nheterogeneity of institutions, beliefs, and actions across time and\nplace.\n1.2 Selectivity and scale in history\n\nHistorical research unavoidably requires selectivity in\ndeciding what particular phenomena to emphasize. As Max Weber (1949)\nnotes, there is an infinite depth to historical reality, and therefore\nit is necessary to select a finite representation of the object of\nstudy if we want to approach a problem rigorously. Let us imagine, for\nexample, that a historian is interested in cities and their\ndevelopment over time. This might be pursued as an economic question,\na question of regional geography, a question about cultural change, a\nquestion about poverty and segregation, a question about municipal\ngovernance, or a question about civil disturbances, and so one, for\nindefinitely many aspects of urban life. One generation of historians\nmay be especially interested in cultural topics, while another\ngeneration is preoccupied with the organization of the economy at\nvarious points in history. The two orientations lead to very different\nhistorical representations of the past. Both inquiries lead to true\ndepictions of the cities in question, but their findings and\ninterpretations are very different. Likewise, the historian needs to\nmake choices about location; is he or she interested in the cities of\nBritain, the cities of Europe, or all cities in the world? Further,\nthe historian must consider whether to conduct a comparative\nhistory of cities, examining similarities and differences in the\ndevelopment of Paris and London; or instead restrict attention to a\nsingle case. Simply collecting “historical facts” about\ncities in the past is not a valid mode of historical inquiry. The\nquestion of how historians select and identify their subjects for\nresearch is an important one for the philosophy of history, and it has\ngreat significance for how we think about “knowing the\npast”.\n\nWeber’s essays on methodology (1949) provide insight about these\nquestions. Weber emphasizes the role that the scholar’s\nvalues play in his or her selection of a subject matter and a\nconceptual framework. So it is always open to historians of later\ngenerations to reevaluate prior interpretations of various aspects and\nperiods of history. There is no general or comprehensive approach to\ndefining the historical; there is only the possibility of a series of\nselective and value-guided approaches to defining specific aspects of\nhistory. We are always at liberty to bring forward new perspectives\nand new aspects of the problem, and to arrive at new insights about\nhow the phenomena hang together when characterized in these new ways.\nThis inherent selectivity of historical knowledge does not undermine\nthe objectivity or veridicality of our knowledge; it merely entails\nthat – like mathematics – history is inherently\nincomplete.\n\nDoing history also forces the historian to make choices about the\nscale of the history with which he or she is concerned. Suppose\nwe are interested in Asian history. Are we concerned with Asia as a\ncontinent, including China, India, Cambodia, and Japan, or the whole\nof China during the Ming Dynasty, or Hubei Province? Or if we define\nour interest in terms of a single important historical event like the\nChinese Revolution, are we concerned with the whole of the Chinese\nRevolution, the base area of Yenan, or the specific experience of a\nhandful of villages in Shandong during the 1940s? Given the\nfundamental heterogeneity of social life, the choice of scale makes an\nimportant difference to the findings.\n\nHistorians differ greatly around the decisions they make about scale.\nIt is possible to treat any historical subject at the micro-scale.\nWilliam Hinton provides what is almost a month-to-month description of\nthe Chinese Revolution in Fanshen village—a collection of a few\nhundred families (Hinton 1966). Likewise, Emmanuel Le Roy Ladurie\noffers a deep treatment of the villagers of Montaillou; once again, a\nsingle village and a limited time (Le Roy Ladurie 1979). William\nCronon provides a focused and detailed account of the development of\nChicago as a metropolis for the middle of the United States (Cronon\n1991). These histories are limited in time and space, and they can\nappropriately be called “micro-history.”\n\nMacro-level history is possible as well. William McNeill provides a\nhistory of the world’s diseases (McNeill 1976); Massimo\nLivi-Bacci offers a history of the world’s population\n(Livi-Bacci 2007); and De Vries and Goudsblom provide an environmental\nhistory of the world (De Vries and Goudsblom 2002). In each of these\ncases, the historian has chosen a scale that encompasses virtually the\nwhole of the globe, over millennia of time. These histories can\ncertainly be called “macro-history.”\n\nBoth micro- and macro-histories have important shortcomings.\nMicro-history leaves us with the question, “how does this\nparticular village shed light on anything larger?”.\nMacro-history leaves us with the question, “how do these large\nassertions about the nature of revolution or the importance of class\nconflict in mobilization apply in the context of Canada or\nWarsaw?”. The first threatens to be so particular as to lose all\ninterest, whereas the second threatens to be so general as to lose all\nempirical relevance to real historical processes.\n\nThere is a third choice available to the historian that addresses both\npoints. This is to choose a scale that encompasses enough time and\nspace to be genuinely interesting and important, but not so much as to\ndefy valid analysis. This level of scale might be regional—for\nexample, G. William Skinner’s analysis of the macro-regions of\nChina (Skinner 1977). It might be national—for example, a social\nand political history of Indonesia. And it might be\nsupra-national—for example, an economic history of Western\nEurope or comparative treatment of Eurasian history. The key point is\nthat historians in this middle range are free to choose the scale of\nanalysis that seems to permit the best level of conceptualization of\nhistory, given the evidence that is available and the social processes\nthat appear to be at work. And this mid-level scale permits the\nhistorian to make substantive judgments about the “reach”\nof social processes that are likely to play a causal role in the story\nthat needs telling. This level of analysis can be referred to as\n“meso-history,” and it appears to offer an ideal mix of\nspecificity and generality.\n1.3 Memory, history, and narrative\n\nWhat is the relation between history, memory, and narrative? We might\nput these concepts into a crude map by saying that \"history\" is an\norganized and evidence-based presentation of of the processes,\nactions, and events that have occurred for a people over an extended\nperiod of time; \"memory\" is the personal recollections and\nrepresentations of individuals who lived through a series of events\nand processes; and \"narratives\" are the stories that ordinary people\nand historians weave together to make sense of the events and\nhappenings through which a people and a person have lived. Collective\nmemory, the idea that groups such as Welsh miners, Serbian villagers,\nor black Alabama farmers possess a collective representation of the\npast that binds them together, can be understood as a shared set of\nnarratives and stories about the past events of the given group or\ncommunity. We use narratives to make sense of things that have\nhappened; to identify meanings and causes within this series of\nevents; and to select the \"important\" events and processes out from\nthe ordinary and inconsequential.\n\nWhat is a narrative? Most generally, it is an account of how and why a\nsituation or event came to be. A narrative is intended to provide an\naccount of how a complex historical event unfolded and why. We want to\nunderstand the event in time. What were the contextual features that\nwere relevant to the outcome—the conditions at one or more\npoints in time that played a role? What were the actions and choices\nthat agents performed, and why did they take these actions rather than\nother possible choices? What causal processes—either social or\nnatural—may have played a role in influencing the outcome? So a\nnarrative seeks to provide hermeneutic understanding of the\noutcome—why did actors behave as they did in bringing about the\noutcome?—and causal explanation—what social and\nnatural processes were acting behind the backs of the actors in\nbringing about the outcome? And different narratives represent\ndifferent mixes of hermeneutic and causal factors. A crucial and\nunavoidable feature of narrative history is the fact of selectivity.\nThe narrative historian is forced to make choices and selections at\nevery stage: between \"significant\" and \"insignificant\", between\n\"sideshow\" and \"main event\", and between levels of description.\n\nIt is evident that there are often multiple truthful, unbiased, and\ninconsistent narratives that can be told for a single complex event.\nExactly because many things happened at once, actors’ motives\nwere ambiguous, and the causal connections among events are debatable,\nit is possible to construct inconsistent narratives that are equally\nwell supported by the evidence. Further, the intellectual interest\nthat different historians bring to the happening can lead to\ndifferences in the narrative. One historian may be primarily\ninterested in the role that different views of social justice played\nin the actions of the participants; another may be primarily\ninterested in the role that social networks played; and a third may be\nespecially interested in the role of charismatic personalities, with a\nconsequent structuring to the narrative around the actions and\nspeeches of the charismatic leader. Each of these may be truthful,\nobjective, and unbiased—and inconsistent in important ways with\nthe others. So narratives are underdetermined by the facts, and there\nis no such thing as an exhaustive and comprehensive telling of the\nstory—only various tellings that emphasize one set of themes or\nanother.\n\nWhen we consider collective memory and social identity, we are also\nforced to recognize that powerful institutions attempt to shape the\nnarrative of important events in ways that serve political interests.\nA group identity can be defined as a set of beliefs and stories about\none’s home, one’s people, and one’s past. These\nideas often involve answers to questions like these: Where did we come\nfrom? How did we get here? And perhaps, who are my enemies? So an\nidentity involves a narrative, a creation story, or perhaps a\nremembrance of a long chain of disasters and crimes. Identity and\ncollective memory are intertwined; monuments, songs, icons, and flags\nhelp to set the way points in the history of a people and the\ncollective emotions that this group experiences. They have to do with\nthe stories we tell each other about who we are; how our histories\nbrought us to this place; and what large events shaped us as a\n\"people\". Governments, leaders, activists, and political parties all\nhave an interest in shaping collective memory to their own ends.\nCollective memories and identities are interwoven with myths and folk\nhistories. And, as Benedict Anderson (1983) demonstrated, these\nstories are more often than not fictions of various kinds, promulgated\nby individuals and groups who have an interest in shaping collective\nconsciousness in one way or another.\n\nThe philosophy of history must pay attention to the nexus of\nexperience, memory, and history. There is no single “Civil\nRights era” experience or “Great Depression”\nexperience; instead, historians must consider a wide range of sources\nand evidence, including oral histories, first-person accounts,\nphotographs, and other traces of the human experience of the time to\nallow them to discern both variation and some degree of\nthematicization of memory and identity in the periods they study.\nSecond, attention to history and memory highlights the amount of human\nand individual agency involved in memory. Memories must be created;\nagents must find frameworks within which to understand their moments\nof historical experience. Museums and monuments curate historical\nmemories — often with biases of their own. A third and equally\nimportant point is the fact that memories become part of the political\nmobilization possibilities that exist for a group. Groups find their\ncollective identities through shared understandings of the past; and\nthese shared understandings provide a basis for future collective\naction. Paul Ricoeur’s Time and Narrative\n(1984-1988) sheds profound light on the profound relations that\nextend among memory, identity, narrative, and history.\n2. Continental philosophy of history\n\nThe topic of history has been treated frequently in modern European\nphilosophy. A long, largely German, tradition of thought looks at\nhistory as a total and comprehensible process of events, structures,\nand processes, for which the philosophy of history can serve as an\ninterpretive tool. This approach, speculative and meta-historical,\naims to discern large, embracing patterns and directions in the\nunfolding of human history, persistent notwithstanding the erratic\nback-and-forth of particular historical developments. Modern\nphilosophers raising this set of questions about the large direction\nand meaning of history include Vico, Herder, and Hegel. A somewhat\ndifferent line of thought in the continental tradition that has been\nvery relevant to the philosophy of history is the hermeneutic\ntradition of the human sciences. Through their emphasis on the\n“hermeneutic circle” through which humans undertake to\nunderstand the meanings created by other humans—in texts,\nsymbols, and actions—hermeneutic philosophers such as\nSchleiermacher (1838), Dilthey (1860–1903), and Ricoeur\n(1984-1988, 2000) offer philosophical arguments for emphasizing the\nimportance of narrative interpretation within our understanding of\nhistory. Understanding history means providing a narrative that makes\nsense of it from beginning to end.\n2.1 Universal or historical human nature?\n\nHuman beings make history; but what is the fundamental nature of the\nhuman being? Is there one fundamental “human nature,” or\nare the most basic features of humanity historically conditioned\n(Mandelbaum 1971)? Can the study of history shed light on this\nquestion? When we study different historical epochs, do we learn\nsomething about unchanging human beings—or do we learn about\nfundamental differences of motivation, reasoning, desire, and\ncollectivity? Is humanity a historical product? Giambattista\nVico’s New Science (1725) offered an interpretation of\nhistory that turned on the idea of a universal human nature and a\nuniversal history (see Berlin 2000 for commentary). Vico’s\ninterpretation of the history of civilization offers the view that\nthere is an underlying uniformity in human nature across historical\nsettings that permits explanation of historical actions and processes.\nThe common features of human nature give rise to a fixed series of\nstages of development of civil society, law, commerce, and government:\nuniversal human beings, faced with recurring civilizational\nchallenges, produce the same set of responses over time. Two things\nare worth noting about this perspective on history: first, that it\nsimplifies the task of interpreting and explaining history (because we\ncan take it as given that we can understand the actors of the past\nbased on our own experiences and nature); and second, it has an\nintellectual heir in twentieth-century social science theory in the\nform of rational choice theory as a basis for comprehensive social\nexplanation.\n\nJohann Gottfried Herder offers a strikingly different view about human\nnature and human ideas and motivations. Herder argues for the\nhistorical contextuality of human nature in his work, Ideas for\nthe Philosophy of History of Humanity (1791). He offers a\nhistoricized understanding of human nature, advocating the idea that\nhuman nature is itself a historical product and that human beings act\ndifferently in different periods of historical development\n(1800–1877, 1791). Herder’s views set the stage for the\nhistoricist philosophy of human nature later found in such\nnineteenth-century figures as Hegel and Nietzsche. His perspective too\nprefigures an important current of thought about the social world in\nthe late twentieth century, the idea of the “social\nconstruction” of human nature and social identities (Anderson\n1983; Hacking 1999; Foucault 1971).\n2.2 Does history possess directionality?\n\nPhilosophers have raised questions about the meaning and structure of\nthe totality of human history. Some philosophers have sought to\ndiscover a large organizing theme, meaning, or direction in human\nhistory. This may take the form of an effort to demonstrate how\nhistory enacts a divine order, or reveals a large pattern (cyclical,\nteleological, progressive), or plays out an important theme (for\nexample, Hegel’s conception of history as the unfolding of human\nfreedom discussed below). The ambition in each case is to demonstrate\nthat the apparent contingency and arbitrariness of historical events\ncan be related to a more fundamental underlying purpose or order.\n\nThis approach to history may be described as hermeneutic; but it is\nfocused on interpretation of large historical features rather than the\ninterpretation of individual meanings and actions. In effect, it\ntreats the sweep of history as a complicated, tangled text, in which\nthe interpreter assigns meanings to some elements of the story in\norder to fit these elements into the larger themes and motifs of the\nstory. (Ranke makes this point explicitly (1881).)\n\nA recurring current in this approach to the philosophy of history\nfalls in the area of theodicy or eschatology: religiously inspired\nattempts to find meaning and structure in history by relating the past\nand present to some specific, divinely ordained plan. Theologians and\nreligious thinkers have attempted to find meaning in historical events\nas expressions of divine will. One reason for theological interest in\nthis question is the problem of evil; thus Leibniz’s\nTheodicy attempts to provide a logical interpretation of\nhistory that makes the tragedies of history compatible with a\nbenevolent God’s will (1709). In the twentieth century,\ntheologians such as Maritain (1957), Rust (1947), and Dawson (1929)\noffered systematic efforts to provide Christian interpretations of\nhistory.\n\nEnlightenment thinkers rejected the religious interpretation of\nhistory but brought in their own teleology, the idea of\nprogress—the idea that humanity is moving in the direction of\nbetter and more perfect civilization, and that this progression can be\nwitnessed through study of the history of civilization (Condorcet\n1795; Montesquieu 1748). Vico’s philosophy of history seeks to\nidentify a foundational series of stages of human civilization.\nDifferent civilizations go through the same stages, because human\nnature is constant across history (Pompa 1990). Rousseau (1762a;\n1762b) and Kant (1784–5; 1784–6) brought some of these\nassumptions about rationality and progress into their political\nphilosophies, and Adam Smith embodies some of this optimism about the\nprogressive effects of rationality in his account of the unfolding of\nthe modern European economic system (1776). This effort to derive a\nfixed series of stages as a tool of interpretation of the history of\ncivilization is repeated throughout the eighteenth and nineteenth\ncenturies; it finds expression in Hegel’s philosophy (discussed\nbelow), as well as Marx’s materialist theory of the development\nof economic modes of production (Marx and Engels 1845–49; Marx\nand Engels 1848).\n\nThe effort to find directionality or stages in history found a new\nexpression in the early twentieth century, in the hands of several\n“meta-historians” who sought to provide a\nmacro-interpretation that brought order to world history: Spengler\n(1934), Toynbee (1934), Wittfogel (1935), and Lattimore (1932). These\nauthors offered a reading of world history in terms of the rise and\nfall of civilizations, races, or cultures. Their writings were not\nprimarily inspired by philosophical or theological theories, but they\nwere also not works of primary historical scholarship. Spengler and\nToynbee portrayed human history as a coherent process in which\ncivilizations pass through specific stages of youth, maturity, and\nsenescence. Wittfogel and Lattimore interpreted Asian civilizations in\nterms of large determining factors. Wittfogel contrasts China’s\nhistory with that of Europe by characterizing China’s\ncivilization as one of “hydraulic despotism”, with the\nattendant consequence that China’s history was cyclical rather\nthan directional. Lattimore applies the key of geographic and\necological determinism to the development of Asian civilization (Rowe\n2007).\n\nA legitimate criticism of many efforts to offer an interpretation of\nthe sweep of history is the view that it looks for meaning where none\ncan exist. Interpretation of individual actions and life histories is\nintelligible, because we can ground our attributions of meaning in a\ntheory of the individual person as possessing and creating meanings.\nBut there is no super-agent lying behind historical events—for\nexample, the French Revolution—and so it is a metaphysical\nmistake to attempt to find the meaning of the features of the event\n(e.g., the Terror). The theological approach purports to evade this\ncriticism by attributing agency to God as the author of history, but\nthe assumption that there is a divine author of history takes the\nmaking of history out of the hands of humanity.\n\nEfforts to discern large stages in history such as those of Vico,\nSpengler, or Toynbee are vulnerable to a different criticism based on\ntheir mono-causal interpretations of the full complexity of human\nhistory. These authors single out one factor that is thought to drive\nhistory: a universal human nature (Vico), or a common set of\ncivilizational challenges (Spengler, Toynbee). But their hypotheses\nneed to be evaluated on the basis of concrete historical evidence. And\nthe evidence concerning the large features of historical change over\nthe past three millennia offers little support for the idea of one\nfixed process of civilizational development. Instead, human history,\nat virtually every scale, appears to embody a large degree of\ncontingency and multiple pathways of development. This is not to say\nthat there are no credible “large historical”\ninterpretations available for human history and society. For example,\nMichael Mann’s sociology of early agrarian civilizations (1986),\nDe Vries and Goudsblom’s efforts at global environmental history\n(2002), and Jared Diamond’s treatment of disease and warfare\n(1997) offer examples of scholars who attempt to explain some large\nfeatures of human history on the basis of a few common human\ncircumstances: the efforts of states to collect revenues, the need of\nhuman communities to exploit resources, or the global transmission of\ndisease. The challenge for macro-history is to preserve the discipline\nof empirical evaluation for the large hypotheses that are put\nforward.\n2.3 Hegel’s philosophy of history\n\nHegel’s philosophy of history is perhaps the most fully\ndeveloped philosophical theory of history that attempts to discover\nmeaning or direction in history (1824a, 1824b, 1857). Hegel regards\nhistory as an intelligible process moving towards a specific\ncondition—the realization of human freedom. “The question\nat issue is therefore the ultimate end of mankind, the end which the\nspirit sets itself in the world” (1857: 63). Hegel incorporates\na deeper historicism into his philosophical theories than his\npredecessors or successors. He regards the relationship between\n“objective” history and the subjective development of the\nindividual consciousness (“spirit”) as an intimate one;\nthis is a central thesis in his Phenomenology of Spirit\n(1807). And he views it to be a central task for philosophy to\ncomprehend its place in the unfolding of history. “History is\nthe process whereby the spirit discovers itself and its own\nconcept” (1857: 62). Hegel constructs world history into a\nnarrative of stages of human freedom, from the public freedom of the\npolis and the citizenship of the Roman Republic, to the individual\nfreedom of the Protestant Reformation, to the civic freedom of the\nmodern state. He attempts to incorporate the civilizations of India\nand China into his understanding of world history, though he regards\nthose civilizations as static and therefore pre-historical\n(O’Brien 1975). He constructs specific moments as\n“world-historical” events that were in the process of\nbringing about the final, full stage of history and human freedom. For\nexample, Napoleon’s conquest of much of Europe is portrayed as a\nworld-historical event doing history’s work by establishing the\nterms of the rational bureaucratic state. Hegel finds reason in\nhistory; but it is a latent reason, and one that can only be\ncomprehended when the fullness of history’s work is finished:\n“When philosophy paints its grey on grey, then has a shape of\nlife grown old. … The owl of Minerva spreads its wings only\nwith the falling of the dusk” ((Hegel 1821: 13). (See\nO’Brien (1975), Taylor (1975), and Kojève (1969) for\ntreatments of Hegel’s philosophy of history.)\n\nIt is worth observing that Hegel’s philosophy of history is not\nthe indefensible exercise of speculative philosophical reasoning that\nanalytic philosophers sometimes paint it. His philosophical approach\nis not based solely on foundational apriori reasoning, and many of his\ninterpretations of concrete historical developments are quite\ninsightful. Instead he proposes an “immanent” encounter\nbetween philosophical reason and the historical given. Here is how W.\nH. Walsh (1960) describes Hegel’s intellectual project in his\nphilosophy of history:\n\n\nTo accomplish this task the philosopher must take the results of\nempirical history as data, but it will not suffice for him merely to\nreproduce them. He must try to illuminate history by bringing his\nknowledge of the Idea, the formal articulation of reason, to bear upon\nit, striving, in a phrase Hegel uses elsewhere, to elevate empirical\ncontents to the rank of necessary truth. (Walsh 1960: 143)\n\n\nHegel’s prescription is that the philosopher should seek to\ndiscover the rational within the real—not to impose the rational\nupon the real. “To comprehend what is, this is the task of\nphilosophy, because what is, is reason” (1821: 11). His approach\nis neither purely philosophical nor purely empirical; instead, he\nundertakes to discover within the best historical knowledge of his\ntime, an underlying rational principle that can be philosophically\narticulated (Avineri 1972).\n2.4 Hermeneutic approaches to history\n\nAnother important strand of continental philosophy of history proposes\nto apply hermeneutics to problems of historical interpretation. This\napproach focuses on the meaning of the actions and intentions of\nhistorical individuals rather than historical wholes. This tradition\nderives from the tradition of scholarly Biblical interpretation.\nHermeneutic scholars emphasized the linguistic and symbolic core of\nhuman interactions and maintained that the techniques that had been\ndeveloped for the purpose of interpreting texts could also be employed\nto interpret symbolic human actions and products. Wilhelm Dilthey\nmaintained that the human sciences were inherently distinct from the\nnatural sciences in that the former depend on the understanding of\nmeaningful human actions, while the latter depend on causal\nexplanation of non-intensional events (1883, 1860-1903, 1910). Human\nlife is structured and carried out through meaningful action and\nsymbolic expressions. Dilthey maintains that the intellectual tools of\nhermeneutics—the interpretation of meaningful texts—are\nsuited to the interpretation of human action and history. The method\nof verstehen (understanding) makes a methodology of this\napproach; it invites the thinker to engage in an active construction\nof the meanings and intentions of the actors from their point of view\n(Outhwaite 1975). This line of interpretation of human history found\nexpression in the twentieth-century philosophical writings of\nHeidegger, Gadamer, Ricoeur, and Foucault. This tradition approaches\nthe philosophy of history from the perspective of meaning and\nlanguage. It argues that historical knowledge depends upon\ninterpretation of meaningful human actions and practices. Historians\nshould probe historical events and actions in order to discover the\ninterconnections of meaning and symbolic interaction that human\nactions have created (Sherratt 2006).\n\nThe hermeneutic tradition took an important new turn in the\nmid-twentieth century, as philosophers attempted to make sense of\nmodern historical developments including war, racism, and the\nHolocaust. Narratives of progress were no longer compelling, following\nthe terrible events of the first half of the twentieth century. The\nfocus of this approach might be labeled “history as\nremembrance.” Contributors to this strand of thought emerged\nfrom twentieth-century European philosophy, including existentialism\nand Marxism, and were influenced by the search for meaning in the\nHolocaust. Paul Ricoeur draws out the parallels between personal\nmemory, cultural memory, and history (2000). Dominick LaCapra brings\nthe tools of interpretation theory and critical theory to bear on his\ntreatment of the representation of the trauma of the Holocaust (1994,\n1998). Others emphasize the role that folk histories play in the\nconstruction and interpretation of “our” past. This is a\ntheme that has been taken up by contemporary historians, for example,\nby Michael Kammen in his treatment of public remembrance of the\nAmerican Civil War (1991). Memory and the representation of the past\nplay a key role in the formation of racial and national identities;\nnumerous twentieth-century philosophers have noted the degree of\nsubjectivity and construction that are inherent in the national\nmemories represented in a group’s telling of its history.\n\nAlthough not himself falling within the continental lineage, R. G.\nCollingwood’s philosophy of history falls within the general\nframework of hermeneutic philosophy of history (1946). Collingwood\nfocuses on the question of how to specify the content of history. He\nargues that history is constituted by human actions. Actions are the\nresult of intentional deliberation and choice; so historians are able\nto explain historical processes “from within” as a\nreconstruction of the thought processes of the agents who bring them\nabout. He presents the idea of re-enactment as a solution to the\nproblem of knowledge of the past from the point of view of the\npresent. The past is accessible to historians in the present, because\nit is open to them to re-enact important historical moments through\nimaginative reconstruction of the actors’ states of mind and\nintentions. He describes this activity of re-enactment in the context\nof the historical problem of understanding Plato’s meanings as a\nphilosopher or Caesar’s intentions as a ruler:\n\nThis re-enactment is only accomplished, in the case of Plato and\nCaesar respectively, so far as the historian brings to bear on the\nproblem all the powers of his own mind and all his knowledge of\nphilosophy and politics. It is not a passive surrender to the spell of\nanother’s mind; it is a labour of active and therefore critical\nthinking. (Collingwood 1946: 215)\n\n2.5 Conceptual history\n\nThe post-war German historian Reinhart Koselleck made important\ncontributions to the philosophy of history that are largely\nindependent from the other sources of Continental philosophy of\nhistory mentioned here. (Koselleck’s contributions are ably\ndiscussed in Olsen 2012.) Koselleck contributed to a “conceptual\nand critical theory of history” (2002, 2004). His major\ncompendium, with Brunner and Conze, of the history of concepts of\nhistory in the German-speaking world is one of the major expressions\nof this work (Brunner, Conze, and Koselleck 1972-97). Koselleck\nbelieves there are three key tasks for the metahistorian or\nphilosopher: to identify the concepts that are either possible or\nnecessary in characterizing history; to locate those concepts within\nthe context of the social and political discourses and conflicts of\nthe time period; and to critically evaluate various of these concepts\nfor their usefulness in historical analysis.\n\nKey examples that Koselleck develops include “space of\nexperience” and “horizon of expectation”. Examples\nof metahistorical categories in Koselleck’s account include\n“capacity to die and capacity to kill,” “friend and\nfoe,” “inside and outside,” and “master and\nservant”. Koselleck represents these conceptual oppositions as\nrepresenting conditions of possibility of any representation of\nhistory (Bouton 2016: 178).\n\nA large part of Koselleck’s work thus involves identifying and\ndescribing various kinds of historical concepts. In order to represent\nhistory it is necessary to make use of a vocabulary that distinguishes\nthe things we need to talk about; and historical concepts permit these\nidentifications. This in turn requires both conceptual and historical\ntreatment: how the concepts are understood, and how they have changed\nover time. Christophe Bouton encapsulates Koselleck’s approach\nin these terms: “[It is an] inquiry into the historical\ncategories that are used in, or presupposed by, the experience of\nhistory at its different levels, as events, traces, and\nnarratives” (Bouton 2016: 164). Further, Bouton argues that\nKoselleck also brings a critical perspective to the concepts that he\ndiscusses: he asks the question of validity (Bouton 2016). To what\nextent do these particular concepts work well to characterize\nhistory?\n\nWhat this amounts to is the idea that history is the result of\nconceptualization of the past on the part of the people who tell\nit—professional historians, politicians, partisans, and ordinary\ncitizens. (It is interesting to note that Koselleck’s research\nin the final years of his career focused on the meaning of public\nmonuments, especially war memorials.) It is therefore an important,\neven crucial, task to investigate the historical concepts that have\nbeen used to characterize the past. A key concept that was of interest\nto Koselleck was the idea of “modernity”. This approach\nmight seem to fall within the larger field of intellectual history;\nbut Koselleck and other exponents believe that the historical concepts\nin use actually play a role as well in the concrete historical\ndevelopments that occur within a period.\n\nIt is worth noticing that history comes into Koselleck’s notion\nof Begriffsgeschichte in two ways. Koselleck is concerned to\nuncover the logic and semantics of the concepts that have been used to\ndescribe historical events and processes; and he is interested in the\nhistorical evolution of some of those concepts over time. (In this\nlatter interest his definition of the question parallels that of the\nso-called Cambridge School of Quentin Skinner, John Dunn, and J. G. A.\nPocock.) Numerous observers emphasize the importance of political\nconflict in Koselleck’s account of historical concepts: concepts\nare used by partisans to define the field of battle over values and\nloyalties (Pankakoski 2010). More generally, Koselleck’s aim is\nto excavate the layers of meaning that have been associated with key\nhistorical concepts in different historical periods. (Whatmore and\nYoung 2015 provide extensive and useful accounts of each of the\npositions mentioned here.)\n\nConceptual history may appear to have a Kantian background—an\nexploration of the “categories” of thought on the basis of\nwhich alone history is intelligible. But this appears not to be\nKoselleck’s intention, and his approach is not apriori. Rather,\nhe looks at historical concepts on a spectrum of abstraction, from\nrelatively close to events (the French Revolution) to more abstract\n(revolutionary change). Moreover, he makes rigorous attempts to\ndiscover the meanings and uses of these concepts in their historical\ncontexts.\n\nKoselleck’s work defines a separate space within the field of\nthe philosophy of history. It has to do with meanings in history, but\nit is neither teleological nor hermeneutic. It takes seriously the\nobligation of the historian excavate the historical facts with\nscrupulous rigor, but it is not empiricist or reductionist. It\nemphasizes the dependence of “history” on the conceptual\nresources of those who live history and those who tell history, but it\nis not post-modernist or relativist. Koselleck provides an innovative\nand constructive way of formulating the problem of historical\nknowledge.\n3. Anglo-American philosophy of history\n\nThe traditions of empiricism and Anglo-American philosophy have also\ndevoted occasional attention to history. Philosophers in this\ntradition have avoided the questions of speculative philosophy of\nhistory and have instead raised questions about the logic and\nepistemology of historical knowledge. Here the guiding question is,\n“What are the logical and epistemological characteristics of\nhistorical knowledge and historical explanation?”.\n\nDavid Hume’s empiricism cast a dominant key for almost all\nsubsequent Anglo-American philosophy, and this influence extends to\nthe interpretation of human behavior and the human sciences. Hume\nwrote a widely read history of England (1754–1762). His\ninterpretation of history was based on the assumption of ordinary\nactions, motives, and causes, with no sympathy for theological\ninterpretations of the past. His philosophical view of history was\npremised on the idea that explanations of the past can be based on the\nassumption of a fixed human nature.\n\nAnglo-American interest in the philosophy of history was renewed at\nmid-twentieth century with the emergence of “analytical\nphilosophy of history.” Representative contributors include Dray\n(1957, 1964, 1966), Danto (1965), and Gardiner (1952, 1974). This\napproach involves the application of the methods and tools of analytic\nphilosophy to the special problems that arise in the pursuit of\nhistorical explanations and historical knowledge (Gardiner 1952). Here\nthe interest is in the characteristics of historical knowledge: how we\nknow facts about the past, what constitutes a good historical\nexplanation, whether explanations in history require general laws, and\nwhether historical knowledge is underdetermined by available\nhistorical evidence. Analytic philosophers emphasized the empirical\nand scientific status of historical knowledge, and attempted to\nunderstand this claim along the lines of the scientific standing of\nthe natural sciences (Nagel 1961).\n\nPhilosophers in the analytic tradition are deeply skeptical about the\npower of non-empirical reason to arrive at substantive conclusions\nabout the structure of the world—including human history.\nPhilosophical reasoning by itself cannot be a source of substantive\nknowledge about the natural world, or about the sequence of events,\nactions, states, classes, empires, plagues, and conquests that we call\n“history.” Rather, substantive knowledge about the world\ncan only derive from empirical investigation and logical analysis of\nthe consequences of these findings. So analytic philosophers of\nhistory have had little interest in the large questions about the\nmeaning and structure of history considered above. The practitioners\nof speculative philosophy of history, on the other hand, are convinced\nof the power of philosophical thought to reason through to a\nfoundational understanding of history, and would be impatient with a\ncall for a purely empirical and conceptual approach to the\nsubject.\n\nW. H. Walsh’s Philosophy of History (Walsh 1960 [1951]),\nfirst published in 1951 and revised in 1960, is an open-minded and\nwell-grounded effort to provide an in-depth presentation of the field\nthat crosses the separation between continental and analytical\nphilosophy. The book attempts to treat both major questions driving\nmuch of the philosophy of history: the nature of historical knowledge\nand the possibility of gaining “metaphysical” knowledge\nabout history. An Oxford philosopher trained in modern philosophy,\nWalsh was strongly influenced by Collingwood and was well aware of the\nEuropean idealist tradition of philosophical thinking about history,\nincluding Rickert, Dilthey, and Croce, and he treats this tradition in\na serious way. He draws the distinction between these traditions along\nthe lines of “critical” and “speculative”\nphilosophy of history. Walsh’s goal for the book is ambitious;\nhe hopes to propose a framework within which the main questions about\nhistory can be addressed, including both major traditions. He advances\nthe view that the historian is presented with a number of events,\nactions, and developments during a period. How do they hang together?\nThe process of cognition through which the historian makes sense of a\nset of separate historical events Walsh refers to as\n“colligation” — “to locate a historical event\nin a larger historical process in terms of which it makes sense”\n(23).\n\nWalsh fundamentally accepts Collingwood’s most basic premise:\nthat history concerns conscious human action. Collingwood’s\nslogan was that “history is the science of the mind,” and\nWalsh appears to accept much of this perspective. So the key\nintellectual task for the historian, on this approach, is to\nreconstruct the reasons or motives that actors had at various points\nin history (and perhaps the conditions that led them to have these\nreasons and motives). This means that the tools of interpretation of\nmeanings and reasons are crucial for the historian—much as the\nhermeneutic philosophers in the German tradition had argued.\n\nWalsh suggests that the philosophical content of the philosophy of\nhistory falls naturally into two different sorts of inquiry, parallel\nto the distinction between philosophy of nature and philosophy of\nscience. The first has to do with metaphysical questions about the\nreality of history as a whole; the latter has to do with the epistemic\nissues that arise in the pursuit and formulation of knowledge of\nhistory. He refers to these approaches as “speculative”\nand “critical” aspects of the philosophy of history. And\nhe attempts to formulate a view of what the key questions are for each\napproach. Speculative philosophy of history asks about the meaning and\npurpose of the historical process. Critical philosophy of history is\nwhat we now refer to as “analytic” philosophy; it is the\nequivalent for history of what the philosophy of science is for\nnature.\n3.1 General laws in history?\n\nThe philosopher of science Carl Hempel stimulated analytic\nphilosophers’ interest in historical knowledge in his essay,\n“The Function of General Laws in History” (1942).\nHempel’s general theory of scientific explanation held that all\nscientific explanations require subsumption under general laws. Hempel\nconsidered historical explanation as an apparent exception to the\ncovering-law model and attempted to show the suitability of the\ncovering-law model even to this special case. He argued that valid\nhistorical explanations too must invoke general laws. The covering-law\napproach to historical explanation was supported by other analytical\nphilosophers of science, including Ernest Nagel (1961). Hempel’s\nessay provoked a prolonged controversy between supporters who cited\ngeneralizations about human behavior as the relevant general laws, and\ncritics who argued that historical explanations are more akin to\nexplanations of individual behavior, based on interpretation that\nmakes the outcome comprehensible. Especially important discussions\nwere offered by William Dray (1957), Michael Scriven (1962), and Alan\nDonagan (1966). Donagan and others pointed out the difficulty that\nmany social explanations depend on probabilistic regularities rather\nthan universal laws. Others, including Scriven, pointed out the\npragmatic features of explanation, suggesting that arguments that fall\nfar short of deductive validity are nonetheless sufficient to\n“explain” a given historical event in a given context of\nbelief. The most fundamental objections, however, are these: first,\nthat there are virtually no good examples of universal laws in\nhistory, whether of human behavior or of historical event succession\n(Donagan 1966: 143–45); and second, that there are other\ncompelling schemata through which we can understand historical actions\nand outcomes that do not involve subsumption under general laws\n(Elster 1989). These include the processes of reasoning through which\nwe understand individual actions—analogous to the methods of\nverstehen and the interpretation of rational behavior\nmentioned above (Dray 1966: 131–37); and the processes through\nwhich we can trace out chains of causation and specific causal\nmechanisms without invoking universal laws.\n\nA careful re-reading of these debates over the covering-law model in\nhistory suggests that the debate took place largely because of the\nerroneous assumption of the unity of science and the postulation of\nthe regulative logical similarity of all areas of scientific reasoning\nto a few clear examples of explanation in a few natural sciences. This\napproach was a deeply impoverished one, and handicapped from the start\nin its ability to pose genuinely important questions about the nature\nof history and historical knowledge. Explanation of human actions and\noutcomes should not be understood along the lines of an explanation of\nwhy radiators burst when the temperature falls below zero degrees\ncentigrade. As Donagan concludes, “It is harmful to overlook the\nfundamental identity of the social sciences with history, and to\nmutilate research into human affairs by remodeling the social sciences\ninto deformed likenesses of physics” (1966: 157). The insistence\non naturalistic models for social and historical research leads easily\nto a presumption in favor of the covering-law model of explanation,\nbut this presumption is misleading.\n3.2 Historical objectivity\n\nAnother issue that provoked significant attention among analytic\nphilosophers of history is the issue of “objectivity.” Is\nit possible for historical knowledge to objectively represent the\npast? Or are forms of bias, omission, selection, and interpretation\nsuch as to make all historical representations dependent on the\nperspective of the individual historian? Does the fact that human\nactions are value-laden make it impossible for the historian to\nprovide a non-value-laden account of those actions?\n\nThis topic divides into several different problems, as noted by John\nPassmore (1966: 76). The most studied of these within the analytic\ntradition is that of the value-ladenness of social action. Second is\nthe possibility that the historian’s interpretations are\nthemselves value-laden—raising the question of the capacity for\nobjectivity or neutrality of the historian herself. Does the\nintellectual have the ability to investigate the world without regard\nto the biases that are built into her political or ethical beliefs,\nher ideology, or her commitments to a class or a social group? And\nthird is the question of the objectivity of the historical\ncircumstances themselves. Is there a fixed historical reality,\nindependent from later representations of the facts? Or is history\nintrinsically “constructed,” with no objective reality\nindependent from the ways in which it is constructed? Is there a\nreality corresponding to the phrase, “the French\nRevolution,” or is there simply an accumulation of written\nversions of the French Revolution?\n\nThere are solutions to each of these problems that are highly\nconsonant with the philosophical assumptions of the analytic\ntradition. First, concerning values: There is no fundamental\ndifficulty in reconciling the idea of a researcher with one set of\nreligious values, who nonetheless carefully traces out the religious\nvalues of a historical actor possessing radically different values.\nThis research can be done badly, of course; but there is no inherent\nepistemic barrier that makes it impossible for the researcher to\nexamine the body of statements, behaviors, and contemporary cultural\ninstitutions corresponding to the other, and to come to a justified\nrepresentation of the other. One need not share the values or\nworldview of a sans-culotte, in order to arrive at a\njustified appraisal of those values and worldview. This leads us to a\nresolution of the second issue as well—the possibility of\nneutrality on the part of the researcher. The set of epistemic values\nthat we impart to scientists and historians include the value of\nintellectual discipline and a willingness to subject their hypotheses\nto the test of uncomfortable facts. Once again, review of the history\nof science and historical writing makes it apparent that this\nintellectual value has effect. There are plentiful examples of\nscientists and historians whose conclusions are guided by their\ninterrogation of the evidence rather than their ideological\npresuppositions. Objectivity in pursuit of truth is itself a value,\nand one that can be followed.\n\nFinally, on the question of the objectivity of the past: Is there a\nbasis for saying that events or circumstances in the past have\nobjective, fixed characteristics that are independent from our\nrepresentation of those events? Is there a representation-independent\nreality underlying the large historical structures to which historians\ncommonly refer (the Roman Empire, the Great Wall of China, the\nimperial administration of the Qianlong Emperor)? We can work our way\ncarefully through this issue, by recognizing a distinction between the\nobjectivity of past events, actions and circumstances, the objectivity\nof the contemporary facts that resulted from these past events, and\nthe objectivity and fixity of large historical entities. The past\noccurred in precisely the way that it did—agents acted, droughts\noccurred, armies were defeated, new technologies were invented. These\noccurrences left traces of varying degrees of information richness;\nand these traces give us a rational basis for arriving at beliefs\nabout the occurrences of the past. So we can offer a non-controversial\ninterpretation of the “objectivity of the past.” However,\nthis objectivity of events and occurrences does not extend very far\nupward as we consider more abstract historical events: the creation of\nthe Greek city-state, the invention of Enlightenment rationality, the\nTaiping Rebellion. In each of these instances the noun’s\nreferent is an interpretive construction by historical actors and\nhistorians, and one that may be undone by future historians. To refer\nto the “Taiping Rebellion” requires an act of synthesis of\na large number of historical facts, along with an interpretive story\nthat draws these facts together in this way rather than that way. The\nunderlying facts of behavior, and their historical traces, remain; but\nthe knitting-together of these facts into a large historical event\ndoes not constitute an objective historical entity. Consider research\nin the past twenty years that questions the existence of the\n“Industrial Revolution.” In this debate, the same set of\nhistorical facts were first constructed into an abrupt episode of\nqualitative change in technology and output in Western Europe; under\nthe more recent interpretation, these changes were more gradual and\nless correctly characterized as a “revolution”\n(O’Brien and Keyder 1978). Or consider Arthur Waldron’s\nsustained and detailed argument to the effect that there was no\n“Great Wall of China,” as that structure is usually\nconceptualized (1990).\n3.3 Causation in history\n\nA third important set of issues that received attention from analytic\nphilosophers concerned the role of causal ascriptions in historical\nexplanations. What is involved in saying that “The American\nCivil War was caused by economic conflict between the North and the\nSouth”? Does causal ascription require identifying an underlying\ncausal regularity—for example, “periods of rapid inflation\ncause political instability”? Is causation established by\ndiscovering a set of necessary and sufficient conditions? Can we\nidentify causal connections among historical events by tracing a\nseries of causal mechanisms linking one to the next? This topic raises\nthe related problem of determinism in history: are certain events\ninevitable in the circumstances? Was the fall of the Roman Empire\ninevitable, given the configuration of military and material\ncircumstances prior to the crucial events?\n\nAnalytic philosophers of history most commonly approached these issues\non the basis of a theory of causation drawn from positivist philosophy\nof science. This theory is ultimately grounded in Humean assumptions\nabout causation: that causation is nothing but constant conjunction.\nSo analytic philosophers were drawn to the covering-law model of\nexplanation, because it appeared to provide a basis for asserting\nhistorical causation. As noted above, this approach to causal\nexplanation is fatally flawed in the social sciences, because\nuniversal causal regularities among social phenomena are unavailable.\nSo it is necessary either to arrive at other interpretations of\ncausality or to abandon the language of causality. A second approach\nwas to define causes in terms of a set of causally relevant conditions\nfor the occurrence of the event—for example, necessary and/or\nsufficient conditions, or a set of conditions that enhance or reduce\nthe likelihood of the event. This approach found support in\n“ordinary language” philosophy and in analysis of the use\nof causal language in such contexts as the courtroom (Hart and\nHonoré 1959). Counterfactual reasoning is an important element\nof discovery of a set of necessary and/or sufficient conditions; to\nsay that \\(C\\) was necessary for the occurrence of \\(E\\) requires that\nwe provide evidence that \\(E\\) would not have occurred if \\(C\\) were\nnot present (Mackie 1965, 1974). And it is evident that there are\ncausal circumstances in which no single factor is necessary for the\noccurrence of the effect; the outcome may be overdetermined by\nmultiple independent factors.\n\nThe convergence of reasons and causes in historical processes is\nhelpful in this context, because historical causes are frequently the\neffect of deliberate human action (Davidson 1963). So specifying the\nreason for the action is simultaneously identifying a part of the\ncause of the consequences of the action. It is often justifiable to\nidentify a concrete action as the cause of a particular event (a\ncircumstance that was sufficient in the existing circumstances to\nbring about the outcome), and it is feasible to provide a convincing\ninterpretation of the reasons that led the actor to carry out the\naction.\n\nWhat analytic philosophers of the 1960s did not come to, but what is\ncrucial for current understanding of historical causality, is the\nfeasibility of tracing causal mechanisms through a complex series of\nevents (causal realism). Historical narratives often take the form of\nan account of a series of events, each of which was a causal condition\nor trigger for later events. Subsequent research in the philosophy of\nthe social sciences has provided substantial support for historical\nexplanations that depend on tracing a series of causal mechanisms\n(Little 2018; Hedström and Swedberg 1998).\n3.4 Recent topics in the philosophy of history\n\nEnglish-speaking philosophy of history shifted significantly in the\n1970s, beginning with the publication of Hayden White’s\nMetahistory (1973) and Louis Mink’s writings of the\nsame period (1966; Mink et al. 1987). The so-called “linguistic\nturn” that marked many areas of philosophy and literature also\ninfluenced the philosophy of history. Whereas analytic philosophy of\nhistory had emphasized scientific analogies for historical knowledge\nand advanced the goals of verifiability and generalizability in\nhistorical knowledge, English-speaking philosophers in the 1970s and\n1980s were increasingly influenced by hermeneutic philosophy,\npost-modernism, and French literary theory (Rorty 1979). These\nphilosophers emphasized the rhetoric of historical writing, the\nnon-reducibility of historical narrative to a sequence of\n“facts”, and the degree of construction that is involved\nin historical representation. Affinities with literature and\nanthropology came to eclipse examples from the natural sciences as\nguides for representing historical knowledge and historical\nunderstanding. The richness and texture of the historical narrative\ncame in for greater attention than the attempt to provide causal\nexplanations of historical outcomes. Frank Ankersmit captured many of\nthese themes in his treatment of historical narrative (1995; Ankersmit\nand Kellner 1995); see also Berkhofer (1995).\n\nThis “new” philosophy of history is distinguished from\nanalytic philosophy of history in several important respects. It\nemphasizes historical narrative rather than historical causation. It\nis intellectually closer to the hermeneutic tradition than to the\npositivism that underlay the analytic philosophy of history of the\n1960s. It highlights features of subjectivity and multiple\ninterpretation over those of objectivity, truth, and correspondence to\nthe facts. Another important strand in this approach to the philosophy\nof history is a clear theoretical preference for the historicist\nrather than the universalist position on the status of human\nnature—Herder rather than Vico. The prevalent perspective holds\nthat human consciousness is itself a historical product, and that it\nis an important part of the historian’s work to piece together\nthe mentality and assumptions of actors in the past (Pompa 1990).\nSignificantly, contemporary historians such as Robert Darnton have\nturned to the tools of ethnography to permit this sort of discovery\n(1984).\n\nAnother important strand of thinking within analytic philosophy has\nfocused attention on historical ontology (Hacking 2002, Little 2010).\nThe topic of historical ontology is important, both for philosophers\nand for practicing historians. Ontology has to do with the question,\nwhat kinds of things do we need to postulate in a given realm?\nHistorical ontology poses this question with regard to the realities\nof the past. Should large constructs like ‘revolution’,\n‘market society’, ‘fascism’, or\n‘Protestant religious identity’ be included in our\nontology as real things? Or should we treat these ideas in a purely\nnominalistic way, treating them as convenient ways of aggregating\ncomplex patterns of social action and knowledge by large numbers of\nsocial actors in a time and place? Further, how should we think about\nthe relationship between instances and categories in the realm of\nhistory, for example, the relation between the French, Chinese, or\nRussian Revolutions and the general category of\n‘revolution’? Are there social kinds that recur in\nhistory, or is each historical formation unique in important ways?\nThese are all questions of ontology, and the answers we give to them\nwill have important consequences for how we conceptualize and explain\nthe past.\n4. Historiography and the philosophy of history\n\nWhen historians discuss methodological issues in their research they\nmore commonly refer to “historiography” than to\n“philosophy of history.” What is the relation between\nthese bodies of thought about the writing of history? We should begin\nby asking the basic question: what is historiography? In its most\ngeneral sense, the term refers to the study of historians’\nmethods and practices. Any intellectual or creative practice is guided\nby a set of standards and heuristics about how to proceed, and\n“experts” evaluate the performances of practitioners based\non their judgments of how well the practitioner meets the standards.\nSo one task we always have in considering an expert activity is to\nattempt to identify these standards and criteria of good performance.\nThis is true for theatre and literature, and it is true for writing\nhistory. Historiography is at least in part the effort to do this work\nfor a particular body of historical writing. (Several handbooks\ncontain a wealth of recent writings on various aspects of\nhistoriography; Tucker 2009, Bentley 1997, Breisach 2007. Important\nand innovative contributions to understanding the intellectual tasks\nof the historian include Bloch 1953 and Paul 2015.)\n\nHistorians normally make truth claims, and they ask us to accept those\nclaims based on the reasoning they present. So a major aspect of the\nstudy of historiography has to do with defining the ideas of\nevidence, rigor, and standards of reasoning for historical\ninquiry. We presume that historians want to discover empirically\nsupported truths about the past, and we presume that they want to\noffer inferences and interpretations that are somehow regulated by\nstandards of scientific rationality. (Simon Schama challenges some of\nthese ideas in Dead Certainties (Schama 1991).) So the\napprentice practitioner seeks to gain knowledge of the practices of\nhis/her elders in the profession: what counts as a compelling\nargument, how to assess a body of archival evidence, how to offer or\ncriticize an interpretation of complex events that necessarily exceeds\nthe available evidence. The historiographer has a related task: he/she\nwould like to be able to codify the main methods and standards of one\nhistorical school or another.\n\nThere are other desiderata governing a good historical work, and these\ncriteria may change from culture to culture and epoch to epoch.\nDiscerning the historian’s goals is crucial to deciding how well\nhe or she succeeds. So discovering these stylistic and aesthetic\nstandards that guide the historian’s work is itself an important\ntask for historiography. This means that the student of historiography\nwill naturally be interested in the conventions of historical\nwriting and rhetoric that are characteristic of a given period or\nschool.\n\nA full historiographic assessment of a given historian might include\nquestions like these: What methods of discovery does he/she use? What\nrhetorical and persuasive goals does he/she pursue? What models of\nexplanation? What paradigm of presentation? What standards of style\nand rhetoric? What interpretive assumptions?\n\nA historical school might be defined as a group of interrelated\nhistorians who share a significant number of specific assumptions\nabout evidence, explanation, and narrative. The Annales\nschool, established by Marc Bloch and Lucien Febvre in the 1920s,\nrepresented a distinctive and fertile approach to social history\n(Burguière 2009), united by shared assumptions about both\ntopics and intellectual approaches to the past. Historiography becomes\nitself historical when we recognize that frameworks of assumptions\nabout historical knowledge and reasoning change over time. On this\nassumption, the history of historical thinking and writing is itself\nan important subject. How did historians of various periods in human\nhistory conduct their study and presentation of history? Under this\nrubric we find books on the historiography of the ancient Greeks;\nRenaissance historiography; or the historiography of German\nromanticism. Arnaldo Momigliano’s writings on the ancient\nhistorians fall in this category (Momigliano 1990). In a nutshell,\nMomigliano is looking at the several traditions of ancient\nhistory-writing as a set of normative practices that can be dissected\nand understood in their specificity and their cultural contexts.\n\nA second primary use of the concept of historiography is more\npresent-oriented and methodological. It involves the study and\nanalysis of historical methods of research, inquiry, inference, and\npresentation used by more-or-less contemporary historians. How do\ncontemporary historians go about their tasks of understanding the\npast? Here we can reflect upon the historiographical challenges that\nconfronted Philip Huang as he investigated the Chinese peasant economy\nin the 1920s and 1930s (Huang 1990), or the historiographical issues\nraised in Robert Darnton’s telling of a peculiar and trivial\nevent, the Great Cat Massacre by printers’ apprentices in\nParis in the 1730s (Darnton 1984). Sometimes these issues have to do\nwith the scarcity or bias in the available bodies of historical\nrecords (for example, the fact that much of what Huang refers to about\nthe village economy of North China was gathered by the research teams\nof the occupying Japanese army). Sometimes they have to do with the\ndifficulty of interpreting historical sources (for example, the\nunavoidable necessity Darnton faced of providing meaningful\ninterpretation of a range of documented actions that appear\nfundamentally irrational).\n\nAn important question that arises in recent historiography is that of\nthe status of the notion of “global history.” One\nimportant reason for thinking globally as an historian is the fact\nthat the history discipline—since the Greeks—has tended to\nbe Eurocentric in its choice of topics, framing assumptions, and\nmethods. Economic and political history, for example, often privileges\nthe industrial revolution in England and the creation of the modern\nbureaucratic state in France, Britain, and Germany, as being exemplars\nof “modern” development in economics and politics. This\nhas led to a tendency to look at other countries’ development as\nnon-standard or stunted. So global history is, in part, a framework\nwithin which the historian avoids privileging one regional center as\nprimary and others as secondary or peripheral. Bin Wong makes this\npoint in China Transformed (Wong 1997).\n\nSecond is the related fact that when Western historical\nthinkers—for example, Hegel, Malthus, Montesquieu—have\nturned their attention to Asia, they have often engaged in a high\ndegree of stereotyping without much factual historical knowledge. The\nideas of Oriental despotism, Asian overpopulation, and Chinese\nstagnation have encouraged a cartoonish replacement of the intricate\nand diverse processes of development of different parts of Asia by a\nsingle-dimensional and reductive set of simplifying frameworks of\nthought. This is one of the points of Edward Said’s critique of\norientalism (Said 1978). So doing “global” history means\npaying rigorous attention to the specificities of social, political,\nand cultural arrangements in other parts of the world besides\nEurope.\n\nSo a historiography that takes global diversity seriously should be\nexpected to be more agnostic about patterns of development, and more\nopen to discovery of surprising patterns, twists, and variations in\nthe experiences of India, China, Indochina, the Arab world, the\nOttoman Empire, and Sub-Saharan Africa. Variation and complexity are\nwhat we should expect, not stereotyped simplicity. Clifford\nGeertz’s historical reconstruction of the “theatre\nstate” of Bali is a case in point—he uncovers a complex\nsystem of governance, symbol, value, and hierarchy that represents a\nsubstantially different structure of politics than the models derived\nfrom the emergence of bureaucratic states in early modern Europe\n(Geertz 1980). A global history needs to free itself from\nEurocentrism.\n\nThis step away from Eurocentrism in outlook should also be accompanied\nby a broadening of the geographical range of what is historically\ninteresting. So a global history ought to be global and trans-national\nin its selection of topics—even while recognizing the fact that\nall historical research is selective. A globally oriented historian\nwill recognize that the political systems of classical India are as\ninteresting and complex as the organization of the Roman Republic.\n\nAn important current underlying much work in global history is the\nreality of colonialism through the nineteenth and twentieth centuries,\nand the equally important reality of anti-colonial struggles and\nnation building in the 1960s and 1970s. “The world” was\nimportant in the early-modern capitals of Great Britain, France,\nGermany, and Belgium because those nations exerted colonial rule in\nvarious parts of Africa, Asia, and South America. So there was a\nspecific interest in gaining certain kinds of knowledge about those\nsocieties—in order to better govern them and exploit them. And\npost-colonial states had a symmetrical interest in supporting global\nhistoriography in their own universities and knowledge systems, in\norder to better understand and better critique the forming relations\nof the past.\n\nA final way in which history needs to become global is to incorporate\nthe perspectives and historical traditions of historians in\nnon-western countries into the mainstream of discussion of major world\ndevelopments. Indian and Chinese historians have their own\nintellectual traditions in conducting historical research and\nexplanation; a global history is one that pays attention to the\ninsights and arguments of these traditions. So global historiography\nhas to do with a broadened definition of the arena of historical\nchange to include Europe, Asia, Africa, the Middle East, and the\nAmericas; a recognition of the complexity and sophistication of\ninstitutions and systems in many parts of the world; a recognition of\nthe trans-national interrelatedness that has existed among continents\nfor at least four centuries; and a recognition of the complexity and\ndistinctiveness of different national traditions of historiography\n\nDominic Sachsenmaier provides a significant recent discussion of some\nof these issues (Sachsenmaier 2011). Sachsenmaier devotes much of his\nattention to the last point mentioned here, the “multiple global\nperspectives” point. He wants to take this idea seriously and\ntry to discover some of the implications of different national\ntraditions of academic historiography. He writes, “It will\nbecome quite clear that in European societies the question of\nhistoriographical traditions tended to be answered in ways that were\nprofoundly different from most academic communities in other parts of\nthe world” (17).\n\nAs should be clear from these remarks, there is a degree of overlap\nbetween historiography and the philosophy of history in the fact that\nboth are concerned with identifying and evaluating the standards of\nreasoning that are used in various historical traditions. That said,\nhistoriography is generally more descriptive and less evaluative than\nthe philosophy of history. And it is more concerned with the specifics\nof research and writing than is the philosophy of history.\n5. Historical understanding and the twentieth century\n\nEvery period presents challenges for the historian, and every period\nraises problems for historiography and the philosophy of history. The\ntwentieth century is exceptional, however, even by this standard.\nEvents of truly global significance occurred from beginning to end.\nWar, totalitarianism, genocide, mass starvation, ideologies of murder\nand extermination, and states that dominated their populations with\nunprecedented violence all transpired during the century. The\nHolocaust (Snyder 2010, 2015), the Holodomor (Applebaum 2017), the\nGulag (Applebaum 2003), and the cultural and ideological premises of\nthe Nazi regime (Rabinbach et al 2020) have all presented historians\nwith major new challenges of research, framing, and understanding. How\nshould historians seek to come to grips with these complex and\nhorrifying circumstances? These occurrences were highly complex and\nextended and often hidden: many thousands of active participants, many\ngroups and populations, millions of victims, conflicting purposes and\ngoals, new organizations and institutions, numerous ideologies.\nMoreover, through too many of these novelties is woven the theme of\nevil – deliberate destruction, degradation, and murder of masses\nof innocent human beings. The historian of virtually any aspect of the\ntwentieth century is confronted with great problems of frame-setting,\nexplanatory purpose, and moral reflection.\n\nThese facts about the twentieth century raise problems for the\nphilosophy of history for several reasons. They challenge historians\nto consider the depth, detail, and human experience that the historian\nmust convey of the events and experiences that war, genocide, and\ntotalitarianism imposed on millions of people. The discovery and\ntruthful documentation of the extent and lived experience of these\ncrimes is a painful but crucial necessity. Second, historians are\nforced to reflect on the assumptions they bring to their research and\ninterpretations – assumptions about geography, political\ncausation, individual motivation, and behavior resulting in these\ncrimes. Third, historians must reconsider and sharpen their hypotheses\nabout causation of these vast and extended crimes against humanity.\nFourth, it appears inescapable that historians have a human\nresponsibility to contribute to worldwide changes in culture, memory,\nand politics in ways that make genocide and totalitarian oppression\nless likely in the future.\n\nThe ways in which historians have sought to understand the Holocaust\nhave undergone important historical realignment in the past twenty\nyears. Raul Hilberg (1961) and Lucy Dawidowicz (1975) captured much of\nthe postwar historical consensus about the Holocaust. However, recent\nhistorians have offered new ways of thinking about the Nazi plan of\nextermination. Timothy Snyder (2010, 2015) argues that the Nazi war of\nextermination against the Jews has been importantly\nmisunderstood—too centered on Germany, when the majority of\ngenocide and murder occurred further east, in the lands that he calls\nthe “bloodlands” of central Europe (Poland, Latvia,\nLithuania, Ukraine, the Soviet Union); largely focused on\nextermination camps, whereas most killing of Jews occurred near the\ncities and villages where they lived, and most commonly by gunfire;\ninsufficiently attentive to the relationship between extermination of\npeople and destruction of the institutions of state in subject\ncountries; and without sufficient attention to Hitler’s own\nworldview, within which the Nazi war of extermination against\nEurope’s Jews was framed. Alexander Prusin (2010) conceptualizes\nthe topic of mass murder in the period 1933–1945 in much the\nsame geographical terms. Like Snyder, Prusin defines his subject\nmatter as a region rather than a nation or collection of nations. The\nnational borders that exist within the region are of less importance\nin his account than the facts of ethnic, religious, and community\ndisparities that are evident across the region. Thus both historians\nargue that we need to understand the geography of the Holocaust\ndifferently. Snyder believes that these attempts at refocusing the way\nwe understand the Holocaust lead to a new assessment: bad as we\nthought the Holocaust was, it was much, much worse.\n\nAnother strand of re-thinking that has occurred in the study of the\nHolocaust concerns a renewed focus on the motivations of the ordinary\npeople who participated in the machinery of mass murder. A major field\nof research into ordinary behavior during the Holocaust was made\npossible by the availability of investigative files concerning the\nactions of a Hamburg police unit that was assigned special duties as\n“Order Police” in Poland in 1940. These duties amounted to\ncollecting and massacring large numbers of Jewish men, women, and\nchildren. Christopher Browning (1992) and Daniel Goldhagen (1996) made\nextensive use of investigatory files and testimonies of the men of\nReserve Police Battalion 101. Both books came to shocking conclusions:\nvery ordinary, middle-aged, apolitical men of the police unit picked\nup the work of murder and extermination with zeal and efficiency. They\nwere not coerced, they were not indoctrinated, and they were not\nderanged; and yet they turned to the work of mass murder with\nenthusiasm. A small percentage of the men of the unit declined the\nshooting assignments, but the great majority did not. Another\nimportant example of research on ordinary people committing mass\nmurder is Jan Gross’s (2001) case study of a single massacre of\nJews in Jedwabne, a small Polish town during the Nazi occupation, but\nnot ordered or directed by the German occupation. Instead, this was a\nlocal, indigenous action by non-Jewish residents in the town who\ngathered up their Jewish neighbors and then murdered large numbers of\nthem. Gross’s account has stimulated much debate, but Anna\nBikont (2015) validates almost every detail of Gross’s original\nnarrative.\n\nAs a different example, consider now the history of the Gulag in the\nSoviet Union. Anne Applebaum (2003) provides a detailed and honest\nhistory of the Gulag and its role in maintaining Soviet dictatorship.\nStalin’s dictatorship depended on a leader, a party, and a set\nof institutions that worked to terrorize and repress the population of\nthe USSR. The NKVD (the system of internal security police that\nenforced Stalin’s repression), a justice system that was\nembodied in the Moscow Show Trials of 1936–38, and especially\nthe system of forced labor and prison camps that came to be known as\nthe Gulag constituted the machinery of repression through which a\npopulation of several hundred million people were controlled,\nimprisoned, and repressed. Further, like the Nazi regime, Stalin used\nthe slave labor of the camps to contribute to the economic output of\nthe Soviet economy. Applebaum estimates that roughly two million\nprisoners inhabited several thousand camps of the Gulag at a time in\nthe 1940s, and that as many as 18 million people had passed through\nthe camps by 1953 (Applebaum 2003: 13). The economic role of the Gulag\nwas considerable; significant portions of Soviet-era mining, logging,\nand manufacturing took place within the forced labor camps of the\nGulag (13). Applebaum makes a crucial and important point about\nhistorical knowledge in her history of the Gulag: the inherent\nincompleteness of historical understanding and the mechanisms of\noverlooking and forgetting that get in the way of historical honesty.\nThe public outside the USSR did not want to know about these\nrealities. Applebaum notes that public knowledge of the camps in the\nWest was available, but was de-dramatized and treated as a fairly\nminor part of the reality of the USSR. The reality—that the USSR\nembodied and depended upon a massive set of concentrations camps where\nmillions of people were enslaved and sometimes killed—was never\na major part of the Western conception of the USSR. She comments, \"far\nmore common, however, is a reaction of boredom or indifference to\nStalinist terror\" (18). Wide knowledge in the West of the scope and\nspecific human catastrophe of the Gulag was first made available by\nAleksandr Isayevich Solzhenitsyn (1974).\n\nSimilar references could be offered concerning Stalin’s war on\nthe kulaks in the Ukraine (1930s), mass starvation in China\n(1958–61), the widespread violence of the Cultural Revolution in\nChina (1966–1976), and the use of violence in the American South\nto enforce Jim Crow-era race relations (1930s–1960s). In each\ncase terrible things took place on a wide scale, and barriers exist\nthat make it difficult for historians and the public to come to know\nthe details of these periods.\n\nThe twentieth century poses one additional challenge for the\nhistorian because it falls within the human memories of the\nliving generation of historians grappling with its intricacies. When\nTony Judt writes (2006) about the fall of Ceaușescu in Romania in\n1989, or Timothy Snyder (2010) writes about the murderous actions of\nGerman order police in Ukraine in 1940, or Marc Bloch (1949) writes\nabout the “strange defeat” of France in 1940, they are\nwriting about events for which they themselves, or their parents, or\nPoles and Ukrainian Jews with whom they can interact, have direct\nlived experiences and memories. Timothy Snyder’s style of\nhistorical writing suggests that the nearness in time of the killings\nin the bloodlands both supports and warrants an especially personal\nand individual approach; thus Snyder’s use of many individual\nstories of victims of the killings of peasants, Jews, and other human\nvictims of the killing machines of Hitler and Stalin suggests that he\nbelieves it is important for the historian to make an effort to convey\nthe individual meanings of these events affecting millions of people.\nHow does this accessibility of the recent past affect the problems\nfacing the historian? Does it influence the ways in which historians\nselect events, causes, and actions as “crucial”? Does this\nexperiential access through living memory provide a more secure form\nof historical evidence than other sources available to the historian?\nDoes it give rise to an experiential content and detail to historical\nwriting that solve an interpretive problem for the reader – for\nexample, how to put oneself in the position of a Ukrainian peasant\nslowly starving to death? Did the stories told in the Judt household\nin London in 1942 about beloved cousins then facing deadly threats in\nBrussels shape the historical consciousness of the adult historian\n(Judt and Snyder 2012)? Did Marc Bloch’s own experience as a\nFrench army officer in defeat at Dunkirk influence the way that he\nunderstood war and violence? Access to individuals who lived through\nthe Holodomor or the Spanish Civil War is of course valuable\nhistorical evidence. Here too, however, Marc Bloch has important\ninsights, for Bloch specifically challenges the idea that participants\nhave an inherently more reliable or complete form of knowledge than\nmore temporally distant historians (1953: chapter II). Memories and\npersonal accounts are valuable for the historian, but equally,\nhistorians have access to other forms of historical evidence\n(archaeological, archival, government records, …) which may be\ncomparably important and epistemically secure in attempting to piece\ntogether the complex history of Stalin’s war on the Ukrainian\npeasantry.\n\nThese topics in twentieth-century history create an important reminder\nfor historians and for philosophers: a truthful understanding of\ninhuman atrocity is deeply important for humanity, and it is difficult\nto attain. We learn from Judt, Snyder, and Applebaum that there are\npowerful mechanisms of deception and forgetting that stand in the way\nof an honest accounting of these periods of the recent human past.\nDiscovering and telling the truth about our past is the highest and\nmost important moral imperative that history conveys.\n6. Ethics, history, and memory\n\nAs the previous section suggests, there is an ethical dimension\ninvolved in the quest for historical knowledge. Historians have\nobligations of truthfulness and objectivity; peoples have obligations\nof honest recognition; and nations have obligations of memory and\nreconciliation.\n\nHistorians themselves have obligations of truthfulness and objectivity\nin the accounts they provide of the past. This topic has occupied much\nof the discussion of history and ethics in the past few years (Fay\n2004). Much of this discussion has centered on the intellectual\nvirtues to which historians need to aspire, such as truthfulness,\nobjectivity, and persistence (Creyghton et al 2016, Paul 2015).\nPerhaps more generally, we might argue that historians have an\nobligation to deliberately and actively include those aspects of the\npast for further research that are the most morally\ntroublesome—for example, the origins and experience of slavery\nduring the eighteenth century in the American South, or the role of\nthe Gulag in the Soviet Union in the twentieth century. We may\nreasonably fault the historian of the American South in the nineteenth\ncentury who confines her investigation to the economics of the cotton\nindustry without examining the role of slavery in that industry, or\nthe historian of the USSR who studies the institutions of engineering\nresearch in the 1950s while ignoring the fact of forced labor camps.\nHistorians have an obligation to squarely confront the hard truths of\ntheir subject matter.\n\nThere is a broader ethical question to ask about history that goes\nbeyond the professional ethics of the historian to the\nresponsibilities of the public in relation to its own history. The\nfacts of genocide and other crimes against humanity make it clear that\nthere are moral reasons for believing that all of humanity has a moral\nresponsibility to attempt to discover our past with honesty and\nexactness. In particular, the facts of past horrific actions\n(genocide, mass repression, slavery, suppression of ethnic minorities,\ndictatorship) create a moral responsibility for historians and the\npublic alike to uncover the details, causes, and consequences of those\nactions.\n\nThe thread of honesty and truthfulness runs through all of these\nethical issues. Tony Judt (1992) argues that a people or nation at a\npoint in time have a collective responsibility to face the facts of\nits own history honestly and without mythology. Judt’s points\ncan be distilled into a few key ideas. Knowledge of the past matters\nin the present; being truthful about the past is a key responsibility\nfor all of us. Standing in the way of honest recognition is the fact\nthat oppressors and tyrants are invariably interested in concealing\ntheir culpability, while “innocent citizens” are likewise\ninclined to minimize their own involvement in the crimes of their\ngovernments. The result is \"myth-making\", according to Judt. Anna\nWylegala (2017) illustrates the moral importance and complexity of\nthis kind of investigation with regard to collective memory in\npost-1991 Ukraine. The history of the twentieth century has shown\nitself to be especially prone to myth-making, whether about resistance\nto Nazi occupation or refusal to collaborate with Soviet-installed\nregimes in Poland or Czechoslovakia. Judt (1992) argues that a very\npervasive process of myth-making and forgetting has been a deep part\nof the narrative-making in post-war Europe. But, Judt argues, bad\nmyths give rise eventually to bad collective behavior—more\nconflict, more tyranny, more violence. So the work of honest history\nis crucial to humanity’s ability to achieve a better future.\nJudt expresses throughout his work a credo of truth-telling about the\npast: we have a weighty obligation to discover, represent, and\nunderstand the circumstances of our past, even when those facts are\ndeeply unpalatable. Myth-making about the past is not only bad history\nand bad politics, it is morally deficient.\n\nThis observation brings us to a final way in which moral questions\narise in the context of honest history. The crimes of the past have\nconsequences in the present. The facts of trans-Atlantic slavery\ncontinue to have consequences for millions of descendants of the men\nand women who were transported from Africa to the Americas; the facts\nof the Rwandan genocide have consequences for the living victims of\nthese mass killings and their kin; and the fact of colonial\nexploitation of the Congo or southern Africa has consequences for the\ncurrent poverty of much of Africa. Does knowledge of the crimes of the\npast create for the current generation an obligation of engagement in\ncontributing actively to healing those wounds in the present and\npreventing their recurrence in the future? Does “truth and\nreconciliation” require more than simply recognizing ugly truths\nabout the past? Does it require that we act differently, individually\nand collectively? It is of course a tragic and immutable reality of\nthe human condition that the past cannot be changed; the murdered\ncannot be unmurdered, and the primary perpetrators of horrific crimes\nwithin a few generations are certainly beyond the reach of justice.\nThe future is deeply contingent, while the past is fixed and\nunchangeable. But does this immutability imply that the present\ngeneration has no obligations created by past crimes? Or rather, does\nknowing the truth about our past create for us the obligation to learn\nfrom those tragic human actions how to avoid such crimes in the\nfuture? Does honest knowledge of the human crimes of the past bring\nwith it an obligation to strive in good faith to address the\nconsequences of those crimes in the present? Finally, can knowledge of\nhistory help us to become more empathetic, more just, and more\nfarsighted in our dealings with each other in the grand affairs that\nmake up future history? One would hope so; and perhaps this is the\nmost pressing moral obligation of all that is created by our\nrecognition of our own historicity.\n", "bibliography": {"categories": [], "cat_ref_text": {"ref_list": ["Applebaum, Anne, 2003. <em>Gulag: A history</em>, New York:\nDoubleday", "–––, 2017. <em>Red famine: Stalin’s war on\nUkraine</em>, New York: Doubleday.", "Anderson, Benedict R. O’G., 1983. <em>Imagined communities\nReflections on the origin and spread of nationalism</em>, London:\nVerso.", "Ankersmit, F. R., 1995. <em>Language and historical\nexperience</em>, Bielefeld: ZiF.", "Ankersmit, F. R., and Hans Kellner (eds.), 1995. <em>A new\nphilosophy of history</em>, Chicago: University of Chicago Press.", "Avineri, Shlomo, 1972. <em>Hegel’s theory of the modern\nstate</em> (Cambridge studies in the history and theory of politics),\nLondon: Cambridge University Press.", "Bentley, Michael (ed.), 1997. <em>Companion to\nhistoriography</em>, London; New York: Routledge.", "Berkhofer, Robert F., 1995. <em>Beyond the great story: history as\ntext and discourse</em>, Cambridge, MA: Belknap Press of Harvard\nUniversity Press.", "Berlin, Isaiah, 2000. <em>Three critics of the Enlightenment:\nVico, Hamann, Herder</em>, H. Hardy (ed.), Princeton, NJ: Princeton\nUniversity Press.", "Bikont, Anna, 2015. <i>The Crime and the silence: Confronting the\nmassacre of Jews in wartime Jedwabne</i>, Farrar Straus and\nGiroux.", "Bloch, Marc, 1949 [1946]. <em>Strange defeat: A statement of\nevidence written in 1940</em>, translated by Gerard Hopkins, Oxford:\nOxford University Press, 1946.", "–––, 1953. <i>The Historian’s Craft</i>,\nNew York: Knopf.", "Bouton, Christophe, 2016. “The Critical Theory of History:\nRethinking the Philosophy of History in the Light of Koselleck’s\nWork”, <em>History and Theory</em>, 55(2): 163–184. ", "Breisach, Ernst (ed.), 2007. <em>Historiography: Ancient,\nmedieval, and modern</em>, 3rd edition, Chicago: University of Chicago\nPress.", "Browning, Christopher R., 1992. <i>Ordinary Men: Reserve Police\nBattalion 101 and the Final Solution in Poland</i>, New York:\nHarperCollins.", "Brunner, Otto, Werner Conze, and Reinhart Koselleck (eds.),\n1972–97. <em>Geschichtliche Grundbegriffe. Historisches Lexikon\nzur politisch-sozialen Sprache in Deutschland</em>, 8 volumes,\nStuttgart: Klett.", "Burguière, André, 2009. <i>The Annales School: An\nintellectual history</i>, Ithaca, NY: Cornell University Press.", "Collingwood, R. G., 1946. <em>The idea of history</em>, Oxford:\nClarendon Press.", "Condorcet, Jean-Antoine-Nicolas de Caritat, 1795 [1979].\n<em>Sketch for a historical picture of the progress of the human\nmind</em>, Westport, CT: Greenwood Press, 1979.", "Creyghton, Camille, Pieter Huistra, Sarah Keymeulen, and Herman\nPaul, 2016. “Virtue Language in Historical Scholarship: The\nCases of Georg Waitz, Gabriel Mond and Henri Pirenne.”\n<i>History of European Ideas</i>, 42(7): 924–36.", "Cronon, William, 1991. <em>Nature’s metropolis: Chicago and\nthe great west</em>, New York: W. W. Norton.", "Danto, Arthur Coleman, 1965. <em>Analytical philosophy of\nhistory</em>, Cambridge: Cambridge University Press.", "Darnton, Robert, 1984. <em>The great cat massacre and other\nepisodes in French cultural history</em>, New York: Basic Books.", "Davidson, Donald, 1963. “Actions, Reasons, and\nCauses”, <em>Journal of Philosophy</em>, 60(23):\n685–700.", "Dawidowicz, Lucy S., 1975. <i>The War against the Jews,\n1933–1945</i>, New York: Holt, Rinehart and Winston.", "Dawson, Christopher, 1929. <em>Progress and religion, an\nhistorical enquiry</em>, New York: Sheed and Ward.", "De Vries, Bert, and Johan Goudsblom, 2002. <em>Mappae mundi:\nhumans and their habitats in a long-term socio-ecological perspective:\nmyths, maps and models</em>, Amsterdam: Amsterdam University\nPress.", "Diamond, Jared M., 1997. <em>Guns, germs, and steel: The fates of\nhuman societies</em>, 1st edition, New York: W.W. Norton.", "Dilthey, Wilhelm, 1883 [1989]. <em>Introduction to the human\nsciences</em>, R. A. Makkreel and F. Rodi (eds.), Princeton, NJ:\nPrinceton University Press, 1989.", "–––, 1860–1903 [1996]. <em>Hermeneutics\nand the study of history</em>, R. A. Makkreel and F. Rodi (eds.),\nPrinceton, NJ: Princeton University Press, 1996.", "–––, 1910 [2002]. <em>The formation of the\nhistorical world in the human sciences</em>, R. A. Makkreel, F. Rodi\nand W. Dilthey (eds.), Princeton, NJ: Princeton University Press, 2002.", "Donagan, Alan. 1966. “The Popper-Hempel Theory\nReconsidered”, in <em>Philosophical Analysis and History</em>,\nW. H. Dray (ed.), New York: Harper &amp; Row, pp. 127–159.", "Dray, William, 1957. <em>Laws and explanation in history</em>,\nLondon: Oxford University Press.", "–––, 1964. <em>Philosophy of history</em>,\nEnglewood Cliffs, NJ: Prentice-Hall.", "––– (ed.), 1966. <em>Philosophical analysis and\nhistory</em>, New York: Harper &amp; Row.", "Elster, Jon, 1989. <em>Nuts and bolts for the socialsciences</em>,\nCambridge: Cambridge University Press.", "Fay, Brian (ed.), 2004. “Historians and Ethics”,\n<i>History and Theory</i>, 43 (Theme Issue).", "Foucault, Michel, 1971. <em>The order of things: An archaeology of\nthe human sciences</em>, 1st American edition, <em>World of man</em>,\nNew York: Pantheon Books.", "Gardiner, Patrick L., 1952. <em>The nature of historical\nexplanation</em>, London: Oxford University Press.", "––– (ed.), 1974. <em>The philosophy of\nhistory</em>, London, New York: Oxford University Press.", "Geertz, Clifford, 1980. <em>Negara: The theatre state in\nNineteenth-Century Bali</em>, Princeton: Princeton University\nPress.", "Goldhagen, Daniel Jonah, 1996. <i>Hitler’s willing\nexecutioners: Ordinary germans and the Holocaust</i>, 1st edition, New\nYork: Knopf: Distributed by Random House.", "Gross, Jan Tomasz, 2001. <i>Neighbors: The destruction of the\nJewish community in Jedwabne, Poland</i>, Princeton: Princeton\nUniversity Press.", "Hacking, Ian, 1999. <em>The social construction of what?</em>,\nCambridge, MA: Harvard University Press.", "–––. 2002. <em>Historical ontology</em>,\nCambridge, MA, London: Harvard University Press.", "Hart, H. L. A., and Tony Honoré, 1959. <em>Causation in the\nlaw</em>, Oxford: Clarendon Press.", "Hedström, Peter, and Richard Swedberg (eds.), 1998.\n<em>Social mechanisms: An analytical approach to social theory</em>,\n<em>Studies in rationality and social change</em>, Cambridge, New\nYork: Cambridge University Press.", "Hegel, Georg Wilhelm Friedrich, 1824a [1953]. <em>Reason in\nhistory, a general introduction to the philosophy of history</em>, New\nYork: Liberal Arts Press, 1953.", "–––, 1824b [1956]. <em>The philosophy of\nhistory</em>, New York: Dover Publications, 1956.", "–––, 1821 [1967]. <em>The philosophy of\nright</em>, T. M. Knox (ed.), London, New York,: Oxford University\nPress, 1967.", "–––, 1857 [1975]. <em>Lectures on the philosophy\nof world history</em>, translated by H. B. Nisbet, Cambridge:\nCambridge University Press, 1975.", "–––, 1807 [1977]. <em>Phenomenology of\nspirit</em>, translated by A. V. Miller, edited by J. N. Findlay,\nOxford: Clarendon Press, 1977.", "Herder, Johann Gottfried, 1791 [1968]. <em>Reflections on the\nphilosophy of the history of mankind</em>, F. E. Manuel (ed.),\n<em>Classic European historians</em>, Chicago: University of Chicago\nPress, 1968.", "–––, 1800–1877 [1996]. <em>On world\nhistory: An anthology</em>, H. Adler and E. A. Menze (eds.),\n<em>Sources and studies in world history</em>, Armonk, NY: M.E.\nSharpe, 1996.", "Hilberg, Raul, 1961. <i>The Destruction of the European Jews</i>,\nChicago: Quadrangle Books.", "Hinton, William, 1966. <em>Fanshen: A documentary of revolution in\na Chinese village</em>, New York: Vintage Books.", "Huang, Philip C., 1990. <em>The peasant family and rural\ndevelopment in the Yangzi Delta, 1350–1988</em>, Stanford:\nStanford University Press.", "Hume, David, 1754–1762 [1983]. <em>The history of\nEngland</em>, W. B. Todd (ed.), 6 volumes, Indianapolis: Liberty\nClassics, 1983.", "Judt, Tony, 1992. “The Past Is Another Country: Myth and\nMemory in Postwar Europe”, <i>Daedalus</i>, 121(4):\n83–118.", "–––, 2006. <em>Postwar: A history of Europe\nsince 1945</em>, New York: Penguin Books.", "Kammen, Michael G., 1991. <em>Mystic chords of memory: The\ntransformation of tradition in American culture</em>, 1st edition, New\nYork: Knopf.", "Kant, Immanuel, 1784–6 [1963]. <em>On history</em>, L. W.\nBeck (ed.), Indianapolis: Bobbs-Merrill, 1963.", "–––, 1784–5 [1990]. <em>Foundations of the\nmetaphysics of morals and, What is enlightenment</em>, 2nd revised\nedition, <em>The Library of liberal arts</em>, New York:\nMacmillan, 1990.", "Kojève, Alexandre, 1969. <em>Introduction to the reading of\nHegel</em>, R. Queneau (ed.), New York: Basic Books.", "Koselleck, Reinhart, 1988 [1959]. <em>Critique And crisis:\nEnlightenment and the parthogenesis of modern society</em>, Oxford:\nBerg, 1959.", "–––, 2002. <em>The practice of conceptual\nhistory: Timing history, spacing concepts</em>, Stanford: Stanford\nUniversity Press.", "–––, 2004. <em>Futures and past: On the\nsemantics of historical time</em>, New York: Columbia University\nPress.", "LaCapra, Dominick, 1994. <em>Representing the Holocaust: History,\ntheory, trauma</em>, Ithaca, NY: Cornell University Press.", "–––, 1998. <em>History and memory after\nAuschwitz</em>, Ithaca, NY: Cornell University Press.", "Lattimore, Owen, 1932. <em>Manchuria: Cradle of Conflict</em>, New\nYork: Macmillan.", "Leibniz, Gottfried Wilhelm, 1709 [1985]. <em>Theodicy: Essays on\nthe goodness of God, the freedom of man, and the origin of evil</em>,\nA. M. Farrer (ed.), La Salle, IL: Open Court, 1985.", "Le Roy Ladurie, Emmanuel, 1979. <em>Montaillou, the promised land\nof error</em>, New York: Vintage.", "Little, Daniel, 2010. <em>New contributions to the philosophy of\nhistory</em>, Dordrecht: Springer Science.", "–––, 2017. “Microfoundations”, in\n<i>The Routledge Companion to Philosophy of Social Science</i>, edited\nby Lee McIntyre and Alex Rosenberg. London; New York: Routledge, pp.\n228–239.", "–––, 2018. “Disaggregating Historical\nExplanation: The Move to Social Mechanisms”, in <i>Routledge\nHandbook of Mechanisms and Mechanical Philosophy</i>, edited by Stuart\nGlennan and Phyllis Illari, New York: Routledge, pp. 413–422.\n", "Livi-Bacci, Massimo, 2007. <em>A concise history of world\npopulation</em>, 4th edition, Malden, MA: Blackwell.", "Mackie, J. L., 1965. “Causes and Conditions”,\n<em>American Philosophical Quarterly</em>, 2: 245–264.", "–––, 1974. <em>The cement of the universe; a\nstudy of causation</em>, Oxford: Clarendon Press.", "Mandelbaum, Maurice, 1971. <em>History, man, &amp; reason; A study\nin nineteenth-century thought</em>, Baltimore: Johns Hopkins\nPress.", "Mann, Michael, 1986. <em>The sources of social power. A history of\npower from the beginning to A.D. 1760</em>, Volume 1, Cambridge:\nCambridge University Press.", "Maritain, Jacques, 1957. <em>On the philosophy of history</em>,\nNew York: Scribner.", "Marx, Karl, 1852 [2005]. <em>The eighteenth Brumaire of Louis\nBonaparte</em>, New York: Mondial, 2005", "Marx, Karl, and Frederick Engels, 1848 [1974]. <em>The Communist\nManifesto</em>, in <em>The Revolutions of 1848: Political\nWritings</em> (Volume 1), D. Fernbach (ed.), New York: Penguin\nClassics, 1974, pp. 62–98.", "–––, 1845–49 [1970]. <em>The\nGerman ideology</em>, 3rd revised edition. Moscow: Progress\nPublishers, 1970.", "McNeill, William, 1976. <em>Plagues and peoples</em>, Garden City:\nDoubleday.", "Mink, Louis O., 1966. “The autonomy of historical\nunderstanding”d,. <em>History and Theory</em>, 5(1):\n24–47.", "Mink, Louis O., Brian Fay, Eugene O. Golob, and Richard T. Vann\n(eds.), 1987. <em>Historical understanding</em>, Ithaca, NY: Cornell\nUniversity Press.", "Momigliano, Arnaldo, 1990. <em>The classical foundations of modern\nhistoriography</em> (Sather Classical Lectures), Berkeley: University\nof California Press.", "Montesquieu, Charles de Secondat, 1748. <em>The spirit of the\nlaws</em>, A. M. Cohler, B. C. Miller and H. Stone (eds.),\n<em>Cambridge texts in the history of political thought</em>,\nCambridge, New York: Cambridge University Press, 1989.", "Nagel, Ernest, 1961. <em>The structure of science; problems in the\nlogic of scientific explanation</em>, New York: Harcourt Brace &amp;\nWorld.", "O’Brien, Dennis, 1975. <em>Hegel on reason and history: A\ncontemporary interpretation</em>, Chicago: University of Chicago\nPress.", "O’Brien, P. K., and C. Keyder, 1978. <em>Economic growth in\nBritain and France, 1780–1914</em>, London: Allen and\nUnwin.", "Olson, Niklas, 2012. <em>History in the plural: An introduction to\nthe work of Reinhart Koselleck</em>, New York: Berghahn Books.", "Outhwaite, William, 1975. <em>Understanding social life: The\nmethod called verstehen</em>, London: George Allen &amp; Unwin.", "Pankakoski, Timo, 2010. “Conflict, Context, Concreteness:\nKoselleck and Schmitt on Concepts”, <em>Political Theory</em>,\n38(6): 749–779.", "Passmore, J. A., 1966. “The Objectivity of History”,\nin <em>Philosophical Analysis and History</em>, W. H. Dray (ed.), New\nYork: Harper &amp; Row, pp. 75–94.", "Paul, Herman, 2015. <i>Key issues in historical theory</i>,\nLondon; New York: Routledge.", "Pierson, Paul, 2004. <i>Politics in Time: History, institutions,\nand social analysis</i>, Princeton: Princeton University Press.", "Pompa, Leon, 1990. <em>Human nature and historical knowledge:\nHume, Hegel, and Vico</em>, Cambridge, New York: Cambridge University\nPress.", "Prusin, Alexander Victor, 2010. <i>The lands between: Conflict in\nthe East European borderlands, 1870–1992</i>, Oxford, New York:\nOxford University Press.", "Rabinbach, Anson, Stephanos Geroulanos, and Dagmar Herzog, 2020.\n<i>Staging the Third Reich: Essays in cultural and intellectual\nhistory</i>, London; New York: Routledge/Tayor &amp; Francis\nGroup.", "Ranke, Leopold von, 1881 [1973]. <em>The theory and practice of\nhistory</em>, W. Humboldt (ed.), <em>The European historiography\nseries</em>, Indianapolis, IN: Bobbs-Merrill, 1973.", "Ricoeur, Paul, 2004. <em>Memory, history, forgetting</em>,\ntranslated by Kathleen Blamey and David Pellauer, Chicago: University\nof Chicago Press.", "–––, 1984, 1985, 1988  <em>Time and\nnarrative (Volumes 1–3) </em>, translated by Kathleen McLaughlin and\nDavid Pellauer, Chicago: University of Chicago Press.", "Rorty, Richard, 1979. <em>Philosophy and the mirror of\nnature</em>, Princeton: Princeton University Press.", "Rousseau, Jean Jacques, 1762a [1983]. <em>On the social contract ;\nDiscourse on the origin of inequality; Discourse on political\neconomy</em>, Indianapolis, IN: Hackett Publishing Co., 1983", "Rousseau, Jean-Jacques, 1762b [2003]. <em>Emile, or, Treatise on\neducation</em>, Amherst, NY: Prometheus Books.", "Rowe, William T., 2007. “Owen Lattimore, Asia, and\nComparative History”, <em>Journal of Asian Studies</em>, 66(3):\n759–786.", "Rust, Eric Charles, 1947. <em>The Christian understanding of\nhistory</em>, London: Lutterworth Press.", "Sachsenmaier, Dominic, 2011. <em>Global perspectives on global\nhistory: Theories and approaches in a connected world</em>, Cambridge:\nCambridge University Press.", "Said, Edward W., 1978. <em>Orientalism</em>, New York: Random\nHouse.", "Schama, Simon, 1991. <em>Dead certainties: Unwarranted\nspeculations</em>, 1st edition, New York: Knopf.", "Schleiermacher, Friedrich, 1838 [1998]. <em>Hermeneutics and\ncriticism and other writings</em>, A. Bowie (ed.), Cambridge, New\nYork: Cambridge University Press, 1998.", "Scriven, Michael, 1962. “Explanations, Predictions, and\nLaws”, in <em>Minnesota Studies in the Philosophy of\nScience</em> (Volume 3), H. Feigl and G. Maxwell (eds.), Minneapolis:\nUniversity of Minnesota Press, pp. 170–230/", "Sherratt, Yvonne, 2006. <em>Continental philosophy of social\nscience: Hermeneutics, genealogy, critical theory</em>, Cambridge, New\nYork: Cambridge University Press.", "Skinner, G. William, 1977. “Regional Urbanization in\nNineteenth-Century China”, in <em>In The City in Late Imperial\nChina</em>, G. W. Skinner (ed.), Stanford: Stanford University Press,\np. 211–249.", "Smith, Adam, 1776 [1976]. <em>An inquiry into the nature and\ncauses of the wealth of nations</em>, R. H. Campbell and A. S. Skinner\n(eds.), <em>Glasgow edition of the works and correspondence of Adam\nSmith</em>, Oxford: Clarendon Press, 1976.", "Snyder, Timothy, 2010. <i>Bloodlands: Europe between Hitler and\nStalin</i>, New York: Basic Books.", "–––, 2015. <i>Black Earth: The Holocaust as\nhistory and warning</i>, New York: Tim Duggan Books.", "Solzhenitsyn, Aleksandr Isaevich, 1974. <i>The Gulag Archipelago,\n1918–1956: An Experiment in Literary Investigation</i>, New\nYork: Harper &amp; Row.", "Spengler, Oswald, and Charles Francis Atkinson, 1934. <em>The\ndecline of the west</em>, New York: A.A. Knopf.", "Taylor, Charles, 1975. <em>Hegel</em>, Cambridge; New York:\nCambridge University Press.", "–––, 1985. “Interpretation and the\nSciences of Man”, in <em>Philosophy and the Human Sciences:\nPhilosophical Papers 2</em>, C. Taylor (ed.), Cambridge: Cambridge\nUniversity Press, pp. 15–57. ", "Toynbee, Arnold Joseph, 1934. <em>A study of history</em>, London:\nOxford University Press.", "Tucker, Aviezer (ed.), 2009. <em>A companion to the philosophy of\nhistory and historiography</em>, Chichester, U.K., Malden, MA:\nWiley-Blackwell.", "Vico, Giambattista, 1725. <em>The first new science</em>, L. Pompa\n(ed.), <em>Cambridge texts in the history of political thought</em>,\nCambridge, New York: Cambridge University Press, 2002.", "Waldron, Arthur, 1990. <em>The Great Wall of China: From history\nto myth</em>, Cambridge, New York: Cambridge University Press.", "Walsh, William Henry, 1960 [1951]. <em>Philosophy of history: An\nintroduction,</em> New York: Harper, 1951.", "Whatmore, Richard and Brian Young (eds.), 2015. <em>A companion to\nintellectual history</em>, New York: Wiley Blackwell.", "White, Hayden V., 1973. <em>Metahistory: The historical\nimagination in nineteenth-century Europe</em>, Baltimore: Johns\nHopkins University Press.", "Wittfogel, Karl, 1935. “The Stages of Development in Chinese\nEconomic and Social History”, in <em>The Asiatic Mode of\nProduction: Science and Politics</em>, A. M. Bailey and J. R. Llobera\n(ed.), London: Routledge and Kegan Paul, 1981, pp. 113–40.", "Wong, R. Bin, 1997. <em>China transformed: Historical change and\nthe limits of European experience</em>, Ithaca, NY: Cornell University\nPress.", "Wylegala, Anna, 2017. “Managing the Difficult Past:\nUkrainian Collective Memory and Public Debates on History”,\n<i>Nationalities Papers</i>, 45(5): 780–97.", "Zahle Julie and Finn Collin, eds., 2014. <i>Individualism, holism,\nexplanation and emergence</i>, Dordrecht, London, New York:\nSpringer."]}, "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Applebaum, Anne, 2003. <em>Gulag: A history</em>, New York:\nDoubleday</li>\n<li>–––, 2017. <em>Red famine: Stalin’s war on\nUkraine</em>, New York: Doubleday.</li>\n<li>Anderson, Benedict R. O’G., 1983. <em>Imagined communities\nReflections on the origin and spread of nationalism</em>, London:\nVerso.</li>\n<li>Ankersmit, F. R., 1995. <em>Language and historical\nexperience</em>, Bielefeld: ZiF.</li>\n<li>Ankersmit, F. R., and Hans Kellner (eds.), 1995. <em>A new\nphilosophy of history</em>, Chicago: University of Chicago Press.</li>\n<li>Avineri, Shlomo, 1972. <em>Hegel’s theory of the modern\nstate</em> (Cambridge studies in the history and theory of politics),\nLondon: Cambridge University Press.</li>\n<li>Bentley, Michael (ed.), 1997. <em>Companion to\nhistoriography</em>, London; New York: Routledge.</li>\n<li>Berkhofer, Robert F., 1995. <em>Beyond the great story: history as\ntext and discourse</em>, Cambridge, MA: Belknap Press of Harvard\nUniversity Press.</li>\n<li>Berlin, Isaiah, 2000. <em>Three critics of the Enlightenment:\nVico, Hamann, Herder</em>, H. Hardy (ed.), Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Bikont, Anna, 2015. <i>The Crime and the silence: Confronting the\nmassacre of Jews in wartime Jedwabne</i>, Farrar Straus and\nGiroux.</li>\n<li>Bloch, Marc, 1949 [1946]. <em>Strange defeat: A statement of\nevidence written in 1940</em>, translated by Gerard Hopkins, Oxford:\nOxford University Press, 1946.</li>\n<li>–––, 1953. <i>The Historian’s Craft</i>,\nNew York: Knopf.</li>\n<li>Bouton, Christophe, 2016. “The Critical Theory of History:\nRethinking the Philosophy of History in the Light of Koselleck’s\nWork”, <em>History and Theory</em>, 55(2): 163–184. </li>\n<li>Breisach, Ernst (ed.), 2007. <em>Historiography: Ancient,\nmedieval, and modern</em>, 3rd edition, Chicago: University of Chicago\nPress.</li>\n<li>Browning, Christopher R., 1992. <i>Ordinary Men: Reserve Police\nBattalion 101 and the Final Solution in Poland</i>, New York:\nHarperCollins.</li>\n<li>Brunner, Otto, Werner Conze, and Reinhart Koselleck (eds.),\n1972–97. <em>Geschichtliche Grundbegriffe. Historisches Lexikon\nzur politisch-sozialen Sprache in Deutschland</em>, 8 volumes,\nStuttgart: Klett.</li>\n<li>Burguière, André, 2009. <i>The Annales School: An\nintellectual history</i>, Ithaca, NY: Cornell University Press.</li>\n<li>Collingwood, R. G., 1946. <em>The idea of history</em>, Oxford:\nClarendon Press.</li>\n<li>Condorcet, Jean-Antoine-Nicolas de Caritat, 1795 [1979].\n<em>Sketch for a historical picture of the progress of the human\nmind</em>, Westport, CT: Greenwood Press, 1979.</li>\n<li>Creyghton, Camille, Pieter Huistra, Sarah Keymeulen, and Herman\nPaul, 2016. “Virtue Language in Historical Scholarship: The\nCases of Georg Waitz, Gabriel Mond and Henri Pirenne.”\n<i>History of European Ideas</i>, 42(7): 924–36.</li>\n<li>Cronon, William, 1991. <em>Nature’s metropolis: Chicago and\nthe great west</em>, New York: W. W. Norton.</li>\n<li>Danto, Arthur Coleman, 1965. <em>Analytical philosophy of\nhistory</em>, Cambridge: Cambridge University Press.</li>\n<li>Darnton, Robert, 1984. <em>The great cat massacre and other\nepisodes in French cultural history</em>, New York: Basic Books.</li>\n<li>Davidson, Donald, 1963. “Actions, Reasons, and\nCauses”, <em>Journal of Philosophy</em>, 60(23):\n685–700.</li>\n<li>Dawidowicz, Lucy S., 1975. <i>The War against the Jews,\n1933–1945</i>, New York: Holt, Rinehart and Winston.</li>\n<li>Dawson, Christopher, 1929. <em>Progress and religion, an\nhistorical enquiry</em>, New York: Sheed and Ward.</li>\n<li>De Vries, Bert, and Johan Goudsblom, 2002. <em>Mappae mundi:\nhumans and their habitats in a long-term socio-ecological perspective:\nmyths, maps and models</em>, Amsterdam: Amsterdam University\nPress.</li>\n<li>Diamond, Jared M., 1997. <em>Guns, germs, and steel: The fates of\nhuman societies</em>, 1st edition, New York: W.W. Norton.</li>\n<li>Dilthey, Wilhelm, 1883 [1989]. <em>Introduction to the human\nsciences</em>, R. A. Makkreel and F. Rodi (eds.), Princeton, NJ:\nPrinceton University Press, 1989.</li>\n<li>–––, 1860–1903 [1996]. <em>Hermeneutics\nand the study of history</em>, R. A. Makkreel and F. Rodi (eds.),\nPrinceton, NJ: Princeton University Press, 1996.</li>\n<li>–––, 1910 [2002]. <em>The formation of the\nhistorical world in the human sciences</em>, R. A. Makkreel, F. Rodi\nand W. Dilthey (eds.), Princeton, NJ: Princeton University Press, 2002.</li>\n<li>Donagan, Alan. 1966. “The Popper-Hempel Theory\nReconsidered”, in <em>Philosophical Analysis and History</em>,\nW. H. Dray (ed.), New York: Harper &amp; Row, pp. 127–159.</li>\n<li>Dray, William, 1957. <em>Laws and explanation in history</em>,\nLondon: Oxford University Press.</li>\n<li>–––, 1964. <em>Philosophy of history</em>,\nEnglewood Cliffs, NJ: Prentice-Hall.</li>\n<li>––– (ed.), 1966. <em>Philosophical analysis and\nhistory</em>, New York: Harper &amp; Row.</li>\n<li>Elster, Jon, 1989. <em>Nuts and bolts for the socialsciences</em>,\nCambridge: Cambridge University Press.</li>\n<li>Fay, Brian (ed.), 2004. “Historians and Ethics”,\n<i>History and Theory</i>, 43 (Theme Issue).</li>\n<li>Foucault, Michel, 1971. <em>The order of things: An archaeology of\nthe human sciences</em>, 1st American edition, <em>World of man</em>,\nNew York: Pantheon Books.</li>\n<li>Gardiner, Patrick L., 1952. <em>The nature of historical\nexplanation</em>, London: Oxford University Press.</li>\n<li>––– (ed.), 1974. <em>The philosophy of\nhistory</em>, London, New York: Oxford University Press.</li>\n<li>Geertz, Clifford, 1980. <em>Negara: The theatre state in\nNineteenth-Century Bali</em>, Princeton: Princeton University\nPress.</li>\n<li>Goldhagen, Daniel Jonah, 1996. <i>Hitler’s willing\nexecutioners: Ordinary germans and the Holocaust</i>, 1st edition, New\nYork: Knopf: Distributed by Random House.</li>\n<li>Gross, Jan Tomasz, 2001. <i>Neighbors: The destruction of the\nJewish community in Jedwabne, Poland</i>, Princeton: Princeton\nUniversity Press.</li>\n<li>Hacking, Ian, 1999. <em>The social construction of what?</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––. 2002. <em>Historical ontology</em>,\nCambridge, MA, London: Harvard University Press.</li>\n<li>Hart, H. L. A., and Tony Honoré, 1959. <em>Causation in the\nlaw</em>, Oxford: Clarendon Press.</li>\n<li>Hedström, Peter, and Richard Swedberg (eds.), 1998.\n<em>Social mechanisms: An analytical approach to social theory</em>,\n<em>Studies in rationality and social change</em>, Cambridge, New\nYork: Cambridge University Press.</li>\n<li>Hegel, Georg Wilhelm Friedrich, 1824a [1953]. <em>Reason in\nhistory, a general introduction to the philosophy of history</em>, New\nYork: Liberal Arts Press, 1953.</li>\n<li>–––, 1824b [1956]. <em>The philosophy of\nhistory</em>, New York: Dover Publications, 1956.</li>\n<li>–––, 1821 [1967]. <em>The philosophy of\nright</em>, T. M. Knox (ed.), London, New York,: Oxford University\nPress, 1967.</li>\n<li>–––, 1857 [1975]. <em>Lectures on the philosophy\nof world history</em>, translated by H. B. Nisbet, Cambridge:\nCambridge University Press, 1975.</li>\n<li>–––, 1807 [1977]. <em>Phenomenology of\nspirit</em>, translated by A. V. Miller, edited by J. N. Findlay,\nOxford: Clarendon Press, 1977.</li>\n<li>Herder, Johann Gottfried, 1791 [1968]. <em>Reflections on the\nphilosophy of the history of mankind</em>, F. E. Manuel (ed.),\n<em>Classic European historians</em>, Chicago: University of Chicago\nPress, 1968.</li>\n<li>–––, 1800–1877 [1996]. <em>On world\nhistory: An anthology</em>, H. Adler and E. A. Menze (eds.),\n<em>Sources and studies in world history</em>, Armonk, NY: M.E.\nSharpe, 1996.</li>\n<li>Hilberg, Raul, 1961. <i>The Destruction of the European Jews</i>,\nChicago: Quadrangle Books.</li>\n<li>Hinton, William, 1966. <em>Fanshen: A documentary of revolution in\na Chinese village</em>, New York: Vintage Books.</li>\n<li>Huang, Philip C., 1990. <em>The peasant family and rural\ndevelopment in the Yangzi Delta, 1350–1988</em>, Stanford:\nStanford University Press.</li>\n<li>Hume, David, 1754–1762 [1983]. <em>The history of\nEngland</em>, W. B. Todd (ed.), 6 volumes, Indianapolis: Liberty\nClassics, 1983.</li>\n<li>Judt, Tony, 1992. “The Past Is Another Country: Myth and\nMemory in Postwar Europe”, <i>Daedalus</i>, 121(4):\n83–118.</li>\n<li>–––, 2006. <em>Postwar: A history of Europe\nsince 1945</em>, New York: Penguin Books.</li>\n<li>Kammen, Michael G., 1991. <em>Mystic chords of memory: The\ntransformation of tradition in American culture</em>, 1st edition, New\nYork: Knopf.</li>\n<li>Kant, Immanuel, 1784–6 [1963]. <em>On history</em>, L. W.\nBeck (ed.), Indianapolis: Bobbs-Merrill, 1963.</li>\n<li>–––, 1784–5 [1990]. <em>Foundations of the\nmetaphysics of morals and, What is enlightenment</em>, 2nd revised\nedition, <em>The Library of liberal arts</em>, New York:\nMacmillan, 1990.</li>\n<li>Kojève, Alexandre, 1969. <em>Introduction to the reading of\nHegel</em>, R. Queneau (ed.), New York: Basic Books.</li>\n<li>Koselleck, Reinhart, 1988 [1959]. <em>Critique And crisis:\nEnlightenment and the parthogenesis of modern society</em>, Oxford:\nBerg, 1959.</li>\n<li>–––, 2002. <em>The practice of conceptual\nhistory: Timing history, spacing concepts</em>, Stanford: Stanford\nUniversity Press.</li>\n<li>–––, 2004. <em>Futures and past: On the\nsemantics of historical time</em>, New York: Columbia University\nPress.</li>\n<li>LaCapra, Dominick, 1994. <em>Representing the Holocaust: History,\ntheory, trauma</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 1998. <em>History and memory after\nAuschwitz</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Lattimore, Owen, 1932. <em>Manchuria: Cradle of Conflict</em>, New\nYork: Macmillan.</li>\n<li>Leibniz, Gottfried Wilhelm, 1709 [1985]. <em>Theodicy: Essays on\nthe goodness of God, the freedom of man, and the origin of evil</em>,\nA. M. Farrer (ed.), La Salle, IL: Open Court, 1985.</li>\n<li>Le Roy Ladurie, Emmanuel, 1979. <em>Montaillou, the promised land\nof error</em>, New York: Vintage.</li>\n<li>Little, Daniel, 2010. <em>New contributions to the philosophy of\nhistory</em>, Dordrecht: Springer Science.</li>\n<li>–––, 2017. “Microfoundations”, in\n<i>The Routledge Companion to Philosophy of Social Science</i>, edited\nby Lee McIntyre and Alex Rosenberg. London; New York: Routledge, pp.\n228–239.</li>\n<li>–––, 2018. “Disaggregating Historical\nExplanation: The Move to Social Mechanisms”, in <i>Routledge\nHandbook of Mechanisms and Mechanical Philosophy</i>, edited by Stuart\nGlennan and Phyllis Illari, New York: Routledge, pp. 413–422.\n</li>\n<li>Livi-Bacci, Massimo, 2007. <em>A concise history of world\npopulation</em>, 4th edition, Malden, MA: Blackwell.</li>\n<li>Mackie, J. L., 1965. “Causes and Conditions”,\n<em>American Philosophical Quarterly</em>, 2: 245–264.</li>\n<li>–––, 1974. <em>The cement of the universe; a\nstudy of causation</em>, Oxford: Clarendon Press.</li>\n<li>Mandelbaum, Maurice, 1971. <em>History, man, &amp; reason; A study\nin nineteenth-century thought</em>, Baltimore: Johns Hopkins\nPress.</li>\n<li>Mann, Michael, 1986. <em>The sources of social power. A history of\npower from the beginning to A.D. 1760</em>, Volume 1, Cambridge:\nCambridge University Press.</li>\n<li>Maritain, Jacques, 1957. <em>On the philosophy of history</em>,\nNew York: Scribner.</li>\n<li>Marx, Karl, 1852 [2005]. <em>The eighteenth Brumaire of Louis\nBonaparte</em>, New York: Mondial, 2005</li>\n<li>Marx, Karl, and Frederick Engels, 1848 [1974]. <em>The Communist\nManifesto</em>, in <em>The Revolutions of 1848: Political\nWritings</em> (Volume 1), D. Fernbach (ed.), New York: Penguin\nClassics, 1974, pp. 62–98.</li>\n<li>–––, 1845–49 [1970]. <em>The\nGerman ideology</em>, 3rd revised edition. Moscow: Progress\nPublishers, 1970.</li>\n<li>McNeill, William, 1976. <em>Plagues and peoples</em>, Garden City:\nDoubleday.</li>\n<li>Mink, Louis O., 1966. “The autonomy of historical\nunderstanding”d,. <em>History and Theory</em>, 5(1):\n24–47.</li>\n<li>Mink, Louis O., Brian Fay, Eugene O. Golob, and Richard T. Vann\n(eds.), 1987. <em>Historical understanding</em>, Ithaca, NY: Cornell\nUniversity Press.</li>\n<li>Momigliano, Arnaldo, 1990. <em>The classical foundations of modern\nhistoriography</em> (Sather Classical Lectures), Berkeley: University\nof California Press.</li>\n<li>Montesquieu, Charles de Secondat, 1748. <em>The spirit of the\nlaws</em>, A. M. Cohler, B. C. Miller and H. Stone (eds.),\n<em>Cambridge texts in the history of political thought</em>,\nCambridge, New York: Cambridge University Press, 1989.</li>\n<li>Nagel, Ernest, 1961. <em>The structure of science; problems in the\nlogic of scientific explanation</em>, New York: Harcourt Brace &amp;\nWorld.</li>\n<li>O’Brien, Dennis, 1975. <em>Hegel on reason and history: A\ncontemporary interpretation</em>, Chicago: University of Chicago\nPress.</li>\n<li>O’Brien, P. K., and C. Keyder, 1978. <em>Economic growth in\nBritain and France, 1780–1914</em>, London: Allen and\nUnwin.</li>\n<li>Olson, Niklas, 2012. <em>History in the plural: An introduction to\nthe work of Reinhart Koselleck</em>, New York: Berghahn Books.</li>\n<li>Outhwaite, William, 1975. <em>Understanding social life: The\nmethod called verstehen</em>, London: George Allen &amp; Unwin.</li>\n<li>Pankakoski, Timo, 2010. “Conflict, Context, Concreteness:\nKoselleck and Schmitt on Concepts”, <em>Political Theory</em>,\n38(6): 749–779.</li>\n<li>Passmore, J. A., 1966. “The Objectivity of History”,\nin <em>Philosophical Analysis and History</em>, W. H. Dray (ed.), New\nYork: Harper &amp; Row, pp. 75–94.</li>\n<li>Paul, Herman, 2015. <i>Key issues in historical theory</i>,\nLondon; New York: Routledge.</li>\n<li>Pierson, Paul, 2004. <i>Politics in Time: History, institutions,\nand social analysis</i>, Princeton: Princeton University Press.</li>\n<li>Pompa, Leon, 1990. <em>Human nature and historical knowledge:\nHume, Hegel, and Vico</em>, Cambridge, New York: Cambridge University\nPress.</li>\n<li>Prusin, Alexander Victor, 2010. <i>The lands between: Conflict in\nthe East European borderlands, 1870–1992</i>, Oxford, New York:\nOxford University Press.</li>\n<li>Rabinbach, Anson, Stephanos Geroulanos, and Dagmar Herzog, 2020.\n<i>Staging the Third Reich: Essays in cultural and intellectual\nhistory</i>, London; New York: Routledge/Tayor &amp; Francis\nGroup.</li>\n<li>Ranke, Leopold von, 1881 [1973]. <em>The theory and practice of\nhistory</em>, W. Humboldt (ed.), <em>The European historiography\nseries</em>, Indianapolis, IN: Bobbs-Merrill, 1973.</li>\n<li>Ricoeur, Paul, 2004. <em>Memory, history, forgetting</em>,\ntranslated by Kathleen Blamey and David Pellauer, Chicago: University\nof Chicago Press.</li>\n<li>–––, 1984, 1985, 1988  <em>Time and\nnarrative (Volumes 1–3) </em>, translated by Kathleen McLaughlin and\nDavid Pellauer, Chicago: University of Chicago Press.</li>\n<li>Rorty, Richard, 1979. <em>Philosophy and the mirror of\nnature</em>, Princeton: Princeton University Press.</li>\n<li>Rousseau, Jean Jacques, 1762a [1983]. <em>On the social contract ;\nDiscourse on the origin of inequality; Discourse on political\neconomy</em>, Indianapolis, IN: Hackett Publishing Co., 1983</li>\n<li>Rousseau, Jean-Jacques, 1762b [2003]. <em>Emile, or, Treatise on\neducation</em>, Amherst, NY: Prometheus Books.</li>\n<li>Rowe, William T., 2007. “Owen Lattimore, Asia, and\nComparative History”, <em>Journal of Asian Studies</em>, 66(3):\n759–786.</li>\n<li>Rust, Eric Charles, 1947. <em>The Christian understanding of\nhistory</em>, London: Lutterworth Press.</li>\n<li>Sachsenmaier, Dominic, 2011. <em>Global perspectives on global\nhistory: Theories and approaches in a connected world</em>, Cambridge:\nCambridge University Press.</li>\n<li>Said, Edward W., 1978. <em>Orientalism</em>, New York: Random\nHouse.</li>\n<li>Schama, Simon, 1991. <em>Dead certainties: Unwarranted\nspeculations</em>, 1st edition, New York: Knopf.</li>\n<li>Schleiermacher, Friedrich, 1838 [1998]. <em>Hermeneutics and\ncriticism and other writings</em>, A. Bowie (ed.), Cambridge, New\nYork: Cambridge University Press, 1998.</li>\n<li>Scriven, Michael, 1962. “Explanations, Predictions, and\nLaws”, in <em>Minnesota Studies in the Philosophy of\nScience</em> (Volume 3), H. Feigl and G. Maxwell (eds.), Minneapolis:\nUniversity of Minnesota Press, pp. 170–230/</li>\n<li>Sherratt, Yvonne, 2006. <em>Continental philosophy of social\nscience: Hermeneutics, genealogy, critical theory</em>, Cambridge, New\nYork: Cambridge University Press.</li>\n<li>Skinner, G. William, 1977. “Regional Urbanization in\nNineteenth-Century China”, in <em>In The City in Late Imperial\nChina</em>, G. W. Skinner (ed.), Stanford: Stanford University Press,\np. 211–249.</li>\n<li>Smith, Adam, 1776 [1976]. <em>An inquiry into the nature and\ncauses of the wealth of nations</em>, R. H. Campbell and A. S. Skinner\n(eds.), <em>Glasgow edition of the works and correspondence of Adam\nSmith</em>, Oxford: Clarendon Press, 1976.</li>\n<li>Snyder, Timothy, 2010. <i>Bloodlands: Europe between Hitler and\nStalin</i>, New York: Basic Books.</li>\n<li>–––, 2015. <i>Black Earth: The Holocaust as\nhistory and warning</i>, New York: Tim Duggan Books.</li>\n<li>Solzhenitsyn, Aleksandr Isaevich, 1974. <i>The Gulag Archipelago,\n1918–1956: An Experiment in Literary Investigation</i>, New\nYork: Harper &amp; Row.</li>\n<li>Spengler, Oswald, and Charles Francis Atkinson, 1934. <em>The\ndecline of the west</em>, New York: A.A. Knopf.</li>\n<li>Taylor, Charles, 1975. <em>Hegel</em>, Cambridge; New York:\nCambridge University Press.</li>\n<li>–––, 1985. “Interpretation and the\nSciences of Man”, in <em>Philosophy and the Human Sciences:\nPhilosophical Papers 2</em>, C. Taylor (ed.), Cambridge: Cambridge\nUniversity Press, pp. 15–57. </li>\n<li>Toynbee, Arnold Joseph, 1934. <em>A study of history</em>, London:\nOxford University Press.</li>\n<li>Tucker, Aviezer (ed.), 2009. <em>A companion to the philosophy of\nhistory and historiography</em>, Chichester, U.K., Malden, MA:\nWiley-Blackwell.</li>\n<li>Vico, Giambattista, 1725. <em>The first new science</em>, L. Pompa\n(ed.), <em>Cambridge texts in the history of political thought</em>,\nCambridge, New York: Cambridge University Press, 2002.</li>\n<li>Waldron, Arthur, 1990. <em>The Great Wall of China: From history\nto myth</em>, Cambridge, New York: Cambridge University Press.</li>\n<li>Walsh, William Henry, 1960 [1951]. <em>Philosophy of history: An\nintroduction,</em> New York: Harper, 1951.</li>\n<li>Whatmore, Richard and Brian Young (eds.), 2015. <em>A companion to\nintellectual history</em>, New York: Wiley Blackwell.</li>\n<li>White, Hayden V., 1973. <em>Metahistory: The historical\nimagination in nineteenth-century Europe</em>, Baltimore: Johns\nHopkins University Press.</li>\n<li>Wittfogel, Karl, 1935. “The Stages of Development in Chinese\nEconomic and Social History”, in <em>The Asiatic Mode of\nProduction: Science and Politics</em>, A. M. Bailey and J. R. Llobera\n(ed.), London: Routledge and Kegan Paul, 1981, pp. 113–40.</li>\n<li>Wong, R. Bin, 1997. <em>China transformed: Historical change and\nthe limits of European experience</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Wylegala, Anna, 2017. “Managing the Difficult Past:\nUkrainian Collective Memory and Public Debates on History”,\n<i>Nationalities Papers</i>, 45(5): 780–97.</li>\n<li>Zahle Julie and Finn Collin, eds., 2014. <i>Individualism, holism,\nexplanation and emergence</i>, Dordrecht, London, New York:\nSpringer.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Berlin, Isaiah", "Dilthey, Wilhelm", "Hegel, Georg Wilhelm Friedrich", "Hempel, Carl", "Herder, Johann Gottfried von", "hermeneutics", "historiography", "Ricoeur, Paul", "Vico, Giambattista"], "entry_link": [{"../berlin/": "Berlin, Isaiah"}, {"../dilthey/": "Dilthey, Wilhelm"}, {"../hegel/": "Hegel, Georg Wilhelm Friedrich"}, {"../hempel/": "Hempel, Carl"}, {"../herder/": "Herder, Johann Gottfried von"}, {"../hermeneutics/": "hermeneutics"}, {"../ricoeur/": "Ricoeur, Paul"}, {"../vico/": "Vico, Giambattista"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=history\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/history/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=history&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/history/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=history": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/history/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=history&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/history/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"http://www.historyandtheory.org/\" target=\"other\">History and Theory</a>,\n at historyandtheory.org.", "<a href=\"http://understandingsociety.blogspot.com\" target=\"other\">UnderstandingSociety</a>,\n maintained by Daniel Little (University of Michigan-Dearborn)."], "listed_links": [{"http://www.historyandtheory.org/": "History and Theory"}, {"http://understandingsociety.blogspot.com": "UnderstandingSociety"}]}, "tokenized_text": ["1", "history", "representation", "intellectual", "task", "define", "historian", "work", "sense", "question", "best", "answered", "basis", "careful", "reading", "good", "historian", "useful", "offer", "several", "simple", "answer", "foundational", "question", "sort", "conceptual", "map", "nature", "historical", "knowing", "first", "historian", "interested", "providing", "conceptualization", "factual", "description", "event", "circumstance", "past", "effort", "answer", "question", "like", "happened", "like", "circumstance", "happening", "took", "place", "period", "past", "sometimes", "mean", "simply", "reconstructing", "complicated", "story", "scattered", "historical", "sourcesfor", "example", "constructing", "narrative", "spanish", "civil", "war", "attempting", "sort", "series", "event", "culminated", "detroit", "race", "riot", "uprising", "1967", "sometimes", "mean", "engaging", "substantial", "conceptual", "work", "order", "arrive", "vocabulary", "term", "characterize", "happened", "concerning", "disorder", "1967", "detroit", "riot", "uprising", "participant", "contemporary", "think", "second", "historian", "often", "want", "answer", "question", "event", "occur", "condition", "force", "brought", "motivation", "participant", "body", "question", "invite", "historian", "provide", "explanation", "event", "pattern", "describes", "rise", "fascism", "spain", "collapse", "ottoman", "empire", "occurrence", "ethnic", "cleansing", "bosnia", "1992", "later", "providing", "explanation", "requires", "basically", "account", "causal", "mechanism", "background", "circumstance", "human", "choice", "brought", "outcome", "explain", "historical", "outcome", "identify", "social", "cause", "force", "event", "action", "brought", "made", "likely", "third", "related", "previous", "point", "historian", "sometimes", "interested", "answering", "question", "outcome", "come", "pas", "process", "outcome", "occurred", "prussian", "army", "succeed", "defeating", "superior", "french", "army", "1870", "polish", "trade", "union", "solidarity", "manage", "bring", "end", "communist", "rule", "poland", "1989", "pragmatic", "interest", "historian", "account", "derives", "antecedent", "unlikelihood", "event", "question", "outcome", "possible", "explanation", "answer", "possible", "question", "rather", "necessary", "question", "fourth", "often", "historian", "interested", "piecing", "together", "human", "meaning", "intention", "underlie", "given", "complex", "series", "historical", "action", "want", "help", "reader", "make", "sense", "historical", "event", "action", "term", "thought", "motif", "state", "mind", "participant", "example", "napoleon", "iii", "carelessly", "provoke", "prussia", "war", "1870", "party", "far", "right", "germany", "gain", "popular", "support", "among", "german", "citizen", "1990s", "northern", "city", "united", "state", "develop", "marked", "pattern", "racial", "segregation", "world", "war", "ii", "answer", "question", "like", "require", "interpretation", "action", "meaning", "intentionsof", "individual", "actor", "culture", "characterize", "whole", "population", "aspect", "historical", "thinking", "hermeneutic", "interpretive", "ethnographic", "course", "historian", "face", "even", "basic", "intellectual", "task", "discovering", "making", "sense", "archival", "historical", "information", "exists", "given", "event", "time", "past", "historical", "data", "speak", "archive", "incomplete", "ambiguous", "contradictory", "confusing", "historian", "need", "interpret", "individual", "piece", "evidence", "need", "able", "somehow", "fit", "mass", "evidence", "coherent", "truthful", "story", "complex", "event", "like", "spanish", "civil", "war", "present", "historian", "ocean", "historical", "trace", "repository", "archive", "world", "collection", "sometimes", "reflect", "specific", "effort", "concealment", "powerful", "example", "franco", "effort", "conceal", "evidence", "mass", "killing", "republican", "end", "fighting", "historian", "task", "find", "way", "using", "body", "evidence", "discern", "truth", "past", "short", "historian", "conceptualize", "describe", "contextualize", "explain", "interpret", "event", "circumstance", "past", "sketch", "way", "representing", "complex", "activity", "event", "past", "explain", "interpret", "significant", "outcome", "base", "finding", "evidence", "present", "bear", "upon", "fact", "past", "account", "need", "grounded", "evidence", "available", "historical", "record", "explanation", "interpretation", "require", "historian", "arrive", "hypothesis", "social", "cause", "cultural", "meaning", "historian", "turn", "best", "available", "theory", "social", "behavioral", "science", "arrive", "theory", "causal", "mechanism", "human", "behavior", "historical", "statement", "depend", "ultimately", "upon", "factual", "inquiry", "theoretical", "reasoning", "ultimately", "historian", "task", "shed", "light", "past", "based", "inference", "evidence", "present", "three", "preliminary", "issue", "relevant", "almost", "discussion", "history", "philosophy", "history", "first", "set", "issue", "ontology", "history", "kind", "entity", "process", "event", "make", "historical", "past", "topic", "concern", "entity", "force", "structure", "postulate", "describing", "historical", "phenomenon", "whether", "medieval", "manor", "weimar", "republic", "theory", "social", "entity", "depend", "upon", "action", "historical", "actor", "embody", "second", "issue", "problem", "selectivity", "unavoidable", "historian", "period", "epoch", "take", "question", "unavoidable", "selectivity", "historical", "inquiry", "term", "theme", "location", "scope", "scale", "influence", "nature", "historical", "knowledge", "third", "issue", "complicated", "relationship", "exists", "history", "narrative", "collective", "memory", "topic", "address", "point", "real", "human", "being", "make", "history", "marc", "bloch", "insists", "1953", "human", "historical", "being", "tell", "story", "story", "sometimes", "major", "historical", "consequence", "collective", "memory", "identity", "serb", "nationalism", "historical", "fact", "1990s", "element", "mythic", "collective", "identity", "led", "massive", "bloodshed", "ethnic", "cleansing", "murder", "violent", "breakup", "yugoslavia", "judt", "snyder", "2012", "judt", "2006", "11", "actor", "structure", "cause", "history", "important", "problem", "philosophy", "history", "conceptualize", "history", "happening", "object", "history", "consists", "social", "structure", "system", "play", "role", "history", "cause", "work", "historical", "process", "history", "simply", "concatenation", "action", "mental", "framework", "myriad", "individual", "high", "low", "structure", "actor", "crucial", "understanding", "history", "relationship", "marc", "bloch", "1953", "provided", "simple", "penetrating", "definition", "history", "history", "man", "time", "meant", "history", "product", "human", "action", "creativity", "invention", "conflict", "interaction", "bloch", "skeptical", "many", "category", "commonly", "used", "analyze", "historyperiods", "epoch", "civilization", "reign", "century", "instead", "advocated", "called", "actorcentered", "conception", "history", "structure", "system", "history", "depend", "upon", "belief", "attitude", "action", "individual", "actor", "cause", "history", "likewise", "depend", "upon", "action", "interaction", "human", "actor", "within", "setting", "humanly", "created", "institution", "norm", "task", "historian", "reconstruct", "meaning", "belief", "value", "purpose", "constraint", "action", "jointly", "explain", "moment", "history", "meaning", "ancient", "stele", "cause", "rapid", "defeat", "france", "1940", "perspective", "diminish", "ontological", "importance", "structure", "system", "ideology", "history", "simply", "force", "historian", "like", "social", "scientist", "attentive", "problem", "articulating", "relationship", "exists", "actor", "structure", "system", "norm", "property", "system", "moral", "ideology", "feudal", "loyalty", "understood", "objectively", "present", "time", "place", "ontologically", "dependent", "upon", "mental", "framework", "action", "relationship", "individual", "actor", "make", "system", "problem", "thoroughly", "discussed", "philosophy", "social", "science", "rubric", "ontological", "individualism", "zahle", "collin", "2014", "higherlevel", "social", "entity", "indeed", "causally", "powerful", "social", "world", "depend", "entirely", "causal", "power", "characteristic", "individual", "actor", "constitute", "requirement", "microfoundations", "extended", "social", "structure", "cause", "depend", "upon", "microfoundations", "level", "individual", "constitute", "little", "2017", "particular", "need", "idea", "individual", "brought", "think", "act", "way", "required", "structure", "ideology", "function", "adult", "approach", "history", "result", "action", "thought", "vast", "number", "actor", "institution", "structure", "norm", "likewise", "embodied", "action", "mental", "framework", "historically", "situated", "individual", "approach", "help", "inoculate", "u", "error", "reification", "historical", "structure", "period", "force", "favor", "disaggregated", "conception", "multiple", "actor", "shifting", "condition", "action", "conception", "drawn", "understand", "history", "along", "line", "proposed", "bloch", "orientation", "brings", "along", "importance", "analyzing", "closely", "social", "natural", "environment", "actor", "frame", "choice", "historian", "account", "flow", "human", "action", "eventuating", "historical", "change", "unavoidably", "need", "take", "account", "institutional", "situational", "environment", "action", "take", "place", "part", "social", "environment", "period", "historical", "change", "ensemble", "institution", "exist", "le", "stably", "period", "property", "relation", "political", "institution", "family", "structure", "educational", "practice", "religious", "moral", "value", "historical", "explanation", "need", "sophisticated", "treatment", "institution", "culture", "practice", "important", "fact", "given", "period", "time", "posse", "fund", "scientific", "technical", "knowledge", "set", "social", "relationship", "power", "level", "material", "productivity", "also", "important", "fact", "knowledge", "limited", "coercion", "exists", "resource", "action", "limited", "within", "opportunity", "limitation", "individual", "leader", "ordinary", "people", "make", "life", "ambition", "action", "similar", "microfoundational", "account", "must", "given", "support", "idea", "cause", "history", "established", "reasonably", "straightforward", "see", "social", "structure", "property", "system", "ideology", "cause", "historical", "outcome", "constraining", "choice", "actor", "contributing", "motivation", "value", "choice", "make", "structure", "ideology", "influence", "historically", "important", "event", "like", "social", "movement", "market", "crash", "outbreak", "ethnic", "violence", "structure", "influence", "individual", "actor", "individual", "actor", "collectively", "constitute", "structure", "approach", "give", "basis", "judging", "suchandso", "circumstance", "caused", "given", "historical", "change", "also", "provides", "understanding", "way", "kind", "historical", "cause", "embodied", "conveyedthrough", "action", "thought", "individual", "response", "given", "natural", "social", "circumstance", "large", "scale", "cause", "work", "historical", "process", "historian", "often", "pose", "question", "like", "cause", "fall", "rome", "cause", "rise", "fascism", "cause", "industrial", "revolution", "kind", "question", "presuppose", "grand", "cause", "work", "grand", "effect", "however", "plausible", "believe", "cause", "large", "significant", "historical", "event", "small", "granular", "gradual", "cumulative", "case", "satisfyingly", "simple", "highlevel", "answer", "question", "rome", "fall", "moreover", "astute", "historian", "like", "bloch", "contemporary", "recognized", "large", "amount", "contingency", "path", "dependency", "historical", "change", "pierson", "2004", "historical", "outcome", "determined", "large", "scale", "cause", "instead", "multiple", "local", "contingent", "conjunctural", "process", "happening", "jointly", "come", "together", "production", "outcome", "interest", "possible", "example", "collapse", "roman", "empire", "resulted", "myriad", "different", "contingency", "organizational", "feature", "different", "part", "empire", "contingent", "account", "fall", "rome", "might", "refer", "logistical", "difficulty", "supplying", "army", "german", "winter", "particularly", "stubborn", "local", "resistance", "palestine", "administrative", "decay", "roman", "britain", "population", "pressure", "egypt", "particularly", "inept", "series", "commander", "gaul", "without", "drama", "administrative", "military", "collapse", "ensues", "best", "sometimes", "identify", "swarm", "independent", "smallscale", "process", "contingency", "eventually", "produced", "large", "outcome", "interest", "approach", "might", "called", "actorcentered", "history", "explain", "historical", "moment", "event", "account", "people", "thought", "believed", "wanted", "social", "institutional", "environmental", "condition", "framed", "choice", "view", "history", "give", "close", "attention", "state", "knowledge", "ideology", "agency", "well", "institution", "organization", "structure", "examines", "action", "practice", "individual", "lived", "life", "within", "constraining", "enabling", "circumstance", "emphasizes", "contingency", "pathdependency", "history", "acknowledges", "fact", "heterogeneity", "institution", "belief", "action", "across", "time", "place", "12", "selectivity", "scale", "history", "historical", "research", "unavoidably", "requires", "selectivity", "deciding", "particular", "phenomenon", "emphasize", "max", "weber", "1949", "note", "infinite", "depth", "historical", "reality", "therefore", "necessary", "select", "finite", "representation", "object", "study", "want", "approach", "problem", "rigorously", "let", "u", "imagine", "example", "historian", "interested", "city", "development", "time", "might", "pursued", "economic", "question", "question", "regional", "geography", "question", "cultural", "change", "question", "poverty", "segregation", "question", "municipal", "governance", "question", "civil", "disturbance", "one", "indefinitely", "many", "aspect", "urban", "life", "one", "generation", "historian", "may", "especially", "interested", "cultural", "topic", "another", "generation", "preoccupied", "organization", "economy", "various", "point", "history", "two", "orientation", "lead", "different", "historical", "representation", "past", "inquiry", "lead", "true", "depiction", "city", "question", "finding", "interpretation", "different", "likewise", "historian", "need", "make", "choice", "location", "interested", "city", "britain", "city", "europe", "city", "world", "historian", "must", "consider", "whether", "conduct", "comparative", "history", "city", "examining", "similarity", "difference", "development", "paris", "london", "instead", "restrict", "attention", "single", "case", "simply", "collecting", "historical", "fact", "city", "past", "valid", "mode", "historical", "inquiry", "question", "historian", "select", "identify", "subject", "research", "important", "one", "philosophy", "history", "great", "significance", "think", "knowing", "past", "weber", "essay", "methodology", "1949", "provide", "insight", "question", "weber", "emphasizes", "role", "scholar", "value", "play", "selection", "subject", "matter", "conceptual", "framework", "always", "open", "historian", "later", "generation", "reevaluate", "prior", "interpretation", "various", "aspect", "period", "history", "general", "comprehensive", "approach", "defining", "historical", "possibility", "series", "selective", "valueguided", "approach", "defining", "specific", "aspect", "history", "always", "liberty", "bring", "forward", "new", "perspective", "new", "aspect", "problem", "arrive", "new", "insight", "phenomenon", "hang", "together", "characterized", "new", "way", "inherent", "selectivity", "historical", "knowledge", "undermine", "objectivity", "veridicality", "knowledge", "merely", "entail", "like", "mathematics", "history", "inherently", "incomplete", "history", "also", "force", "historian", "make", "choice", "scale", "history", "concerned", "suppose", "interested", "asian", "history", "concerned", "asia", "continent", "including", "china", "india", "cambodia", "japan", "whole", "china", "ming", "dynasty", "hubei", "province", "define", "interest", "term", "single", "important", "historical", "event", "like", "chinese", "revolution", "concerned", "whole", "chinese", "revolution", "base", "area", "yenan", "specific", "experience", "handful", "village", "shandong", "1940s", "given", "fundamental", "heterogeneity", "social", "life", "choice", "scale", "make", "important", "difference", "finding", "historian", "differ", "greatly", "around", "decision", "make", "scale", "possible", "treat", "historical", "subject", "microscale", "william", "hinton", "provides", "almost", "monthtomonth", "description", "chinese", "revolution", "fanshen", "villagea", "collection", "hundred", "family", "hinton", "1966", "likewise", "emmanuel", "le", "roy", "ladurie", "offer", "deep", "treatment", "villager", "montaillou", "single", "village", "limited", "time", "le", "roy", "ladurie", "1979", "william", "cronon", "provides", "focused", "detailed", "account", "development", "chicago", "metropolis", "middle", "united", "state", "cronon", "1991", "history", "limited", "time", "space", "appropriately", "called", "microhistory", "macrolevel", "history", "possible", "well", "william", "mcneill", "provides", "history", "world", "disease", "mcneill", "1976", "massimo", "livibacci", "offer", "history", "world", "population", "livibacci", "2007", "de", "vries", "goudsblom", "provide", "environmental", "history", "world", "de", "vries", "goudsblom", "2002", "case", "historian", "chosen", "scale", "encompasses", "virtually", "whole", "globe", "millennium", "time", "history", "certainly", "called", "macrohistory", "micro", "macrohistories", "important", "shortcoming", "microhistory", "leaf", "u", "question", "particular", "village", "shed", "light", "anything", "larger", "macrohistory", "leaf", "u", "question", "large", "assertion", "nature", "revolution", "importance", "class", "conflict", "mobilization", "apply", "context", "canada", "warsaw", "first", "threatens", "particular", "lose", "interest", "whereas", "second", "threatens", "general", "lose", "empirical", "relevance", "real", "historical", "process", "third", "choice", "available", "historian", "address", "point", "choose", "scale", "encompasses", "enough", "time", "space", "genuinely", "interesting", "important", "much", "defy", "valid", "analysis", "level", "scale", "might", "regionalfor", "example", "g", "william", "skinner", "analysis", "macroregions", "china", "skinner", "1977", "might", "nationalfor", "example", "social", "political", "history", "indonesia", "might", "supranationalfor", "example", "economic", "history", "western", "europe", "comparative", "treatment", "eurasian", "history", "key", "point", "historian", "middle", "range", "free", "choose", "scale", "analysis", "seems", "permit", "best", "level", "conceptualization", "history", "given", "evidence", "available", "social", "process", "appear", "work", "midlevel", "scale", "permit", "historian", "make", "substantive", "judgment", "reach", "social", "process", "likely", "play", "causal", "role", "story", "need", "telling", "level", "analysis", "referred", "mesohistory", "appears", "offer", "ideal", "mix", "specificity", "generality", "13", "memory", "history", "narrative", "relation", "history", "memory", "narrative", "might", "put", "concept", "crude", "map", "saying", "history", "organized", "evidencebased", "presentation", "process", "action", "event", "occurred", "people", "extended", "period", "time", "memory", "personal", "recollection", "representation", "individual", "lived", "series", "event", "process", "narrative", "story", "ordinary", "people", "historian", "weave", "together", "make", "sense", "event", "happening", "people", "person", "lived", "collective", "memory", "idea", "group", "welsh", "miner", "serbian", "villager", "black", "alabama", "farmer", "posse", "collective", "representation", "past", "bind", "together", "understood", "shared", "set", "narrative", "story", "past", "event", "given", "group", "community", "use", "narrative", "make", "sense", "thing", "happened", "identify", "meaning", "cause", "within", "series", "event", "select", "important", "event", "process", "ordinary", "inconsequential", "narrative", "generally", "account", "situation", "event", "came", "narrative", "intended", "provide", "account", "complex", "historical", "event", "unfolded", "want", "understand", "event", "time", "contextual", "feature", "relevant", "outcomethe", "condition", "one", "point", "time", "played", "role", "action", "choice", "agent", "performed", "take", "action", "rather", "possible", "choice", "causal", "processeseither", "social", "naturalmay", "played", "role", "influencing", "outcome", "narrative", "seek", "provide", "hermeneutic", "understanding", "outcomewhy", "actor", "behave", "bringing", "outcome", "and", "causal", "explanationwhat", "social", "natural", "process", "acting", "behind", "back", "actor", "bringing", "outcome", "different", "narrative", "represent", "different", "mix", "hermeneutic", "causal", "factor", "crucial", "unavoidable", "feature", "narrative", "history", "fact", "selectivity", "narrative", "historian", "forced", "make", "choice", "selection", "every", "stage", "significant", "insignificant", "sideshow", "main", "event", "level", "description", "evident", "often", "multiple", "truthful", "unbiased", "inconsistent", "narrative", "told", "single", "complex", "event", "exactly", "many", "thing", "happened", "actor", "motif", "ambiguous", "causal", "connection", "among", "event", "debatable", "possible", "construct", "inconsistent", "narrative", "equally", "well", "supported", "evidence", "intellectual", "interest", "different", "historian", "bring", "happening", "lead", "difference", "narrative", "one", "historian", "may", "primarily", "interested", "role", "different", "view", "social", "justice", "played", "action", "participant", "another", "may", "primarily", "interested", "role", "social", "network", "played", "third", "may", "especially", "interested", "role", "charismatic", "personality", "consequent", "structuring", "narrative", "around", "action", "speech", "charismatic", "leader", "may", "truthful", "objective", "unbiasedand", "inconsistent", "important", "way", "others", "narrative", "underdetermined", "fact", "thing", "exhaustive", "comprehensive", "telling", "storyonly", "various", "telling", "emphasize", "one", "set", "theme", "another", "consider", "collective", "memory", "social", "identity", "also", "forced", "recognize", "powerful", "institution", "attempt", "shape", "narrative", "important", "event", "way", "serve", "political", "interest", "group", "identity", "defined", "set", "belief", "story", "one", "home", "one", "people", "one", "past", "idea", "often", "involve", "answer", "question", "like", "come", "get", "perhaps", "enemy", "identity", "involves", "narrative", "creation", "story", "perhaps", "remembrance", "long", "chain", "disaster", "crime", "identity", "collective", "memory", "intertwined", "monument", "song", "icon", "flag", "help", "set", "way", "point", "history", "people", "collective", "emotion", "group", "experience", "story", "tell", "history", "brought", "u", "place", "large", "event", "shaped", "u", "people", "government", "leader", "activist", "political", "party", "interest", "shaping", "collective", "memory", "end", "collective", "memory", "identity", "interwoven", "myth", "folk", "history", "benedict", "anderson", "1983", "demonstrated", "story", "often", "fiction", "various", "kind", "promulgated", "individual", "group", "interest", "shaping", "collective", "consciousness", "one", "way", "another", "philosophy", "history", "must", "pay", "attention", "nexus", "experience", "memory", "history", "single", "civil", "right", "era", "experience", "great", "depression", "experience", "instead", "historian", "must", "consider", "wide", "range", "source", "evidence", "including", "oral", "history", "firstperson", "account", "photograph", "trace", "human", "experience", "time", "allow", "discern", "variation", "degree", "thematicization", "memory", "identity", "period", "study", "second", "attention", "history", "memory", "highlight", "amount", "human", "individual", "agency", "involved", "memory", "memory", "must", "created", "agent", "must", "find", "framework", "within", "understand", "moment", "historical", "experience", "museum", "monument", "curate", "historical", "memory", "often", "bias", "third", "equally", "important", "point", "fact", "memory", "become", "part", "political", "mobilization", "possibility", "exist", "group", "group", "find", "collective", "identity", "shared", "understanding", "past", "shared", "understanding", "provide", "basis", "future", "collective", "action", "paul", "ricoeur", "time", "narrative", "19841988", "shed", "profound", "light", "profound", "relation", "extend", "among", "memory", "identity", "narrative", "history", "2", "continental", "philosophy", "history", "topic", "history", "treated", "frequently", "modern", "european", "philosophy", "long", "largely", "german", "tradition", "thought", "look", "history", "total", "comprehensible", "process", "event", "structure", "process", "philosophy", "history", "serve", "interpretive", "tool", "approach", "speculative", "metahistorical", "aim", "discern", "large", "embracing", "pattern", "direction", "unfolding", "human", "history", "persistent", "notwithstanding", "erratic", "backandforth", "particular", "historical", "development", "modern", "philosopher", "raising", "set", "question", "large", "direction", "meaning", "history", "include", "vico", "herder", "hegel", "somewhat", "different", "line", "thought", "continental", "tradition", "relevant", "philosophy", "history", "hermeneutic", "tradition", "human", "science", "emphasis", "hermeneutic", "circle", "human", "undertake", "understand", "meaning", "created", "humansin", "text", "symbol", "actionshermeneutic", "philosopher", "schleiermacher", "1838", "dilthey", "18601903", "ricoeur", "19841988", "2000", "offer", "philosophical", "argument", "emphasizing", "importance", "narrative", "interpretation", "within", "understanding", "history", "understanding", "history", "mean", "providing", "narrative", "make", "sense", "beginning", "end", "21", "universal", "historical", "human", "nature", "human", "being", "make", "history", "fundamental", "nature", "human", "one", "fundamental", "human", "nature", "basic", "feature", "humanity", "historically", "conditioned", "mandelbaum", "1971", "study", "history", "shed", "light", "question", "study", "different", "historical", "epoch", "learn", "something", "unchanging", "human", "beingsor", "learn", "fundamental", "difference", "motivation", "reasoning", "desire", "collectivity", "humanity", "historical", "product", "giambattista", "vico", "new", "science", "1725", "offered", "interpretation", "history", "turned", "idea", "universal", "human", "nature", "universal", "history", "see", "berlin", "2000", "commentary", "vico", "interpretation", "history", "civilization", "offer", "view", "underlying", "uniformity", "human", "nature", "across", "historical", "setting", "permit", "explanation", "historical", "action", "process", "common", "feature", "human", "nature", "give", "rise", "fixed", "series", "stage", "development", "civil", "society", "law", "commerce", "government", "universal", "human", "being", "faced", "recurring", "civilizational", "challenge", "produce", "set", "response", "time", "two", "thing", "worth", "noting", "perspective", "history", "first", "simplifies", "task", "interpreting", "explaining", "history", "take", "given", "understand", "actor", "past", "based", "experience", "nature", "second", "intellectual", "heir", "twentiethcentury", "social", "science", "theory", "form", "rational", "choice", "theory", "basis", "comprehensive", "social", "explanation", "johann", "gottfried", "herder", "offer", "strikingly", "different", "view", "human", "nature", "human", "idea", "motivation", "herder", "argues", "historical", "contextuality", "human", "nature", "work", "idea", "philosophy", "history", "humanity", "1791", "offer", "historicized", "understanding", "human", "nature", "advocating", "idea", "human", "nature", "historical", "product", "human", "being", "act", "differently", "different", "period", "historical", "development", "18001877", "1791", "herder", "view", "set", "stage", "historicist", "philosophy", "human", "nature", "later", "found", "nineteenthcentury", "figure", "hegel", "nietzsche", "perspective", "prefigures", "important", "current", "thought", "social", "world", "late", "twentieth", "century", "idea", "social", "construction", "human", "nature", "social", "identity", "anderson", "1983", "hacking", "1999", "foucault", "1971", "22", "history", "posse", "directionality", "philosopher", "raised", "question", "meaning", "structure", "totality", "human", "history", "philosopher", "sought", "discover", "large", "organizing", "theme", "meaning", "direction", "human", "history", "may", "take", "form", "effort", "demonstrate", "history", "enacts", "divine", "order", "reveals", "large", "pattern", "cyclical", "teleological", "progressive", "play", "important", "theme", "example", "hegel", "conception", "history", "unfolding", "human", "freedom", "discussed", "ambition", "case", "demonstrate", "apparent", "contingency", "arbitrariness", "historical", "event", "related", "fundamental", "underlying", "purpose", "order", "approach", "history", "may", "described", "hermeneutic", "focused", "interpretation", "large", "historical", "feature", "rather", "interpretation", "individual", "meaning", "action", "effect", "treat", "sweep", "history", "complicated", "tangled", "text", "interpreter", "assigns", "meaning", "element", "story", "order", "fit", "element", "larger", "theme", "motif", "story", "ranke", "make", "point", "explicitly", "1881", "recurring", "current", "approach", "philosophy", "history", "fall", "area", "theodicy", "eschatology", "religiously", "inspired", "attempt", "find", "meaning", "structure", "history", "relating", "past", "present", "specific", "divinely", "ordained", "plan", "theologian", "religious", "thinker", "attempted", "find", "meaning", "historical", "event", "expression", "divine", "one", "reason", "theological", "interest", "question", "problem", "evil", "thus", "leibniz", "theodicy", "attempt", "provide", "logical", "interpretation", "history", "make", "tragedy", "history", "compatible", "benevolent", "god", "1709", "twentieth", "century", "theologian", "maritain", "1957", "rust", "1947", "dawson", "1929", "offered", "systematic", "effort", "provide", "christian", "interpretation", "history", "enlightenment", "thinker", "rejected", "religious", "interpretation", "history", "brought", "teleology", "idea", "progressthe", "idea", "humanity", "moving", "direction", "better", "perfect", "civilization", "progression", "witnessed", "study", "history", "civilization", "condorcet", "1795", "montesquieu", "1748", "vico", "philosophy", "history", "seek", "identify", "foundational", "series", "stage", "human", "civilization", "different", "civilization", "go", "stage", "human", "nature", "constant", "across", "history", "pompa", "1990", "rousseau", "1762a", "1762b", "kant", "17845", "17846", "brought", "assumption", "rationality", "progress", "political", "philosophy", "adam", "smith", "embodies", "optimism", "progressive", "effect", "rationality", "account", "unfolding", "modern", "european", "economic", "system", "1776", "effort", "derive", "fixed", "series", "stage", "tool", "interpretation", "history", "civilization", "repeated", "throughout", "eighteenth", "nineteenth", "century", "find", "expression", "hegel", "philosophy", "discussed", "well", "marx", "materialist", "theory", "development", "economic", "mode", "production", "marx", "engels", "184549", "marx", "engels", "1848", "effort", "find", "directionality", "stage", "history", "found", "new", "expression", "early", "twentieth", "century", "hand", "several", "metahistorians", "sought", "provide", "macrointerpretation", "brought", "order", "world", "history", "spengler", "1934", "toynbee", "1934", "wittfogel", "1935", "lattimore", "1932", "author", "offered", "reading", "world", "history", "term", "rise", "fall", "civilization", "race", "culture", "writing", "primarily", "inspired", "philosophical", "theological", "theory", "also", "work", "primary", "historical", "scholarship", "spengler", "toynbee", "portrayed", "human", "history", "coherent", "process", "civilization", "pas", "specific", "stage", "youth", "maturity", "senescence", "wittfogel", "lattimore", "interpreted", "asian", "civilization", "term", "large", "determining", "factor", "wittfogel", "contrast", "china", "history", "europe", "characterizing", "china", "civilization", "one", "hydraulic", "despotism", "attendant", "consequence", "china", "history", "cyclical", "rather", "directional", "lattimore", "applies", "key", "geographic", "ecological", "determinism", "development", "asian", "civilization", "rowe", "2007", "legitimate", "criticism", "many", "effort", "offer", "interpretation", "sweep", "history", "view", "look", "meaning", "none", "exist", "interpretation", "individual", "action", "life", "history", "intelligible", "ground", "attribution", "meaning", "theory", "individual", "person", "possessing", "creating", "meaning", "superagent", "lying", "behind", "historical", "eventsfor", "example", "french", "revolutionand", "metaphysical", "mistake", "attempt", "find", "meaning", "feature", "event", "eg", "terror", "theological", "approach", "purport", "evade", "criticism", "attributing", "agency", "god", "author", "history", "assumption", "divine", "author", "history", "take", "making", "history", "hand", "humanity", "effort", "discern", "large", "stage", "history", "vico", "spengler", "toynbee", "vulnerable", "different", "criticism", "based", "monocausal", "interpretation", "full", "complexity", "human", "history", "author", "single", "one", "factor", "thought", "drive", "history", "universal", "human", "nature", "vico", "common", "set", "civilizational", "challenge", "spengler", "toynbee", "hypothesis", "need", "evaluated", "basis", "concrete", "historical", "evidence", "evidence", "concerning", "large", "feature", "historical", "change", "past", "three", "millennium", "offer", "little", "support", "idea", "one", "fixed", "process", "civilizational", "development", "instead", "human", "history", "virtually", "every", "scale", "appears", "embody", "large", "degree", "contingency", "multiple", "pathway", "development", "say", "credible", "large", "historical", "interpretation", "available", "human", "history", "society", "example", "michael", "mann", "sociology", "early", "agrarian", "civilization", "1986", "de", "vries", "goudsblom", "effort", "global", "environmental", "history", "2002", "jared", "diamond", "treatment", "disease", "warfare", "1997", "offer", "example", "scholar", "attempt", "explain", "large", "feature", "human", "history", "basis", "common", "human", "circumstance", "effort", "state", "collect", "revenue", "need", "human", "community", "exploit", "resource", "global", "transmission", "disease", "challenge", "macrohistory", "preserve", "discipline", "empirical", "evaluation", "large", "hypothesis", "put", "forward", "23", "hegel", "philosophy", "history", "hegel", "philosophy", "history", "perhaps", "fully", "developed", "philosophical", "theory", "history", "attempt", "discover", "meaning", "direction", "history", "1824a", "1824b", "1857", "hegel", "regard", "history", "intelligible", "process", "moving", "towards", "specific", "conditionthe", "realization", "human", "freedom", "question", "issue", "therefore", "ultimate", "end", "mankind", "end", "spirit", "set", "world", "1857", "63", "hegel", "incorporates", "deeper", "historicism", "philosophical", "theory", "predecessor", "successor", "regard", "relationship", "objective", "history", "subjective", "development", "individual", "consciousness", "spirit", "intimate", "one", "central", "thesis", "phenomenology", "spirit", "1807", "view", "central", "task", "philosophy", "comprehend", "place", "unfolding", "history", "history", "process", "whereby", "spirit", "discovers", "concept", "1857", "62", "hegel", "construct", "world", "history", "narrative", "stage", "human", "freedom", "public", "freedom", "polis", "citizenship", "roman", "republic", "individual", "freedom", "protestant", "reformation", "civic", "freedom", "modern", "state", "attempt", "incorporate", "civilization", "india", "china", "understanding", "world", "history", "though", "regard", "civilization", "static", "therefore", "prehistorical", "brien", "1975", "construct", "specific", "moment", "worldhistorical", "event", "process", "bringing", "final", "full", "stage", "history", "human", "freedom", "example", "napoleon", "conquest", "much", "europe", "portrayed", "worldhistorical", "event", "history", "work", "establishing", "term", "rational", "bureaucratic", "state", "hegel", "find", "reason", "history", "latent", "reason", "one", "comprehended", "fullness", "history", "work", "finished", "philosophy", "paint", "grey", "grey", "shape", "life", "grown", "old", "owl", "minerva", "spread", "wing", "falling", "dusk", "hegel", "1821", "13", "see", "brien", "1975", "taylor", "1975", "kojève", "1969", "treatment", "hegel", "philosophy", "history", "worth", "observing", "hegel", "philosophy", "history", "indefensible", "exercise", "speculative", "philosophical", "reasoning", "analytic", "philosopher", "sometimes", "paint", "philosophical", "approach", "based", "solely", "foundational", "apriori", "reasoning", "many", "interpretation", "concrete", "historical", "development", "quite", "insightful", "instead", "proposes", "immanent", "encounter", "philosophical", "reason", "historical", "given", "w", "h", "walsh", "1960", "describes", "hegel", "intellectual", "project", "philosophy", "history", "accomplish", "task", "philosopher", "must", "take", "result", "empirical", "history", "data", "suffice", "merely", "reproduce", "must", "try", "illuminate", "history", "bringing", "knowledge", "idea", "formal", "articulation", "reason", "bear", "upon", "striving", "phrase", "hegel", "us", "elsewhere", "elevate", "empirical", "content", "rank", "necessary", "truth", "walsh", "1960", "143", "hegel", "prescription", "philosopher", "seek", "discover", "rational", "within", "realnot", "impose", "rational", "upon", "real", "comprehend", "task", "philosophy", "reason", "1821", "11", "approach", "neither", "purely", "philosophical", "purely", "empirical", "instead", "undertakes", "discover", "within", "best", "historical", "knowledge", "time", "underlying", "rational", "principle", "philosophically", "articulated", "avineri", "1972", "24", "hermeneutic", "approach", "history", "another", "important", "strand", "continental", "philosophy", "history", "proposes", "apply", "hermeneutics", "problem", "historical", "interpretation", "approach", "focus", "meaning", "action", "intention", "historical", "individual", "rather", "historical", "whole", "tradition", "derives", "tradition", "scholarly", "biblical", "interpretation", "hermeneutic", "scholar", "emphasized", "linguistic", "symbolic", "core", "human", "interaction", "maintained", "technique", "developed", "purpose", "interpreting", "text", "could", "also", "employed", "interpret", "symbolic", "human", "action", "product", "wilhelm", "dilthey", "maintained", "human", "science", "inherently", "distinct", "natural", "science", "former", "depend", "understanding", "meaningful", "human", "action", "latter", "depend", "causal", "explanation", "nonintensional", "event", "1883", "18601903", "1910", "human", "life", "structured", "carried", "meaningful", "action", "symbolic", "expression", "dilthey", "maintains", "intellectual", "tool", "hermeneuticsthe", "interpretation", "meaningful", "textsare", "suited", "interpretation", "human", "action", "history", "method", "verstehen", "understanding", "make", "methodology", "approach", "invite", "thinker", "engage", "active", "construction", "meaning", "intention", "actor", "point", "view", "outhwaite", "1975", "line", "interpretation", "human", "history", "found", "expression", "twentiethcentury", "philosophical", "writing", "heidegger", "gadamer", "ricoeur", "foucault", "tradition", "approach", "philosophy", "history", "perspective", "meaning", "language", "argues", "historical", "knowledge", "depends", "upon", "interpretation", "meaningful", "human", "action", "practice", "historian", "probe", "historical", "event", "action", "order", "discover", "interconnection", "meaning", "symbolic", "interaction", "human", "action", "created", "sherratt", "2006", "hermeneutic", "tradition", "took", "important", "new", "turn", "midtwentieth", "century", "philosopher", "attempted", "make", "sense", "modern", "historical", "development", "including", "war", "racism", "holocaust", "narrative", "progress", "longer", "compelling", "following", "terrible", "event", "first", "half", "twentieth", "century", "focus", "approach", "might", "labeled", "history", "remembrance", "contributor", "strand", "thought", "emerged", "twentiethcentury", "european", "philosophy", "including", "existentialism", "marxism", "influenced", "search", "meaning", "holocaust", "paul", "ricoeur", "draw", "parallel", "personal", "memory", "cultural", "memory", "history", "2000", "dominick", "lacapra", "brings", "tool", "interpretation", "theory", "critical", "theory", "bear", "treatment", "representation", "trauma", "holocaust", "1994", "1998", "others", "emphasize", "role", "folk", "history", "play", "construction", "interpretation", "past", "theme", "taken", "contemporary", "historian", "example", "michael", "kammen", "treatment", "public", "remembrance", "american", "civil", "war", "1991", "memory", "representation", "past", "play", "key", "role", "formation", "racial", "national", "identity", "numerous", "twentiethcentury", "philosopher", "noted", "degree", "subjectivity", "construction", "inherent", "national", "memory", "represented", "group", "telling", "history", "although", "falling", "within", "continental", "lineage", "r", "g", "collingwood", "philosophy", "history", "fall", "within", "general", "framework", "hermeneutic", "philosophy", "history", "1946", "collingwood", "focus", "question", "specify", "content", "history", "argues", "history", "constituted", "human", "action", "action", "result", "intentional", "deliberation", "choice", "historian", "able", "explain", "historical", "process", "within", "reconstruction", "thought", "process", "agent", "bring", "present", "idea", "reenactment", "solution", "problem", "knowledge", "past", "point", "view", "present", "past", "accessible", "historian", "present", "open", "reenact", "important", "historical", "moment", "imaginative", "reconstruction", "actor", "state", "mind", "intention", "describes", "activity", "reenactment", "context", "historical", "problem", "understanding", "plato", "meaning", "philosopher", "caesar", "intention", "ruler", "reenactment", "accomplished", "case", "plato", "caesar", "respectively", "far", "historian", "brings", "bear", "problem", "power", "mind", "knowledge", "philosophy", "politics", "passive", "surrender", "spell", "another", "mind", "labour", "active", "therefore", "critical", "thinking", "collingwood", "1946", "215", "25", "conceptual", "history", "postwar", "german", "historian", "reinhart", "koselleck", "made", "important", "contribution", "philosophy", "history", "largely", "independent", "source", "continental", "philosophy", "history", "mentioned", "koselleck", "contribution", "ably", "discussed", "olsen", "2012", "koselleck", "contributed", "conceptual", "critical", "theory", "history", "2002", "2004", "major", "compendium", "brunner", "conze", "history", "concept", "history", "germanspeaking", "world", "one", "major", "expression", "work", "brunner", "conze", "koselleck", "197297", "koselleck", "belief", "three", "key", "task", "metahistorian", "philosopher", "identify", "concept", "either", "possible", "necessary", "characterizing", "history", "locate", "concept", "within", "context", "social", "political", "discourse", "conflict", "time", "period", "critically", "evaluate", "various", "concept", "usefulness", "historical", "analysis", "key", "example", "koselleck", "develops", "include", "space", "experience", "horizon", "expectation", "example", "metahistorical", "category", "koselleck", "account", "include", "capacity", "die", "capacity", "kill", "friend", "foe", "inside", "outside", "master", "servant", "koselleck", "represents", "conceptual", "opposition", "representing", "condition", "possibility", "representation", "history", "bouton", "2016", "178", "large", "part", "koselleck", "work", "thus", "involves", "identifying", "describing", "various", "kind", "historical", "concept", "order", "represent", "history", "necessary", "make", "use", "vocabulary", "distinguishes", "thing", "need", "talk", "historical", "concept", "permit", "identification", "turn", "requires", "conceptual", "historical", "treatment", "concept", "understood", "changed", "time", "christophe", "bouton", "encapsulates", "koselleck", "approach", "term", "inquiry", "historical", "category", "used", "presupposed", "experience", "history", "different", "level", "event", "trace", "narrative", "bouton", "2016", "164", "bouton", "argues", "koselleck", "also", "brings", "critical", "perspective", "concept", "discus", "asks", "question", "validity", "bouton", "2016", "extent", "particular", "concept", "work", "well", "characterize", "history", "amount", "idea", "history", "result", "conceptualization", "past", "part", "people", "tell", "itprofessional", "historian", "politician", "partisan", "ordinary", "citizen", "interesting", "note", "koselleck", "research", "final", "year", "career", "focused", "meaning", "public", "monument", "especially", "war", "memorial", "therefore", "important", "even", "crucial", "task", "investigate", "historical", "concept", "used", "characterize", "past", "key", "concept", "interest", "koselleck", "idea", "modernity", "approach", "might", "seem", "fall", "within", "larger", "field", "intellectual", "history", "koselleck", "exponent", "believe", "historical", "concept", "use", "actually", "play", "role", "well", "concrete", "historical", "development", "occur", "within", "period", "worth", "noticing", "history", "come", "koselleck", "notion", "begriffsgeschichte", "two", "way", "koselleck", "concerned", "uncover", "logic", "semantics", "concept", "used", "describe", "historical", "event", "process", "interested", "historical", "evolution", "concept", "time", "latter", "interest", "definition", "question", "parallel", "socalled", "cambridge", "school", "quentin", "skinner", "john", "dunn", "j", "g", "pocock", "numerous", "observer", "emphasize", "importance", "political", "conflict", "koselleck", "account", "historical", "concept", "concept", "used", "partisan", "define", "field", "battle", "value", "loyalty", "pankakoski", "2010", "generally", "koselleck", "aim", "excavate", "layer", "meaning", "associated", "key", "historical", "concept", "different", "historical", "period", "whatmore", "young", "2015", "provide", "extensive", "useful", "account", "position", "mentioned", "conceptual", "history", "may", "appear", "kantian", "backgroundan", "exploration", "category", "thought", "basis", "alone", "history", "intelligible", "appears", "koselleck", "intention", "approach", "apriori", "rather", "look", "historical", "concept", "spectrum", "abstraction", "relatively", "close", "event", "french", "revolution", "abstract", "revolutionary", "change", "moreover", "make", "rigorous", "attempt", "discover", "meaning", "us", "concept", "historical", "context", "koselleck", "work", "defines", "separate", "space", "within", "field", "philosophy", "history", "meaning", "history", "neither", "teleological", "hermeneutic", "take", "seriously", "obligation", "historian", "excavate", "historical", "fact", "scrupulous", "rigor", "empiricist", "reductionist", "emphasizes", "dependence", "history", "conceptual", "resource", "live", "history", "tell", "history", "postmodernist", "relativist", "koselleck", "provides", "innovative", "constructive", "way", "formulating", "problem", "historical", "knowledge", "3", "angloamerican", "philosophy", "history", "tradition", "empiricism", "angloamerican", "philosophy", "also", "devoted", "occasional", "attention", "history", "philosopher", "tradition", "avoided", "question", "speculative", "philosophy", "history", "instead", "raised", "question", "logic", "epistemology", "historical", "knowledge", "guiding", "question", "logical", "epistemological", "characteristic", "historical", "knowledge", "historical", "explanation", "david", "hume", "empiricism", "cast", "dominant", "key", "almost", "subsequent", "angloamerican", "philosophy", "influence", "extends", "interpretation", "human", "behavior", "human", "science", "hume", "wrote", "widely", "read", "history", "england", "17541762", "interpretation", "history", "based", "assumption", "ordinary", "action", "motif", "cause", "sympathy", "theological", "interpretation", "past", "philosophical", "view", "history", "premised", "idea", "explanation", "past", "based", "assumption", "fixed", "human", "nature", "angloamerican", "interest", "philosophy", "history", "renewed", "midtwentieth", "century", "emergence", "analytical", "philosophy", "history", "representative", "contributor", "include", "dray", "1957", "1964", "1966", "danto", "1965", "gardiner", "1952", "1974", "approach", "involves", "application", "method", "tool", "analytic", "philosophy", "special", "problem", "arise", "pursuit", "historical", "explanation", "historical", "knowledge", "gardiner", "1952", "interest", "characteristic", "historical", "knowledge", "know", "fact", "past", "constitutes", "good", "historical", "explanation", "whether", "explanation", "history", "require", "general", "law", "whether", "historical", "knowledge", "underdetermined", "available", "historical", "evidence", "analytic", "philosopher", "emphasized", "empirical", "scientific", "status", "historical", "knowledge", "attempted", "understand", "claim", "along", "line", "scientific", "standing", "natural", "science", "nagel", "1961", "philosopher", "analytic", "tradition", "deeply", "skeptical", "power", "nonempirical", "reason", "arrive", "substantive", "conclusion", "structure", "worldincluding", "human", "history", "philosophical", "reasoning", "source", "substantive", "knowledge", "natural", "world", "sequence", "event", "action", "state", "class", "empire", "plague", "conquest", "call", "history", "rather", "substantive", "knowledge", "world", "derive", "empirical", "investigation", "logical", "analysis", "consequence", "finding", "analytic", "philosopher", "history", "little", "interest", "large", "question", "meaning", "structure", "history", "considered", "practitioner", "speculative", "philosophy", "history", "hand", "convinced", "power", "philosophical", "thought", "reason", "foundational", "understanding", "history", "would", "impatient", "call", "purely", "empirical", "conceptual", "approach", "subject", "w", "h", "walsh", "philosophy", "history", "walsh", "1960", "1951", "first", "published", "1951", "revised", "1960", "openminded", "wellgrounded", "effort", "provide", "indepth", "presentation", "field", "cross", "separation", "continental", "analytical", "philosophy", "book", "attempt", "treat", "major", "question", "driving", "much", "philosophy", "history", "nature", "historical", "knowledge", "possibility", "gaining", "metaphysical", "knowledge", "history", "oxford", "philosopher", "trained", "modern", "philosophy", "walsh", "strongly", "influenced", "collingwood", "well", "aware", "european", "idealist", "tradition", "philosophical", "thinking", "history", "including", "rickert", "dilthey", "croce", "treat", "tradition", "serious", "way", "draw", "distinction", "tradition", "along", "line", "critical", "speculative", "philosophy", "history", "walsh", "goal", "book", "ambitious", "hope", "propose", "framework", "within", "main", "question", "history", "addressed", "including", "major", "tradition", "advance", "view", "historian", "presented", "number", "event", "action", "development", "period", "hang", "together", "process", "cognition", "historian", "make", "sense", "set", "separate", "historical", "event", "walsh", "refers", "colligation", "locate", "historical", "event", "larger", "historical", "process", "term", "make", "sense", "23", "walsh", "fundamentally", "accepts", "collingwood", "basic", "premise", "history", "concern", "conscious", "human", "action", "collingwood", "slogan", "history", "science", "mind", "walsh", "appears", "accept", "much", "perspective", "key", "intellectual", "task", "historian", "approach", "reconstruct", "reason", "motif", "actor", "various", "point", "history", "perhaps", "condition", "led", "reason", "motif", "mean", "tool", "interpretation", "meaning", "reason", "crucial", "historianmuch", "hermeneutic", "philosopher", "german", "tradition", "argued", "walsh", "suggests", "philosophical", "content", "philosophy", "history", "fall", "naturally", "two", "different", "sort", "inquiry", "parallel", "distinction", "philosophy", "nature", "philosophy", "science", "first", "metaphysical", "question", "reality", "history", "whole", "latter", "epistemic", "issue", "arise", "pursuit", "formulation", "knowledge", "history", "refers", "approach", "speculative", "critical", "aspect", "philosophy", "history", "attempt", "formulate", "view", "key", "question", "approach", "speculative", "philosophy", "history", "asks", "meaning", "purpose", "historical", "process", "critical", "philosophy", "history", "refer", "analytic", "philosophy", "equivalent", "history", "philosophy", "science", "nature", "31", "general", "law", "history", "philosopher", "science", "carl", "hempel", "stimulated", "analytic", "philosopher", "interest", "historical", "knowledge", "essay", "function", "general", "law", "history", "1942", "hempel", "general", "theory", "scientific", "explanation", "held", "scientific", "explanation", "require", "subsumption", "general", "law", "hempel", "considered", "historical", "explanation", "apparent", "exception", "coveringlaw", "model", "attempted", "show", "suitability", "coveringlaw", "model", "even", "special", "case", "argued", "valid", "historical", "explanation", "must", "invoke", "general", "law", "coveringlaw", "approach", "historical", "explanation", "supported", "analytical", "philosopher", "science", "including", "ernest", "nagel", "1961", "hempel", "essay", "provoked", "prolonged", "controversy", "supporter", "cited", "generalization", "human", "behavior", "relevant", "general", "law", "critic", "argued", "historical", "explanation", "akin", "explanation", "individual", "behavior", "based", "interpretation", "make", "outcome", "comprehensible", "especially", "important", "discussion", "offered", "william", "dray", "1957", "michael", "scriven", "1962", "alan", "donagan", "1966", "donagan", "others", "pointed", "difficulty", "many", "social", "explanation", "depend", "probabilistic", "regularity", "rather", "universal", "law", "others", "including", "scriven", "pointed", "pragmatic", "feature", "explanation", "suggesting", "argument", "fall", "far", "short", "deductive", "validity", "nonetheless", "sufficient", "explain", "given", "historical", "event", "given", "context", "belief", "fundamental", "objection", "however", "first", "virtually", "good", "example", "universal", "law", "history", "whether", "human", "behavior", "historical", "event", "succession", "donagan", "1966", "14345", "second", "compelling", "schema", "understand", "historical", "action", "outcome", "involve", "subsumption", "general", "law", "elster", "1989", "include", "process", "reasoning", "understand", "individual", "actionsanalogous", "method", "verstehen", "interpretation", "rational", "behavior", "mentioned", "dray", "1966", "13137", "process", "trace", "chain", "causation", "specific", "causal", "mechanism", "without", "invoking", "universal", "law", "careful", "rereading", "debate", "coveringlaw", "model", "history", "suggests", "debate", "took", "place", "largely", "erroneous", "assumption", "unity", "science", "postulation", "regulative", "logical", "similarity", "area", "scientific", "reasoning", "clear", "example", "explanation", "natural", "science", "approach", "deeply", "impoverished", "one", "handicapped", "start", "ability", "pose", "genuinely", "important", "question", "nature", "history", "historical", "knowledge", "explanation", "human", "action", "outcome", "understood", "along", "line", "explanation", "radiator", "burst", "temperature", "fall", "zero", "degree", "centigrade", "donagan", "concludes", "harmful", "overlook", "fundamental", "identity", "social", "science", "history", "mutilate", "research", "human", "affair", "remodeling", "social", "science", "deformed", "likeness", "physic", "1966", "157", "insistence", "naturalistic", "model", "social", "historical", "research", "lead", "easily", "presumption", "favor", "coveringlaw", "model", "explanation", "presumption", "misleading", "32", "historical", "objectivity", "another", "issue", "provoked", "significant", "attention", "among", "analytic", "philosopher", "history", "issue", "objectivity", "possible", "historical", "knowledge", "objectively", "represent", "past", "form", "bias", "omission", "selection", "interpretation", "make", "historical", "representation", "dependent", "perspective", "individual", "historian", "fact", "human", "action", "valueladen", "make", "impossible", "historian", "provide", "nonvalueladen", "account", "action", "topic", "divide", "several", "different", "problem", "noted", "john", "passmore", "1966", "76", "studied", "within", "analytic", "tradition", "valueladenness", "social", "action", "second", "possibility", "historian", "interpretation", "valueladenraising", "question", "capacity", "objectivity", "neutrality", "historian", "intellectual", "ability", "investigate", "world", "without", "regard", "bias", "built", "political", "ethical", "belief", "ideology", "commitment", "class", "social", "group", "third", "question", "objectivity", "historical", "circumstance", "fixed", "historical", "reality", "independent", "later", "representation", "fact", "history", "intrinsically", "constructed", "objective", "reality", "independent", "way", "constructed", "reality", "corresponding", "phrase", "french", "revolution", "simply", "accumulation", "written", "version", "french", "revolution", "solution", "problem", "highly", "consonant", "philosophical", "assumption", "analytic", "tradition", "first", "concerning", "value", "fundamental", "difficulty", "reconciling", "idea", "researcher", "one", "set", "religious", "value", "nonetheless", "carefully", "trace", "religious", "value", "historical", "actor", "possessing", "radically", "different", "value", "research", "done", "badly", "course", "inherent", "epistemic", "barrier", "make", "impossible", "researcher", "examine", "body", "statement", "behavior", "contemporary", "cultural", "institution", "corresponding", "come", "justified", "representation", "one", "need", "share", "value", "worldview", "sansculotte", "order", "arrive", "justified", "appraisal", "value", "worldview", "lead", "u", "resolution", "second", "issue", "wellthe", "possibility", "neutrality", "part", "researcher", "set", "epistemic", "value", "impart", "scientist", "historian", "include", "value", "intellectual", "discipline", "willingness", "subject", "hypothesis", "test", "uncomfortable", "fact", "review", "history", "science", "historical", "writing", "make", "apparent", "intellectual", "value", "effect", "plentiful", "example", "scientist", "historian", "whose", "conclusion", "guided", "interrogation", "evidence", "rather", "ideological", "presupposition", "objectivity", "pursuit", "truth", "value", "one", "followed", "finally", "question", "objectivity", "past", "basis", "saying", "event", "circumstance", "past", "objective", "fixed", "characteristic", "independent", "representation", "event", "representationindependent", "reality", "underlying", "large", "historical", "structure", "historian", "commonly", "refer", "roman", "empire", "great", "wall", "china", "imperial", "administration", "qianlong", "emperor", "work", "way", "carefully", "issue", "recognizing", "distinction", "objectivity", "past", "event", "action", "circumstance", "objectivity", "contemporary", "fact", "resulted", "past", "event", "objectivity", "fixity", "large", "historical", "entity", "past", "occurred", "precisely", "way", "didagents", "acted", "drought", "occurred", "army", "defeated", "new", "technology", "invented", "occurrence", "left", "trace", "varying", "degree", "information", "richness", "trace", "give", "u", "rational", "basis", "arriving", "belief", "occurrence", "past", "offer", "noncontroversial", "interpretation", "objectivity", "past", "however", "objectivity", "event", "occurrence", "extend", "far", "upward", "consider", "abstract", "historical", "event", "creation", "greek", "citystate", "invention", "enlightenment", "rationality", "taiping", "rebellion", "instance", "noun", "referent", "interpretive", "construction", "historical", "actor", "historian", "one", "may", "undone", "future", "historian", "refer", "taiping", "rebellion", "requires", "act", "synthesis", "large", "number", "historical", "fact", "along", "interpretive", "story", "draw", "fact", "together", "way", "rather", "way", "underlying", "fact", "behavior", "historical", "trace", "remain", "knittingtogether", "fact", "large", "historical", "event", "constitute", "objective", "historical", "entity", "consider", "research", "past", "twenty", "year", "question", "existence", "industrial", "revolution", "debate", "set", "historical", "fact", "first", "constructed", "abrupt", "episode", "qualitative", "change", "technology", "output", "western", "europe", "recent", "interpretation", "change", "gradual", "le", "correctly", "characterized", "revolution", "brien", "keyder", "1978", "consider", "arthur", "waldron", "sustained", "detailed", "argument", "effect", "great", "wall", "china", "structure", "usually", "conceptualized", "1990", "33", "causation", "history", "third", "important", "set", "issue", "received", "attention", "analytic", "philosopher", "concerned", "role", "causal", "ascription", "historical", "explanation", "involved", "saying", "american", "civil", "war", "caused", "economic", "conflict", "north", "south", "causal", "ascription", "require", "identifying", "underlying", "causal", "regularityfor", "example", "period", "rapid", "inflation", "cause", "political", "instability", "causation", "established", "discovering", "set", "necessary", "sufficient", "condition", "identify", "causal", "connection", "among", "historical", "event", "tracing", "series", "causal", "mechanism", "linking", "one", "next", "topic", "raise", "related", "problem", "determinism", "history", "certain", "event", "inevitable", "circumstance", "fall", "roman", "empire", "inevitable", "given", "configuration", "military", "material", "circumstance", "prior", "crucial", "event", "analytic", "philosopher", "history", "commonly", "approached", "issue", "basis", "theory", "causation", "drawn", "positivist", "philosophy", "science", "theory", "ultimately", "grounded", "humean", "assumption", "causation", "causation", "nothing", "constant", "conjunction", "analytic", "philosopher", "drawn", "coveringlaw", "model", "explanation", "appeared", "provide", "basis", "asserting", "historical", "causation", "noted", "approach", "causal", "explanation", "fatally", "flawed", "social", "science", "universal", "causal", "regularity", "among", "social", "phenomenon", "unavailable", "necessary", "either", "arrive", "interpretation", "causality", "abandon", "language", "causality", "second", "approach", "define", "cause", "term", "set", "causally", "relevant", "condition", "occurrence", "eventfor", "example", "necessary", "andor", "sufficient", "condition", "set", "condition", "enhance", "reduce", "likelihood", "event", "approach", "found", "support", "ordinary", "language", "philosophy", "analysis", "use", "causal", "language", "context", "courtroom", "hart", "honoré", "1959", "counterfactual", "reasoning", "important", "element", "discovery", "set", "necessary", "andor", "sufficient", "condition", "say", "c", "necessary", "occurrence", "e", "requires", "provide", "evidence", "e", "would", "occurred", "c", "present", "mackie", "1965", "1974", "evident", "causal", "circumstance", "single", "factor", "necessary", "occurrence", "effect", "outcome", "may", "overdetermined", "multiple", "independent", "factor", "convergence", "reason", "cause", "historical", "process", "helpful", "context", "historical", "cause", "frequently", "effect", "deliberate", "human", "action", "davidson", "1963", "specifying", "reason", "action", "simultaneously", "identifying", "part", "cause", "consequence", "action", "often", "justifiable", "identify", "concrete", "action", "cause", "particular", "event", "circumstance", "sufficient", "existing", "circumstance", "bring", "outcome", "feasible", "provide", "convincing", "interpretation", "reason", "led", "actor", "carry", "action", "analytic", "philosopher", "1960s", "come", "crucial", "current", "understanding", "historical", "causality", "feasibility", "tracing", "causal", "mechanism", "complex", "series", "event", "causal", "realism", "historical", "narrative", "often", "take", "form", "account", "series", "event", "causal", "condition", "trigger", "later", "event", "subsequent", "research", "philosophy", "social", "science", "provided", "substantial", "support", "historical", "explanation", "depend", "tracing", "series", "causal", "mechanism", "little", "2018", "hedström", "swedberg", "1998", "34", "recent", "topic", "philosophy", "history", "englishspeaking", "philosophy", "history", "shifted", "significantly", "1970s", "beginning", "publication", "hayden", "white", "metahistory", "1973", "louis", "mink", "writing", "period", "1966", "mink", "et", "al", "1987", "socalled", "linguistic", "turn", "marked", "many", "area", "philosophy", "literature", "also", "influenced", "philosophy", "history", "whereas", "analytic", "philosophy", "history", "emphasized", "scientific", "analogy", "historical", "knowledge", "advanced", "goal", "verifiability", "generalizability", "historical", "knowledge", "englishspeaking", "philosopher", "1970s", "1980s", "increasingly", "influenced", "hermeneutic", "philosophy", "postmodernism", "french", "literary", "theory", "rorty", "1979", "philosopher", "emphasized", "rhetoric", "historical", "writing", "nonreducibility", "historical", "narrative", "sequence", "fact", "degree", "construction", "involved", "historical", "representation", "affinity", "literature", "anthropology", "came", "eclipse", "example", "natural", "science", "guide", "representing", "historical", "knowledge", "historical", "understanding", "richness", "texture", "historical", "narrative", "came", "greater", "attention", "attempt", "provide", "causal", "explanation", "historical", "outcome", "frank", "ankersmit", "captured", "many", "theme", "treatment", "historical", "narrative", "1995", "ankersmit", "kellner", "1995", "see", "also", "berkhofer", "1995", "new", "philosophy", "history", "distinguished", "analytic", "philosophy", "history", "several", "important", "respect", "emphasizes", "historical", "narrative", "rather", "historical", "causation", "intellectually", "closer", "hermeneutic", "tradition", "positivism", "underlay", "analytic", "philosophy", "history", "1960s", "highlight", "feature", "subjectivity", "multiple", "interpretation", "objectivity", "truth", "correspondence", "fact", "another", "important", "strand", "approach", "philosophy", "history", "clear", "theoretical", "preference", "historicist", "rather", "universalist", "position", "status", "human", "natureherder", "rather", "vico", "prevalent", "perspective", "hold", "human", "consciousness", "historical", "product", "important", "part", "historian", "work", "piece", "together", "mentality", "assumption", "actor", "past", "pompa", "1990", "significantly", "contemporary", "historian", "robert", "darnton", "turned", "tool", "ethnography", "permit", "sort", "discovery", "1984", "another", "important", "strand", "thinking", "within", "analytic", "philosophy", "focused", "attention", "historical", "ontology", "hacking", "2002", "little", "2010", "topic", "historical", "ontology", "important", "philosopher", "practicing", "historian", "ontology", "question", "kind", "thing", "need", "postulate", "given", "realm", "historical", "ontology", "pose", "question", "regard", "reality", "past", "large", "construct", "like", "revolution", "market", "society", "fascism", "protestant", "religious", "identity", "included", "ontology", "real", "thing", "treat", "idea", "purely", "nominalistic", "way", "treating", "convenient", "way", "aggregating", "complex", "pattern", "social", "action", "knowledge", "large", "number", "social", "actor", "time", "place", "think", "relationship", "instance", "category", "realm", "history", "example", "relation", "french", "chinese", "russian", "revolution", "general", "category", "revolution", "social", "kind", "recur", "history", "historical", "formation", "unique", "important", "way", "question", "ontology", "answer", "give", "important", "consequence", "conceptualize", "explain", "past", "4", "historiography", "philosophy", "history", "historian", "discus", "methodological", "issue", "research", "commonly", "refer", "historiography", "philosophy", "history", "relation", "body", "thought", "writing", "history", "begin", "asking", "basic", "question", "historiography", "general", "sense", "term", "refers", "study", "historian", "method", "practice", "intellectual", "creative", "practice", "guided", "set", "standard", "heuristic", "proceed", "expert", "evaluate", "performance", "practitioner", "based", "judgment", "well", "practitioner", "meet", "standard", "one", "task", "always", "considering", "expert", "activity", "attempt", "identify", "standard", "criterion", "good", "performance", "true", "theatre", "literature", "true", "writing", "history", "historiography", "least", "part", "effort", "work", "particular", "body", "historical", "writing", "several", "handbook", "contain", "wealth", "recent", "writing", "various", "aspect", "historiography", "tucker", "2009", "bentley", "1997", "breisach", "2007", "important", "innovative", "contribution", "understanding", "intellectual", "task", "historian", "include", "bloch", "1953", "paul", "2015", "historian", "normally", "make", "truth", "claim", "ask", "u", "accept", "claim", "based", "reasoning", "present", "major", "aspect", "study", "historiography", "defining", "idea", "evidence", "rigor", "standard", "reasoning", "historical", "inquiry", "presume", "historian", "want", "discover", "empirically", "supported", "truth", "past", "presume", "want", "offer", "inference", "interpretation", "somehow", "regulated", "standard", "scientific", "rationality", "simon", "schama", "challenge", "idea", "dead", "certainty", "schama", "1991", "apprentice", "practitioner", "seek", "gain", "knowledge", "practice", "hisher", "elder", "profession", "count", "compelling", "argument", "ass", "body", "archival", "evidence", "offer", "criticize", "interpretation", "complex", "event", "necessarily", "exceeds", "available", "evidence", "historiographer", "related", "task", "heshe", "would", "like", "able", "codify", "main", "method", "standard", "one", "historical", "school", "another", "desideratum", "governing", "good", "historical", "work", "criterion", "may", "change", "culture", "culture", "epoch", "epoch", "discerning", "historian", "goal", "crucial", "deciding", "well", "succeeds", "discovering", "stylistic", "aesthetic", "standard", "guide", "historian", "work", "important", "task", "historiography", "mean", "student", "historiography", "naturally", "interested", "convention", "historical", "writing", "rhetoric", "characteristic", "given", "period", "school", "full", "historiographic", "assessment", "given", "historian", "might", "include", "question", "like", "method", "discovery", "heshe", "use", "rhetorical", "persuasive", "goal", "heshe", "pursue", "model", "explanation", "paradigm", "presentation", "standard", "style", "rhetoric", "interpretive", "assumption", "historical", "school", "might", "defined", "group", "interrelated", "historian", "share", "significant", "number", "specific", "assumption", "evidence", "explanation", "narrative", "annales", "school", "established", "marc", "bloch", "lucien", "febvre", "1920s", "represented", "distinctive", "fertile", "approach", "social", "history", "burguière", "2009", "united", "shared", "assumption", "topic", "intellectual", "approach", "past", "historiography", "becomes", "historical", "recognize", "framework", "assumption", "historical", "knowledge", "reasoning", "change", "time", "assumption", "history", "historical", "thinking", "writing", "important", "subject", "historian", "various", "period", "human", "history", "conduct", "study", "presentation", "history", "rubric", "find", "book", "historiography", "ancient", "greek", "renaissance", "historiography", "historiography", "german", "romanticism", "arnaldo", "momigliano", "writing", "ancient", "historian", "fall", "category", "momigliano", "1990", "nutshell", "momigliano", "looking", "several", "tradition", "ancient", "historywriting", "set", "normative", "practice", "dissected", "understood", "specificity", "cultural", "context", "second", "primary", "use", "concept", "historiography", "presentoriented", "methodological", "involves", "study", "analysis", "historical", "method", "research", "inquiry", "inference", "presentation", "used", "moreorless", "contemporary", "historian", "contemporary", "historian", "go", "task", "understanding", "past", "reflect", "upon", "historiographical", "challenge", "confronted", "philip", "huang", "investigated", "chinese", "peasant", "economy", "1920s", "1930s", "huang", "1990", "historiographical", "issue", "raised", "robert", "darnton", "telling", "peculiar", "trivial", "event", "great", "cat", "massacre", "printer", "apprentice", "paris", "1730s", "darnton", "1984", "sometimes", "issue", "scarcity", "bias", "available", "body", "historical", "record", "example", "fact", "much", "huang", "refers", "village", "economy", "north", "china", "gathered", "research", "team", "occupying", "japanese", "army", "sometimes", "difficulty", "interpreting", "historical", "source", "example", "unavoidable", "necessity", "darnton", "faced", "providing", "meaningful", "interpretation", "range", "documented", "action", "appear", "fundamentally", "irrational", "important", "question", "arises", "recent", "historiography", "status", "notion", "global", "history", "one", "important", "reason", "thinking", "globally", "historian", "fact", "history", "disciplinesince", "greekshas", "tended", "eurocentric", "choice", "topic", "framing", "assumption", "method", "economic", "political", "history", "example", "often", "privilege", "industrial", "revolution", "england", "creation", "modern", "bureaucratic", "state", "france", "britain", "germany", "exemplar", "modern", "development", "economics", "politics", "led", "tendency", "look", "country", "development", "nonstandard", "stunted", "global", "history", "part", "framework", "within", "historian", "avoids", "privileging", "one", "regional", "center", "primary", "others", "secondary", "peripheral", "bin", "wong", "make", "point", "china", "transformed", "wong", "1997", "second", "related", "fact", "western", "historical", "thinkersfor", "example", "hegel", "malthus", "montesquieuhave", "turned", "attention", "asia", "often", "engaged", "high", "degree", "stereotyping", "without", "much", "factual", "historical", "knowledge", "idea", "oriental", "despotism", "asian", "overpopulation", "chinese", "stagnation", "encouraged", "cartoonish", "replacement", "intricate", "diverse", "process", "development", "different", "part", "asia", "singledimensional", "reductive", "set", "simplifying", "framework", "thought", "one", "point", "edward", "said", "critique", "orientalism", "said", "1978", "global", "history", "mean", "paying", "rigorous", "attention", "specificity", "social", "political", "cultural", "arrangement", "part", "world", "besides", "europe", "historiography", "take", "global", "diversity", "seriously", "expected", "agnostic", "pattern", "development", "open", "discovery", "surprising", "pattern", "twist", "variation", "experience", "india", "china", "indochina", "arab", "world", "ottoman", "empire", "subsaharan", "africa", "variation", "complexity", "expect", "stereotyped", "simplicity", "clifford", "geertz", "historical", "reconstruction", "theatre", "state", "bali", "case", "pointhe", "uncovers", "complex", "system", "governance", "symbol", "value", "hierarchy", "represents", "substantially", "different", "structure", "politics", "model", "derived", "emergence", "bureaucratic", "state", "early", "modern", "europe", "geertz", "1980", "global", "history", "need", "free", "eurocentrism", "step", "away", "eurocentrism", "outlook", "also", "accompanied", "broadening", "geographical", "range", "historically", "interesting", "global", "history", "ought", "global", "transnational", "selection", "topicseven", "recognizing", "fact", "historical", "research", "selective", "globally", "oriented", "historian", "recognize", "political", "system", "classical", "india", "interesting", "complex", "organization", "roman", "republic", "important", "current", "underlying", "much", "work", "global", "history", "reality", "colonialism", "nineteenth", "twentieth", "century", "equally", "important", "reality", "anticolonial", "struggle", "nation", "building", "1960s", "1970s", "world", "important", "earlymodern", "capital", "great", "britain", "france", "germany", "belgium", "nation", "exerted", "colonial", "rule", "various", "part", "africa", "asia", "south", "america", "specific", "interest", "gaining", "certain", "kind", "knowledge", "societiesin", "order", "better", "govern", "exploit", "postcolonial", "state", "symmetrical", "interest", "supporting", "global", "historiography", "university", "knowledge", "system", "order", "better", "understand", "better", "critique", "forming", "relation", "past", "final", "way", "history", "need", "become", "global", "incorporate", "perspective", "historical", "tradition", "historian", "nonwestern", "country", "mainstream", "discussion", "major", "world", "development", "indian", "chinese", "historian", "intellectual", "tradition", "conducting", "historical", "research", "explanation", "global", "history", "one", "pay", "attention", "insight", "argument", "tradition", "global", "historiography", "broadened", "definition", "arena", "historical", "change", "include", "europe", "asia", "africa", "middle", "east", "america", "recognition", "complexity", "sophistication", "institution", "system", "many", "part", "world", "recognition", "transnational", "interrelatedness", "existed", "among", "continent", "least", "four", "century", "recognition", "complexity", "distinctiveness", "different", "national", "tradition", "historiography", "dominic", "sachsenmaier", "provides", "significant", "recent", "discussion", "issue", "sachsenmaier", "2011", "sachsenmaier", "devotes", "much", "attention", "last", "point", "mentioned", "multiple", "global", "perspective", "point", "want", "take", "idea", "seriously", "try", "discover", "implication", "different", "national", "tradition", "academic", "historiography", "writes", "become", "quite", "clear", "european", "society", "question", "historiographical", "tradition", "tended", "answered", "way", "profoundly", "different", "academic", "community", "part", "world", "17", "clear", "remark", "degree", "overlap", "historiography", "philosophy", "history", "fact", "concerned", "identifying", "evaluating", "standard", "reasoning", "used", "various", "historical", "tradition", "said", "historiography", "generally", "descriptive", "le", "evaluative", "philosophy", "history", "concerned", "specific", "research", "writing", "philosophy", "history", "5", "historical", "understanding", "twentieth", "century", "every", "period", "present", "challenge", "historian", "every", "period", "raise", "problem", "historiography", "philosophy", "history", "twentieth", "century", "exceptional", "however", "even", "standard", "event", "truly", "global", "significance", "occurred", "beginning", "end", "war", "totalitarianism", "genocide", "mass", "starvation", "ideology", "murder", "extermination", "state", "dominated", "population", "unprecedented", "violence", "transpired", "century", "holocaust", "snyder", "2010", "2015", "holodomor", "applebaum", "2017", "gulag", "applebaum", "2003", "cultural", "ideological", "premise", "nazi", "regime", "rabinbach", "et", "al", "2020", "presented", "historian", "major", "new", "challenge", "research", "framing", "understanding", "historian", "seek", "come", "grip", "complex", "horrifying", "circumstance", "occurrence", "highly", "complex", "extended", "often", "hidden", "many", "thousand", "active", "participant", "many", "group", "population", "million", "victim", "conflicting", "purpose", "goal", "new", "organization", "institution", "numerous", "ideology", "moreover", "many", "novelty", "woven", "theme", "evil", "deliberate", "destruction", "degradation", "murder", "mass", "innocent", "human", "being", "historian", "virtually", "aspect", "twentieth", "century", "confronted", "great", "problem", "framesetting", "explanatory", "purpose", "moral", "reflection", "fact", "twentieth", "century", "raise", "problem", "philosophy", "history", "several", "reason", "challenge", "historian", "consider", "depth", "detail", "human", "experience", "historian", "must", "convey", "event", "experience", "war", "genocide", "totalitarianism", "imposed", "million", "people", "discovery", "truthful", "documentation", "extent", "lived", "experience", "crime", "painful", "crucial", "necessity", "second", "historian", "forced", "reflect", "assumption", "bring", "research", "interpretation", "assumption", "geography", "political", "causation", "individual", "motivation", "behavior", "resulting", "crime", "third", "historian", "must", "reconsider", "sharpen", "hypothesis", "causation", "vast", "extended", "crime", "humanity", "fourth", "appears", "inescapable", "historian", "human", "responsibility", "contribute", "worldwide", "change", "culture", "memory", "politics", "way", "make", "genocide", "totalitarian", "oppression", "le", "likely", "future", "way", "historian", "sought", "understand", "holocaust", "undergone", "important", "historical", "realignment", "past", "twenty", "year", "raul", "hilberg", "1961", "lucy", "dawidowicz", "1975", "captured", "much", "postwar", "historical", "consensus", "holocaust", "however", "recent", "historian", "offered", "new", "way", "thinking", "nazi", "plan", "extermination", "timothy", "snyder", "2010", "2015", "argues", "nazi", "war", "extermination", "jew", "importantly", "misunderstoodtoo", "centered", "germany", "majority", "genocide", "murder", "occurred", "east", "land", "call", "bloodlands", "central", "europe", "poland", "latvia", "lithuania", "ukraine", "soviet", "union", "largely", "focused", "extermination", "camp", "whereas", "killing", "jew", "occurred", "near", "city", "village", "lived", "commonly", "gunfire", "insufficiently", "attentive", "relationship", "extermination", "people", "destruction", "institution", "state", "subject", "country", "without", "sufficient", "attention", "hitler", "worldview", "within", "nazi", "war", "extermination", "europe", "jew", "framed", "alexander", "prusin", "2010", "conceptualizes", "topic", "mass", "murder", "period", "19331945", "much", "geographical", "term", "like", "snyder", "prusin", "defines", "subject", "matter", "region", "rather", "nation", "collection", "nation", "national", "border", "exist", "within", "region", "le", "importance", "account", "fact", "ethnic", "religious", "community", "disparity", "evident", "across", "region", "thus", "historian", "argue", "need", "understand", "geography", "holocaust", "differently", "snyder", "belief", "attempt", "refocusing", "way", "understand", "holocaust", "lead", "new", "assessment", "bad", "thought", "holocaust", "much", "much", "worse", "another", "strand", "rethinking", "occurred", "study", "holocaust", "concern", "renewed", "focus", "motivation", "ordinary", "people", "participated", "machinery", "mass", "murder", "major", "field", "research", "ordinary", "behavior", "holocaust", "made", "possible", "availability", "investigative", "file", "concerning", "action", "hamburg", "police", "unit", "assigned", "special", "duty", "order", "police", "poland", "1940", "duty", "amounted", "collecting", "massacring", "large", "number", "jewish", "men", "woman", "child", "christopher", "browning", "1992", "daniel", "goldhagen", "1996", "made", "extensive", "use", "investigatory", "file", "testimony", "men", "reserve", "police", "battalion", "101", "book", "came", "shocking", "conclusion", "ordinary", "middleaged", "apolitical", "men", "police", "unit", "picked", "work", "murder", "extermination", "zeal", "efficiency", "coerced", "indoctrinated", "deranged", "yet", "turned", "work", "mass", "murder", "enthusiasm", "small", "percentage", "men", "unit", "declined", "shooting", "assignment", "great", "majority", "another", "important", "example", "research", "ordinary", "people", "committing", "mass", "murder", "jan", "gross", "2001", "case", "study", "single", "massacre", "jew", "jedwabne", "small", "polish", "town", "nazi", "occupation", "ordered", "directed", "german", "occupation", "instead", "local", "indigenous", "action", "nonjewish", "resident", "town", "gathered", "jewish", "neighbor", "murdered", "large", "number", "gross", "account", "stimulated", "much", "debate", "anna", "bikont", "2015", "validates", "almost", "every", "detail", "gross", "original", "narrative", "different", "example", "consider", "history", "gulag", "soviet", "union", "anne", "applebaum", "2003", "provides", "detailed", "honest", "history", "gulag", "role", "maintaining", "soviet", "dictatorship", "stalin", "dictatorship", "depended", "leader", "party", "set", "institution", "worked", "terrorize", "repress", "population", "ussr", "nkvd", "system", "internal", "security", "police", "enforced", "stalin", "repression", "justice", "system", "embodied", "moscow", "show", "trial", "193638", "especially", "system", "forced", "labor", "prison", "camp", "came", "known", "gulag", "constituted", "machinery", "repression", "population", "several", "hundred", "million", "people", "controlled", "imprisoned", "repressed", "like", "nazi", "regime", "stalin", "used", "slave", "labor", "camp", "contribute", "economic", "output", "soviet", "economy", "applebaum", "estimate", "roughly", "two", "million", "prisoner", "inhabited", "several", "thousand", "camp", "gulag", "time", "1940s", "many", "18", "million", "people", "passed", "camp", "1953", "applebaum", "2003", "13", "economic", "role", "gulag", "considerable", "significant", "portion", "sovietera", "mining", "logging", "manufacturing", "took", "place", "within", "forced", "labor", "camp", "gulag", "13", "applebaum", "make", "crucial", "important", "point", "historical", "knowledge", "history", "gulag", "inherent", "incompleteness", "historical", "understanding", "mechanism", "overlooking", "forgetting", "get", "way", "historical", "honesty", "public", "outside", "ussr", "want", "know", "reality", "applebaum", "note", "public", "knowledge", "camp", "west", "available", "dedramatized", "treated", "fairly", "minor", "part", "reality", "ussr", "realitythat", "ussr", "embodied", "depended", "upon", "massive", "set", "concentration", "camp", "million", "people", "enslaved", "sometimes", "killedwas", "never", "major", "part", "western", "conception", "ussr", "comment", "far", "common", "however", "reaction", "boredom", "indifference", "stalinist", "terror", "18", "wide", "knowledge", "west", "scope", "specific", "human", "catastrophe", "gulag", "first", "made", "available", "aleksandr", "isayevich", "solzhenitsyn", "1974", "similar", "reference", "could", "offered", "concerning", "stalin", "war", "kulaks", "ukraine", "1930s", "mass", "starvation", "china", "195861", "widespread", "violence", "cultural", "revolution", "china", "19661976", "use", "violence", "american", "south", "enforce", "jim", "crowera", "race", "relation", "1930s1960s", "case", "terrible", "thing", "took", "place", "wide", "scale", "barrier", "exist", "make", "difficult", "historian", "public", "come", "know", "detail", "period", "twentieth", "century", "pose", "one", "additional", "challenge", "historian", "fall", "within", "human", "memory", "living", "generation", "historian", "grappling", "intricacy", "tony", "judt", "writes", "2006", "fall", "ceaușescu", "romania", "1989", "timothy", "snyder", "2010", "writes", "murderous", "action", "german", "order", "police", "ukraine", "1940", "marc", "bloch", "1949", "writes", "strange", "defeat", "france", "1940", "writing", "event", "parent", "pole", "ukrainian", "jew", "interact", "direct", "lived", "experience", "memory", "timothy", "snyder", "style", "historical", "writing", "suggests", "nearness", "time", "killing", "bloodlands", "support", "warrant", "especially", "personal", "individual", "approach", "thus", "snyder", "use", "many", "individual", "story", "victim", "killing", "peasant", "jew", "human", "victim", "killing", "machine", "hitler", "stalin", "suggests", "belief", "important", "historian", "make", "effort", "convey", "individual", "meaning", "event", "affecting", "million", "people", "accessibility", "recent", "past", "affect", "problem", "facing", "historian", "influence", "way", "historian", "select", "event", "cause", "action", "crucial", "experiential", "access", "living", "memory", "provide", "secure", "form", "historical", "evidence", "source", "available", "historian", "give", "rise", "experiential", "content", "detail", "historical", "writing", "solve", "interpretive", "problem", "reader", "example", "put", "oneself", "position", "ukrainian", "peasant", "slowly", "starving", "death", "story", "told", "judt", "household", "london", "1942", "beloved", "cousin", "facing", "deadly", "threat", "brussels", "shape", "historical", "consciousness", "adult", "historian", "judt", "snyder", "2012", "marc", "bloch", "experience", "french", "army", "officer", "defeat", "dunkirk", "influence", "way", "understood", "war", "violence", "access", "individual", "lived", "holodomor", "spanish", "civil", "war", "course", "valuable", "historical", "evidence", "however", "marc", "bloch", "important", "insight", "bloch", "specifically", "challenge", "idea", "participant", "inherently", "reliable", "complete", "form", "knowledge", "temporally", "distant", "historian", "1953", "chapter", "ii", "memory", "personal", "account", "valuable", "historian", "equally", "historian", "access", "form", "historical", "evidence", "archaeological", "archival", "government", "record", "may", "comparably", "important", "epistemically", "secure", "attempting", "piece", "together", "complex", "history", "stalin", "war", "ukrainian", "peasantry", "topic", "twentiethcentury", "history", "create", "important", "reminder", "historian", "philosopher", "truthful", "understanding", "inhuman", "atrocity", "deeply", "important", "humanity", "difficult", "attain", "learn", "judt", "snyder", "applebaum", "powerful", "mechanism", "deception", "forgetting", "stand", "way", "honest", "accounting", "period", "recent", "human", "past", "discovering", "telling", "truth", "past", "highest", "important", "moral", "imperative", "history", "conveys", "6", "ethic", "history", "memory", "previous", "section", "suggests", "ethical", "dimension", "involved", "quest", "historical", "knowledge", "historian", "obligation", "truthfulness", "objectivity", "people", "obligation", "honest", "recognition", "nation", "obligation", "memory", "reconciliation", "historian", "obligation", "truthfulness", "objectivity", "account", "provide", "past", "topic", "occupied", "much", "discussion", "history", "ethic", "past", "year", "fay", "2004", "much", "discussion", "centered", "intellectual", "virtue", "historian", "need", "aspire", "truthfulness", "objectivity", "persistence", "creyghton", "et", "al", "2016", "paul", "2015", "perhaps", "generally", "might", "argue", "historian", "obligation", "deliberately", "actively", "include", "aspect", "past", "research", "morally", "troublesomefor", "example", "origin", "experience", "slavery", "eighteenth", "century", "american", "south", "role", "gulag", "soviet", "union", "twentieth", "century", "may", "reasonably", "fault", "historian", "american", "south", "nineteenth", "century", "confines", "investigation", "economics", "cotton", "industry", "without", "examining", "role", "slavery", "industry", "historian", "ussr", "study", "institution", "engineering", "research", "1950s", "ignoring", "fact", "forced", "labor", "camp", "historian", "obligation", "squarely", "confront", "hard", "truth", "subject", "matter", "broader", "ethical", "question", "ask", "history", "go", "beyond", "professional", "ethic", "historian", "responsibility", "public", "relation", "history", "fact", "genocide", "crime", "humanity", "make", "clear", "moral", "reason", "believing", "humanity", "moral", "responsibility", "attempt", "discover", "past", "honesty", "exactness", "particular", "fact", "past", "horrific", "action", "genocide", "mass", "repression", "slavery", "suppression", "ethnic", "minority", "dictatorship", "create", "moral", "responsibility", "historian", "public", "alike", "uncover", "detail", "cause", "consequence", "action", "thread", "honesty", "truthfulness", "run", "ethical", "issue", "tony", "judt", "1992", "argues", "people", "nation", "point", "time", "collective", "responsibility", "face", "fact", "history", "honestly", "without", "mythology", "judt", "point", "distilled", "key", "idea", "knowledge", "past", "matter", "present", "truthful", "past", "key", "responsibility", "u", "standing", "way", "honest", "recognition", "fact", "oppressor", "tyrant", "invariably", "interested", "concealing", "culpability", "innocent", "citizen", "likewise", "inclined", "minimize", "involvement", "crime", "government", "result", "mythmaking", "according", "judt", "anna", "wylegala", "2017", "illustrates", "moral", "importance", "complexity", "kind", "investigation", "regard", "collective", "memory", "post1991", "ukraine", "history", "twentieth", "century", "shown", "especially", "prone", "mythmaking", "whether", "resistance", "nazi", "occupation", "refusal", "collaborate", "sovietinstalled", "regime", "poland", "czechoslovakia", "judt", "1992", "argues", "pervasive", "process", "mythmaking", "forgetting", "deep", "part", "narrativemaking", "postwar", "europe", "judt", "argues", "bad", "myth", "give", "rise", "eventually", "bad", "collective", "behaviormore", "conflict", "tyranny", "violence", "work", "honest", "history", "crucial", "humanity", "ability", "achieve", "better", "future", "judt", "express", "throughout", "work", "credo", "truthtelling", "past", "weighty", "obligation", "discover", "represent", "understand", "circumstance", "past", "even", "fact", "deeply", "unpalatable", "mythmaking", "past", "bad", "history", "bad", "politics", "morally", "deficient", "observation", "brings", "u", "final", "way", "moral", "question", "arise", "context", "honest", "history", "crime", "past", "consequence", "present", "fact", "transatlantic", "slavery", "continue", "consequence", "million", "descendant", "men", "woman", "transported", "africa", "america", "fact", "rwandan", "genocide", "consequence", "living", "victim", "mass", "killing", "kin", "fact", "colonial", "exploitation", "congo", "southern", "africa", "consequence", "current", "poverty", "much", "africa", "knowledge", "crime", "past", "create", "current", "generation", "obligation", "engagement", "contributing", "actively", "healing", "wound", "present", "preventing", "recurrence", "future", "truth", "reconciliation", "require", "simply", "recognizing", "ugly", "truth", "past", "require", "act", "differently", "individually", "collectively", "course", "tragic", "immutable", "reality", "human", "condition", "past", "changed", "murdered", "unmurdered", "primary", "perpetrator", "horrific", "crime", "within", "generation", "certainly", "beyond", "reach", "justice", "future", "deeply", "contingent", "past", "fixed", "unchangeable", "immutability", "imply", "present", "generation", "obligation", "created", "past", "crime", "rather", "knowing", "truth", "past", "create", "u", "obligation", "learn", "tragic", "human", "action", "avoid", "crime", "future", "honest", "knowledge", "human", "crime", "past", "bring", "obligation", "strive", "good", "faith", "address", "consequence", "crime", "present", "finally", "knowledge", "history", "help", "u", "become", "empathetic", "farsighted", "dealing", "grand", "affair", "make", "future", "history", "one", "would", "hope", "perhaps", "pressing", "moral", "obligation", "created", "recognition", "historicity"]}