{"url": "lefevre-etaples", "title": "Jacques Lefèvre d’Étaples", "authorship": {"year": "Copyright © 2019", "author_text": "Richard J. Oosterhoff\n<richard.oosterhoff@gmail.com>", "author_links": [{"mailto:richard%2eoosterhoff%40gmail%2ecom": "richard.oosterhoff@gmail.com"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nRichard J. Oosterhoff\n&lt;<a href=\"mailto:richard%2eoosterhoff%40gmail%2ecom\"><em>richard<abbr title=\" dot \">.</abbr>oosterhoff<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Fri Apr 10, 2015", "substantive revision Wed Jul 3, 2019"], "preamble": "\n\nJacques Lefèvre d’Étaples (c. 1450–1536)\ntaught philosophy at the University of Paris from around 1490 to 1508,\nand then applied his erudition and textual scholarship to biblical\nstudies and religious reform. Lefèvre traveled to Italy in\n1491, 1500, and 1507. There he sought out Ermolao Barbaro, Giovanni\nPico della Mirandola, Marsilio Ficino, Angelo Poliziano, and other\nfamous humanists. He himself became famous for the many introductions,\ncommentaries, and editions relating to philosophical works he\npublished in Paris. These repackaged the full range of philosophical\nstudies, from his early interests in mathematics and natural magic, to\nthe entire curriculum of university logic, natural philosophy, moral\nphilosophy, and metaphysics.\n\nEarly modern scholars, from Francesco Patrizi da Cherso in the\nsixteenth century to Johann Jacob Brucker in the eighteenth, hailed\nLefèvre as a leading humanist, particularly praising his\nreplacement of scholastic questions with humanist eloquence. Modern\nscholars have taken a more nuanced view, studying\nLefèvre’s historical context: he pursued a humanist\nproject from within the university. Even after he retired\nfrom teaching philosophy, his versions of Aristotle were published in\nnew editions, sometimes with new commentaries, for several\ndecades—for historians of Renaissance philosophy, they mark the\nnorthward, university-based movement of a humanist approach to\nAristotle which earlier scholars such as Leonardo Bruni and Ermolao\nBarbaro had pioneered in Italy. The university environment gave\nLefèvre’s vision of philosophical reform a broad scope,\nextending even to mathematical works of the quadrivium. He also\ncontributed to Renaissance philosophy beyond the university with\nimportant editions of the corpus attributed to Hermes Trismegistus,\nvarious Church Fathers, the Catalan mystic Ramon Lull, and the\nopera omnia of Cardinal Nicholas of Cusa.\n\nLefèvre’s wide-ranging publications and their\nphilosophical import require more scholarly analysis than they have\nyet received. Since, however, his primary contribution to the history\nof philosophy was pedagogical and entailed reformulating older works\nto serve new audiences, the following survey focuses more on the\nbroader outlines of his project than on his specific philosophical\ndoctrines.\n", "toc": [{"#LifWor": "1. Life and Works"}, {"#EpiPhiSty": "2. Epitome as Philosophical Style"}, {"#AriMetSch": "3. Aristotle’s Method and the “Schools”"}, {"#PhiThe": "4. Philosophical Themes"}, {"#Log": "4.1 Logic"}, {"#QueUni": "4.2 The Question of Universals"}, {"#Nat": "4.3 Natural Philosophy"}, {"#Mor": "4.4 Moral Philosophy"}, {"#Met": "4.5 Metaphysics"}, {"#Leg": "5. Legacy"}, {"#Bib": "Bibliography"}, {"#SelWorLef": "Selected Works by Lefèvre"}, {"#PriSouSecLit": "Primary Sources and Secondary Literature"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Life and Works\n\nLittle is known about Lefèvre’s family and early\ntraining. He came from Étaples, on the coast of Picardy, and by\nthe early 1490s he was teaching in the Collège du Cardinal\nLemoine in Paris. In an unusually long teaching career of nearly two\ndecades, he became the college’s most revered teacher, elevating\nit out of relative obscurity. His reputation as a philosopher was\ncultivated in the classroom and in countless editions of philosophical\nworks; any account of his thought must first place this diverse body\nof work within the context of his life.\n\nLefèvre’s early publications are punctuated by his three\njourneys to Italy. Colleagues mentioned his contact with the great\nhumanists of fifteenth-century Italy as much as they lauded his\nencyclopedic learning. He undertook these journeys, apparently, to\npursue models of scholarly inquiry which might leaven his teaching in\nParis. In 1491 he traveled to Venice, ostensibly to meet Ermolao\nBarbaro, who was famous as an eloquent translator of Themistius, the\nfourth-century paraphrast of Aristotle. (Barbaro was in Rome at the\ntime, so Lefèvre changed his travel plans to include Rome and\nFlorence.) On his return, he published his first work in print,\nTotius philosophiae naturalis paraphrases (1492). In these\n600 octavo pages, he presented students with short epitomes and\ndigested paraphrases of Aristotle’s Physics, On the\nHeavens, the minor works of natural philosophy (i.e., Parva\nnaturalia or Little Naturals), and On the Soul.\nThe next few years were immensely productive, and with the help of\ncolleagues and students, Lefèvre published similar epitomes for\nthe standard university course on logic (1496b), Aristotle’s\nMetaphysics (1494a), and the Nicomachean Ethics\n(1494b).\n\nIn the 1490s, Lefèvre also published works for the university\nclass room which went beyond Aristotle, notably in mathematics\n(Oosterhoff 2018). For astronomy, he wrote an important commentary on\nthe standard introduction, John of Sacrobosco’s Sphere\n(1495). In print, arguably Lefèvre’s most original\ncontribution to any field was a systematic treatise on music theory\n(Elementa musicalia) which he published with three other\nworks: an edition of the Elementa arithmetica of Jordanus\nNemorarius (13th century), his own popular introduction to\nthe Arithmetica of Boethius, and an arithmetical game,\nRithmomachia (1496a; see also Oosterhoff 2013, Moyer 2012).\nThese mathematical works served pedagogical uses, first of all,\nhelping students through an often-neglected part of the Paris\ncursus. But they also served philosophical aims of\nLefèvre which became more evident in works unrelated to the\nuniversity curriculum. Consider three examples: in 1494 he published\nFicino’s Latin translation of most of the Hermetic Corpus, along\nwith his own brief annotations; in 1498, he printed the first edition\nof the Works attributed to Dionysius the Areopagite, in Latin\ntranslation, along with an extensive commentary; and in the mid-1490s\nhe composed On Natural Magic (De magia naturali ),\nwhich circulated in manuscript (Lefèvre [MN]). Inspired partly\nby Ficino’s Three Books on Life (De triplici\nvita), this treatise incorporated Pythagorean, cabbalistic, and\nPresocratic themes, for example in a section on “Pythagorean\nMagic” (Copenhaver 1977; Mandosio 2013). His reflections on\nmagic especially included numerological excurses.\n\nBy 1500, Lefèvre had begun to produce more philologically\noriented editions—typically he placed the newer translations\nalongside the traditional medieval versions, with his own commentary\nand occasional emendations informed by his modest command of Greek.\nThe earliest example of this method was his three-fold edition of\nAristotle’s Nicomachean Ethics (1497), which included\nthe medieval Latin version along with the translations of Johannes\nArgyropolus and Leonardo Bruni. This approach also defined\nLefèvre’s ground-breaking editions of the Psalms (1509),\nthe letters of St Paul (1512), and Euclid’s Elements of\nGeometry (1517a).\n\nHe returned to Italy in 1500, meeting the famous humanist printer\nAldus Manutius in Venice and attending Roman celebrations of the papal\njubilee. At a monastery near Padua, he copied out some of Ramon\nLull’s Blaquerna, and in Rome he found a treatise on a\nminiature astrolabe; he published both in Paris (1505 and 1500\nrespectively). On his return, perhaps stimulated by the Greek editions\nof Aldus, Lefèvre’s Aristotelian program took on new\ndimensions, with fuller editions and translations than those of his\nearlier handbooks. The most significant of these was probably a large\nfolio Latin edition of Aristotle’s Organon, with a full\nsuite of detailed commentaries. Another unusual publication combined\nAristotle’s Politics and the pseudo-Aristotelian\nEconomics with 700 sentences taken from Plato’s\nRepublic and Laws, digested as the\nHecatonomia (1506).\n\nAfter his final trip to Rome in 1507, Lefèvre’s interest\nin philosophy receded into the background, as he retired from teaching\nat the Collège du Cardinal Lemoine. Philosophy did not\ndisappear entirely, however. In 1514, he finally published the\nopera omnia of Cardinal Nicholas of Cusa, the fruit of many\nyears spent gathering together manuscripts; and in 1515 he published\nArgyropoulos’s translation of Aristotle’s\nMetaphysics together with the translation of Cardinal\nBessarion, which Pico had given him in manuscript in 1491. But his\nprimary energies were now focused on biblical studies; and, as one of\nthe most prominent intellectuals of the day, Lefèvre was drawn\nreluctantly into several controversies. When the Paris faculty of\ntheology charged his friend Johann Reuchlin with Judaizing in 1514, he\nwrote a plea to Rome for help from the like-minded Giles of Viterbo,\nVicar General of the Augustinian Order. Then, Erasmus of Rotterdam\nsought to take the aging pedagogue down a notch by criticizing his\nwork on the Pauline epistles for shaky Greek. In 1517 Lefèvre\nfound himself at the heart of another academic culture war: the debate\nover the Three Maries, in which he took the skeptical view that the\nthree figures of that name in the New Testament were not, as tradition\nheld, the same person. The final, devastating controversy began in\n1521, when his patron, Cardinal Guillaume Briçonnet, invited\nhim to lead an experiment in diocesan reform at Meaux, near Paris. The\nParis faculty of theology, already concerned about\nLefèvre’s incursions into the field of theology, found\nthe experiment smacked too much of Lutheranism—which they had\nalready condemned in 1520. In a few years the experiment at Meaux\ndisintegrated, and in 1525 Lefèvre fled to Strassburg. The\nfollowing year François Ier recalled Lefèvre\nto France. He tutored the royal children and served as chaplain at the\ncourt of Marguerite de Navarre, the king’s sister, for the final\ndecade of his life (Reid 2009).\n2. Epitome as Philosophical Style\n\nLefèvre’s reputation rested on the manner in which he\nintroduced philosophy in commentaries, paraphrases, and\neditions—in other words, on a style of philosophical\nepitome. The late sixteenth-century critic of Aristotelianism\nFrancesco Patrizi observed that Lefèvre was the first to read\nAristotle without scholastic quaestiones, and historians\nfrequently cite Lefèvre’s desire, following the\ntranslations of Aristotle by Leonardo Bruni, to\n\n\ndraw up and taste the purest waters from the very spring of\nAristotle’s works (Nunc ergo O iuvenes ex Aristotelico\nopere, ceu ex proprio fonte purissimas haurite, delibateque\naquas),\n\n\nas he exhorted students on the title-page of his 1503 edition of the\nlogical works (see Bianchi 2007: 57n19; Schmitt 1988). He hoped to\nreturn to the source itself, convinced that this would cure philosophy\nof its ills—he described mathematics and the “ancient\nwisdom”, for example, as medicines which would prepare\nstudents’ minds properly to approach philosophy (Lefèvre\n1496a: h7v). He denounced the more innovative elements of traditional\nuniversity logic such as sophismata and instead suggested\nthat students should read his own shorter handbook on logic (1496b) to\nlearn just enough before moving on to more profitable studies. Instead\nof addressing specialized topics or staking out a position within a\nuniversity “school”, Lefèvre favored handbooks\nwhich introduced a discipline through brief explanations of terms and\nbasic concepts, ostensibly leaving students with a conceptual\nvocabulary and enough time to read Aristotle on their own.\n\nLefèvre’s textbooks often deployed several genres in the\nsame volume (Lines 2007). Most visually striking are the synoptic\ntables before each introduction, which at a glance supply a roadmap to\nthe whole work. The table was followed by a paraphrase of the work,\nchapter by chapter, in an effort to reorganize the sinewy contours of\nAristotle’s works in simpler form. Usually Lefèvre\nprefaced paraphrases with notae, which encapsulated his\njudgement on the most interesting or important insights in the\nchapter; these might be added to philological, historical, or topical\nremarks. Another genre Lefèvre occasionally used was the\ndialogue, which not only catechized young students in philosophical\ndoctrine, but also demonstrated how teacher and pupil should engage\nwith each other. Finally, when he published an edition of an\nAristotelian treatise, Lefèvre also wrote a more traditional\ncommentary. Again, he normally proceeded chapter by chapter through\nAristotle’s text, keeping “literal” comments on\nphilological questions and obscure phrases separate from\nnotae on literary, doctrinal, or methodological issues raised\nin the work.\n\nIn aggregate, this range of epitomizing formats or genres defined a\nRenaissance philosophical style, which Lefèvre’s works\nremodeled for northern universities. Kessler has argued that when\nLefèvre met Barbaro and Poliziano in Italy, he also encountered\na new Aristotle: Barbaro had promised his students that he would make\nall of Aristotle accessible to them (Kessler 1999). This was not\nAristotle taken piecemeal, but instead as an author to be digested in\nhis entirety, systematically and compendiously. In his paraphrases\nLefèvre thus presents an encyclopedic Aristotle. Poliziano, who\nwas lecturing on Aristotle when Lefèvre visited Florence in\n1491, stands out as a possible precedent for the philological side of\nLefèvre’s encyclopedic enterprise (Celenza 2010).\nPoliziano promised to explain both facts and words, res et\nverba, in Aristotle, giving the account of a\n“grammarian”, which would represent Aristotle better than\nthe “philosophical” comments of his university\ncompetitors. This approach to the philological commentary can to some\nextent be traced in Lefèvre’s literary notes and\ninterpretive comparisons. The idea that Poliziano was a central\ninfluence, however, needs to be treated with caution, since Poliziano\n(as far as we can tell from his surviving praelectiones)\nfocused on what knowledge of Greek could reveal about\nAristotle’s meaning, word by word, with little concern for a\nsynoptic vision of Aristotle’s works, whereas Lefèvre\naimed to reconstruct Aristotle systematically, as a whole, laying\nemphasis, furthermore, on his coherence with Christian teaching.\n3. Aristotle’s Method and the “Schools”\n\nLefèvre saw his concordist and source-based approach to\nphilosophy as a way to steer clear of the late medieval philosophical\n“schools”, which modern scholarship has often divided\nbetween realists (Thomists and Scotists) and nominalists (Ockham and\nothers). But, as Hoenen (2003) observes, late medieval scholars often\nsaw themselves as occupying a place in a given tradition, following\nThomas Aquinas, John Duns Scotus, or other leading philosophers; yet\nthis does not mean that a Scotist was a “realist” in all\nfields of study, and a philosopher’s view on universals does not\nsystematically predict his views on other doctrines. Rather, a school\nof thought is identified by a processus or method, of which\nparticular figures such as Albert the Great or Duns Scotus were\nhistorical exemplars.\n\nLefèvre’s central claim was that Aristotle himself should\nbe the exemplar of method, not any “Aristotelians”. He\nexhorted students to read Aristotle’s own works, rather than to\nmake a career out of studying commentaries on them. His first\ncontribution to logic was a short epitome of the major logical\noperations found in Peter of Spain’s Summule logicales,\nwhich he prefaced by entreating students not to get caught up in\nexponabilia, insolubilia, and sophismata,\nwhich “should be rejected from philosophy”, but instead to\npass through them quickly, as if scouting in a barbarian land (1496b:\na1v; Rice 1972: 39). In his 1503 edition of Aristotle’s logical\nworks, Lefèvre presented an emended text of the standard Latin\ntranslations of Boethius, with a brief commentary. The textual work\nwas necessary, he said, because previous generations, \n\n\nalthough they dealt with logic, did not actually make use of logic,\nbut of certain factious and extraneous matters, which should be\ncondemned rather than refuted. (1503a: a1v; Rice 1972: 88)\n\n\nThe result was that books of logic had become full of errors,\n“novelties” (novitia), and “lifeless\nmatters, like so much hay” (ibid.). In contrast, the commentary\nin his corrected edition would be brief and would explain\nAristotle’s meaning, instead of that of his commentators.\n\nLefèvre’s textbooks were designed to help students gain\naccess to Aristotle by quickly familiarizing them with the elementary\ndefinitions of each discipline and setting these in a larger schematic\nframework. In a comment on Aristotle’s Politics, he\nstressed that the integrity of different disciplines requires\nidentifying the components proper to each—for example, the point\nin geometry, the monad in arithmetic, or the letters which make up\nwords in grammar (1506: a2v). This respected Aristotle’s own\nmethodical admonition not to make the mistaken assumption that\nconclusions from one discipline could be applied to another—his\nprohibition of metabasis. Similarly, from his earliest\nwritings, Lefèvre insisted that each discipline should follow a\ndistinctive kind of reasoning: thus\n\n\nlogic should be left to deal with logical matters, mathematics with\nmathematical matters, and divine discipline with metaphysical matters.\n(Lefèvre 1492: b4v; Rice 1970: 12)\n\n\nLefèvre’s textbooks often divided disciplines into their\nconstituent parts, sometimes visually simplified in synoptic tables;\nthe goal of such tables was to provide students with swift access to\nthe individual elements, as well as to the more general headings, of a\ngiven discipline—a vision of methodical philosophy popularized\nby Peter Ramus later in the sixteenth century (Ong 1958; for an\noverview of recent literature, see Hotson 2007: 16–37).\n\nThe fact that each discipline had its own form of reasoning did not\nmean they could not be compared or did not point to an ultimate unity.\nAccording to Lefèvre, Aristotle also taught that disciplines\nbore an analogical relationship to one another—the distinctive\nmethod of each discipline was the starting-point to this higher\nknowledge. Frequently he (and his students after him) alerted readers\nto what they believed were “traces” (vestigia) or\n“analogies” (analogiae) which could help them to\nfind the deeper unity beneath apparently diverse phenomena. In his\nearliest introduction to natural philosophy, Lefèvre claimed\nthat there was a\n\n\nkind of secret analogy lying hidden and underneath the whole of\nAristotle’s philosophy, without which philosophy is inanimate\nand lifeless, like a body without the sense of touch. (1492: b2r; Rice\n1970: 6)\n\n\nThough he regularly draws attention to analogies, Lefèvre does\nnot systematically describe this “secret analogy”.\nInstead, he often uses analogy to compare the constituent parts of\ndifferent disciplines (Oosterhoff 2018: 77–85). More\ncircumstantial evidence suggests that members of his circle at least\ntoyed with the idea that analogy could be a more universal science. A\nstudent of his, Beatus Rhenanus, included in his course notes several\ntheses concerning how “analogy is the science of\nsciences”, that “Aristotle claims he finds the secrets of\nthe sciences by analogy”, and “what is known by analogy is\nknown more firmly than by demonstration” (Beatus\nRhenanus’s Cahier d’étudiant,\nBibliothèque humaniste de Sélestat, MS 50, 253r). This\nfascination with analogies may explain why Lefèvre appreciated\nmathematics so much, since ancient number theory focused on the ratios\n(proportiones in Latin, analogia in Greek) between\nnumbers. For him, analogia sometimes had the ancient Greek\nmeaning of a proportion or ratio between two mathematical objects; at\nother times, it reflected analogies between the subjects of lower and\nhigher disciplines, as when he argued that mathematical reasoning\nprovided\n\n\ncertain steps, … especially if one knows the method\n(modus) of analogies and uplifting exercises\n[assurrectiones]. (Lefèvre 1517a: a2v; Rice 1972:\n380)\n\n\nHe then praised mathematics as a model for such a method:\n\n\nWhat, I ask, can give quicker, more abstract, purer analogies for\nrising to divine matters … than mathematical learning?\n(ibid.)\n\n\nIn other cases, he based analogies on structural similarities between\nthe elementary parts of an area of study (e.g., Lefèvre 1497\na3r, where he discusses the analogies of elementary parts of\ndisciplines). \n\nA method in the sixteenth century was a way of approaching a\ngiven discipline—according to the Paduan school, for example,\none properly approached natural philosophy through the logical method\nof regressus. But Lefèvre believed that this kind of\nprioritizing of logic over other disciplines undermined the\ndistinctive modes of reasoning proper to each discipline. In the\nsixteenth century, one of the many uses of the word methodus\nwas to indicate a short cut, perhaps a compendious textbook, by which\na student might approach a discipline (Gilbert 1960: 59–60).\nIndeed, there is some evidence of this usage in Lefèvre’s\nown circle. Guillaume Gontier, his student and amanuensis, explicitly\nreferred to Lefèvre’s collection of introductions on\nlogic as a “method”, telling readers that\n\n\nby this extremely brief method [you] will swiftly land at the port of\nthe disciplines. (hac methodo etiam quam brevissima ad\ndisciplinarum portus ocissime appelere, 1496b: d6r–v)\n\n\nIn 1502, Bruno Amerbach informed Johannes Amerbach in Basel that he\nwas attending the “cursus Fabri”. He assured his\nworried father, who preferred him to study with the Scotists, that the\nbare text of the Fabrists, “without commentary” (nihil\ncomentarii), would profit him in examinations (Hartmann 1942:\n146; Renaudet 1953: 404–406). Among Lefèvre’s\nstudents, his manuals with their epitomes, paraphrases, and short\ndescriptive notes defined philosophical study at the Collège du\nCardinal Lemoine, and he began to be treated as an exemplar of\nmethod.\n\nAlthough Lefèvre’s introductions were intended to\nfacilitate direct access to Aristotle and other authorities, bypassing\nthe “schools”, they were themselves reproduced, studied,\nand commented on, becoming, in effect, an alternative to the\n“schools”. The most commonly reproduced version of\nLefèvre’s Paraphases philosophiae naturalis\nincluded, for example, Josse Clichtove’s extensive commentary;\nLefèvre’s introductions to logical and mathematical works\nwere likewise accompanied by similar super-commentaries. The circle of\n“Fabrists” might be seen, in this sense, as an unwitting\nhumanist via on the Renaissance philosophical roadmap.\n4. Philosophical Themes\n\nLefèvre’s place on the map of late medieval and\nRenaissance philosophy is difficult to pinpoint in a single key\ndoctrine or even a single work. He never composed his own synthetic or\nsystematic overview of philosophy. Nor did he write large commentaries\non select, individual questions, as did major university philosophers\nof the preceding centuries such as Jean Buridan or Paul of Venice. The\nfollowing themes thus represent more the state of current research\nthan a synoptic perspective on all Lefèvre’s\nphilosophical positions.\n4.1 Logic\n\nIn logic or dialectic, Lefèvre belongs to a tradition going\nfrom Lorenzo Valla, Rudolph Agricola, and Juan Luis Vives to Peter\nRamus—in 1508 Lefèvre also published the\nDialectica of the Byzantine émigré\nhumanist George of Trebizond. These figures sought to diminish the\nhold of scholastic logic on philosophy and replace it with a clearer,\nsimpler logic that would respect the ordinary meanings of words and\nhow they point to things in the world. The standard logical curriculum\nwas roughly organized around two phases in the reception of\nAristotle’s works. First, the “old logic”\n(logica vetus) comprised several works inherited from late\nantiquity, primarily Boethius’s translations of and commentaries\non Aristotle’s Categories and On\nInterpretation, as well as Porphyry’s Isagoge (for\na complete list of available works, see Ebbesen 1977: 105). From the\ntwelfth century on, a second group of works were either newly read\nafter long neglect, such as Aristotle’s Prior\nAnalytics, Topics, and Sophistic Refutations,\nor were newly translated from Arabic sources, most importantly\nAristotle’s Prior Analytics (Marrone 2010: 66; Ashworth\n2010: 161). Together this second group made up the “new\nlogic” (logica nova), which in turn became the source\nof handbooks or textbooks known by the late fifteenth century as the\n“logic of the moderns” (logica modernorum; see de\nRijk 1962–67). In fact, late medieval university students\nencountered these subjects through the textbook tradition, usually\nPeter of Spain’s Summule logicales (Little\nLogicals). The first part of the Summule dealt with the\n“old logic” of the Categories, on universals and\nAristotelian categories. But humanist philosophers like Lefèvre\nreacted especially against the logica modernorum:\nLefèvre’s short Logical Introductions to\nSuppositions, Predicabilia, Divisions, Predicaments, Enunciations,\n… Fallacies, Obligations, and Insolubilia (1496b) was\nmeant to give students a brief alternative to the Summule,\ninstead of making it the focus of study.\n\nIn 1503, Lefèvre published an edition, with introductions,\nparaphrases, and commentary, of Aristotle’s logical works.\nRather than, as Valla had done, reconstructing the “old\nlogic” of Aristotle, Porphyry, and Boethius and ignoring the\n“logic of the moderns” (logica modernorum) with\nits categoremata, sophismata, and\ninsolubilia, Lefèvre tried to clarify the sources of\nthe “old logic” (Vasoli 1968). He called logic a\ndisciplina disserendi (1503a: 2r, 228v), similar to\nAgricola’s earlier redefinition of dialectic as the ars\ndisserendi, later taken up by Ramus (though Lefèvre\nprobably did not read Agricola’s book, first published in 1515;\nsee Agricola 1515, as cited by Mack 1993: 346). Like Agricola before\nhim and Ramus later on, Lefèvre divided logic into three parts:\nproloquia, judgement, and invention. The first part, using\nthe works of the logica vetus, classifies things in the world\naccording to substances and their various qualities by considering how\npropositions (proloquia) are formed. The second and third\nparts belong to the logica nova: in the area of judgement,\nthe Prior Analytics teach how to organize statements into a\nvalid argument; in the area of invention, the Topics and the\nSophistic Refutations teach how to find the subject matter to\nform an argument. Lefèvre’s terminology of\nproloquia, judgement, and invention (Lefèvre 1503a:\n228v), though traditional, says much: Agricola had used it, and Ramus\nwould also take it up. Where Agricola had focused on invention, Ramus\nwould emphasize judgement. In contrast, Lefèvre thought the\nfirst part of logic—categorizing the world according to the\nlanguage of substance, quality, and the other proloquia of\nPorphyry’s Isagoge and Aristotle’s\nCategories—needed the most attention, if we judge by\nwhere he most carefully and thoroughly introduced his sources. For\nexample, instead of offering a complete paraphrase of the\nTopics, as he did for the Categories and the\nPrior and Posterior Analytics, Lefèvre\nsupplied only scholia “ad litteram” in a format\nwhich was unusually brief, even for him.\n\nIn logic, Lefèvre therefore bestowed his greatest energies on\nthe first pars proloquendi of logic. The notion of\nproloquium sometimes had, for him, its more basic sense of\n“introduction” (e.g., 1503a); but he also used the term in\nits more technical sense of an axiom or proper principle of\ndemonstration. In the Posterior Analytics I, Lefèvre\nglossed Aristotle’s account of principles for a demonstration as\ndealing with proloquia (1503a: 189v; see also 187r). He thus\nemphasized the logica vetus precisely because he hoped to\nground the certainty of knowledge in trustworthy starting points. In\ncontrast, he believed that the logica modernorum or more\nrhetorical portions of the Organon such as the\nTopics—the part most properly called\ndialectic—encouraged sophistic debate, i.e., developing\narguments out of uncertain premises. Aristotle considered dialectic to\nbe merely “probable” in its reasoning; as Lefèvre\nput it, rather than finding certain knowledge (scientia),\nwhich deploys syllogisms and enthymemes, topical dialectic is useful\nfor directing “opinions” by means of less certain\ntechniques as well, such as induction and example (Libri\nlogicorum, 1503a: 229v). Aristotle had said the subject of the\nTopics was “exercises, colloquies, and the disciplines\naccording to philosophy”. For Lefèvre, this meant the\nTopics were more appropriate for entertainment: \n\n\nexercises: we ought to understand these to be school\ncontests, done as a literary game; colloquies, as happens\nduring our conversations, dining together, and when we engage one\nanother in this way, discoursing for the purpose of recreation or\nusefulness; disciplines according to philosophy: these are\nthe sciences which make up the various parts of [Aristotle’s]\nown philosophy. (Exercitationes, conflictus gymnasticos, qui in\nludo litterario fiunt, intelligere debemus. Colloquia: ut cum\nconfabulando aut convivando aut in huiusmodi congressionibus ocurrit\nquicque, aut recreationis, aut alicuius utilitatis gratia,\ndisserendum. Discipline secundum philosophiam: sunt scientie que\npartes sunt ipsius philosophie, 1503a: 229v)\n\n\nLefèvre, thus, did not emphasize the roots of logic in the\nrhetorical structure of ordinary discourse, as Agricola or Valla might\nhave done (Nauta 2009). Instead, he focused on the “starting\npoints”, principia, or proloquia which ground\nreasoning. The importance he assigns to proloquia seems to be\nconnected to his pedagogically sensitive introductions, intended to\nconvey clear, immediate learning of the foundational principles of any\ndiscipline or art. The utility of this method also appears to be\nrooted in metaphysical assumptions about universal harmony and\nanalogy. In his annotations on Hermes Trismegistus, Lefèvre\nstressed the harmonious structure of creation, reflected in the\nsymmetry between macrocosm and microcosm (Lefèvre 1505b). As\ndiscussed above, such a harmonious structure justified making\ninferences from one domain to another. \n4.2 The Question of Universals\n\nSince the nineteenth century, Lefèvre has often been thought of\nas a nominalist of some sort. The evidence is of two kinds. Because he\nwrote a short introduction to the topics found in Peter of\nSpain’s Summule logicales, Prantl (1870:\n4:278–280) implied that he had sympathies with the genre, which\nVasoli (1959: 233) expanded into “traces of a nominalist\nformation”. Vasoli also quoted Renaudet, who had cited the\nstudent notes of Beatus Rhenanus, which recorded\nLefèvre’s view that the nominalist position on universals\nwas “vera et pulchra” (Vasoli 1959: 226; Renaudet\n1953: 131). Yet Lefèvre’s actual position is much more\nambiguous. One indication is his short Introductiones to\nlogic, intended to help students bypass “new”\nterminist approaches to the discipline. Moreover, although he\nappreciated certain nominalist positions, this hardly shows that he\nbelieved universals to be simply a matter of convention. Instead, he\nsought a via media, as he so often did. For example, in his\nnotes on Porphyry’s Isagoge, Lefèvre observed\nthat there are two extreme errors when speaking about\nAristotle’s category of substance:\n\n\nsome consider things by themselves, completely ignoring notions and\nreasons; others only care for notions and reasons, and entirely flee\nfrom things themselves and considerations of things. Neither the\nformer nor the latter can ever genuinely understand Aristotle and\nother authors. (Quidam enim res solas considerantes, notiones\nrationesque prorsus abnuunt; alii solas notiones rationesque curantes,\nres ipsas rerumque considerationes penitus refugiunt. Et neque hi\nneque illi poterunt unquam sincere Aristotelem ceterosque auctores\nintelligere, 1503a: 22r–v)\n\n\nInstead, those who “penetrate analogies” realize that\ndisciplines deal with different subjects: logicians address words and\nnames, as if looking at things through a mirror; natural philosophers\naddress things themselves.\n\nBy pursuing a via media on the problem of universals,\nLefèvre followed Boethius, the first of the Latins to set the\nterms of the medieval debates on the topic—as Lefèvre put\nit,\n\n\nthe whole Latin school owes as much to Boethius as rhetoric owes to\nCicero. (cui [Boetii] latine philosophie schola tantum debet\nquantum Tullius rhetorice, 1503a: 6v)\n\n\nThis tradition began with the prooemium to Porphyry’s\nIsagoge, in which he explicitly refused to discuss whether\ngenus and species depend on thought alone, are incorporeal or\ninseparable, as a realist interpretation of universals would have\nit—that discussion should be left, he said, to a “greater\nwork”. The medieval tradition followed Boethius in reading the\nIsagoge as an introduction to Aristotle’s\nCategories, and took Porphyry’s skirting of the\nontological status of genera and species as an invitation to explore\nuniversals. Boethius himself adopted a moderate realist position on\nuniversals in his second commentary on the Isagoge. There he\nargued that the mind abstracts universals from concrete reality:\nabstraction involves gathering or collecting the likeness\n(similitudo) of concrete, individual things. Boethius claimed\nthat, understood in this way, universals have a certain kind of\nseparate, incorporeal reality:\n\n\ngenus and species subsist in one way, they are grasped by the\nintellect in another way, and they are incorporeal, but they are\njoined to sensible things and subsist in sensible things. But they are\ngrasped by the intellect as subsisting in themselves and not having\ntheir being in anything else. (quotation from Marenbon 2003: 30; see\nalso Nauta 2009: 38).\n\n\nLefèvre was sensitive to the divergence between Porphyry and\nBoethius. He highlighted Porphyry’s approach to universals in\nthe Isagoge, namely\n\n\nthese questions about Platonic genera and species, about the matter of\nideas….\n\n\nBut Lefèvre followed Porphyry in turning such questions out of\nlogic, for\n\n\nas you see Porphyry teach, the place for dealing with these should be\nsought elsewhere, namely metaphysics. (Et he questiones de\ngeneribus et speciebus platonicis, que ad materiam idearum pertinent\n…. Sed discutiendi locus (ut scite Porphyrius ammonet) alio ex\nloco metaphysica scilicet est expectandus, 1503a: 2r)\n\n\nA few pages later he described how Boethius differed from Porphyry on\nthis issue, saying that:\n\n\nIt is to be assumed that Boethius considered the notion and concept,\nwhereas Porphyry considered the thing and subject itself. (Igitur\nnotionem rationemque Boetius, rem autem ipsam et ipsum subiectum\nconsiderasse, ponendus esset Porphyrius, 1503a: 6v)\n\n\nThus, for Lefèvre, the moderate realist position regards\nuniversals as distinct concepts or notions (rationes or\nnotiones; similar terminology is discussed in de Libera 1996:\n48).\n\nBut is this “moderate realist” position\nLefèvre’s own? Resolutely emphasizing the\nauctores themselves, he rarely deploys his own authorial\nvoice to argue for a “Fabrist” position. In his notes on\nAristotle’s Categories, however, dealing with the key\ncategory of substance, Lefèvre presents a rare quasi-treatise,\na short dialogue on universals between two students of the ancient\nacademy of Chrysippus (entitled in the margin “Disceptatio\nde universali”, 1503a: 23v). In the course of an amiable\ndebate, the disputants use Aristotle’s distinction between\nprimary and secondary substance to consider the status of universals\nsuch as species or genus. One youth presents the view that universals\nare what particular classes of things share; the other youth argues\nthat universals are, in fact, what those who reason say they\nshare—universals, in other words, are decided by convention. The\nposition that stands, at the end of the dialogue, looks something like\nBoethius’s moderate realism. The youths agree that there is\nsomething conceptual that is “added” to the qualities of\nboth the thing and the word signifying that thing.\n\n\nFor when I give the name “man” and look at the thing\nitself, I do not properly name the thing itself, or the species, or\nthe universal, simply and without addition. Instead, I do so with an\naddition, namely of the universal, by reason. (Proinde cum hominem\nnomino et rem ipsam respicio, non proprie rem illam aut speciem aut\nuniversalem appello et simpliciter et sine addito, sed cum\naddito—scilicet universalem, ratione, 1503a: 23v)\n\n\nThis moderate realism resurfaces in Lefèvre’s account of\nAristotle’s category of quantity, to choose just one example. In\nthe Categories, Aristotle primarily recapitulated the\ncommonly held ancient distinction between discrete number and\ncontinuous magnitude. Lefèvre’s commentary, however,\nrecalls that Aristotle further divided number into two kinds: counting\nnumber (numerantia) and counted number (numerata).\nThe distinction was taken from Physics IV.10, 219b5–10;\nbut Lefèvre uses it in the context of Aristotle’s\nCategories to suggest that numbers have extramental existence\nas universals—not merely as a product of mental abstraction, as\nAristotle held. For Aristotle, when we experience\n“counted” numbers (two ice creams, two legs), we abstract\nfrom those experiences a “counting” number\n(“2”), which exists only abstractly. For Lefèvre,\nthis picture is not quite complete, because it does not take account\nof how people share the experience of counting—while they may\napply “counting numbers” to countable objects in the same\nway, there is a concept or “reason” (ratio)\nshared by different minds. So he offers a third category:\n\n\nHence, there are counting numbers, counted numbers, and numbers\n[themselves]. Counting numbers are minds applying numbers to things;\ncounted numbers are those things to which the mind properly and\nsuitably applies numbers; and numbers are those discrete concepts of\ncounting. (Unde sunt numerantia, sunt numerata, sunt numeri.\nNumerantia sunt anime numeros suos rebus applicantes. Numerata sunt ea\nquibus anima numeros apte accommodeque applicat. Numeri sunt discrete\nille rationes numerandi, 1503a: 27r).\n\n\nWith this third category of reasons or concepts (rationes) of\ncounting, similar to Boethius’s view of universals as real\nnotions, Lefèvre can suggest that number has extramental\nreality in some sense. He affirms this point a few lines later,\nrepeating the ancient view of number as multiples of the primordial\n“unity”. There is something shared between the unit\n“1” in the counting mind and the unit “1” of a\nsingle palm of counted length. This underlying shared unity indicates\nthat “true numbers [i.e., 2, 3, etc.] are gathered and composed\nfrom units” in a way that belongs not merely to the mind or to\nthe physical world (Unde fit ut non sola in mente sufficiat unitas\nad numerandum, perinde ac unus palmus ad dimetiendum id quod etiam\nmultorum fuerit palmorum, sed sunt veri numeri ex unitatibus\ncoacervati compositique, 1503a: 27r).\n\nLefèvre’s language of numbers as composed of units is\ncommonplace, but it serves a realist interpretation of\nAristotle’s category of discrete quantity. As discussed in the\nnext section, the category of quantity and the language of measuring\noccupied a central place in Lefèvre’s approach to\nAristotle’s natural philosophy.\n4.3 Natural Philosophy\n\nAs we have seen, in his first published paraphrases (1492),\nLefèvre reorganized natural philosophy under the influence of\nErmolao Barbaro’s translations of Themistius’s\nParaphrases of Aristotle. His own epitomes were of the\nPhysics, On the Heavens, the Parva\nnaturalia, and On the Soul. As with other disciplines,\nit is difficult to identify a cohesive, distinctive set of Fabrist\n“doctrines” in these works, because the explicit goal was\nto digest Aristotle himself faithfully, not to identify and counter\npotential rivals. Characteristically, his paraphrase of the\nPhysics begins with a diagram of the terms basic to\nAristotelian natural philosophy: the elements; the four causes;\nnature; the many kinds of motion; and problematic terms such as place,\nvacuum, the infinite, and time. The paraphrase itself proceeds to\nreorganize Aristotle’s doctrines into opinions, conclusions, and\narguments—and, very occasionally, questions and\ndoubts—which closely follow the contours of Aristotle’s\nown work.\n\nNevertheless, distinctive emphases do surface. In these paraphrases,\nLefèvre is most distinctive when framing natural philosophy\nwithin its goals rather than its constituent parts. This\nattention to the larger philosophical role of particular disciplines\nhas led some scholars to dismiss him as “safely wrapped in\nclouds of mysticism” (e.g., Guerlac 1979: 31). In fact, he is\ncareful about methodological distinctions. At the end of his account\nof Book 1 of the Physics, for example, he refuses to answer\nthe question whether all things are produced from one or many forms.\nLefèvre is clearly tempted by this topic to discuss the\nChristian creator, but he determinedly remains within the boundaries\nof natural reason:\n\n\nthis belongs to first philosophy; let it wait until the right time to\nstudy it. (primi philosophi est, et in illud tempus id querendum\ndifferatur, Lefèvre 1502a: 20v)\n\n\nThis methodological restriction is intended to keep students from\napplying limited tools (such as logic or natural philosophy)\nindiscriminately and thus confusing instead of clarifying knowledge.\nBut reflections on natural philosophy can offer traces of the divine,\nand philosophy is not doing its job if it does not draw students to\nreflect on these too.\n\nAn example of the higher goals of natural philosophy are found in\nLefèvre’s Dialogue on the Introduction to the\nPhysics (Dialogus Physice introductionis), which is\nintended to present basic terms and convince students of the value of\nthis discipline. A discussion of the physical elements leads him to\nconsider at length the chain of nature—and the teacher in the\ndialogue, at the student’s request, self-consciously\n“digresses” on the chain of being in order to suggest that\nthe highest activity of humanity, the highest part of nature itself,\nis to contemplate “heavenly realities”. Then the\ndiscussion of final causes leads Lefèvre to sum up the point of\nthe exercise:\n\n\nThis, my son, is the end of philosophy; this is the whole endeavor of\nAristotle and the philosophers: to prepare us, from the correct notion\nof sensible things (as from rather distant likenesses of external\nthings), to enter the intelligible world, and hence, insofar as they\ncan lead us, to know our blessed place. (Hic fili nostre\nPhilosophie finis; hic totus Aristotelis et Philosophorum conatus: ex\nrecta rerum sensibilium cognitione (ut ex eternorum quibusdam\nremotissimis simulacris) mundi intelligibilis nobis parare introitum,\net hinc nos utcumque possunt ducere, nostrum scilicet felicem regionem\ncognoscere, Lefèvre 1502a: 124r [wrongly foliated\n123])\n\n\nBut to attain this happy goal, the student of philosophy first must\nwade through the details of natural philosophy.\n\nLefèvre’s natural philosophy is also distinctive for its\nattention to mathematical examples. In his Dialogues on\nPhysics he displayed far more autonomy from Aristotle than he did\nin shorter introductions and paraphrases; and in the Introductory\nDialogue on Difficult Physics (Dialogus difficilium\nphysicalium introductorius) he began squarely with the problem of\nquantity. While never departing dramatically from the Aristotelian\ndiscussion of matter, weight, rarefaction and condensation, and the\nintension and remission of qualities, at each step, Lefèvre\noffers points, lines, and ratios as examples. An interlocutor marvels\nthat he has learned to “philosophize about qualities through\nquantities” (per quantitatem de qualitate philosophor,\nLefèvre 1502a: 146v).\n\nTake, for example, Lefèvre’s discussion of the intension\nand remission of qualities in his Introductory Dialogue on\nDifficult Physics. This question is interesting because, despite\nAristotle’s meager account (Physics V.22.26b1–8),\nit became a foundational question in medieval natural philosophy.\nMoreover, by the fourteenth century, the calculatores of\nOxford and Parisian natural philosophers such as Nicole Oresme used\nmathematics to clarify their thinking on the topic. The notion of\nremission and intension is meant to explain how qualities change\ngradually, as we experience them to do. In order to resolve the\nproblem, it was necessary to ask several questions. Are such qualities\nforms? Can different qualities or forms mix together in the same\nsubject? Does change involve a series of new forms (the succession\ntheory), or instead is it a changing mixture of qualities, so that a\ngray object is a mix of white and dark contraries (admixture theory)?\nOr do qualities gradually change as infinitesimal parts are gained or\nlost (addition theory)? (For the range of positions, see Kirschner\n2000 and Di Liscia 2010.) In the Difficult Physics,\nLefèvre’s view seems to be that qualities are\nnot forms, since he never calls them anything other than\nqualities (a view similar to that of Buridan and Oresme; see Kirschner\n2000). Moreover, he seems to adopt a version of an addition theory: a\nquality is intensified by adding another part or degree of that\nquality. Finally, he argues that contraries can be in the same subject\nonly in a limited way—a certain amount of one quality would\ndrive out (expellere) an excess of the other. Given a scale\nof heat from minimum to maximum, say from 1 to 10, one could also\nimagine a similar scale for cold from 10 to 1. Maximal cold could not\ncoincide with maximal heat; but a low heat of 1 would coincide with a\nstrong cold of 9. Increasing the heat to 4 would expel the cold,\nreducing it to 6.\n\nIn this example, Lefèvre repeatedly claims that he applies\nquantitative reasoning to qualities:\n\n\nTherefore, you see how to philosophize about dimensions is to\nphilosophize about qualities. So also vice versa: to philosophize\nabout qualities is to philosophize about dimensions. (Vides ergo\nquomodo philosophari de dimensionibus est de qualitatibus\nphilosophari. Et retro agitur: de qualitatibus philosophari, est\nphilosophari de dimensionibus, 1502a: 145r)\n\n\nIt is not easy, however, to see what exactly “quantities”\nmean in this context. Some clarification can be gained from his\nargument for why quantities in a subject are limited by their\ncontrary, which he illustrates with a quasi-geometrical figure\nrepresenting the twin scales of hot and cold mentioned above. He\nimagines a range of heats in an object, from minimum to maximum heat,\narranged along a line (a…k in the figure below).\nThen, he uses a reductio ad absurdum: if the smallest amount\nof coldness (l) from some other object\n(l…u in the figure below) were to be added to the\nmaximum heat (k), a new degree of heat (x) would have to\nbe added in the original object to create a new maximum.\n\n\na-b-c-d-e-g-f-h-i-k-x\n\nl-m-n-o-p-q-r-s-t-u\n\n\nBut (x) is impossible. The new maximum (x) would be\ngreater than the previous maximum (k), which is absurd—a\nmaximum cannot be increased. Therefore, he concludes, the amount of\ncontraries is limited by the absolute maximum degrees of the quality\nmeasured. Qualities and their contraries, consequently, cannot be\nintensified in the same object beyond this maximum limit. There are\nundeniable quantitative features to this argument, comparable to the\ngeometrical intuitions that animated fourteenth-century theorists such\nas Oresme. At the same time, the qualities of heat and cold are not\nreimagined as mathematical objects and are still firmly in the realm\nof Aristotelian natural philosophy. Indeed, the point of the example\nis to defend rather than undermine Aristotle’s account of\ncontraries (found, inter alia, in Topics 2). Like\nhis predecessors, then, instead of making natural philosophy\nmathematical, Lefèvre used mathematics to clarify and exemplify\nAristotelian physical concepts. (On this example see further\nOosterhoff 2018: 190–199.)\n\nLefèvre’s mathematical examples in natural philosophy are\nall the more remarkable because he elsewhere disparaged the\ncalculatores who followed in the tradition of Thomas\nBradwardine (Lefèvre 1510: 2r; Rice 1972: 227). Clearly, he did\nnot oppose the mathematical nature of the so-called Merton\nschool’s natural philosophy, but rather certain aspects of their\nexposition. Lefèvre mistrusted the genre for which the\ncalculatores were famous, the sophismata; he saw\nthem as mere logical puzzles, sophistry rather than truth-telling\nexamples—a prejudice perhaps inherited from Ermolao Barbaro\n(Dionisotti 1955). This suggests that Lefèvre thought his own\nuse of mathematical reasoning in natural philosophy was\ndifferent—that it was not sophistry, but truly depicted nature.\nWhat then were the sources of Lefèvre’s mathematical\napproach to natural philosophy, if not among the fourteenth-century\ncalculatores? One possibility is the school of Albertists,\nwho became especially powerful in fifteenth-century Paris, partly in\nopposition to the nominalists and calculatores whom they\nbelieved had profaned the university (Kaluza 1988). The Albertist\ntextbook tradition of natural philosophy placed a high value on\nmathematics for understanding the physical world (Hoenen 1993:\n328–330).\n\nMore compelling similarities between Lefèvre and the Albertists\ncan be found in their psychology. After all, both Albertists and\nLefèvre expressly valued mathematics because they thought it\nprovided training in rational abstraction. As Lefèvre put it in\nhis Introductory Dialogue on Difficult Physics, the soul is\nunique as the medium between “higher and lower” things\nbecause it can rationally measure (dimetiri) the bodily world\nin abstract terms (1502a: 128v). Albertists valued mathematical\nobjects as examples of the separate substances the mind can\nthink—without depending on physical images or phantasms. The\nstandard Aristotelian picture of intellection began with the senses,\nwhich provide phantasms, taken up by the intellect as singular,\nconcrete species (intellectual species). Commentators\ncommonly distinguished a second movement of the soul which reflects on\nthis first activity. In this second moment, the soul produces abstract\nand universal notions. But the question then arises: can the intellect\nthink about separable objects without depending on sensible phantasms?\nAlbertists believed that it could, inspired by the Neoplatonic\nperspective of Pseudo-Dionysius the Areopagite, Averroes, and the\nfifth-century paraphrast Themistius. They subscribed to the doctrine\nthat the soul can know separate substances without the mediation of\nphysical images, a position which they defended against the more\nstandard view that this was not possible, found in early\nfifteenth-century polemical works such as Heymeric de Campo’s\n“Problems between Albert the Great and Saint Thomas”\n(Problemata inter Albertum Magnum et Sanctum Thomam, Cologne,\n1496: 37r–46r) and in basic handbooks on natural philosophy\n(Hoenen 1993: 332–333; see also Park 1980). Lefèvre does\nnot explicitly place his account of On the Soul within this\nAlbertist tradition, but he certainly makes room for it. Describing\nthe objects of the intellect, he notes that\n\n\nseparable objects are considered in the same way that they exist. For\nif they exist entirely separate from matter, then matter is entirely\nirrelevant in considering them. (Unde fit ut quomodo res\nseparabiles sint, eo modo eas contempletur. Si enim omnino abiuncte\nsint, omnino materiam a sua contemplatione reiicit, 1502a: 341v;\nsee also Spruit 1995: 38–41\n\n\nIn his commentary on this passage, Josse Clichtove explained that\nthere are four such modes of intellection, the fourth of which\nunderstands\n\n\nabstractly and universally … and here the intellect takes\nnothing from the senses. (Quartus est modus intelligendi abstracte\net universaliter … et hunc intellectus a sensu minime\naccipit, 1502a: 343v)\n\n\nHe further explained how mathematical objects offer a paradigm case of\nsuch separable intelligible objects.\n\nAffinities with Neoplatonic perspectives raise the question of whether\nLefèvre was influenced by the new Latin versions of Greek\ncommentators, especially Themistius, whose paraphrases of Aristotle\nwere translated by Barbaro. He was certainly aware of these new texts,\nbut he did not invoke their authority to take sides in debates. Some\nhave seen Themistius as a Neoplatonic source of light imagery in\nexplaining the relation between the active and passive intellect,\nbased on Aristotle’s tantalizingly short comments at On the\nSoul III.5 (Mahoney 1982). Lefèvre did argue for the unity\nof the intellect, explaining the active and passive intellects as\n“powers” (potentie) of the same faculty. He also\nused the Themistian image of light to explain how the agent intellect\nacts on the passive intellect (1502a: 344v). But he never mentions\nThemistius on this topic—and similarities may be due to the\nbroader medieval commentary tradition, which had had access to\nThemistius’s paraphrase of On the Soul in William of\nMoerbeke’s translation since the thirteenth century. And\nLefèvre’s psychology puts him in a tradition, with Ramon\nLull and Nicholas of Cusa, that was hospitable to Platonic views on\nuniversals—such thinkers adopted a psychology especially open to\nmathematical metaphors as examples of universal cognition.\nNevertheless, Lefèvre never identified as a platonist\n(Oosterhoff 2019b).\n4.4 Moral Philosophy\n\nIt was only on Aristotle’s moral philosophy treatises—the\nEthics, Economics and Politics—that\nLefèvre wrote full-scale commentaries. In addition to his brief\nArs Moralis, an introduction to Aristotle’s ethics\n(1494b), he devoted considerable energy to making available the recent\ntranslations of Aristotle’s Nicomachean Ethics by the\nByzantine émigré Johannes Argyropolus and the\nFlorentine humanist Leonardo Bruni, as well as the “old”\ntranslation, now known to be by Robert Grosseteste (1497). Beginning a\ntradition of editing philosophical works which would span the\nsixteenth century, Lefèvre typically encouraged readers to\ncompare texts, publishing the three translations of the\nEthics together in one volume (his own commentary accompanied\nthe translation of Argyropolus). These editions and commentaries have\nbeen seen as the origin of a distinctively humanist tradition of moral\nphilosophy (Kraye 1995: 104–105).\n\nLefèvre’s engagement with ethics was not limited to the\nrecovery of Aristotle. Like many other Renaissance philosophers, he\nbegan his treatment of the discipline with an anthropology of man as\nmicrocosm, a “little world” who mirrors or encompasses the\nfeatures of the “greater world” or macrocosm. This theme\nresurfaced in his paraphrase of the Physics and especially in\nhis notae on Hermes Trismegistus. Ethical behavior should be\nin intellectual harmony with God and the universe, which should be\nmirrored in human intellectual communities—perhaps\nLefèvre should be seen as promoting a monastic, rather than\ncivic, humanism (Stegmann 1973).\n\nHis early synoptic introduction to ethics (1494b) closely follows the\nmajor divisions of Aristotle’s treatise. Lefèvre begins\nwith a description of the ethical life as one which has to be learned:\nvirtues are acquired through long habituation rather than being innate\nto the human soul. Humanity possesses many kinds of good: exterior\n(acquired), interior (given by nature), and useful goods (those\ninstrumental for pursuing other goods). Virtue is defined as\n\n\nthe habitus of the soul perfecting itself and directing its work to\nthe good. Duty is the action of virtue (Virtus est anime habitus\nipsam perficiens atque eius opus bonum reddens. Officium est virtutis\noperatio, 1507: 3v)\n\n\nThe remainder of the introduction discusses each of the moral virtues\npertaining to the active life (such as liberality and friendship),\nfollowed by the intellectual virtues and then heroic virtue. These in\nturn lead to the final topic of contemplative happiness, where\nLefèvre presents his conviction that human fulfillment or\nhappiness is most fully achieved in contemplation of divine\nmatters—a point of agreement, he believed, between Aristotle and\nChristianity.\n\nLefèvre therefore went beyond a mere ad fontes search\nfor the “pure Aristotle”. As with other disciplines, his\nmoral philosophy presented Aristotle as the authority because he was\nmost useful to Christians. His notae to the Ethics\nare filled with exempla carefully selected from the Roman\npoets, especially Horace, Virgil, and Ovid. The virtues of the\ngentiles regularly presage Christian morality, according to\nLefèvre. So, for instance, the Pythagorean and Roman ideals of\nchaste virginity are helpful for urging temperance. To illustrate the\nexcellence of ancient morals, Lefèvre quoted Ovid’s\nMetamorphoses 15.367–36, where the waters of the river\nClitorius caused men to flee from wine. Ovid evoked this image in his\ndiscussion of the Pythagorean way of life, leading Lefèvre to\nreflect on Dama, the virgin daughter of Pythagoras, as well as the\nchaste self-sacrifice of Lucretia and the heroic Spartan virgins who\nkilled themselves after being raped. Observing that the value of\nvirginity is “not foreign” to Christians, who know the\nVirgin birth, Lefèvre went on to contrast this with the image\nof intemperance and false virginity of the harpies in Virgil,\nAeneid 3.214–218 (see notae on NE\nIII.10, in 1497: d7v). At times Lefèvre even uses such\nnotae to reframe Aristotle entirely. He reorients the\ndiscussion in the last book of the Ethics, where Aristotle\nbegins with the question of whether pleasure is the supreme ethical\ngoal, by recalling the New Testament image of Jesus Christ rebuking\nthe scribes and Pharisees for their hypocrisy. Living a good or\n“true life”, Lefèvre asserts, is primarily about\nuniting word and deed, for\n\n\nthe simplicity of the wise is more useful for life than eloquence.\n(et simplicitatem sapientum eloquentia ad vitam esse\nefficaciorem, 1497: m7v).\n\n\nHaving reminded his reader of what true pleasure is, Lefèvre\nthen rehearses Aristotle’s argument. The strategy is typical of\nmany of his notes: he alerts the reader to the Christian use or\ncontext of the passage, and then presents the author’s meaning.\nRather than bowdlerizing, he generally prefers to frame pagan wisdom\nwith a Christian structure.\n\nLefèvre most aggressively retooled ancient philosophy for\ncontemporary concerns, however, when dealing with Plato’s\nethical philosophy. Again, he proceeded as an editor. Alongside\nAristotle’s Politics and Economics,\nLefèvre presented one of his most enigmatic works, the\nHecatonomiae (1506). In seven hundred lines, loosely taken\nfrom Marsilio Ficino’s translations of Plato’s\nLaws (600 lines) and Republic (100 lines), he\nreconstructed something like a Platonic dialogue to complement\nAristotle’s works. His purpose seems to have been primarily\npedagogical: to present a Plato safe for student consumption, complete\nwith occasional marginal admonitions to “beware”\n(caute) and a list of Platonic opinions which should be\nrejected (such as possessing women and children in common). The work\nrepresented those parts of Plato which Aristotle had frequently\ndiscussed in his own moral philosophy and therefore had evidently\nfound useful, as Lefèvre explained in his prefatory letter\n(Rice 1972: 156; cf. Boisset 1973). It was, without apology,\n“Aristotle’s Plato”.\n4.5 Metaphysics\n\nThroughout his commentaries and epitomes, Lefèvre often briefly\nobserves that the findings of a particular discipline have\nmetaphysical implications, but then leaves this line of thought aside,\ntypically saying “enough about this, at this point”\n(de hac adhuc satis est). These implications are meant to be\ntreated in metaphysics or theology. (Like many Christian philosophers\nafter Boethius, Lefèvre often identifies theology and\nmetaphysics; Oosterhoff 2019a.) In this sense, then, Lefèvre\nbelongs to a natural theological tradition which sees the\nphilosophical arts as studying the traces of the divine in the natural\nworld, and then as steps leading upward to divine matters, as he put\nit in his side-by-side edition of the medieval and humanist\ntranslations of Euclid’s geometry (1517a: a2r).\n\nSuch a reconstructive project could especially be open to creative,\nsynthetic impulses. Rice (1970) brilliantly captured\nLefèvre’s project by suggesting that what Ficino had done\nfor Plato, Lefèvre intended to do for Aristotle. Drawing on a\nlong-standing medieval topos that Plato was the closest of ancient\nphilosophers to Christian truth, Ficino had interpreted him as broadly\nin line with Christian teaching, all the while drawing on the natural\nphilosophy, medicine, and mathematics of his day to present him as a\nhealer of souls (Celenza 2007: 86). Early in his work on Aristotle,\nLefèvre similarly presented Aristotle as all things in all\ndisciplines, even theology:\n\n\nin his logical works he was most subtle and rational, in the\nPhysics a worldly philosopher, in the Ethics\nentirely prudent and active, in the Politics a lawyer, and in\nthe Metaphysics a priest and theologian. (Fuit namque in\nlogicis rationalis subtilissimus, in physicis mundanus philosophus, in\nethicis totus prudens et activus, in polyticis iurisconsultus, in\nmetaphysicis sacerdos atque theologus, Letter to Germain de\nGanay, In Aristotelis Ethica Nicomachea introductio, 1494b:\na2r; Rice 1970: 138)\n\n\nLefèvre’s Aristotle, like Ficino’s Plato, knew\nsomething of the Christian God. In his introduction to the\nMetaphysics (1494a: d1v), he suggested that Aristotle had\nprayed to the ens entium, begging for mercy. This emphasis on\nthe coherence of Aristotle’s works throughout the arts cycle and\nhis agreement with Christianity sustained the scholarship of\nLefèvre and his students for decades.\n\nIt also meant that Lefèvre could find in Aristotle the basis\nfor the concord of all knowledge. He thus held together two\npotentially divergent approaches: his editorial efforts to\n“purify” Aristotle accompanied his efforts to find a pious\nmetaphysical framework for philosophy, including elements that clearly\nbelonged to Neoplatonic traditions. At first, Lefèvre’s\nencyclopedic projects extended to the Neoplatonic texts revived by\nFicino and Bessarion, among others. In 1494, as mentioned above, he\npublished Ficino’s important translation of the writings\nattributed to Hermes Trismegistus, along with his own short\nargumenta. Around the same time, he published De magia\nnaturali, which drew on Ficino’s medical cosmology in the\nThree Books on Life, as well as Giovanni Pico della\nMirandola’s cabbalistic interests. But by 1505 his optimism\nabout the fruitfulness of this esoteric approach had lessened. As\nPantin (1988) has shown, Lefèvre’s 1505 edition of the\nHermetic corpus includes, among its additions, more cautions against\nunorthodox readings than the previous edition, just as he would do the\nnext year when recompiling Plato’s Laws and\nRepublic in his Hecatonomiae.\n\nIn 1514 he produced a major edition of Nicholas of Cusa, arguably the\nmost original philosopher of the fifteenth century—and one\ncertainly influenced by Plato. But Lefèvre had his own take on\nthe history of Platonic philosophy, which allowed him to see Nicholas\nand the twelfth-century Victorines, among others, as representatives\nof a distinctively Christian form of philosophy (Oosterhoff\n2019a and 2019b). He defended a longstanding tradition, particularly\nstrong in France (where Dionysius the Areopagite was regarded not only\nas St Paul’s Athenian convert, but also as the original\nbishop-martyr who had brought Christianity to France). He explained\nthe similarities between Dionysius and late ancient Platonists such as\nIamblichus and Proclus as thefts on the part of the pagan\nphilosophers. To Lefèvre, Dionysius stood for a Pauline and\nfundamentally Christian form of insight, beyond both positive and\nnegative theology. Later Platonists had drawn on this tradition for\ntheir most profound teachings, while suppressing their source. In his\nedition of Dionsyius’s Divine Names, Lefèvre\nadduced Nicholas of Cusa’s “scientie divine\nignorantie” (“science of divine ignorance”) as\na faithful reading of Dionysius, suggesting that Dionysius was the\nsource of Nicholas’s recognition that both positive and negative\nstatements about God fall short, since finite words cannot capture an\ninfinite reality (1499: 58v–61r). Therefore, in\nLefèvre’s eyes, Nicholas of Cusa was a modern\nrepresentative of this authentic Christian philosophy (Meier-Oeser\n1989: 36–61).\n5. Legacy\n\nLefèvre’s editions of Neoplatonic works became important\nin their own right, long after his encyclopedic repristination of\nAristotle had been supplanted by handbooks like those of the Lutheran\nAristotelian Philip Melanchthon. His expanded edition of the Hermetic\ncorpus (1505b)—with the Crater Hermetis of\nLudovico Lazzarelli and another book in addition to the fourteen\ntreatises known to Ficino—became the most widely adopted text,\nreprinted all over Europe, along with his annotations. Similarly, his\nedition and commentary on Pseudo-Dionysius the Areopagite was read\nthroughout the sixteenth century, and his edition of Cusanus remained\nthe standard Opera omnia up to the twentieth century.\n\nAs discussed above, Lefèvre regularly mentioned\n“analogy” as a way to relate truths in different domains.\nWhile it seems that he never fleshed out the details of this method,\nhis obsession with providing trustworthy steps to a unified,\nmethodized, and above all pedagogically useful philosophy is perhaps\nhis most lasting legacy—one which would be taken up in debates\nover method and textbooks throughout the sixteenth century (Schmitt\n1988). The fascination of Lefèvre and his students with\nanalogies and mathematics offers a glimpse of the early motivations to\nfind a “universal method” that later bloomed in debates\nover universal arts (Rossi 2000: 29, 39; Ong 1958: 76). Timothy Reiss\nfirst identified Lefèvre and his circle with the early swell of\nphilosophical interest in the quadrivium in the sixteenth century\n(Reiss 1997). Oronce Fine in particular extended\nLefèvre’s mathematical legacy (Pantin 2009). By the early\nseventeenth century, some authors would put forward a method which was\nstrongly mathematical and which purported to unify not only arithmetic\nand geometry but all disciplines under a mathesis universalis\n(Rabouin 2009). Lefèvre could be said to have inaugurated the\ngenre of printed philosophical textbooks in which such positions\nemerged (Oosterhoff 2018).\n\nLefèvre’s students—with whom he had always worked\nclosely—took up his project and developed it in several\ndirections. They frequently published his works, especially in\nStrassburg and Cologne. In Paris, as Rice (1970) noted, several\nfigures associated with Lefèvre set up on philosophical\nprojects rooted in his teaching: most notably, Josse Clichtove and\nCharles de Bovelles. Clichtove, who wrote many commentaries on\nLefèvre’s editions, became an important figure in the\nParis faculty of theology. Bovelles deserves particular attention for\nhis concerted effort to develop a fresh philosophical synthesis, which\nshared with Lefèvre core themes such as the dignity of mankind\nas the mirror of nature, human freedom, the distinctiveness of our\nintellectual faculties, and the importance of mathematics in modeling\nphilosophical perspectives (Faye 1998). Lefèvre’s effort\nto provide students with handbooks in all fields of knowledge can be\ncompared to Ramus’s philosophical reforms.\n\nHis students and successive generations of scholars carried forward\nLefèvre’s conviction that a renewal of philosophy should\nbegin with new translations and philological work. Around 1516, his\nstudent Gerard Roussel retranslated Aristotle’s Nicomachean\nEthics from the Greek; he also wrote a long, philosophical\ncommentary on Boethius (1521), picking up the Pythagorean and\nmathematical interests which had also motivated Lefèvre’s\nreform of university philosophy. Another student, François\nVatables (later the first Royal Professor of Hebrew at the\nCollège Royal) similarly retranslated large parts of the\nAristotelian corpus. Though he did not study directly with\nLefèvre, Symphorien Champier fashioned his idiosyncratic\nintroduction to philosophy, the Janua (1498), by liberally\nexcerpting from his works. Later in the century,\nLefèvre’s sustained and wide-ranging effort to make\nAristotle eloquent was taken over by humanist translators of the\nphilosopher such as Denys Lambin, Adrien Turnèbe, and Joachim\nPérion. Lefèvre influenced the history of philosophy as\nmuch through the deep relationships he cultivated with his students as\nthrough his ambitious use of the new technology of the printing press\nto reinvent the university philosophy curriculum.\n", "bibliography": {"categories": ["<a id=\"SelWorLef\">Selected Works by Lefèvre</a>", "<a id=\"PriSouSecLit\">Primary Sources and Secondary Literature</a>"], "cat_ref_text": {"<a id=\"SelWorLef\">Selected Works by Lefèvre</a>": ["</h3>\n<p>\nLefèvre’s works were reprinted many times in the\nsixteenth century, but not afterward. Here only the first editions of\nkey works are listed, as well those which first included the\ncommentaries by Josse Clichtove. The most complete and reliable\nbibliography of Lefèvre’s works, including transcriptions\nof letters by him and his colleagues, remains Eugene F. Rice, ed.,\n<em>The Prefatory Epistles of Jacques Lefèvre\nd’Étaples and Related Texts</em> (New York: Columbia\nUniversity Press, 1972). </p>\n<ul class=\"hanging\">", "<em>De magia naturali</em>, Olomouc, M.I.119; Vatican City,\nBiblioteca Apostolica Vaticana, MS lat. reg. 1115; Paris,\nBibliothèque nationale de France, MS lat. 7454; Brussels,\nBibliothèque royale de Belgique, MS lat. 10875. (See\nLefèvre 2018, below.)", "1492, <em>Totius philosophiae naturalis paraphrases</em>, Paris:\nJ. Higman.", "1494a, <em>Introductio in metaphysicorum libros Aristotelis</em>,\nParis: J. Higman.", "1494b, <em>Ars moralis … Aristotelis philosophi moralia\nillustria claraque reddit [= In Aristotelis Ethica Nicomachea\nintroductio]</em>, Paris: [A. Caillaut].", "1494c (ed. and comm.), <em>Mercurii Trismegisti Liber de potestate\net sapientia dei, per Marsilium Ficinum traductus</em>, Paris: J.\nHigman for W. Hopyl.", "1495, (ed. and comm.), <em>Textus de Sphera Johannis de\nSacobosco</em>, Paris: J. Higman and W. Hopyl.", "1496a, (ed. and author), <em>Elementa Arithmetica; Elementa\nmusicalia; Epitome in Arithmetica Boetii; Richmimachie ludus</em>,\nParis: J. Higman and W. Hopyl.", "1496b, <em>Introductiones in suppositiones, in predicabilia, in\ndivisiones, in predicamenta, in librum de enunciatione, in primum\npriorum, in secundum priorum, in libros posteriorum, in locos\ndialecticos, in fallacias, in obligationes, in insolubilia</em>,\nParis: G. Marchant.", "1497 (ed.), <em>Decem librorum Moralium Aristotelis, tres\nconversiones</em> [= translations of the <em>Nicomachean Ethics</em>\nby Johannes Argyropolus, Leonardo Bruni, and Robert Grosseteste, with\nLefèvre’s commentary and introduction]. Paris: H.\nEstienne.", "1499 (ed. and comm.), Ps-Dionysius, <em>Theologia vivificans.\nCibus solidus</em>, Paris: J. Higman and W. Hopyl.", "1500 (ed. and comm.), <em>Textus de Sphera … Cum\ncompositione Anuli Astronomici Boni Latensis et Geometria Euclidis\nMegarensis</em>, Paris: W. Hopyl.", "1502a (with Clichtove’s commentary), <em>Totius philosophiae\nnaturalis paraphrases. Adiecto ad litteram familiari commentario</em>,\nParis: W. Hopyl.", "1502b, <em>Artificialis introductio per modum epitomatis in decem\nlibros Ethicorum Aristotelis adiectis elucidata commentariis</em> [=\n<em>Ars moralis</em> (1497) with commentary by Clichtove], Paris: W.\nHopyl and H. Estienne.", "1503a (ed. and comm.), <em>Libri logicorum ad archetypos recogniti\ncum novis ad litteram commentariis ad felices primum Parhisiorum et\ncommuniter aliorum studiorum successus in lucem prodeant ferantque\nlitteris opem</em>, Paris: W. Hopyl and H. Estienne.", "1503b (with Clichtove’s commentary and geometrical works by\nBovelles), <em>Epitome compendiosaque introductio in libros\nArithmeticos Boetii … Ars supputandi [Clichtovei]…\nEpitome rerum geometricarum … De quadratura circuli\ndemonstratio ex Campano. Liber de cubicatione sphere. Perspectiva\nintroductio. Astronomicon</em>, Paris: W. Hopyl and H. Estienne.", "1505a (ed.), <em>Primum volumen Contemplationum Remundi</em>\n[<em>Lulii</em>] <em>duos libros continens. Libellus Blaquerne de\namico et amato</em>, Paris: G. Marchant for J. Petit.", "1505b (ed. and comm.), <em>Pimander, Mercurii Trismegisti liber de\nsapientia et potestate dei; Asclepius; Mercurii de voluntate divina;\nCrater Hermetis</em>, Paris: H. Estienne.", "1506 (ed. and comm.), <em>Politicorum libri octo; commentarii;\nEconomicorum duo; commentarii; Hecatonomiarum septem. Economiarum\nunus. Explanationis Leonardi [Bruni] in oeconomica duo</em>, Paris: H.\nEstienne.", "1507 (with Clichtove’s commentary), <em>Artificialis\nintroductio per modum epitomatis in decem libros Ethicorum Aristotelis\nadiectis elucidata commentariis</em>, Paris: H. Estienne.", "1508 (ed.), <em>Georgii Trapezontii Dialectica</em>, Paris: Henri\nEstienne.", "1509 (ed. and comm.), <em>Quincuplex Psalterium</em>, Paris: H.\nEstienne.", "1510 (ed. and comm.), <em>De superdivina Trinitate theologicum\nopus hexade librorum distinctum</em>, Paris: H. Estienne.", "1512 (ed. and comm.), <em>Epistolae Pauli</em>, Paris: H.\nEstienne.", "1514 (ed.), <em>Haec accurata recognitio trium voluminum Operum\nClariss. P. Nicolai Cusae</em>, Paris: Badius Ascensius.", "1515 (ed.), <em>Aristotelis castigatissime recognitum opus\nmetaphysicum; metaphysica introductio quatuor dialogorum libris\nelucidata</em> [trans. Cardinal Bessarion and J. Argyropolus]. Paris:\nH. Estienne.", "1517a (ed.), <em>Euclidis Megarensis Geometricorum elementorum\nlibri XV</em>, Paris: H. Estienne.", "1517b (with Clichtove’s commentary), <em>Introductorium\nAstronomicum theorias corporum coelestium duobus libris complectens,\nadiecto commentario declaratum</em>, Paris: H. Estienne.", "[EE], <em>Épistres &amp; Évangiles pour les\ncinquante &amp; deux sepmaines de l’an: fac-simile de la\npremiere edition, Simon du Bois</em>, edited by M. A. Screech. Geneva:\nDroz, 1964.", "[JL], <em>Jacques Lefèvre d’Étaples et ses\ndisciples: Epistres et Evangiles pour les cinquante et deux dimenches\nde l’an</em>, edited by Pierre de Vingle, Guy Bedouelle, and\nFranco Giacone. Brill: Leiden, 1976.", "[HL], <em>Hecatonomiarum libri: texte latin des\nHécatonomies de Lefèvre d’Étaples, en\nparallèle avec la traduction latine de Platon par Marsile\nFicini</em>, edited by Jean Boisset and Robert Combès. Paris:\nVrin, 1979.", "[MN], <em>La Magie naturelle / De Magia naturali: I.\nL’Influence des astres</em>, edited and translated by Jean-Marc\nMandosio, Paris: Les Belles Lettres, 2018.\n</ul>\n<h3>"], "<a id=\"PriSouSecLit\">Primary Sources and Secondary Literature</a>": ["</h3>\n<ul class=\"hanging\">", "Ashworth, E. Jennifer, 2010, “Terminist Logic”, in\n<em>The Cambridge History of Medieval Philosophy</em>, edited by\nRobert Pasnau and Christina van Dyke, Cambridge: Cambridge University\nPress, 146–58.", "Axworthy, Angela, 2016, <em>Le Mathématicien renaissant et\nson savoir. Le statut des mathématiques selon Oronce Fine</em>,\nParis: Classiques Garnier.", "Bedouelle, Guy, 1976, <em>Lefèvre d’Étaples et\nl’intelligence des Écritures</em>, Geneva: Droz.", "Bianchi, Luca, 2007, “Continuity and Change in the\nAristotelian Tradition”, in <em>The Cambridge Companion to\nRenaissance Philosophy</em>, edited by James Hankins, Cambridge:\nCambridge University Press, 49–71.", "Boisset, J., 1973, “Les Hécatonomies de\nLefèvre d’Etaples”, in <em>L’Humanisme\nfrançais au début de la Renaissance</em>, edited by\nAndré Stegmann, Paris: Vrin, 287–302.", "Celenza, Christopher S., 2007, “The Revival of Platonic\nPhilosophy”, in <em>The Cambridge Companion to Renaissance\nPhilosophy</em>, edited by James Hankins, Cambridge: Cambridge\nUniversity Press, 72–96.", "––– (ed.), 2010, <em>Angelo Poliziano’s\nLamia: Text, Translation, and Introductory Studies</em>, Leiden:\nBrill.", "Copenhaver, Brian P., 1978, <em>Symphorien Champier and the\nReception of the Occultist Tradition in Renaissance France</em>, The\nHague/New York: Mouton Publishers.", "–––, 1977, “Lefèvre\nd’Étaples, Symphorien Champier, and the Secret Names of\nGod”, <em>Journal of the Warburg and Courtauld Institutes</em>,\n40: 189–211.", "de Libera, Alain, 1996, <em>La querelle des universaux. De Platon\nà la fin du Moyen Age</em>, Paris: Édition du\nSeuil.", "de Rijk, L. M., 1962–67, <em>Logica Modernorum: A\nContribution to the History of Early Terminist Logic</em>, Assen: Van\nGorcum.", "Di Liscia, Daniel, 2010, <em>Zwischen Geometrie und\nNaturphilosophie. Die Entwicklung der Formlatitudenlehre im deutschen\nSprachraum</em>, Munich: Universitätsbibliothek.", "Dionisotti, Carlo, 1955, “Ermolao Barbaro e la Fortuna di\nSuiseth”, in <em>Medioevo e Rinascimento: Studi in onore di\nBruno Nardi</em>, Florence: Sansoni, 1:219–53.", "Ebbesen, Steb, 1977, “Ancient Scholastic Logic as the Source\nof Medieval Scholastic Logic,” in <em>The Cambridge History of\nLater Medieval Philosophy</em>, edited by Norman Kretzmann et al.,\nCambridge: Cambridge University Press, 101–27.", "Emery, Kent, 1984, “Mysticism and the Coincidence of\nOpposites in Sixteenth- and Seventeenth-Century France”,\n<em>Journal for the History of Ideas</em>, 45: 3–23.", "Faye, Emmanuel, 1998, <em>Philosophie et perfection de\nl’homme: De la Renaissance à Descartes</em>, Paris:\nVrin.", "–––, 1998, “Nicolas de Cues et Charles de\nBovelles dans le manuscrit ‘Exigua pluvia’ de Beatus\nRhenanus”, <em>Archives d’histoire doctrinale et\nlittéraire du moyen âge</em>, 65: 415–50.", "Gandillac, Maurice de, 1973, “Lefèvre\nd’Étaples et Charles de Bovelles, Lecteurs de Nicolas de\nCues”, in <em>L’Humanisme Français au début\nde La Renaissance</em>, Paris: Vrin, 115–71.", "Gilbert, Neal W., 1960, <em>Renaissance Concepts of Method</em>,\nNew York: Columbia University Press.", "Guerlac, Rita (ed.), 1979, <em>Juan Luis Vives against the\nPseudodialecticians: A Humanist Attack on Medieval Logic: The Attack\non the Pseudialecticians and On Dialectic</em>, Dordrecht:\nSpringer.", "Hartmann, Alfred (ed.), 1942, <em>Die Amerbachkorrespondenz</em>,\nBasel: Universitätsbibliothek.", "Hoenen, Maarten J.F.M., 1993, “The Reparationes Librorum\nTotius Naturalis Philosophiae (Cologne 1494) as a Source for the Late\nMedieval Debates between Albertistae and Thomistae,”\n<em>Documenti E Studi Sulla Tradizione Filosofica Medievale</em>, 4:\n307–44.", "–––, 2003, “Via Antiqua and Via Moderna in\nthe Fifteenth Century: Doctrinal, Institutional, and Church Political\nFactors in the <em>Wegestreit</em>”, in <em>The Medieval\nHeritage in Early Modern Metaphysics and Modal Theory,\n1400–1700</em>, edited by Russell L. Friedman and Lauge O.\nNielsen, Dordrecht: Kluwer, 9–36.", "Hotson, Howard, 2007, <em>Commonplace Learning: Ramism and its\nGerman Ramifications</em>, Oxford: Oxford University Press.", "Hughes, Philip Edgcumbe, 1984, <em>Lefèvre: Pioneer of\nEcclesiastical Renewal in France</em>, Grand Rapids, MI:\nEerdmans.", "Kaluza, Zenon, 1988, <em>Les querelles doctrinales à Paris:\nNominalistes et realistes aux confins du XIVe et du XVe\nsiècles</em>, Bergamo: Lierluigi Lubrina.", "Kessler, Eckhard, 1999, “Introducing Aristotle to the\nSixteenth Century: The Lefèvre Enterprise”, in\n<em>Philosophy in the Sixteenth and Seventeenth Centuries:\nConversations with Aristotle</em>, edited by Constance Blackwell and\nSachiko Kusukawa, Aldershot: Ashgate, 1–21.", "Kieckhefer, Richard, 2007, “Jacques Lefèvre\nd’Étaples and the Conception of Natural Magic”, in\n<em>La magia nell’Europa moderna</em>, edited by Fabrizio Meroi.\nFlorence: Olschki, 63–78.", "Kirschner, Stefan, 2000, “Oresme on Intension and Remission\nof Qualities in His Commentary on Aristotle’s Physics”,\n<em>Vivarium</em>, 38(2): 255–74.", "Klinger-Dollé, Anne-Hélène, 2016, <em>Le\n</em>De sensu<em> de Charles de Bovelles (1511): conception\nphilosophique des sens et figuration de la pensée</em>, Geneva:\nDroz.", "Kraye, Jill, 1995, “Renaissance Commentaries on the\nNicomachean Ethics”, in <em>The Vocabulary of Teaching and\nResearch between Middle Ages and Renaissance</em>, edited by Olga\nWeijers, Turnhout: Brepols, 96–117.", "Lines, David A., 2007, “Lefèvre and French\nAristotelianism on the Eve of the Sixteenth Century”, in <em>Der\nAristotelismus in der Frühen Neuzeit: Kontinuität oder\nWiederangeignung?</em>, edited by Günter Frank and Andreas Speer,\nWiesbaden: Harrassowitz Verlag, 273–90.", "Llinares, A., 1973, “Le Lullisme de Lefèvre\nd’Etaples et de ses amis humanistes”, in\n<em>L’Humanisme français au début de la\nRenaissance</em>, edited by Jean-Claude Margolin, Paris: Vrin,\n126–37.", "Mack, Peter, 1993, <em>Renaissance Argument: Valla and Agricola in\nthe Traditions of Rhetoric and Dialectic</em>, Leiden: Brill.", "Mahoney, Edward P., 1982, “Neoplatonism, the Greek\nCommentators, and Renaissance Aristotelianism”, in\n<em>Neoplatonism and Christian Thought</em>, edited by Dominic J.\nO’Meara, Albany, N.Y.: State University of New York Press,\n169–84.", "Mandosio, Jean-Marc, 2013, “Le <em>De magia naturali</em> de\nJacques Lefèvre d’Étaples: Magie, alchimie et\ncabale”, in <em>Les muses secrètes kabbale, alchimie et\nlittérature à la Renaissance: actes de la journée en\nhommage à François Secret, Vérone, 18 octobre\n2005</em>, edited by R. Gorris, Geneva: Droz, 37–79.", "Marenbon, John, 2003, <em>Boethius</em>, New York: Oxford\nUniversity Press.", "Margolin, Jean-Claude, 1976, “L’enseignement des\nmathématiques en France (1540–70): Charles de Bovelles,\nFine, Peletier, Ramus”, in <em>French Renaissance Studies,\n1540–70: Humanism and the Encyclopedia</em>, edited by Peter\nSharratt, Edinburgh: Edinburgh University Press, 109–55.", "Marrone, Steven P., 2010, “The Rise of the\nUniversities”, in <em>The Cambridge History of Medieval\nPhilosophy</em>, edited by Robert Pasnau and Christina van Dyke,\nCambridge: Cambridge University Press, 2010, 50–62.", "Meier-Oeser, Stephan, 1989, <em>Die Präsenz des Vergessenen:\nZur Rezeption der Philosophie des Nicolaus Cusanus vom 15. bis zum 18.\nJahrhundert</em>, Münster: Aschendorff.", "Mönch, Walter, 1936, <em>Die italienische Platonrenaissance\nund ihre Bedeutung für Frankreichs Literatur- und\nGeistesgeschichte (1450–1550)</em>, Berlin: Matthiesen\nVerlag.", "Moyer, Ann E., 2012, “The Quadrivium and the Decline of\nBoethian Influence”, in <em>A Companion to Boethius in the\nMiddle Ages</em>, edited by Noel Harold Kaylor and Philip Edward\nPhillips, Leiden: Brill, 479–517.", "Moss, Ann, 2003, <em>Renaissance Truth and the Latin Language\nTurn</em>, Oxford: Oxford University Press.", "Nauta, Lodi, 2009, <em>In Defense of Common Sense: Lorenzo\nValla’s Humanist Critique of Scholastic Philosophy</em>,\nCambridge, MA: Harvard University Press.", "Ong, Walter J., 1958, <em>Ramus, Method, and the Decay of\nDialogue: From the Art of Discourse to the Art of Reason</em>,\nCambridge, MA: Harvard University Press.", "Oosterhoff, Richard J., 2013,“From Pious to Polite:\nPythagoras in the Res Publica Litterarum of French Renaissance\nMathematics”, <em>Journal of the History of Ideas</em>, 74:\n531–52.", "–––, 2014, “Idiotae, Mathematics, and\nArtisans: The Untutored Mind and the Discovery of Nature in the\nFabrist Circle”, <em>Intellectual History Review</em>,\n24:1–19.", "–––, 2018, <em>Making Mathematical Culture:\nUniversity and Print in the Circle of Lefèvre\nd’Étaples</em>, Oxford-Warburg Studies, Oxford: Oxford\nUniversity Press.", "–––, 2019a, “Cusanus and Boethian Theology\nin the Early French Reform”, in <em>Nicholas of Cusa and the\nMaking of the Early Modern World</em>, edited by Simon J.G. Burton,\nJoshua Hollmann, and Eric M. Parker, Leiden: Brill, 339–66.", "–––, 2019b, “Jacques Lefèvre\nd’Étaples and Charles de Bovelles on Platonism, Theurgy,\nand Intellectual Difficulty”, in <em>Plotinus’ Legacy: The\nTransformation of Platonism from the Renaissance to the Modern\nEra</em>, edited by Stephen H. Gersh, Cambridge: Cambridge University\nPress, 73–95.", "Pantin, Isabelle, 1988, “Les ‘commentaires’ de\nLefèvre d’Etaples au Corpus Hermeticum”, in\n<em>Présence d’Hermès Trismégiste</em>,\nedited by Antoine Faivre, Paris: Éditions Albin Michel,\n167–83.", "–––, 2009, “Oronce Fine’s Role as\nRoyal Lecturer”, in <em>The Worlds of Oronce Fine. Mathematics,\nInstruments and Print in Renaissance France</em>, edited by Alexander\nMarr, Donington: Shaun Tyas, 2009, 13–30.", "Park, Katharine, 1980, “Albert’s Influence on Late\nMedieval Psychology”, in <em>Albertus Magnus and the Natural\nSciences</em>, edited by James A. Weisheipl, Toronto: Pontifical\nInstitute of Mediaeval Studies, 501–35.", "Pernot, Jean-Francois (ed.), 1995, <em>Jacques Lefèvre\nd’Etaples: (1450?–1536)</em>, Actes du Colloque\nd’Étaples les 7 et 8 novembre 1992, Paris: Champion.", "Porrer, Sheila M., 2009, <em>Jacques Lefèvre\nd’Etaples and the Three Maries Debates</em>, Geneva: Droz.", "Prantl, Carl, 1870, <em>Geschichte der Logic im Abendlande</em>,\nIV, Leipzig.", "Rabouin, David, 2009, <em>Mathesis universalis:\nL’idée e «mathématique universelle»\nd’Aristote à Descartes</em>, Paris:\nÉpiméthée.", "Reid, Jonathan A., 2009, <em>King’s Sister—Queen of\nDissent: Marguerite of Navarre (1492–1549) and Her Evangelical\nNetwork</em>, 2 vols, Leiden: Brill.", "Reiss, Timothy J., 1997, <em>Knowledge, Discovery and Imagination\nin Early Modern Europe</em>, Cambridge: Cambridge University\nPress.", "Renaudet, Augustin, 1953, <em>Préréforme et\nhumanisme à Paris pendant les premières guerres\nd’Italie, 1494–1517</em>, 2nd ed., Paris: Champion.", "Rice, Eugene F., 1970, “Humanist Aristotelianism in France:\nJacques Lefèvre d’Étaples and His Circle”,\nin <em>Humanism in France</em>, edited by A. H. T. Levi, Manchester:\nManchester University Press, 132–49.", "––– (ed.), 1972, <em>The Prefatory Epistles of\nJacques Lefèvre d’Étaples and Related Texts</em>,\nNew York: Columbia University Press.", "Rossi, Paolo, 2000, <em>Logic and the Art of Memory: The Quest for\na Universal Language</em>, Stephen Clucas (trans.), 1983; London:\nContinuum.", "Shapiro, Herman, 1959, “Walter Burley and the Intension and\nRemission of Forms”, <em>Speculum</em>, 34: 413–27.", "Schmitt, Charles B., 1983, <em>Aristotle and the Renaissance</em>,\nCambridge, MA: Harvard University Press.", "–––, 1988, “The Rise of the Philosophical\nTextbook”, in <em>The Cambridge History of Renaissance\nPhilosophy</em>, edited by Charles B. Schmitt et al., Cambridge:\nCambridge University Press, 792–804.", "Stegmann, André, 1973, “La politique de\nLefèvre d’Étaples”, in <em>L’Humanisme\nfrançais au début de la Renaissance</em>, edited by\nAndré Stegmann, Paris: Vrin, 303–12.", "Spruit, Leen, 1995, <em>Species Intelligibilis: From Perception to\nKnowledge, Vol. II: Renaissance Controversies, Later Scholasticism,\nand the Elimination of the Intelligible Species in Modern\nPhilosophy</em>, Leiden: Brill.", "Vasoli, Cesare, 1959, “Jacques Lefèvre\nd’Etaples e le origini del ‹Fabrismo›”,\n<em>Rinascimento</em>, 10: 204–59.", "–––, 1968, <em>La dialettica e la retorica\ndell’Umanesimo: «Invenzione» e «Metodo»\nnella cultura del XV e XVI secolo</em>, Milan: Feltrinelli.", "Veenstra, Jan R., 2009, “Jacques Lefèvre\nd’Étaples: Humanism and Hermeticism in the De Magia\nNaturali”, in <em>Christian Humanism: Essays in Honour of Arjo\nVanderjagt</em>, edited by Arie Johan Vanderjagt et al., Leiden:\nBrill, 353–362.", "Victor, Joseph M., 1975, “The Revival of Lullism at Paris,\n1499–1516”, <em>Renaissance Quarterly</em>, 28:\n504–34.", "–––, 1978, <em>Charles de Bovelles,\n1479–1553: An Intellectual Biography</em>, Geneva: Droz.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"SelWorLef\">Selected Works by Lefèvre</a></h3>\n<p>\nLefèvre’s works were reprinted many times in the\nsixteenth century, but not afterward. Here only the first editions of\nkey works are listed, as well those which first included the\ncommentaries by Josse Clichtove. The most complete and reliable\nbibliography of Lefèvre’s works, including transcriptions\nof letters by him and his colleagues, remains Eugene F. Rice, ed.,\n<em>The Prefatory Epistles of Jacques Lefèvre\nd’Étaples and Related Texts</em> (New York: Columbia\nUniversity Press, 1972). </p>\n<ul class=\"hanging\">\n<li><em>De magia naturali</em>, Olomouc, M.I.119; Vatican City,\nBiblioteca Apostolica Vaticana, MS lat. reg. 1115; Paris,\nBibliothèque nationale de France, MS lat. 7454; Brussels,\nBibliothèque royale de Belgique, MS lat. 10875. (See\nLefèvre 2018, below.)</li>\n<li>1492, <em>Totius philosophiae naturalis paraphrases</em>, Paris:\nJ. Higman.</li>\n<li>1494a, <em>Introductio in metaphysicorum libros Aristotelis</em>,\nParis: J. Higman.</li>\n<li>1494b, <em>Ars moralis … Aristotelis philosophi moralia\nillustria claraque reddit [= In Aristotelis Ethica Nicomachea\nintroductio]</em>, Paris: [A. Caillaut].</li>\n<li>1494c (ed. and comm.), <em>Mercurii Trismegisti Liber de potestate\net sapientia dei, per Marsilium Ficinum traductus</em>, Paris: J.\nHigman for W. Hopyl.</li>\n<li>1495, (ed. and comm.), <em>Textus de Sphera Johannis de\nSacobosco</em>, Paris: J. Higman and W. Hopyl.</li>\n<li>1496a, (ed. and author), <em>Elementa Arithmetica; Elementa\nmusicalia; Epitome in Arithmetica Boetii; Richmimachie ludus</em>,\nParis: J. Higman and W. Hopyl.</li>\n<li>1496b, <em>Introductiones in suppositiones, in predicabilia, in\ndivisiones, in predicamenta, in librum de enunciatione, in primum\npriorum, in secundum priorum, in libros posteriorum, in locos\ndialecticos, in fallacias, in obligationes, in insolubilia</em>,\nParis: G. Marchant.</li>\n<li>1497 (ed.), <em>Decem librorum Moralium Aristotelis, tres\nconversiones</em> [= translations of the <em>Nicomachean Ethics</em>\nby Johannes Argyropolus, Leonardo Bruni, and Robert Grosseteste, with\nLefèvre’s commentary and introduction]. Paris: H.\nEstienne.</li>\n<li>1499 (ed. and comm.), Ps-Dionysius, <em>Theologia vivificans.\nCibus solidus</em>, Paris: J. Higman and W. Hopyl.</li>\n<li>1500 (ed. and comm.), <em>Textus de Sphera … Cum\ncompositione Anuli Astronomici Boni Latensis et Geometria Euclidis\nMegarensis</em>, Paris: W. Hopyl.</li>\n<li>1502a (with Clichtove’s commentary), <em>Totius philosophiae\nnaturalis paraphrases. Adiecto ad litteram familiari commentario</em>,\nParis: W. Hopyl.</li>\n<li>1502b, <em>Artificialis introductio per modum epitomatis in decem\nlibros Ethicorum Aristotelis adiectis elucidata commentariis</em> [=\n<em>Ars moralis</em> (1497) with commentary by Clichtove], Paris: W.\nHopyl and H. Estienne.</li>\n<li>1503a (ed. and comm.), <em>Libri logicorum ad archetypos recogniti\ncum novis ad litteram commentariis ad felices primum Parhisiorum et\ncommuniter aliorum studiorum successus in lucem prodeant ferantque\nlitteris opem</em>, Paris: W. Hopyl and H. Estienne.</li>\n<li>1503b (with Clichtove’s commentary and geometrical works by\nBovelles), <em>Epitome compendiosaque introductio in libros\nArithmeticos Boetii … Ars supputandi [Clichtovei]…\nEpitome rerum geometricarum … De quadratura circuli\ndemonstratio ex Campano. Liber de cubicatione sphere. Perspectiva\nintroductio. Astronomicon</em>, Paris: W. Hopyl and H. Estienne.</li>\n<li>1505a (ed.), <em>Primum volumen Contemplationum Remundi</em>\n[<em>Lulii</em>] <em>duos libros continens. Libellus Blaquerne de\namico et amato</em>, Paris: G. Marchant for J. Petit.</li>\n<li>1505b (ed. and comm.), <em>Pimander, Mercurii Trismegisti liber de\nsapientia et potestate dei; Asclepius; Mercurii de voluntate divina;\nCrater Hermetis</em>, Paris: H. Estienne.</li>\n<li>1506 (ed. and comm.), <em>Politicorum libri octo; commentarii;\nEconomicorum duo; commentarii; Hecatonomiarum septem. Economiarum\nunus. Explanationis Leonardi [Bruni] in oeconomica duo</em>, Paris: H.\nEstienne.</li>\n<li>1507 (with Clichtove’s commentary), <em>Artificialis\nintroductio per modum epitomatis in decem libros Ethicorum Aristotelis\nadiectis elucidata commentariis</em>, Paris: H. Estienne.</li>\n<li>1508 (ed.), <em>Georgii Trapezontii Dialectica</em>, Paris: Henri\nEstienne.</li>\n<li>1509 (ed. and comm.), <em>Quincuplex Psalterium</em>, Paris: H.\nEstienne.</li>\n<li>1510 (ed. and comm.), <em>De superdivina Trinitate theologicum\nopus hexade librorum distinctum</em>, Paris: H. Estienne.</li>\n<li>1512 (ed. and comm.), <em>Epistolae Pauli</em>, Paris: H.\nEstienne.</li>\n<li>1514 (ed.), <em>Haec accurata recognitio trium voluminum Operum\nClariss. P. Nicolai Cusae</em>, Paris: Badius Ascensius.</li>\n<li>1515 (ed.), <em>Aristotelis castigatissime recognitum opus\nmetaphysicum; metaphysica introductio quatuor dialogorum libris\nelucidata</em> [trans. Cardinal Bessarion and J. Argyropolus]. Paris:\nH. Estienne.</li>\n<li>1517a (ed.), <em>Euclidis Megarensis Geometricorum elementorum\nlibri XV</em>, Paris: H. Estienne.</li>\n<li>1517b (with Clichtove’s commentary), <em>Introductorium\nAstronomicum theorias corporum coelestium duobus libris complectens,\nadiecto commentario declaratum</em>, Paris: H. Estienne.</li>\n<li>[EE], <em>Épistres &amp; Évangiles pour les\ncinquante &amp; deux sepmaines de l’an: fac-simile de la\npremiere edition, Simon du Bois</em>, edited by M. A. Screech. Geneva:\nDroz, 1964.</li>\n<li>[JL], <em>Jacques Lefèvre d’Étaples et ses\ndisciples: Epistres et Evangiles pour les cinquante et deux dimenches\nde l’an</em>, edited by Pierre de Vingle, Guy Bedouelle, and\nFranco Giacone. Brill: Leiden, 1976.</li>\n<li>[HL], <em>Hecatonomiarum libri: texte latin des\nHécatonomies de Lefèvre d’Étaples, en\nparallèle avec la traduction latine de Platon par Marsile\nFicini</em>, edited by Jean Boisset and Robert Combès. Paris:\nVrin, 1979.</li>\n<li>[MN], <em>La Magie naturelle / De Magia naturali: I.\nL’Influence des astres</em>, edited and translated by Jean-Marc\nMandosio, Paris: Les Belles Lettres, 2018.</li>\n</ul>\n<h3><a id=\"PriSouSecLit\">Primary Sources and Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Ashworth, E. Jennifer, 2010, “Terminist Logic”, in\n<em>The Cambridge History of Medieval Philosophy</em>, edited by\nRobert Pasnau and Christina van Dyke, Cambridge: Cambridge University\nPress, 146–58.</li>\n<li>Axworthy, Angela, 2016, <em>Le Mathématicien renaissant et\nson savoir. Le statut des mathématiques selon Oronce Fine</em>,\nParis: Classiques Garnier.</li>\n<li>Bedouelle, Guy, 1976, <em>Lefèvre d’Étaples et\nl’intelligence des Écritures</em>, Geneva: Droz.</li>\n<li>Bianchi, Luca, 2007, “Continuity and Change in the\nAristotelian Tradition”, in <em>The Cambridge Companion to\nRenaissance Philosophy</em>, edited by James Hankins, Cambridge:\nCambridge University Press, 49–71.</li>\n<li>Boisset, J., 1973, “Les Hécatonomies de\nLefèvre d’Etaples”, in <em>L’Humanisme\nfrançais au début de la Renaissance</em>, edited by\nAndré Stegmann, Paris: Vrin, 287–302.</li>\n<li>Celenza, Christopher S., 2007, “The Revival of Platonic\nPhilosophy”, in <em>The Cambridge Companion to Renaissance\nPhilosophy</em>, edited by James Hankins, Cambridge: Cambridge\nUniversity Press, 72–96.</li>\n<li>––– (ed.), 2010, <em>Angelo Poliziano’s\nLamia: Text, Translation, and Introductory Studies</em>, Leiden:\nBrill.</li>\n<li>Copenhaver, Brian P., 1978, <em>Symphorien Champier and the\nReception of the Occultist Tradition in Renaissance France</em>, The\nHague/New York: Mouton Publishers.</li>\n<li>–––, 1977, “Lefèvre\nd’Étaples, Symphorien Champier, and the Secret Names of\nGod”, <em>Journal of the Warburg and Courtauld Institutes</em>,\n40: 189–211.</li>\n<li>de Libera, Alain, 1996, <em>La querelle des universaux. De Platon\nà la fin du Moyen Age</em>, Paris: Édition du\nSeuil.</li>\n<li>de Rijk, L. M., 1962–67, <em>Logica Modernorum: A\nContribution to the History of Early Terminist Logic</em>, Assen: Van\nGorcum.</li>\n<li>Di Liscia, Daniel, 2010, <em>Zwischen Geometrie und\nNaturphilosophie. Die Entwicklung der Formlatitudenlehre im deutschen\nSprachraum</em>, Munich: Universitätsbibliothek.</li>\n<li>Dionisotti, Carlo, 1955, “Ermolao Barbaro e la Fortuna di\nSuiseth”, in <em>Medioevo e Rinascimento: Studi in onore di\nBruno Nardi</em>, Florence: Sansoni, 1:219–53.</li>\n<li>Ebbesen, Steb, 1977, “Ancient Scholastic Logic as the Source\nof Medieval Scholastic Logic,” in <em>The Cambridge History of\nLater Medieval Philosophy</em>, edited by Norman Kretzmann et al.,\nCambridge: Cambridge University Press, 101–27.</li>\n<li>Emery, Kent, 1984, “Mysticism and the Coincidence of\nOpposites in Sixteenth- and Seventeenth-Century France”,\n<em>Journal for the History of Ideas</em>, 45: 3–23.</li>\n<li>Faye, Emmanuel, 1998, <em>Philosophie et perfection de\nl’homme: De la Renaissance à Descartes</em>, Paris:\nVrin.</li>\n<li>–––, 1998, “Nicolas de Cues et Charles de\nBovelles dans le manuscrit ‘Exigua pluvia’ de Beatus\nRhenanus”, <em>Archives d’histoire doctrinale et\nlittéraire du moyen âge</em>, 65: 415–50.</li>\n<li>Gandillac, Maurice de, 1973, “Lefèvre\nd’Étaples et Charles de Bovelles, Lecteurs de Nicolas de\nCues”, in <em>L’Humanisme Français au début\nde La Renaissance</em>, Paris: Vrin, 115–71.</li>\n<li>Gilbert, Neal W., 1960, <em>Renaissance Concepts of Method</em>,\nNew York: Columbia University Press.</li>\n<li>Guerlac, Rita (ed.), 1979, <em>Juan Luis Vives against the\nPseudodialecticians: A Humanist Attack on Medieval Logic: The Attack\non the Pseudialecticians and On Dialectic</em>, Dordrecht:\nSpringer.</li>\n<li>Hartmann, Alfred (ed.), 1942, <em>Die Amerbachkorrespondenz</em>,\nBasel: Universitätsbibliothek.</li>\n<li>Hoenen, Maarten J.F.M., 1993, “The Reparationes Librorum\nTotius Naturalis Philosophiae (Cologne 1494) as a Source for the Late\nMedieval Debates between Albertistae and Thomistae,”\n<em>Documenti E Studi Sulla Tradizione Filosofica Medievale</em>, 4:\n307–44.</li>\n<li>–––, 2003, “Via Antiqua and Via Moderna in\nthe Fifteenth Century: Doctrinal, Institutional, and Church Political\nFactors in the <em>Wegestreit</em>”, in <em>The Medieval\nHeritage in Early Modern Metaphysics and Modal Theory,\n1400–1700</em>, edited by Russell L. Friedman and Lauge O.\nNielsen, Dordrecht: Kluwer, 9–36.</li>\n<li>Hotson, Howard, 2007, <em>Commonplace Learning: Ramism and its\nGerman Ramifications</em>, Oxford: Oxford University Press.</li>\n<li>Hughes, Philip Edgcumbe, 1984, <em>Lefèvre: Pioneer of\nEcclesiastical Renewal in France</em>, Grand Rapids, MI:\nEerdmans.</li>\n<li>Kaluza, Zenon, 1988, <em>Les querelles doctrinales à Paris:\nNominalistes et realistes aux confins du XIVe et du XVe\nsiècles</em>, Bergamo: Lierluigi Lubrina.</li>\n<li>Kessler, Eckhard, 1999, “Introducing Aristotle to the\nSixteenth Century: The Lefèvre Enterprise”, in\n<em>Philosophy in the Sixteenth and Seventeenth Centuries:\nConversations with Aristotle</em>, edited by Constance Blackwell and\nSachiko Kusukawa, Aldershot: Ashgate, 1–21.</li>\n<li>Kieckhefer, Richard, 2007, “Jacques Lefèvre\nd’Étaples and the Conception of Natural Magic”, in\n<em>La magia nell’Europa moderna</em>, edited by Fabrizio Meroi.\nFlorence: Olschki, 63–78.</li>\n<li>Kirschner, Stefan, 2000, “Oresme on Intension and Remission\nof Qualities in His Commentary on Aristotle’s Physics”,\n<em>Vivarium</em>, 38(2): 255–74.</li>\n<li>Klinger-Dollé, Anne-Hélène, 2016, <em>Le\n</em>De sensu<em> de Charles de Bovelles (1511): conception\nphilosophique des sens et figuration de la pensée</em>, Geneva:\nDroz.</li>\n<li>Kraye, Jill, 1995, “Renaissance Commentaries on the\nNicomachean Ethics”, in <em>The Vocabulary of Teaching and\nResearch between Middle Ages and Renaissance</em>, edited by Olga\nWeijers, Turnhout: Brepols, 96–117.</li>\n<li>Lines, David A., 2007, “Lefèvre and French\nAristotelianism on the Eve of the Sixteenth Century”, in <em>Der\nAristotelismus in der Frühen Neuzeit: Kontinuität oder\nWiederangeignung?</em>, edited by Günter Frank and Andreas Speer,\nWiesbaden: Harrassowitz Verlag, 273–90.</li>\n<li>Llinares, A., 1973, “Le Lullisme de Lefèvre\nd’Etaples et de ses amis humanistes”, in\n<em>L’Humanisme français au début de la\nRenaissance</em>, edited by Jean-Claude Margolin, Paris: Vrin,\n126–37.</li>\n<li>Mack, Peter, 1993, <em>Renaissance Argument: Valla and Agricola in\nthe Traditions of Rhetoric and Dialectic</em>, Leiden: Brill.</li>\n<li>Mahoney, Edward P., 1982, “Neoplatonism, the Greek\nCommentators, and Renaissance Aristotelianism”, in\n<em>Neoplatonism and Christian Thought</em>, edited by Dominic J.\nO’Meara, Albany, N.Y.: State University of New York Press,\n169–84.</li>\n<li>Mandosio, Jean-Marc, 2013, “Le <em>De magia naturali</em> de\nJacques Lefèvre d’Étaples: Magie, alchimie et\ncabale”, in <em>Les muses secrètes kabbale, alchimie et\nlittérature à la Renaissance: actes de la journée en\nhommage à François Secret, Vérone, 18 octobre\n2005</em>, edited by R. Gorris, Geneva: Droz, 37–79.</li>\n<li>Marenbon, John, 2003, <em>Boethius</em>, New York: Oxford\nUniversity Press.</li>\n<li>Margolin, Jean-Claude, 1976, “L’enseignement des\nmathématiques en France (1540–70): Charles de Bovelles,\nFine, Peletier, Ramus”, in <em>French Renaissance Studies,\n1540–70: Humanism and the Encyclopedia</em>, edited by Peter\nSharratt, Edinburgh: Edinburgh University Press, 109–55.</li>\n<li>Marrone, Steven P., 2010, “The Rise of the\nUniversities”, in <em>The Cambridge History of Medieval\nPhilosophy</em>, edited by Robert Pasnau and Christina van Dyke,\nCambridge: Cambridge University Press, 2010, 50–62.</li>\n<li>Meier-Oeser, Stephan, 1989, <em>Die Präsenz des Vergessenen:\nZur Rezeption der Philosophie des Nicolaus Cusanus vom 15. bis zum 18.\nJahrhundert</em>, Münster: Aschendorff.</li>\n<li>Mönch, Walter, 1936, <em>Die italienische Platonrenaissance\nund ihre Bedeutung für Frankreichs Literatur- und\nGeistesgeschichte (1450–1550)</em>, Berlin: Matthiesen\nVerlag.</li>\n<li>Moyer, Ann E., 2012, “The Quadrivium and the Decline of\nBoethian Influence”, in <em>A Companion to Boethius in the\nMiddle Ages</em>, edited by Noel Harold Kaylor and Philip Edward\nPhillips, Leiden: Brill, 479–517.</li>\n<li>Moss, Ann, 2003, <em>Renaissance Truth and the Latin Language\nTurn</em>, Oxford: Oxford University Press.</li>\n<li>Nauta, Lodi, 2009, <em>In Defense of Common Sense: Lorenzo\nValla’s Humanist Critique of Scholastic Philosophy</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Ong, Walter J., 1958, <em>Ramus, Method, and the Decay of\nDialogue: From the Art of Discourse to the Art of Reason</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Oosterhoff, Richard J., 2013,“From Pious to Polite:\nPythagoras in the Res Publica Litterarum of French Renaissance\nMathematics”, <em>Journal of the History of Ideas</em>, 74:\n531–52.</li>\n<li>–––, 2014, “Idiotae, Mathematics, and\nArtisans: The Untutored Mind and the Discovery of Nature in the\nFabrist Circle”, <em>Intellectual History Review</em>,\n24:1–19.</li>\n<li>–––, 2018, <em>Making Mathematical Culture:\nUniversity and Print in the Circle of Lefèvre\nd’Étaples</em>, Oxford-Warburg Studies, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2019a, “Cusanus and Boethian Theology\nin the Early French Reform”, in <em>Nicholas of Cusa and the\nMaking of the Early Modern World</em>, edited by Simon J.G. Burton,\nJoshua Hollmann, and Eric M. Parker, Leiden: Brill, 339–66.</li>\n<li>–––, 2019b, “Jacques Lefèvre\nd’Étaples and Charles de Bovelles on Platonism, Theurgy,\nand Intellectual Difficulty”, in <em>Plotinus’ Legacy: The\nTransformation of Platonism from the Renaissance to the Modern\nEra</em>, edited by Stephen H. Gersh, Cambridge: Cambridge University\nPress, 73–95.</li>\n<li>Pantin, Isabelle, 1988, “Les ‘commentaires’ de\nLefèvre d’Etaples au Corpus Hermeticum”, in\n<em>Présence d’Hermès Trismégiste</em>,\nedited by Antoine Faivre, Paris: Éditions Albin Michel,\n167–83.</li>\n<li>–––, 2009, “Oronce Fine’s Role as\nRoyal Lecturer”, in <em>The Worlds of Oronce Fine. Mathematics,\nInstruments and Print in Renaissance France</em>, edited by Alexander\nMarr, Donington: Shaun Tyas, 2009, 13–30.</li>\n<li>Park, Katharine, 1980, “Albert’s Influence on Late\nMedieval Psychology”, in <em>Albertus Magnus and the Natural\nSciences</em>, edited by James A. Weisheipl, Toronto: Pontifical\nInstitute of Mediaeval Studies, 501–35.</li>\n<li>Pernot, Jean-Francois (ed.), 1995, <em>Jacques Lefèvre\nd’Etaples: (1450?–1536)</em>, Actes du Colloque\nd’Étaples les 7 et 8 novembre 1992, Paris: Champion.</li>\n<li>Porrer, Sheila M., 2009, <em>Jacques Lefèvre\nd’Etaples and the Three Maries Debates</em>, Geneva: Droz.</li>\n<li>Prantl, Carl, 1870, <em>Geschichte der Logic im Abendlande</em>,\nIV, Leipzig.</li>\n<li>Rabouin, David, 2009, <em>Mathesis universalis:\nL’idée e «mathématique universelle»\nd’Aristote à Descartes</em>, Paris:\nÉpiméthée.</li>\n<li>Reid, Jonathan A., 2009, <em>King’s Sister—Queen of\nDissent: Marguerite of Navarre (1492–1549) and Her Evangelical\nNetwork</em>, 2 vols, Leiden: Brill.</li>\n<li>Reiss, Timothy J., 1997, <em>Knowledge, Discovery and Imagination\nin Early Modern Europe</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Renaudet, Augustin, 1953, <em>Préréforme et\nhumanisme à Paris pendant les premières guerres\nd’Italie, 1494–1517</em>, 2nd ed., Paris: Champion.</li>\n<li>Rice, Eugene F., 1970, “Humanist Aristotelianism in France:\nJacques Lefèvre d’Étaples and His Circle”,\nin <em>Humanism in France</em>, edited by A. H. T. Levi, Manchester:\nManchester University Press, 132–49.</li>\n<li>––– (ed.), 1972, <em>The Prefatory Epistles of\nJacques Lefèvre d’Étaples and Related Texts</em>,\nNew York: Columbia University Press.</li>\n<li>Rossi, Paolo, 2000, <em>Logic and the Art of Memory: The Quest for\na Universal Language</em>, Stephen Clucas (trans.), 1983; London:\nContinuum.</li>\n<li>Shapiro, Herman, 1959, “Walter Burley and the Intension and\nRemission of Forms”, <em>Speculum</em>, 34: 413–27.</li>\n<li>Schmitt, Charles B., 1983, <em>Aristotle and the Renaissance</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1988, “The Rise of the Philosophical\nTextbook”, in <em>The Cambridge History of Renaissance\nPhilosophy</em>, edited by Charles B. Schmitt et al., Cambridge:\nCambridge University Press, 792–804.</li>\n<li>Stegmann, André, 1973, “La politique de\nLefèvre d’Étaples”, in <em>L’Humanisme\nfrançais au début de la Renaissance</em>, edited by\nAndré Stegmann, Paris: Vrin, 303–12.</li>\n<li>Spruit, Leen, 1995, <em>Species Intelligibilis: From Perception to\nKnowledge, Vol. II: Renaissance Controversies, Later Scholasticism,\nand the Elimination of the Intelligible Species in Modern\nPhilosophy</em>, Leiden: Brill.</li>\n<li>Vasoli, Cesare, 1959, “Jacques Lefèvre\nd’Etaples e le origini del ‹Fabrismo›”,\n<em>Rinascimento</em>, 10: 204–59.</li>\n<li>–––, 1968, <em>La dialettica e la retorica\ndell’Umanesimo: «Invenzione» e «Metodo»\nnella cultura del XV e XVI secolo</em>, Milan: Feltrinelli.</li>\n<li>Veenstra, Jan R., 2009, “Jacques Lefèvre\nd’Étaples: Humanism and Hermeticism in the De Magia\nNaturali”, in <em>Christian Humanism: Essays in Honour of Arjo\nVanderjagt</em>, edited by Arie Johan Vanderjagt et al., Leiden:\nBrill, 353–362.</li>\n<li>Victor, Joseph M., 1975, “The Revival of Lullism at Paris,\n1499–1516”, <em>Renaissance Quarterly</em>, 28:\n504–34.</li>\n<li>–––, 1978, <em>Charles de Bovelles,\n1479–1553: An Intellectual Biography</em>, Geneva: Droz.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Aristotelianism: in the Renaissance", "Aristotle", "Aristotle, commentators on", "Bruno, Giordano", "Cusanus, Nicolaus [Nicolas of Cusa]", "Erasmus, Desiderius", "Ficino, Marsilio", "hermitism", "Neoplatonism", "Patrizi, Francesco", "Peter of Spain [= Petrus Hispanus]", "Pico della Mirandola, Giovanni", "Pseudo-Dionysius the Areopagite", "Ramus, Petrus", "Valla, Lorenzo", "Vives, Juan Luis"], "entry_link": [{"../aristotelianism-renaissance/": "Aristotelianism: in the Renaissance"}, {"../aristotle/": "Aristotle"}, {"../aristotle-commentators/": "Aristotle, commentators on"}, {"../bruno/": "Bruno, Giordano"}, {"../cusanus/": "Cusanus, Nicolaus [Nicolas of Cusa]"}, {"../erasmus/": "Erasmus, Desiderius"}, {"../ficino/": "Ficino, Marsilio"}, {"../neoplatonism/": "Neoplatonism"}, {"../patrizi/": "Patrizi, Francesco"}, {"../peter-spain/": "Peter of Spain [= Petrus Hispanus]"}, {"../pico-della-mirandola/": "Pico della Mirandola, Giovanni"}, {"../pseudo-dionysius-areopagite/": "Pseudo-Dionysius the Areopagite"}, {"../ramus/": "Ramus, Petrus"}, {"../lorenzo-valla/": "Valla, Lorenzo"}, {"../vives/": "Vives, Juan Luis"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lefevre-etaples\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/lefevre-etaples/\" target=\"other\">Preview the PDF version of this entry</a> at the\n<a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=lefevre-etaples&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"http://philpapers.org/sep/lefevre-etaples/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lefevre-etaples": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/lefevre-etaples/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=lefevre-etaples&redirect=True": "Look up topics and thinkers related to this entry"}, {"http://philpapers.org/sep/lefevre-etaples/": "Enhanced bibliography for this entry"}, {"http://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [], "listed_links": [{"http://www.prdl.org/author_view.php?a_id=801": "Lefèvre’s Works at the Post-Reformation Digital Library"}]}, "tokenized_text": ["1", "life", "work", "little", "known", "lefèvre", "family", "early", "training", "came", "étaples", "coast", "picardy", "early", "1490s", "teaching", "collège", "du", "cardinal", "lemoine", "paris", "unusually", "long", "teaching", "career", "nearly", "two", "decade", "became", "college", "revered", "teacher", "elevating", "relative", "obscurity", "reputation", "philosopher", "cultivated", "classroom", "countless", "edition", "philosophical", "work", "account", "thought", "must", "first", "place", "diverse", "body", "work", "within", "context", "life", "lefèvre", "early", "publication", "punctuated", "three", "journey", "italy", "colleague", "mentioned", "contact", "great", "humanist", "fifteenthcentury", "italy", "much", "lauded", "encyclopedic", "learning", "undertook", "journey", "apparently", "pursue", "model", "scholarly", "inquiry", "might", "leaven", "teaching", "paris", "1491", "traveled", "venice", "ostensibly", "meet", "ermolao", "barbaro", "famous", "eloquent", "translator", "themistius", "fourthcentury", "paraphrast", "aristotle", "barbaro", "rome", "time", "lefèvre", "changed", "travel", "plan", "include", "rome", "florence", "return", "published", "first", "work", "print", "totius", "philosophiae", "naturalis", "paraphrase", "1492", "600", "octavo", "page", "presented", "student", "short", "epitome", "digested", "paraphrase", "aristotle", "physic", "heaven", "minor", "work", "natural", "philosophy", "ie", "parva", "naturalia", "little", "natural", "soul", "next", "year", "immensely", "productive", "help", "colleague", "student", "lefèvre", "published", "similar", "epitome", "standard", "university", "course", "logic", "1496b", "aristotle", "metaphysics", "1494a", "nicomachean", "ethic", "1494b", "1490s", "lefèvre", "also", "published", "work", "university", "class", "room", "went", "beyond", "aristotle", "notably", "mathematics", "oosterhoff", "2018", "astronomy", "wrote", "important", "commentary", "standard", "introduction", "john", "sacrobosco", "sphere", "1495", "print", "arguably", "lefèvre", "original", "contribution", "field", "systematic", "treatise", "music", "theory", "elementa", "musicalia", "published", "three", "work", "edition", "elementa", "arithmetica", "jordanus", "nemorarius", "13th", "century", "popular", "introduction", "arithmetica", "boethius", "arithmetical", "game", "rithmomachia", "1496a", "see", "also", "oosterhoff", "2013", "moyer", "2012", "mathematical", "work", "served", "pedagogical", "us", "first", "helping", "student", "oftenneglected", "part", "paris", "cursus", "also", "served", "philosophical", "aim", "lefèvre", "became", "evident", "work", "unrelated", "university", "curriculum", "consider", "three", "example", "1494", "published", "ficino", "latin", "translation", "hermetic", "corpus", "along", "brief", "annotation", "1498", "printed", "first", "edition", "work", "attributed", "dionysius", "areopagite", "latin", "translation", "along", "extensive", "commentary", "mid1490s", "composed", "natural", "magic", "de", "magia", "naturali", "circulated", "manuscript", "lefèvre", "mn", "inspired", "partly", "ficino", "three", "book", "life", "de", "triplici", "vita", "treatise", "incorporated", "pythagorean", "cabbalistic", "presocratic", "theme", "example", "section", "pythagorean", "magic", "copenhaver", "1977", "mandosio", "2013", "reflection", "magic", "especially", "included", "numerological", "excurses", "1500", "lefèvre", "begun", "produce", "philologically", "oriented", "editionstypically", "placed", "newer", "translation", "alongside", "traditional", "medieval", "version", "commentary", "occasional", "emendation", "informed", "modest", "command", "greek", "earliest", "example", "method", "threefold", "edition", "aristotle", "nicomachean", "ethic", "1497", "included", "medieval", "latin", "version", "along", "translation", "johannes", "argyropolus", "leonardo", "bruni", "approach", "also", "defined", "lefèvre", "groundbreaking", "edition", "psalm", "1509", "letter", "st", "paul", "1512", "euclid", "element", "geometry", "1517a", "returned", "italy", "1500", "meeting", "famous", "humanist", "printer", "aldus", "manutius", "venice", "attending", "roman", "celebration", "papal", "jubilee", "monastery", "near", "padua", "copied", "ramon", "lull", "blaquerna", "rome", "found", "treatise", "miniature", "astrolabe", "published", "paris", "1505", "1500", "respectively", "return", "perhaps", "stimulated", "greek", "edition", "aldus", "lefèvre", "aristotelian", "program", "took", "new", "dimension", "fuller", "edition", "translation", "earlier", "handbook", "significant", "probably", "large", "folio", "latin", "edition", "aristotle", "organon", "full", "suite", "detailed", "commentary", "another", "unusual", "publication", "combined", "aristotle", "politics", "pseudoaristotelian", "economics", "700", "sentence", "taken", "plato", "republic", "law", "digested", "hecatonomia", "1506", "final", "trip", "rome", "1507", "lefèvre", "interest", "philosophy", "receded", "background", "retired", "teaching", "collège", "du", "cardinal", "lemoine", "philosophy", "disappear", "entirely", "however", "1514", "finally", "published", "opera", "omnia", "cardinal", "nicholas", "cusa", "fruit", "many", "year", "spent", "gathering", "together", "manuscript", "1515", "published", "argyropoulos", "translation", "aristotle", "metaphysics", "together", "translation", "cardinal", "bessarion", "pico", "given", "manuscript", "1491", "primary", "energy", "focused", "biblical", "study", "one", "prominent", "intellectual", "day", "lefèvre", "drawn", "reluctantly", "several", "controversy", "paris", "faculty", "theology", "charged", "friend", "johann", "reuchlin", "judaizing", "1514", "wrote", "plea", "rome", "help", "likeminded", "giles", "viterbo", "vicar", "general", "augustinian", "order", "erasmus", "rotterdam", "sought", "take", "aging", "pedagogue", "notch", "criticizing", "work", "pauline", "epistle", "shaky", "greek", "1517", "lefèvre", "found", "heart", "another", "academic", "culture", "war", "debate", "three", "mary", "took", "skeptical", "view", "three", "figure", "name", "new", "testament", "tradition", "held", "person", "final", "devastating", "controversy", "began", "1521", "patron", "cardinal", "guillaume", "briçonnet", "invited", "lead", "experiment", "diocesan", "reform", "meaux", "near", "paris", "paris", "faculty", "theology", "already", "concerned", "lefèvre", "incursion", "field", "theology", "found", "experiment", "smacked", "much", "lutheranismwhich", "already", "condemned", "1520", "year", "experiment", "meaux", "disintegrated", "1525", "lefèvre", "fled", "strassburg", "following", "year", "françois", "ier", "recalled", "lefèvre", "france", "tutored", "royal", "child", "served", "chaplain", "court", "marguerite", "de", "navarre", "king", "sister", "final", "decade", "life", "reid", "2009", "2", "epitome", "philosophical", "style", "lefèvre", "reputation", "rested", "manner", "introduced", "philosophy", "commentary", "paraphrase", "editionsin", "word", "style", "philosophical", "epitome", "late", "sixteenthcentury", "critic", "aristotelianism", "francesco", "patrizi", "observed", "lefèvre", "first", "read", "aristotle", "without", "scholastic", "quaestiones", "historian", "frequently", "cite", "lefèvre", "desire", "following", "translation", "aristotle", "leonardo", "bruni", "draw", "taste", "purest", "water", "spring", "aristotle", "work", "nunc", "ergo", "iuvenes", "ex", "aristotelico", "opere", "ceu", "ex", "proprio", "fonte", "purissimas", "haurite", "delibateque", "aqua", "exhorted", "student", "titlepage", "1503", "edition", "logical", "work", "see", "bianchi", "2007", "57n19", "schmitt", "1988", "hoped", "return", "source", "convinced", "would", "cure", "philosophy", "illshe", "described", "mathematics", "ancient", "wisdom", "example", "medicine", "would", "prepare", "student", "mind", "properly", "approach", "philosophy", "lefèvre", "1496a", "h7v", "denounced", "innovative", "element", "traditional", "university", "logic", "sophismata", "instead", "suggested", "student", "read", "shorter", "handbook", "logic", "1496b", "learn", "enough", "moving", "profitable", "study", "instead", "addressing", "specialized", "topic", "staking", "position", "within", "university", "school", "lefèvre", "favored", "handbook", "introduced", "discipline", "brief", "explanation", "term", "basic", "concept", "ostensibly", "leaving", "student", "conceptual", "vocabulary", "enough", "time", "read", "aristotle", "lefèvre", "textbook", "often", "deployed", "several", "genre", "volume", "line", "2007", "visually", "striking", "synoptic", "table", "introduction", "glance", "supply", "roadmap", "whole", "work", "table", "followed", "paraphrase", "work", "chapter", "chapter", "effort", "reorganize", "sinewy", "contour", "aristotle", "work", "simpler", "form", "usually", "lefèvre", "prefaced", "paraphrase", "notae", "encapsulated", "judgement", "interesting", "important", "insight", "chapter", "might", "added", "philological", "historical", "topical", "remark", "another", "genre", "lefèvre", "occasionally", "used", "dialogue", "catechized", "young", "student", "philosophical", "doctrine", "also", "demonstrated", "teacher", "pupil", "engage", "finally", "published", "edition", "aristotelian", "treatise", "lefèvre", "also", "wrote", "traditional", "commentary", "normally", "proceeded", "chapter", "chapter", "aristotle", "text", "keeping", "literal", "comment", "philological", "question", "obscure", "phrase", "separate", "notae", "literary", "doctrinal", "methodological", "issue", "raised", "work", "aggregate", "range", "epitomizing", "format", "genre", "defined", "renaissance", "philosophical", "style", "lefèvre", "work", "remodeled", "northern", "university", "kessler", "argued", "lefèvre", "met", "barbaro", "poliziano", "italy", "also", "encountered", "new", "aristotle", "barbaro", "promised", "student", "would", "make", "aristotle", "accessible", "kessler", "1999", "aristotle", "taken", "piecemeal", "instead", "author", "digested", "entirety", "systematically", "compendiously", "paraphrase", "lefèvre", "thus", "present", "encyclopedic", "aristotle", "poliziano", "lecturing", "aristotle", "lefèvre", "visited", "florence", "1491", "stand", "possible", "precedent", "philological", "side", "lefèvre", "encyclopedic", "enterprise", "celenza", "2010", "poliziano", "promised", "explain", "fact", "word", "re", "et", "verba", "aristotle", "giving", "account", "grammarian", "would", "represent", "aristotle", "better", "philosophical", "comment", "university", "competitor", "approach", "philological", "commentary", "extent", "traced", "lefèvre", "literary", "note", "interpretive", "comparison", "idea", "poliziano", "central", "influence", "however", "need", "treated", "caution", "since", "poliziano", "far", "tell", "surviving", "praelectiones", "focused", "knowledge", "greek", "could", "reveal", "aristotle", "meaning", "word", "word", "little", "concern", "synoptic", "vision", "aristotle", "work", "whereas", "lefèvre", "aimed", "reconstruct", "aristotle", "systematically", "whole", "laying", "emphasis", "furthermore", "coherence", "christian", "teaching", "3", "aristotle", "method", "school", "lefèvre", "saw", "concordist", "sourcebased", "approach", "philosophy", "way", "steer", "clear", "late", "medieval", "philosophical", "school", "modern", "scholarship", "often", "divided", "realist", "thomists", "scotists", "nominalist", "ockham", "others", "hoenen", "2003", "observes", "late", "medieval", "scholar", "often", "saw", "occupying", "place", "given", "tradition", "following", "thomas", "aquinas", "john", "dun", "scotus", "leading", "philosopher", "yet", "mean", "scotist", "realist", "field", "study", "philosopher", "view", "universal", "systematically", "predict", "view", "doctrine", "rather", "school", "thought", "identified", "processus", "method", "particular", "figure", "albert", "great", "dun", "scotus", "historical", "exemplar", "lefèvre", "central", "claim", "aristotle", "exemplar", "method", "aristotelian", "exhorted", "student", "read", "aristotle", "work", "rather", "make", "career", "studying", "commentary", "first", "contribution", "logic", "short", "epitome", "major", "logical", "operation", "found", "peter", "spain", "summule", "logicales", "prefaced", "entreating", "student", "get", "caught", "exponabilia", "insolubilia", "sophismata", "rejected", "philosophy", "instead", "pas", "quickly", "scouting", "barbarian", "land", "1496b", "a1v", "rice", "1972", "39", "1503", "edition", "aristotle", "logical", "work", "lefèvre", "presented", "emended", "text", "standard", "latin", "translation", "boethius", "brief", "commentary", "textual", "work", "necessary", "said", "previous", "generation", "although", "dealt", "logic", "actually", "make", "use", "logic", "certain", "factious", "extraneous", "matter", "condemned", "rather", "refuted", "1503a", "a1v", "rice", "1972", "88", "result", "book", "logic", "become", "full", "error", "novelty", "novitia", "lifeless", "matter", "like", "much", "hay", "ibid", "contrast", "commentary", "corrected", "edition", "would", "brief", "would", "explain", "aristotle", "meaning", "instead", "commentator", "lefèvre", "textbook", "designed", "help", "student", "gain", "access", "aristotle", "quickly", "familiarizing", "elementary", "definition", "discipline", "setting", "larger", "schematic", "framework", "comment", "aristotle", "politics", "stressed", "integrity", "different", "discipline", "requires", "identifying", "component", "proper", "eachfor", "example", "point", "geometry", "monad", "arithmetic", "letter", "make", "word", "grammar", "1506", "a2v", "respected", "aristotle", "methodical", "admonition", "make", "mistaken", "assumption", "conclusion", "one", "discipline", "could", "applied", "anotherhis", "prohibition", "metabasis", "similarly", "earliest", "writing", "lefèvre", "insisted", "discipline", "follow", "distinctive", "kind", "reasoning", "thus", "logic", "left", "deal", "logical", "matter", "mathematics", "mathematical", "matter", "divine", "discipline", "metaphysical", "matter", "lefèvre", "1492", "b4v", "rice", "1970", "12", "lefèvre", "textbook", "often", "divided", "discipline", "constituent", "part", "sometimes", "visually", "simplified", "synoptic", "table", "goal", "table", "provide", "student", "swift", "access", "individual", "element", "well", "general", "heading", "given", "disciplinea", "vision", "methodical", "philosophy", "popularized", "peter", "ramus", "later", "sixteenth", "century", "ong", "1958", "overview", "recent", "literature", "see", "hotson", "2007", "1637", "fact", "discipline", "form", "reasoning", "mean", "could", "compared", "point", "ultimate", "unity", "according", "lefèvre", "aristotle", "also", "taught", "discipline", "bore", "analogical", "relationship", "one", "anotherthe", "distinctive", "method", "discipline", "startingpoint", "higher", "knowledge", "frequently", "student", "alerted", "reader", "believed", "trace", "vestigia", "analogy", "analogiae", "could", "help", "find", "deeper", "unity", "beneath", "apparently", "diverse", "phenomenon", "earliest", "introduction", "natural", "philosophy", "lefèvre", "claimed", "kind", "secret", "analogy", "lying", "hidden", "underneath", "whole", "aristotle", "philosophy", "without", "philosophy", "inanimate", "lifeless", "like", "body", "without", "sense", "touch", "1492", "b2r", "rice", "1970", "6", "though", "regularly", "draw", "attention", "analogy", "lefèvre", "systematically", "describe", "secret", "analogy", "instead", "often", "us", "analogy", "compare", "constituent", "part", "different", "discipline", "oosterhoff", "2018", "7785", "circumstantial", "evidence", "suggests", "member", "circle", "least", "toyed", "idea", "analogy", "could", "universal", "science", "student", "beatus", "rhenanus", "included", "course", "note", "several", "thesis", "concerning", "analogy", "science", "science", "aristotle", "claim", "find", "secret", "science", "analogy", "known", "analogy", "known", "firmly", "demonstration", "beatus", "rhenanus", "cahier", "étudiant", "bibliothèque", "humaniste", "de", "sélestat", "m", "50", "253r", "fascination", "analogy", "may", "explain", "lefèvre", "appreciated", "mathematics", "much", "since", "ancient", "number", "theory", "focused", "ratio", "proportiones", "latin", "analogia", "greek", "number", "analogia", "sometimes", "ancient", "greek", "meaning", "proportion", "ratio", "two", "mathematical", "object", "time", "reflected", "analogy", "subject", "lower", "higher", "discipline", "argued", "mathematical", "reasoning", "provided", "certain", "step", "especially", "one", "know", "method", "modus", "analogy", "uplifting", "exercise", "assurrectiones", "lefèvre", "1517a", "a2v", "rice", "1972", "380", "praised", "mathematics", "model", "method", "ask", "give", "quicker", "abstract", "purer", "analogy", "rising", "divine", "matter", "mathematical", "learning", "ibid", "case", "based", "analogy", "structural", "similarity", "elementary", "part", "area", "study", "eg", "lefèvre", "1497", "a3r", "discus", "analogy", "elementary", "part", "discipline", "method", "sixteenth", "century", "way", "approaching", "given", "disciplineaccording", "paduan", "school", "example", "one", "properly", "approached", "natural", "philosophy", "logical", "method", "regressus", "lefèvre", "believed", "kind", "prioritizing", "logic", "discipline", "undermined", "distinctive", "mode", "reasoning", "proper", "discipline", "sixteenth", "century", "one", "many", "us", "word", "methodus", "indicate", "short", "cut", "perhaps", "compendious", "textbook", "student", "might", "approach", "discipline", "gilbert", "1960", "5960", "indeed", "evidence", "usage", "lefèvre", "circle", "guillaume", "gontier", "student", "amanuensis", "explicitly", "referred", "lefèvre", "collection", "introduction", "logic", "method", "telling", "reader", "extremely", "brief", "method", "swiftly", "land", "port", "discipline", "hac", "methodo", "etiam", "quam", "brevissima", "ad", "disciplinarum", "portus", "ocissime", "appelere", "1496b", "d6rv", "1502", "bruno", "amerbach", "informed", "johannes", "amerbach", "basel", "attending", "cursus", "fabri", "assured", "worried", "father", "preferred", "study", "scotists", "bare", "text", "fabrists", "without", "commentary", "nihil", "comentarii", "would", "profit", "examination", "hartmann", "1942", "146", "renaudet", "1953", "404406", "among", "lefèvre", "student", "manual", "epitome", "paraphrase", "short", "descriptive", "note", "defined", "philosophical", "study", "collège", "du", "cardinal", "lemoine", "began", "treated", "exemplar", "method", "although", "lefèvre", "introduction", "intended", "facilitate", "direct", "access", "aristotle", "authority", "bypassing", "school", "reproduced", "studied", "commented", "becoming", "effect", "alternative", "school", "commonly", "reproduced", "version", "lefèvre", "paraphases", "philosophiae", "naturalis", "included", "example", "josse", "clichtove", "extensive", "commentary", "lefèvre", "introduction", "logical", "mathematical", "work", "likewise", "accompanied", "similar", "supercommentaries", "circle", "fabrists", "might", "seen", "sense", "unwitting", "humanist", "via", "renaissance", "philosophical", "roadmap", "4", "philosophical", "theme", "lefèvre", "place", "map", "late", "medieval", "renaissance", "philosophy", "difficult", "pinpoint", "single", "key", "doctrine", "even", "single", "work", "never", "composed", "synthetic", "systematic", "overview", "philosophy", "write", "large", "commentary", "select", "individual", "question", "major", "university", "philosopher", "preceding", "century", "jean", "buridan", "paul", "venice", "following", "theme", "thus", "represent", "state", "current", "research", "synoptic", "perspective", "lefèvre", "philosophical", "position", "41", "logic", "logic", "dialectic", "lefèvre", "belongs", "tradition", "going", "lorenzo", "valla", "rudolph", "agricola", "juan", "luis", "vives", "peter", "ramusin", "1508", "lefèvre", "also", "published", "dialectica", "byzantine", "émigré", "humanist", "george", "trebizond", "figure", "sought", "diminish", "hold", "scholastic", "logic", "philosophy", "replace", "clearer", "simpler", "logic", "would", "respect", "ordinary", "meaning", "word", "point", "thing", "world", "standard", "logical", "curriculum", "roughly", "organized", "around", "two", "phase", "reception", "aristotle", "work", "first", "old", "logic", "logica", "vetus", "comprised", "several", "work", "inherited", "late", "antiquity", "primarily", "boethius", "translation", "commentary", "aristotle", "category", "interpretation", "well", "porphyry", "isagoge", "complete", "list", "available", "work", "see", "ebbesen", "1977", "105", "twelfth", "century", "second", "group", "work", "either", "newly", "read", "long", "neglect", "aristotle", "prior", "analytics", "topic", "sophistic", "refutation", "newly", "translated", "arabic", "source", "importantly", "aristotle", "prior", "analytics", "marrone", "2010", "66", "ashworth", "2010", "161", "together", "second", "group", "made", "new", "logic", "logica", "nova", "turn", "became", "source", "handbook", "textbook", "known", "late", "fifteenth", "century", "logic", "modern", "logica", "modernorum", "see", "de", "rijk", "196267", "fact", "late", "medieval", "university", "student", "encountered", "subject", "textbook", "tradition", "usually", "peter", "spain", "summule", "logicales", "little", "logicals", "first", "part", "summule", "dealt", "old", "logic", "category", "universal", "aristotelian", "category", "humanist", "philosopher", "like", "lefèvre", "reacted", "especially", "logica", "modernorum", "lefèvre", "short", "logical", "introduction", "supposition", "predicabilia", "division", "predicament", "enunciation", "fallacy", "obligation", "insolubilia", "1496b", "meant", "give", "student", "brief", "alternative", "summule", "instead", "making", "focus", "study", "1503", "lefèvre", "published", "edition", "introduction", "paraphrase", "commentary", "aristotle", "logical", "work", "rather", "valla", "done", "reconstructing", "old", "logic", "aristotle", "porphyry", "boethius", "ignoring", "logic", "modern", "logica", "modernorum", "categoremata", "sophismata", "insolubilia", "lefèvre", "tried", "clarify", "source", "old", "logic", "vasoli", "1968", "called", "logic", "disciplina", "disserendi", "1503a", "2r", "228v", "similar", "agricola", "earlier", "redefinition", "dialectic", "ar", "disserendi", "later", "taken", "ramus", "though", "lefèvre", "probably", "read", "agricola", "book", "first", "published", "1515", "see", "agricola", "1515", "cited", "mack", "1993", "346", "like", "agricola", "ramus", "later", "lefèvre", "divided", "logic", "three", "part", "proloquia", "judgement", "invention", "first", "part", "using", "work", "logica", "vetus", "classifies", "thing", "world", "according", "substance", "various", "quality", "considering", "proposition", "proloquia", "formed", "second", "third", "part", "belong", "logica", "nova", "area", "judgement", "prior", "analytics", "teach", "organize", "statement", "valid", "argument", "area", "invention", "topic", "sophistic", "refutation", "teach", "find", "subject", "matter", "form", "argument", "lefèvre", "terminology", "proloquia", "judgement", "invention", "lefèvre", "1503a", "228v", "though", "traditional", "say", "much", "agricola", "used", "ramus", "would", "also", "take", "agricola", "focused", "invention", "ramus", "would", "emphasize", "judgement", "contrast", "lefèvre", "thought", "first", "part", "logiccategorizing", "world", "according", "language", "substance", "quality", "proloquia", "porphyry", "isagoge", "aristotle", "categoriesneeded", "attention", "judge", "carefully", "thoroughly", "introduced", "source", "example", "instead", "offering", "complete", "paraphrase", "topic", "category", "prior", "posterior", "analytics", "lefèvre", "supplied", "scholia", "ad", "litteram", "format", "unusually", "brief", "even", "logic", "lefèvre", "therefore", "bestowed", "greatest", "energy", "first", "par", "proloquendi", "logic", "notion", "proloquium", "sometimes", "basic", "sense", "introduction", "eg", "1503a", "also", "used", "term", "technical", "sense", "axiom", "proper", "principle", "demonstration", "posterior", "analytics", "lefèvre", "glossed", "aristotle", "account", "principle", "demonstration", "dealing", "proloquia", "1503a", "189v", "see", "also", "187r", "thus", "emphasized", "logica", "vetus", "precisely", "hoped", "ground", "certainty", "knowledge", "trustworthy", "starting", "point", "contrast", "believed", "logica", "modernorum", "rhetorical", "portion", "organon", "topicsthe", "part", "properly", "called", "dialecticencouraged", "sophistic", "debate", "ie", "developing", "argument", "uncertain", "premise", "aristotle", "considered", "dialectic", "merely", "probable", "reasoning", "lefèvre", "put", "rather", "finding", "certain", "knowledge", "scientia", "deploys", "syllogism", "enthymemes", "topical", "dialectic", "useful", "directing", "opinion", "mean", "le", "certain", "technique", "well", "induction", "example", "libri", "logicorum", "1503a", "229v", "aristotle", "said", "subject", "topic", "exercise", "colloquy", "discipline", "according", "philosophy", "lefèvre", "meant", "topic", "appropriate", "entertainment", "exercise", "ought", "understand", "school", "contest", "done", "literary", "game", "colloquy", "happens", "conversation", "dining", "together", "engage", "one", "another", "way", "discoursing", "purpose", "recreation", "usefulness", "discipline", "according", "philosophy", "science", "make", "various", "part", "aristotle", "philosophy", "exercitationes", "conflictus", "gymnasticos", "qui", "ludo", "litterario", "fiunt", "intelligere", "debemus", "colloquium", "ut", "cum", "confabulando", "aut", "convivando", "aut", "huiusmodi", "congressionibus", "ocurrit", "quicque", "aut", "recreationis", "aut", "alicuius", "utilitatis", "gratia", "disserendum", "discipline", "secundum", "philosophiam", "sunt", "scientie", "que", "partes", "sunt", "ipsius", "philosophie", "1503a", "229v", "lefèvre", "thus", "emphasize", "root", "logic", "rhetorical", "structure", "ordinary", "discourse", "agricola", "valla", "might", "done", "nauta", "2009", "instead", "focused", "starting", "point", "principia", "proloquia", "ground", "reasoning", "importance", "assigns", "proloquia", "seems", "connected", "pedagogically", "sensitive", "introduction", "intended", "convey", "clear", "immediate", "learning", "foundational", "principle", "discipline", "art", "utility", "method", "also", "appears", "rooted", "metaphysical", "assumption", "universal", "harmony", "analogy", "annotation", "hermes", "trismegistus", "lefèvre", "stressed", "harmonious", "structure", "creation", "reflected", "symmetry", "macrocosm", "microcosm", "lefèvre", "1505b", "discussed", "harmonious", "structure", "justified", "making", "inference", "one", "domain", "another", "42", "question", "universal", "since", "nineteenth", "century", "lefèvre", "often", "thought", "nominalist", "sort", "evidence", "two", "kind", "wrote", "short", "introduction", "topic", "found", "peter", "spain", "summule", "logicales", "prantl", "1870", "4278280", "implied", "sympathy", "genre", "vasoli", "1959", "233", "expanded", "trace", "nominalist", "formation", "vasoli", "also", "quoted", "renaudet", "cited", "student", "note", "beatus", "rhenanus", "recorded", "lefèvre", "view", "nominalist", "position", "universal", "vera", "et", "pulchra", "vasoli", "1959", "226", "renaudet", "1953", "131", "yet", "lefèvre", "actual", "position", "much", "ambiguous", "one", "indication", "short", "introductiones", "logic", "intended", "help", "student", "bypass", "new", "terminist", "approach", "discipline", "moreover", "although", "appreciated", "certain", "nominalist", "position", "hardly", "show", "believed", "universal", "simply", "matter", "convention", "instead", "sought", "via", "medium", "often", "example", "note", "porphyry", "isagoge", "lefèvre", "observed", "two", "extreme", "error", "speaking", "aristotle", "category", "substance", "consider", "thing", "completely", "ignoring", "notion", "reason", "others", "care", "notion", "reason", "entirely", "flee", "thing", "consideration", "thing", "neither", "former", "latter", "ever", "genuinely", "understand", "aristotle", "author", "quidam", "enim", "re", "solas", "considerantes", "notiones", "rationesque", "prorsus", "abnuunt", "alii", "solas", "notiones", "rationesque", "curantes", "re", "ipsas", "rerumque", "considerationes", "penitus", "refugiunt", "et", "neque", "hi", "neque", "illi", "poterunt", "unquam", "sincere", "aristotelem", "ceterosque", "auctores", "intelligere", "1503a", "22rv", "instead", "penetrate", "analogy", "realize", "discipline", "deal", "different", "subject", "logician", "address", "word", "name", "looking", "thing", "mirror", "natural", "philosopher", "address", "thing", "pursuing", "via", "medium", "problem", "universal", "lefèvre", "followed", "boethius", "first", "latin", "set", "term", "medieval", "debate", "topicas", "lefèvre", "put", "whole", "latin", "school", "owes", "much", "boethius", "rhetoric", "owes", "cicero", "cui", "boetii", "latine", "philosophie", "schola", "tantum", "debet", "quantum", "tullius", "rhetorice", "1503a", "6v", "tradition", "began", "prooemium", "porphyry", "isagoge", "explicitly", "refused", "discus", "whether", "genus", "specie", "depend", "thought", "alone", "incorporeal", "inseparable", "realist", "interpretation", "universal", "would", "itthat", "discussion", "left", "said", "greater", "work", "medieval", "tradition", "followed", "boethius", "reading", "isagoge", "introduction", "aristotle", "category", "took", "porphyry", "skirting", "ontological", "status", "genus", "specie", "invitation", "explore", "universal", "boethius", "adopted", "moderate", "realist", "position", "universal", "second", "commentary", "isagoge", "argued", "mind", "abstract", "universal", "concrete", "reality", "abstraction", "involves", "gathering", "collecting", "likeness", "similitudo", "concrete", "individual", "thing", "boethius", "claimed", "understood", "way", "universal", "certain", "kind", "separate", "incorporeal", "reality", "genus", "specie", "subsist", "one", "way", "grasped", "intellect", "another", "way", "incorporeal", "joined", "sensible", "thing", "subsist", "sensible", "thing", "grasped", "intellect", "subsisting", "anything", "else", "quotation", "marenbon", "2003", "30", "see", "also", "nauta", "2009", "38", "lefèvre", "sensitive", "divergence", "porphyry", "boethius", "highlighted", "porphyry", "approach", "universal", "isagoge", "namely", "question", "platonic", "genus", "specie", "matter", "ideas", "lefèvre", "followed", "porphyry", "turning", "question", "logic", "see", "porphyry", "teach", "place", "dealing", "sought", "elsewhere", "namely", "metaphysics", "et", "questiones", "de", "generibus", "et", "speciebus", "platonicis", "que", "ad", "materiam", "idearum", "pertinent", "sed", "discutiendi", "locus", "ut", "scite", "porphyrius", "ammonet", "alio", "ex", "loco", "metaphysica", "scilicet", "est", "expectandus", "1503a", "2r", "page", "later", "described", "boethius", "differed", "porphyry", "issue", "saying", "assumed", "boethius", "considered", "notion", "concept", "whereas", "porphyry", "considered", "thing", "subject", "igitur", "notionem", "rationemque", "boetius", "rem", "autem", "ipsam", "et", "ipsum", "subiectum", "considerasse", "ponendus", "esset", "porphyrius", "1503a", "6v", "thus", "lefèvre", "moderate", "realist", "position", "regard", "universal", "distinct", "concept", "notion", "rationes", "notiones", "similar", "terminology", "discussed", "de", "libera", "1996", "48", "moderate", "realist", "position", "lefèvre", "resolutely", "emphasizing", "auctores", "rarely", "deploys", "authorial", "voice", "argue", "fabrist", "position", "note", "aristotle", "category", "however", "dealing", "key", "category", "substance", "lefèvre", "present", "rare", "quasitreatise", "short", "dialogue", "universal", "two", "student", "ancient", "academy", "chrysippus", "entitled", "margin", "disceptatio", "de", "universali", "1503a", "23v", "course", "amiable", "debate", "disputant", "use", "aristotle", "distinction", "primary", "secondary", "substance", "consider", "status", "universal", "specie", "genus", "one", "youth", "present", "view", "universal", "particular", "class", "thing", "share", "youth", "argues", "universal", "fact", "reason", "say", "shareuniversals", "word", "decided", "convention", "position", "stand", "end", "dialogue", "look", "something", "like", "boethius", "moderate", "realism", "youth", "agree", "something", "conceptual", "added", "quality", "thing", "word", "signifying", "thing", "give", "name", "man", "look", "thing", "properly", "name", "thing", "specie", "universal", "simply", "without", "addition", "instead", "addition", "namely", "universal", "reason", "proinde", "cum", "hominem", "nomino", "et", "rem", "ipsam", "respicio", "non", "proprie", "rem", "illam", "aut", "speciem", "aut", "universalem", "appello", "et", "simpliciter", "et", "sine", "addito", "sed", "cum", "additoscilicet", "universalem", "ratione", "1503a", "23v", "moderate", "realism", "resurfaces", "lefèvre", "account", "aristotle", "category", "quantity", "choose", "one", "example", "category", "aristotle", "primarily", "recapitulated", "commonly", "held", "ancient", "distinction", "discrete", "number", "continuous", "magnitude", "lefèvre", "commentary", "however", "recall", "aristotle", "divided", "number", "two", "kind", "counting", "number", "numerantia", "counted", "number", "numerata", "distinction", "taken", "physic", "iv10", "219b510", "lefèvre", "us", "context", "aristotle", "category", "suggest", "number", "extramental", "existence", "universalsnot", "merely", "product", "mental", "abstraction", "aristotle", "held", "aristotle", "experience", "counted", "number", "two", "ice", "cream", "two", "leg", "abstract", "experience", "counting", "number", "2", "exists", "abstractly", "lefèvre", "picture", "quite", "complete", "take", "account", "people", "share", "experience", "countingwhile", "may", "apply", "counting", "number", "countable", "object", "way", "concept", "reason", "ratio", "shared", "different", "mind", "offer", "third", "category", "hence", "counting", "number", "counted", "number", "number", "counting", "number", "mind", "applying", "number", "thing", "counted", "number", "thing", "mind", "properly", "suitably", "applies", "number", "number", "discrete", "concept", "counting", "unde", "sunt", "numerantia", "sunt", "numerata", "sunt", "numeri", "numerantia", "sunt", "anime", "numeros", "suos", "rebus", "applicantes", "numerata", "sunt", "ea", "quibus", "anima", "numeros", "apte", "accommodeque", "applicat", "numeri", "sunt", "discrete", "ille", "rationes", "numerandi", "1503a", "27r", "third", "category", "reason", "concept", "rationes", "counting", "similar", "boethius", "view", "universal", "real", "notion", "lefèvre", "suggest", "number", "extramental", "reality", "sense", "affirms", "point", "line", "later", "repeating", "ancient", "view", "number", "multiple", "primordial", "unity", "something", "shared", "unit", "1", "counting", "mind", "unit", "1", "single", "palm", "counted", "length", "underlying", "shared", "unity", "indicates", "true", "number", "ie", "2", "3", "etc", "gathered", "composed", "unit", "way", "belongs", "merely", "mind", "physical", "world", "unde", "fit", "ut", "non", "sola", "mente", "sufficiat", "unitas", "ad", "numerandum", "perinde", "ac", "unus", "palmus", "ad", "dimetiendum", "id", "quod", "etiam", "multorum", "fuerit", "palmorum", "sed", "sunt", "veri", "numeri", "ex", "unitatibus", "coacervati", "compositique", "1503a", "27r", "lefèvre", "language", "number", "composed", "unit", "commonplace", "serf", "realist", "interpretation", "aristotle", "category", "discrete", "quantity", "discussed", "next", "section", "category", "quantity", "language", "measuring", "occupied", "central", "place", "lefèvre", "approach", "aristotle", "natural", "philosophy", "43", "natural", "philosophy", "seen", "first", "published", "paraphrase", "1492", "lefèvre", "reorganized", "natural", "philosophy", "influence", "ermolao", "barbaro", "translation", "themistius", "paraphrase", "aristotle", "epitome", "physic", "heaven", "parva", "naturalia", "soul", "discipline", "difficult", "identify", "cohesive", "distinctive", "set", "fabrist", "doctrine", "work", "explicit", "goal", "digest", "aristotle", "faithfully", "identify", "counter", "potential", "rival", "characteristically", "paraphrase", "physic", "begin", "diagram", "term", "basic", "aristotelian", "natural", "philosophy", "element", "four", "cause", "nature", "many", "kind", "motion", "problematic", "term", "place", "vacuum", "infinite", "time", "paraphrase", "proceeds", "reorganize", "aristotle", "doctrine", "opinion", "conclusion", "argumentsand", "occasionally", "question", "doubtswhich", "closely", "follow", "contour", "aristotle", "work", "nevertheless", "distinctive", "emphasis", "surface", "paraphrase", "lefèvre", "distinctive", "framing", "natural", "philosophy", "within", "goal", "rather", "constituent", "part", "attention", "larger", "philosophical", "role", "particular", "discipline", "led", "scholar", "dismiss", "safely", "wrapped", "cloud", "mysticism", "eg", "guerlac", "1979", "31", "fact", "careful", "methodological", "distinction", "end", "account", "book", "1", "physic", "example", "refuse", "answer", "question", "whether", "thing", "produced", "one", "many", "form", "lefèvre", "clearly", "tempted", "topic", "discus", "christian", "creator", "determinedly", "remains", "within", "boundary", "natural", "reason", "belongs", "first", "philosophy", "let", "wait", "right", "time", "study", "primo", "philosophi", "est", "et", "illud", "tempus", "id", "querendum", "differatur", "lefèvre", "1502a", "20v", "methodological", "restriction", "intended", "keep", "student", "applying", "limited", "tool", "logic", "natural", "philosophy", "indiscriminately", "thus", "confusing", "instead", "clarifying", "knowledge", "reflection", "natural", "philosophy", "offer", "trace", "divine", "philosophy", "job", "draw", "student", "reflect", "example", "higher", "goal", "natural", "philosophy", "found", "lefèvre", "dialogue", "introduction", "physic", "dialogus", "physice", "introductionis", "intended", "present", "basic", "term", "convince", "student", "value", "discipline", "discussion", "physical", "element", "lead", "consider", "length", "chain", "natureand", "teacher", "dialogue", "student", "request", "selfconsciously", "digresses", "chain", "order", "suggest", "highest", "activity", "humanity", "highest", "part", "nature", "contemplate", "heavenly", "reality", "discussion", "final", "cause", "lead", "lefèvre", "sum", "point", "exercise", "son", "end", "philosophy", "whole", "endeavor", "aristotle", "philosopher", "prepare", "u", "correct", "notion", "sensible", "thing", "rather", "distant", "likeness", "external", "thing", "enter", "intelligible", "world", "hence", "insofar", "lead", "u", "know", "blessed", "place", "hic", "fili", "nostre", "philosophie", "finis", "hic", "totus", "aristotelis", "et", "philosophorum", "conatus", "ex", "rectum", "rerum", "sensibilium", "cognitione", "ut", "ex", "eternorum", "quibusdam", "remotissimis", "simulacris", "mundi", "intelligibilis", "nobis", "parare", "introitum", "et", "hinc", "no", "utcumque", "possunt", "ducere", "nostrum", "scilicet", "felicem", "regionem", "cognoscere", "lefèvre", "1502a", "124r", "wrongly", "foliated", "123", "attain", "happy", "goal", "student", "philosophy", "first", "must", "wade", "detail", "natural", "philosophy", "lefèvre", "natural", "philosophy", "also", "distinctive", "attention", "mathematical", "example", "dialogue", "physic", "displayed", "far", "autonomy", "aristotle", "shorter", "introduction", "paraphrase", "introductory", "dialogue", "difficult", "physic", "dialogus", "difficilium", "physicalium", "introductorius", "began", "squarely", "problem", "quantity", "never", "departing", "dramatically", "aristotelian", "discussion", "matter", "weight", "rarefaction", "condensation", "intension", "remission", "quality", "step", "lefèvre", "offer", "point", "line", "ratio", "example", "interlocutor", "marvel", "learned", "philosophize", "quality", "quantity", "per", "quantitatem", "de", "qualitate", "philosophor", "lefèvre", "1502a", "146v", "take", "example", "lefèvre", "discussion", "intension", "remission", "quality", "introductory", "dialogue", "difficult", "physic", "question", "interesting", "despite", "aristotle", "meager", "account", "physic", "v2226b18", "became", "foundational", "question", "medieval", "natural", "philosophy", "moreover", "fourteenth", "century", "calculatores", "oxford", "parisian", "natural", "philosopher", "nicole", "oresme", "used", "mathematics", "clarify", "thinking", "topic", "notion", "remission", "intension", "meant", "explain", "quality", "change", "gradually", "experience", "order", "resolve", "problem", "necessary", "ask", "several", "question", "quality", "form", "different", "quality", "form", "mix", "together", "subject", "change", "involve", "series", "new", "form", "succession", "theory", "instead", "changing", "mixture", "quality", "gray", "object", "mix", "white", "dark", "contrary", "admixture", "theory", "quality", "gradually", "change", "infinitesimal", "part", "gained", "lost", "addition", "theory", "range", "position", "see", "kirschner", "2000", "di", "liscia", "2010", "difficult", "physic", "lefèvre", "view", "seems", "quality", "form", "since", "never", "call", "anything", "quality", "view", "similar", "buridan", "oresme", "see", "kirschner", "2000", "moreover", "seems", "adopt", "version", "addition", "theory", "quality", "intensified", "adding", "another", "part", "degree", "quality", "finally", "argues", "contrary", "subject", "limited", "waya", "certain", "amount", "one", "quality", "would", "drive", "expellere", "excess", "given", "scale", "heat", "minimum", "maximum", "say", "1", "10", "one", "could", "also", "imagine", "similar", "scale", "cold", "10", "1", "maximal", "cold", "could", "coincide", "maximal", "heat", "low", "heat", "1", "would", "coincide", "strong", "cold", "9", "increasing", "heat", "4", "would", "expel", "cold", "reducing", "6", "example", "lefèvre", "repeatedly", "claim", "applies", "quantitative", "reasoning", "quality", "therefore", "see", "philosophize", "dimension", "philosophize", "quality", "also", "vice", "versa", "philosophize", "quality", "philosophize", "dimension", "vides", "ergo", "quomodo", "philosophari", "de", "dimensionibus", "est", "de", "qualitatibus", "philosophari", "et", "retro", "agitur", "de", "qualitatibus", "philosophari", "est", "philosophari", "de", "dimensionibus", "1502a", "145r", "easy", "however", "see", "exactly", "quantity", "mean", "context", "clarification", "gained", "argument", "quantity", "subject", "limited", "contrary", "illustrates", "quasigeometrical", "figure", "representing", "twin", "scale", "hot", "cold", "mentioned", "imago", "range", "heat", "object", "minimum", "maximum", "heat", "arranged", "along", "line", "ak", "figure", "us", "reductio", "ad", "absurdum", "smallest", "amount", "coldness", "l", "object", "lu", "figure", "added", "maximum", "heat", "k", "new", "degree", "heat", "x", "would", "added", "original", "object", "create", "new", "maximum", "abcdegfhikx", "lmnopqrstu", "x", "impossible", "new", "maximum", "x", "would", "greater", "previous", "maximum", "k", "absurda", "maximum", "increased", "therefore", "concludes", "amount", "contrary", "limited", "absolute", "maximum", "degree", "quality", "measured", "quality", "contrary", "consequently", "intensified", "object", "beyond", "maximum", "limit", "undeniable", "quantitative", "feature", "argument", "comparable", "geometrical", "intuition", "animated", "fourteenthcentury", "theorist", "oresme", "time", "quality", "heat", "cold", "reimagined", "mathematical", "object", "still", "firmly", "realm", "aristotelian", "natural", "philosophy", "indeed", "point", "example", "defend", "rather", "undermine", "aristotle", "account", "contrary", "found", "inter", "alia", "topic", "2", "like", "predecessor", "instead", "making", "natural", "philosophy", "mathematical", "lefèvre", "used", "mathematics", "clarify", "exemplify", "aristotelian", "physical", "concept", "example", "see", "oosterhoff", "2018", "190199", "lefèvre", "mathematical", "example", "natural", "philosophy", "remarkable", "elsewhere", "disparaged", "calculatores", "followed", "tradition", "thomas", "bradwardine", "lefèvre", "1510", "2r", "rice", "1972", "227", "clearly", "oppose", "mathematical", "nature", "socalled", "merton", "school", "natural", "philosophy", "rather", "certain", "aspect", "exposition", "lefèvre", "mistrusted", "genre", "calculatores", "famous", "sophismata", "saw", "mere", "logical", "puzzle", "sophistry", "rather", "truthtelling", "examplesa", "prejudice", "perhaps", "inherited", "ermolao", "barbaro", "dionisotti", "1955", "suggests", "lefèvre", "thought", "use", "mathematical", "reasoning", "natural", "philosophy", "differentthat", "sophistry", "truly", "depicted", "nature", "source", "lefèvre", "mathematical", "approach", "natural", "philosophy", "among", "fourteenthcentury", "calculatores", "one", "possibility", "school", "albertists", "became", "especially", "powerful", "fifteenthcentury", "paris", "partly", "opposition", "nominalist", "calculatores", "believed", "profaned", "university", "kaluza", "1988", "albertist", "textbook", "tradition", "natural", "philosophy", "placed", "high", "value", "mathematics", "understanding", "physical", "world", "hoenen", "1993", "328330", "compelling", "similarity", "lefèvre", "albertists", "found", "psychology", "albertists", "lefèvre", "expressly", "valued", "mathematics", "thought", "provided", "training", "rational", "abstraction", "lefèvre", "put", "introductory", "dialogue", "difficult", "physic", "soul", "unique", "medium", "higher", "lower", "thing", "rationally", "measure", "dimetiri", "bodily", "world", "abstract", "term", "1502a", "128v", "albertists", "valued", "mathematical", "object", "example", "separate", "substance", "mind", "thinkwithout", "depending", "physical", "image", "phantasm", "standard", "aristotelian", "picture", "intellection", "began", "sens", "provide", "phantasm", "taken", "intellect", "singular", "concrete", "specie", "intellectual", "specie", "commentator", "commonly", "distinguished", "second", "movement", "soul", "reflects", "first", "activity", "second", "moment", "soul", "produce", "abstract", "universal", "notion", "question", "arises", "intellect", "think", "separable", "object", "without", "depending", "sensible", "phantasm", "albertists", "believed", "could", "inspired", "neoplatonic", "perspective", "pseudodionysius", "areopagite", "averroes", "fifthcentury", "paraphrast", "themistius", "subscribed", "doctrine", "soul", "know", "separate", "substance", "without", "mediation", "physical", "image", "position", "defended", "standard", "view", "possible", "found", "early", "fifteenthcentury", "polemical", "work", "heymeric", "de", "campo", "problem", "albert", "great", "saint", "thomas", "problemata", "inter", "albertum", "magnum", "et", "sanctum", "thomam", "cologne", "1496", "37r46r", "basic", "handbook", "natural", "philosophy", "hoenen", "1993", "332333", "see", "also", "park", "1980", "lefèvre", "explicitly", "place", "account", "soul", "within", "albertist", "tradition", "certainly", "make", "room", "describing", "object", "intellect", "note", "separable", "object", "considered", "way", "exist", "exist", "entirely", "separate", "matter", "matter", "entirely", "irrelevant", "considering", "unde", "fit", "ut", "quomodo", "re", "separabiles", "sint", "eo", "modo", "ea", "contempletur", "si", "enim", "omnino", "abiuncte", "sint", "omnino", "materiam", "sua", "contemplatione", "reiicit", "1502a", "341v", "see", "also", "spruit", "1995", "3841", "commentary", "passage", "josse", "clichtove", "explained", "four", "mode", "intellection", "fourth", "understands", "abstractly", "universally", "intellect", "take", "nothing", "sens", "quartus", "est", "modus", "intelligendi", "abstracte", "et", "universaliter", "et", "hunc", "intellectus", "sensu", "minime", "accipit", "1502a", "343v", "explained", "mathematical", "object", "offer", "paradigm", "case", "separable", "intelligible", "object", "affinity", "neoplatonic", "perspective", "raise", "question", "whether", "lefèvre", "influenced", "new", "latin", "version", "greek", "commentator", "especially", "themistius", "whose", "paraphrase", "aristotle", "translated", "barbaro", "certainly", "aware", "new", "text", "invoke", "authority", "take", "side", "debate", "seen", "themistius", "neoplatonic", "source", "light", "imagery", "explaining", "relation", "active", "passive", "intellect", "based", "aristotle", "tantalizingly", "short", "comment", "soul", "iii5", "mahoney", "1982", "lefèvre", "argue", "unity", "intellect", "explaining", "active", "passive", "intellect", "power", "potentie", "faculty", "also", "used", "themistian", "image", "light", "explain", "agent", "intellect", "act", "passive", "intellect", "1502a", "344v", "never", "mention", "themistius", "topicand", "similarity", "may", "due", "broader", "medieval", "commentary", "tradition", "access", "themistius", "paraphrase", "soul", "william", "moerbeke", "translation", "since", "thirteenth", "century", "lefèvre", "psychology", "put", "tradition", "ramon", "lull", "nicholas", "cusa", "hospitable", "platonic", "view", "universalssuch", "thinker", "adopted", "psychology", "especially", "open", "mathematical", "metaphor", "example", "universal", "cognition", "nevertheless", "lefèvre", "never", "identified", "platonist", "oosterhoff", "2019b", "44", "moral", "philosophy", "aristotle", "moral", "philosophy", "treatisesthe", "ethic", "economics", "politicsthat", "lefèvre", "wrote", "fullscale", "commentary", "addition", "brief", "ar", "moralis", "introduction", "aristotle", "ethic", "1494b", "devoted", "considerable", "energy", "making", "available", "recent", "translation", "aristotle", "nicomachean", "ethic", "byzantine", "émigré", "johannes", "argyropolus", "florentine", "humanist", "leonardo", "bruni", "well", "old", "translation", "known", "robert", "grosseteste", "1497", "beginning", "tradition", "editing", "philosophical", "work", "would", "span", "sixteenth", "century", "lefèvre", "typically", "encouraged", "reader", "compare", "text", "publishing", "three", "translation", "ethic", "together", "one", "volume", "commentary", "accompanied", "translation", "argyropolus", "edition", "commentary", "seen", "origin", "distinctively", "humanist", "tradition", "moral", "philosophy", "kraye", "1995", "104105", "lefèvre", "engagement", "ethic", "limited", "recovery", "aristotle", "like", "many", "renaissance", "philosopher", "began", "treatment", "discipline", "anthropology", "man", "microcosm", "little", "world", "mirror", "encompasses", "feature", "greater", "world", "macrocosm", "theme", "resurfaced", "paraphrase", "physic", "especially", "notae", "hermes", "trismegistus", "ethical", "behavior", "intellectual", "harmony", "god", "universe", "mirrored", "human", "intellectual", "communitiesperhaps", "lefèvre", "seen", "promoting", "monastic", "rather", "civic", "humanism", "stegmann", "1973", "early", "synoptic", "introduction", "ethic", "1494b", "closely", "follows", "major", "division", "aristotle", "treatise", "lefèvre", "begin", "description", "ethical", "life", "one", "learned", "virtue", "acquired", "long", "habituation", "rather", "innate", "human", "soul", "humanity", "posse", "many", "kind", "good", "exterior", "acquired", "interior", "given", "nature", "useful", "good", "instrumental", "pursuing", "good", "virtue", "defined", "habitus", "soul", "perfecting", "directing", "work", "good", "duty", "action", "virtue", "virtu", "est", "anime", "habitus", "ipsam", "perficiens", "atque", "eius", "opus", "bonum", "reddens", "officium", "est", "virtutis", "operatio", "1507", "3v", "remainder", "introduction", "discus", "moral", "virtue", "pertaining", "active", "life", "liberality", "friendship", "followed", "intellectual", "virtue", "heroic", "virtue", "turn", "lead", "final", "topic", "contemplative", "happiness", "lefèvre", "present", "conviction", "human", "fulfillment", "happiness", "fully", "achieved", "contemplation", "divine", "mattersa", "point", "agreement", "believed", "aristotle", "christianity", "lefèvre", "therefore", "went", "beyond", "mere", "ad", "fontes", "search", "pure", "aristotle", "discipline", "moral", "philosophy", "presented", "aristotle", "authority", "useful", "christian", "notae", "ethic", "filled", "exempla", "carefully", "selected", "roman", "poet", "especially", "horace", "virgil", "ovid", "virtue", "gentile", "regularly", "presage", "christian", "morality", "according", "lefèvre", "instance", "pythagorean", "roman", "ideal", "chaste", "virginity", "helpful", "urging", "temperance", "illustrate", "excellence", "ancient", "moral", "lefèvre", "quoted", "ovid", "metamorphosis", "1536736", "water", "river", "clitorius", "caused", "men", "flee", "wine", "ovid", "evoked", "image", "discussion", "pythagorean", "way", "life", "leading", "lefèvre", "reflect", "dama", "virgin", "daughter", "pythagoras", "well", "chaste", "selfsacrifice", "lucretia", "heroic", "spartan", "virgin", "killed", "raped", "observing", "value", "virginity", "foreign", "christian", "know", "virgin", "birth", "lefèvre", "went", "contrast", "image", "intemperance", "false", "virginity", "harpy", "virgil", "aeneid", "3214218", "see", "notae", "ne", "iii10", "1497", "d7v", "time", "lefèvre", "even", "us", "notae", "reframe", "aristotle", "entirely", "reorients", "discussion", "last", "book", "ethic", "aristotle", "begin", "question", "whether", "pleasure", "supreme", "ethical", "goal", "recalling", "new", "testament", "image", "jesus", "christ", "rebuking", "scribe", "pharisee", "hypocrisy", "living", "good", "true", "life", "lefèvre", "asserts", "primarily", "uniting", "word", "deed", "simplicity", "wise", "useful", "life", "eloquence", "et", "simplicitatem", "sapientum", "eloquentia", "ad", "vitam", "esse", "efficaciorem", "1497", "m7v", "reminded", "reader", "true", "pleasure", "lefèvre", "rehearses", "aristotle", "argument", "strategy", "typical", "many", "note", "alert", "reader", "christian", "use", "context", "passage", "present", "author", "meaning", "rather", "bowdlerizing", "generally", "prefers", "frame", "pagan", "wisdom", "christian", "structure", "lefèvre", "aggressively", "retooled", "ancient", "philosophy", "contemporary", "concern", "however", "dealing", "plato", "ethical", "philosophy", "proceeded", "editor", "alongside", "aristotle", "politics", "economics", "lefèvre", "presented", "one", "enigmatic", "work", "hecatonomiae", "1506", "seven", "hundred", "line", "loosely", "taken", "marsilio", "ficino", "translation", "plato", "law", "600", "line", "republic", "100", "line", "reconstructed", "something", "like", "platonic", "dialogue", "complement", "aristotle", "work", "purpose", "seems", "primarily", "pedagogical", "present", "plato", "safe", "student", "consumption", "complete", "occasional", "marginal", "admonition", "beware", "caute", "list", "platonic", "opinion", "rejected", "possessing", "woman", "child", "common", "work", "represented", "part", "plato", "aristotle", "frequently", "discussed", "moral", "philosophy", "therefore", "evidently", "found", "useful", "lefèvre", "explained", "prefatory", "letter", "rice", "1972", "156", "cf", "boisset", "1973", "without", "apology", "aristotle", "plato", "45", "metaphysics", "throughout", "commentary", "epitome", "lefèvre", "often", "briefly", "observes", "finding", "particular", "discipline", "metaphysical", "implication", "leaf", "line", "thought", "aside", "typically", "saying", "enough", "point", "de", "hac", "adhuc", "satis", "est", "implication", "meant", "treated", "metaphysics", "theology", "like", "many", "christian", "philosopher", "boethius", "lefèvre", "often", "identifies", "theology", "metaphysics", "oosterhoff", "2019a", "sense", "lefèvre", "belongs", "natural", "theological", "tradition", "see", "philosophical", "art", "studying", "trace", "divine", "natural", "world", "step", "leading", "upward", "divine", "matter", "put", "sidebyside", "edition", "medieval", "humanist", "translation", "euclid", "geometry", "1517a", "a2r", "reconstructive", "project", "could", "especially", "open", "creative", "synthetic", "impulse", "rice", "1970", "brilliantly", "captured", "lefèvre", "project", "suggesting", "ficino", "done", "plato", "lefèvre", "intended", "aristotle", "drawing", "longstanding", "medieval", "topos", "plato", "closest", "ancient", "philosopher", "christian", "truth", "ficino", "interpreted", "broadly", "line", "christian", "teaching", "drawing", "natural", "philosophy", "medicine", "mathematics", "day", "present", "healer", "soul", "celenza", "2007", "86", "early", "work", "aristotle", "lefèvre", "similarly", "presented", "aristotle", "thing", "discipline", "even", "theology", "logical", "work", "subtle", "rational", "physic", "worldly", "philosopher", "ethic", "entirely", "prudent", "active", "politics", "lawyer", "metaphysics", "priest", "theologian", "fuit", "namque", "logicis", "rationalis", "subtilissimus", "physicis", "mundanus", "philosophus", "ethicis", "totus", "prudens", "et", "activus", "polyticis", "iurisconsultus", "metaphysicis", "sacerdos", "atque", "theologus", "letter", "germain", "de", "ganay", "aristotelis", "ethica", "nicomachea", "introductio", "1494b", "a2r", "rice", "1970", "138", "lefèvre", "aristotle", "like", "ficino", "plato", "knew", "something", "christian", "god", "introduction", "metaphysics", "1494a", "d1v", "suggested", "aristotle", "prayed", "en", "entium", "begging", "mercy", "emphasis", "coherence", "aristotle", "work", "throughout", "art", "cycle", "agreement", "christianity", "sustained", "scholarship", "lefèvre", "student", "decade", "also", "meant", "lefèvre", "could", "find", "aristotle", "basis", "concord", "knowledge", "thus", "held", "together", "two", "potentially", "divergent", "approach", "editorial", "effort", "purify", "aristotle", "accompanied", "effort", "find", "pious", "metaphysical", "framework", "philosophy", "including", "element", "clearly", "belonged", "neoplatonic", "tradition", "first", "lefèvre", "encyclopedic", "project", "extended", "neoplatonic", "text", "revived", "ficino", "bessarion", "among", "others", "1494", "mentioned", "published", "ficino", "important", "translation", "writing", "attributed", "hermes", "trismegistus", "along", "short", "argumenta", "around", "time", "published", "de", "magia", "naturali", "drew", "ficino", "medical", "cosmology", "three", "book", "life", "well", "giovanni", "pico", "della", "mirandola", "cabbalistic", "interest", "1505", "optimism", "fruitfulness", "esoteric", "approach", "lessened", "pantin", "1988", "shown", "lefèvre", "1505", "edition", "hermetic", "corpus", "includes", "among", "addition", "caution", "unorthodox", "reading", "previous", "edition", "would", "next", "year", "recompiling", "plato", "law", "republic", "hecatonomiae", "1514", "produced", "major", "edition", "nicholas", "cusa", "arguably", "original", "philosopher", "fifteenth", "centuryand", "one", "certainly", "influenced", "plato", "lefèvre", "take", "history", "platonic", "philosophy", "allowed", "see", "nicholas", "twelfthcentury", "victorines", "among", "others", "representative", "distinctively", "christian", "form", "philosophy", "oosterhoff", "2019a", "2019b", "defended", "longstanding", "tradition", "particularly", "strong", "france", "dionysius", "areopagite", "regarded", "st", "paul", "athenian", "convert", "also", "original", "bishopmartyr", "brought", "christianity", "france", "explained", "similarity", "dionysius", "late", "ancient", "platonist", "iamblichus", "proclus", "theft", "part", "pagan", "philosopher", "lefèvre", "dionysius", "stood", "pauline", "fundamentally", "christian", "form", "insight", "beyond", "positive", "negative", "theology", "later", "platonist", "drawn", "tradition", "profound", "teaching", "suppressing", "source", "edition", "dionsyius", "divine", "name", "lefèvre", "adduced", "nicholas", "cusa", "scientie", "divine", "ignorantie", "science", "divine", "ignorance", "faithful", "reading", "dionysius", "suggesting", "dionysius", "source", "nicholas", "recognition", "positive", "negative", "statement", "god", "fall", "short", "since", "finite", "word", "capture", "infinite", "reality", "1499", "58v61r", "therefore", "lefèvre", "eye", "nicholas", "cusa", "modern", "representative", "authentic", "christian", "philosophy", "meieroeser", "1989", "3661", "5", "legacy", "lefèvre", "edition", "neoplatonic", "work", "became", "important", "right", "long", "encyclopedic", "repristination", "aristotle", "supplanted", "handbook", "like", "lutheran", "aristotelian", "philip", "melanchthon", "expanded", "edition", "hermetic", "corpus", "1505b", "with", "crater", "hermetis", "ludovico", "lazzarelli", "another", "book", "addition", "fourteen", "treatise", "known", "ficinobecame", "widely", "adopted", "text", "reprinted", "europe", "along", "annotation", "similarly", "edition", "commentary", "pseudodionysius", "areopagite", "read", "throughout", "sixteenth", "century", "edition", "cusanus", "remained", "standard", "opera", "omnia", "twentieth", "century", "discussed", "lefèvre", "regularly", "mentioned", "analogy", "way", "relate", "truth", "different", "domain", "seems", "never", "fleshed", "detail", "method", "obsession", "providing", "trustworthy", "step", "unified", "methodized", "pedagogically", "useful", "philosophy", "perhaps", "lasting", "legacyone", "would", "taken", "debate", "method", "textbook", "throughout", "sixteenth", "century", "schmitt", "1988", "fascination", "lefèvre", "student", "analogy", "mathematics", "offer", "glimpse", "early", "motivation", "find", "universal", "method", "later", "bloomed", "debate", "universal", "art", "rossi", "2000", "29", "39", "ong", "1958", "76", "timothy", "reiss", "first", "identified", "lefèvre", "circle", "early", "swell", "philosophical", "interest", "quadrivium", "sixteenth", "century", "reiss", "1997", "oronce", "fine", "particular", "extended", "lefèvre", "mathematical", "legacy", "pantin", "2009", "early", "seventeenth", "century", "author", "would", "put", "forward", "method", "strongly", "mathematical", "purported", "unify", "arithmetic", "geometry", "discipline", "mathesis", "universalis", "rabouin", "2009", "lefèvre", "could", "said", "inaugurated", "genre", "printed", "philosophical", "textbook", "position", "emerged", "oosterhoff", "2018", "lefèvre", "studentswith", "always", "worked", "closelytook", "project", "developed", "several", "direction", "frequently", "published", "work", "especially", "strassburg", "cologne", "paris", "rice", "1970", "noted", "several", "figure", "associated", "lefèvre", "set", "philosophical", "project", "rooted", "teaching", "notably", "josse", "clichtove", "charles", "de", "bovelles", "clichtove", "wrote", "many", "commentary", "lefèvre", "edition", "became", "important", "figure", "paris", "faculty", "theology", "bovelles", "deserves", "particular", "attention", "concerted", "effort", "develop", "fresh", "philosophical", "synthesis", "shared", "lefèvre", "core", "theme", "dignity", "mankind", "mirror", "nature", "human", "freedom", "distinctiveness", "intellectual", "faculty", "importance", "mathematics", "modeling", "philosophical", "perspective", "faye", "1998", "lefèvre", "effort", "provide", "student", "handbook", "field", "knowledge", "compared", "ramus", "philosophical", "reform", "student", "successive", "generation", "scholar", "carried", "forward", "lefèvre", "conviction", "renewal", "philosophy", "begin", "new", "translation", "philological", "work", "around", "1516", "student", "gerard", "roussel", "retranslated", "aristotle", "nicomachean", "ethic", "greek", "also", "wrote", "long", "philosophical", "commentary", "boethius", "1521", "picking", "pythagorean", "mathematical", "interest", "also", "motivated", "lefèvre", "reform", "university", "philosophy", "another", "student", "françois", "vatables", "later", "first", "royal", "professor", "hebrew", "collège", "royal", "similarly", "retranslated", "large", "part", "aristotelian", "corpus", "though", "study", "directly", "lefèvre", "symphorien", "champier", "fashioned", "idiosyncratic", "introduction", "philosophy", "janua", "1498", "liberally", "excerpting", "work", "later", "century", "lefèvre", "sustained", "wideranging", "effort", "make", "aristotle", "eloquent", "taken", "humanist", "translator", "philosopher", "denys", "lambin", "adrien", "turnèbe", "joachim", "périon", "lefèvre", "influenced", "history", "philosophy", "much", "deep", "relationship", "cultivated", "student", "ambitious", "use", "new", "technology", "printing", "press", "reinvent", "university", "philosophy", "curriculum"]}