{"url": "luther-influence", "title": "Luther’s Influence on Philosophy", "authorship": {"year": "Copyright © 2020", "author_text": "Robert Stern\n<r.stern@sheffield.ac.uk>", "author_links": [{"https://www.sheffield.ac.uk/philosophy/people/academic-staff/robert-stern": "Robert Stern"}, {"mailto:r%2estern%40sheffield%2eac%2euk": "r.stern@sheffield.ac.uk"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://www.sheffield.ac.uk/philosophy/people/academic-staff/robert-stern\" target=\"other\">Robert Stern</a>\n&lt;<a href=\"mailto:r%2estern%40sheffield%2eac%2euk\"><em>r<abbr title=\" dot \">.</abbr>stern<abbr title=\" at \">@</abbr>sheffield<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Wed Jul 22, 2020"], "preamble": "\n\nThe aim of this entry is to outline the impact of Martin Luther\n(1483–1546) on the philosophical tradition which came after him.\nThe Protestant Reformation as a whole undoubtedly had considerable\ninfluence in philosophy and not just theology, not least because many\nkey philosophical figures were themselves part of this religious\nheritage in its various forms, as well as being caught up in the major\nsocial and political changes and conflicts that the Reformation\nunleashed. However, to trace the influence of Luther himself\nspecifically is a more complex exercise, in part because other central\nReformation figures such as Philip Melanchthon (1497–1560) and\nJohn Calvin (1509–64) had their own\nimpact;[1] at\nthe same time, the Reformation itself took on a range of different\nforms even in Luther’s own lifetime and more strongly\nafterwards, many of which departed from Luther himself on key issues,\ndespite various attempts to arrive at some uniformity of doctrine.\nThis complexity, combined with the feeling that Luther was in some\nsense an “anti-philosopher” because of his hostile remarks\nconcerning the discipline, Aristotle, and reason, have led\nLuther’s influence within philosophy to be rather\nneglected.[2]\nNonetheless, the impact of his thinking on “modernity”\nmore generally has been much discussed (see §6), while recent\nscholarship has suggested it is a mistake to neglect Luther’s\ninfluence on philosophy more narrowly conceived, and that the\ndiscussion of his ideas (both positively and critically) can be seen\nto mark the philosophical tradition from the early modern period\nonwards in a distinctive way (see §§1–5). Naturally\nenough, this impact takes place most obviously in the countries of\nnorthern Europe, where the Reformation generally was spread most\neffectively.[3]\n", "toc": [{"#LuthEarlModePhil": "1. Luther and Early Modern Philosophy"}, {"#LuthKantPostKant": "2. Luther, Kant, and the Post-Kantians"}, {"#LuthKierNiet": "3. Luther, Kierkegaard, and Nietzsche"}, {"#LuthFeueMarx": "4. Luther, Feuerbach, and Marxism"}, {"#LuthHeidLogs": "5. Luther, Heidegger, and Løgstrup"}, {"#LuthMode": "6. Luther and “Modernity”"}, {"#Bib": "Bibliography"}, {"#AbbrForRefeLuthWork": "A. Abbreviations for references to Luther’s works"}, {"#BUsefCollSomeLuthMainWrit": "B. Useful collections of some of Luther’s main writings"}, {"#CPrimText": "C. Primary Literature by Others"}, {"#DSeco": "D. Secondary Literature"}, {"#OtheCiteWork": "Other Cited Works"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Luther and Early Modern Philosophy\n\nAt a general level, in this period Luther’s ideas had a role in\nshaping two key philosophical disputes of a broadly epistemological\nkind, one concerning the relation between philosophy and theology as\ndisciplines, and the other concerning the possibility of religious\ncertainty. The first can be illustrated by the so-called\n“Hofmann-streit” (or “Hofmann Controversy”)\nwhich took place at the University of Helmstedt in 1598, in which\nDaniel Hofmann (1538–1621) cited Luther to attack his\nphilosophical colleagues, which brought a response from the Scottish\nmathematician and physician Duncan Liddel (1561–1613) amongst\nothers (for further discussion, see Antognazza 1996 and Hunter 2006;\nfor the link to Liddel, see Regier 2016). Throughout the seventeenth\ncentury, the controversy had a major impact on the debate between\ntheology and philosophy and, in particular, on discussions surrounding\nthe so-called doctrine of double truth (see\n Luther entry §2).\n Pierre Bayle (1647–1706) devoted an article of his\nDictionaire historique et critique to the controversy, and\nGottfried Wilhelm Leibniz (1646–1716) discussed it repeatedly,\nincluding in the Nouveaux Essais and in the\nTheodicy.\n\nA second epistemological issue was also raised by Luther’s\nclaims for the priority of scripture over ecclesiastical authority,\nwhich Luther had argued (for example in The Bondage of the\nWill against Erasmus; see WA 18:603–14/LW 33:19–36)\nwould make possible a certainty that such authority lacked—but\nwhich as a method had itself proved problematic in settling disputes\nbetween Luther and those who challenged his scriptural interpretations\n(see\n Luther entry §2).\n As Richard Popkin (1979) has argued, this impasse led to significant\ndebates between subsequent Reformers and Catholics concerning which\napproach, if any, could avoid scepticism, or indeed if faith required\naccommodation with scepticism in some form (which Luther himself had\nvehemently denied against Erasmus: see\n Luther entry §4).\n\nAs well as providing an important context for these general debates,\nat a more individual level another prominent early modern philosopher\nwho responded to Luther’s thought was not only Leibniz, but also\nThomas Hobbes (1588–1679), where one concern that is central to\nboth is the question of free will, but other issues are also relevant.\nThis influence will now be considered in more detail, beginning with\nHobbes and then turning to Leibniz.\n\nWhile generally expressing admiration for Luther’s role in the\nReformation against what Hobbes saw as the evils of the Catholic\n Church,[4]\n the most direct use Hobbes makes of Lutheran ideas is in his\ncontroversy with John Bramhall, Bishop of Derry, over the issue of\nfree will. The two men were led into debate by the Marquess of\nNewcastle when the three were in exile in Paris in 1645, but following\nthe unauthorized publication of Hobbes’s contribution in 1654 as\nOn Liberty and Necessity, Bramhall himself published his own\nearlier strongly-worded contribution as A Defence of True Liberty\nfrom Antecedent and Extrinsical Necessity in the following year,\nto which Hobbes then replied in similarly strident terms, in his\nQuestions Concerning Liberty, Necessity, and Chance of 1656,\nto which Bramhall published a further response in 1658:\nCastigations of Mr Hobbes His Last Animadversions in the Case\nConcerning Liberty, and Universal\n Necessity.[5]\n\nBramhall makes his objections to Hobbes abundantly clear in the\nfollowing passage from his Defence of True Liberty:\n\n\nI hate this Doctrin from my heart and I believe both I have reason so\nto do, and all others who shall seriously ponder the horrid\nconsequences which flow from it. It destroyes liberty, and dishonours\nthe nature of man. It makes the second causes and outward objects to\nbe the Rackets, and Men to be but the Tennis-Balls of destiny. It\nmakes the first cause, that is, God Almighty, to be the introducer of\nall evill, and sin into the world, as much as Man, yea more than Man,\nby as much as the motion of the Watch is more from the Artificer, who\ndid make it and wind it up, than either from the springs, or the\nwheels, or the thred, if God by his special influence into the second\ncauses, did necessitate them to operate as they did. (Bramhall 1655:\n60) \n\n\nBramhall’s central concern was thus two-fold: first,\nHobbes’s determinism “dishonours the nature of man”\nby making him into nothing more than a “Tennis-Ball of\ndestiny”, while secondly it creates theological difficulties by\nentailing that God is as much the author of evil and sin as of good, a\nconclusion so abhorrent that if taken seriously, it could not but push\nright thinking people into atheism.\n\nFaced with this challenge, and fully accepting that his position\ntreated God as a first cause from which all else happens with\nnecessity, Hobbes appealed in his defence to the Reformation tradition\nin general, and Luther in particular, thus fighting a theological\ncritic with theological authorities. As we have seen from the\ndiscussion of The Bondage of the Will\n (Luther entry §4),\n Luther had faced similar forms of criticism from Erasmus, and so\nHobbes was able to make use of some of Luther’s replies to\nErasmus in responding to Bramhall. In particular, he employed\nLuther’s distinction between the necessity of immutability and\nthe necessity of constraint to argued that while human beings lack\nfree will, they are nonetheless not forced to sin against\ntheir will, and so can still have sin imputed to them (Hobbes 1656:\n§19(a), 1841: 259–60, 1999: 77–8; 1656: §20 (n),\n1841: 298, 1999: 79–80; see also WA 18:616 note/LW 33:39). And\nin response to the question that if God has power over us and so can\ndetermine our will, why he does not just use this power to make us\ngood, but instead punishes us when we are not, Hobbes makes the\nLutheran point that this is to try to hold God to human standards of\njustice and rightness; but it is a mistake to assume that these can\ncan be applied in this\n context.[6]\n While obviously dialectically effective to use Luther in this way to\nrefute a Bishop, and while the question of the nature of\nHobbes’s own religious commitments remains a matter of\n controversy,[7]\n Hobbes’s appeal to Luther in this manner is no mere\nopportunism, and shows an understanding of and familiarity with\nLuther’s writing on free will which is more than purely\nsuperficial.\n\nHowever, it can still be questioned whether by transposing these\nLutheran considerations into the context of his own mechanistic\nmaterialism, Hobbes could do them proper justice; and of course, for\nLuther the philosophical issues surrounding such materialism were of\nlittle concern, and nor is his conception of God merely that of the\nkind of “first mover” that he is taken to be by\n Hobbes.[8]\n There is thus no place in Hobbes’s account for what we have\nseen is so distinctive to Luther’s, namely that there is a kind\nof spiritual comfort to be found in the abandonment of the idea of\nfree choice, both in the way that the predestination that comes with\nit can make us more certain of God’s promises, and in the way it\nliberates us from the kind of anxiety we would feel if salvation\ndepended on our proper exercise of this choice. Moreover, as discussed in Luther entry §4, Luther has arguments against free choice that are\nindependent of any commitment to materialism, which rest instead on\nhis claim that there can be no “neutral” normative space\nfor the free will to exercise its choices as Erasmus had claimed: for\nit is either a good will which will see the good as its only option\nand so not be faced with any choice, or a bad will which thinks that\nthe bad is also an option it should consider, but then qua\nwill it is always turned away from the good and so has no choice in\nthis direction\n either.[9]\n As others have noted, these deeper aspects of Luther’s\nposition, which have nothing to do with Hobbes’s materialism, in\nthe end make their respective approaches to these questions very\ndifferent (see Damrosch 1979, Overhoff 1997).\n\nAs well as this issue of free will, it is also intriguing to consider\nanother point of connection between the two thinkers, namely the\ninfluence of Luther on Hobbes’s political and social philosophy,\nthough this issue is less explicitly documented through Hobbes’s\nworks than the previous one. Nonetheless, both shared a belief in the\nneed for a powerful state if the precariousness of life in a state of\nnature is to be avoided, given the lack of community between fallen\nindividuals, so that both can be said to offer similar justifications\nfor state authority, while then perhaps as a result being guilty of\ntending towards authoritarianism in their political thought. (For\nfurther comparison, see Kodalle 1990.)\n\nIf Hobbes’s materialism and (consequently) suspected atheism\nadds an interesting complexity to his relation to Luther, in\nLeibniz’s case a complexity is added through the latter’s\ncommitment to ecumenism (reflected in his Catholic\nDemonstrations project of 1668–69 and subsequent works),\nand his rationalism, on which some of his ecumenical plans were based,\nas he hoped that common ground between doctrinal differences might be\nbased on fresh insights made possible by new developments in\nphilosophy and the sciences. Nonetheless, as with Hobbes,\nnotwithstanding these divergences in Leibniz’s case, a clear\nLutheran influence and context is still to be found, traceable to his\nupbringing and education (see Goldenbaum 1988: 171; Antognazza 2009:\nChap 1), which drew him towards Lutheranism in a moderate form.\n\nAs Leibniz himself writes, from his “very tender youth\nonwards”, even before he went to university, he “came\nacross a part of Luther’s book De servo\narbitrio”, while going on to study works written on this\nissue not only by other Lutherans and by Reformed writers, but also\nthose in the Catholic tradition (see Backus 2016: 257, notes 10 and\n11). Leibniz’s interest in this debate was later to lead him to\ncontribute belatedly to the controversy between Hobbes and Bramhall\noutlined above, which he discusses in an appendix to his\nTheodicy (1710): “Reflexions on the Work that Mr.\nHobbes Published in English on ‘Freedom, Necessity and\nChance’”. Leibniz notes that Hobbes’s view that\n“divine foreknowledge would be sufficient to establish an\nabsolute necessity of events” resembles that of Luther in De\nservo arbitrio, or at least Luther there “spoke so”;\nbut then Leibniz suggests this Lutheran position goes further than it\nneeds to do, as \n\n\nit is sufficiently acknowledged today that the kind of necessity which\nis termed hypothetical, and springs from foreknowledge or from other\nanterior reasons, has nothing in it to arouse one’s alarm:\nwhereas it would be quite otherwise if the thing were necessary of\nitself, in such a way that the contrary implied contradiction.\n(Leibniz 1710 [1985: Appendix §3, p. 393]) \n\n\nIn embracing and developing this Scholastic distinction, between a\ncertainty based on the knowledge of causes, and a logical necessity\nthat means that things could not have been otherwise, Leibniz is\ntherefore arguing that it would have been quite possible for Luther to\npreserve his commitment to divine foreknowledge on the one hand,\nwithout playing into the hands of a hard determinist like Hobbes on\nthe other.\n\nThe Theodicy also contains discussion of another key Lutheran\nissue, namely the relation between faith and reason, which is\nspecifically raised in a “preliminary dissertation” at the\nstart of the text. In reviewing the history of debates on this\nquestion, Leibniz admits that Luther “spoke sometimes as if [he]\nrejected philosophy and deemed it inimical to faith”, but he\nthen seeks to qualify Luther’s position, arguing that by\n“philosophy” Luther meant our understanding of nature, or\nthe philosophy of the schools, so that it is only philosophy in this\nnarrow sense that cannot comprehend matters of faith. Leibniz likewise\nnotes Luther’s early hostility to Aristotle, but that \n\n\nat last he curbed his vehemence and in the Apology for the\nAugsburg Confession allowed [Melanchthon to include] a favourable\nmention of Aristotle and his Ethics. (1710 [1985: §12, p. 81])\n\n\n\nLeibniz also offers a moderate reading of Luther’s claims\nconcerning the differences between revealed truths and the mysteries\nof the Gospel on the one hand, and reason on the other (1710 [1985:\n§49, p. 101; §67, pp. 110–11]). Rather than\nattributing this view to Luther, therefore, Leibniz goes on to suggest\nthat it is later theologians in various traditions, as well as figures\nsuch as Pierre Bayle, who had made the opposition of faith and reason\ninto a sharp one. Leibniz himself tries to blunt this opposition by\nappealing to a distinction between what is above reason in\nthe sense that reason cannot fully comprehend it, and what is\ncontrary to reason, arguing that while matters of faith may\nfall into the former category, they cannot fall into the latter, so\nthat \n\n\nonce a dogma has been disputed and refuted by reason, instead of its\nbeing incomprehensible, one may say that nothing is easier to\nunderstand, nor more obvious, than its absurdity. (1710 [1985:\n§23, p. 88]) \n\n\n(For further discussion of Leibniz’s approach, see Antognazza\n2008: Introduction, 2018a; Goldenbaum 1998; Hillman 2013; Schweitz\n2011.)\n\nLeibniz’s writings on theology thus become focused on\nestablishing what he seems to have viewed as this moderate Lutheran\nposition, of showing across a range of issues that what might appear\ncontrary to reason is often merely above it (see Antognazza\n 2018b).[10]\n One central theological issue which Leibniz deals with in this way,\nand which as we have seen concerned Luther (see\n Luther entry §2)\n and became a crucial matter of dispute within the later Reformation,\nwas the question of the Eucharist. Unsurprisingly, therefore, this\nissue becomes central for Leibniz too, both in his ecumenical attempts\nto find common ground between the various Christian traditions, and to\nshow how a reason informed by new developments in philosophical\nthinking (most especially his own) can find a way forward in these\napparently intractable debates (see Backus 2016: Chapters 1 and 2;\nMercer 2002: 82–89; Fouke 1992). Nonetheless, despite his\necumenical endeavours, it has been noted (Adams 1994: 354–5;\nAntognazza 2018b: 746–48) that Leibniz’s metaphysics works\nbest as an attempt to make sense of the Eucharist when this is\nconceived along the lines of the Lutheran position of real presence\nrather than the Catholic conception of\n transubstantiation.[11]\n To this extent his metaphysics more generally may be said to operate\nwithin a broadly Lutheran outlook, though one which (thanks to the\ninfluence of Melanchthon and others) had more room in it than Luther\nhimself may have liked for Aristotelian ideas of the sort Leibniz\nemployed to deal with these issues, such as substantial form (see\nMercer 2002:\n 101).[12]\n2. Luther, Kant, and the Post-Kantians\n\nBy virtue of their education and background, Luther continues to have\nan impact on the thought of significant philosophers after Leibniz,\nsuch as Christian Thomasius (1655–1728) and Christian Wolff\n(1679–1754). However, a more interesting point of contact can be\nfound with the crucial thinker who was not in fact brought up as a\nmainstream Lutheran but as a Pietist, namely Immanuel Kant\n (1724–1804).[13]\n This impact continues in the work of the Lutheran idealists who\nfollowed him, namely J. G. Fichte (1762–1814), F. W. J.\nSchelling (1775–1854) and G. W. F. Hegel (1770–1831), as\nwell as in the work of those who responded to Kant in a different way,\nnamely Gotthold Ephraim Lessing (1729–1781), J. G. Hamann\n(1730–1788), F. H. Jacobi (1743–1819) and J. G. Herder\n(1744–1803), in addition to Arthur Schopenhauer\n(1788–1860) and thinkers associated with Romanticism such as\nFriedrich von Hardenberg (aka Novalis) (1772–1801) and Friedrich\nSchlegel (1772–1829), and the convert Jewish writer and essayist\nHeinrich Heine (1797–1856). For reasons of space, it will not be\npossible to trace all these connections here, so I will focus mainly\non Kant and Hegel, with a brief mention of Fichte and Schelling. (A\nmore comprehensive study, which contains excerpts from key primary\ntexts, can be found in Bornkamm 1955; a brief overview can be found in\nAssel 2014. For discussions that extend into the twentieth century,\nsee Hampson 2017, Podmore 2017 and Rota 2017.)\n\nWhile Kant’s upbringing and education came from within Pietism\nrather than the orthodox Lutheran\n Church,[14]\n Pietism was still a reform movement within the Lutheran tradition,\nand in certain respects saw itself as returning to the views of Luther\nhimself, and away from what that Church had become (see Lindberg 2005\nand Shantz 2013 for further discussion). One issue this re-opened was\nthe role of reason in relation to faith, and the limitations of reason\nand hence academic theology in religious matters, while also taking\nseriously the fallenness of human beings, and the need for spiritual\nrebirth. As has been emphasised recently (see Kanterian 2017),\nKant’s adoption of this so-called “weakness motif”\nmay be seen as an importantly Lutheran theme in his work, and is\nreflected in the limitations he places on human reason and on our\ncapacities for moral goodness; nonetheless, Kant does not use his\nclaims concerning the constraints on reason to prioritise theology\nover philosophy, or to give revelation or scripture a special status,\nwhile he also departs from Luther over the issue of free will and of\ngrace.\n\nThat the human intellect is limited is a central theme in what Kant\ncalled his “critical philosophy”, which precisely aims to\nset out those limits. Moreover, as is suggested by his famous claim to\nhave “found it necessary to deny knowledge in order to make room\nfor faith” (Critique of Pure Reason, Bxxx), there is a\nreligious impetus behind this project of a sort that Luther might have\nrecognized, which is also reflected in Kant’s hostility to\nrationalistic attempts to prove the existence of God. Kant may also be\nsaid to share Luther’s Augustinian pessimism regarding human\nnature, where he frequently remarks on our evident self-concern, and\nin Religion Within the Boundaries of Mere Reason (1793)\nattributes the propensity to radical evil to all human beings, namely\n\n\n\nthe propensity of the power of choice to maxims that subordinate the\nincentives of the moral law to others (not moral ones). (6:30) \n\n\nThis conception of human moral weakness may also be said to lead Kant\nto adopt a Lutheran conception of the law, which only becomes binding\non us and takes the form of duty given our resistance to the good,\nwhereas for the holy will there is no such necessitation or constraint\n(cf. Groundwork for the Metaphysics of Morals,\n4:412–4).\n\nHowever, there are also limits on how far Kant is prepared to follow\nthese Lutheran themes. Firstly, while he is willing to accept that\ntheoretical reason may both lead itself astray and find itself\ncognitively impoverished in some respects, in a way that leaves room\nfor faith, he is not willing to allow that this means that theology\ncan eclipse philosophy, or that revelation or scripture can simply\nreplace the latter, as he took it that religion must remain compatible\nwith morality and thus stay within practical reason, out of which a\nphilosophical theology can arise (see Religion, Preface, and\nThe Conflict of the Faculties, Part 1). Secondly, Kant offers\na distinctive conception of the idea of free choice\n(Willkür) as involving the choice or adoption of our\nmaxims (see Metaphysics of Morals 6: 213–4, 226;\nReligion Within the Limits of Mere Reason 6:23–4),\nwhile he also argues for our freedom on the basis that “ought\nimplies can”, which puts him at odds with Luther’s\nposition as articulated in The Bondage of the Will (see,\ne.g., Religion 6:45, and White 1990 for more general\ndiscussion). Finally, in Religion Within the Limits of Mere\nReason, Kant rejects the Lutheran conception of grace, again on\nmoral grounds, arguing that we will be discouraged in our moral\nefforts unless we believe that we can do something to make ourselves\ndeserving of grace and hence of divine assistance to be good, while\nagain Kant appeals to the principle that “ought implies\ncan” to argue that we must have some capacity in this direction,\nhowever limited (see Religion Part 1). Thus, while there are\nsome affinities between Kant and Luther, there are important\ndivergences too.\n\nHegel’s reception of Luther contrasts with Kant’s in\nvarious ways. First, Kant never offers any significant discussion of\nLuther in his writings, and is implicitly critical of him in important\nrespects, while Hegel is more explicit in his engagement with Luther,\nand frequently lavish in his praise of the Reformer—though Hegel\nquickly dropped his youthful plans to be a Lutheran pastor, and was\ncritical of aspects of the Lutheran education he received as a student\nat the seminary (or Stift) in Tübingen. Secondly,\nKant’s relation to Luther is made more complex by his Pietistic\nupbringing; but while Hegel’s upbringing may also have involved\nsome Pietistic aspects (see Macgee 2001: 71–72), in later life\nHegel avowed his Lutheran orthodoxy, writing to the Pietistic\ntheologian Friedrich August Tholuck in 1826: “I am a Lutheran,\nand through philosophy have been at once completely confirmed in\nLutheranism” (Hegel 1984: 520). Thirdly, the two philosophers\nare almost diametrically opposed in what they accepted and what they\nrejected in Luther: while Kant followed Luther’s doubts\nconcerning reason and our capacities for moral goodness, Hegel was\nmore optimistic on both scores; but while Kant rejected Luther’s\nscepticism regarding free choice, Hegel used it to draw his\ndialectical connection between freedom and necessity. However, both\nKant and Hegel agree in standing against any attempt to prioritise\ntheology over philosophy on Lutheran grounds. After briefly outlining\nthe key texts for understanding Hegel’s engagement with Luther,\nthis third point will then be developed further.\n\nThe majority of Hegel’s references to Luther occur in the\nlectures on the philosophy of religion, and on philosophy of history,\nand on the history of philosophy, where in the case of the last two,\nthese are largely in the sections on the Reformation more generally.\nThe context therefore means that in these explicit discussions, Hegel\nis considering Luther’s place in subsequent historical developments. In\ngeneral, Hegel presents Luther as ushering in a new era of internality\nand individuality, as religion becomes less a matter of unthinkingly\nfollowing established authorities and rituals that are external and\nalien, and more a matter of grasping the truth for oneself and feeling\nat one with it, thus ushering in a distinctive form of\n“Christian freedom”: \n\n\nSubjective spirit comes to itself through this self-negation because\nit is absolutely at home with itself [bei sich]. Thus\nsubjective spirit gains freedom in the truth, negates its\nparticularity and comes to itself in its truth. In this way Christian\nfreedom is actualized. (1822–23 [Hegel 2011: 505]) \n\n\nAnd in his “Address on the Tercentenary of the Submission of the\nAugsburg Confession” (1830), Hegel even goes so far as to\npresent his own work as a “second reformation”: while\nLuther was the “trumpet which now proclaimed the\nwondrous sound of Christian freedom”, and that “the things\nwhich our Luther set in motion were truly new”, nonetheless\n“if religion is reformed, the political, legal, and ethical\nsystem [ratio civitatis et legum morumque] should also be\nreformed” (Hegel 1830 [1999: 189])—which thus connects\nLuther’s religious project to Hegel’s political one, as\nHegel also did in the Preface to the Philosophy of\n Right.[15]\n Heine, in his account of the development of German philosophy written\nfor a French audience in 1834 and published in book form a year later\n(Heine 1835 [2007]), tells a similar story, which begins with Luther\nand culminates in Hegel—indeed, its original title was De\nL’Allemagne depuis Luther. Heine’s work also reflects\nthe role that Hegel gave Luther, as a quintessentially\n“German” figure, which was to become a common trope in his\nsubsequent\n reception.[16]\n\nAs well as this focus on religious and political freedoms for the\nindividual, the emphasis on the relation between Lutheranism and\nfreedom in Hegel may be seen to have four more fundamental aspects,\nwhich reveal Luther’s influence on Hegel’s conception of\nfreedom, which is a central theme in the latter’s philosophy.\nFirst, as we have seen Hegel took Christian freedom to involve finding\noneself in the other, which may reflect Luther’s turn from God\nas an alien and forbidding judge, to God as forgiving and loving, in\nwhich a freedom as reconciliation can be achieved—albeit a unity\nthat must be achieved through a prior sense of alienation.\n [17]\n In Luther this alienation involves an element of hiddenness which is\nnot so evident in Hegel. Nonetheless, It could be added that just as\nLuther’s conception of divine hiddenness can involve the idea\nthat God’s nature is concealed under its contrary\n(abscondita sub contrario) (such as his mercy under his\nwrath, his strength under his weakness and suffering in Jesus\n Christ),[18]\n so there is a further connection here to Hegel’s conception of\nthe dialectic, where what appears one way to the understanding can be\nseen to be otherwise by reason, such as necessity really being\nfreedom, in a way that the former will find incomprehensible.\nMoreover, Hegel’s conception of freedom and self-knowledge as\nrequiring recognition by the other may be said to reflect\nLuther’s conception of our relational dependence on\n God.[19]\n Second, Hegel takes up the idea that this reconciliation with the\nother requires a kind of self-surrender, where he writes that: \n\n\nSubjective certainty, i.e. the subject’s knowledge of the true,\nwhich should be for it an objective truth, subsisting in and for\nitself, only becomes authentic when, in relation to this content,\nparticular subjectivity is surrendered; and this happens only by\nmaking the objective truth one’s own truth. (1822–23\n[Hegel 2011: 505]) \n\n\nAs Stephen Houlgate has\n noted,[20]\n this emphasis on the passivity is an important feature of\nHegel’s own method of inquiry, for example where Hegel remarks\nthat \n\n\n[p]hilosophical thinking proceeds analytically in that it simply takes\nup its object, the Idea, and lets it go its own way, while it simply\nwatches the movement and development of it, so to speak. To this\nextent, philosophising is wholly passive. (Encyclopaedia\nLogic §238 Addition)\n\n\nThird, Hegel takes up the Lutheran (and Pauline) view concerning the\nrelation between the Christian and the law, according to which the Christian should not require constraint by law, as\n\n\ntrue freedom…is a freedom to do good with pleasure and to live\nwell without compulsion of the law. (Preface to St Paul’s\nEpistle to the Romans, WA DB 7:18–19/LW 35:376) \n\n\nIt could be\nargued that this view is reflected in Hegel’s preference for\nlove over law, which is a particular feature of his early\n writings.[21]\n Finally, in The Bondage of the Will, Luther questions a\nconception of freedom as free choice (see\n Luther entry §4),\n arguing instead that the presence of this choice involves a lack of\nfreedom as the agent is no longer guided by the good; this view may\nalso be said to be echoed in Hegel’s own critique of free choice\n(Willkür), which underpins his claim that there is a way\nin which true freedom and necessity can be reconciled, as the truly\nfree agent only sees one option available to them, namely what is\nrequired by the good. In these respects, therefore, it can be argued\nthat there is a fundamentally Lutheran cast to this fundamental aspect\nof Hegel’s thought. However, Hegel surely departs from Luther in\nchampioning the role of reason in his speculative philosophy (albeit\nreason of a distinctive kind, which goes beyond the understanding),\nwhich is able to “sublate” Christianity within\nit—but this very sublation means that his philosophy takes up\nstructures of theological thinking, some of which are also Lutheran,\nso that in turn Hegel remains an important influence within Lutheran\n theology.[22]\n\nThere are interesting points of similarity and difference between\nHegel’s response to Luther, and that of the other post-Kantian\nGerman idealists such as Fichte and Schelling. Like Hegel, Fichte\ntreats Luther as a significant national figure, and associates him\nwith freedom, giving him prominence in his Addresses to the German\nNation which were written in 1808 as a rallying call in the wake\nof Napoleonic invasion. Both also praise Luther’s contribution\nto the German language through his translations of the Bible, though\nFichte is critical of the doctrine of sola scriptura, which\nwas to put too much value on “the printed\n letter”.[23]\n Moreover, if Luther can be said to have an influence of Hegel’s\nconception of recognition (see above), the same may be said of\nFichte’s account of recognition which foreshadowed\nHegel’s, though in neither case is this link made explicit.\nSchelling also gives Luther’s account of freedom a philosophical\nrole, appealing to Luther’s Bondage of the Will in his\nPhilosophical Investigations into the Essence of Human\nFreedom (1809), to draw a distinction between compulsion and\nnecessity, and more broadly arguing that \n\n\nreligiosity does not permit any choice between opposites, and\naequilibrium arbitrii (the plague of all morality), but\nrather only the highest resoluteness in favour of what is right\nwithout any choice. (1809 [2006: 57]) \n\n\nMoreover, in appealing in his later work to the significance of\nrevelation, it has been argued that Schelling is more consistently\nLutheran than Hegel, in thereby placing limits to the latter’s\nrationalism (see Wirth 2017).\n3. Luther, Kierkegaard, and Nietzsche\n\nTwo other significant nineteenth century philosophers who engaged with\nLuther are Søren Kierkegaard (1813–55) and Friedrich\nNietzsche (1844–1900). For Kierkegaard, this engagement came in\nthe context of his attempts to renew the nature of Christian faith,\nwhile for Nietzsche it came from someone standing outside that\nfaith.\n\nKierkegaard’s relation to Luther and Lutheranism is complex, and\nremains a matter of some\n controversy.[24]\n On balance, though, it seems that while Kierkegaard was clearly a\ncritic of the established Danish Lutheran Church, he was not so\ncritical of Luther himself, and partly returned to him in order to\nchallenge his Lutheran contemporaries, even suggesting that he might\nturn out to be Luther’s “true\n successor”.[25]\n At the same time, he held that some of Luther’s original\ndoctrines were partly responsible for the contemporary malaise, and so\nmust be re-thought in the context of new challenges to genuine\nChristian life and spirituality as conceived by Kierkegaard, thereby\napplying “a corrective to Luther’s own corrective”,\nas Kim and Rasmussen nicely put it (2009: 197). His attitude is\ntherefore well-summarized in his remark: \n\n\nI have wanted to prevent people in Christendom from existentially\ntaking in vain Luther and the significance of Luther’s life.\n(1850 [1998:\n 17])[26]\n\n\n\nThus while by his own admission Kierkegaard was not a systematic\nreader of\n Luther,[27]\n his engagement with his writings nonetheless relates to deep themes\nin Kierkegaard’s own thinking, so that Luther provides an\nimportant context for his thought.\n\nOne such issue concerned the question of justification, and the\ncentral Lutheran view that this comes through unmerited grace as\nforgiveness rather than through works. While expressing sympathy with\nLuther’s central claim, Kierkegaard was fearful that in his\ncontemporary world, it had become an excuse for an ethical and\nspiritual indolence, so that people now “applied grace\nin such a way that they freed themselves from works”\n(Kierkegaard 1851 [1990a: 17]). Relatedly, Kierkegaard acknowledged\nand respected the spiritual seriousness of the anxieties\n(Anfechtungen) and sense of sin which had led Luther himself\nto adopt this position (see Podmore 2006 and 2013); but this was a\nseriousness which Kierkegaard’s contemporaries had lost, so that\nfor them the turn to grace becomes a superficial optimism rather than\na renewal of hope in the face of anxiety and despair. Moreover, like\nLuther, Kierkegaard closely connected our relation to God in faith\nwith our relation to the neighbour, so that it is through the former\nthat the latter as works of love are made\n possible.[28]\n In this way, Kierkegaard could claim to be correcting an exaggeration\nof Luther’s position, which tried to do away with works\naltogether—much as Luther himself had rejected this exaggeration\nin his Treatise on Good Works. In re-affirming the importance\nof works, Kierkegaard gave a greater role to the imitatio\nChristi tradition, again arguing that while Luther had been\nrightly critical of this idea in his own context as feeding works\nrighteousness and a kind of pseudo-piety, it nonetheless needs\nreviving in Kierkegaard’s context, to provide a challenge to the\ncomplacent self-conception of his contemporaries by raising Christ up\nas an ideal, and to re-focus our attention on him as a radical figure\n(Kierkegaard 1876 [1990: 192–209]).\n\nHowever, another obstacle to a proper life of faith for Kierkegaard\nwas the kind of worldliness to be found in his contemporaries, for\nwhich he claimed that Luther needed to take a more direct\nresponsibility, insofar as he had allowed the Reformation to become a\npolitical programme (see Kierkegaard KJP: 3, frag. 2469 [p. 66,\n1848]), and had also presented an account of social orders as a model\nof Christian life, which had been taken up by Hegelians and others as\nan ethic of vocation. For Kierkegaard, this had led to a relation\nbetween the religious on the one hand and the ethical and social on\nthe other that tended to reduce the former to the latter, and which he\nsought to challenge in his own more radical conception of their\nrelation, which could include the Christian having to live at odds\nwith any social order, and suffering exclusion from it as a\nresult—or at the very least, active faith may require feeling\ndistanced from the world, while living within it. Again, while\nKierkegaard acknowledges that Luther may have intended something\n similar,[29]\n the result of his teachings had led people in a different direction;\nas Sløk puts it: \n\n\nLife, serving one’s neighbour through one’s calling, had\nbeen transformed into one of bourgeois complacency in which relative\nduties and relative rights had obliterated the awareness of an\nunconditional obligation upon man. (Sløk 1962: 100) \n\n\nIn this context, while recognizing that it could not be revived and\ncritical of it in some\n respects,[30]\n Kierkegaard expresses some preference for the monastic life over that\nof the married life of the Lutheran pastor, and the worldliness that\nhad come to\n involve.[31]\n\nA final theme to note concerns the relation between reason and faith,\nwhich also forms part of Kierkegaard’s critical engagement with\nHegelianism. As discussed above, Hegel may be seen to have taken\nLutheranism in a more rationalistic and philosophical direction, to\nwhich Kierkegaard’s emphasis on the “paradox” of the\nincarnation, which underlies Christian faith, as well as his emphasis\non divine hiddenness, may be seen as a corrective. For Kierkegaard,\nthis was essential to properly appreciate Luther’s theology of\nthe cross, which because it is alien to rational comprehension, makes\nreligious commitment a matter of individual faith and existential\nrisk, as typified in the story of Abraham to which he and Luther both\n refer[32]—though\n in his own way, Kierkegaard like Leibniz suggests that while this\nputs faith above reason, it does not put it contrary to it and so\nrender it irrational in that\n sense.[33]\n\nWhile Kierkegaard’s criticisms of Luther come from within the\nChristian tradition, those of Nietzsche come from a thinker who put\nhimself outside\n it.[34]\n However, it took some time for this critique of Luther to develop,\nand in his earlier period until 1876 Nietzsche’s writings are\nhighly favourable towards Luther himself and the Reformation\ngenerally; but from this point on, his view of both becomes\nincreasingly negative and hostile (see Bluhm 1943, 1950, 1953 for a\ndetailed account of this trajectory; this is also discussed in Large\n2003). For Nietzsche, Luther came to represent the paradigm of the\nnon-aristocratic man, who rather than accepting and overcoming\nhimself, instead despised himself and tried to flee from himself by\nturning to God. Thus, while Nietzsche may have seen in Luther a\nprefiguring of his own attempts to get beyond a morality of law in the\nname of\n freedom,[35]\n ultimately he came to view this liberating impetus as something\nLuther himself betrayed. More positively, however, while no direct\nreferences to Luther are made, and while any such influence would be\nmediated by other figures such as Schopenhauer, it is arguable that\nsome elements in Nietzsche’s rejection of the idea of the free\nwill might be found in Luther, not with respect to Nietzsche’s\ncausal determinism, but at the level of his doubts concerning the\npower of free choice to occupy a neutral position between the agent\nand their actions—for example, in Nietzsche’s well known\ncriticism of “popular morality” which \n\n\nseparates strength from the manifestation of strength, as though there\nwere an indifferent substratum behind the strong which had the\nfreedom to manifest strength or not. (1887: First Essay,\n§13) \n\n\nIn a somewhat similar way (see\n Luther entry §4),\n Luther is critical of Erasmus’s conception of the idea that\nthere is any “pure will” (purum velle) standing\nabove desire (studium) or striving (conatus) which can thus decide\nwhether to go one way or another (cf. WA 18:669/LW\n33:114–5).\n4. Luther, Feuerbach, and Marxism\n\nIn the nineteenth century, Luther also plays a prominent role in the\nthought of the key post-Hegelian thinker Ludwig Feuerbach\n(1804–1872), and to a lesser degree in that of Karl Marx\n(1818–1883) and Friedrich Engels (1820–1895), as well as\nin later thinkers in the twentieth century Marxist tradition such as\nErnst Bloch (1885–1977), and Herbert Marcuse\n (1898–1979).[36]\n\nFeuerbach’s primary engagement with Luther comes in the second\nedition of his The Essence of Christianity (1843), and in\nThe Essence of Faith According to Luther (1844). Among his\nmotivations was Feuerbach’s desire in the face of Protestant\ncritics to establish that the view of religion proposed in the first\nedition of The Essence of Christianity applied not only to\nthe Catholic faith (which such critics were happy to concede), but\nalso to Protestantism—and of course there could be no better way\nfor Feuerbach to establish this than to demonstrate that Luther\nhimself could be encompassed within Feuerbach’s analysis, which\nis what he therefore proposed in these works (see Glasse 1972 and Erdozain 2016: 223–45 for\nfurther discussion). Put briefly, Feuerbach’s central thesis was\nthat religious beliefs are nothing more than the expressions of human\ndesires, and God is a being on whom our aspirations for ourselves are\nprojected, so that in worshipping God we are worshipping ourselves. As\nFeuerbach allows at the outset of The Essence of Faith, this\nmay seem not to apply to Luther’s conception, insofar as Luther\ninsists on the fundamental discontinuity between God and human beings,\nplacing all value in the former and none in the latter. On the\nsurface, therefore, \n\n\nLuther’s doctrine is divine but inhuman, indeed barbaric—a\nhymn to God, but a lampoon on man. (Feuerbach 1844 [1967: 41]) \n\n\nIn response, however, Feuerbach argues that is a superficial reading,\nas the role of God is to restore to us what we have lost: “Man\nin himself is and can do nothing, but in God (that is through faith)\nhe is and can do everything” (1844 [1967: 46]). This can be\nseen, Feuerbach argues, in the way that Luther (in his opposition to\nCatholicism) emphasises the way in which he takes Christ’s\nsuffering to be for us, so that what appeared to be a\ndivergence becomes a radical convergence. Feuerbach’s\nappropriation of Luther (which of course remains controversial) is\ntherefore summarized when he writes: \n\n\n“If God sat in heaven for Himself alone”, says Luther,\n“like a block, He would not be God” \n\n\nfrom which Feuerbach takes Luther to be agreeing with him, that\n“God is a word the sole meaning of which is\n‘man’” (1844 [1967: 50]), and thus to be\nforeshadowing Feuerbach’s own anthropological turn.\n\nTurning now to Marx, Engels and others in the broadly Marxist\ntradition, their central concern was a focus on Luther’s\nhistorical impact as a revolutionary and social reformer, which seemed\nto be compromised by Luther’s role in the Peasants’\nRevolt (see sections 1 and 5 of the entry on \n Luther). In his study of the Revolt, Engels in particular drew\nparallels with the situation leading up to the German revolutions of\n1848–49, casting Luther as a “middle-class” reformer\nunable to sustain the radicalism he had unleashed, which Engels (and\nlater Bloch) took to be better represented in “plebeian\nrevolutionary” Thomas Müntzer (c. 1489–1525), who\nLuther had declared to be an instrument of Satan, and who was tortured\nand executed after the battle of Frankenhausen in 1525. A similar\nsuspicion of Luther can also be found in Marcuse, in an essay from\n1936 written after Marcuse’s exile from Germany to the United\nStates, and so this time against the background of the growing\nauthoritarianism of Nazism (which itself often glorified Luther).\nWithout explicitly making the connection, in this context Marcuse\naccuses Luther of relegating Christian freedom to the inner\n sphere,[37]\n leaving the outer world of politics and society as a realm of\nunfreedom to which the Christian must submit, in deference to worldly\nauthorities which Luther argued could not be challenged—a\npolitical quietism which in Marcuse’s context was of course\nparticularly troubling, and which after the war became a source for\nmuch criticism (and self-criticism) directed towards the Lutheran\nChurch.\n5. Luther, Heidegger, and Løgstrup\n\nWhile the other major twentieth century figures to engage with Luther\nwere primarily theologians (such as Rudolf Bultmann (1884–1976),\nKarl Barth (1886–1968), Paul Tillich (1886–1965) and\nFriedrich Gogarten (1887–1967)), one significant philosopher in\nthis period to often be associated with Luther is Martin Heidegger\n(1889–1976). Raised originally as a Catholic and aspiring\ninitially to be a Catholic philosopher, after the First World War\nHeidegger shifted his allegiances and began to engage seriously with\nLuther’s works, as well as with Augustine, Schleiermacher, and\nKierkegaard, though ultimately he was to break with theism and\nChristianity altogether. In this period in the 1920s, Heidegger took\nup Luther’s distinction between the “theology of\nglory” and the “theology of the cross”, and argued\nthat original or “primordial” Christianity\n(Urchristentum) had been distorted into the former by an\n“ontotheology” wrongly influenced by the scholastic\nmisappropriation of Aristotle; this now needed to be overturned in a\nway that was yet more radical than Luther himself, to avoid what\nHeidegger saw as the “Protestant scholasticism” of\nLuther’s later period and that of his followers. It can also be\nsaid that what he perceived as Luther’s struggle provided the\ninspiration for Heidegger’s own attempts to overturn the\nmetaphysical tradition within philosophy. However, with the\npublication of Being and Time in 1927, this connection to\nLuther becomes obscured in the wake of other allegiances, and Luther\nis hardly mentioned in this text, though it can still be argued that\ncertain Lutheran assumptions remain throughout this and later\nworks—such that one commentator has called Being and\nTime a “Lutheran phenomenology of Dasein” (McGrath\n2006:\n 12).[38]\n\nLuther also plays a significant role in the thought of the Danish\nphilosopher and theologian K. E. Løgstrup (1905–1981),\nwho interacted with Heidegger and Bultmann both before and after the\nSecond World War, as well as with contemporary Kierkegaardians in\nDenmark. Løgstrup used Luther to develop his own distinctive\nnatural law position in ethics, while also incorporating in his ethics\nthe fundamental Lutheran view that goodness is not achievable through\nour own efforts; but for Løgstrup, this goodness is brought\nabout through the encounter with another person that is made possible\nthrough life itself, rather than divine grace, thereby secularizing\nthis central aspect of the Lutheran position. At the same time, he\nallows that the very fact that life makes this possible may suggest\nthat it is created. Løgstrup argued, moreover, that forgiveness\nmust remain a theological matter, as our sinfulness means that human\nbeings are in no position to forgive each other with any kind of\nauthority, in this way retaining an important element of\nLuther’s theology of the cross.\n6. Luther and “Modernity”\n\nLeaving aside Luther’s influence on individual philosophers,\nthere has also been some philosophical interest in considering his\nwider cultural and historical impact on “modernity”, and\nhis role in shaping the modern world as we now understand\nit.[39] Of\ncourse, this is a highly complex matter (for a helpful overview, see\nZachhuber 2017), but broadly five approaches have been adopted. On\nsome accounts (such as Hegel’s outlined above, as well as\nHeine’s) Luther’s impact is seen as both decisive and\npositive, alongside a largely positive conception of modernity itself,\nwhere here the emphasis might lie on his resistance to religious\nauthority, and his prioritising of the conscience of the individual.\nOn other accounts, this impact is accepted, but seen instead as an\nobject of criticism, as the relevant features of modernity are\ndeplored, so that for example Luther is blamed for the rise of modern\nindividualism, of voluntarism, and of the secularism that is said to\ngo along with both (see for example Maritain 1925). A third approach\n(as we also saw above in relation to the Marxist tradition and to\nMarcuse, for example) may also blame Luther for unequivocally\nproblematic aspects of modernity, such as authoritarianism and\nanti-Semitism. A fourth approach is to see Luther as in fact standing\nin contrast to certain key positive features of modern thought, such\nas rationalism, freedom, and religious tolerance; for example, the\njuxtaposition between his views and those of Erasmus’s humanism\nis sometimes portrayed in this light (see for example Gillespie 2008;\nMassing 2018). And of course, if one adopts certain views of the\ndevelopment of Luther’s thought, one may attribute different\ninfluences as coming from different phases, and treat some as more\npositive than others (by distinguishing, for example, between a\n“radical” earlier Luther and a more\n“conservative” later Luther), so that Luther’s\nimpact may be understood as taking more than one (and even\ncontradictory) form (see for example Erdozain 2016). A final approach\nis to criticise all attempts to link Luther too closely with such\ndebates concerning “the modern”, arguing that this is\nhistorically anachronistic, as he is more essentially a medieval\nfigure, so that to focus myopically on his impact on modernity will be\nto distort our understanding of Luther himself, and also perhaps of\nhis distinctiveness and originality, while also neglecting the way\nLuther’s own thinking changed over time (for a recent example of\nthis approach, see Helmer 2019). This is not the occasion to\nadjudicate such debates, but it is hoped that the account of Luther\ngiven previously will make it possible to give proper consideration to\nsome of the issues they raise. For in discussing how far Luther shaped\nthe modern world, some consideration of how far he shaped philosophy\nsurely deserves a place. \n", "bibliography": {"categories": ["A. Abbreviations for references to Luther’s works", "B. Useful collections of some of Luther’s main writings", "C. Primary Literature by Others", "D. Secondary Literature", "Other Cited Works"], "cat_ref_text": {"A. Abbreviations for references to Luther’s works": ["</h3>\n<ul class=\"hanging\">", "[WA] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>, 65\nvols in 127. Weimar: Hermann Böhlau, 1883–1929, Abteilung\n1: Schriften vols 1–56.", "[WA TR] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>,\n65 vols in 127. Weimar: Hermann Böhlau, 1883–1929,\nAbteilung 2: Tischreden vols 1–6.", "[WA DB] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>,\n65 vols in 127. Weimar: Hermann Böhlau, 1883–1929.\nAbteilung 3: Die Deutsche Bibel vols 1–12.", "[LW] <em>Luther’s Works</em>, American edition, 55 vols. St\nLouis and Philadephia: Concordia and Fortress Press,\n1958–86; new series, vols 56–75, 2009–.\n</ul>\n<h3 id=\"BUsefCollSomeLuthMainWrit\">"], "B. Useful collections of some of Luther’s main writings": ["</h3>\n<ul class=\"hanging\">", "<em>Martin Luther: Selections from his Writings</em>, edited by\nJohn Dillenberger. Garden City: Anchor Books, 1961.", "<em>The Ninety-Five Theses and Other Writings</em>, Trans William\nRussell. Harmondsworth: Penguin, 2017.", "<em>The Annotated Luther</em>, edited by Timothy J. Wengert et al,\n6 vols. Minneapolis: Fortress Press, 2015–17.\n</ul>\n<p>\nTranslations have been modified where necessary.</p>\n<h3 id=\"CPrimText\">"], "C. Primary Literature by Others": ["</h3>\n<p>\nReferences for Kant are to the Akademie edition given in the margins\nof most translations, by volume number and page number, except for\nreferences to the <em>Critique of Pure Reason</em>, which are given to\nthe pages of the first (A) edition or second (B) edition, which are\nalso given in the margins of translations of that text.</p>\n<p>\nTranslations have been modified where necessary.</p>\n<ul class=\"hanging\">", "Bloch Ernst, 1963, <em>Thomas Münzer als Theologe der\nRevolution</em>, Frankfurt: Suhrkamp.", "Bramhall, John, 1655, <em>A Defence of True Liberty from\nAnte-cedent and Extrinsicall Necessity</em>, London: John Crook.", "Engels, Friedrich, 1850 [1956], <em>Der deutsche Bauernkrieg</em>;\ntranslated as <em>The Peasant War in Germany</em>, Moissaye J. Olgin\n(trans.), Moscow: International Publishers. [First published as\narticles in <em>Neue Rheinische Zeitung. Politisch-ökonomische\nRevue</em> (Hamburg)].", "Feuerbach, Ludwig, 1843, <em>Das Wesen des Christentums</em>\n(<em>The Essence of Christianity</em>), second edition, Leipzig: Otto\nWigand.", "–––, 1844 [1967], <em>Wesen des Glaubens im\nSinne Luthers</em>, Leipzig: Otto Wigand; translated as <em>The Essence\nof Faith According to Luther</em>, Melvin Cherno (trans.), New York:\nHarper &amp; Row, 1967.", "Fichte, Johann Gottlieb, 1808, <em>Reden an die deutsche\nNation</em> (<em>Addresses to the German Nation</em>),\nBerlin; translated as <em>Addresses to the German Nation</em>, Gregory\nMoore (trans.), Cambridge: Cambridge University Press, 2008.", "Hegel, G. W. F., 1798–99 [1971], “Der Geist des\nChristentums und sein Schicksal”, unpublished\nmanuscript; translated as “The Spirit of Christianity and its\nFate”, T. M. Knox (trans.), in <em>Hegel’s Early\nTheological Writings</em>, Philadelphia, PA: University of\nPennsylvania Press, 1971, 182–281 (originally published\n1948).", "–––, 1821 [1991], <em>Grundlinien der\nPhilosophie des Rechts</em>, Berlin; translated as <em>Elements of the\nPhilosophy of Right</em>, Allen W. Wood (ed.), H. D. Nisbet (trans.),\nCambridge: Cambridge University Press, 1991.", "–––, 1830 [1999], “Address on the\nTercentenary of the Submission of the Augsburg Confession (25 June\n1830)”; translated by H.B. Nisbet in <em>Hegel: Political\nWritings</em>, Laurence Dickey and H. B. Nisbet (eds), Cambridge:\nCambridge University Press, pp. 186–96.", "–––, 1984, <em>Hegel: The Letters</em>, Clark\nButler and Christine Seiler (trans), Bloomington, IN: Indiana\nUniversity Press.", "–––, 2009, <em>Lectures on the History of\nPhilosophy 1825–6, Volume III: Medieval and Modern\nPhilosophy</em>, revised edition, Robert F. Brown (ed./trans.),\nOxford: Oxford University Press.", "–––, 2011, <em>Lectures on the Philosophy of\nWorld History, Volume 1: Manuscripts of the Introduction and the\nLectures of 1822–1823</em>, Robert F. Brown and Peter C. Hodgson\n(eds/trans), Oxford: Oxford University Press.", "Heidegger, Martin, 1924 [2010], “Das Problem der Sünde\nbei Luther”; translated as “The Problem of Sin in\nLuther”, Brian Hansford Bowles (trans.) in <em>Becoming\nHeidegger: On the Trail of his Early Occasional Writings,\n1910–1927</em>, second edition, Theodore Kisiek and Thomas\nSheehan (eds.), (The New Yearbook for Phenomenology and\nPhenomenological Philosophy, 9), Evanston, IL: Northwestern University\nPress, 2010, 183–191.", "Heine, Heinrich, 1835 [2007], <em>Zur Geschichte der Religion und\nPhilosophie in Deutschland</em>; translated as <em>On the History of\nReligion and Philosophy in Germany</em>, Howard Pollack-Milgate\n(trans.), in <em>On the History of Religion and Philosophy in Germany\nand Other Writings</em>, Terry Pinkard (ed.), Cambridge: Cambridge\nUniversity Press, 2007, pp. 3–120.", "Hobbes, Thomas, 1656 [1841], <em>The Questions Concerning Liberty,\nNecessity, and Chance</em>, reprinted in <em>The English Works of\nThomas Hobbes</em>, Sir William Molesworth (ed.), vol 5. London:\nBohn.", "–––, 1688 [2008], <em>Historia Ecclesiastica,\nCarmine Elegiaco Concinnata</em>, London: Augustae Trinobantum. New\nedition with translation, <em>Historia Ecclesiastica</em>, Patricia\nSpringborg, Patricia Stablein, and Paul Wilson (eds), Paris:\nHonoré Champion, 2008.", "–––, 1722, <em>A True Ecclesiastical History\nfrom Moses to the Time of Martin Luther: In Verse</em>, London: E.\nCurll. An anonymous paraphrase of Hobbes 1688.\n [<a href=\"http://hdl.handle.net/2027/njp.32101073248617\" target=\"other\">Hobbes 1722 available online</a>]", "–––, 1999, Selections from Hobbes 1656 [1841],\nin Hobbes and Bramhall 1999: 69–90.", "Hobbes, Thomas and John Bramhall, 1999, <em>Hobbes and Bramhall on\nLiberty and Necessity</em>, Vere Chappell (ed.), Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781139164207", "Kant, Immanuel, 1793 [1998], <em>Religion innerhalb der Grenzen\nder bloßen Vernunft</em>; translated as <em>Religion Within the\nBoundaries of Mere Reason</em>, Allen Wood and George di Giovanni\n(trans.), Cambridge: Cambridge University Press, 1998.", "Kierkegaard, Søren, 1843 [1983], <em>Frygt og\nbæven</em>; translated as <em>Fear and Trembling</em>, in\n<em>Fear and Trembling; Repetition</em>, Howard V. Hong and Edna H.\nHong (trans.), (Kierkegaard’s writings, 6), Princeton: Princeton\nUniversity Press, 1983.", "–––, 1846 [1992], <em>Afsluttende uvidenskabelig\nefterskrift</em>; translated as <em>Concluding Unscientific Postscript\nto “Philosophical Fragments”</em>, two volumes, Howard V.\nHong and Edna H. Hong (trans.), (Kierkegaard’s writings, 12),\nPrinceton: Princeton University Press.", "–––, 1851 [1990], <em>Til\nselvprøvelse</em>; translated as <em>For Self-Examination</em>\nin Kierkegaard 1990: 1–88.", "–––, 1859 [1998], <em>Synspunktet for min\nForfatter-Virksomhed</em>, published posthumously; translated as\n<em>The Point of View for My Work as an Author</em> in <em>The Point\nof View</em>, Howard V. Hong and Edna H. Hong (trans.),\n(Kierkegaard’s writings, 22), Princeton: Princeton University\nPress, 21–126.", "–––, 1876 [1990], <em>Dømmer selv</em>;\ntranslated as <em>Judge for Yourself!</em> in Kierkegaard 1990:\n89–216.", "–––, 1990, <em>For Self-Examination; Judge for\nYourself!</em>, Howard V. Hong and Edna H. Hong (trans.),\n(Kierkegaard’s writings, 21), Princeton: Princeton University\nPress.", "–––, [KJP] 1999, <em>Søren\nKierkegaard’s Journals and Papers</em>, 7 volumes, second\nedition, edited and translated by Howard V. and Edna H. Hong, assisted\nby Gregor Malantschuk; Index by N. Hong and C. Barker, Bloomington,\nIN: Indiana University Press.", "Leibniz, Gottfried Wilhelm, 1710 [1985], <em>Essais de\nthéodicée</em>; translated as <em>Theodicy: Essays on\nthe Goodness of God, the Freedom of Man, and the Origin of Evil</em>,\nAustin M. Farrer (ed.), E. M. Muggard (trans.), Peru, IL: Open\nCourt.", "–––, 1976, <em>Philosophical Papers and\nLetters</em>, second edition, Leroy E. Loemker (ed.), Dordrecht:\nReidel. doi:10.1007/978-94-010-1426-7", "Løgstrup, K. E., 1949 [2019], “Die Kategorie und das\nAmt der Verkündigung im Hinblick auf Luther und\nKierkegaard”, <em>Evangelische Theologie</em>, 9(1–6):\n249–269; translated as “The Category and the Office of\nProclamation, with Particular Reference to Luther”, Christopher\nBennett and Robert Stern (trans.), <em>Graduate Faculty Philosophy\nJournal</em>, 2019, 40(1): 183–209.\ndoi:10.5840/gfpj20194019", "–––, 1956 [2020], <em>Den etiske fordring</em>,\nCopenhagen: Gyldendal, reissued Aarhus: Klim, 2010. Translated\nas <em>The Ethical Demand</em>, Bjørn Rabjerg and Robert Stern\n(trans), Oxford: Oxford University Press, 2020.", "–––, 1971 [2020], <em>Etiske begreber og\nproblemer</em>, originally published in the anthology <em>Etik och\nKristen Tro</em>, reissued Aarhus: Klim, 2014; translated\nas <em>Ethical Concepts and Problems</em>, Kees van Kooten Niekerk and\nKristian-Alberto Lykke Cobos (trans.), Oxford: Oxford University\nPress, 2020.", "Marcuse, Herbert, 1936 [1972], “Ideengeschichtlicher\nTeil”, in <em>Studie über Autorität und Familie</em>,\nParis: Librairie Félix Alcan, pp. 136–228; translated as\n“A Study on Authority”, in his <em>From Luther to\nPopper</em>, Joris De Bres (trans.), London: Verso, 1972,\npp. 49–156.", "Nietzsche, Friedrich, 1886 [1966], <em>Jenseits von Gut und\nBöse: Vorspiel einer Philosophie der Zukunft</em>, Leipzig:\nNaumann; translated as <em>Beyond Good and Evil</em>, Walter Kaufmann\n(trans.), New York: Vintage, 1966.", "–––, 1887 [1998], <em>Zur Genealogie der Moral:\nEine Streitschrift</em>, Leipzig: Naumann; translated as <em>On the\nGenealogy of Morality</em>, Maudemarie Clark and Alan Swensen\n(trans.), Indianapolis: Hackett, 1998.", "Novalis, 1799 [1996], “Die Christenheit oder Europa”;\ntranslated as “Christianity or Europe: A Fragment”, in\n<em>The Early Writings of the German Romantics</em>, Frederick C.\nBeiser (ed. and trans.), Cambridge: Cambridge University Press, 1996,\npp. 59–79.", "Schelling, F. W. J., 1809 [2006], <em>Philosophische\nUntersuchungen über das Wesen der menschlichen Freiheit und die\ndamit zusammenhängenden Gegenstände</em>; translated as\n<em>Philosophical Investigations into the Essence of Human\nFreedom</em>, Jeff Love and Johannes Schmidt (trans), Albany, NY: SUNY\nPress, 2006.\n</ul>\n<h3 id=\"DSeco\">"], "D. Secondary Literature": ["</h3>\n<h4>D.1 General</h4>\n<ul class=\"hanging\">", "Antognazza, Maria Rosa, 1996, “Hofmann-Streit: Il Dibattito\nSul Rapporto Tra Filosofia e Teologia All’università Di\nHelmstedt”, <em>Rivista Di Filosofia Neo-Scolastica</em>, 88(3):\n390–420.", "Assel, Heinrich, 2014, “The Uses of Luther’s Thought\nin the Nineteenth Century and the Luther Renaissance”, in Kolb,\nDingel, and Bakta 2014: 551–572.", "Bauch, Bruno, 1917, “Unser philosophisches Interesse an\nLuther”, <em>Zeitschrift für Philosophie und philosophische\nKritik</em>, 164: 128–48.", "Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and his\nPredecessors</em>, Cambridge, MA: Harvard University Press, Part\nTwo.", "Bornhamm, Heinrich, 1955, <em>Luther im Spiegel der deutschen\nGeistesgeschichte: Mit ausgewälten Texten von Lessing bis zur\nGegenwart</em>, Heidelberg: Quelle &amp; Meyer.", "Erdozain, Dominic, 2016, <em>The Soul of Doubt: The Religious Roots of Unbelief from Luther to Marx</em>, Oxford: Oxford University Press.", "Gillespie, Michael Allen, 2008, <em>The Theological Origins of\nModernity</em>, Chicago: University of Chicago Press.", "Hampson, Daphne, 2017, “Luther, Lutheranism, and\nPost-Christianity”, in <em>Oxford Research Encyclopedia of\nReligion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.507", "Helmer, Christine, 2019, <em>How Luther Became the Reformer</em>, Louisville, KY: Westminster John Knox Press.", "Hunter, Ian, 2006, “The University Philosopher in Early\nModern Germany”, in <em>The Philosopher in Early Modern\nEurope</em>, Conal Condren, Stephen Gaukroger, and Ian Hunter (eds.),\nCambridge: Cambridge University Press, 35–65.\ndoi:10.1017/CBO9780511490460.003", "Kolb, Robert, Irene Dingel, and L’ubomír Batka\n(eds.), 2014, <em>The Oxford Handbook of Martin Luther’s\nTheology</em>, Oxford: Oxford University Press.\ndoi:10.1093/oxfordhb/9780199604708.001.0001", "Maritain, Jacques, 1925 [1928], <em>Trois Réformateurs:\nLuther, Descartes, Rousseau</em>, Paris: Librairie Plon; translated as\n<em>Three Reformers: Luther, Descartes, Rousseau</em>, London: Sheed\nand Ward.", "Massing, Michael, 2018, <em>Fatal Discord: Erasmus, Luther, and\nthe Fight for the Western Mind</em>, New York: Harper.", "Melloni, Alberto (ed.), 2017, <em>Martin Luther: A Christian\nBetween Reforms and Modernity (1517–2017)</em>, Berlin: De\nGruyter. doi:10.1515/9783110499025", "Metzke, Erwin, 1934–35, “Lutherforschung und deutsche\nPhilosophiegeschichte”, <em>Blätter für deutsche\nPhilosophie</em>, 8: 355–82.", "Pelikan, Jaroslav, 1950, <em>From Luther to Kierkegaard</em>,\nSaint Louis, MO: Concordia.", "Podmore, Simon D., 2017, “Martin Luther in Modern European\nPhilosophy”, in <em>Oxford Research Encyclopedia of\nReligion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.317", "Popkin, Richard H., 1979, <em>The History of Scepticism from\nErasmus to Spinoza</em>, Berkeley: University of California\nPress.", "Regier, Jonathan, 2016, “Logic, Mathematics and Natural\nLight: Liddel on the Foundations of Knowledge”, in <em>Duncan\nLiddel (1561-1613)</em>, Pietro Daniel Omodeo (ed.), Leiden: Brill,\n113–129. doi:10.1163/9789004310667_006", "Rota, Giovanni, 2017, “Luther in Nineteenth and Twentieth\nCentury Philosophy”, in Melloni 2017: 883–910.\ndoi:10.1515/9783110499025-051", "Smith, Leonard S., 2009, <em>Religion and the Rise of History:\nMartin Luther and the Cultural Revolution in Germany,\n1760–1810</em>, Eugene, OR: Cascade.", "Tessitore, Fulvio, 2017, “The\n<em>Universalgeschichtlich</em> Role of the Reformation According to\nIdealism and Historicism within German Culture”, in Melloni\n2017: 911–932. doi:10.1515/9783110499025-052", "Weber, Max, 1905, <em>Protestantische Ethik und der Geist des\nKapitalismus</em>, <em>Archiv für Sozialwissenschaft und\nSozialpolitik</em>, 20(1): 1–54, 21(1): 1–110; translated\nas <em>The Protestant Ethic and the Spirit of Capitalism</em>, Talcott\nParsons (trans.), London: Routledge, 1992. Revised version of the 1930\nedition.", "Zachhuber, Johannes, 2017, “Martin Luther and Modernity,\nCapitalism, and Liberalism”, in <em>Oxford Research Encyclopedia\nof Religion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.301", "Zeeden, Ernst Walter, 1950 [1954], <em>Martin Luther und die\nReformation im Urteil des deutschen Luthertums</em>, volume 1,\nFreiburg: Herder; translated as <em>The Legacy of Luther</em>, Ruth\nMary Bethell (trans.), London: Hollis &amp; Carter, 1954.\n</ul>\n<h4>D.2 Hobbes</h4>\n<ul class=\"hanging\">", "Cromartie, Alan, 2018, “Hobbes, Calvinism, and\nDeterminism”, in <em>Hobbes on Politics and Religion</em>,\nLaurens van Apeldoorn and Robin Douglass (eds), Oxford: Oxford\nUniversity Press, pp. 95–115.", "Damrosch, Leopold, 1979, “Hobbes as Reformation Theologian:\nImplications of the Free-Will Controversy”, <em>Journal of the\nHistory of Ideas</em>, 40(3): 339–352. doi:10.2307/2709241", "Jackson, Nicholas D., 2007, <em>Hobbes, Bramhall and the Politics\nof Liberty and Necessity: A Quarrel of the Civil Wars and\nInterregnum</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511495830", "Kodalle, Klaus-Michael, 1990, “Sterbliche Götter:\nMartin Luthers Ansichten zu Statt, Recht und Gewalt als Vorgriff auf\nHobbes”, in <em>Hobbes oggi</em>, Andrea Napoli (ed), Milan:\nFranco Angeli, pp. 122–142.", "Overhoff, Jürgen, 1997, “The Lutheranism of Thomas\nHobbes”, <em>History of Political Thought</em>, 18(4):\n604–623.\n</ul>\n<h4>D.3 Leibniz</h4>\n<ul class=\"hanging\">", "Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, Oxford: Oxford University Press.", "Antognazza, Maria Rosa, 2008, <em>Leibniz on the Trinity and the\nIncarnation: Reason and Revelation in the Seventeenth Century</em>,\nNew Haven, CT: Yale University Press.", "–––, 2009, <em>Leibniz: An Intellectual\nBiography</em>, Cambridge: Cambridge University Press.", "–––, 2018a, “Faith and Reason”\nin <em>The Oxford Handbook of Leibniz</em>, Maria Rosa Antognazza\n(ed.), Oxford: Oxford University Press, pp. 717–34.", "–––, 2018b, “Philosophical Theology and\nChristian Doctrines” in <em>The Oxford Handbook of Leibniz</em>,\nMaria Rosa Antognazza (ed.), Oxford: Oxford University Press, pp.\n735–55", "Backus, Irena, 2016, <em>Leibniz: Protestant Theologian</em>,\nOxford: Oxford University Press.", "Fouke, Daniel C., 1992, “Metaphysics and the Eucharist in\nthe Early Leibniz”, <em>Studia Leibnitiana</em>, 24(2):\n145–159.", "Goldenbaum, Ursula, 1998, “Leibniz as a Lutheran”, in\n<em>Leibniz, Mysticism and Religion</em>, A. P. Coudert et al. (eds),\nDordrecht: Kluwer, pp. 169–192.", "Hillman, T. Allan, 2013, “Leibniz and Luther on the\nNon-Cognitive Component of Faith”, <em>Sophia</em>, 52(2):\n219–234. doi:10.1007/s11841-012-0310-8", "Hinlicky, Paul R., 2009, <em>Paths Not Taken: Fates of Theology\nfrom Luther Through Leibniz</em>, Grand Rapids, MI: Eerdmans.", "Mercer, Christia, 2002, <em>Leibniz’s Metaphysics: Its\nOrigins and Development</em>, Cambridge: Cambridge University\nPress.", "Pichler, Alois, 1869–70, <em>Die Theologie des Leibniz</em>,\n2 vols., Munich: Gotta Buchhandlung.", "Schweitz, Lea F., 2011, “Reasoning Faithfully: Leibniz on\nReason’s Triumph of Faith and Love”, in <em>The\nDevil’s Whore: Reason and Philosophy in the Lutheran\nTradition</em>, Jennifer Hockenbery Dragseth (ed), Minneapolis, MN:\nFortress Press, pp. 79–85.\n</ul>\n<h4>D.4 Kant</h4>\n<ul class=\"hanging\">", "Bauch, Bruno, 1904, <em>Luther und Kant</em>, Berlin: Reuther\n&amp; Reichard.", "Bohatec, Josef, 1938, <em>Die Religionsphilosophie Kants in der\n“Religion innerhalb der Grenzen der blossen Vernunft”, mit\nbesonderer Berücksichtigung ihrer theologisch-dogmatischen\nQuellen</em>, Hamburg: Hoffmann und Campe.", "Dienst, Karl, 2004, “Kant als ‘Philosoph des\nProtestantismus?’”, <em>Journal für\nReligionskultur</em>, 194: 1–8.", "Ebbinghaus, Julius, 1927, “Luther und Kant”,\n<em>Luther-Jahrbuch</em>, 9: 119–155.", "Eiben, Jürgen, 1989, <em>Von Luther zu Kant: Der deutsche\nSonderweg in die Moderne</em>, Wiesbaden: Springer.", "Kanterian, Edward, 2017, <em>Kant, God and Metaphysics: The Secret\nThorn</em>, Abingdon: Routledge.", "Kuehn, Manfred, 2001, <em>Kant: A Biography</em>, Cambridge:\nCambridge University Press.", "Lindberg, Carl (ed), 2005, <em>The Pietist Theologians</em>,\nOxford: Blackwell.", "Lötzsch, Frider, 1976, <em>Vernunft und Religion im Denken\nKants: Lutherisches Erbe bei Immanuel Kant</em>, Köln:\nBöhlau Verlag.", "Paulsen, Friedrich, 1900, “Kant der Philosoph des\nProtestantismus”, <em>Kant-Studien</em>, 4: 1– 31.", "Raffelt, Albert, 2005, “Kant als Philosoph des\nProtestantismus – oder des Katholizismus?” in <em>Kant und\nder Katholizismus: Stationen einer wechselhaften Geschichte</em>,\nNobert Fischer (ed.), Freiburg: Herder, pp. 139–159.", "Shantz, Douglas H., 2013, <em>An Introduction to German\nPietism</em>, Baltimore, MD: John Hopkins University Press.", "Vanden Auweele, Dennis, 2013, “The Lutheran Influence on\nKant’s Depraved Will”, <em>International Journal for\nPhilosophy of Religion</em>, 73(2): 117–134.\ndoi:10.1007/s11153-011-9331-4", "Wand, Bernard, 1971, “Religious Concepts and Moral Theory:\nLuther and Kant”, <em>Journal of the History of Philosophy</em>,\n9(3): 329–348. doi:10.1353/hph.2008.1268", "White, Roger, 1990, “‘Ought’ Implies\n‘Can’: Kant and Luther, a Contrast”, in <em>Kant and\nHis Influence</em>, G. M. Ross and T. McWalter (eds), Bristol:\nThommes, pp. 1–72.\n</ul>\n<h4>D.5 Fichte</h4>\n<ul class=\"hanging\">", "La Vopa, Anthony J., 2001, <em>Fichte: The Self and the Calling of\n1762–1799</em>, Cambridge: Cambridge University Press.\n</ul>\n<h4>D.6 Hegel</h4>\n<ul class=\"hanging\">", "Asendorf, Ulrich, 1982, <em>Luther und Hegel: Untersuchungen zur\nGrundlegung einer neuen systematischen Theologie</em>, Wiesbaden:\nSteiner.", "Duquette, David A., 1984, “Comment on Merold\nWestphal’s ‘Hegel and the Reformation’”, in\n<em>History and System: Hegel’s Philosophy of History</em>,\nRobert L. Perkins (ed), Albany, NY: SUNY Press, pp. 92–99.", "Houlgate, Stephen, 2006, <em>The Opening of Hegel’s\n“Logic”: From Being to Infinity</em>, West Lafayette, IN:\nPurdue University Press.", "–––, 2015, “Glaube, Liebe, Verzeihung:\nHegel und die Religion”, <em>Hegel-Studien</em>, 49:\n13–38.", "Jaeschke, Walter, 1986 [1992], <em> Die Vernunft in der Religion:\nStudien zur Grundlegung der Religionsphilosophie Hegels</em>,\nStuttgart-Bad Cannstatt : Frommann-Holzboog; translated as <em>Reason\nin Religion: The Foundations of Hegel’s Philosophy of\nReligion</em>, J. Michael Stewart and Peter C. Hodgson (trans.),\nBerkeley, CA: University of California Press, 1992.", "Macgee, Glenn Alexander, 2001, <em>Hegel and the Hermetic\nTradition</em>, Ithaca, NY: Cornell University Press.", "Maurer, Ernstpeter, 1996, <em>Der Mensch im Geist: Untersuchungen\nzur Anthropologie bei Hegel und Luther</em>, Gütersloh:\nGütersloher Verlagshaus.", "Merklinger, Philip M., 1993, “Unveiling Faith and Spirit:\nHegel’s Criticism of Schleiermacher in the Foreword”, in\nhis <em>Philosophy, Theology, and Hegel’s Berlin Philosophy of\nReligion: 1821–1827</em>, Albany, NY: SUNY Press, 75–113\n(chapter 3).", "Mure, G. R. G., 1966, “Hegel, Luther, and the Owl of\nMinerva”, <em>Philosophy</em>, 41(156): 127–139.\ndoi:10.1017/S0031819100058502", "Olson, Alan M., 1992, <em>Hegel and the Spirit: Philosophy as\nPneumatology</em>, Princeton, NJ: Princeton University Press.", "O’Regan, Cyril, 1994, <em>The Heterodox Hegel</em>, New\nYork: SUNY Press.", "Ritter, Joachim, 1975 [1982], “Hegel und die\nReformation”, in <em>Unbefangenes Christentum. Deutsche\nRepräsentanten und Interpreten des Protestantismus. Eine\nSendereihe des Deutschlandfunks</em>, W. Schmidt (ed.), Munich;\ntranslated as “Hegel and the Reformation”, in\nRitter’s <em>Hegel and the French Revolution: Essays on the\nPhilosophy of Right: Essays on the Philosophy of Right</em>, Richard\nDien Winfield (trans.), Cambridge, MA: MIT Press, 1982, pp.\n183–91.", "Rotstein, Abraham, 2018, <em>Myth, Mind and Religion: The\nApocalyptic Narrative</em>, New York: Peter Lang, Chapters 7 and\n8.", "Thaidigsmann, Edgar, 1983, <em>Identitätsverlangen und\nWiderspruch: Kreuzestheologie bei Luther, Hegel und Barth</em>,\nMunich: Kaiser.", "Westphal, Merold, 1984, “Hegel and the Reformation”,\nin <em>History and System: Hegel’s Philosophy of History</em>,\nRobert L. Perkins (ed), Albany, NY: SUNY Press, pp. 73–92.\n</ul>\n<h4>D.7 Schelling</h4>\n<ul class=\"hanging\">", "Hatem, Jan, 2013, <em>Liberté humaine et divine ironie:\nSchelling avec Luther</em>, Paris: Orizons.", "Laughland, John, 2007, <em>Schelling versus Hegel: From German\nIdealism to Christian Metaphysics</em>, Aldershot: Ashgate.", "Wirth, Jason M., 2019, “Schelling and Luther”,\n<em>Theological Research. The Journal of Systematic Theology</em>, 5:\n93–105. doi:10.15633/thr.3303\n</ul>\n<h4>D.8 Kierkegaard</h4>\n<ul class=\"hanging\">", "Barnett, Christopher B., 2011, <em>Kierkegaard, Pietism and\nHoliness</em>, London: Routledge.", "Barrett, Lee, 2002, “Faith, Works, and the Uses of the Law:\nKierkegaard’s Appropriation of Lutheran Doctrine”, in\n<em>For Self-Examination and Judge for Yourself!</em>, Robert L.\nPerkins (ed), Macon, GA: Mercer University Press, pp.\n77–109.", "–––, 2015, “Kierkegaard’s\nAppropriation and Critique of Luther and Lutheranism”, in <em>A\nCompanion to Kierkegaard</em>, Jon Stewart (ed), Oxford:\nWiley-Blackwell, pp. 180–92.", "Bragstad, William R., 1976, “Luther’s Influence on\nTraining in Christianity”, <em>The Lutheran Quarterly</em>, 28;\n257–271.", "Burgess, Andrew, 2000, “Kierkegaard’s Concept of\nRedoubling and Luther’s <em>Simul Justus</em>”, in\n<em>Works of Love</em>, Robert L. Perkins (ed), Macon, GA: Mercer\nUniversity Press, pp. 39–55.", "Fabro, Cornelio, 1984, “Kierkegaard e Lutero:\nincontro-scontro”, <em>Humanitas</em>, 39: 5–12.", "Hall, Amy Laura, 2002, “The Call to Confession in\nKierkegaard’s <em>Works of Love</em>”, in <em>Kierkegaard\nand the Treachery of Love</em>, Cambridge: Cambridge University Press,\npp. 11–50 (chapter 1).", "Hampson, Daphne, 2001, “Kierkegaard’s Odyssey”,\nin <em>Christian Contradictions: The Structures of Lutheran and\nCatholic Thought</em>, Cambridge: Cambridge University Press,\n249–284 (chapter 7).", "–––, 2013, <em>Kierkegaard: Exposition and\nCritique</em>, Oxford: Oxford University Press.", "Hinkson, Craig, 2001, “Luther and Kierkegaard: Theologians\nof the Cross”, <em>International Journal of Systematic\nTheology</em>, 3(1): 27–45. doi:10.1111/1463-1652.00049", "–––, “Will the Real Martin Luther Please\nStand Up! Kierkegaard’s View of Luther versus the Evolving\nPerceptions of the Tradition”, in <em>For Self-Examination and\nJudge for Yourself!</em>, Robert L. Perkins (ed), Macon, GA: Mercer\nUniversity Press, pp. 41–76.", "Hughes, Carl S., 2017, “Søren Kierkegaard: Protesting\nthe Lutheran Establishment”, in <em>Radical Lutherans/Lutheran\nRadicals</em>, Jason A. Mahn (ed), Eugene, OR: Cascade Books, pp.\n43–69.", "Kim, David Yoon-Jung and Joel Rasmussen, 2009, “Martin\nLuther: Reform, Secularization, and the Question of His “True\nSuccessor””, in <em>Kierkegaard and the Renaissance and\nModern Traditions, Tome II Theology</em>, Jon Stewart (ed), Aldershot:\nAshgate, pp. 173–217.", "Koenker, Ernst B., 1968, “Søren Kierkegaard on\nLuther”, in <em>Interpreters of Luther: Essays in Honor of\nWilhelm Pauck</em>, Jaroslav Pelikan (ed), Philadelphia, PA: Fortress\nPress, pp. 234–48.", "Løkke, Håvard and Arild Waaler, 2009,\n“Gottfried Wilhelm Leibniz: Traces of Kierkegaard’s\nReading of the <em>Theodicy</em>” in <em>Kierkegaard and the\nRenaissance and Modern Traditions, Tome I Philosophy</em>, Jon Stewart\n(ed), Aldershot: Ashgate, pp. 51–76.", "Palmer, Elizabeth, 2017, <em>Faith in a Hidden God: Luther,\nKierkegaard, and the Binding of Isaac</em>, Minneapolis, MN: Fortress\nPress.", "Podmore, Simon D., 2006, “The Lightning and the Earthquake:\nKierkegaard on the <em>Anfechtung</em> of Luther”, <em>The\nHeythrop Journal</em>, 47(4): 562–578.\ndoi:10.1111/j.1468-2265.2006.00298.x", "–––, 2013, <em>Struggling With God: Kierkegaard\nand the Temptation of Spiritual Trial</em>, Cambridge: James\nClarke.", "Prenter, Regin, 1981, “Luther and Lutheranism”, in\n<em>Kierkegaard and the Great Traditions</em>, Niels Thulstrup and\nMarie Mikulová Thulstrup (eds), Copenhagen: C.A. Reitzel, pp.\n121–72.", "Sløk, Johannes, 1962, “Kierkegaard and Luther”,\nin <em>A Kierkegaard Critique</em>, Howard A. Johnson and Niels\nThulstrup (eds), New York: Harper, pp. 85–101.", "Thulstrup, Maria Mikulová, 1967, <em>Kierkegaard og\nPietismen</em>, Copenhagen: Munksgaard.\n</ul>\n<h4>D.9 Nietzsche</h4>\n<ul class=\"hanging\">", "Bluhm, Heinz, 1943, “Das Lutherbild der jungen\nNietzsche”, <em>Publications of the Modern Languages Association\nof America</em>, 58(1): 264–288. doi:10.2307/459044", "–––, 1950, “Nietzsche’s Idea of\nLuther in <em>Menschliches, Allzumenschliches</em>”,\n<em>Publications of the Modern Languages Association of America</em>,\n65(6): 1053–1068. doi:10.2307/459719", "–––, 1953, “Nietzsche’s View of\nLuther and the Reformation in <em>Morgenröthe</em> and <em>Die\nfröhliche Wissenschaft</em>”, <em>Publications of the\nModern Languages Association of America</em>, 68(1): 111–127.\ndoi:10.2307/459910", "–––, 1956, “Nietzsche’s Final View\nof Luther and the Reformation”, <em>Publications of the Modern\nLanguages Association of America</em>, 71(1): 75–83.\ndoi:10.2307/460193", "Fraser, Giles, 2002, <em>Redeeming Nietzsche: On the Piety of\nUnbelief</em>, London: Routledge.", "Hirsch, Emanuel, 1920–21, “Nietzsche und\nLuther”, <em>Jahrbuch der Luther-Gesellschaft</em>, 2–3:\n61–106; reprinted in <em>Nietzsche-Studien</em>, 15 (1986):\n398–439.", "Hollingdale, Richard, 1961, “Introduction” to\nNietzsche’s <em>Thus Spoke Zarathustra</em>, Richard Hollingdale\n(trans.), Harmondsworth: Penguin.", "Large, Duncan, 2003, “‘Der Bauernaufstand des\nGeistes’: Nietzsche, Luther and the Reformation”, in\n<em>Nietzsche and the German Tradition</em>, Nicholas Martin (ed),\nBern: Peter Lang, pp. 111–137.", "Pernet, Martin, 1995, “Friedrich Nietzsche and\nPietism”, <em>German Life and Letters</em>, 48(4):\n474–486. doi:10.1111/j.1468-0483.1995.tb01647.x", "Westall, Joseph, 2004, “Zarathustra’s Germanity:\nLuther, Goethe, Nietzsche”, <em>Journal of Nietzsche\nStudies</em>, 27: 42–63.\n</ul>\n<h4>D.10 Feuerbach and Marxism</h4>\n<ul class=\"hanging\">", "Adamson, Walter Luiz, 2013, “Gramsci, Catholicism and\nSecular Religion”, <em>Politics, Religion &amp; Ideology</em>,\n14(4): 468–484. doi:10.1080/21567689.2013.829047", "Adorno, Theodor W., 1933 [1989], <em>Kierkegaard: Konstruktion des\nÄsthetischen</em>, Tübingen, Mohr; translated as\n<em>Kierkegaard: Construction of the Aesthetic</em>, Robert\nHullot-Kentor (trans.), Minneapolis, MN: University of Minnesota\nPress, 1989.", "–––, 1951 [2005], <em>Minima Moralia: Minima\nMoralia: Reflexionen aus dem beschädigten Leben</em>, Frankfurt\nam Main: Suhrkamp; translated as <em>Minima Moralia: Reflections From\nDamaged Life</em>, E. F. N. Jephcott (trans.), London: Verso, 2005.", "–––, 1970 [1984], <em>Ästhetische\nTheorie</em>, Frankfurt am Main: Suhrkamp; translated as <em>Aesthetic\nTheory</em>, C. Lenhardt (trans.), London: Routledge, 1984.", "Barth, Karl, 1957, “An Introductory Essay”, James\nLuther Adams (trans.), to Ludwig Feuerbach, <em>The Essence of\nChristianity</em>, George Elliot (trans.), New York: Harper and Row,\npp. x–xxxii.", "Bayer, Oswald, 1972, “Gegen Gott für den Menschen: Zu\nFeuerbachs Lutherrezeption”, <em>Zeitschrift für Theologie\nund Kirche</em>, 69: 34–71.", "–––, 1981, “Marcuses Kritik an Luthers\nFreiheitsbegriff”, in <em>Umstrittene Freiheit:\nTheologisch-philosophische Kontroversen</em>, Tübingen: Mohr, pp.\n13–38.", "Boer, Roland, 2017, “Luther and Marxism”, in Melloni\n2017: 953–964. doi:10.1515/9783110499025-054", "–––, 2019, “From Luther to Marx and\nEngels”, in his <em>Red Theology: On the Christian Communist\nTradition</em>, Leiden: Brill, pp. 61–103.", "Brady, Thomas A. Jr., 2014, “Marxist Evaluations of\nLuther’s Thought”, in Kolb, Dingel, and Bakta 2014:\n573–583.", "Brendler, Gerhard, 1991, <em>Martin Luther: Theology and\nRevolution</em>, Claude R. Foster Jr (trans.), Oxford: Oxford\nUniversity Press.", "Brunvoll, Arve, 1996, <em>“Gott ist Mensch”: Die\nLuther-Rezeption Ludwig Feuerbachs und die Entwicklung seiner\nReligionskritik</em>, Frankfurt: Peter Lang.", "Chino, Taido J., 2020, “Reforming Promeity:\nFeuerbach’s Misreading of Luther”, <em>International\nJournal of Philosophy and Theology</em>, 81(1): 71–86.\ndoi:10.1080/21692327.2019.1597756", "Glasse, John, 1972, “Why Did Feuerbach Concern Himself With\nLuther?”, <em>Revue Internationale de Philosophie</em>, 26(101):\n364–385.", "–––, 1975, “Feuerbach und die Theologie:\nSechs Thesen über den Fall Luther”, in <em>Atheismus in der\nDiskussion: Kontroversen um Ludwig Feuerbach</em>, Hermann Lübbe\nand Hans-Martin Sass (eds), Munich: Kaiser, pp. 28–35.", "Harvey, Van A., 1998, “Feuerbach on Luther’s Doctrine\nof Revelation: An Essay in Honor of Brian Gerrish”, <em>The\nJournal of Religion</em>, 78(1): 3–17. doi:10.1086/490120", "Kern, Udo, 1984, “Zu Ludwig Feuerbachs\nLutherverständnis”, <em>Neue Zeitschrift für\nSystematische Theologie und Religionsphilosophie</em>, 26:\n29–44.", "Lehmann, Hartmut, 2004, “Das marxistische Lutherbild von\nEngels bis Honecker”, in <em>Luther zwischen den Kulturen:\nZeitgenossenschaft – Weltwirkung</em>, Hans Medick and Peer\nSchmidt (eds), Göttingen: Vandenhoeck &amp; Ruprecht, pp.\n500–516.", "–––, 2004, “The Rehabilitation of Martin\nLuther in the GDR, or Why Thomas Müntzer Failed to Stabilise the\nMoorings of Socialist Ideology”, in <em>Religion in the Cold\nWar</em>, Dianne Kirby (ed), New York: Vandenhoeck &amp; Ruprecht, pp.\n200–210.", "Lindberg, Carter, 1970, “Luther and Feuerbach”,\n<em>Sixteenth Century Essays and Studies</em>, 1: 107–125.\ndoi:10.2307/3003687", "Rotstein, Abraham, 2018, <em>Myth, Mind and Religion: The\nApocalyptic Narrative</em>, New York: Peter Lang: Chapter 9.\n</ul>\n<h4>D.11 Heidegger</h4>\n<ul class=\"hanging\">", "Armitage, Duane, 2016, <em>Heidegger’s Pauline and Lutheran\nRoots</em>, London: Palgrave Macmillan.", "Clifton-Soderstrom, Karl, 2009, “The Phenomenology of\nReligious Humility in Heidegger’s Reading of Luther”,\n<em>Continental Philosophy Review</em>, 42(2): 171–200.\ndoi:10.1007/s11007-009-9102-4", "Crowe, Benjamin, 2006, “Luther’s <em>Theologia\nCrucis</em>” in <em>Heidegger’s Religious Origins</em>,\nBloomington and Indianapolis: Indiana University Press, pp.\n15–43 (chapter 2).", "McGrath, S. J., 2006, <em>The Early Heidegger and Medieval\nPhilosophy: Phenomenology for the Godforsaken</em>, Washington, DC:\nThe Catholic University of America Press.", "Pöggeler, Otto, 2004, “Heideggers Luther-Lektüre\nim Freiburg Theologenkonvikt”, <em>Heidegger-Jahrbuch</em>, 1:\n185–196.", "Schlink, Edmund, 1955, “Weisheit und Torheit”,\n<em>Kerygma und Dogma</em>, 1: 1–22.", "Sommer, Christian, 2005, <em>Aristote, Heidegger, Luther: Les\nsources aristotéliciennes et néo-testamentaires\nd’Être et temps</em>, Paris: PUF.", "Stanley, Timothy, 2007, “Heidegger on Luther on Paul”,\n<em>Dialog: A Journal of Theology</em>, 46(1): 41–45.\ndoi:10.1111/j.1540-6385.2007.00306.x", "Van Buren, John, 1994, “Martin Heidegger, Martin\nLuther”, in <em>Reading Heidegger from the Start: Essays in His\nEarliest Thought</em>, Theodore J. Kisiel and John Van Buren (eds),\nAlbany, NY: State University of New York Press, pp. 159–74.\n</ul>\n<h4>D.12 Løgstrup</h4>\n<ul class=\"hanging\">", "Andersen, Svend, 2007, “In the Eyes of a Lutheran\nPhilosopher: How Løgstrup Treated Moral Thinkers”, in\n<em>Concern for the Other: Perspectives on the Ethics of K. E.\nLøgstrup</em>, Svend Andersen and Kees van Kooten Niekerk\n(eds), Notre Dame, IN: Notre Dame University Press, pp.\n29–53.", "–––, 2017, <em>Løgstrup og Luther</em>,\nAarhus: Klim.", "Bennett, Christopher, Paul Faulkner, and Robert Stern, 2019,\n“Indirect Communication, Authority, and Proclamation as a\nNormative Power: Løgstrup’s Critique of\nKierkegaard”, <em>Graduate Faculty Philosophy Journal</em>,\n40(1): 147–179. doi:10.5840/gfpj20194018", "Rabjerg, Bjørn and Robert Stern, 2018, “Freedom from\nthe Self: Luther and Løgstrup on Sin as ‘Incurvatus in\nSe’”, <em>Open Theology</em>, 4(1): 268–280.\ndoi:10.1515/opth-2018-0020", "Stern, Robert, 2019, <em>The Radical Demand in Løgstrup’s Ethics</em>, Oxford: Oxford University Press, pp. 308–329 (chapter 11).\n</ul>\n<h3 id=\"OtheCiteWork\">"], "Other Cited Works": ["</h3>\n<ul class=\"hanging\">", "Hegel, G. W. F., 1830 [2010], <em>Enzyklopädie der\nphilosophischen Wissenschaften I: Die Wissenschaft der Logik</em>,\ntranslated as <em>Encyclopedia of the Philosophical Sciences, Part I:\nScience of Logic</em>, Klaus Brinkmann and Daniel O. Dahlstrom\n(trans.), Cambridge: Cambridge University Press.", "McGrath, Alister E., 1985, <em>Luther’s Theology of the\nCross</em>, Oxford: Blackwell.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"AbbrForRefeLuthWork\">A. Abbreviations for references to Luther’s works</h3>\n<ul class=\"hanging\">\n<li>[WA] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>, 65\nvols in 127. Weimar: Hermann Böhlau, 1883–1929, Abteilung\n1: Schriften vols 1–56.</li>\n<li>[WA TR] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>,\n65 vols in 127. Weimar: Hermann Böhlau, 1883–1929,\nAbteilung 2: Tischreden vols 1–6.</li>\n<li>[WA DB] <em>D. Martin Luthers Werke: Kritische Gesamtausgabe</em>,\n65 vols in 127. Weimar: Hermann Böhlau, 1883–1929.\nAbteilung 3: Die Deutsche Bibel vols 1–12.</li>\n<li>[LW] <em>Luther’s Works</em>, American edition, 55 vols. St\nLouis and Philadephia: Concordia and Fortress Press,\n1958–86; new series, vols 56–75, 2009–.</li>\n</ul>\n<h3 id=\"BUsefCollSomeLuthMainWrit\">B. Useful collections of some of Luther’s main writings</h3>\n<ul class=\"hanging\">\n<li><em>Martin Luther: Selections from his Writings</em>, edited by\nJohn Dillenberger. Garden City: Anchor Books, 1961.</li>\n<li><em>The Ninety-Five Theses and Other Writings</em>, Trans William\nRussell. Harmondsworth: Penguin, 2017.</li>\n<li><em>The Annotated Luther</em>, edited by Timothy J. Wengert et al,\n6 vols. Minneapolis: Fortress Press, 2015–17.</li>\n</ul>\n<p>\nTranslations have been modified where necessary.</p>\n<h3 id=\"CPrimText\">C. Primary Literature by Others</h3>\n<p>\nReferences for Kant are to the Akademie edition given in the margins\nof most translations, by volume number and page number, except for\nreferences to the <em>Critique of Pure Reason</em>, which are given to\nthe pages of the first (A) edition or second (B) edition, which are\nalso given in the margins of translations of that text.</p>\n<p>\nTranslations have been modified where necessary.</p>\n<ul class=\"hanging\">\n<li>Bloch Ernst, 1963, <em>Thomas Münzer als Theologe der\nRevolution</em>, Frankfurt: Suhrkamp.</li>\n<li>Bramhall, John, 1655, <em>A Defence of True Liberty from\nAnte-cedent and Extrinsicall Necessity</em>, London: John Crook.</li>\n<li>Engels, Friedrich, 1850 [1956], <em>Der deutsche Bauernkrieg</em>;\ntranslated as <em>The Peasant War in Germany</em>, Moissaye J. Olgin\n(trans.), Moscow: International Publishers. [First published as\narticles in <em>Neue Rheinische Zeitung. Politisch-ökonomische\nRevue</em> (Hamburg)].</li>\n<li>Feuerbach, Ludwig, 1843, <em>Das Wesen des Christentums</em>\n(<em>The Essence of Christianity</em>), second edition, Leipzig: Otto\nWigand.</li>\n<li>–––, 1844 [1967], <em>Wesen des Glaubens im\nSinne Luthers</em>, Leipzig: Otto Wigand; translated as <em>The Essence\nof Faith According to Luther</em>, Melvin Cherno (trans.), New York:\nHarper &amp; Row, 1967.</li>\n<li>Fichte, Johann Gottlieb, 1808, <em>Reden an die deutsche\nNation</em> (<em>Addresses to the German Nation</em>),\nBerlin; translated as <em>Addresses to the German Nation</em>, Gregory\nMoore (trans.), Cambridge: Cambridge University Press, 2008.</li>\n<li>Hegel, G. W. F., 1798–99 [1971], “Der Geist des\nChristentums und sein Schicksal”, unpublished\nmanuscript; translated as “The Spirit of Christianity and its\nFate”, T. M. Knox (trans.), in <em>Hegel’s Early\nTheological Writings</em>, Philadelphia, PA: University of\nPennsylvania Press, 1971, 182–281 (originally published\n1948). </li>\n<li>–––, 1821 [1991], <em>Grundlinien der\nPhilosophie des Rechts</em>, Berlin; translated as <em>Elements of the\nPhilosophy of Right</em>, Allen W. Wood (ed.), H. D. Nisbet (trans.),\nCambridge: Cambridge University Press, 1991.</li>\n<li>–––, 1830 [1999], “Address on the\nTercentenary of the Submission of the Augsburg Confession (25 June\n1830)”; translated by H.B. Nisbet in <em>Hegel: Political\nWritings</em>, Laurence Dickey and H. B. Nisbet (eds), Cambridge:\nCambridge University Press, pp. 186–96.</li>\n<li>–––, 1984, <em>Hegel: The Letters</em>, Clark\nButler and Christine Seiler (trans), Bloomington, IN: Indiana\nUniversity Press.</li>\n<li>–––, 2009, <em>Lectures on the History of\nPhilosophy 1825–6, Volume III: Medieval and Modern\nPhilosophy</em>, revised edition, Robert F. Brown (ed./trans.),\nOxford: Oxford University Press.</li>\n<li>–––, 2011, <em>Lectures on the Philosophy of\nWorld History, Volume 1: Manuscripts of the Introduction and the\nLectures of 1822–1823</em>, Robert F. Brown and Peter C. Hodgson\n(eds/trans), Oxford: Oxford University Press.</li>\n<li>Heidegger, Martin, 1924 [2010], “Das Problem der Sünde\nbei Luther”; translated as “The Problem of Sin in\nLuther”, Brian Hansford Bowles (trans.) in <em>Becoming\nHeidegger: On the Trail of his Early Occasional Writings,\n1910–1927</em>, second edition, Theodore Kisiek and Thomas\nSheehan (eds.), (The New Yearbook for Phenomenology and\nPhenomenological Philosophy, 9), Evanston, IL: Northwestern University\nPress, 2010, 183–191.</li>\n<li>Heine, Heinrich, 1835 [2007], <em>Zur Geschichte der Religion und\nPhilosophie in Deutschland</em>; translated as <em>On the History of\nReligion and Philosophy in Germany</em>, Howard Pollack-Milgate\n(trans.), in <em>On the History of Religion and Philosophy in Germany\nand Other Writings</em>, Terry Pinkard (ed.), Cambridge: Cambridge\nUniversity Press, 2007, pp. 3–120.</li>\n<li>Hobbes, Thomas, 1656 [1841], <em>The Questions Concerning Liberty,\nNecessity, and Chance</em>, reprinted in <em>The English Works of\nThomas Hobbes</em>, Sir William Molesworth (ed.), vol 5. London:\nBohn.</li>\n<li>–––, 1688 [2008], <em>Historia Ecclesiastica,\nCarmine Elegiaco Concinnata</em>, London: Augustae Trinobantum. New\nedition with translation, <em>Historia Ecclesiastica</em>, Patricia\nSpringborg, Patricia Stablein, and Paul Wilson (eds), Paris:\nHonoré Champion, 2008.</li>\n<li>–––, 1722, <em>A True Ecclesiastical History\nfrom Moses to the Time of Martin Luther: In Verse</em>, London: E.\nCurll. An anonymous paraphrase of Hobbes 1688.\n [<a href=\"http://hdl.handle.net/2027/njp.32101073248617\" target=\"other\">Hobbes 1722 available online</a>]\n </li>\n<li>–––, 1999, Selections from Hobbes 1656 [1841],\nin Hobbes and Bramhall 1999: 69–90.</li>\n<li>Hobbes, Thomas and John Bramhall, 1999, <em>Hobbes and Bramhall on\nLiberty and Necessity</em>, Vere Chappell (ed.), Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781139164207</li>\n<li>Kant, Immanuel, 1793 [1998], <em>Religion innerhalb der Grenzen\nder bloßen Vernunft</em>; translated as <em>Religion Within the\nBoundaries of Mere Reason</em>, Allen Wood and George di Giovanni\n(trans.), Cambridge: Cambridge University Press, 1998.</li>\n<li>Kierkegaard, Søren, 1843 [1983], <em>Frygt og\nbæven</em>; translated as <em>Fear and Trembling</em>, in\n<em>Fear and Trembling; Repetition</em>, Howard V. Hong and Edna H.\nHong (trans.), (Kierkegaard’s writings, 6), Princeton: Princeton\nUniversity Press, 1983.</li>\n<li>–––, 1846 [1992], <em>Afsluttende uvidenskabelig\nefterskrift</em>; translated as <em>Concluding Unscientific Postscript\nto “Philosophical Fragments”</em>, two volumes, Howard V.\nHong and Edna H. Hong (trans.), (Kierkegaard’s writings, 12),\nPrinceton: Princeton University Press.</li>\n<li>–––, 1851 [1990], <em>Til\nselvprøvelse</em>; translated as <em>For Self-Examination</em>\nin Kierkegaard 1990: 1–88.</li>\n<li>–––, 1859 [1998], <em>Synspunktet for min\nForfatter-Virksomhed</em>, published posthumously; translated as\n<em>The Point of View for My Work as an Author</em> in <em>The Point\nof View</em>, Howard V. Hong and Edna H. Hong (trans.),\n(Kierkegaard’s writings, 22), Princeton: Princeton University\nPress, 21–126.</li>\n<li>–––, 1876 [1990], <em>Dømmer selv</em>;\ntranslated as <em>Judge for Yourself!</em> in Kierkegaard 1990:\n89–216.</li>\n<li>–––, 1990, <em>For Self-Examination; Judge for\nYourself!</em>, Howard V. Hong and Edna H. Hong (trans.),\n(Kierkegaard’s writings, 21), Princeton: Princeton University\nPress.</li>\n<li>–––, [KJP] 1999, <em>Søren\nKierkegaard’s Journals and Papers</em>, 7 volumes, second\nedition, edited and translated by Howard V. and Edna H. Hong, assisted\nby Gregor Malantschuk; Index by N. Hong and C. Barker, Bloomington,\nIN: Indiana University Press.</li>\n<li>Leibniz, Gottfried Wilhelm, 1710 [1985], <em>Essais de\nthéodicée</em>; translated as <em>Theodicy: Essays on\nthe Goodness of God, the Freedom of Man, and the Origin of Evil</em>,\nAustin M. Farrer (ed.), E. M. Muggard (trans.), Peru, IL: Open\nCourt.</li>\n<li>–––, 1976, <em>Philosophical Papers and\nLetters</em>, second edition, Leroy E. Loemker (ed.), Dordrecht:\nReidel. doi:10.1007/978-94-010-1426-7</li>\n<li>Løgstrup, K. E., 1949 [2019], “Die Kategorie und das\nAmt der Verkündigung im Hinblick auf Luther und\nKierkegaard”, <em>Evangelische Theologie</em>, 9(1–6):\n249–269; translated as “The Category and the Office of\nProclamation, with Particular Reference to Luther”, Christopher\nBennett and Robert Stern (trans.), <em>Graduate Faculty Philosophy\nJournal</em>, 2019, 40(1): 183–209.\ndoi:10.5840/gfpj20194019</li>\n<li>–––, 1956 [2020], <em>Den etiske fordring</em>,\nCopenhagen: Gyldendal, reissued Aarhus: Klim, 2010. Translated\nas <em>The Ethical Demand</em>, Bjørn Rabjerg and Robert Stern\n(trans), Oxford: Oxford University Press, 2020.</li>\n<li>–––, 1971 [2020], <em>Etiske begreber og\nproblemer</em>, originally published in the anthology <em>Etik och\nKristen Tro</em>, reissued Aarhus: Klim, 2014; translated\nas <em>Ethical Concepts and Problems</em>, Kees van Kooten Niekerk and\nKristian-Alberto Lykke Cobos (trans.), Oxford: Oxford University\nPress, 2020.</li>\n<li>Marcuse, Herbert, 1936 [1972], “Ideengeschichtlicher\nTeil”, in <em>Studie über Autorität und Familie</em>,\nParis: Librairie Félix Alcan, pp. 136–228; translated as\n“A Study on Authority”, in his <em>From Luther to\nPopper</em>, Joris De Bres (trans.), London: Verso, 1972,\npp. 49–156.</li>\n<li> Nietzsche, Friedrich, 1886 [1966], <em>Jenseits von Gut und\nBöse: Vorspiel einer Philosophie der Zukunft</em>, Leipzig:\nNaumann; translated as <em>Beyond Good and Evil</em>, Walter Kaufmann\n(trans.), New York: Vintage, 1966.</li>\n<li>–––, 1887 [1998], <em>Zur Genealogie der Moral:\nEine Streitschrift</em>, Leipzig: Naumann; translated as <em>On the\nGenealogy of Morality</em>, Maudemarie Clark and Alan Swensen\n(trans.), Indianapolis: Hackett, 1998.</li>\n<li>Novalis, 1799 [1996], “Die Christenheit oder Europa”;\ntranslated as “Christianity or Europe: A Fragment”, in\n<em>The Early Writings of the German Romantics</em>, Frederick C.\nBeiser (ed. and trans.), Cambridge: Cambridge University Press, 1996,\npp. 59–79.</li>\n<li>Schelling, F. W. J., 1809 [2006], <em>Philosophische\nUntersuchungen über das Wesen der menschlichen Freiheit und die\ndamit zusammenhängenden Gegenstände</em>; translated as\n<em>Philosophical Investigations into the Essence of Human\nFreedom</em>, Jeff Love and Johannes Schmidt (trans), Albany, NY: SUNY\nPress, 2006.</li>\n</ul>\n<h3 id=\"DSeco\">D. Secondary Literature</h3>\n<h4>D.1 General</h4>\n<ul class=\"hanging\">\n<li>Antognazza, Maria Rosa, 1996, “Hofmann-Streit: Il Dibattito\nSul Rapporto Tra Filosofia e Teologia All’università Di\nHelmstedt”, <em>Rivista Di Filosofia Neo-Scolastica</em>, 88(3):\n390–420.</li>\n<li>Assel, Heinrich, 2014, “The Uses of Luther’s Thought\nin the Nineteenth Century and the Luther Renaissance”, in Kolb,\nDingel, and Bakta 2014: 551–572.</li>\n<li>Bauch, Bruno, 1917, “Unser philosophisches Interesse an\nLuther”, <em>Zeitschrift für Philosophie und philosophische\nKritik</em>, 164: 128–48.</li>\n<li>Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and his\nPredecessors</em>, Cambridge, MA: Harvard University Press, Part\nTwo.</li>\n<li>Bornhamm, Heinrich, 1955, <em>Luther im Spiegel der deutschen\nGeistesgeschichte: Mit ausgewälten Texten von Lessing bis zur\nGegenwart</em>, Heidelberg: Quelle &amp; Meyer.</li>\n<li>Erdozain, Dominic, 2016, <em>The Soul of Doubt: The Religious Roots of Unbelief from Luther to Marx</em>, Oxford: Oxford University Press.</li>\n<li>Gillespie, Michael Allen, 2008, <em>The Theological Origins of\nModernity</em>, Chicago: University of Chicago Press.</li>\n<li>Hampson, Daphne, 2017, “Luther, Lutheranism, and\nPost-Christianity”, in <em>Oxford Research Encyclopedia of\nReligion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.507</li>\n<li>Helmer, Christine, 2019, <em>How Luther Became the Reformer</em>, Louisville, KY: Westminster John Knox Press.</li>\n<li>Hunter, Ian, 2006, “The University Philosopher in Early\nModern Germany”, in <em>The Philosopher in Early Modern\nEurope</em>, Conal Condren, Stephen Gaukroger, and Ian Hunter (eds.),\nCambridge: Cambridge University Press, 35–65.\ndoi:10.1017/CBO9780511490460.003</li>\n<li>Kolb, Robert, Irene Dingel, and L’ubomír Batka\n(eds.), 2014, <em>The Oxford Handbook of Martin Luther’s\nTheology</em>, Oxford: Oxford University Press.\ndoi:10.1093/oxfordhb/9780199604708.001.0001</li>\n<li>Maritain, Jacques, 1925 [1928], <em>Trois Réformateurs:\nLuther, Descartes, Rousseau</em>, Paris: Librairie Plon; translated as\n<em>Three Reformers: Luther, Descartes, Rousseau</em>, London: Sheed\nand Ward.</li>\n<li>Massing, Michael, 2018, <em>Fatal Discord: Erasmus, Luther, and\nthe Fight for the Western Mind</em>, New York: Harper.</li>\n<li>Melloni, Alberto (ed.), 2017, <em>Martin Luther: A Christian\nBetween Reforms and Modernity (1517–2017)</em>, Berlin: De\nGruyter. doi:10.1515/9783110499025</li>\n<li>Metzke, Erwin, 1934–35, “Lutherforschung und deutsche\nPhilosophiegeschichte”, <em>Blätter für deutsche\nPhilosophie</em>, 8: 355–82.</li>\n<li>Pelikan, Jaroslav, 1950, <em>From Luther to Kierkegaard</em>,\nSaint Louis, MO: Concordia.</li>\n<li>Podmore, Simon D., 2017, “Martin Luther in Modern European\nPhilosophy”, in <em>Oxford Research Encyclopedia of\nReligion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.317</li>\n<li>Popkin, Richard H., 1979, <em>The History of Scepticism from\nErasmus to Spinoza</em>, Berkeley: University of California\nPress.</li>\n<li>Regier, Jonathan, 2016, “Logic, Mathematics and Natural\nLight: Liddel on the Foundations of Knowledge”, in <em>Duncan\nLiddel (1561-1613)</em>, Pietro Daniel Omodeo (ed.), Leiden: Brill,\n113–129. doi:10.1163/9789004310667_006</li>\n<li>Rota, Giovanni, 2017, “Luther in Nineteenth and Twentieth\nCentury Philosophy”, in Melloni 2017: 883–910.\ndoi:10.1515/9783110499025-051</li>\n<li>Smith, Leonard S., 2009, <em>Religion and the Rise of History:\nMartin Luther and the Cultural Revolution in Germany,\n1760–1810</em>, Eugene, OR: Cascade.</li>\n<li>Tessitore, Fulvio, 2017, “The\n<em>Universalgeschichtlich</em> Role of the Reformation According to\nIdealism and Historicism within German Culture”, in Melloni\n2017: 911–932. doi:10.1515/9783110499025-052</li>\n<li>Weber, Max, 1905, <em>Protestantische Ethik und der Geist des\nKapitalismus</em>, <em>Archiv für Sozialwissenschaft und\nSozialpolitik</em>, 20(1): 1–54, 21(1): 1–110; translated\nas <em>The Protestant Ethic and the Spirit of Capitalism</em>, Talcott\nParsons (trans.), London: Routledge, 1992. Revised version of the 1930\nedition.</li>\n<li>Zachhuber, Johannes, 2017, “Martin Luther and Modernity,\nCapitalism, and Liberalism”, in <em>Oxford Research Encyclopedia\nof Religion</em>, John Barton (ed.), Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199340378.013.301</li>\n<li>Zeeden, Ernst Walter, 1950 [1954], <em>Martin Luther und die\nReformation im Urteil des deutschen Luthertums</em>, volume 1,\nFreiburg: Herder; translated as <em>The Legacy of Luther</em>, Ruth\nMary Bethell (trans.), London: Hollis &amp; Carter, 1954.</li>\n</ul>\n<h4>D.2 Hobbes</h4>\n<ul class=\"hanging\">\n<li>Cromartie, Alan, 2018, “Hobbes, Calvinism, and\nDeterminism”, in <em>Hobbes on Politics and Religion</em>,\nLaurens van Apeldoorn and Robin Douglass (eds), Oxford: Oxford\nUniversity Press, pp. 95–115. </li>\n<li>Damrosch, Leopold, 1979, “Hobbes as Reformation Theologian:\nImplications of the Free-Will Controversy”, <em>Journal of the\nHistory of Ideas</em>, 40(3): 339–352. doi:10.2307/2709241</li>\n<li>Jackson, Nicholas D., 2007, <em>Hobbes, Bramhall and the Politics\nof Liberty and Necessity: A Quarrel of the Civil Wars and\nInterregnum</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511495830</li>\n<li>Kodalle, Klaus-Michael, 1990, “Sterbliche Götter:\nMartin Luthers Ansichten zu Statt, Recht und Gewalt als Vorgriff auf\nHobbes”, in <em>Hobbes oggi</em>, Andrea Napoli (ed), Milan:\nFranco Angeli, pp. 122–142.</li>\n<li>Overhoff, Jürgen, 1997, “The Lutheranism of Thomas\nHobbes”, <em>History of Political Thought</em>, 18(4):\n604–623.</li>\n</ul>\n<h4>D.3 Leibniz</h4>\n<ul class=\"hanging\">\n<li>Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, Oxford: Oxford University Press.</li>\n<li>Antognazza, Maria Rosa, 2008, <em>Leibniz on the Trinity and the\nIncarnation: Reason and Revelation in the Seventeenth Century</em>,\nNew Haven, CT: Yale University Press.</li>\n<li>–––, 2009, <em>Leibniz: An Intellectual\nBiography</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2018a, “Faith and Reason”\nin <em>The Oxford Handbook of Leibniz</em>, Maria Rosa Antognazza\n(ed.), Oxford: Oxford University Press, pp. 717–34.</li>\n<li>–––, 2018b, “Philosophical Theology and\nChristian Doctrines” in <em>The Oxford Handbook of Leibniz</em>,\nMaria Rosa Antognazza (ed.), Oxford: Oxford University Press, pp.\n735–55</li>\n<li>Backus, Irena, 2016, <em>Leibniz: Protestant Theologian</em>,\nOxford: Oxford University Press.</li>\n<li>Fouke, Daniel C., 1992, “Metaphysics and the Eucharist in\nthe Early Leibniz”, <em>Studia Leibnitiana</em>, 24(2):\n145–159. </li>\n<li>Goldenbaum, Ursula, 1998, “Leibniz as a Lutheran”, in\n<em>Leibniz, Mysticism and Religion</em>, A. P. Coudert et al. (eds),\nDordrecht: Kluwer, pp. 169–192.</li>\n<li>Hillman, T. Allan, 2013, “Leibniz and Luther on the\nNon-Cognitive Component of Faith”, <em>Sophia</em>, 52(2):\n219–234. doi:10.1007/s11841-012-0310-8</li>\n<li>Hinlicky, Paul R., 2009, <em>Paths Not Taken: Fates of Theology\nfrom Luther Through Leibniz</em>, Grand Rapids, MI: Eerdmans.</li>\n<li>Mercer, Christia, 2002, <em>Leibniz’s Metaphysics: Its\nOrigins and Development</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Pichler, Alois, 1869–70, <em>Die Theologie des Leibniz</em>,\n2 vols., Munich: Gotta Buchhandlung.</li>\n<li>Schweitz, Lea F., 2011, “Reasoning Faithfully: Leibniz on\nReason’s Triumph of Faith and Love”, in <em>The\nDevil’s Whore: Reason and Philosophy in the Lutheran\nTradition</em>, Jennifer Hockenbery Dragseth (ed), Minneapolis, MN:\nFortress Press, pp. 79–85.</li>\n</ul>\n<h4>D.4 Kant</h4>\n<ul class=\"hanging\">\n<li>Bauch, Bruno, 1904, <em>Luther und Kant</em>, Berlin: Reuther\n&amp; Reichard.</li>\n<li>Bohatec, Josef, 1938, <em>Die Religionsphilosophie Kants in der\n“Religion innerhalb der Grenzen der blossen Vernunft”, mit\nbesonderer Berücksichtigung ihrer theologisch-dogmatischen\nQuellen</em>, Hamburg: Hoffmann und Campe.</li>\n<li>Dienst, Karl, 2004, “Kant als ‘Philosoph des\nProtestantismus?’”, <em>Journal für\nReligionskultur</em>, 194: 1–8.</li>\n<li>Ebbinghaus, Julius, 1927, “Luther und Kant”,\n<em>Luther-Jahrbuch</em>, 9: 119–155.</li>\n<li>Eiben, Jürgen, 1989, <em>Von Luther zu Kant: Der deutsche\nSonderweg in die Moderne</em>, Wiesbaden: Springer.</li>\n<li>Kanterian, Edward, 2017, <em>Kant, God and Metaphysics: The Secret\nThorn</em>, Abingdon: Routledge.</li>\n<li>Kuehn, Manfred, 2001, <em>Kant: A Biography</em>, Cambridge:\nCambridge University Press.</li>\n<li>Lindberg, Carl (ed), 2005, <em>The Pietist Theologians</em>,\nOxford: Blackwell.</li>\n<li>Lötzsch, Frider, 1976, <em>Vernunft und Religion im Denken\nKants: Lutherisches Erbe bei Immanuel Kant</em>, Köln:\nBöhlau Verlag.</li>\n<li>Paulsen, Friedrich, 1900, “Kant der Philosoph des\nProtestantismus”, <em>Kant-Studien</em>, 4: 1– 31.</li>\n<li>Raffelt, Albert, 2005, “Kant als Philosoph des\nProtestantismus – oder des Katholizismus?” in <em>Kant und\nder Katholizismus: Stationen einer wechselhaften Geschichte</em>,\nNobert Fischer (ed.), Freiburg: Herder, pp. 139–159.</li>\n<li>Shantz, Douglas H., 2013, <em>An Introduction to German\nPietism</em>, Baltimore, MD: John Hopkins University Press.</li>\n<li>Vanden Auweele, Dennis, 2013, “The Lutheran Influence on\nKant’s Depraved Will”, <em>International Journal for\nPhilosophy of Religion</em>, 73(2): 117–134.\ndoi:10.1007/s11153-011-9331-4</li>\n<li>Wand, Bernard, 1971, “Religious Concepts and Moral Theory:\nLuther and Kant”, <em>Journal of the History of Philosophy</em>,\n9(3): 329–348. doi:10.1353/hph.2008.1268</li>\n<li>White, Roger, 1990, “‘Ought’ Implies\n‘Can’: Kant and Luther, a Contrast”, in <em>Kant and\nHis Influence</em>, G. M. Ross and T. McWalter (eds), Bristol:\nThommes, pp. 1–72.</li>\n</ul>\n<h4>D.5 Fichte</h4>\n<ul class=\"hanging\">\n<li>La Vopa, Anthony J., 2001, <em>Fichte: The Self and the Calling of\n1762–1799</em>, Cambridge: Cambridge University Press.</li>\n</ul>\n<h4>D.6 Hegel</h4>\n<ul class=\"hanging\">\n<li>Asendorf, Ulrich, 1982, <em>Luther und Hegel: Untersuchungen zur\nGrundlegung einer neuen systematischen Theologie</em>, Wiesbaden:\nSteiner.</li>\n<li>Duquette, David A., 1984, “Comment on Merold\nWestphal’s ‘Hegel and the Reformation’”, in\n<em>History and System: Hegel’s Philosophy of History</em>,\nRobert L. Perkins (ed), Albany, NY: SUNY Press, pp. 92–99.</li>\n<li>Houlgate, Stephen, 2006, <em>The Opening of Hegel’s\n“Logic”: From Being to Infinity</em>, West Lafayette, IN:\nPurdue University Press.</li>\n<li>–––, 2015, “Glaube, Liebe, Verzeihung:\nHegel und die Religion”, <em>Hegel-Studien</em>, 49:\n13–38.</li>\n<li>Jaeschke, Walter, 1986 [1992], <em> Die Vernunft in der Religion:\nStudien zur Grundlegung der Religionsphilosophie Hegels</em>,\nStuttgart-Bad Cannstatt : Frommann-Holzboog; translated as <em>Reason\nin Religion: The Foundations of Hegel’s Philosophy of\nReligion</em>, J. Michael Stewart and Peter C. Hodgson (trans.),\nBerkeley, CA: University of California Press, 1992.</li>\n<li>Macgee, Glenn Alexander, 2001, <em>Hegel and the Hermetic\nTradition</em>, Ithaca, NY: Cornell University Press. </li>\n<li>Maurer, Ernstpeter, 1996, <em>Der Mensch im Geist: Untersuchungen\nzur Anthropologie bei Hegel und Luther</em>, Gütersloh:\nGütersloher Verlagshaus.</li>\n<li>Merklinger, Philip M., 1993, “Unveiling Faith and Spirit:\nHegel’s Criticism of Schleiermacher in the Foreword”, in\nhis <em>Philosophy, Theology, and Hegel’s Berlin Philosophy of\nReligion: 1821–1827</em>, Albany, NY: SUNY Press, 75–113\n(chapter 3).</li>\n<li>Mure, G. R. G., 1966, “Hegel, Luther, and the Owl of\nMinerva”, <em>Philosophy</em>, 41(156): 127–139.\ndoi:10.1017/S0031819100058502</li>\n<li>Olson, Alan M., 1992, <em>Hegel and the Spirit: Philosophy as\nPneumatology</em>, Princeton, NJ: Princeton University Press.</li>\n<li>O’Regan, Cyril, 1994, <em>The Heterodox Hegel</em>, New\nYork: SUNY Press.</li>\n<li>Ritter, Joachim, 1975 [1982], “Hegel und die\nReformation”, in <em>Unbefangenes Christentum. Deutsche\nRepräsentanten und Interpreten des Protestantismus. Eine\nSendereihe des Deutschlandfunks</em>, W. Schmidt (ed.), Munich;\ntranslated as “Hegel and the Reformation”, in\nRitter’s <em>Hegel and the French Revolution: Essays on the\nPhilosophy of Right: Essays on the Philosophy of Right</em>, Richard\nDien Winfield (trans.), Cambridge, MA: MIT Press, 1982, pp.\n183–91.</li>\n<li>Rotstein, Abraham, 2018, <em>Myth, Mind and Religion: The\nApocalyptic Narrative</em>, New York: Peter Lang, Chapters 7 and\n8.</li>\n<li>Thaidigsmann, Edgar, 1983, <em>Identitätsverlangen und\nWiderspruch: Kreuzestheologie bei Luther, Hegel und Barth</em>,\nMunich: Kaiser.</li>\n<li>Westphal, Merold, 1984, “Hegel and the Reformation”,\nin <em>History and System: Hegel’s Philosophy of History</em>,\nRobert L. Perkins (ed), Albany, NY: SUNY Press, pp. 73–92.</li>\n</ul>\n<h4>D.7 Schelling</h4>\n<ul class=\"hanging\">\n<li>Hatem, Jan, 2013, <em>Liberté humaine et divine ironie:\nSchelling avec Luther</em>, Paris: Orizons.</li>\n<li>Laughland, John, 2007, <em>Schelling versus Hegel: From German\nIdealism to Christian Metaphysics</em>, Aldershot: Ashgate.</li>\n<li>Wirth, Jason M., 2019, “Schelling and Luther”,\n<em>Theological Research. The Journal of Systematic Theology</em>, 5:\n93–105. doi:10.15633/thr.3303</li>\n</ul>\n<h4>D.8 Kierkegaard</h4>\n<ul class=\"hanging\">\n<li>Barnett, Christopher B., 2011, <em>Kierkegaard, Pietism and\nHoliness</em>, London: Routledge.</li>\n<li>Barrett, Lee, 2002, “Faith, Works, and the Uses of the Law:\nKierkegaard’s Appropriation of Lutheran Doctrine”, in\n<em>For Self-Examination and Judge for Yourself!</em>, Robert L.\nPerkins (ed), Macon, GA: Mercer University Press, pp.\n77–109.</li>\n<li>–––, 2015, “Kierkegaard’s\nAppropriation and Critique of Luther and Lutheranism”, in <em>A\nCompanion to Kierkegaard</em>, Jon Stewart (ed), Oxford:\nWiley-Blackwell, pp. 180–92.</li>\n<li>Bragstad, William R., 1976, “Luther’s Influence on\nTraining in Christianity”, <em>The Lutheran Quarterly</em>, 28;\n257–271.</li>\n<li>Burgess, Andrew, 2000, “Kierkegaard’s Concept of\nRedoubling and Luther’s <em>Simul Justus</em>”, in\n<em>Works of Love</em>, Robert L. Perkins (ed), Macon, GA: Mercer\nUniversity Press, pp. 39–55.</li>\n<li>Fabro, Cornelio, 1984, “Kierkegaard e Lutero:\nincontro-scontro”, <em>Humanitas</em>, 39: 5–12.</li>\n<li>Hall, Amy Laura, 2002, “The Call to Confession in\nKierkegaard’s <em>Works of Love</em>”, in <em>Kierkegaard\nand the Treachery of Love</em>, Cambridge: Cambridge University Press,\npp. 11–50 (chapter 1).</li>\n<li>Hampson, Daphne, 2001, “Kierkegaard’s Odyssey”,\nin <em>Christian Contradictions: The Structures of Lutheran and\nCatholic Thought</em>, Cambridge: Cambridge University Press,\n249–284 (chapter 7).</li>\n<li>–––, 2013, <em>Kierkegaard: Exposition and\nCritique</em>, Oxford: Oxford University Press.</li>\n<li>Hinkson, Craig, 2001, “Luther and Kierkegaard: Theologians\nof the Cross”, <em>International Journal of Systematic\nTheology</em>, 3(1): 27–45. doi:10.1111/1463-1652.00049</li>\n<li>–––, “Will the Real Martin Luther Please\nStand Up! Kierkegaard’s View of Luther versus the Evolving\nPerceptions of the Tradition”, in <em>For Self-Examination and\nJudge for Yourself!</em>, Robert L. Perkins (ed), Macon, GA: Mercer\nUniversity Press, pp. 41–76.</li>\n<li>Hughes, Carl S., 2017, “Søren Kierkegaard: Protesting\nthe Lutheran Establishment”, in <em>Radical Lutherans/Lutheran\nRadicals</em>, Jason A. Mahn (ed), Eugene, OR: Cascade Books, pp.\n43–69.</li>\n<li>Kim, David Yoon-Jung and Joel Rasmussen, 2009, “Martin\nLuther: Reform, Secularization, and the Question of His “True\nSuccessor””, in <em>Kierkegaard and the Renaissance and\nModern Traditions, Tome II Theology</em>, Jon Stewart (ed), Aldershot:\nAshgate, pp. 173–217.</li>\n<li>Koenker, Ernst B., 1968, “Søren Kierkegaard on\nLuther”, in <em>Interpreters of Luther: Essays in Honor of\nWilhelm Pauck</em>, Jaroslav Pelikan (ed), Philadelphia, PA: Fortress\nPress, pp. 234–48.</li>\n<li>Løkke, Håvard and Arild Waaler, 2009,\n“Gottfried Wilhelm Leibniz: Traces of Kierkegaard’s\nReading of the <em>Theodicy</em>” in <em>Kierkegaard and the\nRenaissance and Modern Traditions, Tome I Philosophy</em>, Jon Stewart\n(ed), Aldershot: Ashgate, pp. 51–76.</li>\n<li>Palmer, Elizabeth, 2017, <em>Faith in a Hidden God: Luther,\nKierkegaard, and the Binding of Isaac</em>, Minneapolis, MN: Fortress\nPress.</li>\n<li>Podmore, Simon D., 2006, “The Lightning and the Earthquake:\nKierkegaard on the <em>Anfechtung</em> of Luther”, <em>The\nHeythrop Journal</em>, 47(4): 562–578.\ndoi:10.1111/j.1468-2265.2006.00298.x</li>\n<li>–––, 2013, <em>Struggling With God: Kierkegaard\nand the Temptation of Spiritual Trial</em>, Cambridge: James\nClarke.</li>\n<li>Prenter, Regin, 1981, “Luther and Lutheranism”, in\n<em>Kierkegaard and the Great Traditions</em>, Niels Thulstrup and\nMarie Mikulová Thulstrup (eds), Copenhagen: C.A. Reitzel, pp.\n121–72.</li>\n<li>Sløk, Johannes, 1962, “Kierkegaard and Luther”,\nin <em>A Kierkegaard Critique</em>, Howard A. Johnson and Niels\nThulstrup (eds), New York: Harper, pp. 85–101.</li>\n<li>Thulstrup, Maria Mikulová, 1967, <em>Kierkegaard og\nPietismen</em>, Copenhagen: Munksgaard.</li>\n</ul>\n<h4>D.9 Nietzsche</h4>\n<ul class=\"hanging\">\n<li>Bluhm, Heinz, 1943, “Das Lutherbild der jungen\nNietzsche”, <em>Publications of the Modern Languages Association\nof America</em>, 58(1): 264–288. doi:10.2307/459044</li>\n<li>–––, 1950, “Nietzsche’s Idea of\nLuther in <em>Menschliches, Allzumenschliches</em>”,\n<em>Publications of the Modern Languages Association of America</em>,\n65(6): 1053–1068. doi:10.2307/459719</li>\n<li>–––, 1953, “Nietzsche’s View of\nLuther and the Reformation in <em>Morgenröthe</em> and <em>Die\nfröhliche Wissenschaft</em>”, <em>Publications of the\nModern Languages Association of America</em>, 68(1): 111–127.\ndoi:10.2307/459910</li>\n<li>–––, 1956, “Nietzsche’s Final View\nof Luther and the Reformation”, <em>Publications of the Modern\nLanguages Association of America</em>, 71(1): 75–83.\ndoi:10.2307/460193</li>\n<li>Fraser, Giles, 2002, <em>Redeeming Nietzsche: On the Piety of\nUnbelief</em>, London: Routledge.</li>\n<li>Hirsch, Emanuel, 1920–21, “Nietzsche und\nLuther”, <em>Jahrbuch der Luther-Gesellschaft</em>, 2–3:\n61–106; reprinted in <em>Nietzsche-Studien</em>, 15 (1986):\n398–439.</li>\n<li>Hollingdale, Richard, 1961, “Introduction” to\nNietzsche’s <em>Thus Spoke Zarathustra</em>, Richard Hollingdale\n(trans.), Harmondsworth: Penguin.</li>\n<li>Large, Duncan, 2003, “‘Der Bauernaufstand des\nGeistes’: Nietzsche, Luther and the Reformation”, in\n<em>Nietzsche and the German Tradition</em>, Nicholas Martin (ed),\nBern: Peter Lang, pp. 111–137.</li>\n<li>Pernet, Martin, 1995, “Friedrich Nietzsche and\nPietism”, <em>German Life and Letters</em>, 48(4):\n474–486. doi:10.1111/j.1468-0483.1995.tb01647.x</li>\n<li>Westall, Joseph, 2004, “Zarathustra’s Germanity:\nLuther, Goethe, Nietzsche”, <em>Journal of Nietzsche\nStudies</em>, 27: 42–63.</li>\n</ul>\n<h4>D.10 Feuerbach and Marxism</h4>\n<ul class=\"hanging\">\n<li>Adamson, Walter Luiz, 2013, “Gramsci, Catholicism and\nSecular Religion”, <em>Politics, Religion &amp; Ideology</em>,\n14(4): 468–484. doi:10.1080/21567689.2013.829047</li>\n<li>Adorno, Theodor W., 1933 [1989], <em>Kierkegaard: Konstruktion des\nÄsthetischen</em>, Tübingen, Mohr; translated as\n<em>Kierkegaard: Construction of the Aesthetic</em>, Robert\nHullot-Kentor (trans.), Minneapolis, MN: University of Minnesota\nPress, 1989.</li>\n<li>–––, 1951 [2005], <em>Minima Moralia: Minima\nMoralia: Reflexionen aus dem beschädigten Leben</em>, Frankfurt\nam Main: Suhrkamp; translated as <em>Minima Moralia: Reflections From\nDamaged Life</em>, E. F. N. Jephcott (trans.), London: Verso, 2005.\n</li>\n<li>–––, 1970 [1984], <em>Ästhetische\nTheorie</em>, Frankfurt am Main: Suhrkamp; translated as <em>Aesthetic\nTheory</em>, C. Lenhardt (trans.), London: Routledge, 1984. </li>\n<li>Barth, Karl, 1957, “An Introductory Essay”, James\nLuther Adams (trans.), to Ludwig Feuerbach, <em>The Essence of\nChristianity</em>, George Elliot (trans.), New York: Harper and Row,\npp. x–xxxii.</li>\n<li>Bayer, Oswald, 1972, “Gegen Gott für den Menschen: Zu\nFeuerbachs Lutherrezeption”, <em>Zeitschrift für Theologie\nund Kirche</em>, 69: 34–71.</li>\n<li>–––, 1981, “Marcuses Kritik an Luthers\nFreiheitsbegriff”, in <em>Umstrittene Freiheit:\nTheologisch-philosophische Kontroversen</em>, Tübingen: Mohr, pp.\n13–38.</li>\n<li>Boer, Roland, 2017, “Luther and Marxism”, in Melloni\n2017: 953–964. doi:10.1515/9783110499025-054</li>\n<li>–––, 2019, “From Luther to Marx and\nEngels”, in his <em>Red Theology: On the Christian Communist\nTradition</em>, Leiden: Brill, pp. 61–103.</li>\n<li>Brady, Thomas A. Jr., 2014, “Marxist Evaluations of\nLuther’s Thought”, in Kolb, Dingel, and Bakta 2014:\n573–583.</li>\n<li>Brendler, Gerhard, 1991, <em>Martin Luther: Theology and\nRevolution</em>, Claude R. Foster Jr (trans.), Oxford: Oxford\nUniversity Press.</li>\n<li>Brunvoll, Arve, 1996, <em>“Gott ist Mensch”: Die\nLuther-Rezeption Ludwig Feuerbachs und die Entwicklung seiner\nReligionskritik</em>, Frankfurt: Peter Lang.</li>\n<li>Chino, Taido J., 2020, “Reforming Promeity:\nFeuerbach’s Misreading of Luther”, <em>International\nJournal of Philosophy and Theology</em>, 81(1): 71–86.\ndoi:10.1080/21692327.2019.1597756</li>\n<li>Glasse, John, 1972, “Why Did Feuerbach Concern Himself With\nLuther?”, <em>Revue Internationale de Philosophie</em>, 26(101):\n364–385.</li>\n<li>–––, 1975, “Feuerbach und die Theologie:\nSechs Thesen über den Fall Luther”, in <em>Atheismus in der\nDiskussion: Kontroversen um Ludwig Feuerbach</em>, Hermann Lübbe\nand Hans-Martin Sass (eds), Munich: Kaiser, pp. 28–35.</li>\n<li>Harvey, Van A., 1998, “Feuerbach on Luther’s Doctrine\nof Revelation: An Essay in Honor of Brian Gerrish”, <em>The\nJournal of Religion</em>, 78(1): 3–17. doi:10.1086/490120</li>\n<li>Kern, Udo, 1984, “Zu Ludwig Feuerbachs\nLutherverständnis”, <em>Neue Zeitschrift für\nSystematische Theologie und Religionsphilosophie</em>, 26:\n29–44.</li>\n<li>Lehmann, Hartmut, 2004, “Das marxistische Lutherbild von\nEngels bis Honecker”, in <em>Luther zwischen den Kulturen:\nZeitgenossenschaft – Weltwirkung</em>, Hans Medick and Peer\nSchmidt (eds), Göttingen: Vandenhoeck &amp; Ruprecht, pp.\n500–516.</li>\n<li>–––, 2004, “The Rehabilitation of Martin\nLuther in the GDR, or Why Thomas Müntzer Failed to Stabilise the\nMoorings of Socialist Ideology”, in <em>Religion in the Cold\nWar</em>, Dianne Kirby (ed), New York: Vandenhoeck &amp; Ruprecht, pp.\n200–210.</li>\n<li>Lindberg, Carter, 1970, “Luther and Feuerbach”,\n<em>Sixteenth Century Essays and Studies</em>, 1: 107–125.\ndoi:10.2307/3003687</li>\n<li>Rotstein, Abraham, 2018, <em>Myth, Mind and Religion: The\nApocalyptic Narrative</em>, New York: Peter Lang: Chapter 9.</li>\n</ul>\n<h4>D.11 Heidegger</h4>\n<ul class=\"hanging\">\n<li>Armitage, Duane, 2016, <em>Heidegger’s Pauline and Lutheran\nRoots</em>, London: Palgrave Macmillan.</li>\n<li>Clifton-Soderstrom, Karl, 2009, “The Phenomenology of\nReligious Humility in Heidegger’s Reading of Luther”,\n<em>Continental Philosophy Review</em>, 42(2): 171–200.\ndoi:10.1007/s11007-009-9102-4</li>\n<li>Crowe, Benjamin, 2006, “Luther’s <em>Theologia\nCrucis</em>” in <em>Heidegger’s Religious Origins</em>,\nBloomington and Indianapolis: Indiana University Press, pp.\n15–43 (chapter 2).</li>\n<li>McGrath, S. J., 2006, <em>The Early Heidegger and Medieval\nPhilosophy: Phenomenology for the Godforsaken</em>, Washington, DC:\nThe Catholic University of America Press.</li>\n<li>Pöggeler, Otto, 2004, “Heideggers Luther-Lektüre\nim Freiburg Theologenkonvikt”, <em>Heidegger-Jahrbuch</em>, 1:\n185–196.</li>\n<li>Schlink, Edmund, 1955, “Weisheit und Torheit”,\n<em>Kerygma und Dogma</em>, 1: 1–22.</li>\n<li>Sommer, Christian, 2005, <em>Aristote, Heidegger, Luther: Les\nsources aristotéliciennes et néo-testamentaires\nd’Être et temps</em>, Paris: PUF.</li>\n<li>Stanley, Timothy, 2007, “Heidegger on Luther on Paul”,\n<em>Dialog: A Journal of Theology</em>, 46(1): 41–45.\ndoi:10.1111/j.1540-6385.2007.00306.x</li>\n<li>Van Buren, John, 1994, “Martin Heidegger, Martin\nLuther”, in <em>Reading Heidegger from the Start: Essays in His\nEarliest Thought</em>, Theodore J. Kisiel and John Van Buren (eds),\nAlbany, NY: State University of New York Press, pp. 159–74.</li>\n</ul>\n<h4>D.12 Løgstrup</h4>\n<ul class=\"hanging\">\n<li>Andersen, Svend, 2007, “In the Eyes of a Lutheran\nPhilosopher: How Løgstrup Treated Moral Thinkers”, in\n<em>Concern for the Other: Perspectives on the Ethics of K. E.\nLøgstrup</em>, Svend Andersen and Kees van Kooten Niekerk\n(eds), Notre Dame, IN: Notre Dame University Press, pp.\n29–53.</li>\n<li>–––, 2017, <em>Løgstrup og Luther</em>,\nAarhus: Klim.</li>\n<li>Bennett, Christopher, Paul Faulkner, and Robert Stern, 2019,\n“Indirect Communication, Authority, and Proclamation as a\nNormative Power: Løgstrup’s Critique of\nKierkegaard”, <em>Graduate Faculty Philosophy Journal</em>,\n40(1): 147–179. doi:10.5840/gfpj20194018</li>\n<li>Rabjerg, Bjørn and Robert Stern, 2018, “Freedom from\nthe Self: Luther and Løgstrup on Sin as ‘Incurvatus in\nSe’”, <em>Open Theology</em>, 4(1): 268–280.\ndoi:10.1515/opth-2018-0020</li>\n<li>Stern, Robert, 2019, <em>The Radical Demand in Løgstrup’s Ethics</em>, Oxford: Oxford University Press, pp. 308–329 (chapter 11).</li>\n</ul>\n<h3 id=\"OtheCiteWork\">Other Cited Works</h3>\n<ul class=\"hanging\">\n<li>Hegel, G. W. F., 1830 [2010], <em>Enzyklopädie der\nphilosophischen Wissenschaften I: Die Wissenschaft der Logik</em>,\ntranslated as <em>Encyclopedia of the Philosophical Sciences, Part I:\nScience of Logic</em>, Klaus Brinkmann and Daniel O. Dahlstrom\n(trans.), Cambridge: Cambridge University Press.</li>\n<li>McGrath, Alister E., 1985, <em>Luther’s Theology of the\nCross</em>, Oxford: Blackwell.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Adorno, Theodor W.", "Bayle, Pierre", "Feuerbach, Ludwig Andreas", "Hamann, Johann Georg", "Hegel, Georg Wilhelm Friedrich", "Heidegger, Martin", "Herder, Johann Gottfried von", "Hobbes, Thomas", "Jacobi, Friedrich Heinrich", "Kant, Immanuel", "Kierkegaard, Søren", "Leibniz, Gottfried Wilhelm", "Luther, Martin", "Marcuse, Herbert", "Maritain, Jacques", "Nietzsche, Friedrich", "Novalis [Georg Friedrich Philipp von Hardenberg]", "Schelling, Friedrich Wilhelm Joseph von", "Wolff, Christian"], "entry_link": [{"../adorno/": "Adorno, Theodor W."}, {"../bayle/": "Bayle, Pierre"}, {"../ludwig-feuerbach/": "Feuerbach, Ludwig Andreas"}, {"../hamann/": "Hamann, Johann Georg"}, {"../hegel/": "Hegel, Georg Wilhelm Friedrich"}, {"../heidegger/": "Heidegger, Martin"}, {"../herder/": "Herder, Johann Gottfried von"}, {"../hobbes/": "Hobbes, Thomas"}, {"../friedrich-jacobi/": "Jacobi, Friedrich Heinrich"}, {"../kant/": "Kant, Immanuel"}, {"../kierkegaard/": "Kierkegaard, Søren"}, {"../leibniz/": "Leibniz, Gottfried Wilhelm"}, {"../luther/": "Luther, Martin"}, {"../marcuse/": "Marcuse, Herbert"}, {"../maritain/": "Maritain, Jacques"}, {"../nietzsche/": "Nietzsche, Friedrich"}, {"../novalis/": "Novalis [Georg Friedrich Philipp von Hardenberg]"}, {"../schelling/": "Schelling, Friedrich Wilhelm Joseph von"}, {"../wolff-christian/": "Wolff, Christian"}]}, "academic_tools": {"listed_text": ["\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=luther-influence\" target=\"other\">How to cite this entry</a>.", "\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n", "<a href=\"https://leibniz.stanford.edu/friends/preview/luther-influence/\" target=\"other\">Preview the PDF version of this entry</a>\n at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "\n<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>\n", "<a href=\"https://www.inphoproject.org/entity?sep=luther-influence&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "\n<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>\n", "<a href=\"https://philpapers.org/sep/luther-influence/\" target=\"other\">Enhanced bibliography for this entry</a>\n at\n <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>,\n with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=luther-influence": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/luther-influence/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=luther-influence&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/luther-influence/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [], "listed_links": []}, "tokenized_text": ["1", "luther", "early", "modern", "philosophy", "general", "level", "period", "luther", "idea", "role", "shaping", "two", "key", "philosophical", "dispute", "broadly", "epistemological", "kind", "one", "concerning", "relation", "philosophy", "theology", "discipline", "concerning", "possibility", "religious", "certainty", "first", "illustrated", "socalled", "hofmannstreit", "hofmann", "controversy", "took", "place", "university", "helmstedt", "1598", "daniel", "hofmann", "15381621", "cited", "luther", "attack", "philosophical", "colleague", "brought", "response", "scottish", "mathematician", "physician", "duncan", "liddel", "15611613", "amongst", "others", "discussion", "see", "antognazza", "1996", "hunter", "2006", "link", "liddel", "see", "regier", "2016", "throughout", "seventeenth", "century", "controversy", "major", "impact", "debate", "theology", "philosophy", "particular", "discussion", "surrounding", "socalled", "doctrine", "double", "truth", "see", "luther", "entry", "2", "pierre", "bayle", "16471706", "devoted", "article", "dictionaire", "historique", "et", "critique", "controversy", "gottfried", "wilhelm", "leibniz", "16461716", "discussed", "repeatedly", "including", "nouveaux", "essais", "theodicy", "second", "epistemological", "issue", "also", "raised", "luther", "claim", "priority", "scripture", "ecclesiastical", "authority", "luther", "argued", "example", "bondage", "erasmus", "see", "wa", "1860314lw", "331936", "would", "make", "possible", "certainty", "authority", "lackedbut", "method", "proved", "problematic", "settling", "dispute", "luther", "challenged", "scriptural", "interpretation", "see", "luther", "entry", "2", "richard", "popkin", "1979", "argued", "impasse", "led", "significant", "debate", "subsequent", "reformer", "catholic", "concerning", "approach", "could", "avoid", "scepticism", "indeed", "faith", "required", "accommodation", "scepticism", "form", "luther", "vehemently", "denied", "erasmus", "see", "luther", "entry", "4", "well", "providing", "important", "context", "general", "debate", "individual", "level", "another", "prominent", "early", "modern", "philosopher", "responded", "luther", "thought", "leibniz", "also", "thomas", "hobbes", "15881679", "one", "concern", "central", "question", "free", "issue", "also", "relevant", "influence", "considered", "detail", "beginning", "hobbes", "turning", "leibniz", "generally", "expressing", "admiration", "luther", "role", "reformation", "hobbes", "saw", "evil", "catholic", "church", "4", "direct", "use", "hobbes", "make", "lutheran", "idea", "controversy", "john", "bramhall", "bishop", "derry", "issue", "free", "two", "men", "led", "debate", "marquess", "newcastle", "three", "exile", "paris", "1645", "following", "unauthorized", "publication", "hobbes", "contribution", "1654", "liberty", "necessity", "bramhall", "published", "earlier", "stronglyworded", "contribution", "defence", "true", "liberty", "antecedent", "extrinsical", "necessity", "following", "year", "hobbes", "replied", "similarly", "strident", "term", "question", "concerning", "liberty", "necessity", "chance", "1656", "bramhall", "published", "response", "1658", "castigation", "mr", "hobbes", "last", "animadversion", "case", "concerning", "liberty", "universal", "necessity", "5", "bramhall", "make", "objection", "hobbes", "abundantly", "clear", "following", "passage", "defence", "true", "liberty", "hate", "doctrin", "heart", "believe", "reason", "others", "shall", "seriously", "ponder", "horrid", "consequence", "flow", "destroyes", "liberty", "dishonour", "nature", "man", "make", "second", "cause", "outward", "object", "racket", "men", "tennisballs", "destiny", "make", "first", "cause", "god", "almighty", "introducer", "evill", "sin", "world", "much", "man", "yea", "man", "much", "motion", "watch", "artificer", "make", "wind", "either", "spring", "wheel", "thred", "god", "special", "influence", "second", "cause", "necessitate", "operate", "bramhall", "1655", "60", "bramhall", "central", "concern", "thus", "twofold", "first", "hobbes", "determinism", "dishonour", "nature", "man", "making", "nothing", "tennisball", "destiny", "secondly", "creates", "theological", "difficulty", "entailing", "god", "much", "author", "evil", "sin", "good", "conclusion", "abhorrent", "taken", "seriously", "could", "push", "right", "thinking", "people", "atheism", "faced", "challenge", "fully", "accepting", "position", "treated", "god", "first", "cause", "else", "happens", "necessity", "hobbes", "appealed", "defence", "reformation", "tradition", "general", "luther", "particular", "thus", "fighting", "theological", "critic", "theological", "authority", "seen", "discussion", "bondage", "luther", "entry", "4", "luther", "faced", "similar", "form", "criticism", "erasmus", "hobbes", "able", "make", "use", "luther", "reply", "erasmus", "responding", "bramhall", "particular", "employed", "luther", "distinction", "necessity", "immutability", "necessity", "constraint", "argued", "human", "being", "lack", "free", "nonetheless", "forced", "sin", "still", "sin", "imputed", "hobbes", "1656", "19", "1841", "25960", "1999", "778", "1656", "20", "n", "1841", "298", "1999", "7980", "see", "also", "wa", "18616", "notelw", "3339", "response", "question", "god", "power", "u", "determine", "use", "power", "make", "u", "good", "instead", "punishes", "u", "hobbes", "make", "lutheran", "point", "try", "hold", "god", "human", "standard", "justice", "rightness", "mistake", "assume", "applied", "context", "6", "obviously", "dialectically", "effective", "use", "luther", "way", "refute", "bishop", "question", "nature", "hobbes", "religious", "commitment", "remains", "matter", "controversy", "7", "hobbes", "appeal", "luther", "manner", "mere", "opportunism", "show", "understanding", "familiarity", "luther", "writing", "free", "purely", "superficial", "however", "still", "questioned", "whether", "transposing", "lutheran", "consideration", "context", "mechanistic", "materialism", "hobbes", "could", "proper", "justice", "course", "luther", "philosophical", "issue", "surrounding", "materialism", "little", "concern", "conception", "god", "merely", "kind", "first", "mover", "taken", "hobbes", "8", "thus", "place", "hobbes", "account", "seen", "distinctive", "luther", "namely", "kind", "spiritual", "comfort", "found", "abandonment", "idea", "free", "choice", "way", "predestination", "come", "make", "u", "certain", "god", "promise", "way", "liberates", "u", "kind", "anxiety", "would", "feel", "salvation", "depended", "proper", "exercise", "choice", "moreover", "discussed", "luther", "entry", "4", "luther", "argument", "free", "choice", "independent", "commitment", "materialism", "rest", "instead", "claim", "neutral", "normative", "space", "free", "exercise", "choice", "erasmus", "claimed", "either", "good", "see", "good", "option", "faced", "choice", "bad", "think", "bad", "also", "option", "consider", "qua", "always", "turned", "away", "good", "choice", "direction", "either", "9", "others", "noted", "deeper", "aspect", "luther", "position", "nothing", "hobbes", "materialism", "end", "make", "respective", "approach", "question", "different", "see", "damrosch", "1979", "overhoff", "1997", "well", "issue", "free", "also", "intriguing", "consider", "another", "point", "connection", "two", "thinker", "namely", "influence", "luther", "hobbes", "political", "social", "philosophy", "though", "issue", "le", "explicitly", "documented", "hobbes", "work", "previous", "one", "nonetheless", "shared", "belief", "need", "powerful", "state", "precariousness", "life", "state", "nature", "avoided", "given", "lack", "community", "fallen", "individual", "said", "offer", "similar", "justification", "state", "authority", "perhaps", "result", "guilty", "tending", "towards", "authoritarianism", "political", "thought", "comparison", "see", "kodalle", "1990", "hobbes", "materialism", "consequently", "suspected", "atheism", "add", "interesting", "complexity", "relation", "luther", "leibniz", "case", "complexity", "added", "latter", "commitment", "ecumenism", "reflected", "catholic", "demonstration", "project", "166869", "subsequent", "work", "rationalism", "ecumenical", "plan", "based", "hoped", "common", "ground", "doctrinal", "difference", "might", "based", "fresh", "insight", "made", "possible", "new", "development", "philosophy", "science", "nonetheless", "hobbes", "notwithstanding", "divergence", "leibniz", "case", "clear", "lutheran", "influence", "context", "still", "found", "traceable", "upbringing", "education", "see", "goldenbaum", "1988", "171", "antognazza", "2009", "chap", "1", "drew", "towards", "lutheranism", "moderate", "form", "leibniz", "writes", "tender", "youth", "onwards", "even", "went", "university", "came", "across", "part", "luther", "book", "de", "servo", "arbitrio", "going", "study", "work", "written", "issue", "lutheran", "reformed", "writer", "also", "catholic", "tradition", "see", "backus", "2016", "257", "note", "10", "11", "leibniz", "interest", "debate", "later", "lead", "contribute", "belatedly", "controversy", "hobbes", "bramhall", "outlined", "discus", "appendix", "theodicy", "1710", "reflexion", "work", "mr", "hobbes", "published", "english", "freedom", "necessity", "chance", "leibniz", "note", "hobbes", "view", "divine", "foreknowledge", "would", "sufficient", "establish", "absolute", "necessity", "event", "resembles", "luther", "de", "servo", "arbitrio", "least", "luther", "spoke", "leibniz", "suggests", "lutheran", "position", "go", "need", "sufficiently", "acknowledged", "today", "kind", "necessity", "termed", "hypothetical", "spring", "foreknowledge", "anterior", "reason", "nothing", "arouse", "one", "alarm", "whereas", "would", "quite", "otherwise", "thing", "necessary", "way", "contrary", "implied", "contradiction", "leibniz", "1710", "1985", "appendix", "3", "p", "393", "embracing", "developing", "scholastic", "distinction", "certainty", "based", "knowledge", "cause", "logical", "necessity", "mean", "thing", "could", "otherwise", "leibniz", "therefore", "arguing", "would", "quite", "possible", "luther", "preserve", "commitment", "divine", "foreknowledge", "one", "hand", "without", "playing", "hand", "hard", "determinist", "like", "hobbes", "theodicy", "also", "contains", "discussion", "another", "key", "lutheran", "issue", "namely", "relation", "faith", "reason", "specifically", "raised", "preliminary", "dissertation", "start", "text", "reviewing", "history", "debate", "question", "leibniz", "admits", "luther", "spoke", "sometimes", "rejected", "philosophy", "deemed", "inimical", "faith", "seek", "qualify", "luther", "position", "arguing", "philosophy", "luther", "meant", "understanding", "nature", "philosophy", "school", "philosophy", "narrow", "sense", "comprehend", "matter", "faith", "leibniz", "likewise", "note", "luther", "early", "hostility", "aristotle", "last", "curbed", "vehemence", "apology", "augsburg", "confession", "allowed", "melanchthon", "include", "favourable", "mention", "aristotle", "ethic", "1710", "1985", "12", "p", "81", "leibniz", "also", "offer", "moderate", "reading", "luther", "claim", "concerning", "difference", "revealed", "truth", "mystery", "gospel", "one", "hand", "reason", "1710", "1985", "49", "p", "101", "67", "pp", "11011", "rather", "attributing", "view", "luther", "therefore", "leibniz", "go", "suggest", "later", "theologian", "various", "tradition", "well", "figure", "pierre", "bayle", "made", "opposition", "faith", "reason", "sharp", "one", "leibniz", "try", "blunt", "opposition", "appealing", "distinction", "reason", "sense", "reason", "fully", "comprehend", "contrary", "reason", "arguing", "matter", "faith", "may", "fall", "former", "category", "fall", "latter", "dogma", "disputed", "refuted", "reason", "instead", "incomprehensible", "one", "may", "say", "nothing", "easier", "understand", "obvious", "absurdity", "1710", "1985", "23", "p", "88", "discussion", "leibniz", "approach", "see", "antognazza", "2008", "introduction", "2018a", "goldenbaum", "1998", "hillman", "2013", "schweitz", "2011", "leibniz", "writing", "theology", "thus", "become", "focused", "establishing", "seems", "viewed", "moderate", "lutheran", "position", "showing", "across", "range", "issue", "might", "appear", "contrary", "reason", "often", "merely", "see", "antognazza", "2018b", "10", "one", "central", "theological", "issue", "leibniz", "deal", "way", "seen", "concerned", "luther", "see", "luther", "entry", "2", "became", "crucial", "matter", "dispute", "within", "later", "reformation", "question", "eucharist", "unsurprisingly", "therefore", "issue", "becomes", "central", "leibniz", "ecumenical", "attempt", "find", "common", "ground", "various", "christian", "tradition", "show", "reason", "informed", "new", "development", "philosophical", "thinking", "especially", "find", "way", "forward", "apparently", "intractable", "debate", "see", "backus", "2016", "chapter", "1", "2", "mercer", "2002", "8289", "fouke", "1992", "nonetheless", "despite", "ecumenical", "endeavour", "noted", "adam", "1994", "3545", "antognazza", "2018b", "74648", "leibniz", "metaphysics", "work", "best", "attempt", "make", "sense", "eucharist", "conceived", "along", "line", "lutheran", "position", "real", "presence", "rather", "catholic", "conception", "transubstantiation", "11", "extent", "metaphysics", "generally", "may", "said", "operate", "within", "broadly", "lutheran", "outlook", "though", "one", "thanks", "influence", "melanchthon", "others", "room", "luther", "may", "liked", "aristotelian", "idea", "sort", "leibniz", "employed", "deal", "issue", "substantial", "form", "see", "mercer", "2002", "101", "12", "2", "luther", "kant", "postkantians", "virtue", "education", "background", "luther", "continues", "impact", "thought", "significant", "philosopher", "leibniz", "christian", "thomasius", "16551728", "christian", "wolff", "16791754", "however", "interesting", "point", "contact", "found", "crucial", "thinker", "fact", "brought", "mainstream", "lutheran", "pietist", "namely", "immanuel", "kant", "17241804", "13", "impact", "continues", "work", "lutheran", "idealist", "followed", "namely", "j", "g", "fichte", "17621814", "f", "w", "j", "schelling", "17751854", "g", "w", "f", "hegel", "17701831", "well", "work", "responded", "kant", "different", "way", "namely", "gotthold", "ephraim", "lessing", "17291781", "j", "g", "hamann", "17301788", "f", "h", "jacobi", "17431819", "j", "g", "herder", "17441803", "addition", "arthur", "schopenhauer", "17881860", "thinker", "associated", "romanticism", "friedrich", "von", "hardenberg", "aka", "novalis", "17721801", "friedrich", "schlegel", "17721829", "convert", "jewish", "writer", "essayist", "heinrich", "heine", "17971856", "reason", "space", "possible", "trace", "connection", "focus", "mainly", "kant", "hegel", "brief", "mention", "fichte", "schelling", "comprehensive", "study", "contains", "excerpt", "key", "primary", "text", "found", "bornkamm", "1955", "brief", "overview", "found", "assel", "2014", "discussion", "extend", "twentieth", "century", "see", "hampson", "2017", "podmore", "2017", "rota", "2017", "kant", "upbringing", "education", "came", "within", "pietism", "rather", "orthodox", "lutheran", "church", "14", "pietism", "still", "reform", "movement", "within", "lutheran", "tradition", "certain", "respect", "saw", "returning", "view", "luther", "away", "church", "become", "see", "lindberg", "2005", "shantz", "2013", "discussion", "one", "issue", "reopened", "role", "reason", "relation", "faith", "limitation", "reason", "hence", "academic", "theology", "religious", "matter", "also", "taking", "seriously", "fallenness", "human", "being", "need", "spiritual", "rebirth", "emphasised", "recently", "see", "kanterian", "2017", "kant", "adoption", "socalled", "weakness", "motif", "may", "seen", "importantly", "lutheran", "theme", "work", "reflected", "limitation", "place", "human", "reason", "capacity", "moral", "goodness", "nonetheless", "kant", "use", "claim", "concerning", "constraint", "reason", "prioritise", "theology", "philosophy", "give", "revelation", "scripture", "special", "status", "also", "departs", "luther", "issue", "free", "grace", "human", "intellect", "limited", "central", "theme", "kant", "called", "critical", "philosophy", "precisely", "aim", "set", "limit", "moreover", "suggested", "famous", "claim", "found", "necessary", "deny", "knowledge", "order", "make", "room", "faith", "critique", "pure", "reason", "bxxx", "religious", "impetus", "behind", "project", "sort", "luther", "might", "recognized", "also", "reflected", "kant", "hostility", "rationalistic", "attempt", "prove", "existence", "god", "kant", "may", "also", "said", "share", "luther", "augustinian", "pessimism", "regarding", "human", "nature", "frequently", "remark", "evident", "selfconcern", "religion", "within", "boundary", "mere", "reason", "1793", "attribute", "propensity", "radical", "evil", "human", "being", "namely", "propensity", "power", "choice", "maxim", "subordinate", "incentive", "moral", "law", "others", "moral", "one", "630", "conception", "human", "moral", "weakness", "may", "also", "said", "lead", "kant", "adopt", "lutheran", "conception", "law", "becomes", "binding", "u", "take", "form", "duty", "given", "resistance", "good", "whereas", "holy", "necessitation", "constraint", "cf", "groundwork", "metaphysics", "moral", "44124", "however", "also", "limit", "far", "kant", "prepared", "follow", "lutheran", "theme", "firstly", "willing", "accept", "theoretical", "reason", "may", "lead", "astray", "find", "cognitively", "impoverished", "respect", "way", "leaf", "room", "faith", "willing", "allow", "mean", "theology", "eclipse", "philosophy", "revelation", "scripture", "simply", "replace", "latter", "took", "religion", "must", "remain", "compatible", "morality", "thus", "stay", "within", "practical", "reason", "philosophical", "theology", "arise", "see", "religion", "preface", "conflict", "faculty", "part", "1", "secondly", "kant", "offer", "distinctive", "conception", "idea", "free", "choice", "willkür", "involving", "choice", "adoption", "maxim", "see", "metaphysics", "moral", "6", "2134", "226", "religion", "within", "limit", "mere", "reason", "6234", "also", "argues", "freedom", "basis", "ought", "implies", "put", "odds", "luther", "position", "articulated", "bondage", "see", "eg", "religion", "645", "white", "1990", "general", "discussion", "finally", "religion", "within", "limit", "mere", "reason", "kant", "reject", "lutheran", "conception", "grace", "moral", "ground", "arguing", "discouraged", "moral", "effort", "unless", "believe", "something", "make", "deserving", "grace", "hence", "divine", "assistance", "good", "kant", "appeal", "principle", "ought", "implies", "argue", "must", "capacity", "direction", "however", "limited", "see", "religion", "part", "1", "thus", "affinity", "kant", "luther", "important", "divergence", "hegel", "reception", "luther", "contrast", "kant", "various", "way", "first", "kant", "never", "offer", "significant", "discussion", "luther", "writing", "implicitly", "critical", "important", "respect", "hegel", "explicit", "engagement", "luther", "frequently", "lavish", "praise", "reformerthough", "hegel", "quickly", "dropped", "youthful", "plan", "lutheran", "pastor", "critical", "aspect", "lutheran", "education", "received", "student", "seminary", "stift", "tübingen", "secondly", "kant", "relation", "luther", "made", "complex", "pietistic", "upbringing", "hegel", "upbringing", "may", "also", "involved", "pietistic", "aspect", "see", "macgee", "2001", "7172", "later", "life", "hegel", "avowed", "lutheran", "orthodoxy", "writing", "pietistic", "theologian", "friedrich", "august", "tholuck", "1826", "lutheran", "philosophy", "completely", "confirmed", "lutheranism", "hegel", "1984", "520", "thirdly", "two", "philosopher", "almost", "diametrically", "opposed", "accepted", "rejected", "luther", "kant", "followed", "luther", "doubt", "concerning", "reason", "capacity", "moral", "goodness", "hegel", "optimistic", "score", "kant", "rejected", "luther", "scepticism", "regarding", "free", "choice", "hegel", "used", "draw", "dialectical", "connection", "freedom", "necessity", "however", "kant", "hegel", "agree", "standing", "attempt", "prioritise", "theology", "philosophy", "lutheran", "ground", "briefly", "outlining", "key", "text", "understanding", "hegel", "engagement", "luther", "third", "point", "developed", "majority", "hegel", "reference", "luther", "occur", "lecture", "philosophy", "religion", "philosophy", "history", "history", "philosophy", "case", "last", "two", "largely", "section", "reformation", "generally", "context", "therefore", "mean", "explicit", "discussion", "hegel", "considering", "luther", "place", "subsequent", "historical", "development", "general", "hegel", "present", "luther", "ushering", "new", "era", "internality", "individuality", "religion", "becomes", "le", "matter", "unthinkingly", "following", "established", "authority", "ritual", "external", "alien", "matter", "grasping", "truth", "oneself", "feeling", "one", "thus", "ushering", "distinctive", "form", "christian", "freedom", "subjective", "spirit", "come", "selfnegation", "absolutely", "home", "bei", "sich", "thus", "subjective", "spirit", "gain", "freedom", "truth", "negates", "particularity", "come", "truth", "way", "christian", "freedom", "actualized", "182223", "hegel", "2011", "505", "address", "tercentenary", "submission", "augsburg", "confession", "1830", "hegel", "even", "go", "far", "present", "work", "second", "reformation", "luther", "trumpet", "proclaimed", "wondrous", "sound", "christian", "freedom", "thing", "luther", "set", "motion", "truly", "new", "nonetheless", "religion", "reformed", "political", "legal", "ethical", "system", "ratio", "civitatis", "et", "legum", "morumque", "also", "reformed", "hegel", "1830", "1999", "189", "which", "thus", "connects", "luther", "religious", "project", "hegel", "political", "one", "hegel", "also", "preface", "philosophy", "right", "15", "heine", "account", "development", "german", "philosophy", "written", "french", "audience", "1834", "published", "book", "form", "year", "later", "heine", "1835", "2007", "tell", "similar", "story", "begin", "luther", "culminates", "hegelindeed", "original", "title", "de", "l", "allemagne", "depuis", "luther", "heine", "work", "also", "reflects", "role", "hegel", "gave", "luther", "quintessentially", "german", "figure", "become", "common", "trope", "subsequent", "reception", "16", "well", "focus", "religious", "political", "freedom", "individual", "emphasis", "relation", "lutheranism", "freedom", "hegel", "may", "seen", "four", "fundamental", "aspect", "reveal", "luther", "influence", "hegel", "conception", "freedom", "central", "theme", "latter", "philosophy", "first", "seen", "hegel", "took", "christian", "freedom", "involve", "finding", "oneself", "may", "reflect", "luther", "turn", "god", "alien", "forbidding", "judge", "god", "forgiving", "loving", "freedom", "reconciliation", "achievedalbeit", "unity", "must", "achieved", "prior", "sense", "alienation", "17", "luther", "alienation", "involves", "element", "hiddenness", "evident", "hegel", "nonetheless", "could", "added", "luther", "conception", "divine", "hiddenness", "involve", "idea", "god", "nature", "concealed", "contrary", "abscondita", "sub", "contrario", "mercy", "wrath", "strength", "weakness", "suffering", "jesus", "christ", "18", "connection", "hegel", "conception", "dialectic", "appears", "one", "way", "understanding", "seen", "otherwise", "reason", "necessity", "really", "freedom", "way", "former", "find", "incomprehensible", "moreover", "hegel", "conception", "freedom", "selfknowledge", "requiring", "recognition", "may", "said", "reflect", "luther", "conception", "relational", "dependence", "god", "19", "second", "hegel", "take", "idea", "reconciliation", "requires", "kind", "selfsurrender", "writes", "subjective", "certainty", "ie", "subject", "knowledge", "true", "objective", "truth", "subsisting", "becomes", "authentic", "relation", "content", "particular", "subjectivity", "surrendered", "happens", "making", "objective", "truth", "one", "truth", "182223", "hegel", "2011", "505", "stephen", "houlgate", "noted", "20", "emphasis", "passivity", "important", "feature", "hegel", "method", "inquiry", "example", "hegel", "remark", "p", "hilosophical", "thinking", "proceeds", "analytically", "simply", "take", "object", "idea", "let", "go", "way", "simply", "watch", "movement", "development", "speak", "extent", "philosophising", "wholly", "passive", "encyclopaedia", "logic", "238", "addition", "third", "hegel", "take", "lutheran", "pauline", "view", "concerning", "relation", "christian", "law", "according", "christian", "require", "constraint", "law", "true", "freedomis", "freedom", "good", "pleasure", "live", "well", "without", "compulsion", "law", "preface", "st", "paul", "epistle", "roman", "wa", "db", "71819lw", "35376", "could", "argued", "view", "reflected", "hegel", "preference", "love", "law", "particular", "feature", "early", "writing", "21", "finally", "bondage", "luther", "question", "conception", "freedom", "free", "choice", "see", "luther", "entry", "4", "arguing", "instead", "presence", "choice", "involves", "lack", "freedom", "agent", "longer", "guided", "good", "view", "may", "also", "said", "echoed", "hegel", "critique", "free", "choice", "willkür", "underpins", "claim", "way", "true", "freedom", "necessity", "reconciled", "truly", "free", "agent", "see", "one", "option", "available", "namely", "required", "good", "respect", "therefore", "argued", "fundamentally", "lutheran", "cast", "fundamental", "aspect", "hegel", "thought", "however", "hegel", "surely", "departs", "luther", "championing", "role", "reason", "speculative", "philosophy", "albeit", "reason", "distinctive", "kind", "go", "beyond", "understanding", "able", "sublate", "christianity", "within", "itbut", "sublation", "mean", "philosophy", "take", "structure", "theological", "thinking", "also", "lutheran", "turn", "hegel", "remains", "important", "influence", "within", "lutheran", "theology", "22", "interesting", "point", "similarity", "difference", "hegel", "response", "luther", "postkantian", "german", "idealist", "fichte", "schelling", "like", "hegel", "fichte", "treat", "luther", "significant", "national", "figure", "associate", "freedom", "giving", "prominence", "address", "german", "nation", "written", "1808", "rallying", "call", "wake", "napoleonic", "invasion", "also", "praise", "luther", "contribution", "german", "language", "translation", "bible", "though", "fichte", "critical", "doctrine", "sola", "scriptura", "put", "much", "value", "printed", "letter", "23", "moreover", "luther", "said", "influence", "hegel", "conception", "recognition", "see", "may", "said", "fichte", "account", "recognition", "foreshadowed", "hegel", "though", "neither", "case", "link", "made", "explicit", "schelling", "also", "give", "luther", "account", "freedom", "philosophical", "role", "appealing", "luther", "bondage", "philosophical", "investigation", "essence", "human", "freedom", "1809", "draw", "distinction", "compulsion", "necessity", "broadly", "arguing", "religiosity", "permit", "choice", "opposite", "aequilibrium", "arbitrii", "plague", "morality", "rather", "highest", "resoluteness", "favour", "right", "without", "choice", "1809", "2006", "57", "moreover", "appealing", "later", "work", "significance", "revelation", "argued", "schelling", "consistently", "lutheran", "hegel", "thereby", "placing", "limit", "latter", "rationalism", "see", "wirth", "2017", "3", "luther", "kierkegaard", "nietzsche", "two", "significant", "nineteenth", "century", "philosopher", "engaged", "luther", "søren", "kierkegaard", "181355", "friedrich", "nietzsche", "18441900", "kierkegaard", "engagement", "came", "context", "attempt", "renew", "nature", "christian", "faith", "nietzsche", "came", "someone", "standing", "outside", "faith", "kierkegaard", "relation", "luther", "lutheranism", "complex", "remains", "matter", "controversy", "24", "balance", "though", "seems", "kierkegaard", "clearly", "critic", "established", "danish", "lutheran", "church", "critical", "luther", "partly", "returned", "order", "challenge", "lutheran", "contemporary", "even", "suggesting", "might", "turn", "luther", "true", "successor", "25", "time", "held", "luther", "original", "doctrine", "partly", "responsible", "contemporary", "malaise", "must", "rethought", "context", "new", "challenge", "genuine", "christian", "life", "spirituality", "conceived", "kierkegaard", "thereby", "applying", "corrective", "luther", "corrective", "kim", "rasmussen", "nicely", "put", "2009", "197", "attitude", "therefore", "wellsummarized", "remark", "wanted", "prevent", "people", "christendom", "existentially", "taking", "vain", "luther", "significance", "luther", "life", "1850", "1998", "17", "26", "thus", "admission", "kierkegaard", "systematic", "reader", "luther", "27", "engagement", "writing", "nonetheless", "relates", "deep", "theme", "kierkegaard", "thinking", "luther", "provides", "important", "context", "thought", "one", "issue", "concerned", "question", "justification", "central", "lutheran", "view", "come", "unmerited", "grace", "forgiveness", "rather", "work", "expressing", "sympathy", "luther", "central", "claim", "kierkegaard", "fearful", "contemporary", "world", "become", "excuse", "ethical", "spiritual", "indolence", "people", "applied", "grace", "way", "freed", "work", "kierkegaard", "1851", "1990a", "17", "relatedly", "kierkegaard", "acknowledged", "respected", "spiritual", "seriousness", "anxiety", "anfechtungen", "sense", "sin", "led", "luther", "adopt", "position", "see", "podmore", "2006", "2013", "seriousness", "kierkegaard", "contemporary", "lost", "turn", "grace", "becomes", "superficial", "optimism", "rather", "renewal", "hope", "face", "anxiety", "despair", "moreover", "like", "luther", "kierkegaard", "closely", "connected", "relation", "god", "faith", "relation", "neighbour", "former", "latter", "work", "love", "made", "possible", "28", "way", "kierkegaard", "could", "claim", "correcting", "exaggeration", "luther", "position", "tried", "away", "work", "altogethermuch", "luther", "rejected", "exaggeration", "treatise", "good", "work", "reaffirming", "importance", "work", "kierkegaard", "gave", "greater", "role", "imitatio", "christi", "tradition", "arguing", "luther", "rightly", "critical", "idea", "context", "feeding", "work", "righteousness", "kind", "pseudopiety", "nonetheless", "need", "reviving", "kierkegaard", "context", "provide", "challenge", "complacent", "selfconception", "contemporary", "raising", "christ", "ideal", "refocus", "attention", "radical", "figure", "kierkegaard", "1876", "1990", "192209", "however", "another", "obstacle", "proper", "life", "faith", "kierkegaard", "kind", "worldliness", "found", "contemporary", "claimed", "luther", "needed", "take", "direct", "responsibility", "insofar", "allowed", "reformation", "become", "political", "programme", "see", "kierkegaard", "kjp", "3", "frag", "2469", "p", "66", "1848", "also", "presented", "account", "social", "order", "model", "christian", "life", "taken", "hegelian", "others", "ethic", "vocation", "kierkegaard", "led", "relation", "religious", "one", "hand", "ethical", "social", "tended", "reduce", "former", "latter", "sought", "challenge", "radical", "conception", "relation", "could", "include", "christian", "live", "odds", "social", "order", "suffering", "exclusion", "resultor", "least", "active", "faith", "may", "require", "feeling", "distanced", "world", "living", "within", "kierkegaard", "acknowledges", "luther", "may", "intended", "something", "similar", "29", "result", "teaching", "led", "people", "different", "direction", "sløk", "put", "life", "serving", "one", "neighbour", "one", "calling", "transformed", "one", "bourgeois", "complacency", "relative", "duty", "relative", "right", "obliterated", "awareness", "unconditional", "obligation", "upon", "man", "sløk", "1962", "100", "context", "recognizing", "could", "revived", "critical", "respect", "30", "kierkegaard", "express", "preference", "monastic", "life", "married", "life", "lutheran", "pastor", "worldliness", "come", "involve", "31", "final", "theme", "note", "concern", "relation", "reason", "faith", "also", "form", "part", "kierkegaard", "critical", "engagement", "hegelianism", "discussed", "hegel", "may", "seen", "taken", "lutheranism", "rationalistic", "philosophical", "direction", "kierkegaard", "emphasis", "paradox", "incarnation", "underlies", "christian", "faith", "well", "emphasis", "divine", "hiddenness", "may", "seen", "corrective", "kierkegaard", "essential", "properly", "appreciate", "luther", "theology", "cross", "alien", "rational", "comprehension", "make", "religious", "commitment", "matter", "individual", "faith", "existential", "risk", "typified", "story", "abraham", "luther", "refer", "32", "though", "way", "kierkegaard", "like", "leibniz", "suggests", "put", "faith", "reason", "put", "contrary", "render", "irrational", "sense", "33", "kierkegaard", "criticism", "luther", "come", "within", "christian", "tradition", "nietzsche", "come", "thinker", "put", "outside", "34", "however", "took", "time", "critique", "luther", "develop", "earlier", "period", "1876", "nietzsche", "writing", "highly", "favourable", "towards", "luther", "reformation", "generally", "point", "view", "becomes", "increasingly", "negative", "hostile", "see", "bluhm", "1943", "1950", "1953", "detailed", "account", "trajectory", "also", "discussed", "large", "2003", "nietzsche", "luther", "came", "represent", "paradigm", "nonaristocratic", "man", "rather", "accepting", "overcoming", "instead", "despised", "tried", "flee", "turning", "god", "thus", "nietzsche", "may", "seen", "luther", "prefiguring", "attempt", "get", "beyond", "morality", "law", "name", "freedom", "35", "ultimately", "came", "view", "liberating", "impetus", "something", "luther", "betrayed", "positively", "however", "direct", "reference", "luther", "made", "influence", "would", "mediated", "figure", "schopenhauer", "arguable", "element", "nietzsche", "rejection", "idea", "free", "might", "found", "luther", "respect", "nietzsche", "causal", "determinism", "level", "doubt", "concerning", "power", "free", "choice", "occupy", "neutral", "position", "agent", "actionsfor", "example", "nietzsche", "well", "known", "criticism", "popular", "morality", "separate", "strength", "manifestation", "strength", "though", "indifferent", "substratum", "behind", "strong", "freedom", "manifest", "strength", "1887", "first", "essay", "13", "somewhat", "similar", "way", "see", "luther", "entry", "4", "luther", "critical", "erasmus", "conception", "idea", "pure", "purum", "velle", "standing", "desire", "studium", "striving", "conatus", "thus", "decide", "whether", "go", "one", "way", "another", "cf", "wa", "18669lw", "331145", "4", "luther", "feuerbach", "marxism", "nineteenth", "century", "luther", "also", "play", "prominent", "role", "thought", "key", "posthegelian", "thinker", "ludwig", "feuerbach", "18041872", "lesser", "degree", "karl", "marx", "18181883", "friedrich", "engels", "18201895", "well", "later", "thinker", "twentieth", "century", "marxist", "tradition", "ernst", "bloch", "18851977", "herbert", "marcuse", "18981979", "36", "feuerbach", "primary", "engagement", "luther", "come", "second", "edition", "essence", "christianity", "1843", "essence", "faith", "according", "luther", "1844", "among", "motivation", "feuerbach", "desire", "face", "protestant", "critic", "establish", "view", "religion", "proposed", "first", "edition", "essence", "christianity", "applied", "catholic", "faith", "critic", "happy", "concede", "also", "protestantismand", "course", "could", "better", "way", "feuerbach", "establish", "demonstrate", "luther", "could", "encompassed", "within", "feuerbach", "analysis", "therefore", "proposed", "work", "see", "glasse", "1972", "erdozain", "2016", "22345", "discussion", "put", "briefly", "feuerbach", "central", "thesis", "religious", "belief", "nothing", "expression", "human", "desire", "god", "aspiration", "projected", "worshipping", "god", "worshipping", "feuerbach", "allows", "outset", "essence", "faith", "may", "seem", "apply", "luther", "conception", "insofar", "luther", "insists", "fundamental", "discontinuity", "god", "human", "being", "placing", "value", "former", "none", "latter", "surface", "therefore", "luther", "doctrine", "divine", "inhuman", "indeed", "barbarica", "hymn", "god", "lampoon", "man", "feuerbach", "1844", "1967", "41", "response", "however", "feuerbach", "argues", "superficial", "reading", "role", "god", "restore", "u", "lost", "man", "nothing", "god", "faith", "everything", "1844", "1967", "46", "seen", "feuerbach", "argues", "way", "luther", "opposition", "catholicism", "emphasis", "way", "take", "christ", "suffering", "u", "appeared", "divergence", "becomes", "radical", "convergence", "feuerbach", "appropriation", "luther", "course", "remains", "controversial", "therefore", "summarized", "writes", "god", "sat", "heaven", "alone", "say", "luther", "like", "block", "would", "god", "feuerbach", "take", "luther", "agreeing", "god", "word", "sole", "meaning", "man", "1844", "1967", "50", "thus", "foreshadowing", "feuerbach", "anthropological", "turn", "turning", "marx", "engels", "others", "broadly", "marxist", "tradition", "central", "concern", "focus", "luther", "historical", "impact", "revolutionary", "social", "reformer", "seemed", "compromised", "luther", "role", "peasant", "revolt", "see", "section", "1", "5", "entry", "luther", "study", "revolt", "engels", "particular", "drew", "parallel", "situation", "leading", "german", "revolution", "184849", "casting", "luther", "middleclass", "reformer", "unable", "sustain", "radicalism", "unleashed", "engels", "later", "bloch", "took", "better", "represented", "plebeian", "revolutionary", "thomas", "müntzer", "c", "14891525", "luther", "declared", "instrument", "satan", "tortured", "executed", "battle", "frankenhausen", "1525", "similar", "suspicion", "luther", "also", "found", "marcuse", "essay", "1936", "written", "marcuse", "exile", "germany", "united", "state", "time", "background", "growing", "authoritarianism", "nazism", "often", "glorified", "luther", "without", "explicitly", "making", "connection", "context", "marcuse", "accuses", "luther", "relegating", "christian", "freedom", "inner", "sphere", "37", "leaving", "outer", "world", "politics", "society", "realm", "unfreedom", "christian", "must", "submit", "deference", "worldly", "authority", "luther", "argued", "could", "challengeda", "political", "quietism", "marcuse", "context", "course", "particularly", "troubling", "war", "became", "source", "much", "criticism", "selfcriticism", "directed", "towards", "lutheran", "church", "5", "luther", "heidegger", "løgstrup", "major", "twentieth", "century", "figure", "engage", "luther", "primarily", "theologian", "rudolf", "bultmann", "18841976", "karl", "barth", "18861968", "paul", "tillich", "18861965", "friedrich", "gogarten", "18871967", "one", "significant", "philosopher", "period", "often", "associated", "luther", "martin", "heidegger", "18891976", "raised", "originally", "catholic", "aspiring", "initially", "catholic", "philosopher", "first", "world", "war", "heidegger", "shifted", "allegiance", "began", "engage", "seriously", "luther", "work", "well", "augustine", "schleiermacher", "kierkegaard", "though", "ultimately", "break", "theism", "christianity", "altogether", "period", "1920s", "heidegger", "took", "luther", "distinction", "theology", "glory", "theology", "cross", "argued", "original", "primordial", "christianity", "urchristentum", "distorted", "former", "ontotheology", "wrongly", "influenced", "scholastic", "misappropriation", "aristotle", "needed", "overturned", "way", "yet", "radical", "luther", "avoid", "heidegger", "saw", "protestant", "scholasticism", "luther", "later", "period", "follower", "also", "said", "perceived", "luther", "struggle", "provided", "inspiration", "heidegger", "attempt", "overturn", "metaphysical", "tradition", "within", "philosophy", "however", "publication", "time", "1927", "connection", "luther", "becomes", "obscured", "wake", "allegiance", "luther", "hardly", "mentioned", "text", "though", "still", "argued", "certain", "lutheran", "assumption", "remain", "throughout", "later", "workssuch", "one", "commentator", "called", "time", "lutheran", "phenomenology", "dasein", "mcgrath", "2006", "12", "38", "luther", "also", "play", "significant", "role", "thought", "danish", "philosopher", "theologian", "k", "e", "løgstrup", "19051981", "interacted", "heidegger", "bultmann", "second", "world", "war", "well", "contemporary", "kierkegaardians", "denmark", "løgstrup", "used", "luther", "develop", "distinctive", "natural", "law", "position", "ethic", "also", "incorporating", "ethic", "fundamental", "lutheran", "view", "goodness", "achievable", "effort", "løgstrup", "goodness", "brought", "encounter", "another", "person", "made", "possible", "life", "rather", "divine", "grace", "thereby", "secularizing", "central", "aspect", "lutheran", "position", "time", "allows", "fact", "life", "make", "possible", "may", "suggest", "created", "løgstrup", "argued", "moreover", "forgiveness", "must", "remain", "theological", "matter", "sinfulness", "mean", "human", "being", "position", "forgive", "kind", "authority", "way", "retaining", "important", "element", "luther", "theology", "cross", "6", "luther", "modernity", "leaving", "aside", "luther", "influence", "individual", "philosopher", "also", "philosophical", "interest", "considering", "wider", "cultural", "historical", "impact", "modernity", "role", "shaping", "modern", "world", "understand", "39", "course", "highly", "complex", "matter", "helpful", "overview", "see", "zachhuber", "2017", "broadly", "five", "approach", "adopted", "account", "hegel", "outlined", "well", "heine", "luther", "impact", "seen", "decisive", "positive", "alongside", "largely", "positive", "conception", "modernity", "emphasis", "might", "lie", "resistance", "religious", "authority", "prioritising", "conscience", "individual", "account", "impact", "accepted", "seen", "instead", "object", "criticism", "relevant", "feature", "modernity", "deplored", "example", "luther", "blamed", "rise", "modern", "individualism", "voluntarism", "secularism", "said", "go", "along", "see", "example", "maritain", "1925", "third", "approach", "also", "saw", "relation", "marxist", "tradition", "marcuse", "example", "may", "also", "blame", "luther", "unequivocally", "problematic", "aspect", "modernity", "authoritarianism", "antisemitism", "fourth", "approach", "see", "luther", "fact", "standing", "contrast", "certain", "key", "positive", "feature", "modern", "thought", "rationalism", "freedom", "religious", "tolerance", "example", "juxtaposition", "view", "erasmus", "humanism", "sometimes", "portrayed", "light", "see", "example", "gillespie", "2008", "massing", "2018", "course", "one", "adopts", "certain", "view", "development", "luther", "thought", "one", "may", "attribute", "different", "influence", "coming", "different", "phase", "treat", "positive", "others", "distinguishing", "example", "radical", "earlier", "luther", "conservative", "later", "luther", "luther", "impact", "may", "understood", "taking", "one", "even", "contradictory", "form", "see", "example", "erdozain", "2016", "final", "approach", "criticise", "attempt", "link", "luther", "closely", "debate", "concerning", "modern", "arguing", "historically", "anachronistic", "essentially", "medieval", "figure", "focus", "myopically", "impact", "modernity", "distort", "understanding", "luther", "also", "perhaps", "distinctiveness", "originality", "also", "neglecting", "way", "luther", "thinking", "changed", "time", "recent", "example", "approach", "see", "helmer", "2019", "occasion", "adjudicate", "debate", "hoped", "account", "luther", "given", "previously", "make", "possible", "give", "proper", "consideration", "issue", "raise", "discussing", "far", "luther", "shaped", "modern", "world", "consideration", "far", "shaped", "philosophy", "surely", "deserves", "place"]}