{"url": "santayana", "title": "George Santayana", "authorship": {"year": "Copyright © 2020", "author_text": "Herman Saatkamp\n<hermes3798@outlook.com>\nMartin Coleman\n<martcole@iupui.edu>", "author_links": [{"mailto:hermes3798%40outlook%2ecom": "hermes3798@outlook.com"}, {"mailto:martcole%40iupui%2eedu": "martcole@iupui.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nHerman Saatkamp\n&lt;<a href=\"mailto:hermes3798%40outlook%2ecom\"><em>hermes3798<abbr title=\" at \">@</abbr>outlook<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\nMartin Coleman\n&lt;<a href=\"mailto:martcole%40iupui%2eedu\"><em>martcole<abbr title=\" at \">@</abbr>iupui<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Mon Feb 11, 2002", "substantive revision Thu Jul 23, 2020"], "preamble": "\n\n\nPhilosopher, poet, literary and cultural critic, George Santayana is\na principal figure in Classical American Philosophy. His naturalism and\nemphasis on creative imagination were harbingers of important\nintellectual turns on both sides of the Atlantic. He was a naturalist\nbefore naturalism grew popular; he appreciated multiple perfections\nbefore multiculturalism became an issue; he thought of philosophy as\nliterature before it became a theme in American and European scholarly\ncircles; and he managed to naturalize Platonism, update Aristotle,\nfight off idealisms, and provide a striking and sensitive account of\nthe spiritual life without being a religious believer. His Hispanic\nheritage, shaded by his sense of being an outsider in America, captures\nmany qualities of American life missed by insiders, and presents views\nequal to Tocqueville in quality and importance. Beyond philosophy, only\nEmerson may match his literary production. As a public figure, he\nappeared on the front cover of Time (3 February 1936), and his\nautobiography (Persons and Places, 1944) and only novel\n(The Last Puritan, 1936) were the best-selling books in the\nUnited States as Book-of-the-Month Club selections. The novel was\nnominated for a Pulitzer Prize, and Edmund Wilson ranked Persons\nand Places among the few first-rate autobiographies, comparing it\nfavorably to Yeats’s memoirs, The Education of Henry Adams,\nand Proust’s Remembrance of Things Past. Remarkably, Santayana\nachieved this stature in American thought without being an American\ncitizen. He proudly retained his Spanish citizenship throughout his\nlife. Yet, as he readily admitted, it is as an American that his\nphilosophical and literary corpuses are to be judged. Using\ncontemporary classifications, Santayana is the first and foremost\nHispanic-American philosopher.\n", "toc": [{"#Biog": "1. Biography"}, {"#PhilLiteCult": "2. Philosophy, Literature, and Culture"}, {"#DeveSantPhil": "3. Development of Santayana’s Philosophy"}, {"#Natu": "4. Naturalism"}, {"#EthiPoliSpirLife": "5. Ethics, Politics, and the Spiritual Life"}, {"#Bib": "Bibliography"}, {"#PrimSour": "Primary Sources"}, {"#SecoSour": "Secondary Sources"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Biography\n\n\nSantayana’s heritage is rooted in the Spanish diplomatic society\nwith its stress on high education and familiarity with the world\ncommunity. He was born in Madrid, Spain, on 16 December 1863. His\nfather, Agustín Santayana, was born in 1812. The father studied\nlaw and practiced for a short time before entering the colonial service\nfor posting to the Philippines. While studying law, Agustín\nserved an apprenticeship to a professional painter of the school of\nGoya and a number of his paintings remain in the private possession of\nthe family. He translated four Senecan tragedies into Spanish, wrote an\nunpublished book about the island of Mindanao, had an extensive\nlibrary, and made three trips around the world. In 1845, he became the\ngovernor of Batang, a small island in the Philippines. He took over the\ngovernorship from the recently deceased José Borrás y\nBofarull, who was the father of Josefina Borrás, later to become\nAgustín’s wife in 1861 and the mother of George Santayana. His\nmother, Josefina Sturgis (formerly Josefina Borrás y Carbonell),\nwas born in Scotland and was the daughter of a Spanish diplomat.\nPreviously she married George Sturgis (d. 1857), a Boston merchant,\nwhose early death left her alone with children in Manila. There were\nfive children from this first marriage, three of whom survived infancy.\nShe promised her first husband to raise the children in Boston where\nshe moved her family. During a holiday in Spain, Josefina met\nAgustín again, and they were married in 1861. He was fifty years\nof age and she was probably thirty-five. In 1863, Santayana was\nchristened Jorge Agustín Nicolás Ruiz de Santayana y\nBorrás. His half sister, Susan, insisted that he be called\n“George,” after her Boston father. Santayana, in turn,\nalways referred to his sister in the Spanish, “Susana.”\n\n1863–1886. Santayana lived eight years in Spain,\nforty years in Boston, and forty years in Europe. In his autobiography,\nPersons and Places, Santayana divides his life into three\nphases. The background (1863–1886) encompasses his childhood in Spain\nthrough his undergraduate years at Harvard. The second period\n(1886–1912) is that of the Harvard graduate student and professor with\na trans-Atlantic penchant for traveling to Europe. The third period\n(1912–1952) is the retired professor writing and traveling in Europe\nand eventually establishing Rome as his home.\n\n\nThe family moved from Madrid to Ávila where Santayana spent\nhis boyhood. In 1869, Santayana’s mother left Spain in order to raise\nthe Sturgis children in Boston, keeping her pledge to her first\nhusband. In 1872, his father realized the opportunities for his son\nwere better in Boston, and he moved there with his son. Finding Boston\ninhospitable, puritanical, and cold, the father returned alone to\nÁvila within a few months. The separation between father and\nmother was permanent. In 1888 Agustín wrote to Josefina:\n“When we were married I felt as if it were written that I should\nbe reunited with you, yielding to the force of destiny. Strange\nmarriage, this of ours! So you say, and so it is in fact. I love you\nvery much, and you too have cared for me, yet we do not live\ntogether” (Persons and Places, 9).\n\n\nUntil his father’s death (1893), Santayana regularly corresponded\nwith his father and he visited him after Santayana’s first year at\nHarvard College. In Boston, Santayana’s family spoke only Spanish in\ntheir home. Santayana first attended Mrs. Welchman’s Kindergarten to\nlearn English from the younger children, then he was a student at the\nBoston Latin School, and he completed his B.A. and Ph.D. at Harvard\nCollege (1882–1889), including eighteen months of study in Germany on a\nWalker Fellowship. His undergraduate years at Harvard reveal an\nenergetic student with an active social life. He was a member of eleven\norganizations including The Lampoon (largely as a cartoonist),\nthe Harvard Monthly (a founding member), the Philosophical\nClub (President), and the Hasty Pudding.\n\n\nSome scholars conclude that Santayana was an active homosexual based\non allusions in Santayana’s early poetry (McCormick, 49–52) and\nSantayana’s association with known homosexual and bisexual friends.\nSantayana provides no clear indication of his sexual preferences, and\nhe never married. Attraction to both women and men seems apparent in\nhis undergraduate and graduate correspondence. The one documented\ncomment about his homosexuality occurs when he was sixty-five. After a\ndiscussion of A. E. Housman’s poetry and homosexuality, Santayana\nremarked, “I think I must have been that way in my Harvard days —\nalthough I was unconscious of it at the time” (Cory, Santayana: The\nLater Years, 40). Because of Santayana’s well-known frankness,\nmany scholars consider Santayana a latent homosexual based on this\nevidence.\n\n1886–1912. Santayana received his Ph.D. from\nHarvard in 1889 and became a faculty member at Harvard University\n(1889–1912) and eventually a central figure in the era now called\nClassical American Philosophy. He was a highly respected and popular\nteacher, and his students included poets (Conrad Aiken, T. S. Eliot,\nRobert Frost, Wallace Stevens), journalists and writers (Walter\nLippmann, Max Eastman, Van Wyck Brooks), professors (Samuel Eliot\nMorison, Harry Austryn Wolfson), a Supreme Court Justice (Felix\nFrankfurter), many diplomats (including his friend Bronson Cutting),\nand a university president (James B. Conant). He retired from Harvard\nin 1912 at the age of forty-eight and lived the remainder of his life\nin England and Europe, never returning to the U.S. and rejecting\nacademic posts offered at a number of universities, including Harvard,\nColumbia, and Cambridge.\n\n\nSantayana cherished academic life for its freedom to pursue\nintellectual interests and curiosity, but he found that many aspects\nof being a professor infringed on that freedom. Faculty meetings and\nuniversity committees seemed primarily to be partisan heat over false\nissues, so he rarely attended them. The general corporate and\nbusinesslike adaptation of universities was increasingly less\nconducive to intellectual development and growth. He expressed concern\nabout the evolving Harvard goal of producing muscular intellectuals to\nlead America as statesmen in business and government. Were not delight\nand celebration also a central aspect of education? He wrote to a\nfriend in 1892, expressing the hope that his academic life would be\n“resolutely unconventional” and noted that he could only\nbe a professor per accidens, saying that “I would\nrather beg than be one essentially” (GS to H. W. Abbot,\nStoughton Hall, Harvard, 15 February 1892.  Columbia).\n\n\nIn 1893, Santayana experienced a metanoia, a change of\nheart. Gradually he altered his style of life from that of an active\nstudent turned professor to one focused on the imaginative celebration\nof life. In doing so, he began planning for his early retirement,\nfinding university life increasingly less conducive to intellectual\npursuits and delight in living. Three events preceded his\nmetanoia: the unexpected death of a young student, witnessing\nhis father’s death, and the marriage of his sister Susana. Santayana’s\nreflections on these events led to the ancient wisdom that acceptance\nof the tragic leads to a lyrical release. “Cultivate imagination,\nlove it, give it endless forms, but do not let it deceive you. Enjoy\nthe world, travel over it, and learn its ways, but do not let it hold\nyou … . To possess things and persons in idea is the only pure\ngood to be got out of them; to possess them physically or legally is a\nburden and a snare (Persons and Places, 427–28).”\n\n\nIncreasingly, naturalism and the lyrical cry of human imagination\nbecame the focal points of Santayana’s life and thought. Pragmatism, as\ndeveloped by Peirce and James, was an undercurrent in his naturalism,\nparticularly as an approach to how we ascertain knowledge, but there\nare aspects of his naturalism more aligned with European and Greek\nthought that presage developments in the late twentieth century. His\nnaturalism had its historical roots primarily in Aristotle and Spinoza\nand its contemporary background in James’s pragmatism and Royce’s\nidealism. His focus on and celebration of creative imagination in all\nhuman endeavors (particularly in art, philosophy, religion, literature,\nand science) is one of Santayana’s major contributions to American\nthought. This focus, along with his Spanish heritage, Catholic\nupbringing, and European suspicion of American industry, set him apart\nin the Harvard Yard.\n\n\nSantayana’s strong interest in literature and aesthetics is evident\nthroughout this early period, but by 1904, his attention turned almost\nfully to philosophical pursuits. During this period his publications\ninclude: Lotze’s System of Philosophy (dissertation),\nSonnets and Other Verses (1894), The Sense of Beauty\n(1896), Lucifer: A Theological Tragedy (1899),\nInterpretations of Poetry and Religion (1900), A Hermit of\nCarmel, and Other Poems (1901), The Life of Reason (five\nbooks, 1905–1906), Three Philosophical Poets: Lucretius, Dante, and\nGoethe (1910).\n\n\nIn May 1911, Santayana formally announced his long-planned\nretirement from Harvard. President Lowell asked him to reconsider. By\nnow Santayana was a highly recognized philosopher, cultural critic,\npoet, and teacher, and his desire to be free from academic confinement\nwas also well known. Lowell indicated he was open to any arrangement\nthat provided Santayana the time he desired for writing and for travel\nin Europe. Initially Santayana agreed to alternate years in Europe and\nthe U.S., but in 1912, his resolve to retire overtook his sense of\nobligation to Harvard. The year before his retirement, he had presented\nat least six lectures at a variety of universities including Berkeley,\nWisconsin, Columbia, and Williams. His books were selling well and his\npublishers were asking for more. Two major universities were courting\nhim. At forty-eight, he left Harvard to become a full-time writer and\nto escape the academic professionalism that nurtured a university\novergrown with “thistles of trivial and narrow scholarship.”\n\n1912–1952. As Santayana sailed for Europe, his\nmother died, apparently of Alzheimer’s disease. Always attentive to his\nfamily, Santayana visited her weekly, then daily, during his last years\nat Harvard. Knowing his mother’s death was imminent, he arranged for\nJosephine, his half sister, to live in Spain with Susana, who\npreviously had married a well-to-do Ávilan. An inheritance of\n$10,000 from his mother, coupled with his steady income from\npublications and his early planning, made retirement easier. He\narranged for his half brother, Robert, to manage his finances with the\nagreement that upon Santayana’s death, Robert or his heirs would\nreceive the bulk of Santayana’s estate. Hence, in January 1912, at age\nforty-eight, Santayana was free from the constraints of university\nregimen and expectations and, more importantly, free to write, to\ntravel, and to choose his residence and country.\n\n\nSantayana’s book publications after leaving Harvard is remarkable:\nWinds of Doctrine (1913), Egotism in German\nPhilosophy (1915), Character and Opinion in the United\nStates (1920), Soliloquies in England and Later\nSoliloquies (1922), Scepticism and Animal Faith (1923),\nDialogues in Limbo (1926), Platonism and the Spiritual\nLife (1927), the four books of The Realms of Being (1927,\n1930, 1938, 1940), The Genteel Tradition at Bay (1931),\nSome Turns of Thought in Modern Philosophy (1933), The\nLast Puritan (1935), Persons and Places (1944), The\nMiddle Span (1945), The Idea of Christ in the Gospels\n(1946), Dominations and Powers (1951), and My Host the\nWorld (1953, posthumous).\n\n\nHarvard attempted to bring him back to the United States, offering\nhim several professorships beginning in 1917. As late as 1929, he was\noffered the Norton Chair in Poetry, one of Harvard’s most respected\nchairs. In 1931, he received an invitation from Brown University, and\nHarvard later asked him to accept the William James Lecturer in\nPhilosophy, a newly established honorary post. But Santayana never\nreturned to Harvard or to America. Believing that the academic life was\nnot a place for him to cultivate intellectual achievement or scholarly\nwork, Santayana also refused academic appointments both at Oxford\nUniversity and Cambridge University.\n\n\nAt first, Santayana planned to reside in Europe, and after numerous\nexploratory trips to several cities, he decided on Paris. However,\nwhile he was in England, World War I broke out and he was unable to\nreturn to the mainland. First, he lived in London and then primarily at\nOxford and Cambridge. After the war, he was more of a traveling\nscholar, and his principal locales included Paris, Madrid,\nÁvila, the Riviera, Florence, and Rome. By the late 1920s, he\nsettled principally in Rome, and during the summers, he often retreated\nto Cortina d’Ampezzo in Northern Italy to write and to escape the heat.\nBecause of his success as a writer, he assisted friends and scholars\nwhen they found themselves in need of financial support. For example,\nwhen Bertrand Russell was unable to find a teaching post in the U.S. or\nEngland because of his views regarding pacifism and marriage, Santayana\ndisplayed a characteristic generosity in his plan to make an anonymous\ngift to Bertrand Russell of the $25,000 royalty earnings from The\nLast Puritan, at the rate of $5,000 per year, in the letter to\nGeorge Sturgis (15 July 1937). Despite the fact that he and Russell\ndisagreed radically both politically and philosophically, his memory of\ntheir earlier friendship and his regard for Russell’s genius moved him\nto compassion for Russell’s financial plight.\n\n\nThe rise of Mussolini in the 1930s initially seemed positive to\nSantayana. He viewed the Italian civil society as chaotic and thought\nMussolini might bring order where needed. But Santayana soon noted the\nrise of a tyrant. Trying to leave Italy by train for Switzerland, he\nwas not permitted to cross the border because he did not have the\nproper papers. With most of his funds coming from the United States and\nEngland, his case was complicated by his Spanish citizenship and his\nage. He returned to Rome, and on 14 October 1941 he entered the Clinica\ndella Piccola Compagna di Maria, a hospital-clinic run by a Catholic\norder of nuns, where he lived until his death eleven years later. This\narrangement was not unusual. The hospital periodically received\ndistinguished guests and cared for them in an assisted-living\nenvironment. Santayana died of cancer on 26 September 1952.\n\n\nSantayana asked that he be buried in unconsecrated ground, affirming\nhis naturalism to the end. However, the only such cemetery ground in\nRome was reserved for criminals. The Spanish Consulate at Rome would\nnot permit Santayana to be buried in such a place and provided the\n“Panteon de la Obra Pia espanola” in the Campo Verano\ncemetery as a suitable burial ground, turning it into a memorial for\nthe lifelong Spanish citizen. At the graveside, Daniel Cory read lines\nfrom Santayana’s “The Poet’s Testament,” a poem affirming his\nnaturalistic outlook:\nI give back to the earth what the earth gave,\n\nAll to the furrow, nothing to the grave.\n\nThe candle’s out, the spirit’s vigil spent;\n\nSight may not follow where the vision went.\n\n\nIn the United States, Wallace Stevens commemorated his teacher in\n“To an Old Philosopher in Rome.”\nTotal grandeur of a total edifice,\n\nChosen by an inquisitor of structures\n\nFor himself. He stops upon this threshold,\n\nAs if the design of all his words takes form\n\nAnd frame from thinking and is realized.\n2. Philosophy, Literature, and Culture\n\n\nThroughout his life, Santayana’s literary achievements are evident.\nAs an eight-year-old Spaniard, he wrote Un matrimonio (A\nMarried Couple), describing the trip of a newly married couple that\nmeets the Queen of Spain. Later in Boston, he wrote a poetic parody of\nThe Aeneid; “A Short History of the Class of\n‘82”; and “Lines on Leaving the Bedford\nSt. Schoolhouse.” His first book, Sonnets and Other\nVerses (1894), is a book of poems, not philosophy. And, until the\nturn of the century, much of his intellectual life was directed to the\nwriting of verse and drama. He was a principal figure in making\nmodernism possible but was not a modernist in poetry or\nliterature. His naturalism and emphasis on constructive imagination\ninfluenced both T. S. Eliot and Wallace Stevens. Eliot’s notion of the\n“objective correlative” is drawn from Santayana, and\nStevens follows Santayana in his refined naturalism by incorporating\nboth Platonism and Christianity without any nostalgia for God or\ndogma.\n\n\nSantayana was among the leaders in transforming the American\nliterary canon, dislodging the dominant Longfellow, Lowell, Whittier,\nHolmes, Bryant canon. Santayana’s essay “The Genteel Tradition in\nAmerican Philosophy” (presented to the Philosophical Union of the\nUniversity of California in 1911) greatly affected Van Wyck Brooks’s\nAmerica’s Coming-of-Age, a book that set the tone for\nmodernism. Brooks drew on Santayana’s essay, adapting Santayana’s idea\nof two Americas to fit his notion of an America split between highbrow\nand lowbrow culture.\n By the turn of the century, Santayana’s interests largely centered\non his philosophical inquiries, and although he never abandoned\nwriting poetry, he no longer considered it his central work. Even so,\nsome of his most moving poetry came later and was inspired by the\ntrench warfare and casualties of World War I: “A Premonition:\nCambridge, October, 1913”; “The Undergraduate Killed in\nBattle: Oxford, 1915”; “Sonnet: Oxford, 1916”; and\n“The Darkest Hour: Oxford, 1917.” Throughout his life,\neven near death, he recited and translated long fragments of Horace,\nRacine, Leopardi, and others.\n\n\nThe relationships between literature, art, religion and philosophy\nare prominent themes throughout Santayana’s writings. The Sense of\nBeauty (1896) is a primary source for the study of aesthetics.\nPhilip Blair Rice wrote in the foreword to the 1955 Modern Library\nedition: “To say that aesthetic theory in America reached\nmaturity with The Sense of Beauty is in no way an\noverstatement. Only John Dewey’s Art as Experience has\ncompeted with it in the esteem of philosophical students of aesthetics\nand has approached its suggestiveness for artists, critics and the\npublic which takes a thoughtful interest in the arts.”\nSantayana’s groundbreaking approach to aesthetics is emphasized in\nArthur Danto’s “Introduction” to the 1988 critical edition.\nDanto writes that Santayana brings “beauty down to earth”\nby treating it as a subject for science and giving it a central role in\nhuman conduct, in contrast to the preceding intellectualist tradition\nof aesthetics. “The exaltation of emotion and the naturalization\nof beauty — especially of beauty — imply a revolutionary\nimpulse for a book it takes a certain violent act of historical\nimagination to recover” (Sense of Beauty, xxviii). This\nnaturalistic approach to aesthetics is expanded in his philosophical\nexplication of art found in The Life of Reason: Reason in Art\n(1905).\n\n\nIn 1900, Santayana’s Interpretations of Poetry and Religion\ndevelops his view that religion and poetry are expressive celebrations\nof life. Each in its own right is of great value, but if either is\nmistaken for science, the art of life is lost along with the beauty of\npoetry and religion. Science provides explanations of natural\nphenomena, but poetry and religion are festive celebrations of human\nlife born of consciousness generated from the interaction of one’s\npsyche (the natural structure and heritable traits of one’s physical\nbody) and the physical environment. As expressions of human values,\npoetry and religion are identical in origin. Understanding the\nnaturalistic base for poetry and religion and valuing their expressive\ncharacter enable one to appreciate them without being hoodwinked:\n“poetry loses its frivolity and ceases to demoralise, while religion\nsurrenders its illusions and ceases to deceive” (172). Interestingly,\nhis father expressed similar views in his letters to his son, providing\nthe genesis of his son’s reflections, and this conclusion is expressed\nas late as the 1946 publication of The Idea of Christ in the\nGospels where Santayana presents the idea of Christ as poetic and\nimaginative, contrasted with attempts at historical, factual accounts\nof the Christ figure. The impact of Santayana’s view was significant,\nand Henry James (after reading Interpretations of Poetry and\nReligion) wrote that he would “crawl across London” if need be to\nmeet Santayana.\n\nThree Philosophical Poets (1910) was the first volume of\nthe Harvard Studies in Comparative Literature. Santayana employs a\nnaturalistic account of poetry and philosophy, attempting to combine\ncomparative structures with as few embedded parochial assumptions as\npossible while making explicit our material boundness to particular\nworlds and perspectives. His analyses of Lucretius, Dante, and Goethe\nare described by one biographer as “a classical work and one of the few\nwritten in America to be genuinely comparative in conception and\nexecution, for its absence of national bias and its intellectual,\nlinguistic, and aesthetic range” (McCormick, 193).\n\n\nInitially, Santayana appears optimistic about the youthful America.\nIn his Berkeley lecture, “The Genteel Tradition in American\nPhilosophy,” he declared “the American Will inhabits the\nsky-scraper; the American Intellect inhabits the colonial\nmansion.” (“The Genteel Tradition in American\nPhilosophy,” Triton Edition, vol. VII. P. 129.) European\ntranscendentalism and Calvinism are the American intellectual\ntraditions, but they no longer suit the American drive for success in\nindustry, business, and football. Hence, the youthful willfulness of\nthe country has outrun the old wits, but there remains a chance for\nwisdom and energy to be coupled in a future coherent and rich\ntradition, and he sees the beginnings of such a tradition in James’s\npragmatism.\n\n\nWithin a decade, he is less optimistic. Character and Opinion in\nthe United States (1920) is his valediction to America. It\nincludes frank, intellectual portraits of his Harvard colleagues and of\nAmerican culture. From his residence in Cambridge, he praises the\nEnglish emphasis on social cooperation and personal integrity and\ncontrasts them with America where “You must wave, you must cheer, you\nmust push with the irresistible crowd; otherwise you will feel like a\ntraitor, a soulless outcast, a deserted ship high and dry on the shore\n… . This national faith and morality are vague in idea, but\ninexorable in spirit; they are the gospel of work and the belief in\nprogress. By them, in a country where all men are free, every man finds\nthat what most matters has been settled beforehand” (211).\n\n\nSantayana’s standing as a literary figure reached its zenith with\nthe publication of The Last Puritan (1936). The Last\nPuritan is Santayana’s only novel, and it was an international\nsuccess. It was compared positively with Goethe’s Wilhelm\nMeister, Pater’s Marius, and Mann’s The Magic\nMountain. Its provenance lies in the 1890s when Santayana began a\nseries of sketches on college life that, broadened through his\nexperience and travel, resulted in The Last Puritan.\nEssentially, it is about the life and early death of an American youth,\nOliver Alden, who is sadly restricted by his Puritanism. Santayana\ndraws a sharp contrast with the European Mario, who delights in all\nmatters without a narrow moralism. Mario is a carefree, naturally\ngifted and likeable young man who by American standards appears too\nfocused on the peripheral aspects of life: travel, opera, love affairs,\nand architecture. And the American perspective is embodied in the\ntragic hero, Oliver Alden, who is the last Puritan. He does what is\nright, based on his duties to his family, school, and friends. Life is\na slow, powerful flow of tasks and responsibilities. He is intelligent\nand knows there is more than obligation, and he senses his guilt at not\nbeing able to achieve the natural abundant life, but knowing this only\nnourishes his Puritanism and causes him to feel guilty about being\nguilty. In a charming scene in the novel, Oliver introduces Mario to\nProfessor Santayana at Harvard. Oliver is a dedicated student and\nfootball player, thoroughly a first rate American taking matters\nseriously and doing his best. After only a short visit with the\nProfessor, Mario, it is decided by Santayana, does not need to take a\ncourse from the Professor. Mario already has the natural, instinctual\napproach of a cultivated person. Oliver, on the other hand, knows he\nmust work to achieve his goal, which will be only a succession of\ngoals, and ends tragically. Santayana’s Hispanic and Catholic\nbackground play a central role in his critique of American life: too\nbound by past traditions and obligations that are not understood or\nrooted in one’s own culture.\n\n\nThe fear that Santayana’s autobiography would be lost or destroyed\nduring World War II, led Scribner’s, the publisher, to conspire with\nthe U.S. Department of State, the Vatican, and the Spanish government\nto bring the manuscript of the first part (Persons and Places)\nout of Rome sub rosa, despite the Italian government’s refusal\nto allow any mail to the U.S. The manuscript for the second part\n(The Middle Span, 1945) also was conveyed surreptitiously to\nNew York. The third part (My Host the World, 1953) was\npublished after Santayana’s death. His autobiography provides the basis\nfor understanding the development of his philosophy\n3. Development of Santayana’s Philosophy\n\n\nIn his autobiography, Persons and Places, Santayana describes\nthe development of his thought as a movement from the idealisms of\nboyhood to the intellectual materialism of a traveling student, and\nfinally to the complete, naturalistic outlook of the adult\nSantayana. He emphasizes the continuity of his life and beliefs,\ncontrasting what may appear to be disparate views with the overall\nunity of his thought: “The more I change the more I am the same\nperson” (Persons and Places, 159).\n\n\nAs a young man of the nineteenth century, he was influenced by the\nidealism of the age and of his age, but he claims to have always been a\nrealist or naturalist at heart.\n\n\nBut those ideal universes in my head did not produce any firm\nconvictions or actual duties. They had nothing to do with the wretched\npoverty-stricken real world in which I was condemned to live. That the\nreal was rotten and only the imaginary at all interesting seemed to me\naxiomatic. That was too sweeping; yet allowing for the rash\ngeneralisations of youth, it is still what I think. My philosophy has\nnever changed. (Persons and Places, 167)\n\n\nHence he notes, that in spite “of my religious and other\nday-dreams, I was at bottom a young realist; I knew I was dreaming,\nand so was awake. A sure proof of this was that I was never anxious\nabout what those dreams would have involved if they had been true. I\nnever had the least touch of superstition” (Persons and\nPlaces, 167).  Santayana cites poems, “To the Moon”\nand “To the Host,” written when he was fifteen or sixteen,\nas revealing this early realism, and he quotes from memory one stanza\nof “At the Church Door” where the realistic sentiment is\nthe same (Persons and Places, 169).\n\n\nBy the time he was a traveling student seeing the world in Germany,\nEngland, and Spain his “intellectual materialism” was firmly\nestablished with little change in his religious affections.\n\n\nFrom the boy dreaming awake in the church of the Immaculate\nConception, to the travelling student seeing the world in Germany,\nEngland, and Spain there had been no great change in sentiment.\nI was\nstill “at the church door”. Yet in belief, in the\nclarification of my philosophy, I had taken an important step. I no\nlonger wavered between alternative views of the world, to be put on or\ntaken off like alternative plays at the theatre. I now saw that there\nwas only one possible play, the actual history of nature and of\nmankind, although there might well be ghosts among the characters and\nsoliloquies among the speeches. Religions, all religions, and\nidealistic philosophies, all idealistic philosophies, were the\nsoliloquies and the ghosts. They might be eloquent and profound. Like\nHamlet’s soliloquy they might be excellent reflective criticisms of\nthe play as a whole. Nevertheless they were only parts of it, and\ntheir value as criticisms lay entirely in their fidelity to the facts,\nand to the sentiments which those facts aroused in the\ncritic. (Persons and Places, 169)\n\n\nThe full statement and development of his materialism did not occur\nuntil later in his life. It was certainly in place by the time of\nScepticism and Animal Faith (1923) but not fully so at the\ntime of The Life of Reason (1905). The influence of the\nHarvard philosophers, particularly James and Royce is evident in\nSantayana’s thought, but he was hardly a mere follower and often\nadvanced his philosophy more along European and Greek lines rather than\nthe American tradition, which he thought was both too derivative and\ntoo tied to the advancement of business and capitalism.\n\n\nThe move from Harvard marked not only a geographical shift but a\nphilosophical one as well. Henry Levinson in Santayana,\nPragmatism, and the Spiritual Life provides a well-balanced\naccount of this gradual but distinctive move from the Harvard\nphilosophical mentality.  Leaving Harvard also meant that Santayana\nabandoned the view of a philosopher as a public, philosophical\nstatesman and of language as being representative. This philosophical\nturn placed makes him a forerunner of many issues in the next two\ncenturies. Removing himself, literally and philosophically, from the\nAmerican scene, Santayana increasingly came to believe that the\n“brimstone” sensibility of pragmatism was wrong-headed\n(Character and Opinion in the United States, 53). A major\naspect of this sensibility was the view that philosophers must be\nengaged fundamentally in social and cultural policy formulation, and\nif they are not, they are not pulling their civic weight. In this\nfashion, Santayana believes the pragmatists came to belie “the\ngenuinely expressive, poetic, meditative, and festive character of\ntheir vocation” (Levinson,165). A condition that James took\nseriously in his “On a Certain Blindness in Human Beings,”\nsuggesting that the world of practical responsibility fosters a\nblindness to multiplural ways of living that can only be escaped by\ncatching sight of “the world of impersonal worths as such”\n— “only your mystic, your dreamer, or your insolent loafer\nor tramp can afford so sympathetic an occupation” (James,\nTalks to Teachers on Psychology and to Students on Some of\nLife’s Ideals, 141).  Interestingly, America’s\nimperialistic actions toward the Philippines during the\nSpanish-American War sparked James’ remarks; this was a war that\nhad a much deeper ancestral and historical aspect for Santayana and\nled to his poem, “Young Sammy’s First Wild Oats.”\nWhether connected or not, Santayana later came to identify himself as\nan intellectual vagabond or tramp, not isolated in the specific\nperspectives of an ideology, hosted by the world, and devoted to\nspiritual disciplines that “appear irresponsible to philosophers\nhoping to command representative or some otherwise privileged\nauthority at the center of society” (Levinson, 167).\n\n\nBuilding on his naturalism, institutional pragmatism, social\nrealism, and poetic religion, Santayana on leaving Harvard moves even\nfarther from the role of philosophical statesman by removing the\nrepresentative authority of language from the quest for a comprehensive\nsynthesis, by narrowing the line between literature and philosophy (as\nhe had earlier done between religion and poetry), and by wrestling more\nwith the influence of James than of Emerson. Santayana’s stay in Oxford\nduring the Great War led to his famous counter to Wilson’s war to end\nall wars: “Only the dead have seen the end of war.” (Soliloquies in\nEngland and Later Soliloquies, 102)\n\n\nSantayana’s message is clear: The epistemological project that\nRussell’s Problems epitomizes is diseased. The renewed quest\nto establish unmediated Knowledge of Reality simply leads to\n“intellectual cramp” (Soliloquies, 216). Philosophy has itself\nbecome spiritually disordered by blinding its practitioners\nfrom their traditional and proper task, which is to celebrate the good\nlife. If the spiritual disciplines of philosophy are to thrive,\nphilosophers have to take off the bandages of epistemology and\nmetaphysics altogether, accept the finite and fallible status of their\nknowledge claims, and get on with confessing their belief in the things\nthat make life worth living (Levinson, 204).\n\n\nLeaving Harvard and America enabled Santayana to develop his\nnaturalism.\n4. Naturalism\n\nScepticism and Animal Faith (1923) introduces Santayana’s\nmature naturalism. In summary, he maintains that knowledge and belief\nare not the result of reasoning. They are inescapable beliefs essential\nfor action. Epistemological foundationalism is a futile approach to\nknowledge. A more promising approach is to discern the underlying\nbelief structures assumed in animal action and imposed by natural\ncircumstances. The foundations for this approach are rooted in\nAristotle’s concept of activity and the pragmatic approach to action\nand knowledge. Explanations of natural events are the proper purview of\nscientists, while explications of the meaning and value of action may\nbe the proper sphere of historians and philosophers. Even so, both\nscientific explanations and philosophical explications are based in the\nnatural world. Meaning and value are generated by the interaction of\nour physical makeup, which Santayana calls “psyche,” and\nour material environment.\n\n\nSantayana’s critique of epistemological foundationalism is as unique\nas his heritage. With Spanish irony, he structures his argument after\nDescartes’ Meditations but arrives at an anti-foundationalist\nconclusion. Drawing attention to what is given in an instant of\nawareness (the smallest conceivable moment of consciousness), he\nmaintains that any knowledge or recognition found in such an instant\nwould have to be characterized by a concept (or “essence”\nto use Santayana’s term). Concepts cannot be limited to particular\ninstances; rather the particular object is seen as an instance of the\nconcept (essence). Thus, pursuing doubt to its ultimate end, one is\nconfined by the “solipsism of the present moment.” That is,\nin a single instant of awareness there can be no knowledge or belief,\nsince both require concepts not bounded by a moment of awareness.\nHence, the ultimate end of doubt, an instance of awareness, is empty.\nIt is the vacant awareness of a given without a basis for belief,\nknowledge or action. Santayana concludes that if one attempts to find\nthe bedrock of certainty, one may rest his claim only after he has, at\nleast theoretically, recognized that knowledge is composed of instances\nof awareness that in themselves do not contain the prerequisites for\nknowledge, e.g., concepts, universals, or essences. That both\nskepticism and proofs against skepticism lead nowhere is precisely\nSantayana’s point.\n\n\nPhilosophy must begin in medias res (in the middle of\nthings), in action itself, where there is an instinctive and arational\nbelief in the natural world: “animal faith.” For Santayana,\nanimal faith is the arational basis for any knowledge claims. It is the\nnether world of biological order operating through our physical,\nnon-conscious being generating beliefs that are “radically incapable of\nproof” (Scepticism, 35).\n\n\nIn rising out of passive intuition, I pass, by a vital constitutional\nnecessity, to belief in discourse, in experience, in substance, in\ntruth and in spirit. All these objects may conceivably be illusory.\nBelief in them however, is not grounded on a prior probability, but\nall judgements of probability are grounded on them. They express a\nrational instinct or instinctive reason, the waxing faith of an animal\nliving in a world which he can observe and sometimes remodel.\n(Scepticism, 308–309)\n\n\nHe describes these prejudices as “animal” in an effort to emphasize\nour biological base and community. This emphasis is similar to\nWittgenstein’s reference to convictions that are beyond being justified\nor unjustified as “something animal” (On Certainty 359). Ours\nis a long-standing primitive credulity, and our most basic beliefs are\nthose of an animal creed: “that there is a world, that there is a\nfuture, that things sought can be found, and things seen can be eaten”\n(Scepticism 180).\n\n\nSantayana (like Hume, Wittgenstein, and Strawson) holds there are\ncertain inevitable beliefs; they are inescapable given nature and our\nindividual physical history. And like Wittgenstein, he maintains that\nthese beliefs are various and variable. They are determined by the\ninterplay between environment and psyche, i.e., between our natural\nconditions and the inherited, physical “organisation of the animal”\n(the psyche). That we now inescapably believe in external objects and\nthe general reliability of inductive reasoning, for example, is a\nresult of physical history and the natural conditions of our world and\nourselves. Since these beliefs are relative to our physical histories,\nif our history and biological order had been different, our natural\nbeliefs would also be different.\n\n\nThe environment determines the occasions on which intuitions arise,\nthe psyche — the inherited organisation of the animal — determines\ntheir form, and ancient conditions of life on Earth no doubt determined\nwhich psyches should arise and prosper; and probably many forms of\nintuition, unthinkable to man, express the facts and the rhythms of\nnature to other animal minds (Scepticism, 88).\n\n\nBy displacing privileged mentalistic accounts with his pragmatic\nnaturalism, Santayana challenges then prevailing structures in both\nAmerican and English philosophies.\n\n\nSantayana explicates the primary distinguishable characteristics of\nour knowledge in his four-book Realms of Being. Believing that\nphilosophical terminology should have historical roots, Santayana\nemployed classical terminology for these characteristics: matter,\nessence, spirit, and truth. And although these terms are central to\nmany philosophical traditions, he views his work as “a revision of the\ncategories of common sense, faithful in spirit to orthodox human\ntradition, and endeavouring only to clarify those categories and\ndisentangle the confusions that inevitably arise …”\n(Realms 826).\n\n\nWithin Santayana’s naturalism, the origins of all events in the\nworld are arbitrary, temporal, and contingent. Matter (by whatever name\nit is called) is the principle of existence. It is “often untoward, and\nan occasion of imperfection or conflict in things.” (Realm of\nMatter, v) Hence, a “sour moralist” may consider it evil, but,\naccording to Santayana, if one takes a wider view “matter would seem a\ngood … because it is the principle of existence: it is all\nthings in their potentiality and therefore the condition of all their\nexcellence or possible perfection.” (Realm of Matter, v)\nMatter is the non-discursive, natural foundation for all that is. In\nitself, it is neither good nor evil but may be perceived as such when\nviewed from the vested interest of animal life. Latent animal interests\nconvert matter’s non-discernible, neutral face to a smile or frown. But\n“moral values cannot preside over nature.” (Realm of Matter,\n134) Principled values are the products of natural forces: “The\ngermination, definition, and prevalence of any good must be grounded in\nnature herself, not in human eloquence.” (Realm of Matter,\n131) From the point of view of origins, therefore, the realm of matter\nis the matrix and the source of everything: it is nature, the sphere of\ngenesis, the universal mother.\n\n\n“Essence” is Santayana’s term for concepts and meanings.\nHe draws on Aristotle’s notion of essence but removes all capacities\nfor producing effects. An essence is a universal, an object of thought,\nnot a material force. However, consciousness of an essence is generated\nby the interaction of a psyche and the material environment. Hence,\nmatter remains as the origin of existence and the arena of action, and\nthe realm of essence encompasses all possible thought.\n\n\n“Truth,” if some disinterested observer could ascertain\nit, would constitute all the essences that genuinely characterize the\nnatural world and all activities within it. Since all living beings\nhave natural interests and preferences, no such knowledge of truth can\nexist. All conscious beings must ascertain belief about truth based on\nthe success of actions that sustain life and permit periods of delight\nand joy.\n\n\nSantayana uses the term “spirit” to mean consciousness or\nawareness. As early as 19 April 1909, Santayana wrote to his sister\nthat he was writing a brand new system of philosophy to be called\n“The realms of Being” — “not the mineral\nvegetable and animal, but something far more metaphysical, namely\nEssence, Matter, and Consciousness. It will not be a long book, but\nvery technical.” When the book was published in the 1930s, he\nhad added his notion of truth and substituted “spirit” for\n“consciousness.” From his perspective, the substitution\ndid not alter the meaning of consciousness but rather captured an\nentire tradition of philosophical and religious inquiry as well as\nborrowed associated ideas from eastern religions. But to the\nconsternation of traditional views, many found the identity of spirit\nwith consciousness a troublesome idea. And so they should, for with\nthis identity Santayana removes the spiritual from the field of agency\nas well as from being an alternative way of living.  Santayana’s\napproach is therefore in direct contrast with those who think of\nspirit as causing action or as fostering a particular lifestyle.\nFollowing the tracks of Aristotle, he makes the spiritual life one\nform of culminating experiences arising from fulfilling activity.\n\n\nAwareness evolved through the natural development of the physical\nworld, and he demurs to scientific accounts for explanations of that\ndevelopment. Almost poetically, he sees spirit as emerging in moments\nof harmony between the psyche and the environment. Such harmony is\ntemporary, and the disorganized natural forces permit spirit to arise\n“only spasmodically, to suffer and to fail. For just as the\nbirth of spirit is joyous, because some nascent harmony evokes it, so\nthe rending or smothering of that harmony, if not sudden, imposes\nuseless struggles and suffering” (Birth of Reason,\n53). Accepting the world’s insecure equilibrium enables one to\ncelebrate the birth of spirit. Reasoning, particularly reasoning\nassociated with action, is a signal of the nascent activities of the\npsyche working to harmonize its actions with the environment, and if\nsuccessful, reason permits individual and social organization to\nprosper while spirit leads to the delight of imagination and\nartistry.\n\n\nSome commentators characterize Santayana as an epiphenomenalist, and\nthere are some commonalities, specifically the view that spirit is not\nefficacious. But there also are considerable differences. Santayana\ndoes not characterize his view as one-way interactionism, primarily\nbecause he does not think of spirit as an object to be acted upon.\nSpirit is rather a distinguishable aspect of thought, generated in\nactivity, and may be viewed more as a relational property. Santayana\nsometimes speaks of spirit and essence as supervening on material\nevents. But lacking the distinctions of contemporary philosophy, it is\ndifficult to characterize Santayana’s philosophy of mind accurately.\nHis view of consciousness is more celebrational, as opposed to being a\nburden or eliciting action. Spirit is “precisely the voice of order in\nnature, the music, as full of light as of motion, of joy as of peace,\nthat comes with an even partial and momentary perfection in some vital\nrhythm” (Birth of Reason, 53).\n\n\nSantayana’s account of spirit and essence may lead one to wonder\nhow Santayana can be included as a pragmatist, and this classification\nis accurate only if one includes an extended notion of pragmatic\nnaturalism. For Santayana, explanations of human life, including reason\nand spirit, lie within the sciences. The nature of truth simply is\ncorrespondence with what is, but since humans, nor any other conscious\nbeing, are able to see beyond the determinant limits of their nature\nand environment, pragmatism becomes the test of truth rather than\ncorrespondence. In short, the nature of truth is correspondence while\nthe test of truth is pragmatic. If an explanation continues to bear\nfruit over the long run, then it is accepted as truth until it is\nreplaced by a better explanation. In this, Santayana’s account of\npragmatic truth is more closely aligned with Peirce’s conception than\nthat of James or Dewey, including a tripartite account of knowledge\nconsisting of the subject, symbol, and object. Pragmatism is properly\nfocused on scientific inquiry and explanations, and it is severely\nlimited, even useless, in spiritual and aesthetic matters. Pragmatism\nis rooted in animal life, the need to know the world in a way that\nfosters successful action. If all life were constituted only by\nsuccessful or unsuccessful activities, one’s fated circumstances would\ngovern. But consciousness makes liberation possible and brings delight\nand festivity in material circumstances.\n\n\nSantayana’s anti-foundationalism, non-reductive materialism, and\npragmatic naturalism coupled with his emphasis on the spiritual life\nand his view of philosophy as literature anticipated many developments\nin philosophy and literary criticism that occurred in the latter half\nof the twentieth century, and these served as a challenge to the more\nhumanistic naturalisms of John Dewey and other American naturalists.\nThese views also provide the foundation for his view of ethics,\npolitical philosophy, and the spiritual life.\n5. Ethics, Politics, and the Spiritual Life\n\n\nSantayana’s moral philosophy is based on his naturalism. Most\ncommentators classify Santayana as an extreme moral relativist who\nmaintains that all individual moral perspectives have equal standing\nand are based on the heritable traits and environmental circumstances\nof individuals. This naturalistic approach applies to all living\norganisms. Nature does not establish a moral hierarchy of goods between\nanimal populations nor between individual animals. However, this same\nmoral relativism is also the basis for Santayana’s claim that the good\nof individual animals is clear and is subject to naturalistic or\nbiological investigation.\n\n\nTwo tenets of his ethics are (1) the forms of the good are diverse,\nand (2) the good of each animal is definite and final. The moral\nterrain of animals, viewed from a neutral perspective, places all\nanimal interests and goods as equal. Each good stems from heritable\nphysical traits and is shaped by adaptations to the environment.\nConcluding that the “forms of the good are divergent,”\nSantayana holds that the good for each animal may differ, depending on\nthe nature of the psyche and the circumstances, and may be different\nfor an individual animal in different times and environments. There is\nno one good for all, or even for an individual.\n\n\nSeen as a whole, animal goods are not logically or morally ordered,\nthey are natural, morally neutral forces. But no living being can\nobserve all interests with such neutrality. Situated in a particular\nplace and time with heritable traits, all living beings have interests\noriginating from their physiology and physical environment. For\nSantayana, one may reasonably note that a neutral observer could view\nall moral perspectives as equal, but such a view must be balanced by\nthe understanding that no animal stands on neutral ground. There is a\npolarity between the ideal neutral, objective understanding of behavior\non the one hand and the committed and vested interest of particular\nliving beings on the other hand. One may recognize that every animal\ngood has its own standing, and one may respect that ideal, but “the\nright of alien natures to pursue their proper aims can never abolish\nour right to pursue ours” (Persons and Places, 179).\n\n\nSantayana’s second moral insight is that for each animal the good is\ndefinite and final. There are specific goods for each animal depending\non the specific heritable traits and interests of the psyche and on the\nspecific circumstances of the environment. Self-knowledge, then, is the\ndistinguishing moral mark. The extent to which one knows one’s\ninterests, their complexity and centrality, will determine whether one\ncan achieve a good life, provided the environment is accommodating.\nSantayana’s philosophy rests on his naturalism and on his humane and\nsympathetic appreciation for the excellence of each life. But from the\nperspective of autobiography, Santayana’s clear notion of\nself-knowledge, in the sense of the Greeks, is his most distinguishing\nmark. For Santayana, “integrity or self-definition is and remains first\nand fundamental in morals …” (Persons and Places\n170).\n\n\nSelf-knowledge requires a critical appreciation of one’s culture and\nphysical inheritance, and the ability to shape one’s life in streams of\nconflicting goods within oneself and within one’s community. Although\nthis position is common to many considerations of political philosophy,\nSantayana’s approach to politics was much more conservative than that\nnormally associated with the founders of American pragmatism, such as\nJames and Dewey.\n\n\nSantayana’s political conservatism is founded on his naturalism and\nhis emphasis on self-realization and spirituality. He is concerned\nthat liberal democracy may not provide a consistent basis for\nindividual freedom and spirituality. The twin fears of private anarchy\nand public uniformity are the grounds for his criticisms of democracy,\nand his account of social justice focuses on the individual rather\nthan the society. Santayana’s inattentiveness to social inequality is\nperhaps understandable in the context of his naturalism where the\nfinal cause is the “authority of things.” His basic\ncontention that individual suffering is the worse feature of human\nlife, not social inequality, causes him to focus more on the natural\ndilemmas of the individual rather than on social action. Coupling this\nargument with the view that all institutions, including governments,\nare inextricably rooted in their culture and background perhaps makes\nit understandable that he would not readily see how particular views\nof social inequality could be transferred readily from one culture to\nanother. In addition, Santayana’s European and particularly Spanish\nbackground influenced his attitudes toward social action. His repeated\n“Latin” perspective caused him to look with considerable\nsuspicion toward forcing Anglo-Saxon outlooks on other cultures. Yet,\nin individual matters he was remarkably forthcoming as when he\nprovided financial support to numerous friends, often of quite\ndifferent philosophical, literary, and political persuasions than his\nown.\n\n\nWithin the natural order every living entity stands on the same\nnatural ground bathing equally in the impartial light of nature. No one\ncan claim a central place above others. But each entity also has an\nembodied set of values, and the art of life is to structure one’s\nenvironment in such a fashion as to best realize those embodied values,\ni.e., to place in harmony the natural forces of one’s life and one’s\nenvironment.\n\n\nAmerican democracy has an exacting challenge. Lacking the time to\nlive in the mind, Americans use quantity as a justification for lack of\nquality in their achievements. Quantity is potentially infinite and\nassures unrivaled busy-ness, but is it worth it? No, according to\nSantayana, if self-realization is the goal of individual life. Of\ncourse, circumstances make it difficult, perhaps impossible, for some\nindividuals to order their lives reasonably and attain the practical\nwisdom to achieve individual happiness. America’s economic success\nwould appear to make this possible for many, but to succeed Americans\nmust abandon servility to mechanism and economics. What is needed is a\nlife made free by a recovery of the capacity to have a vision of the\ngood life (Persons and Places, xxxiv). According to Santayana,\nthe fanatic is a person who has lost sight of their goals and redoubled\ntheir efforts. To supplant this busy, blind, relentlessly quantitative\nexistence, we must regain sight of our goals. Individual life should be\nstructured in light of those goals.\n\n\nSantayana’s focus is on the individual, and the role of the state is\nto protect and to enable the individual to flourish. The goal is not\nsomething far off to be worked toward. It is not a task to be\naccomplished and then supplanted by another task, as is often the case\nwith American enterprise does. Rather it is the celebration of life in its\nfestivities. It is Aristotle’s practical wisdom: structuring individual\nlife as it is, living it joyfully, and assuring that one’s commitments\nare conducive to the delights of the intellect and consistent with the\ndemands of the time and tradition. It is the exercise of one’s free\nchoice, shaping one’s life through material well-being, but doing so to\nappreciate the poetic, dramatic quality of our own existence. To rush\nthrough life and die without the joy of living, that is the tragedy of\nAmerican life.\n\n\nFor some, though perhaps not for many, the spiritual life will be an\norganizing good. The cultural background for the spiritual life is the\nreligious life, primarily as found within the Catholic Church and\ninformed by the late nineteenth century and early twentieth century\naccounts of Eastern religions. But Santayana is not interested in an\nhistorical or doctrinal explication of the elements of traditional\nreligion, rather the philosophical task is to discern the elements\ngiving rise to such traditional views, and, in his own case, to\nexplicate the aspects of these origins without the dogmatism of\ntraditional religious belief.\n\n\nIntroducing the concept of a spiritual life led some to see an\ninherent conflict between Santayana’s life of reason and the spiritual\nlife. In a letter to Milton Karl Munitz (23 July 1939), Santayana\nexplains the different perspectives of the life of reason and the\nspiritual life:\n\n\nI admit gladly that religion (= the “Spiritual life”) is a\nnatural interest, to be collated within the life of reason with every\nother interest; but it is an interest in the ultimate, an adjustment\nto life, death, science, and politics; and though cultivated specially\nby certain minds at certain hours, it has no moral or natural claim to\npredominance. The races and ages in which it is absent will inevitably\nregard it as unnecessary and obstructive, because they tend to arrange\ntheir moral economy without religion at all. Those to whom religion is\nabsorbing (e.g., the Indians) will on the contrary think a moral\neconomy inferior in which no place and no influence is given to the\nmonition of ultimate facts. I think you would not find my two voices\ninharmonious (I agree that they are different in pitch) if you did not\nlive in America in the XXth century when the “dominance of the\nforeground” is so pronounced. The dominance of the distance or\nbackground would impose a different synthesis. (Works, v. 5,\nbook 6, 254)\n\n\nIf the spiritual life was considered a dominating or guiding influence\nin structuring one’s life, the way Santayana views reason, then one\nwould be forced to choose between the life of reason and the life of\nthe spirit as a monk or a nun must choose between the life of the\nworld and that of the religious order. But for Santayana, no such\nconflict exists; spirituality is not choosing a way of living over an\nextended period of time. Indeed, any effort to choose such a life\nwould be short lived, since the spiritual life is a life of\nreceptivity to all that comes in the moment while suspending animal\ninterests.  Suspending one’s specific natural interests, such as\neating or sleeping, for any extended period would be both detrimental\nand tragic.\n\n\nConsciousness essentially is only awareness, an attention to what is\ngiven, rather than being an instrument in reshaping the world.\nConsciousness, emerging late in the evolutionary pathway, is a\nflowering of happy circumstances that celebrates what is given, and\nwhen truly recognized, does only that. It is joyful, delighting in\nwhat is presented, and not troubled by where it leads or what it\nmeans.  This is not to restate Santayana’s view poetically but rather\nto convey that Santayana characterizes consciousness, itself, as\npoetic rather than as a means to an action or as a way of implementing\nan action.  The more dower, moralistic, and evangelical aspects of\nreligion he saw as confused efforts to make religion a science, a\nsocial club, or a political movement. Spirit, or consciousness, is\nmomentary, fleeting, and depends on the physical forces of our bodies\nand environment in order to exist. Shaping one’s life to enhance these\nspiritual, fleeting moments, extending them as long as is practical,\nis one of the delights of living for some people, but it is certainly\nnot a goal for all, nor should it be.\n", "bibliography": {"categories": ["Primary Sources", "Secondary Sources"], "cat_ref_text": {"Primary Sources": ["</h3>\n<h4>Complete Works</h4>\n<p><em>The Works of George Santayana</em>, Martin A. Coleman\n(Director and Editor), David Spiech (Textual Editor), Marianne\nS. Wokeck (Senior Editor), Herman J. Saatkamp, Jr. (Founding and\nConsulting Editor), Cambridge, MA and London: The MIT Press.\nThe volumes are as follows:</p>\n<ul class=\"hanging\">", "Volume I (1986), <em>Persons and Places: Fragments of\n Autobiography</em>, edited by William G. Holzberger and Herman\n J. Saatkamp, Jr., Introduction by Richard C. Lyon.", "Volume II (1988), <em>The Sense of Beauty: Being the Outlines of\n Aesthetic Theory</em>, edited by William G. Holzberger and Herman\n J. Saatkamp, Jr., Introduction by Arthur Danto.", "Volume III (1989), <em>Interpretations of Poetry and\n Religion</em>, edited by William G. Holzberger and Herman\n J. Saatkamp, Jr., Introduction by Joel Porte.", "Volume IV (1994), <em>The Last Puritan: A Memoir in the Form of\n a Novel</em>, edited by William G. Holzberger and Herman\n J. Saatkamp, Jr. Introduction by Irving Singer.", "Volume V (2001–2008), <em>The Letters of George Santayana</em>,\nedited by William G. Holzberger and Herman J. Saatkamp, Jr.\n\n   <ul class=\"hanging\">", "<em>Book One: [1868]–1909</em>, published 2001.", "<em>Book Two: 1910–1920</em>, published 2002.", "<em>Book Three: 1921–1927</em>, published 2002.", "<em>Book Four: 1928–1932</em>, published 2003.", "<em>Book Five: 1933–1936</em>, published 2003.", "<em>Book Six: 1937–1940</em>, published 2004.", "<em>Book Seven: 1941–1947</em>, published 2006.", "<em>Book Eight: 1948–1952</em>, published 2008.\n</ul>", "Volume VI (2011), <em>George Santayana’s Marginalia: A Critical\n Selection</em> , edited by John McCormick and Kris Walters\n Frost. Introduction by John McCormick.\n\n  <ul class=\"hanging\">", "<em>Book One: Abell–Lucretius</em>", "<em>Book Two: McCord–Zeller</em>\n</ul>", "Volume VII (2011–2016), <em>The Life of Reason</em>,\n edited by Marianne W. Wokeck and Martin A. Coleman. Introduction by\n James Gouinlock.\n \n  <ul class=\"hanging\">", "<em>Book One: Reason in Common Sense</em>, 2011", "<em>Book Two: Reason in Society</em>, 2013.", "<em>Book Three: Reason in Religion</em>, 2014.", "<em>Book Four: Reason in Art</em>, 2015.", "<em>Book Five: Reason in Science</em>, 2016.\n</ul>", "Volume VIII (2019), <em>Three Philosophical Poets: Lucretius,\nDante, and Goethe</em>, edited by Kellie Dawson and David\nSpiech. Introduction by James Seaton.\n</ul>\n<h4>Individual Works</h4>\n<ul class=\"hanging\">", "<em>Animal Faith and Spiritual Life: Previously Unpublished and\nUncollected Writings by George Santayana With Critical Essays on His\nThought</em>. Edited by John Lachs. New York: Appleton-Century-Crofts\n(1967).", "<em>Atoms of Thought: An Anthology of Thoughts From George\nSantayana</em>. Selected and edited, with an introduction, by Ira D.\nCardiff. New York: Philosophical Library (1950).", "<em>Character and Opinion in the United States: With Reminiscences\nof William James and Josiah Royce and Academic Life in America</em>.\nNew York: Charles Scribner’s Sons (1920).", "<em>The Birth of Reason and Other Essays by George Santayana</em>.\nEdited by Daniel Cory and with an Introduction by Herman J. Saatkamp,\nJr. New York: Columbia University Press (1995).", "<em>The Complete Poems of George Santayana: A Critical\nEdition</em>. Edited and with an introduction by William G. Holzberger.\nLewisburg: Bucknell University Press; London: Associated University\nPress (1979).", "<em>Dialogues in Limbo</em>. London: Constable and Co. (1925); New\nYork: Scribner’s (1926).", "<em>Dialogues in Limbo, With Three New Dialogues</em>. New York:\nScribner’s (1948).", "<em>Dominations and Powers: Reflections on Liberty, Society, and\nGovernment</em>. New York: Scribner’s; London: Constable (1951).", "<em>Egotism in German Philosophy</em>. New York: Scribner’s\n(1915).", "<em>Essays in Literary Criticism of George Santayana</em>. Selected\nand edited, with an introduction, by Irving Singer. New York:\nScribner’s (1956).", "<em>The Essential Santayana</em>. Edited by the Santayana Edition\nand compiled with an introduction by Martin A. Coleman, Bloomington:\nIndiana University Press (2009).", "<em>The Genteel Tradition at Bay</em>. New York: Scribner’s;\nLondon: “The Adelphi” (1931).", "<em>The Genteel Tradition: Nine Essays by George Santayana</em>. Edited by\nDouglas L. Wilson. Cambridge, MA: Harvard University Press (1967).", "<em>George Santayana’s America: Essays on Literature and\nCulture</em>. Collected and with an introduction by James Ballowe.\nUrbana: University of Illinois Press (1967).", "<em>A Hermit of Carmel, and Other Poems</em>. New York: Scribner’s\n(1901).", "<em>The Idea of Christ in the Gospels; or, God in Man: A Critical\nEssay</em>. New York: Scribner’s; Toronto: Saunders (1946).", "<em>The Idler and His Works, and Other Essays</em>. Edited and with\na preface by Daniel Cory. New York: Braziller (1957).", "<em>Interpretations of Poetry and Religion</em>. New York:\nScribner’s; London: A. and C. Black (1900).", "<em>The Last Puritan: A Memoir in the Form of a Novel</em>. London:\nConstable (1935); New York: Scribner’s (1936).", "<em>The Life of Reason: Or, The Phases of Human Progress</em>. New\nYork: Scribner’s; London: Constable. Introduction and <em>Reason in\nCommon Sense</em> (1905), <em>Reason in Society</em> (1905),\n<em>Reason in Religion</em> (1905), <em>Reason in Art</em> (1905), and\n<em>Reason in Science</em> (1906).", "<em>Little Essays, Drawn From the Writings of George Santayana by\nLogan Pearsall Smith, With the Collaboration of the Author</em>. New\nYork: Scribner’s; London: Constable (1920).", "<em>The Letters of George Santayana</em>. Edited by Daniel Cory.\nNew York: Scribner’s; London: Constable (1955).", "<em>Lotze’s System of Philosophy</em>. Edited, with an introduction\nand Lotze bibliography, by Paul Grimley Kuntz. Bloomington: Indiana\nUniversity Press (1971).", "<em>Lucifer: A Theological Tragedy</em>. Chicago and New York:\nHerbert S. Stone (1899).", "<em>The Middle Span</em>. New York: Scribner’s (1945); London:\nConstable (1947).", "<em>My Host the World</em>. New York: Scribner’s; London: Cresset\nPress (1953).", "<em>Obiter Scripta: Lectures, Essays and Reviews</em>. Edited by\nJustus Buchler and Benjamin Schwartz. New York: Scribner’s; London:\nConstable (1936).", "<em>Persons and Places: The Background of My Life</em>. New York:\nScribner’s; London: Constable (1944).", "<em>Philosophy of Santayana: Selections From the Works of George\nSantayana</em>. Edited, with an introductory essay, by Irwin Edman. New\nYork: Scribner’s (1936).", "<em>Physical Order and Moral Liberty: Previously Unpublished Essays\nof George Santayana</em>. Edited by John and Shirley Lachs. Nashville:\nVanderbilt University Press (1969).", "<em>Platonism and the Spiritual Life</em>. New York: Scribner’s;\nLondon: Constable (1927).", "<em>Poems: Selected by the Author and Revised</em>. New York:\nScribner’s; London: Constable (1923).", "<em>The Poet’s Testament: Poems and Two Plays</em>. New York:\nScribner’s (1953).", "<em>Realms of Being</em>. New York: Scribner’s; London: Constable.\n<em>The Realm of Essence: Book First</em> (1927), <em>The Realm of\nMatter: Book Second</em> (1930), <em>The Realm of Truth: Book\nThird</em> (1938, 1937), <em>The Realm of Spirit: Book Fourth</em>\n(1940).", "<em>Realms of Being</em>. One-volume edition, with a new\nintroduction by the author. New York: Scribner’s (1942).", "<em>Santayana on America: Essays, Notes, and Letters on American\nLife, Literature, and Philosophy</em>. Edited and with an introduction\nby Richard Colton Lyon (1968).", "<em>Scepticism and Animal Faith: Introduction to a System of\nPhilosophy</em>. New York: Scribner’s; London: Constable (1923).", "<em>Selected Critical Writings of George Santayana</em>. Edited by\nNorman Henfrey. 2 vols. Cambridge: Cambridge University Press\n(1968).", "<em>The Sense of Beauty: Being the Outlines of Aesthetic\nTheory</em>. New York: Scribner’s; London: A. and C. Black (1896).", "<em>Soliloquies in England and Later Soliloquies</em>. New York:\nScribner’s; London: Constable (1922).", "<em>Some Turns of Thought in Modern Philosophy: Five Essays</em>.\nNew York: Scribner’s; Cambridge: Cambridge University Press\n(1933).", "<em>Sonnets and Other Verses</em>. Cambridge and Chicago: Stone and\nKimball (1894).", "<em>Three Philosophical Poets: Lucretius, Dante, and Goethe</em>.\nCambridge, MA: Harvard University Press; London: Oxford University Press,\n(1910).", "<em>Winds of Doctrine: Studies in Contemporary Opinion</em>. New\nYork: Scribner’s; London: Dent (1913).\n</ul>\n<h4>Selected Translations</h4>\n<ul class=\"hanging\">", "<em>Filosofia del viaggio</em>, Giuseppe\nPatella, translator, Roma: UniversItalia, 2013.", "<em>Le sentiment de la beauté</em>, Anne Combarnous and\nFabienne Gaspari, translators, Pau: Université de Pau,\n2002.", "<em>Interpretaciones de poesía y religión</em>,\nCarmen García Trevijano and Susana Nuccetelli, translators,\nwith Introduction by Manuel Garrido, Madrid: Catedra, 1993\n(Oviedo: KRK, 2008).", "<em>Il senso della Bellezza</em>, Guiseppe Patella, translator,\nPalermo: Aesthetica Edizioni, 1997.", "<em>El Sentido de la belleza</em>, Carmen García Trevijano,\ntranslator, Madrid: Editorial Tecnos, 1999.", "<em>Personas y lugares: fragmentos de autobiografia</em>, Pedro\nGarcía Martín, translator, Madrid: Editorial Trotta,\n2002.", "<em>L’Ultimo Puritano: Una memoria biografica, in forma di\nromanzo</em>, Camillo Pellizzi, translator, Milano: Baldini Castoldi\nDalai, 2005.\n</ul>\n<h3 id=\"SecoSour\">"], "Secondary Sources": ["</h3>\n<ul class=\"hanging\">", "Abellán, José Luis, 1996. <em>George Santayana,\n1863–1956</em> [sic], Madrid: Del Orto.", "Alfonso, Ricardo Miguel, 2010. <em>La Estética de George\nSantayana</em>, Madrid: Editorial Verbum.", "Alonso Gamo, José María, 1966. <em>Un\nespañol en el mundo: Santayana; poesía y\npoética</em>, Madrid: Ediciones Cultura Hispánica.", "Arnett, Willard, 1955 [1984], <em>Santayana and the Sense of\nBeauty</em>, Bloomington: Indiana University Press; London:\nM. Paterson.", "–––, 1968. <em>George Santayana</em>, New York:\nWashington Square Press.", "Beltrán Llavador, José, 2002. <em>Celebrar el mundo:\nintroducción al pensar nómada de George\nSantayana</em>, Valencia: Universitat de Valencia.", "–––, 2009, <em>Un pensador en el\nlaberinto. Escritos sobre George Santayana</em>, Valencia: Alfons el\nMagnànim.", "Beltrán, José, Manuel Garrido, Sergio Sevilla (eds.),\n2011. <em>Santayana: Un Pensador Universal</em>, Valencia: Biblioteca Javier\nCoy d’Estudis Nord-Americans, Universitat de Valéncia.", "Bermúdez Vázquez, Manuel (ed.), 2013, <em>George\nSantayana: Un Español en el mundo</em>, Seville: Espuela de\nPlata.", "Bosco, Nynfa, 1987. <em>Invito al pensiero di George Santayana</em>,\nMilano: Mursia.", "Brodrick, Micheal, 2015. <em>The Ethics of Detachment in Santayana’s Philosophy</em>, New York: Palgrave Macmillan.", "Carter, David, 1992. <em>George Santayana</em>, New York and\nPhiladelphia: Chelsea House Publishers. (A children’s book in the\n“Hispanics of Achievement” series.)", "Cory, Daniel M., 1963. <em>Santayana: The Later Years, A Portrait with\nLetters</em>, New York: Braziller.", "Dawidoff, Robert, 1992. <em>The Genteel Tradition and the Sacred\nRage</em>, Chapel Hill: The University of North Carolina Press.", "Duron, Jacques, 1949. <em>La Pensée de George Santayana</em>:\nSantayana en Amérique, Paris: Nizet.", "Estébanez Estébanez, Cayetano, 2000. <em>La Obra\nLiteraria de George Santayana</em>, Valladolid: Secretariado de\nPublicaciones e Intercambio Editorial, Universidad de Valladolid.", "Fantini, Graziella, 2009. <em>Shattered Pictures of Places and\nCities in George Santayana’s Autobiography</em>. Valencia: Universitat\nde València.", "Flamm, Matthew Caleb and Krzysztof Piotr Skowronski,\n2000. <em>Under Any Sky: Contemporary Readings of George\nSantayana</em>, Newcastle: Cambridge Scholars Press.", "Flamm, Matthew Caleb, Giuseppe Patella, and Jennifer A. Rea\n(eds.), 2014. <em>George Santayana at 150: International\nInterpretations</em>, Lanham, MD: Lexington Books.", "García Martín, Pedro, 1989. <em>El sustrato abulense de\nJorge Santayana</em>, Avila: Institución “Gran Duque de\nAlba” de la Excma. Diputación Provincial de Avila.", "Grossman, Morris, 2014. <em>Art and Morality: Essays in the Spirit\nof George Santayana</em>, New York: Fordham University Press.", "Howgate, George W., 1938. <em>George Santayana</em>, Philadelphia:\nUniversity of Pennsylvania Press; London: Oxford University Press.", "Hughson, Lois, 1977. <em>Thresholds of Reality: George Santayana and\nModernist Poetics</em>, Port Washington, New York: Kennikat Press.", "Kirby-Smith, H. T., 1997. <em>A Philosophical Novelist: George\nSantayana and “The Last Puritan”</em>, Carbondale:\nSouthern Illinois University Press.", "Kremplewska, Katarzyna, 2019. <em>Life as Insinuation: George\nSantayana’s Hermeneutics of Finit Life and Human Self</em>,\nAlbany: State University of New York Press.", "Lachs, John, 1988. <em>George Santayana</em>, Boston: Twayne\nPublishers.", "–––, 2012. <em>Stoic Pragmatism</em>,\nBloomington: Indiana University Press.", "Lachs, John and Michael Hodges, 1999. <em>Thinking in the Ruins:\nWittgenstein and Santayana on Contingency</em>, Nashville: Vanderbilt\nUniversity Press.", "Levinson, Henry Samuel, 1992. <em>Santayana, Pragmatism, and the\nSpiritual Life</em>, Chapel Hill: University of North Carolina Press.", "Lind, Bruno, 1962. <em>Vagabond Scholar: A Venture Into the Privacy of\nGeorge Santayana</em>, New York: Bridgehead.", "Lovely, Edward William, 2012. <em>George Santayana’s Philosophy of\nReligion: His Roman Catholic Influences and\nPhenomenology</em>. Lanham, MD: Lexington Books.", "McCormick, John, 1987. <em>George Santayana: A Biography</em>, New\nYork: Alfred A. Knopf.", "Moreno, Daniel, 2007. <em>Santayana filósofo: La\nfilosofía como forma de vida</em>, Madrid: Editorial Trotta;\ntranslated as <em>Santayana the Philosopher: Philosophy as a Form of\nLife</em>, Charles Padrón (trans.), Lewisburg, PA: Bucknell\nUniversity Press, 2015.", "Padrón, Charles and Skowroñski, Krzysztof Piotr\n(eds.), 2018. <em>The Life of Reason in an Age of\nTerrorism</em>, Leiden, Boston: Brill &amp; Rodopi.", "Patella, Giuseppe, 2000. <em>Bellezza, arte e vita. L’estetica\nmediterranea di George Santayana</em>, Milano: Mimesis; translated as\n<em>Bellezza, Arte e Vita: La Estetica Mediterranea de George\nSantayana</em>, València: Universitat de València,\n2010.", "Price, Kenneth M. and Robert C. Leitz, 1991. <em>Critical Essays on\nGeorge Santayana</em>, Boston: G. K. Hall and Co.", "Savater, Fernando, 2012. <em>Acerca de Santayana</em>, Valencia:\nBiblioteca Javier Coy d’Estudis Nord-Americans, Universitat de\nValéncia.", "Schilpp, Paul Arthur (ed.), 1940. <em>The Philosophy of George Santayana</em>,\nEvanston, Illinois: Northwestern University Press.", "Shook, John, 1998. <em>Pragmatism: An Annotated Bibliography\n1898–1940</em>, Amsterdam: Rodopi.", "Singer, Beth, 1970. <em>The Rational Society</em>, Cleveland: Case\nWestern Reserve University Press.", "Singer, Irving, 1957. <em>Santayana’s Aesthetics: A Critical\nIntroduction</em>, Cambridge, MA: Harvard University Press.", "–––, 2000. <em>George Santayana, Literary Philosopher</em>,\nNew Haven: Yale University Press.", "Skowronski, Krzysztof Piotr, 2007. <em>Santayana and America. Values,\nLiberties, Responsibility</em>, Newcastle: Cambridge Scholars\nPublishing.", "<em>The Southern Journal of Philosophy: Special Issue on\nSantayana</em> (Summer 1972).", "Sprigge, Timothy, 1974 [1995]. <em>Santayana: An Examination of\nhis Philosophy</em>, London and Boston: Routledge &amp; Kegan\nPaul.", "Wahman, Jessica, 2015. <em>Narrative Naturalism: An Alternative\nFramework for Philosophy of Mind</em>, Lanham, MD: Lexington\nBooks.", "Woodward, Anthony, 1988. <em>Living in the Eternal</em>,\nNashville: Vanderbilt University Press.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<h4>Complete Works</h4>\n<p><em>The Works of George Santayana</em>, Martin A. Coleman\n(Director and Editor), David Spiech (Textual Editor), Marianne\nS. Wokeck (Senior Editor), Herman J. Saatkamp, Jr. (Founding and\nConsulting Editor), Cambridge, MA and London: The MIT Press.\nThe volumes are as follows:</p>\n<ul class=\"hanging\">\n<li>Volume I (1986), <em>Persons and Places: Fragments of\n  Autobiography</em>, edited by William G. Holzberger and Herman\n  J. Saatkamp, Jr., Introduction by Richard C. Lyon. </li>\n<li>Volume II (1988), <em>The Sense of Beauty: Being the Outlines of\n  Aesthetic Theory</em>, edited by William G. Holzberger and Herman\n  J. Saatkamp, Jr., Introduction by Arthur Danto.</li>\n<li>Volume III (1989), <em>Interpretations of Poetry and\n  Religion</em>, edited by William G. Holzberger and Herman\n  J. Saatkamp, Jr., Introduction by Joel Porte.</li>\n<li>Volume IV (1994), <em>The Last Puritan: A Memoir in the Form of\n  a Novel</em>, edited by William G. Holzberger and Herman\n  J. Saatkamp, Jr. Introduction by Irving Singer.</li>\n<li>Volume V (2001–2008), <em>The Letters of George Santayana</em>,\nedited by William G. Holzberger and Herman J. Saatkamp, Jr.\n\n     <ul class=\"hanging\">\n<li><em>Book One: [1868]–1909</em>, published 2001.</li>\n<li><em>Book Two: 1910–1920</em>, published 2002.</li>\n<li><em>Book Three: 1921–1927</em>, published 2002.</li>\n<li><em>Book Four: 1928–1932</em>, published 2003.</li>\n<li><em>Book Five: 1933–1936</em>, published 2003. </li>\n<li><em>Book Six: 1937–1940</em>, published 2004.</li>\n<li><em>Book Seven: 1941–1947</em>, published 2006.</li>\n<li><em>Book Eight: 1948–1952</em>, published 2008.</li>\n</ul></li>\n<li>Volume VI (2011), <em>George Santayana’s Marginalia: A Critical\n Selection</em> , edited by John McCormick and Kris Walters\n Frost. Introduction by John McCormick.\n\n    <ul class=\"hanging\">\n<li><em>Book One: Abell–Lucretius</em></li>\n<li><em>Book Two: McCord–Zeller</em></li>\n</ul></li>\n<li>Volume VII (2011–2016), <em>The Life of Reason</em>,\n  edited by Marianne W. Wokeck and Martin A. Coleman. Introduction by\n  James Gouinlock.\n  \n   <ul class=\"hanging\">\n<li><em>Book One: Reason in Common Sense</em>,  2011</li>\n<li><em>Book Two: Reason in Society</em>,  2013.</li>\n<li><em>Book Three: Reason in Religion</em>, 2014.</li>\n<li><em>Book Four: Reason in Art</em>, 2015.</li>\n<li><em>Book Five: Reason in Science</em>, 2016.</li>\n</ul></li>\n<li>Volume VIII (2019), <em>Three Philosophical Poets: Lucretius,\nDante, and Goethe</em>, edited by Kellie Dawson and David\nSpiech. Introduction by James Seaton.</li>\n</ul>\n<h4>Individual Works</h4>\n<ul class=\"hanging\">\n<li><em>Animal Faith and Spiritual Life: Previously Unpublished and\nUncollected Writings by George Santayana With Critical Essays on His\nThought</em>. Edited by John Lachs. New York: Appleton-Century-Crofts\n(1967).</li>\n<li><em>Atoms of Thought: An Anthology of Thoughts From George\nSantayana</em>. Selected and edited, with an introduction, by Ira D.\nCardiff. New York: Philosophical Library (1950).</li>\n<li><em>Character and Opinion in the United States: With Reminiscences\nof William James and Josiah Royce and Academic Life in America</em>.\nNew York: Charles Scribner’s Sons (1920).</li>\n<li><em>The Birth of Reason and Other Essays by George Santayana</em>.\nEdited by Daniel Cory and with an Introduction by Herman J. Saatkamp,\nJr. New York: Columbia University Press (1995).</li>\n<li><em>The Complete Poems of George Santayana: A Critical\nEdition</em>. Edited and with an introduction by William G. Holzberger.\nLewisburg: Bucknell University Press; London: Associated University\nPress (1979).</li>\n<li><em>Dialogues in Limbo</em>. London: Constable and Co. (1925); New\nYork: Scribner’s (1926).</li>\n<li><em>Dialogues in Limbo, With Three New Dialogues</em>. New York:\nScribner’s (1948).</li>\n<li><em>Dominations and Powers: Reflections on Liberty, Society, and\nGovernment</em>. New York: Scribner’s; London: Constable (1951).</li>\n<li><em>Egotism in German Philosophy</em>. New York: Scribner’s\n(1915).</li>\n<li><em>Essays in Literary Criticism of George Santayana</em>. Selected\nand edited, with an introduction, by Irving Singer. New York:\nScribner’s (1956).</li>\n<li><em>The Essential Santayana</em>. Edited by the Santayana Edition\nand compiled with an introduction by Martin A. Coleman, Bloomington:\nIndiana University Press (2009).</li>\n<li><em>The Genteel Tradition at Bay</em>. New York: Scribner’s;\nLondon: “The Adelphi” (1931).</li>\n<li><em>The Genteel Tradition: Nine Essays by George Santayana</em>. Edited by\nDouglas L. Wilson. Cambridge, MA: Harvard University Press (1967).</li>\n<li><em>George Santayana’s America: Essays on Literature and\nCulture</em>. Collected and with an introduction by James Ballowe.\nUrbana: University of Illinois Press (1967).</li>\n<li><em>A Hermit of Carmel, and Other Poems</em>. New York: Scribner’s\n(1901).</li>\n<li><em>The Idea of Christ in the Gospels; or, God in Man: A Critical\nEssay</em>. New York: Scribner’s; Toronto: Saunders (1946).</li>\n<li><em>The Idler and His Works, and Other Essays</em>. Edited and with\na preface by Daniel Cory. New York: Braziller (1957).</li>\n<li><em>Interpretations of Poetry and Religion</em>. New York:\nScribner’s; London: A. and C. Black (1900).</li>\n<li><em>The Last Puritan: A Memoir in the Form of a Novel</em>. London:\nConstable (1935); New York: Scribner’s (1936).</li>\n<li><em>The Life of Reason: Or, The Phases of Human Progress</em>. New\nYork: Scribner’s; London: Constable. Introduction and <em>Reason in\nCommon Sense</em> (1905), <em>Reason in Society</em> (1905),\n<em>Reason in Religion</em> (1905), <em>Reason in Art</em> (1905), and\n<em>Reason in Science</em> (1906).</li>\n<li><em>Little Essays, Drawn From the Writings of George Santayana by\nLogan Pearsall Smith, With the Collaboration of the Author</em>. New\nYork: Scribner’s; London: Constable (1920).</li>\n<li><em>The Letters of George Santayana</em>. Edited by Daniel Cory.\nNew York: Scribner’s; London: Constable (1955).</li>\n<li><em>Lotze’s System of Philosophy</em>. Edited, with an introduction\nand Lotze bibliography, by Paul Grimley Kuntz. Bloomington: Indiana\nUniversity Press (1971).</li>\n<li><em>Lucifer: A Theological Tragedy</em>. Chicago and New York:\nHerbert S. Stone (1899).</li>\n<li><em>The Middle Span</em>. New York: Scribner’s (1945); London:\nConstable (1947).</li>\n<li><em>My Host the World</em>. New York: Scribner’s; London: Cresset\nPress (1953).</li>\n<li><em>Obiter Scripta: Lectures, Essays and Reviews</em>. Edited by\nJustus Buchler and Benjamin Schwartz. New York: Scribner’s; London:\nConstable (1936).</li>\n<li><em>Persons and Places: The Background of My Life</em>. New York:\nScribner’s; London: Constable (1944).</li>\n<li><em>Philosophy of Santayana: Selections From the Works of George\nSantayana</em>. Edited, with an introductory essay, by Irwin Edman. New\nYork: Scribner’s (1936).</li>\n<li><em>Physical Order and Moral Liberty: Previously Unpublished Essays\nof George Santayana</em>. Edited by John and Shirley Lachs. Nashville:\nVanderbilt University Press (1969).</li>\n<li><em>Platonism and the Spiritual Life</em>. New York: Scribner’s;\nLondon: Constable (1927).</li>\n<li><em>Poems: Selected by the Author and Revised</em>. New York:\nScribner’s; London: Constable (1923).</li>\n<li><em>The Poet’s Testament: Poems and Two Plays</em>. New York:\nScribner’s (1953).</li>\n<li><em>Realms of Being</em>. New York: Scribner’s; London: Constable.\n<em>The Realm of Essence: Book First</em> (1927), <em>The Realm of\nMatter: Book Second</em> (1930), <em>The Realm of Truth: Book\nThird</em> (1938, 1937), <em>The Realm of Spirit: Book Fourth</em>\n(1940).</li>\n<li><em>Realms of Being</em>. One-volume edition, with a new\nintroduction by the author. New York: Scribner’s (1942).</li>\n<li><em>Santayana on America: Essays, Notes, and Letters on American\nLife, Literature, and Philosophy</em>. Edited and with an introduction\nby Richard Colton Lyon (1968).</li>\n<li><em>Scepticism and Animal Faith: Introduction to a System of\nPhilosophy</em>. New York: Scribner’s; London: Constable (1923).</li>\n<li><em>Selected Critical Writings of George Santayana</em>. Edited by\nNorman Henfrey. 2 vols. Cambridge: Cambridge University Press\n(1968).</li>\n<li><em>The Sense of Beauty: Being the Outlines of Aesthetic\nTheory</em>. New York: Scribner’s; London: A. and C. Black (1896).</li>\n<li><em>Soliloquies in England and Later Soliloquies</em>. New York:\nScribner’s; London: Constable (1922).</li>\n<li><em>Some Turns of Thought in Modern Philosophy: Five Essays</em>.\nNew York: Scribner’s; Cambridge: Cambridge University Press\n(1933).</li>\n<li><em>Sonnets and Other Verses</em>. Cambridge and Chicago: Stone and\nKimball (1894).</li>\n<li><em>Three Philosophical Poets: Lucretius, Dante, and Goethe</em>.\nCambridge, MA: Harvard University Press; London: Oxford University Press,\n(1910).</li>\n<li><em>Winds of Doctrine: Studies in Contemporary Opinion</em>. New\nYork: Scribner’s; London: Dent (1913).</li>\n</ul>\n<h4>Selected Translations</h4>\n<ul class=\"hanging\">\n<li><em>Filosofia del viaggio</em>,  Giuseppe\nPatella, translator,  Roma: UniversItalia, 2013.</li>\n<li><em>Le sentiment de la beauté</em>, Anne Combarnous and\nFabienne Gaspari, translators, Pau: Université de Pau,\n2002.</li>\n<li><em>Interpretaciones de poesía y religión</em>,\nCarmen García Trevijano and Susana Nuccetelli, translators,\nwith Introduction by Manuel Garrido, Madrid: Catedra, 1993\n(Oviedo: KRK, 2008).</li>\n<li><em>Il senso della Bellezza</em>, Guiseppe Patella, translator,\nPalermo: Aesthetica Edizioni, 1997.</li>\n<li><em>El Sentido de la belleza</em>, Carmen García Trevijano,\ntranslator, Madrid: Editorial Tecnos, 1999.</li>\n<li><em>Personas y lugares: fragmentos de autobiografia</em>, Pedro\nGarcía Martín, translator, Madrid: Editorial Trotta,\n2002.</li>\n<li><em>L’Ultimo Puritano: Una memoria biografica, in forma di\nromanzo</em>, Camillo Pellizzi, translator, Milano: Baldini Castoldi\nDalai, 2005.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Abellán, José Luis, 1996. <em>George Santayana,\n1863–1956</em> [sic], Madrid: Del Orto.</li>\n<li>Alfonso, Ricardo Miguel, 2010. <em>La Estética de George\nSantayana</em>, Madrid: Editorial Verbum.</li>\n<li>Alonso Gamo, José María, 1966.  <em>Un\nespañol en el mundo: Santayana; poesía y\npoética</em>, Madrid: Ediciones Cultura Hispánica.</li>\n<li>Arnett, Willard, 1955 [1984], <em>Santayana and the Sense of\nBeauty</em>, Bloomington: Indiana University Press; London:\nM. Paterson.</li>\n<li>–––, 1968. <em>George Santayana</em>, New York:\nWashington Square Press.</li>\n<li>Beltrán Llavador, José, 2002. <em>Celebrar el mundo:\nintroducción al pensar nómada de George\nSantayana</em>, Valencia: Universitat de Valencia.</li>\n<li>–––, 2009,  <em>Un pensador en el\nlaberinto. Escritos sobre George Santayana</em>, Valencia: Alfons el\nMagnànim.</li>\n<li>Beltrán, José, Manuel Garrido, Sergio Sevilla (eds.),\n2011. <em>Santayana: Un Pensador Universal</em>, Valencia: Biblioteca Javier\nCoy d’Estudis Nord-Americans, Universitat de Valéncia.</li>\n<li>Bermúdez Vázquez, Manuel (ed.), 2013, <em>George\nSantayana: Un Español en el mundo</em>, Seville: Espuela de\nPlata.</li>\n<li>Bosco, Nynfa, 1987. <em>Invito al pensiero di George Santayana</em>,\nMilano: Mursia.</li>\n<li>Brodrick, Micheal, 2015. <em>The Ethics of Detachment in Santayana’s Philosophy</em>, New York: Palgrave Macmillan.</li>\n<li>Carter, David, 1992. <em>George Santayana</em>, New York and\nPhiladelphia: Chelsea House Publishers. (A children’s book in the\n“Hispanics of Achievement” series.)</li>\n<li>Cory, Daniel M., 1963. <em>Santayana: The Later Years, A Portrait with\nLetters</em>, New York: Braziller.</li>\n<li>Dawidoff, Robert, 1992. <em>The Genteel Tradition and the Sacred\nRage</em>, Chapel Hill: The University of North Carolina Press.</li>\n<li>Duron, Jacques, 1949. <em>La Pensée de George Santayana</em>:\nSantayana en Amérique,  Paris: Nizet.</li>\n<li>Estébanez Estébanez, Cayetano, 2000. <em>La Obra\nLiteraria de George Santayana</em>, Valladolid: Secretariado de\nPublicaciones e Intercambio Editorial, Universidad de Valladolid.</li>\n<li>Fantini, Graziella, 2009. <em>Shattered Pictures of Places and\nCities in George Santayana’s Autobiography</em>. Valencia: Universitat\nde València.</li>\n<li>Flamm, Matthew Caleb and Krzysztof Piotr Skowronski,\n2000. <em>Under Any Sky: Contemporary Readings of George\nSantayana</em>, Newcastle: Cambridge Scholars Press.</li>\n<li>Flamm, Matthew Caleb, Giuseppe Patella, and Jennifer A. Rea\n(eds.), 2014. <em>George Santayana at 150: International\nInterpretations</em>, Lanham, MD: Lexington Books.</li>\n<li>García Martín, Pedro, 1989. <em>El sustrato abulense de\nJorge Santayana</em>, Avila: Institución “Gran Duque de\nAlba” de la Excma. Diputación Provincial de Avila.</li>\n<li>Grossman, Morris, 2014. <em>Art and Morality: Essays in the Spirit\nof George Santayana</em>, New York: Fordham University Press.</li>\n<li>Howgate, George W., 1938. <em>George Santayana</em>, Philadelphia:\nUniversity of Pennsylvania Press; London: Oxford University Press.</li>\n<li>Hughson, Lois, 1977. <em>Thresholds of Reality: George Santayana and\nModernist Poetics</em>, Port Washington, New York: Kennikat Press.</li>\n<li>Kirby-Smith, H. T., 1997. <em>A Philosophical Novelist: George\nSantayana and “The Last Puritan”</em>, Carbondale:\nSouthern Illinois University Press.</li>\n<li>Kremplewska, Katarzyna, 2019. <em>Life as Insinuation: George\nSantayana’s Hermeneutics of Finit Life and Human Self</em>,\nAlbany: State University of New York Press.</li>\n<li>Lachs, John, 1988. <em>George Santayana</em>, Boston: Twayne\nPublishers.</li>\n<li>–––, 2012. <em>Stoic Pragmatism</em>,\nBloomington: Indiana University Press.</li>\n<li>Lachs, John and Michael Hodges, 1999. <em>Thinking in the Ruins:\nWittgenstein and Santayana on Contingency</em>, Nashville: Vanderbilt\nUniversity Press.</li>\n<li>Levinson, Henry Samuel, 1992. <em>Santayana, Pragmatism, and the\nSpiritual Life</em>, Chapel Hill: University of North Carolina Press.</li>\n<li>Lind, Bruno, 1962. <em>Vagabond Scholar: A Venture Into the Privacy of\nGeorge Santayana</em>, New York: Bridgehead.</li>\n<li>Lovely, Edward William, 2012. <em>George Santayana’s Philosophy of\nReligion: His Roman Catholic Influences and\nPhenomenology</em>. Lanham, MD: Lexington Books.</li>\n<li>McCormick, John, 1987. <em>George Santayana: A Biography</em>, New\nYork: Alfred A. Knopf.</li>\n<li>Moreno, Daniel, 2007. <em>Santayana filósofo: La\nfilosofía como forma de vida</em>, Madrid: Editorial Trotta;\ntranslated as <em>Santayana the Philosopher: Philosophy as a Form of\nLife</em>, Charles Padrón (trans.), Lewisburg, PA: Bucknell\nUniversity Press, 2015.</li>\n<li>Padrón, Charles and Skowroñski, Krzysztof Piotr\n(eds.), 2018. <em>The Life of Reason in an Age of\nTerrorism</em>, Leiden, Boston: Brill &amp; Rodopi.</li>\n<li>Patella, Giuseppe, 2000. <em>Bellezza, arte e vita. L’estetica\nmediterranea di George Santayana</em>, Milano: Mimesis; translated as\n<em>Bellezza, Arte e Vita: La Estetica Mediterranea de George\nSantayana</em>, València: Universitat de València,\n2010.</li>\n<li>Price, Kenneth M. and Robert C. Leitz, 1991. <em>Critical Essays on\nGeorge Santayana</em>, Boston: G. K. Hall and Co.</li>\n<li>Savater, Fernando, 2012. <em>Acerca de Santayana</em>, Valencia:\nBiblioteca Javier Coy d’Estudis Nord-Americans, Universitat de\nValéncia.</li>\n<li>Schilpp, Paul Arthur (ed.), 1940. <em>The Philosophy of George Santayana</em>,\nEvanston, Illinois: Northwestern University Press.</li>\n<li>Shook, John, 1998. <em>Pragmatism: An Annotated Bibliography\n1898–1940</em>, Amsterdam: Rodopi.</li>\n<li>Singer, Beth, 1970. <em>The Rational Society</em>, Cleveland: Case\nWestern Reserve University Press.</li>\n<li>Singer, Irving, 1957. <em>Santayana’s Aesthetics: A Critical\nIntroduction</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2000. <em>George Santayana, Literary Philosopher</em>,\nNew Haven: Yale University Press.</li>\n<li>Skowronski, Krzysztof Piotr, 2007. <em>Santayana and America. Values,\nLiberties, Responsibility</em>, Newcastle: Cambridge Scholars\nPublishing.</li>\n<li><em>The Southern Journal of Philosophy: Special Issue on\nSantayana</em> (Summer 1972).</li>\n<li>Sprigge, Timothy, 1974 [1995]. <em>Santayana: An Examination of\nhis Philosophy</em>, London and Boston: Routledge &amp; Kegan\nPaul.</li>\n<li>Wahman, Jessica, 2015. <em>Narrative Naturalism: An Alternative\nFramework for Philosophy of Mind</em>, Lanham, MD: Lexington\nBooks.</li>\n<li>Woodward, Anthony, 1988. <em>Living in the Eternal</em>,\nNashville: Vanderbilt University Press.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Dewey, John", "epiphenomenalism", "James, William", "Peirce, Charles Sanders"], "entry_link": [{"../dewey/": "Dewey, John"}, {"../epiphenomenalism/": "epiphenomenalism"}, {"../james/": "James, William"}, {"../peirce/": "Peirce, Charles Sanders"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=santayana\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/santayana/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=santayana&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"http://philpapers.org/sep/santayana/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=santayana": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/santayana/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=santayana&redirect=True": "Look up topics and thinkers related to this entry"}, {"http://philpapers.org/sep/santayana/": "Enhanced bibliography for this entry"}, {"http://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"http://santayana.iupui.edu/\" target=\"other\">Web pages of the Santayana Edition</a>\n (Indiana University/Purdue University)", "<a href=\"http://www.iupui.edu/~santedit/sant/santayana-society/bulletin/\" target=\"other\"><em>Overheard in Seville</em></a>, \n  Bulletin of the Santayana Society,\n Indianapolis: Indiana University–Purdue University Indianapolis.", "<a href=\"http://www.iupui.edu/~santedit/sant/resources-links/bibliographies/\" target=\"other\">The Santayana Edition Annotated Bibliography</a>."], "listed_links": [{"http://santayana.iupui.edu/": "Web pages of the Santayana Edition"}, {"http://www.iupui.edu/~santedit/sant/santayana-society/bulletin/": "Overheard in Seville"}, {"http://www.iupui.edu/~santedit/sant/resources-links/bibliographies/": "The Santayana Edition Annotated Bibliography"}]}, "tokenized_text": ["1", "biography", "santayana", "heritage", "rooted", "spanish", "diplomatic", "society", "stress", "high", "education", "familiarity", "world", "community", "born", "madrid", "spain", "16", "december", "1863", "father", "agustín", "santayana", "born", "1812", "father", "studied", "law", "practiced", "short", "time", "entering", "colonial", "service", "posting", "philippine", "studying", "law", "agustín", "served", "apprenticeship", "professional", "painter", "school", "goya", "number", "painting", "remain", "private", "possession", "family", "translated", "four", "senecan", "tragedy", "spanish", "wrote", "unpublished", "book", "island", "mindanao", "extensive", "library", "made", "three", "trip", "around", "world", "1845", "became", "governor", "batang", "small", "island", "philippine", "took", "governorship", "recently", "deceased", "josé", "borrás", "bofarull", "father", "josefina", "borrás", "later", "become", "agustín", "wife", "1861", "mother", "george", "santayana", "mother", "josefina", "sturgis", "formerly", "josefina", "borrás", "carbonell", "born", "scotland", "daughter", "spanish", "diplomat", "previously", "married", "george", "sturgis", "d", "1857", "boston", "merchant", "whose", "early", "death", "left", "alone", "child", "manila", "five", "child", "first", "marriage", "three", "survived", "infancy", "promised", "first", "husband", "raise", "child", "boston", "moved", "family", "holiday", "spain", "josefina", "met", "agustín", "married", "1861", "fifty", "year", "age", "probably", "thirtyfive", "1863", "santayana", "christened", "jorge", "agustín", "nicolás", "ruiz", "de", "santayana", "borrás", "half", "sister", "susan", "insisted", "called", "george", "boston", "father", "santayana", "turn", "always", "referred", "sister", "spanish", "susana", "18631886", "santayana", "lived", "eight", "year", "spain", "forty", "year", "boston", "forty", "year", "europe", "autobiography", "person", "place", "santayana", "divide", "life", "three", "phase", "background", "18631886", "encompasses", "childhood", "spain", "undergraduate", "year", "harvard", "second", "period", "18861912", "harvard", "graduate", "student", "professor", "transatlantic", "penchant", "traveling", "europe", "third", "period", "19121952", "retired", "professor", "writing", "traveling", "europe", "eventually", "establishing", "rome", "home", "family", "moved", "madrid", "ávila", "santayana", "spent", "boyhood", "1869", "santayana", "mother", "left", "spain", "order", "raise", "sturgis", "child", "boston", "keeping", "pledge", "first", "husband", "1872", "father", "realized", "opportunity", "son", "better", "boston", "moved", "son", "finding", "boston", "inhospitable", "puritanical", "cold", "father", "returned", "alone", "ávila", "within", "month", "separation", "father", "mother", "permanent", "1888", "agustín", "wrote", "josefina", "married", "felt", "written", "reunited", "yielding", "force", "destiny", "strange", "marriage", "say", "fact", "love", "much", "cared", "yet", "live", "together", "person", "place", "9", "father", "death", "1893", "santayana", "regularly", "corresponded", "father", "visited", "santayana", "first", "year", "harvard", "college", "boston", "santayana", "family", "spoke", "spanish", "home", "santayana", "first", "attended", "mrs", "welchman", "kindergarten", "learn", "english", "younger", "child", "student", "boston", "latin", "school", "completed", "ba", "phd", "harvard", "college", "18821889", "including", "eighteen", "month", "study", "germany", "walker", "fellowship", "undergraduate", "year", "harvard", "reveal", "energetic", "student", "active", "social", "life", "member", "eleven", "organization", "including", "lampoon", "largely", "cartoonist", "harvard", "monthly", "founding", "member", "philosophical", "club", "president", "hasty", "pudding", "scholar", "conclude", "santayana", "active", "homosexual", "based", "allusion", "santayana", "early", "poetry", "mccormick", "4952", "santayana", "association", "known", "homosexual", "bisexual", "friend", "santayana", "provides", "clear", "indication", "sexual", "preference", "never", "married", "attraction", "woman", "men", "seems", "apparent", "undergraduate", "graduate", "correspondence", "one", "documented", "comment", "homosexuality", "occurs", "sixtyfive", "discussion", "a", "e", "housman", "poetry", "homosexuality", "santayana", "remarked", "think", "must", "way", "harvard", "day", "although", "unconscious", "time", "cory", "santayana", "later", "year", "40", "santayana", "wellknown", "frankness", "many", "scholar", "consider", "santayana", "latent", "homosexual", "based", "evidence", "18861912", "santayana", "received", "phd", "harvard", "1889", "became", "faculty", "member", "harvard", "university", "18891912", "eventually", "central", "figure", "era", "called", "classical", "american", "philosophy", "highly", "respected", "popular", "teacher", "student", "included", "poet", "conrad", "aiken", "t", "s", "eliot", "robert", "frost", "wallace", "stevens", "journalist", "writer", "walter", "lippmann", "max", "eastman", "van", "wyck", "brook", "professor", "samuel", "eliot", "morison", "harry", "austryn", "wolfson", "supreme", "court", "justice", "felix", "frankfurter", "many", "diplomat", "including", "friend", "bronson", "cutting", "university", "president", "james", "b", "conant", "retired", "harvard", "1912", "age", "fortyeight", "lived", "remainder", "life", "england", "europe", "never", "returning", "us", "rejecting", "academic", "post", "offered", "number", "university", "including", "harvard", "columbia", "cambridge", "santayana", "cherished", "academic", "life", "freedom", "pursue", "intellectual", "interest", "curiosity", "found", "many", "aspect", "professor", "infringed", "freedom", "faculty", "meeting", "university", "committee", "seemed", "primarily", "partisan", "heat", "false", "issue", "rarely", "attended", "general", "corporate", "businesslike", "adaptation", "university", "increasingly", "le", "conducive", "intellectual", "development", "growth", "expressed", "concern", "evolving", "harvard", "goal", "producing", "muscular", "intellectual", "lead", "america", "statesman", "business", "government", "delight", "celebration", "also", "central", "aspect", "education", "wrote", "friend", "1892", "expressing", "hope", "academic", "life", "would", "resolutely", "unconventional", "noted", "could", "professor", "per", "accidens", "saying", "would", "rather", "beg", "one", "essentially", "g", "h", "w", "abbot", "stoughton", "hall", "harvard", "15", "february", "1892", "columbia", "1893", "santayana", "experienced", "metanoia", "change", "heart", "gradually", "altered", "style", "life", "active", "student", "turned", "professor", "one", "focused", "imaginative", "celebration", "life", "began", "planning", "early", "retirement", "finding", "university", "life", "increasingly", "le", "conducive", "intellectual", "pursuit", "delight", "living", "three", "event", "preceded", "metanoia", "unexpected", "death", "young", "student", "witnessing", "father", "death", "marriage", "sister", "susana", "santayana", "reflection", "event", "led", "ancient", "wisdom", "acceptance", "tragic", "lead", "lyrical", "release", "cultivate", "imagination", "love", "give", "endless", "form", "let", "deceive", "enjoy", "world", "travel", "learn", "way", "let", "hold", "posse", "thing", "person", "idea", "pure", "good", "got", "posse", "physically", "legally", "burden", "snare", "person", "place", "42728", "increasingly", "naturalism", "lyrical", "cry", "human", "imagination", "became", "focal", "point", "santayana", "life", "thought", "pragmatism", "developed", "peirce", "james", "undercurrent", "naturalism", "particularly", "approach", "ascertain", "knowledge", "aspect", "naturalism", "aligned", "european", "greek", "thought", "presage", "development", "late", "twentieth", "century", "naturalism", "historical", "root", "primarily", "aristotle", "spinoza", "contemporary", "background", "james", "pragmatism", "royce", "idealism", "focus", "celebration", "creative", "imagination", "human", "endeavor", "particularly", "art", "philosophy", "religion", "literature", "science", "one", "santayana", "major", "contribution", "american", "thought", "focus", "along", "spanish", "heritage", "catholic", "upbringing", "european", "suspicion", "american", "industry", "set", "apart", "harvard", "yard", "santayana", "strong", "interest", "literature", "aesthetic", "evident", "throughout", "early", "period", "1904", "attention", "turned", "almost", "fully", "philosophical", "pursuit", "period", "publication", "include", "lotze", "system", "philosophy", "dissertation", "sonnet", "verse", "1894", "sense", "beauty", "1896", "lucifer", "theological", "tragedy", "1899", "interpretation", "poetry", "religion", "1900", "hermit", "carmel", "poem", "1901", "life", "reason", "five", "book", "19051906", "three", "philosophical", "poet", "lucretius", "dante", "goethe", "1910", "may", "1911", "santayana", "formally", "announced", "longplanned", "retirement", "harvard", "president", "lowell", "asked", "reconsider", "santayana", "highly", "recognized", "philosopher", "cultural", "critic", "poet", "teacher", "desire", "free", "academic", "confinement", "also", "well", "known", "lowell", "indicated", "open", "arrangement", "provided", "santayana", "time", "desired", "writing", "travel", "europe", "initially", "santayana", "agreed", "alternate", "year", "europe", "us", "1912", "resolve", "retire", "overtook", "sense", "obligation", "harvard", "year", "retirement", "presented", "least", "six", "lecture", "variety", "university", "including", "berkeley", "wisconsin", "columbia", "williams", "book", "selling", "well", "publisher", "asking", "two", "major", "university", "courting", "fortyeight", "left", "harvard", "become", "fulltime", "writer", "escape", "academic", "professionalism", "nurtured", "university", "overgrown", "thistle", "trivial", "narrow", "scholarship", "19121952", "santayana", "sailed", "europe", "mother", "died", "apparently", "alzheimer", "disease", "always", "attentive", "family", "santayana", "visited", "weekly", "daily", "last", "year", "harvard", "knowing", "mother", "death", "imminent", "arranged", "josephine", "half", "sister", "live", "spain", "susana", "previously", "married", "welltodo", "ávilan", "inheritance", "10000", "mother", "coupled", "steady", "income", "publication", "early", "planning", "made", "retirement", "easier", "arranged", "half", "brother", "robert", "manage", "finance", "agreement", "upon", "santayana", "death", "robert", "heir", "would", "receive", "bulk", "santayana", "estate", "hence", "january", "1912", "age", "fortyeight", "santayana", "free", "constraint", "university", "regimen", "expectation", "importantly", "free", "write", "travel", "choose", "residence", "country", "santayana", "book", "publication", "leaving", "harvard", "remarkable", "wind", "doctrine", "1913", "egotism", "german", "philosophy", "1915", "character", "opinion", "united", "state", "1920", "soliloquy", "england", "later", "soliloquy", "1922", "scepticism", "animal", "faith", "1923", "dialogue", "limbo", "1926", "platonism", "spiritual", "life", "1927", "four", "book", "realm", "1927", "1930", "1938", "1940", "genteel", "tradition", "bay", "1931", "turn", "thought", "modern", "philosophy", "1933", "last", "puritan", "1935", "person", "place", "1944", "middle", "span", "1945", "idea", "christ", "gospel", "1946", "domination", "power", "1951", "host", "world", "1953", "posthumous", "harvard", "attempted", "bring", "back", "united", "state", "offering", "several", "professorship", "beginning", "1917", "late", "1929", "offered", "norton", "chair", "poetry", "one", "harvard", "respected", "chair", "1931", "received", "invitation", "brown", "university", "harvard", "later", "asked", "accept", "william", "james", "lecturer", "philosophy", "newly", "established", "honorary", "post", "santayana", "never", "returned", "harvard", "america", "believing", "academic", "life", "place", "cultivate", "intellectual", "achievement", "scholarly", "work", "santayana", "also", "refused", "academic", "appointment", "oxford", "university", "cambridge", "university", "first", "santayana", "planned", "reside", "europe", "numerous", "exploratory", "trip", "several", "city", "decided", "paris", "however", "england", "world", "war", "broke", "unable", "return", "mainland", "first", "lived", "london", "primarily", "oxford", "cambridge", "war", "traveling", "scholar", "principal", "locale", "included", "paris", "madrid", "ávila", "riviera", "florence", "rome", "late", "1920s", "settled", "principally", "rome", "summer", "often", "retreated", "cortina", "ampezzo", "northern", "italy", "write", "escape", "heat", "success", "writer", "assisted", "friend", "scholar", "found", "need", "financial", "support", "example", "bertrand", "russell", "unable", "find", "teaching", "post", "us", "england", "view", "regarding", "pacifism", "marriage", "santayana", "displayed", "characteristic", "generosity", "plan", "make", "anonymous", "gift", "bertrand", "russell", "25000", "royalty", "earnings", "last", "puritan", "rate", "5000", "per", "year", "letter", "george", "sturgis", "15", "july", "1937", "despite", "fact", "russell", "disagreed", "radically", "politically", "philosophically", "memory", "earlier", "friendship", "regard", "russell", "genius", "moved", "compassion", "russell", "financial", "plight", "rise", "mussolini", "1930s", "initially", "seemed", "positive", "santayana", "viewed", "italian", "civil", "society", "chaotic", "thought", "mussolini", "might", "bring", "order", "needed", "santayana", "soon", "noted", "rise", "tyrant", "trying", "leave", "italy", "train", "switzerland", "permitted", "cross", "border", "proper", "paper", "fund", "coming", "united", "state", "england", "case", "complicated", "spanish", "citizenship", "age", "returned", "rome", "14", "october", "1941", "entered", "clinica", "della", "piccola", "compagna", "di", "maria", "hospitalclinic", "run", "catholic", "order", "nun", "lived", "death", "eleven", "year", "later", "arrangement", "unusual", "hospital", "periodically", "received", "distinguished", "guest", "cared", "assistedliving", "environment", "santayana", "died", "cancer", "26", "september", "1952", "santayana", "asked", "buried", "unconsecrated", "ground", "affirming", "naturalism", "end", "however", "cemetery", "ground", "rome", "reserved", "criminal", "spanish", "consulate", "rome", "would", "permit", "santayana", "buried", "place", "provided", "panteon", "de", "la", "obra", "pia", "espanola", "campo", "verano", "cemetery", "suitable", "burial", "ground", "turning", "memorial", "lifelong", "spanish", "citizen", "graveside", "daniel", "cory", "read", "line", "santayana", "poet", "testament", "poem", "affirming", "naturalistic", "outlook", "give", "back", "earth", "earth", "gave", "furrow", "nothing", "grave", "candle", "spirit", "vigil", "spent", "sight", "may", "follow", "vision", "went", "united", "state", "wallace", "stevens", "commemorated", "teacher", "old", "philosopher", "rome", "total", "grandeur", "total", "edifice", "chosen", "inquisitor", "structure", "stop", "upon", "threshold", "design", "word", "take", "form", "frame", "thinking", "realized", "2", "philosophy", "literature", "culture", "throughout", "life", "santayana", "literary", "achievement", "evident", "eightyearold", "spaniard", "wrote", "un", "matrimonio", "married", "couple", "describing", "trip", "newly", "married", "couple", "meet", "queen", "spain", "later", "boston", "wrote", "poetic", "parody", "aeneid", "short", "history", "class", "82", "line", "leaving", "bedford", "st", "schoolhouse", "first", "book", "sonnet", "verse", "1894", "book", "poem", "philosophy", "turn", "century", "much", "intellectual", "life", "directed", "writing", "verse", "drama", "principal", "figure", "making", "modernism", "possible", "modernist", "poetry", "literature", "naturalism", "emphasis", "constructive", "imagination", "influenced", "t", "s", "eliot", "wallace", "stevens", "eliot", "notion", "objective", "correlative", "drawn", "santayana", "stevens", "follows", "santayana", "refined", "naturalism", "incorporating", "platonism", "christianity", "without", "nostalgia", "god", "dogma", "santayana", "among", "leader", "transforming", "american", "literary", "canon", "dislodging", "dominant", "longfellow", "lowell", "whittier", "holmes", "bryant", "canon", "santayana", "essay", "genteel", "tradition", "american", "philosophy", "presented", "philosophical", "union", "university", "california", "1911", "greatly", "affected", "van", "wyck", "brook", "america", "comingofage", "book", "set", "tone", "modernism", "brook", "drew", "santayana", "essay", "adapting", "santayana", "idea", "two", "america", "fit", "notion", "america", "split", "highbrow", "lowbrow", "culture", "turn", "century", "santayana", "interest", "largely", "centered", "philosophical", "inquiry", "although", "never", "abandoned", "writing", "poetry", "longer", "considered", "central", "work", "even", "moving", "poetry", "came", "later", "inspired", "trench", "warfare", "casualty", "world", "war", "premonition", "cambridge", "october", "1913", "undergraduate", "killed", "battle", "oxford", "1915", "sonnet", "oxford", "1916", "darkest", "hour", "oxford", "1917", "throughout", "life", "even", "near", "death", "recited", "translated", "long", "fragment", "horace", "racine", "leopardi", "others", "relationship", "literature", "art", "religion", "philosophy", "prominent", "theme", "throughout", "santayana", "writing", "sense", "beauty", "1896", "primary", "source", "study", "aesthetic", "philip", "blair", "rice", "wrote", "foreword", "1955", "modern", "library", "edition", "say", "aesthetic", "theory", "america", "reached", "maturity", "sense", "beauty", "way", "overstatement", "john", "dewey", "art", "experience", "competed", "esteem", "philosophical", "student", "aesthetic", "approached", "suggestiveness", "artist", "critic", "public", "take", "thoughtful", "interest", "arts", "santayana", "groundbreaking", "approach", "aesthetic", "emphasized", "arthur", "danto", "introduction", "1988", "critical", "edition", "danto", "writes", "santayana", "brings", "beauty", "earth", "treating", "subject", "science", "giving", "central", "role", "human", "conduct", "contrast", "preceding", "intellectualist", "tradition", "aesthetic", "exaltation", "emotion", "naturalization", "beauty", "especially", "beauty", "imply", "revolutionary", "impulse", "book", "take", "certain", "violent", "act", "historical", "imagination", "recover", "sense", "beauty", "xxviii", "naturalistic", "approach", "aesthetic", "expanded", "philosophical", "explication", "art", "found", "life", "reason", "reason", "art", "1905", "1900", "santayana", "interpretation", "poetry", "religion", "develops", "view", "religion", "poetry", "expressive", "celebration", "life", "right", "great", "value", "either", "mistaken", "science", "art", "life", "lost", "along", "beauty", "poetry", "religion", "science", "provides", "explanation", "natural", "phenomenon", "poetry", "religion", "festive", "celebration", "human", "life", "born", "consciousness", "generated", "interaction", "one", "psyche", "natural", "structure", "heritable", "trait", "one", "physical", "body", "physical", "environment", "expression", "human", "value", "poetry", "religion", "identical", "origin", "understanding", "naturalistic", "base", "poetry", "religion", "valuing", "expressive", "character", "enable", "one", "appreciate", "without", "hoodwinked", "poetry", "loses", "frivolity", "cease", "demoralise", "religion", "surrender", "illusion", "cease", "deceive", "172", "interestingly", "father", "expressed", "similar", "view", "letter", "son", "providing", "genesis", "son", "reflection", "conclusion", "expressed", "late", "1946", "publication", "idea", "christ", "gospel", "santayana", "present", "idea", "christ", "poetic", "imaginative", "contrasted", "attempt", "historical", "factual", "account", "christ", "figure", "impact", "santayana", "view", "significant", "henry", "james", "reading", "interpretation", "poetry", "religion", "wrote", "would", "crawl", "across", "london", "need", "meet", "santayana", "three", "philosophical", "poet", "1910", "first", "volume", "harvard", "study", "comparative", "literature", "santayana", "employ", "naturalistic", "account", "poetry", "philosophy", "attempting", "combine", "comparative", "structure", "embedded", "parochial", "assumption", "possible", "making", "explicit", "material", "boundness", "particular", "world", "perspective", "analysis", "lucretius", "dante", "goethe", "described", "one", "biographer", "classical", "work", "one", "written", "america", "genuinely", "comparative", "conception", "execution", "absence", "national", "bias", "intellectual", "linguistic", "aesthetic", "range", "mccormick", "193", "initially", "santayana", "appears", "optimistic", "youthful", "america", "berkeley", "lecture", "genteel", "tradition", "american", "philosophy", "declared", "american", "inhabits", "skyscraper", "american", "intellect", "inhabits", "colonial", "mansion", "genteel", "tradition", "american", "philosophy", "triton", "edition", "vol", "vii", "p", "129", "european", "transcendentalism", "calvinism", "american", "intellectual", "tradition", "longer", "suit", "american", "drive", "success", "industry", "business", "football", "hence", "youthful", "willfulness", "country", "outrun", "old", "wit", "remains", "chance", "wisdom", "energy", "coupled", "future", "coherent", "rich", "tradition", "see", "beginning", "tradition", "james", "pragmatism", "within", "decade", "le", "optimistic", "character", "opinion", "united", "state", "1920", "valediction", "america", "includes", "frank", "intellectual", "portrait", "harvard", "colleague", "american", "culture", "residence", "cambridge", "praise", "english", "emphasis", "social", "cooperation", "personal", "integrity", "contrast", "america", "must", "wave", "must", "cheer", "must", "push", "irresistible", "crowd", "otherwise", "feel", "like", "traitor", "soulless", "outcast", "deserted", "ship", "high", "dry", "shore", "national", "faith", "morality", "vague", "idea", "inexorable", "spirit", "gospel", "work", "belief", "progress", "country", "men", "free", "every", "man", "find", "matter", "settled", "beforehand", "211", "santayana", "standing", "literary", "figure", "reached", "zenith", "publication", "last", "puritan", "1936", "last", "puritan", "santayana", "novel", "international", "success", "compared", "positively", "goethe", "wilhelm", "meister", "pater", "marius", "mann", "magic", "mountain", "provenance", "lie", "1890s", "santayana", "began", "series", "sketch", "college", "life", "broadened", "experience", "travel", "resulted", "last", "puritan", "essentially", "life", "early", "death", "american", "youth", "oliver", "alden", "sadly", "restricted", "puritanism", "santayana", "draw", "sharp", "contrast", "european", "mario", "delight", "matter", "without", "narrow", "moralism", "mario", "carefree", "naturally", "gifted", "likeable", "young", "man", "american", "standard", "appears", "focused", "peripheral", "aspect", "life", "travel", "opera", "love", "affair", "architecture", "american", "perspective", "embodied", "tragic", "hero", "oliver", "alden", "last", "puritan", "right", "based", "duty", "family", "school", "friend", "life", "slow", "powerful", "flow", "task", "responsibility", "intelligent", "know", "obligation", "sens", "guilt", "able", "achieve", "natural", "abundant", "life", "knowing", "nourishes", "puritanism", "cause", "feel", "guilty", "guilty", "charming", "scene", "novel", "oliver", "introduces", "mario", "professor", "santayana", "harvard", "oliver", "dedicated", "student", "football", "player", "thoroughly", "first", "rate", "american", "taking", "matter", "seriously", "best", "short", "visit", "professor", "mario", "decided", "santayana", "need", "take", "course", "professor", "mario", "already", "natural", "instinctual", "approach", "cultivated", "person", "oliver", "hand", "know", "must", "work", "achieve", "goal", "succession", "goal", "end", "tragically", "santayana", "hispanic", "catholic", "background", "play", "central", "role", "critique", "american", "life", "bound", "past", "tradition", "obligation", "understood", "rooted", "one", "culture", "fear", "santayana", "autobiography", "would", "lost", "destroyed", "world", "war", "ii", "led", "scribner", "publisher", "conspire", "us", "department", "state", "vatican", "spanish", "government", "bring", "manuscript", "first", "part", "person", "place", "rome", "sub", "rosa", "despite", "italian", "government", "refusal", "allow", "mail", "us", "manuscript", "second", "part", "middle", "span", "1945", "also", "conveyed", "surreptitiously", "new", "york", "third", "part", "host", "world", "1953", "published", "santayana", "death", "autobiography", "provides", "basis", "understanding", "development", "philosophy", "3", "development", "santayana", "philosophy", "autobiography", "person", "place", "santayana", "describes", "development", "thought", "movement", "idealism", "boyhood", "intellectual", "materialism", "traveling", "student", "finally", "complete", "naturalistic", "outlook", "adult", "santayana", "emphasizes", "continuity", "life", "belief", "contrasting", "may", "appear", "disparate", "view", "overall", "unity", "thought", "change", "person", "person", "place", "159", "young", "man", "nineteenth", "century", "influenced", "idealism", "age", "age", "claim", "always", "realist", "naturalist", "heart", "ideal", "universe", "head", "produce", "firm", "conviction", "actual", "duty", "nothing", "wretched", "povertystricken", "real", "world", "condemned", "live", "real", "rotten", "imaginary", "interesting", "seemed", "axiomatic", "sweeping", "yet", "allowing", "rash", "generalisation", "youth", "still", "think", "philosophy", "never", "changed", "person", "place", "167", "hence", "note", "spite", "religious", "daydreams", "bottom", "young", "realist", "knew", "dreaming", "awake", "sure", "proof", "never", "anxious", "dream", "would", "involved", "true", "never", "least", "touch", "superstition", "person", "place", "167", "santayana", "cite", "poem", "moon", "host", "written", "fifteen", "sixteen", "revealing", "early", "realism", "quote", "memory", "one", "stanza", "church", "door", "realistic", "sentiment", "person", "place", "169", "time", "traveling", "student", "seeing", "world", "germany", "england", "spain", "intellectual", "materialism", "firmly", "established", "little", "change", "religious", "affection", "boy", "dreaming", "awake", "church", "immaculate", "conception", "travelling", "student", "seeing", "world", "germany", "england", "spain", "great", "change", "sentiment", "still", "church", "door", "yet", "belief", "clarification", "philosophy", "taken", "important", "step", "longer", "wavered", "alternative", "view", "world", "put", "taken", "like", "alternative", "play", "theatre", "saw", "one", "possible", "play", "actual", "history", "nature", "mankind", "although", "might", "well", "ghost", "among", "character", "soliloquy", "among", "speech", "religion", "religion", "idealistic", "philosophy", "idealistic", "philosophy", "soliloquy", "ghost", "might", "eloquent", "profound", "like", "hamlet", "soliloquy", "might", "excellent", "reflective", "criticism", "play", "whole", "nevertheless", "part", "value", "criticism", "lay", "entirely", "fidelity", "fact", "sentiment", "fact", "aroused", "critic", "person", "place", "169", "full", "statement", "development", "materialism", "occur", "later", "life", "certainly", "place", "time", "scepticism", "animal", "faith", "1923", "fully", "time", "life", "reason", "1905", "influence", "harvard", "philosopher", "particularly", "james", "royce", "evident", "santayana", "thought", "hardly", "mere", "follower", "often", "advanced", "philosophy", "along", "european", "greek", "line", "rather", "american", "tradition", "thought", "derivative", "tied", "advancement", "business", "capitalism", "move", "harvard", "marked", "geographical", "shift", "philosophical", "one", "well", "henry", "levinson", "santayana", "pragmatism", "spiritual", "life", "provides", "wellbalanced", "account", "gradual", "distinctive", "move", "harvard", "philosophical", "mentality", "leaving", "harvard", "also", "meant", "santayana", "abandoned", "view", "philosopher", "public", "philosophical", "statesman", "language", "representative", "philosophical", "turn", "placed", "make", "forerunner", "many", "issue", "next", "two", "century", "removing", "literally", "philosophically", "american", "scene", "santayana", "increasingly", "came", "believe", "brimstone", "sensibility", "pragmatism", "wrongheaded", "character", "opinion", "united", "state", "53", "major", "aspect", "sensibility", "view", "philosopher", "must", "engaged", "fundamentally", "social", "cultural", "policy", "formulation", "pulling", "civic", "weight", "fashion", "santayana", "belief", "pragmatist", "came", "belie", "genuinely", "expressive", "poetic", "meditative", "festive", "character", "vocation", "levinson165", "condition", "james", "took", "seriously", "certain", "blindness", "human", "being", "suggesting", "world", "practical", "responsibility", "foster", "blindness", "multiplural", "way", "living", "escaped", "catching", "sight", "world", "impersonal", "worth", "mystic", "dreamer", "insolent", "loafer", "tramp", "afford", "sympathetic", "occupation", "james", "talk", "teacher", "psychology", "student", "life", "ideal", "141", "interestingly", "america", "imperialistic", "action", "toward", "philippine", "spanishamerican", "war", "sparked", "james", "remark", "war", "much", "deeper", "ancestral", "historical", "aspect", "santayana", "led", "poem", "young", "sammy", "first", "wild", "oats", "whether", "connected", "santayana", "later", "came", "identify", "intellectual", "vagabond", "tramp", "isolated", "specific", "perspective", "ideology", "hosted", "world", "devoted", "spiritual", "discipline", "appear", "irresponsible", "philosopher", "hoping", "command", "representative", "otherwise", "privileged", "authority", "center", "society", "levinson", "167", "building", "naturalism", "institutional", "pragmatism", "social", "realism", "poetic", "religion", "santayana", "leaving", "harvard", "move", "even", "farther", "role", "philosophical", "statesman", "removing", "representative", "authority", "language", "quest", "comprehensive", "synthesis", "narrowing", "line", "literature", "philosophy", "earlier", "done", "religion", "poetry", "wrestling", "influence", "james", "emerson", "santayana", "stay", "oxford", "great", "war", "led", "famous", "counter", "wilson", "war", "end", "war", "dead", "seen", "end", "war", "soliloquy", "england", "later", "soliloquy", "102", "santayana", "message", "clear", "epistemological", "project", "russell", "problem", "epitomizes", "diseased", "renewed", "quest", "establish", "unmediated", "knowledge", "reality", "simply", "lead", "intellectual", "cramp", "soliloquy", "216", "philosophy", "become", "spiritually", "disordered", "blinding", "practitioner", "traditional", "proper", "task", "celebrate", "good", "life", "spiritual", "discipline", "philosophy", "thrive", "philosopher", "take", "bandage", "epistemology", "metaphysics", "altogether", "accept", "finite", "fallible", "status", "knowledge", "claim", "get", "confessing", "belief", "thing", "make", "life", "worth", "living", "levinson", "204", "leaving", "harvard", "america", "enabled", "santayana", "develop", "naturalism", "4", "naturalism", "scepticism", "animal", "faith", "1923", "introduces", "santayana", "mature", "naturalism", "summary", "maintains", "knowledge", "belief", "result", "reasoning", "inescapable", "belief", "essential", "action", "epistemological", "foundationalism", "futile", "approach", "knowledge", "promising", "approach", "discern", "underlying", "belief", "structure", "assumed", "animal", "action", "imposed", "natural", "circumstance", "foundation", "approach", "rooted", "aristotle", "concept", "activity", "pragmatic", "approach", "action", "knowledge", "explanation", "natural", "event", "proper", "purview", "scientist", "explication", "meaning", "value", "action", "may", "proper", "sphere", "historian", "philosopher", "even", "scientific", "explanation", "philosophical", "explication", "based", "natural", "world", "meaning", "value", "generated", "interaction", "physical", "makeup", "santayana", "call", "psyche", "material", "environment", "santayana", "critique", "epistemological", "foundationalism", "unique", "heritage", "spanish", "irony", "structure", "argument", "descartes", "meditation", "arrives", "antifoundationalist", "conclusion", "drawing", "attention", "given", "instant", "awareness", "smallest", "conceivable", "moment", "consciousness", "maintains", "knowledge", "recognition", "found", "instant", "would", "characterized", "concept", "essence", "use", "santayana", "term", "concept", "limited", "particular", "instance", "rather", "particular", "object", "seen", "instance", "concept", "essence", "thus", "pursuing", "doubt", "ultimate", "end", "one", "confined", "solipsism", "present", "moment", "single", "instant", "awareness", "knowledge", "belief", "since", "require", "concept", "bounded", "moment", "awareness", "hence", "ultimate", "end", "doubt", "instance", "awareness", "empty", "vacant", "awareness", "given", "without", "basis", "belief", "knowledge", "action", "santayana", "concludes", "one", "attempt", "find", "bedrock", "certainty", "one", "may", "rest", "claim", "least", "theoretically", "recognized", "knowledge", "composed", "instance", "awareness", "contain", "prerequisite", "knowledge", "eg", "concept", "universal", "essence", "skepticism", "proof", "skepticism", "lead", "nowhere", "precisely", "santayana", "point", "philosophy", "must", "begin", "medias", "re", "middle", "thing", "action", "instinctive", "arational", "belief", "natural", "world", "animal", "faith", "santayana", "animal", "faith", "arational", "basis", "knowledge", "claim", "nether", "world", "biological", "order", "operating", "physical", "nonconscious", "generating", "belief", "radically", "incapable", "proof", "scepticism", "35", "rising", "passive", "intuition", "pas", "vital", "constitutional", "necessity", "belief", "discourse", "experience", "substance", "truth", "spirit", "object", "may", "conceivably", "illusory", "belief", "however", "grounded", "prior", "probability", "judgement", "probability", "grounded", "express", "rational", "instinct", "instinctive", "reason", "waxing", "faith", "animal", "living", "world", "observe", "sometimes", "remodel", "scepticism", "308309", "describes", "prejudice", "animal", "effort", "emphasize", "biological", "base", "community", "emphasis", "similar", "wittgenstein", "reference", "conviction", "beyond", "justified", "unjustified", "something", "animal", "certainty", "359", "longstanding", "primitive", "credulity", "basic", "belief", "animal", "creed", "world", "future", "thing", "sought", "found", "thing", "seen", "eaten", "scepticism", "180", "santayana", "like", "hume", "wittgenstein", "strawson", "hold", "certain", "inevitable", "belief", "inescapable", "given", "nature", "individual", "physical", "history", "like", "wittgenstein", "maintains", "belief", "various", "variable", "determined", "interplay", "environment", "psyche", "ie", "natural", "condition", "inherited", "physical", "organisation", "animal", "psyche", "inescapably", "believe", "external", "object", "general", "reliability", "inductive", "reasoning", "example", "result", "physical", "history", "natural", "condition", "world", "since", "belief", "relative", "physical", "history", "history", "biological", "order", "different", "natural", "belief", "would", "also", "different", "environment", "determines", "occasion", "intuition", "arise", "psyche", "inherited", "organisation", "animal", "determines", "form", "ancient", "condition", "life", "earth", "doubt", "determined", "psyche", "arise", "prosper", "probably", "many", "form", "intuition", "unthinkable", "man", "express", "fact", "rhythm", "nature", "animal", "mind", "scepticism", "88", "displacing", "privileged", "mentalistic", "account", "pragmatic", "naturalism", "santayana", "challenge", "prevailing", "structure", "american", "english", "philosophy", "santayana", "explicates", "primary", "distinguishable", "characteristic", "knowledge", "fourbook", "realm", "believing", "philosophical", "terminology", "historical", "root", "santayana", "employed", "classical", "terminology", "characteristic", "matter", "essence", "spirit", "truth", "although", "term", "central", "many", "philosophical", "tradition", "view", "work", "revision", "category", "common", "sense", "faithful", "spirit", "orthodox", "human", "tradition", "endeavouring", "clarify", "category", "disentangle", "confusion", "inevitably", "arise", "realm", "826", "within", "santayana", "naturalism", "origin", "event", "world", "arbitrary", "temporal", "contingent", "matter", "whatever", "name", "called", "principle", "existence", "often", "untoward", "occasion", "imperfection", "conflict", "things", "realm", "matter", "v", "hence", "sour", "moralist", "may", "consider", "evil", "according", "santayana", "one", "take", "wider", "view", "matter", "would", "seem", "good", "principle", "existence", "thing", "potentiality", "therefore", "condition", "excellence", "possible", "perfection", "realm", "matter", "v", "matter", "nondiscursive", "natural", "foundation", "neither", "good", "evil", "may", "perceived", "viewed", "vested", "interest", "animal", "life", "latent", "animal", "interest", "convert", "matter", "nondiscernible", "neutral", "face", "smile", "frown", "moral", "value", "preside", "nature", "realm", "matter", "134", "principled", "value", "product", "natural", "force", "germination", "definition", "prevalence", "good", "must", "grounded", "nature", "human", "eloquence", "realm", "matter", "131", "point", "view", "origin", "therefore", "realm", "matter", "matrix", "source", "everything", "nature", "sphere", "genesis", "universal", "mother", "essence", "santayana", "term", "concept", "meaning", "draw", "aristotle", "notion", "essence", "remove", "capacity", "producing", "effect", "essence", "universal", "object", "thought", "material", "force", "however", "consciousness", "essence", "generated", "interaction", "psyche", "material", "environment", "hence", "matter", "remains", "origin", "existence", "arena", "action", "realm", "essence", "encompasses", "possible", "thought", "truth", "disinterested", "observer", "could", "ascertain", "would", "constitute", "essence", "genuinely", "characterize", "natural", "world", "activity", "within", "since", "living", "being", "natural", "interest", "preference", "knowledge", "truth", "exist", "conscious", "being", "must", "ascertain", "belief", "truth", "based", "success", "action", "sustain", "life", "permit", "period", "delight", "joy", "santayana", "us", "term", "spirit", "mean", "consciousness", "awareness", "early", "19", "april", "1909", "santayana", "wrote", "sister", "writing", "brand", "new", "system", "philosophy", "called", "realm", "mineral", "vegetable", "animal", "something", "far", "metaphysical", "namely", "essence", "matter", "consciousness", "long", "book", "technical", "book", "published", "1930s", "added", "notion", "truth", "substituted", "spirit", "consciousness", "perspective", "substitution", "alter", "meaning", "consciousness", "rather", "captured", "entire", "tradition", "philosophical", "religious", "inquiry", "well", "borrowed", "associated", "idea", "eastern", "religion", "consternation", "traditional", "view", "many", "found", "identity", "spirit", "consciousness", "troublesome", "idea", "identity", "santayana", "remove", "spiritual", "field", "agency", "well", "alternative", "way", "living", "santayana", "approach", "therefore", "direct", "contrast", "think", "spirit", "causing", "action", "fostering", "particular", "lifestyle", "following", "track", "aristotle", "make", "spiritual", "life", "one", "form", "culminating", "experience", "arising", "fulfilling", "activity", "awareness", "evolved", "natural", "development", "physical", "world", "demur", "scientific", "account", "explanation", "development", "almost", "poetically", "see", "spirit", "emerging", "moment", "harmony", "psyche", "environment", "harmony", "temporary", "disorganized", "natural", "force", "permit", "spirit", "arise", "spasmodically", "suffer", "fail", "birth", "spirit", "joyous", "nascent", "harmony", "evokes", "rending", "smothering", "harmony", "sudden", "imposes", "useless", "struggle", "suffering", "birth", "reason", "53", "accepting", "world", "insecure", "equilibrium", "enables", "one", "celebrate", "birth", "spirit", "reasoning", "particularly", "reasoning", "associated", "action", "signal", "nascent", "activity", "psyche", "working", "harmonize", "action", "environment", "successful", "reason", "permit", "individual", "social", "organization", "prosper", "spirit", "lead", "delight", "imagination", "artistry", "commentator", "characterize", "santayana", "epiphenomenalist", "commonality", "specifically", "view", "spirit", "efficacious", "also", "considerable", "difference", "santayana", "characterize", "view", "oneway", "interactionism", "primarily", "think", "spirit", "object", "acted", "upon", "spirit", "rather", "distinguishable", "aspect", "thought", "generated", "activity", "may", "viewed", "relational", "property", "santayana", "sometimes", "speaks", "spirit", "essence", "supervening", "material", "event", "lacking", "distinction", "contemporary", "philosophy", "difficult", "characterize", "santayana", "philosophy", "mind", "accurately", "view", "consciousness", "celebrational", "opposed", "burden", "eliciting", "action", "spirit", "precisely", "voice", "order", "nature", "music", "full", "light", "motion", "joy", "peace", "come", "even", "partial", "momentary", "perfection", "vital", "rhythm", "birth", "reason", "53", "santayana", "account", "spirit", "essence", "may", "lead", "one", "wonder", "santayana", "included", "pragmatist", "classification", "accurate", "one", "includes", "extended", "notion", "pragmatic", "naturalism", "santayana", "explanation", "human", "life", "including", "reason", "spirit", "lie", "within", "science", "nature", "truth", "simply", "correspondence", "since", "human", "conscious", "able", "see", "beyond", "determinant", "limit", "nature", "environment", "pragmatism", "becomes", "test", "truth", "rather", "correspondence", "short", "nature", "truth", "correspondence", "test", "truth", "pragmatic", "explanation", "continues", "bear", "fruit", "long", "run", "accepted", "truth", "replaced", "better", "explanation", "santayana", "account", "pragmatic", "truth", "closely", "aligned", "peirce", "conception", "james", "dewey", "including", "tripartite", "account", "knowledge", "consisting", "subject", "symbol", "object", "pragmatism", "properly", "focused", "scientific", "inquiry", "explanation", "severely", "limited", "even", "useless", "spiritual", "aesthetic", "matter", "pragmatism", "rooted", "animal", "life", "need", "know", "world", "way", "foster", "successful", "action", "life", "constituted", "successful", "unsuccessful", "activity", "one", "fated", "circumstance", "would", "govern", "consciousness", "make", "liberation", "possible", "brings", "delight", "festivity", "material", "circumstance", "santayana", "antifoundationalism", "nonreductive", "materialism", "pragmatic", "naturalism", "coupled", "emphasis", "spiritual", "life", "view", "philosophy", "literature", "anticipated", "many", "development", "philosophy", "literary", "criticism", "occurred", "latter", "half", "twentieth", "century", "served", "challenge", "humanistic", "naturalism", "john", "dewey", "american", "naturalist", "view", "also", "provide", "foundation", "view", "ethic", "political", "philosophy", "spiritual", "life", "5", "ethic", "politics", "spiritual", "life", "santayana", "moral", "philosophy", "based", "naturalism", "commentator", "classify", "santayana", "extreme", "moral", "relativist", "maintains", "individual", "moral", "perspective", "equal", "standing", "based", "heritable", "trait", "environmental", "circumstance", "individual", "naturalistic", "approach", "applies", "living", "organism", "nature", "establish", "moral", "hierarchy", "good", "animal", "population", "individual", "animal", "however", "moral", "relativism", "also", "basis", "santayana", "claim", "good", "individual", "animal", "clear", "subject", "naturalistic", "biological", "investigation", "two", "tenet", "ethic", "1", "form", "good", "diverse", "2", "good", "animal", "definite", "final", "moral", "terrain", "animal", "viewed", "neutral", "perspective", "place", "animal", "interest", "good", "equal", "good", "stem", "heritable", "physical", "trait", "shaped", "adaptation", "environment", "concluding", "form", "good", "divergent", "santayana", "hold", "good", "animal", "may", "differ", "depending", "nature", "psyche", "circumstance", "may", "different", "individual", "animal", "different", "time", "environment", "one", "good", "even", "individual", "seen", "whole", "animal", "good", "logically", "morally", "ordered", "natural", "morally", "neutral", "force", "living", "observe", "interest", "neutrality", "situated", "particular", "place", "time", "heritable", "trait", "living", "being", "interest", "originating", "physiology", "physical", "environment", "santayana", "one", "may", "reasonably", "note", "neutral", "observer", "could", "view", "moral", "perspective", "equal", "view", "must", "balanced", "understanding", "animal", "stand", "neutral", "ground", "polarity", "ideal", "neutral", "objective", "understanding", "behavior", "one", "hand", "committed", "vested", "interest", "particular", "living", "being", "hand", "one", "may", "recognize", "every", "animal", "good", "standing", "one", "may", "respect", "ideal", "right", "alien", "nature", "pursue", "proper", "aim", "never", "abolish", "right", "pursue", "person", "place", "179", "santayana", "second", "moral", "insight", "animal", "good", "definite", "final", "specific", "good", "animal", "depending", "specific", "heritable", "trait", "interest", "psyche", "specific", "circumstance", "environment", "selfknowledge", "distinguishing", "moral", "mark", "extent", "one", "know", "one", "interest", "complexity", "centrality", "determine", "whether", "one", "achieve", "good", "life", "provided", "environment", "accommodating", "santayana", "philosophy", "rest", "naturalism", "humane", "sympathetic", "appreciation", "excellence", "life", "perspective", "autobiography", "santayana", "clear", "notion", "selfknowledge", "sense", "greek", "distinguishing", "mark", "santayana", "integrity", "selfdefinition", "remains", "first", "fundamental", "moral", "person", "place", "170", "selfknowledge", "requires", "critical", "appreciation", "one", "culture", "physical", "inheritance", "ability", "shape", "one", "life", "stream", "conflicting", "good", "within", "oneself", "within", "one", "community", "although", "position", "common", "many", "consideration", "political", "philosophy", "santayana", "approach", "politics", "much", "conservative", "normally", "associated", "founder", "american", "pragmatism", "james", "dewey", "santayana", "political", "conservatism", "founded", "naturalism", "emphasis", "selfrealization", "spirituality", "concerned", "liberal", "democracy", "may", "provide", "consistent", "basis", "individual", "freedom", "spirituality", "twin", "fear", "private", "anarchy", "public", "uniformity", "ground", "criticism", "democracy", "account", "social", "justice", "focus", "individual", "rather", "society", "santayana", "inattentiveness", "social", "inequality", "perhaps", "understandable", "context", "naturalism", "final", "cause", "authority", "things", "basic", "contention", "individual", "suffering", "worse", "feature", "human", "life", "social", "inequality", "cause", "focus", "natural", "dilemma", "individual", "rather", "social", "action", "coupling", "argument", "view", "institution", "including", "government", "inextricably", "rooted", "culture", "background", "perhaps", "make", "understandable", "would", "readily", "see", "particular", "view", "social", "inequality", "could", "transferred", "readily", "one", "culture", "another", "addition", "santayana", "european", "particularly", "spanish", "background", "influenced", "attitude", "toward", "social", "action", "repeated", "latin", "perspective", "caused", "look", "considerable", "suspicion", "toward", "forcing", "anglosaxon", "outlook", "culture", "yet", "individual", "matter", "remarkably", "forthcoming", "provided", "financial", "support", "numerous", "friend", "often", "quite", "different", "philosophical", "literary", "political", "persuasion", "within", "natural", "order", "every", "living", "entity", "stand", "natural", "ground", "bathing", "equally", "impartial", "light", "nature", "one", "claim", "central", "place", "others", "entity", "also", "embodied", "set", "value", "art", "life", "structure", "one", "environment", "fashion", "best", "realize", "embodied", "value", "ie", "place", "harmony", "natural", "force", "one", "life", "one", "environment", "american", "democracy", "exacting", "challenge", "lacking", "time", "live", "mind", "american", "use", "quantity", "justification", "lack", "quality", "achievement", "quantity", "potentially", "infinite", "assures", "unrivaled", "busyness", "worth", "according", "santayana", "selfrealization", "goal", "individual", "life", "course", "circumstance", "make", "difficult", "perhaps", "impossible", "individual", "order", "life", "reasonably", "attain", "practical", "wisdom", "achieve", "individual", "happiness", "america", "economic", "success", "would", "appear", "make", "possible", "many", "succeed", "american", "must", "abandon", "servility", "mechanism", "economics", "needed", "life", "made", "free", "recovery", "capacity", "vision", "good", "life", "person", "place", "xxxiv", "according", "santayana", "fanatic", "person", "lost", "sight", "goal", "redoubled", "effort", "supplant", "busy", "blind", "relentlessly", "quantitative", "existence", "must", "regain", "sight", "goal", "individual", "life", "structured", "light", "goal", "santayana", "focus", "individual", "role", "state", "protect", "enable", "individual", "flourish", "goal", "something", "far", "worked", "toward", "task", "accomplished", "supplanted", "another", "task", "often", "case", "american", "enterprise", "rather", "celebration", "life", "festivity", "aristotle", "practical", "wisdom", "structuring", "individual", "life", "living", "joyfully", "assuring", "one", "commitment", "conducive", "delight", "intellect", "consistent", "demand", "time", "tradition", "exercise", "one", "free", "choice", "shaping", "one", "life", "material", "wellbeing", "appreciate", "poetic", "dramatic", "quality", "existence", "rush", "life", "die", "without", "joy", "living", "tragedy", "american", "life", "though", "perhaps", "many", "spiritual", "life", "organizing", "good", "cultural", "background", "spiritual", "life", "religious", "life", "primarily", "found", "within", "catholic", "church", "informed", "late", "nineteenth", "century", "early", "twentieth", "century", "account", "eastern", "religion", "santayana", "interested", "historical", "doctrinal", "explication", "element", "traditional", "religion", "rather", "philosophical", "task", "discern", "element", "giving", "rise", "traditional", "view", "case", "explicate", "aspect", "origin", "without", "dogmatism", "traditional", "religious", "belief", "introducing", "concept", "spiritual", "life", "led", "see", "inherent", "conflict", "santayana", "life", "reason", "spiritual", "life", "letter", "milton", "karl", "munitz", "23", "july", "1939", "santayana", "explains", "different", "perspective", "life", "reason", "spiritual", "life", "admit", "gladly", "religion", "spiritual", "life", "natural", "interest", "collated", "within", "life", "reason", "every", "interest", "interest", "ultimate", "adjustment", "life", "death", "science", "politics", "though", "cultivated", "specially", "certain", "mind", "certain", "hour", "moral", "natural", "claim", "predominance", "race", "age", "absent", "inevitably", "regard", "unnecessary", "obstructive", "tend", "arrange", "moral", "economy", "without", "religion", "religion", "absorbing", "eg", "indian", "contrary", "think", "moral", "economy", "inferior", "place", "influence", "given", "monition", "ultimate", "fact", "think", "would", "find", "two", "voice", "inharmonious", "agree", "different", "pitch", "live", "america", "xxth", "century", "dominance", "foreground", "pronounced", "dominance", "distance", "background", "would", "impose", "different", "synthesis", "work", "v", "5", "book", "6", "254", "spiritual", "life", "considered", "dominating", "guiding", "influence", "structuring", "one", "life", "way", "santayana", "view", "reason", "one", "would", "forced", "choose", "life", "reason", "life", "spirit", "monk", "nun", "must", "choose", "life", "world", "religious", "order", "santayana", "conflict", "exists", "spirituality", "choosing", "way", "living", "extended", "period", "time", "indeed", "effort", "choose", "life", "would", "short", "lived", "since", "spiritual", "life", "life", "receptivity", "come", "moment", "suspending", "animal", "interest", "suspending", "one", "specific", "natural", "interest", "eating", "sleeping", "extended", "period", "would", "detrimental", "tragic", "consciousness", "essentially", "awareness", "attention", "given", "rather", "instrument", "reshaping", "world", "consciousness", "emerging", "late", "evolutionary", "pathway", "flowering", "happy", "circumstance", "celebrates", "given", "truly", "recognized", "joyful", "delighting", "presented", "troubled", "lead", "mean", "restate", "santayana", "view", "poetically", "rather", "convey", "santayana", "characterizes", "consciousness", "poetic", "rather", "mean", "action", "way", "implementing", "action", "dower", "moralistic", "evangelical", "aspect", "religion", "saw", "confused", "effort", "make", "religion", "science", "social", "club", "political", "movement", "spirit", "consciousness", "momentary", "fleeting", "depends", "physical", "force", "body", "environment", "order", "exist", "shaping", "one", "life", "enhance", "spiritual", "fleeting", "moment", "extending", "long", "practical", "one", "delight", "living", "people", "certainly", "goal"]}