{"url": "schutz", "title": "Alfred Schutz", "authorship": {"year": "Copyright © 2021", "author_text": "Michael Barber\n<michael.barber@slu.edu>", "author_links": [{"http://www.slu.edu/colleges/AS/philos/site/people/faculty/Barber/": "Michael Barber"}, {"mailto:michael%2ebarber%40slu%2eedu": "michael.barber@slu.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.slu.edu/colleges/AS/philos/site/people/faculty/Barber/\" target=\"other\">Michael Barber</a>\n&lt;<a href=\"mailto:michael%2ebarber%40slu%2eedu\"><em>michael<abbr title=\" dot \">.</abbr>barber<abbr title=\" at \">@</abbr>slu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Tue Oct 29, 2002", "substantive revision Tue Dec 21, 2021"], "preamble": "\n\nAlfred Schutz (b. 1899, d. 1959), more than any other phenomenologist,\nattempted to relate the thought of Edmund Husserl to the social world\nand the social sciences. His Phenomenology of the Social\nWorld supplied philosophical foundations for Max Weber’s\nsociology and for economics, with which he was familiar through\ncontacts with colleagues of the Austrian school. When Schutz fled\nHitler’s Anschluss of Austria and immigrated to the\nUnited States in 1939, he developed his thought further in\nrelationship to the social sciences, American pragmatism, logical\nempiricism, and to various other fields of endeavor such as music and\nliterature. His work has been influential on new movements in\nsociological thought such as ethnomethodology and conversation\nanalysis.\n", "toc": [{"#LifInf": "1. Life and Influence"}, {"#PheSocWor": "2. The Phenomenology of the Social World"}, {"#Ext": "3. Extensions"}, {"#BerWri": "3.1 The Bergson Writings"}, {"#SocSci": "3.2 The Social Sciences"}, {"#OthPhi": "3.3 Other Philosophies"}, {"#App": "3.4 Applications"}, {"#Phe": "3.5 Phenomenology"}, {"#SchuTrad": "4. The Schutzian Tradition"}, {"#Bib": "Bibliography"}, {"#WorSch": "Works by Schutz"}, {"#SecLit": "Secondary Literature"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Life and Influence\n\nVienna-born Alfred Schutz joined the artillery division of the\nAustrian army during World War I and served on the Italian front\nbefore returning to pursue studies at the University of Vienna. There\nSchutz studied law, social science, and business with renowned figures\nsuch as Hans Kelsen and Ludwig von Mises, but his most significant\neducational experience occurred while he was a member of the Mises\nCircle, one of many Viennese circles, of which the “Schlick\nCircle” was the most famous. In the interdisciplinary Mises\nCircle, Schutz formed friendships that would continue throughout the\ncataclysmic decades of the 1930s and 1940s and that included, among\nothers, economists Gottfried von Haberler, Friedrich A. von Hayek,\nFritz Machlup, Oskar Morgenstern, philosopher Felix Kaufmann, and\npolitical scientist Eric Voegelin. While continuing to pursue his\nacademic interests, in 1927 Schutz was named executive officer of\nReitler and Company, a leading Viennese banking firm with\ninternational business relations, and thus he commenced a life-long\npattern that led Edmund Husserl to describe him as “a banker by\nday and a philosopher by night.”\n\nFrom the beginning, Schutz had been taken with the methodological\nwritings of Max Weber, who had lectured in Vienna in the summer of\n1918 and whose work was immensely popular among Viennese\nintellectuals. However, Schutz felt that Weber’s work rested on\ntacit, unexamined presuppositions resulting from his lack of interest\nin fundamental epistemological problems that had no direct bearing on\nhis special sociological problems. In 1925–1927, Schutz turned\nto Henri Bergson’s philosophy of consciousness and inner time in\norder to clarify notions such as meaning, action, and\nintersubjectivity, and his results have been collected in manuscripts\npublished as Life Forms and Meaning Structure. Dissatisfied,\nthough, with his analyses of temporality to the extent that he never\npublished them and prompted by comments of Felix Kaufmann, he\ndiscovered the relevance of the phenomenology of the consciousness of\ninner time of Edmund Husserl (1859–1938). He then went on to\nproduce his major life’s work, The Phenomenology of the\nSocial World (1932), a work for which Husserl praised him as\n“an earnest and profound phenomenologist.” He spent the\nrest of the 1930s authoring brief essays showing how his phenomenology\nof the social world could come to terms with the economic thought of\nMises and Hayek. Also, before any direct encounter with American\npragmatism, he developed a manuscript on personality in the social\nworld that stressed the pragmatic elements of the everyday social\nworld.\n\nSchutz’s career, academic and business, was thoroughly convulsed\nwhen Adolf Hitler implemented the annexation (Anschluss) of\nAustria by Germany on March 13, 1938, especially since he, on a\nbusiness trip in Paris, was separated for three months from his own\nfamily, whose emigration to Paris he finally arranged. As an\ninternational lawyer and businessperson, he was able to assist\nnumerous intellectuals to escape Austria, but the westward movement of\nthe Nazi juggernaut eventually compelled him to immigrate with his\nfamily to the United States on July 14, 1939.\n\nIn the United States, he continued assisting immigrants and working\nwith Reitler and Company in reestablishing its business, and he\nsupported the United States war effort by reporting on German and\nAustrian economic matters for the Board of Economic Warfare. He also\ncooperated with Marvin Farber in founding the International\nPhenomenological Society, whose initial turf-battles he often\nmediated, and in instituting and editing Philosophy and\nPhenomenological Research. In 1943, Schutz began teaching\nsociology and philosophy courses on The Graduate Faculty of The New\nSchool for Social Research, and his responsibilities included\npresenting papers in the school-wide General Seminar, supervising\ndissertations, and serving as chair of the Philosophy Department from\n1952–1956. In spite of his many activities, he managed to carry\non an extensive philosophical correspondence with Farber, Aron\nGurwitsch, Fritz Machlup, Eric Voegelin, and Maurice Natanson, his\ngraduate student from 1951 to 1953. However, to date, only the\ncorrespondences with Gurwitsch and Voegelin have been published. While\nin the United States, Schutz published a collection of articles on a\nwide variety of topics, explaining and criticizing Husserl’s\nthought; examining the works of American philosophers such as William\nJames or George Santanyana; engaging continental philosophers such as\nMax Scheler or Jean-Paul Sartre; developing his own philosophical\npositions on the social sciences, temporality, language, multiple\nrealities, responsibility, and symbolism; addressing socio-political\nquestions dealing with strangers, homecomers, well-informed citizens,\nand equality; and treating themes in literature and music.\n\nSeveral thinkers have continued Schutz’s tradition in philosophy\nand sociology, such as Maurice Natanson who emphasized the tension\nbetween individual, existential and social, anonymizing dimensions of\neveryday life experience. Thomas Luckmann, who served as co-author for\nthe posthumous publication of Schutz’s The Structures of the\nLife-World, developed the sociology of knowledge implications of\nSchutz’s thought and stressed the differences between science\nand the life-world as well as the importance of language, symbolism,\nand the moral order of society. While John O’Neill has fused\nSchutz’s thought with that of Merleau-Ponty by focusing on the\nlived, communicative body, Richard Grathoff has investigated the\nexperience of normality within the bounded and situated context of a\nmilieu. Ilja Srubar developed the pragmatic dimensions of\nSchutz’s thought and several of its economic and political\nimplications, Lester Embree clarified his typology of the sciences,\nand Fred Kersten has expanded his aesthetic insights. Drawing on\nSchutz’s thought, Harold Garfinkel launched ethnomethodology,\nand George Psathas, a commentator on ethnomethodology, played a key\nrole initiating the new discipline of conversation analysis. Several\nother scholars worldwide have dedicated themselves to Schutz’s\nwork and to the development of his insights, and Germany, Japan, and\nthe United States are home to archives containing Schutz’s work\nand correspondence.\n2. The Phenomenology of the Social World\n\nIn his principal work, Schutz placed three chapters of philosophical\ndiscussion between introductory and concluding chapters that discussed\nthe social scientific positions his philosophy attempted to engage. In\nthe initial chapter Schutz praised Max Weber’s views on\nvalue-freedom in social science and the autonomy of science\nvis-à-vis other activities (e.g. politics), and he commended\nWeber’s methodological individualism and ideal-type methodology.\nIn addition, he applauded Weber’s refusal to reduce the social\nsciences to the natural sciences, while allowing their ideal-typical\nresults to be testable for adequacy. However, Schutz also supplemented\nWeber, pointing out how interpretation was involved even in selecting\nan experience out of one’s stream of experience and highlighting\nhow the meaning of an action to an actor depended upon the project\nguiding the extended temporal process of the sub-acts leading to its\nrealization.\n\nThese initial criticisms of Weber required Schutz to develop his\nown theory of meaning and action, beginning with\nHusserl’s study of the consciousness of internal time, in\nparticular consciousness’s capacity to capture reflectively and\ndistinguish lived experiences, which at first appear as undefined\nphases melting into each other. Schutz had appropriated this notion of\nflowing consciousness, or duration, from Bergson, on whom he\nhad relied in the manuscripts later published as Life Forms and\nMeaning Structure. Those manuscripts, for analytic purposes,\nsplit the ego, indivisible in its lived experience, into ideal-typical\nconstructs of various life forms, that included the “I”\nliving in duration, remembering, acting, thinking, and relating to a\n“Thou.” Though Schutz never made explicit his reasons for\nnot publishing those earlier manuscripts, Helmut Wagner rightly\nspeculated that he was ill at ease since one could only have access to\nduration through acts of memory, which, of course, constituted a\nlife-form entirely separate from duration itself. As a result of this\nmethodology relying on distinct ideal-types, duration began to appear\nas an inaccessible Ding-an-sich. Husserl’s account of\nthe consciousness of inner time remedied just this problem by\ncarefully describing how the stream of duration was changed at every\nmoment into a remembered having-just-been-thus, as the primal\nimpression passed into into primary remembrance, or retention. The\ncontinuum extending backward from the now of the primal\nimpression through its retentions formed a “specious”\npresent, to which the reflective acts of secondary remembrance, that\nis, recollection or reproduction, turned, differentiating one\nexperience from another. In sum, Husserl’s phenomenological\ndescription of experience uncovered the process of retention that\nbridged the duration/(reflective) memory gap that had bedeviled\nSchutz’s earlier efforts insofar as he had relied on an\nideal-typical methodology, which prevented insight into what goes on\nwithin conscious processes themselves.\n\nSchutz, though, turned the Husserlian account of temporality in the\ndirection of an action theory, demarcating levels of passive\nexperience (e.g. bodily reflexes), spontaneous activity without a\nguiding project (e.g., acts of noticing environmental stimuli), and\ndeliberately planned and projected activity, known technically as\n“action” (e.g., writing a book). In planning an action to\nbe realized in the future, one relies on reflective acts of\n“projection,” like those found in reflective memory, only\nnow oriented in a future as opposed to past direction. Through such\nreflectivity, one imagines a project as completed in future perfect\ntense, that is, what will have been realized after one’s acting,\nand this project, also of central importance for Martin Heidegger and\nthe pragmatist tradition, establishes the “in-order-to\nmotive” of one’s action. By contrast, one’s\n“because motives” consist in the environmental, historical\nfactors that influenced the (now past) decision to embark upon the\nproject and that can only be discovered by investigating in the\n“pluperfect tense,” that is, exploring those past factors\nthat preceded that past decision.\n\nSchutz’s distinctions here are relevant to contemporary debates\nabout whether freedom is compatible with determinism since from the\nperspective of the lived in-order-to motive, one experiences oneself\nas free and morally responsible, but from the perspective of examining\none’s because motives after completing one’s action, one\ncorrelates, as an observer of oneself, the choice of the project with\nits historical determinants. Of course, Schutz, working within the\nparameters of Husserl’s non-naturalistic account of\nconsciousness, would have conceived such determinants not so much as\nempirico-mechanical causes but rather as influences discoverable\nthrough an interpretive process, associating earlier events with the\nlater ones they seem to have influenced. Schutz’s position comes\nclosest to the roughly compatibilist outlooks of P.F. Strawson and\nThomas Nagel, who distinguish between the participant and observer\nattitudes prior to theoretical discussions and who align the\nparticipant attitude with freedom and the observer attitude with\ndeterminism. Schutz, however, contributes the unique insight that\nthese attitudes take place within distinctive temporal frameworks,\noriented toward the future or the past.\n\nSchutz’s account of the temporal framework of motivation\npermitted criticism of Weber’s view that one could orient\none’s action to the past behavior of others, since, while such\nbehavior might have served as the because motive of an action, one\ncould not aim at affecting another’s already completed action.\nSimilarly, failure to appreciate temporality often leads to\nmisinterpretations of action, as when one assumes that the\noutcome of an act may have been its motive without considering the\nactor’s in-order-to motive, which due to unforeseen events may\nhave been adjusted or may have led to results contrary to those\nintended. Likewise, one can interpret an economic action after the\nfact as less than rational without taking sufficient account of the\nlimited information that was available to the actor at the time of\ndeciding to act and that might make her action seem perfectly\nrational. Moreover, the fact that one’s own temporal stream of\nconsciousness never completely coincides with that of another, whose\nsequence of events and intensity of experience inevitably differs from\none’s own, places limits on one’s understanding of\nanother. As a consequence, the objective meanings of language, defined\nin dictionaries as invariant regardless of users, also bear subjective\nconnotations for language users due to their unique histories of\nlinguistic experience, even though for practical purposes of\ncommunication they are able to set aside such differences. For\ninstance, one would have to consider in depth Goethe’s works as\na whole to understand what he meant by “demonic.”\nSchutz’s basic point in all these examples involves getting\nbehind constituted meanings to the temporal processes by which actors\nbuild up the meaning of their own actions—a meaningful build-up\naccentuated by the German title of his Phenomenology of the Social\nWorld (Der sinnhafte Aufbau der sozialen Welt).\n\nIn addition to this account of consciousness, motivation, and action,\nhe examined the structure of the social world, including Consociates\nwho share the same time and spatial access to each other’s\nbodies, Contemporaries with whom one shares only the same time, and\nPredecessors and Successors with whom one does not share the same time\nand to whose lived bodies one lacks access. Consociates, present to\neach other physically, partake of each other’s inner time, that\nis, the on-rolling life of the other, grasp the building up of the\nother’s experience, and live in a We-relationship that entails\n“growing older together.” While Consociates revise their\ntypes of each other immediately, one must proceed more inferentially\nwith Contemporaries, Predecessors, and Successors, constructing ideal\ntypes based on letters or reports and running greater risks of\nmisunderstanding, depending on the degree of anonymity of the person\nto be understood. One could say, then, that Weber’s method of\nideal type construction, illustrated in his sociological account of\nthe Protestant at the origins of capitalism, is not really that\nforeign to the everyday life-world in which actors beyond the\nConsociate level continually relate to each other via such type\nconstruction. Human actors in everyday life already adopt toward each\nother the attitudes of social scientists.\n\nSchutz conceived his work as developing a “phenomenological\npsychology” of “inner experience” and focusing on\nthe invariant features of the life-world toward which theoreticians,\nincluding social scientists, turn reflectively. Although Jürgen\nHabermas criticizes Schutz’s account of the life-world for being\n“abridged in a culturalistic fashion” and not addressing\ninstitutional orders and personality structures (Habermas 1987,\n2:126–132), it would seem that Schutz himself delimits his own\nwork in just this fashion. According to him, social scientists develop\nconstructs, ideal types, of the meaning-contexts of life-world actors,\nand they test these types to determine if they are causally adequate,\nthat is conforming to past experience, and meaning adequate, that is,\nconsistent with whatever else is known about the actor. Responding to\nMises’s critique that Weber’s ideal-types are too\nhistorically specific, Schutz suggested that the later Weber’s\nideal types in Economy and Society attain a generality\ncomparable to that of Mises’ own economic theory, which itself\ncould be interpreted as presenting ideal-typical descriptions of the\nbehavior of economic agents. The later Weber’s types depict the\ninvariant subjective experiences of anyone who acts within the\neconomic framework as defined by the principle of marginal utility,\nthat is, choosing to maximize satisfaction.\n3. Extensions\n3.1 The Bergson Writings\n\nSchutz’s manuscripts on Bergson, produced from 1925 to 1927 and\nfinally published in English in 1982, illuminate his subsequent works,\nwith which they share the general purpose of “the grounding of\nthe social sciences in the Thou experience.” (Schutz 1982, 34)\nIn reaction to positivistic approaches of the Schlick Circle (in which\nFelix Kaufmann participated) that reduced experience to what the\nmethod of natural scientific observation found tolerable, Schutz\nsought to give an account of the life-form of pre-scientific\nexperience preceding conceptual-categorical comprehension, the\n“highest and most powerful life-form” (Schutz 1982, 53).\nOf course, by moving in this direction, he encountered the problem,\nfaced by Georg Wilhelm Friedrich Hegel, Wilfrid Sellars, John\nMcDowell, Robert Brandom, and others, namely, how it is possible to\naccess the pre-conceptual without conceptualizing it. Hence, he\nacknowledged that his work is “in conflict with its\nmaterial” since it “is forced to resort to conceptual\nformulations” (Schutz 1982, 70). This problem parallels the\nproblem of reaching the life-form of the present unfolding of\nexperience (duration) since one can only speak of it by arresting its\nflow, distinguishing its moments, and thus remembering what has\nlapsed—but then one is in the new life-form of memory. Although\nthis gap between present duration and memory prompted his turn to\nHusserlian phenomenology, the problematic itself highlighted for him\nthe pervasiveness and hiddenness of interpretive activity as one moves\nbetween interpretive frameworks—a principal theme of all his\nlater work. He took notice of this theme when he frequently pointed\nout how one’s reconstitution of a past experience in memory\nvaried according to the interests of the present from which\none remembered the past. Indeed a favorite example from\nBergson’s work involved an actor reflecting upon a prior process\nof choosing and interpreting it as if it had been a choice between two\nclearly defined possibilities, whereas in fact the process often\noscillated between several options, retaining, reproducing, comparing,\nand modifying them in succession. In general, Schutz concurred with\nBergson on such notions such as attention to life, planes of\nconsciousness, the body as the intersection of outer and inner\ntemporality, music as the model of duration, and multiple types of\nordering, but rejected his bio-evolutionary theory, vitalism, and the\nidea of a supra-personal elán.\n3.2 The Social Sciences\n\nAlthough Schutz defended Weber against Mises, he agreed with many\nbasic premises of Mises and the Austrian tradition that focused on the\nsubjective preferences of the purchaser conferring value on objects\ninstead of explaining value as the result of objective processes such\nas production costs or labor time invested. He also shared\nMises’s suppositions about value-freedom in economic science,\nthe need to describe rather than evaluate preferences, and the\ninstrumental task of science, namely, of showing how to achieve ends\nrather than assessing their value. Since Mises considered all acting\neconomic insofar as any consumer choice involved maximizing\nsatisfaction in the widest sense, he opposed the narrow type of the\nhomo economicus, modeled on the businessperson driven solely\nby economic motives at the expense of all others. Schutz, however,\nposited the life-world with its wide diversity of motivations at the\nbase of economic theory. He conceived such theory as adopting a\nreflective perspective governed by the principle of marginal utility,\nnamely, that ideal types ought to be constructed as if all\nactors “had oriented their life-plans to realize the greatest\nutility with minimal cost.” (Schutz 1964, 87) Besides thus\nresuscitating a version of homo economicus, Schutz insisted\nthat economists study purposive-rational actions, which, in\nWeber’s sense, involved a reflective comparison of alternative\nprojects before adopting one as an in-order-to motive. In addition, he\nclassified the sense of uneasiness that Mises described as prompting\nthe search for satisfaction under the category of because motives; one\nfirst adopts an rationally determined economic project and in\nretrospect discovers the preceding dissatisfaction. To understand the\ndifference between conceiving all action as economic and conceiving\neconomic action as one type of action within an more encompassing\nlife-world, one might compare Mises with Schutz with reference to a\nproblem raised within contemporary discussions of collective action,\nnamely, how traditional non-economic values (e.g., those of politics\nor ethics) ought to intersect the market. Mises would countenance\neconomic agents registering their values economically, that is, by\ndeciding to purchase or not (e.g. as a protest against polluting\ncompanies), thereby converting all values into economic ones, whereas\nSchutz would call for a process negotiating the boundaries between\ndifferent life-world value domains.\n\nIn “Concept and Theory Formation in the Social Sciences,”\nSchutz addressed the broader issue of the relationship between\nphilosophy and the social sciences in general. In that essay, Schutz\nresponded to Ernest Nagel’s positivistic view that the social\nsciences should make use of natural scientific methods, identifying\nevidence with sensory observable data and criticizing the Weberian\nmethod of “understanding” as appealing to uncontrollable\nand unverifiable introspection. Schutz agreed with Nagel on several\ncounts, namely that social scientists needed to validate theoretical\nbeliefs, that lack of predictability in the social sciences did not\ndisqualify their scientific character, and that Weber would have been\nwrong if his method of “subjective interpretation” implied\nempathy with unobservable, introspective states. The problem was,\nthough, that the natural scientific approach to the social sciences,\ninsofar as it separated verifiable observable behavior from\nunverifiable inner states (purposes, emotions), seemed to play on the\nmap drawn by Descartes who divorced body from mind and allowed only\nstatements about the former to be scientifically verifiable. Further,\nthe natural scientific approach depended on a basic presupposition\nsince without first examining the object of social\nscience—social reality, in Schutz’s terms—one would\nbe simply presupposing that the methods of the natural sciences were\nappropriate to its study. Therefore, Schutz attempted first to clarify\nsocial reality, described in depth by his own phenomenology of the\nsocial world, and to indicate how actors sustain that reality by\nunderstanding each other’s in-order-to motives in typical terms\n(e.g., going to school, making a purchase, marrying). Such mutual\nunderstanding takes place without either somehow or other penetrating\ninto the other’s private, inner sanctum, or reducing the other\nto the status of animal organism responding to stimuli. Given this\naccount of social reality, in which actors give meaning to their\nworld, as opposed to physical reality whose objects (e.g., electrons,\nquarks) do not interpret their world, Schutz argued that the\nappropriate social scientific method involved developing constructs of\neveryday actor’s constructs. Social scientific constructs, ideal\ntypes in Weber’s sense, aimed at capturing the subjective\nmeaning of the actor, that is, according to Weber’s intentions,\nthe meaning of the actor as opposed to the social scientist and not\nsome introspective inner process. Schutz conceived statistical and\nother formulations of social scientific laws as a legitimate kind of\nintellectual shorthand, always presupposing the meaningful activity of\nthe individual social actor, the “forgotten man” of the\nsocial sciences (Schutz 1964, 6–7). To ensure the kind of\nvalidation that Nagel sought, mistakenly though, by restricting\nhimself to sensory observable data, Schutz proposed that social\nscientists displace their everyday practical interests in favor of a\nguiding interest in accurate scientific description and observe\npostulates of logical consistency and adequacy to the experiences\ndescribed.\n\nIn order to elucidate the meaning of rational action, Schutz\nhypothesized what a rational actor would have to know, even though\nsuch completely rational actions might never be realized in everyday\nlife. Such an actor would have to know: an end’s relationship\nwith other ends, the consequences and by-products of realizing an end,\nthe means suitable for the end, the interaction of such means with\nother ends and means, and the accessibility of those means. In\naddition, the rational actor would need to understand: her\ninteractors’ understanding of all the previous factors, the\ninterpretation of her act by others, the reactions of other people and\ntheir motivation, and the useful categories she had already discovered\nin the social world. Although social scientists might use such models\nof completely rational action to assess the rationality of everyday\nactors, Schutz cautioned social scientists that if their task were to\ndescribe life-world actors, they also needed to be wary of replacing\nthe viewpoint of everyday actors with a fictional, non-existing world\nconstructed by scientific observers. In fact, a central point of\ndiscussion in the published correspondence between Schutz and Talcott\nParsons concerned the subjective viewpoint of the actor, whose\nsub-acts, for example, could not be adequately understood without\ncomprehending the actor’s overarching project, whose temporal\nspan is at first accessible only to that actor. Finally, it should be\nnoted that Schutz himself produced two pieces of applied research in\nwhich he constructed ideal types of the Stranger and the Homecomer,\ntaking account of what their experiences meant to them instead of what\nsocial scientists or others might think they meant.\n3.3 Other Philosophies\n\nAlthough references to philosophers in the pragmatist tradition, such\nas John Dewey and George Herbert Mead are scattered through\nSchutz’s writings, it was to William James that he devoted his\nfirst full-length essay after arriving in the United States. Briefly\nalluding to the methodological differences between Husserl and James,\nhe emphasized two points where the “great masters”\nconverged: the stream of thought and the theory of fringes. Both\nthinkers stressed that personal consciousness involves no multiplicity\nof elements needing to be reunited, but rather a unity from which one\nseparates out components, and they each examined the modifications\nthat reflection introduces into the lived stream, converting an\n“I” into a “Me” or uncovering the workings of\nintentionality. Further, Husserl’s idea that the kernel of\nmeaning distinguishing an object stood out against the unthematized\nnetwork of relationships that makes up its horizon paralleled\nJames’s belief that topics have their “fringes.”\nSuch fringes connect a topic with other experiences, such that, for\ninstance, one does not hear merely “thunder,” but\n“thunder-breaking-in-upon-silence-and-contrasting-with-it.”\nSimilarly, the Jamesian idea about grasping as a unity what must be\nlearned through a many-stepped processes, such as the Pythagorean\ntheorem, could be translated into the Husserlian terminology regarding\nthe monothetical grasping of polythetic processes. Likewise,\nJames’s discussion of focusing on an object within a broader\ntopic resembled Husserl’s view that one could discern a noema,\nthat is, a perspectival aspect through which a thing constituted of\nmany such aspects presented itself.\n\nAnother American philosopher to whom Schutz dedicated an entire essay\nwas George Santayana, whose Dominations and Powers he\nreviewed. While most of the essay was expository, Schutz praised\nSantayana’s effort to base politics on a philosophical\nanthropology and his insights into the enslaving potential of\ntechnology. However, Schutz, no doubt convinced by Mises’s\npositive assessment of economic activity, resisted Santayana’s\nreduction of it to domination. Likewise, as a phenomenologist opposed\nto a Santayana’s naturalistic founding of spirit on the physical\norder of nature, Schutz dissented from a conviction derived from this\nnaturalism, namely, that democracy could solve it problems only by\nreturning to the “generative order” of agriculture.\n\nBesides these interchanges with American philosophers, Schutz (later\nin his career) interpreted the work of Max Scheler and (earlier)\nengaged thoroughly his treatment of intersubjectivity, a topic that\nSchutz insisted was to be treated within the natural attitude, in\nwhich one never doubted the existence of others. Schutz agreed with\nScheler’s belief that the “We” is given prior to the\n“I”—a position that the latter defended on the basis\nof the psychology of children and cultures less accustomed to\nself-reflection. Schutz supported this priority, however he did so on\nthe grounds that while living in one’s acts in the natural\nattitude and living also in the other’s present experience as it\nunfolds, one at first does not clearly distinguish one’s own\nthoughts from others’. Nevertheless, as soon as one reflects on\nhis own stream of consciousness—and children and cultures may\ndevelop this capacity for self-reflection later—he becomes aware\nthat his experiences are his own. Schutz found plausible\nScheler’s belief in the inner (indubitable) perception of the\nother, if “inner perception” refers to anything connected\nwith mental life or if one locates the experience of living in the\nvivid simultaneity of the “We” within his own conscious\nstream, as Schutz believed possible. However much in that vivid\nsimultaneity one might be unable to doubt the other’s existence,\none could still be mistaken about specific thoughts of the others,\nsince by belonging to the other’s stream of\nconsciousness these thoughts share the dubitability characterizing\nouter perceptions, likewise transcendent to one’s stream of\nexperience.\n\nAnother figure, more or less within the phenomenological tradition,\nwhose views on intersubjectivity Schutz examined and criticized, was\nJean-Paul Sartre, particularly the Sartre of Being and\nNothingness. In “Sartre’s Theory of the Alter\nEgo,” Schutz elucidated Sartre’s attempt to develop an\nextra-empirical, real communication with the other that avoids the\nextremes of an empiricist intersubjectivity beginning with the\nother’s body and an idealist reduction of the other to a series\nof presentations. After explaining Sartre’s differences\nregarding intersubjectivity with Husserl, Hegel, and Heidegger, Schutz\nlaid out Sartre’s existential account of how the other is given\nas a subject through the Look and how one can in turn objectify the\nother by returning the gaze. Although Sartre had intended to describe\nhow one’s body is given to the other, he instead portrayed how\nthe other’s body is given to oneself, assuming that such\ndescriptions were reversible. Schutz, who did not believe that the\nproblem of intersubjectivity could be addressed adequately within the\ntranscendental sphere, applauded Sartre’s rejection of\nHusserl’s transcendental approach to intersubjectivity; however,\nSartre’s emphasis on the other as a center of activity reflected\na continuing Husserlian influence. The main problem, though, with\nSartre’s doctrine was that its starting point in a mutual\nlooking, by which each subject reduces the other to an object,\nprecluded any possibility of a relationship between the I-subject and\nother-subject. Further, Schutz wondered how Sartre would know that the\nother’s body was given to him in the same way that his body was\nto the other if the other’s subjectivity escaped his\n“I.” Moreover, Schutz acknowledged that the other’s\ninterests might not coincide with his own, but he failed to see how\nthis fact entailed that either the other or he reduce each other to a\nutensil. Instead, he pointed to the “mutual tuning-in” to\nbe found in making music together and in language as proof that\nsubjects interact as “co-performing subjectivities” and\nthat mutual interaction in freedom better describes intersubjectivity\nthan Sartre’s practical solipsism.\n3.4 Applications\n\nIn 1945, Schutz published an essay, “On Multiple\nRealities,” that extended the theory of The Phenomenology of\nthe Social World and anticipated later essays applying that\ntheory. While he reiterated earlier views about levels of activity,\nBergsonian tensions of consciousness, and the structure of the social\nworld, his work took a decidedly pragmatic twist, emphasizing\n“working” (Wirken) as involving bodily movements\nas opposed to the covert performances of mere thinking. In manuscripts\nin the 1930s and after The Phenomenology of the Social World,\nSchutz had already turned in this pragmatic direction. In “On\nMultiple Realities,” he enlarged upon the “world of\nworking” by demonstrating how reflection dissolves the self\nunified in lived action into partial, role-taking selves and by\nexpanding Mead’s idea of the “manipulatory sphere”\nto include worlds within “potential reach,” either\nrestorable (from the past) or attainable (in the future). This\n“world of working” constitutes the paramount reality,\norganized in its interests in the face of the fundamental anxiety that\nderives, as it did for Heidegger, from the inescapability of\none’s own death. Following Husserl’s views on how\nconsciousness can modify its stances toward reality and\nde-ontologizing James’s sub-universes of reality, Schutz\ndeveloped the notion of various finite provinces of meaning. One\nenters any of these provinces, such as those of phantasms, dreams, the\ntheater, religious experience, or theoretical contemplation, by\nundergoing different types of epoché, analogous to the\nphenomenological prototype, as when one slips into a daydream, falls\nasleep, watches theater curtains open, commences a ritual, or assumes\nthe scientist’s role. Each province contains its distinctive\nlogical, temporal, corporal, and social dimensions, and movement\nbetween the provinces only becomes paradoxical (e.g., asking how\nphenomenologists are able to communicate their private findings\npublicly) if one conceives the provinces as ontological static realms\nto which one transmigrates as a soul to another world. Rather the\nprovinces are permeable, and one adopts the attitudes of scientist or\nreligious believer within the world of working as if it were\nseen through by another viewpoint, all the while that its\ncommunicative activities subtend these other provinces. There is\nsomething paradoxical, though, about describing one’s dreams or\ntheorizing about religious experience since to give an account one\nmust absent oneself from the province for which one accounts, and\nKierkegaard’s notion of indirect communication and various\npostmodern critiques of theory address themselves to just such\nparadoxes.\n\nThe essay on multiple realities underpins Schutz’s theory of\nsigns and symbols in “Symbol, Reality, and Society,”\npublished almost ten years later. Synthesizing the notion of potential\nreach from the earlier essay with Husserl’s concept of\nappresentation, namely that one element of a pair refers to\nanother not directly given in experience, Schutz describes how agents\novercome whatever transcends them. Hence they leave marks to\nbring within reach what they leave behind (e.g., breaking a twig to\nremind oneself to turn when one returns) or follow\nindications, that is, regular connections not of their making\n(e.g. smoke indicating a not yet visible fire), to bring within their\nknowledge what lies beyond it. Signs, however, appresent in\nan intersubjective setting the meanings of one person to another, but\nan insuperable transcendence still remains insofar as the each\none’s stream of consciousness and therefore meanings are never\nidentical with another’s. Finally, through symbols,\ndeveloped within groups, something given within everyday reality\nappresents a reality belonging to a entirely different province of\nmeaning, an ultimate transcendence (e.g., the stone where Jacob\ndreamed of a ladder to heaven memorializes God, accessible within the\nreligious province of meaning).\n\nSchutz dealt with this theme of language in other contexts, comparing\nHusserl’s distinction between prepredicative (prepropositional)\nand predicative levels with Kurt Goldstein’s separation, based\non studies of brain lesions, of a concrete attitude relying on\nautomatic speech associations from an abstract attitude forming\npropositions and utilizing rational language. Husserl’s\nprepredicative/predicative differentiation plays a key role in\nSchutz’s essay “Type and Eidos in Husserl’s Late\nPhilosophy,” in which he shows a gradual development from\nempirical types passively constituted within the prepredicative sphere\nto presumptive universals spontaneously formed in the predicative\nsphere. At the predicative level, scientific reflection further\ntransforms nonessential types (e.g., that whales are fish) into\nessential ones (whales are mammals), and philosophy seeks eidetic\nuniversals. At the end of this essay, Schutz speculates whether the\nHusserlian method of freely varying examples to determine the\nessential features that survive through such variations is not\nconstrained by both ontological structure (e.g., sounds are not\ncolors) and the socially shaped, natural-attitude experience of types.\nIn his essay “Tiresias, or our Knowledge of Future\nEvents,” produced contemporaneously with the type essay, Schutz\nexplains how knowledge based on natural attitude types functions in\ncontrast to the mythical Tiresias’ knowledge of the future,\nwhich is private and detached from his present or past experience.\nThese types, based on past experiences or socially transmitted, aim at\nfuture occurrences not in their uniqueness but with an emptiness that\nfuture events will fill in, such that only in retrospect, after an\nevent occurs, is one able to determine how much that event was\nexpected or unexpected. Finally, there are future events lying beyond\none’s influence that one expects only to conform with past\nexperience and there are indeterminate projects that provide\ndirection—not too tightly, though—as one gives shape to\nwhat is within one’s power.\n\nSchutz, himself a trained pianist and widely read musicologist,\nintegrated his phenomenology with his understanding of music. Music,\ndiffering from language in being non-representative, lends itself to\nphenomenological analysis in the meaning it carries beyond its mere\nphysical nature as sound waves and in its character as an ideal object\nthat must be constituted through its unfolding stages, i.e.,\npolythetically. Further music is bound to inner temporality, and its\nthemes, even though their note sequences are the same, vary according\nto context, require reflection for their recognition, and emerge\nthrough an interplay between musical elements and the listener’s\nattention and interest. Schutz found music instructive in regard to\nsocial relationships insofar as, prior to any communication, parties\nto musical performances establish a non-linguistic, non-conceptual\n“mutual tuning in relationship.” This\n“tuning-in,” this sharing of another’s flux of\nexperience in inner time already described in his\nPhenomenology, is very clearly exhibited whenever a listener\nto a musical performance participates in quasi-simultaneity in the\ncomposer’s stream of consciousness or when co-performers orient\nthemselves to each other, the composer, and the audience. Hence,\nSchutz disagreed with Maurice Halbwachs who posited musical notation\nas the basis of social relationships between performers, when in fact\nit is merely a technical device accidental to their relationship. In\nanother essay, Schutz depicted Mozart as a social scientist,\npresenting a succession of situations that different characters\ninterpret, and Schutz showed how orchestral representations of\ncharacters and their moods in melody made possible a simultaneity of\nfluxes of inner time that the non-operatic, non musical dramatist\ncould only unfold successively. Without self-consciously\nphilosophizing, Mozart conveyed in music and better than most\nphilosophers in their own medium, how human beings meet each other as\na “We.”\n\nFred Kersten discovers in Schutz’s musical writings important\nphilosophical insights. For instance, music and inner time unfold\npolythetically and cannot be grasped monothetically; that is, one must\nlive through the unfolding of a symphony or inner experience, and any\nconceptual summary of their contents inevitably fails to do justice to\ntheir meaning. However, since all conceptualization consists in a\nmonothetical grasping of polythetic stages, Schutz is actually\nrealizing that certain dimensions of consciousness elude\nconceptualization and thus demarcating the limits of rationalization,\njust as he had pointed out how certain provinces of meaning (e.g.\ndreams) evade theoretic comprehension or duration eludes memory.\nAccording to Kersten, Schutz has seen clearly that the passive\nassociations of listening (e.g. recognizing the appearance of\nsymphonic theme) differ from those of sight (e.g., apprehending an\nobject like a house) and that listening does not identify numerically\ndistinct items but produces an illusion of identification.\nSchutz’s conclusion that sameness in music involves not\nnumerical unity but recurrent likeness challenges the fundamental\nHusserlian thesis that the synthesis of passive identification is\nuniversal, at the basis of the constitution of the world.\n\nSchutz was also a master of literature, a careful student of the works\nof Goethe, and author of an article that analyzed Miguel de\nCervantes’s Don Quixote through the prism of the theory\nof multiple realities. Cervantes repeatedly brings Quixote’s\n“world of chivalry”—an order of reality with its\narguments for its own reality, its stock of knowledge, modes of social\nreinforcement, and views about space, time, and causality—into\nconflict with the worlds of drama, common sense, and science. Although\nQuixote is capable of constructing a defense of his own chivalrous\nworld from within that world, the fact that this phantasied world\ncontains an enclave of dreams (at the cave of Montesinos) ends up\nundermining it by raising the possibility that it itself is but a\ndream. Quixote’s withdrawal of the accent of reality from his\nprivate province of meaning reveals for Schutz the importance of the\nparamount reality of everyday life and the value of Sancho Panza who\n“remains deeply rooted in the heritage of common sense.”\n(Schutz 1964, 158)\n\nSchutz also brought his phenomenology to bear on political issues such\nas citizenship or racial equality. His essay “The Well-Informed\nCitizen,” dealing not only with citizenship but also the\nsociology of knowledge under the rubric of the social distribution of\nknowledge, constructs ideal types of the expert, the man on the\nstreet, and the well-informed citizen (to whom it falls to determine\nwhich experts are competent). Schutz delineates various zones of\ninterests, or relevances, extending from those within reach to those\nabsolutely irrelevant, comments on the constant changeability of\nrelevance configurations, and differentiates between relevances\nintrinsic to a theme, which one chooses, and those imposed.\nParadoxically, as modernity’s rationalization processes heighten\nanonymity, modern technology also brings everyone within reach, as the\nnuclear arms race demonstrates, and Schutz suggests as a solution that\ncitizens become broadly informed rather than succumb to the narrow\ndogmatism of the man on the street or the short-sighted specialization\nof experts. In becoming well-informed, one depends on knowledge\nsocially derived through the consultation of eyewitnesses, insiders,\nanalysts, and commentators, depending on their access to facts and\ngoverning relevances, much as Alvin Goldman’s social\nepistemology involves appraising the ‘veritistic’ value of\nassorted agents’ claims and practices. Schutz, usually the\nvalue-free describer of social reality, in his conclusion endorses a\nnormative notion of democracy in which it is a duty and a privilege,\nfrequently not available in non-democratic societies, for\nwell-informed citizens to express and defend opinions that often\nconflict with the uninformed opinions of the man in the street.\n\nSchutz composed “Equality and the Meaning Structure of the\nSocial World” at the time of the legal decision of Brown v.\nBoard of Education that ended racially segregated education in\nthe United States. With typical dispassion, Schutz explains how the\nmeaning of the term “equality” depends on the domain of\nrelevances to which it pertains (e.g., economic equality, equality of\ncivil rights, etc.) and on the in-group or out-group utilizing\nit—and here he conceives interpretation in terms of groups\nrather than individuals. He spends most of the essay contrasting\nsubjective and objective interpretations of group membership,\nequality, and equality of opportunity, construing\n“subjective” and “objective” in terms of\nin-group and out-group interpretations. As regards group membership,\nhe illustrates that the mere categorization of another as a member of\na group need not be discriminatory, but depends upon an appropriate\nevaluation of the category from the viewpoint of the categorized\nindividual. In-groups and out-groups differ in whether they understand\nequality merely as “formal,” i.e., as nondiscrimination,\nor “real,” calling for special rights and services.\nSimilarly groups think of equality of opportunity from an out-group\nperspective as “the career open to all” without\nappreciating how in-group members might subjectively experience\ninsuperable obstacles in trying to avail themselves of opportunities\nsupposedly objectively equal. In this essay, Schutz is concerned not\nto present a final definition of equality, but to highlight the\ndifferences between in-group and out-group understandings that serve\nas the preconditions of any discussion about it.\n\nSome recently published texts that Schutz authored during an ethics\ninstitute in 1956 make possible an even richer awareness of his views\non politics. In these documents, he recognizes the complex, unforeseen\nconsequences resulting from social change, urges active engagement\nwith others as crucial for developing social and civil judgment, and\nexamines the barriers to sound civil judgment created by government,\npolitical parties, pressure organizations, mass media, and\neducational, familial, religious, and professional institutions. At\none point, he even criticizes views that limit democracy to mere\nmajoritarian rule insofar as they neglect the importance of the single\nindividual’s ability “to make his personal opinion be\nheard and appreciated,” preferably in smaller publics, such as\nfamilies, schools, local communities (cited in L. Embree 1999, 271).\nOne could take Schutz’s thoughts here to converge with political\ntheories favoring what is today known as deliberative democracy.\nMoreover, his normative judgment against implementations of democracy\nthat increase the anonymity of citizens suggests that a parallel\nnormative, even ethical, dimension informs his many theoretic\nendeavors to retrieve from anonymity the neglected subjective\nviewpoint of actors, whether strangers, homecomers, victims of\ndiscrimination, or the “forgotten man” of social\nsciences.\n3.5 Phenomenology\n\nSchutz’s philosophical targeting of the social world had its\nrepercussions upon phenomenology, particularly in his critique near\nthe end of his career of Husserl’s account (also referred to as\na “transcendental constitution”) of how the other person\ncomes to appearance in consciousness. In “The Problem of\nTranscendental Intersubjectivity in Husserl,” Schutz first\nobjected when Husserl in his Fifth Cartesian Mediation prepared the\nground for the other’s appearance in consciousness by the\nmethodology of screening off everything that referred to other minds.\nHusserl had begun the Cartesian Meditations by reflectively\nabstaining from believing in the existence of what appeared in\nexperience in order to refrain from any dogmatic suppositions, but\nsince this first epoché, or phenomenological\nreduction, still left meanings with intersubjective references, the\nscreening off methodology, or second epoché, became\nnecessary. For Husserl, one’s actual or potential experiences\nof correlates that were not properly of the ego still would\nbelong to one’s sphere of ownness, but one had to seek to\nexclude any reference those correlates, as products of the\nsense-determining of other subjectivities, might have to those other\nsubjectivities. For Schutz, however, insofar as those experiences of\nwhat was not properly of the ego, supposedly confined within the\nsphere of ownness, had their origin in the intersubjective world of\neveryday life that higher level phenomenological reflection\npresupposed, it seemed difficult to see how one could exclude from\nsuch correlates any reference to the sense-determininng of other\nsubjectivities. It was as though Husserl was striving for a\ntheoretical detachment that the ontological origins of theory would\nnot allow. In addition, for Schutz the very consciousness of another\ninevitably instituted a relationship with her. Husserl’s\nargument in the Fifth Meditation continued by affirming that a\nnon-ratiocinative “pairing” occurred through which one\ntransferred the sense “another living body” to another.\nOne could then verify that the other’s living body was like\none’s own if it continued manifesting behavior congruent with\nwhat one would expect of a living body. Schutz challenged this\nsense-transfer, however, since one experienced the other’s body\nfrom the outside, unlike one’s own, which was given interiorly\n(but might the similarities suffice for the transfer?), and he\nsuggested that verification through what was “congruent”\nbehavior drew on social-world presuppositions of how bodies ought to\nbehave. Finally, he questioned whether the philosopher, refraining\nfrom belief in the existence of the world or others and entering into\na certain reflective solitude, could ever experience the\ntranscendental community of which Husserl spoke, since she only\nconstituted the world for herself and not for all other transcendental\negos. Intersubjectivity, Schutz concluded, was a matter of everyday\nlife to be simply described and not to be constituted within the\ntranscendental sphere of a self-reflective consciousness giving an\naccount of how the other comes to appearance. Just as Schutz had\nargued that the social world dictated the methods for its own social\nscientific investigation, so here it seemed to prescribe to\nphenomenology the approach appropriate to its description.\n\nIn the last thirteen years of his life, Schutz was preparing a\ncomprehensive phenomenology of the natural attitude, and one\nmanuscript, edited by Richard Zaner, was posthumously published as\nReflections on the Problem of Relevance, and another,\nco-authored by Thomas Luckmann, appeared as The Structures of the\nLife World. The former book distinguishes different sets of\ninterests, or relevances: topical (which focus attention on themes),\ninterpretive (which confer meanings on experiences or objects), and\nmotivational. Such relevances often involve a subject, with more or\nless systematic interests, or relevances, interacting with the world,\nand from this interaction between subject and world, it becomes\nevident what is “of relevance” to an actor. These\nrelevances, interdependent on each other and conjoined with\none’s system of types or categories, constitute a stock of\nknowledge, which Schutz examines in terms of its genesis and\nstructure. He further explores the meaning of one’s biographical\nsituation, including types and relevances, one’s body, and the\nontological constraints of space and time that, for instance, prevent\none from being at certain places at certain times or compel one to\nwait (for salt to dissolve in water).\n\nThe Structures of the Life-World represents a most complex\nand thorough restatement of many of the themes Schutz addressed\nthroughout his life. After a more general account of the life-world\nand its relation to the sciences, the book takes up its various\nstratifications, such as provinces of meaning, temporal and spatial\nzones of reach, and social structure. Schutz and Luckmann then comment\non the components of one’s stock of knowledge, including learned\nand non-learned elements, relevances and types, and trace the build-up\nof such a stock. The authors study the social conditioning of\none’s subjective stock of knowledge and inquire about the social\nstock of knowledge of a group and different possible combinations of\nknowledge distribution (generalized and specialized). They consider\nhow subjective knowledge becomes embodied in a social stock of\nknowledge and how the latter influences the former. In addition, the\nauthors pursue such issues as the structures of consciousness and\naction, the choosing of projects, rational action, and forms of social\naction, whether such action be unilateral or reciprocal, immediate or\nmediate. A final section analyzes the boundaries of experience,\ndifferent degrees of transcendencies (from simply bringing an object\nwithin reach to the experience of death), and the mechanisms for\ncrossing boundaries (e.g. symbols).\n4. The Schutzian Tradition\n\nIn the years after Schutz’s death in 1959, his works have been\nposthumously published and his thought expanded in several directions.\nPeter Berger and Thomas Luckmann wrote The Social Construction of\nReality, which focused on how subjective human processes\nconstruct objective structures that human subjectivity in turn\ninterprets and reacts to and which was among the most widely read\nbooks of social science in the twentieth century. Ilja Srubar\nemphasized the importance of the pragmatic dimensions of\nSchutz’s corpus, just as Hans-Georg Soeffner, along with Jochen\nDreher, has developed its symbolic aspects. On Schutzian grounds,\nLester Embree produced a theory of science in the model of a\nWissenschaftslehre, and George Psathas extended\nSchutz’s thought in the direction of ethnomethodology and\nconversation analysis. Recently, sociologists Hubert Knoblauch and\nCarlos Belvedere have shown the relevance of Schutz’s framework\nto communication theory and questions of social ontology,\nrespectively. The Austrian Economic School has continued to make use\nof Schutz’s works, as Daniela Griselda López has shown.\nLópez and Dreher have further argued that Schutzian theory can\nadequately account for the exercise of institutional power through the\ninterplay between objective structures and subjective\nmeaning-interpretation and the idea of relevances that are imposed\nupon agents. Michael Staudigl and George Berguno have edited a\ncollection of essays on the connection between the Schutzian approach\nand various hermeneutic traditions. And Staudigl and Michael Barber\nhave highlighted the connections between Schutz’s philosophy of\nmultiple realities and religion and humor. Furthermore, collections of\nessays have addressed the value of Schutz’s paradigm for music,\nliterature, and the arts. The work of Alfred Schutz opens a wide field\nthat is fruitful for addressing multiple themes and underpinning and\nsupporting multiple disciplines.\n\nIn 2016, the scholarly community in the Schutzian tradition\ncommemorated both the passing of Thomas Luckmann, one of\nSchutz’s renowned students who developed his thought in diverse\nways, and the fiftieth anniversary of the publication of The\nSocial Construction of Reality. These commemorations took place\nthrough the editing of three major collections: Social\nConstructivism as Paradigm?, Lebenswelttheorie und\nGesellschaftsanalyse, and Mathesis Universalis. While\nthese works focus on Luckmann’s work, including The\nStructures of the Life-World that Luckmann co-authored with\nSchutz, several of the essays address aspects of Schutz’s\nthought: the objective dimensions of societal institutions in contrast\nto interpretations of such institutions as subjectivistic and devoid\nof power-relationships (Eberle 2019, Knoblauch 2019, Mijić 2018,\nSrubar 2019); the possibility of a communicative construction of\nreality (Knoblauch 2019); the Schutzian paradigm’s preservation\nof agents’ potential to resist societal control in contrast to\nBourdieu’s account of habitus (Dreher 2019); the role\nof the body in We-relationships (Meyer 2018); the capacity of the\nSchutzian framework to account for resilience in the face of trauma\n(Endress 2021); inequality as imposed relevance (López 2021);\nspace and bodiliness as pertinent to the life-world as protosociology\n(Mijić 2018, Dörfler & Rothfuss 2021, Steets 2021);\ndegrees of freedom within Schutz’s relevance theory\n(Göttlich 2021); linkages between Schutz’s phenomenology\nand recent representatives of the Frankfurt School, such as Hartmut\nRosa (Gros 2021, Wannenmacher 2021); and the role of the life-world as\na mathesis universalis, that is, the ground-structure of all\nhuman experience that makes possible any comparison between cultures\nwithout reliance on the specific features of any one culture (Dreher\n2021, Meyer 2021, Sebald 2009).\n", "bibliography": {"categories": ["<a name=\"WorSch\">Works by Schutz</a>", "<a name=\"SecLit\">Secondary Literature</a>"], "cat_ref_text": {"<a name=\"WorSch\">Works by Schutz</a>": ["</h3>\n<ul class=\"hanging\">", "1932, <em>Der sinnhafte Aufbau der sozialen Welt: Eine Einleitung\nin die verstehenden Soziologie</em>, Vienna: Springer (also in 1960)\nand Frankfurt: Suhrkamp, 1974; English translation: <em>The\nPhenomenology of the Social World</em>, G. Walsh and F. Lehnert\n(trans.), Evanston: Northwestern University Press, 1967.", "1962, <em>Collected Papers I: The Problem of Social Reality</em>,\nMaurice Natanson (ed.), The Hague: Martinus Nijhoff.", "1964, <em>Collected Papers II: Studies in Social Theory</em>,\nArvid Brodersen (ed.), The Hague: Martinus Nijhoff.", "1966, <em>Collected Papers III: Studies in Phenomenological\nPhilosophy</em>, I. Schutz (ed.), The Hague: Martinus Nijhoff.", "1970, <em>On Phenomenology and Social Relations: Selected\nWritings</em>, H. Wagner (ed.), Chicago: University of Chicago\nPress.", "1971, <em>Reflections on the Problem of Relevance</em>, R.M. Zaner\n(ed.), New Haven: Yale University Press.", "1972, “Choice and the Social Sciences,” in Lester\nEmbree (ed.), <em>Life-World and Consciousness</em>, Evanston:\nNorthwestern University Press, 565–596.", "1973, (with T. Luckmann), <em>The Structures of the\nLife-World</em>, R.M. Zaner and T. Engelhardt (trans.), Evanston:\nNorthwestern University Press, and London: Heinemann; German edition:\n<em>Strukturen der Lebenswelt</em>, vol. 1, Neuwied: Luchterhand,\n1975; vol. 2: <em>The Structures of the Life-World</em>, R.M. Zaner\nand David J. Parent (trans.), Evanston: Northwestern University Press,\n1983; German edition: <em>Strukturen der Lebenswelt</em>, vol. 2,\nFrankfurt: Suhrkamp, 1984.", "1976, “Fragments on the Phenomenology of Music” in\n<em>In Search of Musical Method</em>, F.J. Smith (ed.), London, New\nYork, and Paris: Gordon and Breach Science Publishers,\n23–71.", "1978, (with T. Parsons), <em>The Theory of Social Action: The\nCorrespondence of Alfred Schutz and Talcott Parsons</em>, R. Grathoff\n(ed.), Bloomington and London: Indiana University Press; German\nedition: <em>Zur Theorie sozialen Handelns: Briefwechsel/Alfred\nSchutz, Talcott Parsons</em>, Frankfurt: Suhrkamp, 1977.", "1982, <em>Life Forms and Meaning Structure</em>, H. Wagner\n(trans., ed.), London: Routledge and Kegan Paul; German edition:\n<em>Theorie der Lebensformen</em>, I. Srubar (ed.), Frankfurt:\nSuhrkamp, 1981.", "1989, (with A. Gurwitsch), <em>Philosophers in Exile: The\nCorrespondence of</em> Alfred Schutz and Aron Gurwitsch,\n1939–1959, R. Grathoff (ed.), J.C. Evans (trans.), Bloomington\nand Indianapolis: Indiana University Press.", "1996, <em>Collected Papers IV</em>, H. Wagner and G. Psathas\n(eds.), in collaboration with F. Kersten, Dordrecht, Boston, London:\nKluwer Academic Publishers.", "1997, “Positivistic Philosophy and the Actual Approach of\nInterpretative Social Science: An Ineditum of Alfred Schutz from\nSpring 1953,” L. Embree (ed.), <em>Husserl Studies</em>, 14:\n123–149.", "1999, “Some Considerations concerning Thinking in Terms of\nBarriers,” “Memorandum (to Doctor Harold Lasswell),”\n“Report on the Discussions of Barrier to Equality of Opportunity\nfor the Development of Power of Social and Civil Judgment,”\n“Letter of Alfred Schutz to Clarence H. Faust, The Fund for the\nAdvancement of Education,” all in L. Embree, “The Ethical\nPolitical Side of Schutz: His Contributions at the 1956 Institute on\nEthics concerned with Barriers to Equality of Opportunity,” in\n<em>Schutzian Social Science</em>, L. Embree (ed.), Dordrecht, Boston,\nLondon: Kluwer Academic Publishing, 235–318.", "2003, <em>Theorie der Lebenswelt 1: Die pragmatische Schichtung\nder Lebenswelt</em>, M. Endress and I. Srubar (eds.), vol. 5,1:\n<em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G. Soeffner,\nand I. Srubar (eds.), Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.", "2003, <em>Theorie der Lebenswelt 2: Die kommunikative Ordnung der\nLebenswelt</em>, H. Knoblauch, R. Kurt, and H-G. Soeffner (eds.), vol.\n5,2: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar (eds.); Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.", "2004, (with Eric Voegelin), <em>Eine Freundschaft, die ein Leben\nausgehalten hat: Briefwechsel 1938–1959</em>, G. Wagner and G.\nWeiss (eds.), Konstanz: UVK Vergesellschaft, mbH. Translated as <em>A\nFriendship that Lasted a Lifetime: The Correspondence Between Alfred\nSchutz and Eric Voegelin</em>, 2011, G. Wagner and G. Weiss (eds.),\ntrans. W. Petropulos, Columbia: University of Missouri Press.", "2004, <em>Der sinnhafte Aufbau der sozialen Welt: Eine Einleitung\nin die verstehende Soziologie</em>, M. Endress and J. Renn (eds.), vol\n2: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar; Redaction, M. Endress (eds.), Konstanz: UVK\nVergesellschaft, mbH.", "2004, <em>Relevanz und Handeln 1: Zur Phänomenologie des\nAlltagswissens</em>, E. List (ed.), vol. 6,1: <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress, Konstanz: UVK Vergesellschaft, mbH.", "2005, <em>Philosophisch-phänomenologische Schriften 2:\nStudien zu Scheler, James, und Sartre</em>, H. Kellner und J. Renn\n(eds.), vol. 3,2: <em>Alfred Schütz Werkausgabe</em>, R.\nGrathoff, H-G. Soeffner, and I. Srubar (eds.); Redaction, M. Endress,\nKonstanz: UVK Vergesellschaft, mbH.", "2006, <em>Sinn und Zeit: Frühe Wiener Arbeiten und\nEntwürfe</em>, M. Michailow (ed.), vol. 1: <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress/G. Sebald, Konstanz: UVK Vergesellschaft,\nmbH.", "2009, <em>Philosophisch-phänomenologische Schriften 1: Zur\nKritik der Phänomenologie Edmund Husserls</em>, G. Sebald (ed.)\nin collaboration with R. Grathoff and T. Michael; Redaction, G.\nSebald, Konstanz: UVK Vergesellschaft, mbH.", "2009, “Private Family Journal of First Trip to the United\nStates of America,” Evelyn S. Lang (trans.), <em>Schutzian\nResearch</em>, 1: 245–271.", "2009, “Understanding, Self-reflection, and Equality: Alfred\nSchutz’s Participation in the 1955 Conference on Science,\nPhilosophy, and Religion,” ed. Michael Barber, <em>Schutzian\nResearch</em>, 1: 273–291.", "2009, <em>Philosophisch-phänomenologische Schriften 1: Zur\nKritik der Phänomenologie Edmund Husserls</em>, Gerd Sebald (ed.)\nbased on preliminary work by Richard Grathoff and Michael Thomas, vol.\n3,1: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar (eds.); Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.", "2010, <em>Zur Methodologie der Sozialwissenschaften</em>, Thomas\nS. Eberle, Jochen Dreher and Gerd Sebald (eds.), Vol 4: <em>Alfred\nSchütz Werkausgabe</em>, R. Grathoff, H-G. Soeffner, and I.\nSrubar (eds.); Redaction, M. Endress, Konstanz: UVK Vergesellschaft,\nmbH.", "2010, “The Problem of Transcendental Intersubjectivity in\nHusserl (with Comments of Dorion Cairns and Eugen Fink),” Fred\nKersten (trans.), <em>Schutzian Research</em>, 2: 9–51.", "2010, “Problems of a Sociology of Language”(Fall\nSemester, 1958), Fred Kersten (ed.), <em>Schutzian Research</em>, 2:\n53–105.", "2011, <em>Relevanz und Handeln 2: Fremdheit, Gesellschaftliches\nWissen und politisches Handeln</em>, Andreas Göttlich, Gerd\nSebald and Jan Weyand (eds.), Vol. 6(2): <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress, Konstanz: UVK Vergesellschaft, mbH.", "2011, <em>Collected Papers V. Phenomenology and the Social\nSciences</em>, Lester E. Embree (ed.), Dordrecht: Springer.", "2011, “Interview with Dr. Alfred Schutz,” (November\n20, 1958 New York City), Interviewed Bettina Bien Greaves,\n<em>Schutzian Research</em>, 3: 23–30.", "2011, (with Eric Voegelin) <em>A Friendship that Lasted a\nLifetime: The Correspondence between Alfred Schuetz and Eric\nVoegelin</em>, Gerhard Wagner and Gilbert Weiss (eds.), William\nPetropulos (trans), Columbia, Missouri: University of Missouri\nPress.", "2012, <em>Collected Papers VI. Literary Reality and\nRelationships</em>, Michael D. Barber (ed.), Dordrecht: Springer.", "2013, <em>Schriften zur Literatur</em>, Michael D. Barber and\nJochen Dreher (eds.), Vol. 8: <em>Alfred Schütz Werkausgabe</em>,\nR. Grathoff, H-G. Soeffner, and I. Srubar (eds.); Redaction, M.\nEndress, Konstanz: UVK Vergesellschaft, mbH.", "2013, “Fragment of a Phenomenology of Rhythm,” Gerd\nSebald and Jasmin Schreyer (transcription, ed., &amp; trans.),\n<em>Schutzian Research</em>, 5: 11–22.", "2016, <em>Schriften zur Musik</em>, Gerd Sebald and Andreas Georg\nStascheit (eds.), Vol. 7, <em>Alfred Schütz Werkausgabe</em>,\nH-G. Soeffner and I. Srubar (eds.); Redaction, M. Endress, Cologne:\nHerbert von Halem Verlag.\n</ul>\n<h3>"], "<a name=\"SecLit\">Secondary Literature</a>": ["</h3>\n<ul class=\"hanging\">", "Barber, M., 1989, <em>Social Typifications and the Elusive Other:\nThe Place of Sociology of Knowledge in Alfred Schutz’s\nPhenomenology</em>, Lewisburg: Bucknell University Press and London\nand Toronto: Associated University Presses.", "–––, 2004, <em>The Participating Citizen: A\nBiography of Alfred Schutz</em>, Albany: State University of New York\nPress.", "–––, 2017, <em>Religion and Humor as\nEmancipating Provinces of Meaning</em>, Dordrecht: Springer.", "Barber, M., and J. Dreher (eds.), 2014, <em>The Interrelation of\nPhenomenology, Social Sciences and the Arts</em>, Dordrecht:\nSpringer.", "Belvedere, C., 2016, “Lester Embree on Collective\nSubjects,” <em>Schutzian Research</em>, 9: 79–84.", "Belvedere, C. and A. Gros, 2019, “The Phenomenology of\nSocial Institutions in the Schutzian Tradition,” <em>Schutzian\nResearch</em>, 11: 43–74.", "Berger, P.L. and T. Luckmann, 1967, <em>The Social Construction of\nReality</em>, Garden City, New York: Doubleday Anchor.", "Bergson, H. 1889, <em>Essai sur les données de la\nconscience</em>, Paris: Félix Alcan; English translation:\n<em>Time and Free Will: An Essay on the Immediate Data of\nConsciousness</em>, trans. by F.L. Pogson, London: George Allen and\nUnwin, 1921.", "Bernstein, R.J., 1976, <em>The Restructuring of Social and\nPolitical Theory</em>, Oxford: Basil Blackwell.", "Brandom, R., 1994, <em>Making It Explicit</em>, Cambridge, Mass:\nHarvard University Press.", "Cox, R.R., 1978, <em>Schutz’s Theory of Relevance: A\nPhenomenological Critique</em>, The Hague: Martinus Nijhoff.", "Dörfler, T. and E. Rothfuss, 2021, “Sozialer Raum als\nvergessene Mathesis Universalis der Phänomenologie? Ein\nraum– und leibbezogene Perspektive auf die Strukturen der\nLebenswelt,” in <em>Mathesis Universalis</em>, J. Dreher (ed.),\nWiesbaden: Springer, 143–169.", "Dreher, J., 2011, “Alfred Schutz,” <em>The\nWiley-Blackwell Companion to Major Social Theorists</em>, Volume 1:\n<em>Classical Social Theorists</em>, G. Ritzer and J. Stepnisky\n(eds.), West Sussex: Wiley-Blackwell, 489–510.", "–––, 2019, “Oblivion of power? <em>The\nSocial Construction of Reality</em> and the (counter)-critique of\nPierre Bourdieu,” in <em>Social Constructivism as\nParadigm?</em>, M. Pfadenhauer and H. Knoblauch (eds.), London and New\nYork: Routledge, 235–250.", "–––, 2021, “Einleitung: Strukturen der\nLebenswelt als <em>mathesis universalis</em> der\nSozialwissenschaften,” in <em>Mathesis Universalis</em>, J.\nDreher (ed.), Wiesbaden: Springer, 1–11.", "––– (ed.), 2021, <em>Mathesis Universalis</em>:\n<em>Die Aktuelle Relevanz der</em> “<em>Strukturen der\nLebenswelt</em>,” Wiesbaden: Springer.", "Dreher, J., and D.G. López, 2014, <em>Fenomenología\ndel Poder</em>, Bogotá: Ediciones USTA.", "Dreher, J., and D.G. López, 2015, “Subjectivity and\nPower,” <em>Human Studies</em>, 38: 197–222.", "Eberle, T.S., 1984, <em>Sinnkonstitution in Alltag und\nWissenschaft: Der Beitrag der Phänomenologie und die Methodologie\nder Sozialwissenschaften</em>, Bern and Stuttgart: Paul Haupt.", "–––, 2019, “Variations of\nConstructivism,” in <em>Social Constructivism as Paradigm?</em>,\nM. Pfadenhauer and H. Knoblauch (ed.), London and New York: Routledge,\n131–151.", "Embree, L. (ed.), 1988, <em>Worldly Phenomenology: The Continuing\nInfluence of Alfred Schutz On North American Human Science</em>,\nWashington, D.C.: Center for Advanced Research in Phenomenology and\nUniversity Press of America.", "–––, 1999, “The Ethical-Political Side of\nSchutz: His Contributions at the 1956 Institute on Ethics concerned\nwith Barriers to Equality of Opportunity,” in <em>Schutzian\nSocial Science</em>, L. Embree (ed.), Dordrecht, Boston, London:\nKluwer Academic Publishers, 235–318.", "–––, 2013, <em>Alfred Schutz’s\n“Sociological Aspect of Literature”</em>, Dordrecht:\nSpringer.", "–––, 2015, <em>The Schutzian Theory of the\nCultural Sciences</em>, Dordrecht: Springer.", "––– and M. Barber (eds.), 2017, <em>The Golden\nAge of Phenomenology at the New School for Social Research,\n1954–1973</em>, Athens, Ohio: Ohio University Press.", "Endress, M., 2006, <em>Alfred Schütz</em>, Konstanz:\nUVK.", "–––, 2021, “Trauma: Schritte zu einer\nphänomenologisch–fundierten soziologischen Analyse,”\nin <em>Mathesis Universalis</em>, J. Dreher (ed.), Wiesbaden:\nSpringer, 211–246.", "Endress, M., G. Psathas, and H. Nasu (eds.), 2004,\n<em>Explorations of the Life-World: Continuing Dialogues with Alfred\nSchutz</em>, Dordrecht: Springer.", "Endress, M., and A. Hahn (eds.), 2018, <em>Lebenswelttheorie und\nGesellschaftsanalyse: Studium zum Werk von Thomas Luckmann</em>,\nKöln: Herbert van Halem.", "Göttlich, A., 2021,\n“Lebenswelt—Diskurs—Relevanz: Die Relevanztheorie\nvon Alfred Schütz als diskursanalytische Instrument,” in\n<em>Mathesis Universalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n171–194.", "Grathoff, R., 1989, <em>Milieu und Lebenswelt</em>, Frankfurt:\nSuhrkamp.", "–––, and B. Waldenfels, 1983,\n<em>Sozialität und Intersubjektivität:\nPhänomenologische Perspektiven der Sozialwissenschaften im\nUmkreis von Aron Gurwitsch und Alfred Schütz</em>, Munich:\nWilhelm Fink.", "Gros, A.E., 2021, “Die Beschleunigung der Lebenswelt: Alfred\nSchütz’ Beiträge zu einer Phänomenologie der\nspätmodernen Weltbeziehung,” in <em>Mathesis\nUniversalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n291–316.", "Gurwitsch, A., 1979, <em>Human Encounters in the Social\nWorld</em>, A. Métraux (ed.) and F. Kersten (trans.),\nPittsburgh: Duquesne University Press.", "Habermas, J., 1987, <em>The Theory of Communicative Action</em>, 2\nvols., trans. T. McCarthy, Boston: Beacon Press.", "–––, 1988, <em>On the Logic of the Social\nSciences</em>, S.W. Nicholsen and J. A. Stark (trans.), Cambridge,\nMass.: MIT Press.", "Husserl, E., 1969, <em>Formal and Transcendental Logic</em>,\ntrans. D.Cairns, The Hague: Martinus Nijhoff.", "–––, 1973, <em>Cartesian Meditations</em>, D.\nCairns (trans.), The Hague: Martinus Nijhoff.", "–––, 1973, <em>Experience and Judgment:\nInvestigations in a Genealogy of Logic</em>, L. Landgrebe (ed.), J. S.\nChurchill and K. Ameriks (trans.), Evanston: Northwestern University\nPress.", "–––, 1990, <em>On the Phenomenology of the\nConsciousness of Internal Time (1893–1917)</em>, J.B. Brough\n(trans.), Dordrecht, Boston, London: Kluwer Academic Publishers.", "James, W., 1893, <em>The Principles of Psychology</em>, 2 volumes,\nNew York: Henry Holt.", "Kersten, F., 1976, “Preface” to “Fragments on\nthe Phenomenology of Music” in <em>In Search of Musical\nMethod</em>, F.J. Smith (ed.), London, New York, and Paris: Gordon and\nBreach Science Publishers, 6–22.", "Knoblauch, H., 2013, “Alfred Schutz’s Theory of\nCommunicative Action,” <em>Human Studies</em>, 36:\n323–327.", "–––, 2019, “From the Social to the\nCommunicative Construction of Reality,” in <em>Social\nConstructivism as Paradigm?</em>, M. Pfadenhauer and H. Knoblauch\n(eds.), London and New York: Routledge, 275–291.", "List, E. and I. Srubar (eds.), 1988, <em>Alfred Schuütz :\nNeue Beiträge zur Rezeption seines Werkes</em>, Amsterdam :\nRodopi.", "López, D. G., 2016, “The Epistemic Claim to the\nLife-world: Alfred Schutz and the Debates of the Austrian School of\nEconomics,” <em>The Review of Austrian Economics</em>, 29:\n177–203.", "–––, 2021, “The Subjective Experience of\nInequality in Everyday Life: Contributions of Alfred Schutz’s\nPhenomenological Sociology,” in <em>Mathesis Universalis</em>,\nJ. Dreher (ed.), Wiesbaden: Springer, 195–210.", "Luckmann, T., 1983, <em>Life-World and Social Realities</em>,\nLondon: Heinemann.", "–––, 2007, <em>Lebenswelt, Identität, und\nGesellschaft</em>, Konstanz: UVK.", "McDowell, J., 1994, <em>Mind and World</em>, Cambridge, Mass:\nHarvard University Press.", "Meyer, C., 2018, “Die Leiblichkeit der Lebenswelt:\nKörper und vor-personale Socialität bei Thomas Luckmann und\nin kulturhistorischer Perspektive,” in <em>Lebenswelttheorie und\nGesellschaftsanalyse</em>, M. Endress and A. Hahn (eds.), Köln:\nHerbert von Halem, 100–127.", "–––, 2021, “Zwei anthropologische\nUniversalien in protosoziologische Zugriff,” in <em>Mathesis\nUniversalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n113–142.", "Miji&amp;cacute;, Ana, 2018, “Persönliche\nIdentität <em>Revisited</em>,” in <em>Lebenswelttheori und\nGesellschaftsanalyse</em>, M. Endress and A. Hahn (eds.), Köln:\nHerbert von Halem, 158–219.", "Mises, L. 1960, <em>Epistemological Problems of Economics</em>, G.\nReisman (trans.), Princeton, N. J: Van Nostrand.", "–––, 1966, <em>Human Action: A Treatise on\nEconomics</em>, Chicago: H. Regnery Co..", "Nasu, H., L. Embree, G. Psathas, and I. Srubar (eds.), 2009,\n<em>Alfred Schutz and His Intellectual Partners</em>, Konstanz: UVK\nVergesellschaft, mbH.", "Natanson, M., 1986, <em>Anonymity: A Study in the Philosophy of\nAlfred Schutz</em>, Bloomington, Indiana: Indiana University\nPress.", "O’Neill, J., 1974, <em>Making Sense Together: An\nIntroduction to Wild Sociology</em>, New York: Harper and Row.", "Parsons, Talcott, 1968, <em>The Structure of Social Action</em>, 2\nvolumes, New York: The Free Press.", "Pfandenhauer, M. and Knoblauch, H. (eds.), 2019, <em>Social\nConstructivism as Paradigm?: The Legacy of</em> The Social\nConstruction of Reality, London and New York: Routledge.", "Salice, A. and H.B. Schmid (eds.), 2016, <em>The Phenomenological\nApproach to Social Reality: History, Concepts, Problems</em>,\nDordrecht: Springer.", "Sanna, G.L., 2007, <em>Realizzazione etica del sé in Alfred\nSchütz: Tra pragmatismo e fenomenologia</em>, Rome: Armando.", "Santayana, G., 1951, <em>Dominations and Powers : Reflections on\nLiberty, Society, and Government</em>, New York : C. Scribner’s\nSons.", "Sartre, J-P., 1956, <em>Being and Nothingness: An Essay on\nPhenomenological Ontology</em>, H. Barnes (trans.), New York:\nPhilosophical Library.", "Scheler, M., 1954, <em>The Nature of Sympathy</em>, P. Heath\n(trans.), New Haven: Yale University Press.", "Sebald, G., 2009, “Einleitung des Herausgebers,” in\nAlfred Schutz, <em>Alfred Schütz Werkausgabe</em> (Volume 3.1),\n<em>Philosophische–phänomenologische Schriften: Zur Kritik\nder Phänomenologie Edmund Husserls</em>, G. Sebald (ed.),\nKonstanz: UVK, 9–45.", "Sellars, W., 1956, “Does Empirical Knowledge Have a\nFoundation?” in H. Feigl and M. Scriben (eds.), <em>The\nFoundations of Science and the Concepts of Psychology and\nPsychoanalysis</em> (Minnesota Studies in the Philosophy of Science:\nVolume 1), Minneapolis: University of Minnesota Press,\n293–300.", "Soeffner, H.G., 1997, <em>The World of Rituals: The Interpretation\nof Everyday Life</em>, New Brunswick: Transaction Press.", "Sprondel, W. M. and R. Grathoff (eds.), 1979, <em>Alfred Schutz\nund die Idee des Alltags in den Sozialwissenschaften</em>, Stuttgart:\nFerdinand Enke.", "Srubar, I., 1988, <em>Kosmion, Die Genese der pragmatischen\nLebenswelttheorie von Alfred Schütz und ihr anthropologischer\nHintergrund</em>, Frankfurt: Suhrkamp.", "–––, 2007, <em>Phänomenologie und\nsoziologische Theorie: Aufsätze zur pragmatischen\nLebenswelttheorie</em>, Wiesbaden: VS, Verlag für\nSocialwissenschaften/GWV Fachverlage GmbH.", "–––, 2019,“Autogenesis and Autopoiesis: On\nthe Emergence of Social Reality in Social and Radical\nConstructivism,” in <em>Social Constructivism as Paradigm?</em>,\nM. Pfandenhauer and H. Knoblauch (eds.), London and New York:\nRoutledge, 207–215.", "Staudigl, M., 2017, “Alfred Schutz and Phenomenology of\nReligion: Explorations into Ambiguous Territory,” <em>Human\nStudies</em>, 40: 491–499.", "––– and G. Berguno (eds.), 2014, <em>Schutzian\nPhenomenology and Hermeneutic Traditions</em>, Dordrecht:\nSpringer.", "Steets, S., 2021, “Die Dualität von Leib und die\nStrukturen der Lebenswelt,” in <em>Mathesis Universalis</em>, J.\nDreher (ed.), Wiesbaden: Springer, 97–112.", "Strassheim, J., 2016, “Type and Spontaneity: Beyond Alfred\nSchutz’s Theory of the Social World,” <em>Human\nStudies</em>, 39: 493–512.", "Ten Have, P. and G. Psathas (eds.), 1995, <em>Situated Order:\nStudies in the Social Organization of Talk and Embodied\nActivities</em> (<em>Studies in Ethnomethodology and Conversational\nAnalysis</em>: Number 3), Washington, D.C.: International Institute\nfor Ethnometholodology and Conversation Analysis and University Press\nof America.", "Thomason, B.C., 1983, <em>Making Sense of Reification: Alfred\nSchutz and Constructionist Theory</em>, London: Macmillan.", "Vaitkus, S., 1983, <em>How is Society Possible?</em>, Dordrecht,\nBoston, and London: Kluwer Academic Publishers.", "Voegelin, E., 1952, <em>The New Science of Politics: An\nIntroduction</em>, Chicago: University of Chicago Press.", "Wagner, H. R., 1983, <em>Alfred Schutz: An\nIntellectualBiography</em>, Chicago: University of Chicago Press.", "–––, with I. Srubar, 1983, <em>A Bergsonian\nBridge to Phenomenological Psychology</em>, Edmonton: University of\nAlberta Press.", "Waldenfels, B., 1971, <em>Das Zwischenreich des Dialogs:\nSozialphilosophische Untersuchungen in Anschluss an Edmund\nHusserl</em>, The Hague: Martinus Nijhoff.", "Wannenmacher, B., 2021, “Alfred Schütz’\n‘Strukturen der Lebenswelt’ und kritische Theorie: Auf die\nSuche nach Schnittstellung,” in <em>Mathesis Universalis</em>,\nJ. Dreher (ed.), Wiesbaden: Springer, 271–290.", "Webb, R.B., 1976, <em>The Presence of the Past: John Dewey and\nAlfred Schutz on the Genesis and Organization of Experience</em>,\nGainesville: University Presses of Florida.", "Weber, M., 1978, <em>Economy and Society: An Outline of\nInterpretive Sociology</em>, E. Fischoff, et al. (trans.), G. Roth and\nC. Wittich (eds.), 2 volumes, Berkeley: University of California\nPress.", "–––, 1958, <em>The Protestant Ethic and the\nSpirit of Capitalism</em>, T. Parsons (trans.), New York:\nScribners.", "Williame, R., 1973, <em>Les Fondements\nPhénoménologiques de la Sociologie Comprehénsive:\nAlfred Schutz et Max Weber</em>, The Hague: Martinus Nijhoff.", "Wolff, Kurt (ed.), 1984, <em>Alfred Schutz: Appraisals and\nDevelopments</em>, Dordrecht: Martinus Nijhoff.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"WorSch\">Works by Schutz</a></h3>\n<ul class=\"hanging\">\n<li>1932, <em>Der sinnhafte Aufbau der sozialen Welt: Eine Einleitung\nin die verstehenden Soziologie</em>, Vienna: Springer (also in 1960)\nand Frankfurt: Suhrkamp, 1974; English translation: <em>The\nPhenomenology of the Social World</em>, G. Walsh and F. Lehnert\n(trans.), Evanston: Northwestern University Press, 1967.</li>\n<li>1962, <em>Collected Papers I: The Problem of Social Reality</em>,\nMaurice Natanson (ed.), The Hague: Martinus Nijhoff.</li>\n<li>1964, <em>Collected Papers II: Studies in Social Theory</em>,\nArvid Brodersen (ed.), The Hague: Martinus Nijhoff.</li>\n<li>1966, <em>Collected Papers III: Studies in Phenomenological\nPhilosophy</em>, I. Schutz (ed.), The Hague: Martinus Nijhoff.</li>\n<li>1970, <em>On Phenomenology and Social Relations: Selected\nWritings</em>, H. Wagner (ed.), Chicago: University of Chicago\nPress.</li>\n<li>1971, <em>Reflections on the Problem of Relevance</em>, R.M. Zaner\n(ed.), New Haven: Yale University Press.</li>\n<li>1972, “Choice and the Social Sciences,” in Lester\nEmbree (ed.), <em>Life-World and Consciousness</em>, Evanston:\nNorthwestern University Press, 565–596.</li>\n<li>1973, (with T. Luckmann), <em>The Structures of the\nLife-World</em>, R.M. Zaner and T. Engelhardt (trans.), Evanston:\nNorthwestern University Press, and London: Heinemann; German edition:\n<em>Strukturen der Lebenswelt</em>, vol. 1, Neuwied: Luchterhand,\n1975; vol. 2: <em>The Structures of the Life-World</em>, R.M. Zaner\nand David J. Parent (trans.), Evanston: Northwestern University Press,\n1983; German edition: <em>Strukturen der Lebenswelt</em>, vol. 2,\nFrankfurt: Suhrkamp, 1984.</li>\n<li>1976, “Fragments on the Phenomenology of Music” in\n<em>In Search of Musical Method</em>, F.J. Smith (ed.), London, New\nYork, and Paris: Gordon and Breach Science Publishers,\n23–71.</li>\n<li>1978, (with T. Parsons), <em>The Theory of Social Action: The\nCorrespondence of Alfred Schutz and Talcott Parsons</em>, R. Grathoff\n(ed.), Bloomington and London: Indiana University Press; German\nedition: <em>Zur Theorie sozialen Handelns: Briefwechsel/Alfred\nSchutz, Talcott Parsons</em>, Frankfurt: Suhrkamp, 1977.</li>\n<li>1982, <em>Life Forms and Meaning Structure</em>, H. Wagner\n(trans., ed.), London: Routledge and Kegan Paul; German edition:\n<em>Theorie der Lebensformen</em>, I. Srubar (ed.), Frankfurt:\nSuhrkamp, 1981.</li>\n<li>1989, (with A. Gurwitsch), <em>Philosophers in Exile: The\nCorrespondence of</em> Alfred Schutz and Aron Gurwitsch,\n1939–1959, R. Grathoff (ed.), J.C. Evans (trans.), Bloomington\nand Indianapolis: Indiana University Press.</li>\n<li>1996, <em>Collected Papers IV</em>, H. Wagner and G. Psathas\n(eds.), in collaboration with F. Kersten, Dordrecht, Boston, London:\nKluwer Academic Publishers.</li>\n<li>1997, “Positivistic Philosophy and the Actual Approach of\nInterpretative Social Science: An Ineditum of Alfred Schutz from\nSpring 1953,” L. Embree (ed.), <em>Husserl Studies</em>, 14:\n123–149.</li>\n<li>1999, “Some Considerations concerning Thinking in Terms of\nBarriers,” “Memorandum (to Doctor Harold Lasswell),”\n“Report on the Discussions of Barrier to Equality of Opportunity\nfor the Development of Power of Social and Civil Judgment,”\n“Letter of Alfred Schutz to Clarence H. Faust, The Fund for the\nAdvancement of Education,” all in L. Embree, “The Ethical\nPolitical Side of Schutz: His Contributions at the 1956 Institute on\nEthics concerned with Barriers to Equality of Opportunity,” in\n<em>Schutzian Social Science</em>, L. Embree (ed.), Dordrecht, Boston,\nLondon: Kluwer Academic Publishing, 235–318.</li>\n<li>2003, <em>Theorie der Lebenswelt 1: Die pragmatische Schichtung\nder Lebenswelt</em>, M. Endress and I. Srubar (eds.), vol. 5,1:\n<em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G. Soeffner,\nand I. Srubar (eds.), Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.</li>\n<li>2003, <em>Theorie der Lebenswelt 2: Die kommunikative Ordnung der\nLebenswelt</em>, H. Knoblauch, R. Kurt, and H-G. Soeffner (eds.), vol.\n5,2: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar (eds.); Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.</li>\n<li>2004, (with Eric Voegelin), <em>Eine Freundschaft, die ein Leben\nausgehalten hat: Briefwechsel 1938–1959</em>, G. Wagner and G.\nWeiss (eds.), Konstanz: UVK Vergesellschaft, mbH. Translated as <em>A\nFriendship that Lasted a Lifetime: The Correspondence Between Alfred\nSchutz and Eric Voegelin</em>, 2011, G. Wagner and G. Weiss (eds.),\ntrans. W. Petropulos, Columbia: University of Missouri Press.</li>\n<li>2004, <em>Der sinnhafte Aufbau der sozialen Welt: Eine Einleitung\nin die verstehende Soziologie</em>, M. Endress and J. Renn (eds.), vol\n2: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar; Redaction, M. Endress (eds.), Konstanz: UVK\nVergesellschaft, mbH.</li>\n<li>2004, <em>Relevanz und Handeln 1: Zur Phänomenologie des\nAlltagswissens</em>, E. List (ed.), vol. 6,1: <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress, Konstanz: UVK Vergesellschaft, mbH.</li>\n<li>2005, <em>Philosophisch-phänomenologische Schriften 2:\nStudien zu Scheler, James, und Sartre</em>, H. Kellner und J. Renn\n(eds.), vol. 3,2: <em>Alfred Schütz Werkausgabe</em>, R.\nGrathoff, H-G. Soeffner, and I. Srubar (eds.); Redaction, M. Endress,\nKonstanz: UVK Vergesellschaft, mbH.</li>\n<li>2006, <em>Sinn und Zeit: Frühe Wiener Arbeiten und\nEntwürfe</em>, M. Michailow (ed.), vol. 1: <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress/G. Sebald, Konstanz: UVK Vergesellschaft,\nmbH.</li>\n<li>2009, <em>Philosophisch-phänomenologische Schriften 1: Zur\nKritik der Phänomenologie Edmund Husserls</em>, G. Sebald (ed.)\nin collaboration with R. Grathoff and T. Michael; Redaction, G.\nSebald, Konstanz: UVK Vergesellschaft, mbH.</li>\n<li>2009, “Private Family Journal of First Trip to the United\nStates of America,” Evelyn S. Lang (trans.), <em>Schutzian\nResearch</em>, 1: 245–271.</li>\n<li>2009, “Understanding, Self-reflection, and Equality: Alfred\nSchutz’s Participation in the 1955 Conference on Science,\nPhilosophy, and Religion,” ed. Michael Barber, <em>Schutzian\nResearch</em>, 1: 273–291.</li>\n<li>2009, <em>Philosophisch-phänomenologische Schriften 1: Zur\nKritik der Phänomenologie Edmund Husserls</em>, Gerd Sebald (ed.)\nbased on preliminary work by Richard Grathoff and Michael Thomas, vol.\n3,1: <em>Alfred Schütz Werkausgabe</em>, R. Grathoff, H-G.\nSoeffner, and I. Srubar (eds.); Redaction, M. Endress, Konstanz: UVK\nVergesellschaft, mbH.</li>\n<li>2010, <em>Zur Methodologie der Sozialwissenschaften</em>, Thomas\nS. Eberle, Jochen Dreher and Gerd Sebald (eds.), Vol 4: <em>Alfred\nSchütz Werkausgabe</em>, R. Grathoff, H-G. Soeffner, and I.\nSrubar (eds.); Redaction, M. Endress, Konstanz: UVK Vergesellschaft,\nmbH.</li>\n<li>2010, “The Problem of Transcendental Intersubjectivity in\nHusserl (with Comments of Dorion Cairns and Eugen Fink),” Fred\nKersten (trans.), <em>Schutzian Research</em>, 2: 9–51.</li>\n<li>2010, “Problems of a Sociology of Language”(Fall\nSemester, 1958), Fred Kersten (ed.), <em>Schutzian Research</em>, 2:\n53–105.</li>\n<li>2011, <em>Relevanz und Handeln 2: Fremdheit, Gesellschaftliches\nWissen und politisches Handeln</em>, Andreas Göttlich, Gerd\nSebald and Jan Weyand (eds.), Vol. 6(2): <em>Alfred Schütz\nWerkausgabe</em>, R. Grathoff, H-G. Soeffner, and I. Srubar (eds.);\nRedaction, M. Endress, Konstanz: UVK Vergesellschaft, mbH.</li>\n<li>2011, <em>Collected Papers V. Phenomenology and the Social\nSciences</em>, Lester E. Embree (ed.), Dordrecht: Springer.</li>\n<li>2011, “Interview with Dr. Alfred Schutz,” (November\n20, 1958 New York City), Interviewed Bettina Bien Greaves,\n<em>Schutzian Research</em>, 3: 23–30.</li>\n<li> 2011, (with Eric Voegelin) <em>A Friendship that Lasted a\nLifetime: The Correspondence between Alfred Schuetz and Eric\nVoegelin</em>, Gerhard Wagner and Gilbert Weiss (eds.), William\nPetropulos (trans), Columbia, Missouri: University of Missouri\nPress.</li>\n<li>2012, <em>Collected Papers VI. Literary Reality and\nRelationships</em>, Michael D. Barber (ed.), Dordrecht: Springer.</li>\n<li>2013, <em>Schriften zur Literatur</em>, Michael D. Barber and\nJochen Dreher (eds.), Vol. 8: <em>Alfred Schütz Werkausgabe</em>,\nR. Grathoff, H-G. Soeffner, and I. Srubar (eds.); Redaction, M.\nEndress, Konstanz: UVK Vergesellschaft, mbH.</li>\n<li>2013, “Fragment of a Phenomenology of Rhythm,” Gerd\nSebald and Jasmin Schreyer (transcription, ed., &amp; trans.),\n<em>Schutzian Research</em>, 5: 11–22.</li>\n<li>2016, <em>Schriften zur Musik</em>, Gerd Sebald and Andreas Georg\nStascheit (eds.), Vol. 7, <em>Alfred Schütz Werkausgabe</em>,\nH-G. Soeffner and I. Srubar (eds.); Redaction, M. Endress, Cologne:\nHerbert von Halem Verlag.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Barber, M., 1989, <em>Social Typifications and the Elusive Other:\nThe Place of Sociology of Knowledge in Alfred Schutz’s\nPhenomenology</em>, Lewisburg: Bucknell University Press and London\nand Toronto: Associated University Presses.</li>\n<li>–––, 2004, <em>The Participating Citizen: A\nBiography of Alfred Schutz</em>, Albany: State University of New York\nPress.</li>\n<li>–––, 2017, <em>Religion and Humor as\nEmancipating Provinces of Meaning</em>, Dordrecht: Springer.</li>\n<li>Barber, M., and J. Dreher (eds.), 2014, <em>The Interrelation of\nPhenomenology, Social Sciences and the Arts</em>, Dordrecht:\nSpringer.</li>\n<li>Belvedere, C., 2016, “Lester Embree on Collective\nSubjects,” <em>Schutzian Research</em>, 9: 79–84.</li>\n<li>Belvedere, C. and A. Gros, 2019, “The Phenomenology of\nSocial Institutions in the Schutzian Tradition,” <em>Schutzian\nResearch</em>, 11: 43–74.</li>\n<li>Berger, P.L. and T. Luckmann, 1967, <em>The Social Construction of\nReality</em>, Garden City, New York: Doubleday Anchor.</li>\n<li>Bergson, H. 1889, <em>Essai sur les données de la\nconscience</em>, Paris: Félix Alcan; English translation:\n<em>Time and Free Will: An Essay on the Immediate Data of\nConsciousness</em>, trans. by F.L. Pogson, London: George Allen and\nUnwin, 1921.</li>\n<li>Bernstein, R.J., 1976, <em>The Restructuring of Social and\nPolitical Theory</em>, Oxford: Basil Blackwell.</li>\n<li>Brandom, R., 1994, <em>Making It Explicit</em>, Cambridge, Mass:\nHarvard University Press.</li>\n<li>Cox, R.R., 1978, <em>Schutz’s Theory of Relevance: A\nPhenomenological Critique</em>, The Hague: Martinus Nijhoff.</li>\n<li>Dörfler, T. and E. Rothfuss, 2021, “Sozialer Raum als\nvergessene Mathesis Universalis der Phänomenologie? Ein\nraum– und leibbezogene Perspektive auf die Strukturen der\nLebenswelt,” in <em>Mathesis Universalis</em>, J. Dreher (ed.),\nWiesbaden: Springer, 143–169.</li>\n<li>Dreher, J., 2011, “Alfred Schutz,” <em>The\nWiley-Blackwell Companion to Major Social Theorists</em>, Volume 1:\n<em>Classical Social Theorists</em>, G. Ritzer and J. Stepnisky\n(eds.), West Sussex: Wiley-Blackwell, 489–510.</li>\n<li>–––, 2019, “Oblivion of power? <em>The\nSocial Construction of Reality</em> and the (counter)-critique of\nPierre Bourdieu,” in <em>Social Constructivism as\nParadigm?</em>, M. Pfadenhauer and H. Knoblauch (eds.), London and New\nYork: Routledge, 235–250.</li>\n<li>–––, 2021, “Einleitung: Strukturen der\nLebenswelt als <em>mathesis universalis</em> der\nSozialwissenschaften,” in <em>Mathesis Universalis</em>, J.\nDreher (ed.), Wiesbaden: Springer, 1–11.</li>\n<li>––– (ed.), 2021, <em>Mathesis Universalis</em>:\n<em>Die Aktuelle Relevanz der</em> “<em>Strukturen der\nLebenswelt</em>,” Wiesbaden: Springer.</li>\n<li>Dreher, J., and D.G. López, 2014, <em>Fenomenología\ndel Poder</em>, Bogotá: Ediciones USTA.</li>\n<li>Dreher, J., and D.G. López, 2015, “Subjectivity and\nPower,” <em>Human Studies</em>, 38: 197–222.</li>\n<li>Eberle, T.S., 1984, <em>Sinnkonstitution in Alltag und\nWissenschaft: Der Beitrag der Phänomenologie und die Methodologie\nder Sozialwissenschaften</em>, Bern and Stuttgart: Paul Haupt.</li>\n<li>–––, 2019, “Variations of\nConstructivism,” in <em>Social Constructivism as Paradigm?</em>,\nM. Pfadenhauer and H. Knoblauch (ed.), London and New York: Routledge,\n131–151.</li>\n<li>Embree, L. (ed.), 1988, <em>Worldly Phenomenology: The Continuing\nInfluence of Alfred Schutz On North American Human Science</em>,\nWashington, D.C.: Center for Advanced Research in Phenomenology and\nUniversity Press of America.</li>\n<li>–––, 1999, “The Ethical-Political Side of\nSchutz: His Contributions at the 1956 Institute on Ethics concerned\nwith Barriers to Equality of Opportunity,” in <em>Schutzian\nSocial Science</em>, L. Embree (ed.), Dordrecht, Boston, London:\nKluwer Academic Publishers, 235–318.</li>\n<li>–––, 2013, <em>Alfred Schutz’s\n“Sociological Aspect of Literature”</em>, Dordrecht:\nSpringer.</li>\n<li>–––, 2015, <em>The Schutzian Theory of the\nCultural Sciences</em>, Dordrecht: Springer.</li>\n<li>––– and M. Barber (eds.), 2017, <em>The Golden\nAge of Phenomenology at the New School for Social Research,\n1954–1973</em>, Athens, Ohio: Ohio University Press.</li>\n<li>Endress, M., 2006, <em>Alfred Schütz</em>, Konstanz:\nUVK.</li>\n<li>–––, 2021, “Trauma: Schritte zu einer\nphänomenologisch–fundierten soziologischen Analyse,”\nin <em>Mathesis Universalis</em>, J. Dreher (ed.), Wiesbaden:\nSpringer, 211–246.</li>\n<li>Endress, M., G. Psathas, and H. Nasu (eds.), 2004,\n<em>Explorations of the Life-World: Continuing Dialogues with Alfred\nSchutz</em>, Dordrecht: Springer.</li>\n<li>Endress, M., and A. Hahn (eds.), 2018, <em>Lebenswelttheorie und\nGesellschaftsanalyse: Studium zum Werk von Thomas Luckmann</em>,\nKöln: Herbert van Halem.</li>\n<li>Göttlich, A., 2021,\n“Lebenswelt—Diskurs—Relevanz: Die Relevanztheorie\nvon Alfred Schütz als diskursanalytische Instrument,” in\n<em>Mathesis Universalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n171–194.</li>\n<li>Grathoff, R., 1989, <em>Milieu und Lebenswelt</em>, Frankfurt:\nSuhrkamp.</li>\n<li>–––, and B. Waldenfels, 1983,\n<em>Sozialität und Intersubjektivität:\nPhänomenologische Perspektiven der Sozialwissenschaften im\nUmkreis von Aron Gurwitsch und Alfred Schütz</em>, Munich:\nWilhelm Fink.</li>\n<li>Gros, A.E., 2021, “Die Beschleunigung der Lebenswelt: Alfred\nSchütz’ Beiträge zu einer Phänomenologie der\nspätmodernen Weltbeziehung,” in <em>Mathesis\nUniversalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n291–316.</li>\n<li>Gurwitsch, A., 1979, <em>Human Encounters in the Social\nWorld</em>, A. Métraux (ed.) and F. Kersten (trans.),\nPittsburgh: Duquesne University Press.</li>\n<li>Habermas, J., 1987, <em>The Theory of Communicative Action</em>, 2\nvols., trans. T. McCarthy, Boston: Beacon Press.</li>\n<li>–––, 1988, <em>On the Logic of the Social\nSciences</em>, S.W. Nicholsen and J. A. Stark (trans.), Cambridge,\nMass.: MIT Press.</li>\n<li>Husserl, E., 1969, <em>Formal and Transcendental Logic</em>,\ntrans. D.Cairns, The Hague: Martinus Nijhoff.</li>\n<li>–––, 1973, <em>Cartesian Meditations</em>, D.\nCairns (trans.), The Hague: Martinus Nijhoff.</li>\n<li>–––, 1973, <em>Experience and Judgment:\nInvestigations in a Genealogy of Logic</em>, L. Landgrebe (ed.), J. S.\nChurchill and K. Ameriks (trans.), Evanston: Northwestern University\nPress.</li>\n<li>–––, 1990, <em>On the Phenomenology of the\nConsciousness of Internal Time (1893–1917)</em>, J.B. Brough\n(trans.), Dordrecht, Boston, London: Kluwer Academic Publishers.</li>\n<li>James, W., 1893, <em>The Principles of Psychology</em>, 2 volumes,\nNew York: Henry Holt.</li>\n<li>Kersten, F., 1976, “Preface” to “Fragments on\nthe Phenomenology of Music” in <em>In Search of Musical\nMethod</em>, F.J. Smith (ed.), London, New York, and Paris: Gordon and\nBreach Science Publishers, 6–22.</li>\n<li>Knoblauch, H., 2013, “Alfred Schutz’s Theory of\nCommunicative Action,” <em>Human Studies</em>, 36:\n323–327.</li>\n<li>–––, 2019, “From the Social to the\nCommunicative Construction of Reality,” in <em>Social\nConstructivism as Paradigm?</em>, M. Pfadenhauer and H. Knoblauch\n(eds.), London and New York: Routledge, 275–291.</li>\n<li>List, E. and I. Srubar (eds.), 1988, <em>Alfred Schuütz :\nNeue Beiträge zur Rezeption seines Werkes</em>, Amsterdam :\nRodopi.</li>\n<li>López, D. G., 2016, “The Epistemic Claim to the\nLife-world: Alfred Schutz and the Debates of the Austrian School of\nEconomics,” <em>The Review of Austrian Economics</em>, 29:\n177–203.</li>\n<li>–––, 2021, “The Subjective Experience of\nInequality in Everyday Life: Contributions of Alfred Schutz’s\nPhenomenological Sociology,” in <em>Mathesis Universalis</em>,\nJ. Dreher (ed.), Wiesbaden: Springer, 195–210.</li>\n<li>Luckmann, T., 1983, <em>Life-World and Social Realities</em>,\nLondon: Heinemann.</li>\n<li>–––, 2007, <em>Lebenswelt, Identität, und\nGesellschaft</em>, Konstanz: UVK.</li>\n<li>McDowell, J., 1994, <em>Mind and World</em>, Cambridge, Mass:\nHarvard University Press.</li>\n<li>Meyer, C., 2018, “Die Leiblichkeit der Lebenswelt:\nKörper und vor-personale Socialität bei Thomas Luckmann und\nin kulturhistorischer Perspektive,” in <em>Lebenswelttheorie und\nGesellschaftsanalyse</em>, M. Endress and A. Hahn (eds.), Köln:\nHerbert von Halem, 100–127.</li>\n<li>–––, 2021, “Zwei anthropologische\nUniversalien in protosoziologische Zugriff,” in <em>Mathesis\nUniversalis</em>, J. Dreher (ed.), Wiesbaden: Springer,\n113–142.</li>\n<li>Miji&amp;cacute;, Ana, 2018, “Persönliche\nIdentität <em>Revisited</em>,” in <em>Lebenswelttheori und\nGesellschaftsanalyse</em>, M. Endress and A. Hahn (eds.), Köln:\nHerbert von Halem, 158–219.</li>\n<li>Mises, L. 1960, <em>Epistemological Problems of Economics</em>, G.\nReisman (trans.), Princeton, N. J: Van Nostrand.</li>\n<li>–––, 1966, <em>Human Action: A Treatise on\nEconomics</em>, Chicago: H. Regnery Co..</li>\n<li>Nasu, H., L. Embree, G. Psathas, and I. Srubar (eds.), 2009,\n<em>Alfred Schutz and His Intellectual Partners</em>, Konstanz: UVK\nVergesellschaft, mbH.</li>\n<li>Natanson, M., 1986, <em>Anonymity: A Study in the Philosophy of\nAlfred Schutz</em>, Bloomington, Indiana: Indiana University\nPress.</li>\n<li>O’Neill, J., 1974, <em>Making Sense Together: An\nIntroduction to Wild Sociology</em>, New York: Harper and Row.</li>\n<li>Parsons, Talcott, 1968, <em>The Structure of Social Action</em>, 2\nvolumes, New York: The Free Press.</li>\n<li>Pfandenhauer, M. and Knoblauch, H. (eds.), 2019, <em>Social\nConstructivism as Paradigm?: The Legacy of</em> The Social\nConstruction of Reality, London and New York: Routledge.</li>\n<li>Salice, A. and H.B. Schmid (eds.), 2016, <em>The Phenomenological\nApproach to Social Reality: History, Concepts, Problems</em>,\nDordrecht: Springer.</li>\n<li>Sanna, G.L., 2007, <em>Realizzazione etica del sé in Alfred\nSchütz: Tra pragmatismo e fenomenologia</em>, Rome: Armando.</li>\n<li>Santayana, G., 1951, <em>Dominations and Powers : Reflections on\nLiberty, Society, and Government</em>, New York : C. Scribner’s\nSons.</li>\n<li>Sartre, J-P., 1956, <em>Being and Nothingness: An Essay on\nPhenomenological Ontology</em>, H. Barnes (trans.), New York:\nPhilosophical Library.</li>\n<li>Scheler, M., 1954, <em>The Nature of Sympathy</em>, P. Heath\n(trans.), New Haven: Yale University Press.</li>\n<li>Sebald, G., 2009, “Einleitung des Herausgebers,” in\nAlfred Schutz, <em>Alfred Schütz Werkausgabe</em> (Volume 3.1),\n<em>Philosophische–phänomenologische Schriften: Zur Kritik\nder Phänomenologie Edmund Husserls</em>, G. Sebald (ed.),\nKonstanz: UVK, 9–45.</li>\n<li>Sellars, W., 1956, “Does Empirical Knowledge Have a\nFoundation?” in H. Feigl and M. Scriben (eds.), <em>The\nFoundations of Science and the Concepts of Psychology and\nPsychoanalysis</em> (Minnesota Studies in the Philosophy of Science:\nVolume 1), Minneapolis: University of Minnesota Press,\n293–300.</li>\n<li>Soeffner, H.G., 1997, <em>The World of Rituals: The Interpretation\nof Everyday Life</em>, New Brunswick: Transaction Press.</li>\n<li>Sprondel, W. M. and R. Grathoff (eds.), 1979, <em>Alfred Schutz\nund die Idee des Alltags in den Sozialwissenschaften</em>, Stuttgart:\nFerdinand Enke.</li>\n<li>Srubar, I., 1988, <em>Kosmion, Die Genese der pragmatischen\nLebenswelttheorie von Alfred Schütz und ihr anthropologischer\nHintergrund</em>, Frankfurt: Suhrkamp.</li>\n<li>–––, 2007, <em>Phänomenologie und\nsoziologische Theorie: Aufsätze zur pragmatischen\nLebenswelttheorie</em>, Wiesbaden: VS, Verlag für\nSocialwissenschaften/GWV Fachverlage GmbH.</li>\n<li>–––, 2019,“Autogenesis and Autopoiesis: On\nthe Emergence of Social Reality in Social and Radical\nConstructivism,” in <em>Social Constructivism as Paradigm?</em>,\nM. Pfandenhauer and H. Knoblauch (eds.), London and New York:\nRoutledge, 207–215.</li>\n<li>Staudigl, M., 2017, “Alfred Schutz and Phenomenology of\nReligion: Explorations into Ambiguous Territory,” <em>Human\nStudies</em>, 40: 491–499.</li>\n<li>––– and G. Berguno (eds.), 2014, <em>Schutzian\nPhenomenology and Hermeneutic Traditions</em>, Dordrecht:\nSpringer.</li>\n<li>Steets, S., 2021, “Die Dualität von Leib und die\nStrukturen der Lebenswelt,” in <em>Mathesis Universalis</em>, J.\nDreher (ed.), Wiesbaden: Springer, 97–112.</li>\n<li>Strassheim, J., 2016, “Type and Spontaneity: Beyond Alfred\nSchutz’s Theory of the Social World,” <em>Human\nStudies</em>, 39: 493–512.</li>\n<li>Ten Have, P. and G. Psathas (eds.), 1995, <em>Situated Order:\nStudies in the Social Organization of Talk and Embodied\nActivities</em> (<em>Studies in Ethnomethodology and Conversational\nAnalysis</em>: Number 3), Washington, D.C.: International Institute\nfor Ethnometholodology and Conversation Analysis and University Press\nof America.</li>\n<li>Thomason, B.C., 1983, <em>Making Sense of Reification: Alfred\nSchutz and Constructionist Theory</em>, London: Macmillan.</li>\n<li>Vaitkus, S., 1983, <em>How is Society Possible?</em>, Dordrecht,\nBoston, and London: Kluwer Academic Publishers.</li>\n<li>Voegelin, E., 1952, <em>The New Science of Politics: An\nIntroduction</em>, Chicago: University of Chicago Press.</li>\n<li>Wagner, H. R., 1983, <em>Alfred Schutz: An\nIntellectualBiography</em>, Chicago: University of Chicago Press.</li>\n<li>–––, with I. Srubar, 1983, <em>A Bergsonian\nBridge to Phenomenological Psychology</em>, Edmonton: University of\nAlberta Press.</li>\n<li>Waldenfels, B., 1971, <em>Das Zwischenreich des Dialogs:\nSozialphilosophische Untersuchungen in Anschluss an Edmund\nHusserl</em>, The Hague: Martinus Nijhoff.</li>\n<li>Wannenmacher, B., 2021, “Alfred Schütz’\n‘Strukturen der Lebenswelt’ und kritische Theorie: Auf die\nSuche nach Schnittstellung,” in <em>Mathesis Universalis</em>,\nJ. Dreher (ed.), Wiesbaden: Springer, 271–290.</li>\n<li>Webb, R.B., 1976, <em>The Presence of the Past: John Dewey and\nAlfred Schutz on the Genesis and Organization of Experience</em>,\nGainesville: University Presses of Florida.</li>\n<li>Weber, M., 1978, <em>Economy and Society: An Outline of\nInterpretive Sociology</em>, E. Fischoff, et al. (trans.), G. Roth and\nC. Wittich (eds.), 2 volumes, Berkeley: University of California\nPress.</li>\n<li>–––, 1958, <em>The Protestant Ethic and the\nSpirit of Capitalism</em>, T. Parsons (trans.), New York:\nScribners.</li>\n<li>Williame, R., 1973, <em>Les Fondements\nPhénoménologiques de la Sociologie Comprehénsive:\nAlfred Schutz et Max Weber</em>, The Hague: Martinus Nijhoff.</li>\n<li>Wolff, Kurt (ed.), 1984, <em>Alfred Schutz: Appraisals and\nDevelopments</em>, Dordrecht: Martinus Nijhoff.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["atheism and agnosticism", "existentialism", "Habermas, Jürgen", "Husserl, Edmund", "Mead, George Herbert", "phenomenology", "Sartre, Jean-Paul", "Scheler, Max", "Weber, Max"], "entry_link": [{"../atheism-agnosticism/": "atheism and agnosticism"}, {"../existentialism/": "existentialism"}, {"../habermas/": "Habermas, Jürgen"}, {"../husserl/": "Husserl, Edmund"}, {"../mead/": "Mead, George Herbert"}, {"../phenomenology/": "phenomenology"}, {"../sartre/": "Sartre, Jean-Paul"}, {"../scheler/": "Scheler, Max"}, {"../weber/": "Weber, Max"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=schutz\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/schutz/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=schutz&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/schutz/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=schutz": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/schutz/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=schutz&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/schutz/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"https://web.archive.org/web/20131207050729/http://phenomenologycenter.org/about/specialized-bibliographies/schutz/\" target=\"other\">Bibliography of Secondary Sources on Alfred Schutz</a>,\n Center for Advanced Research in Phenomenology.", "<a href=\"http://www.zetabooks.com\" target=\"other\">Schutzian Research</a>"], "listed_links": [{"https://web.archive.org/web/20131207050729/http://phenomenologycenter.org/about/specialized-bibliographies/schutz/": "Bibliography of Secondary Sources on Alfred Schutz"}, {"http://www.zetabooks.com": "Schutzian Research"}]}, "tokenized_text": ["1", "life", "influence", "viennaborn", "alfred", "schutz", "joined", "artillery", "division", "austrian", "army", "world", "war", "served", "italian", "front", "returning", "pursue", "study", "university", "vienna", "schutz", "studied", "law", "social", "science", "business", "renowned", "figure", "han", "kelsen", "ludwig", "von", "mi", "significant", "educational", "experience", "occurred", "member", "mi", "circle", "one", "many", "viennese", "circle", "schlick", "circle", "famous", "interdisciplinary", "mi", "circle", "schutz", "formed", "friendship", "would", "continue", "throughout", "cataclysmic", "decade", "1930s", "1940s", "included", "among", "others", "economist", "gottfried", "von", "haberler", "friedrich", "a", "von", "hayek", "fritz", "machlup", "oskar", "morgenstern", "philosopher", "felix", "kaufmann", "political", "scientist", "eric", "voegelin", "continuing", "pursue", "academic", "interest", "1927", "schutz", "named", "executive", "officer", "reitler", "company", "leading", "viennese", "banking", "firm", "international", "business", "relation", "thus", "commenced", "lifelong", "pattern", "led", "edmund", "husserl", "describe", "banker", "day", "philosopher", "night", "beginning", "schutz", "taken", "methodological", "writing", "max", "weber", "lectured", "vienna", "summer", "1918", "whose", "work", "immensely", "popular", "among", "viennese", "intellectual", "however", "schutz", "felt", "weber", "work", "rested", "tacit", "unexamined", "presupposition", "resulting", "lack", "interest", "fundamental", "epistemological", "problem", "direct", "bearing", "special", "sociological", "problem", "19251927", "schutz", "turned", "henri", "bergson", "philosophy", "consciousness", "inner", "time", "order", "clarify", "notion", "meaning", "action", "intersubjectivity", "result", "collected", "manuscript", "published", "life", "form", "meaning", "structure", "dissatisfied", "though", "analysis", "temporality", "extent", "never", "published", "prompted", "comment", "felix", "kaufmann", "discovered", "relevance", "phenomenology", "consciousness", "inner", "time", "edmund", "husserl", "18591938", "went", "produce", "major", "life", "work", "phenomenology", "social", "world", "1932", "work", "husserl", "praised", "earnest", "profound", "phenomenologist", "spent", "rest", "1930s", "authoring", "brief", "essay", "showing", "phenomenology", "social", "world", "could", "come", "term", "economic", "thought", "mi", "hayek", "also", "direct", "encounter", "american", "pragmatism", "developed", "manuscript", "personality", "social", "world", "stressed", "pragmatic", "element", "everyday", "social", "world", "schutz", "career", "academic", "business", "thoroughly", "convulsed", "adolf", "hitler", "implemented", "annexation", "anschluss", "austria", "germany", "march", "13", "1938", "especially", "since", "business", "trip", "paris", "separated", "three", "month", "family", "whose", "emigration", "paris", "finally", "arranged", "international", "lawyer", "businessperson", "able", "assist", "numerous", "intellectual", "escape", "austria", "westward", "movement", "nazi", "juggernaut", "eventually", "compelled", "immigrate", "family", "united", "state", "july", "14", "1939", "united", "state", "continued", "assisting", "immigrant", "working", "reitler", "company", "reestablishing", "business", "supported", "united", "state", "war", "effort", "reporting", "german", "austrian", "economic", "matter", "board", "economic", "warfare", "also", "cooperated", "marvin", "farber", "founding", "international", "phenomenological", "society", "whose", "initial", "turfbattles", "often", "mediated", "instituting", "editing", "philosophy", "phenomenological", "research", "1943", "schutz", "began", "teaching", "sociology", "philosophy", "course", "graduate", "faculty", "new", "school", "social", "research", "responsibility", "included", "presenting", "paper", "schoolwide", "general", "seminar", "supervising", "dissertation", "serving", "chair", "philosophy", "department", "19521956", "spite", "many", "activity", "managed", "carry", "extensive", "philosophical", "correspondence", "farber", "aron", "gurwitsch", "fritz", "machlup", "eric", "voegelin", "maurice", "natanson", "graduate", "student", "1951", "1953", "however", "date", "correspondence", "gurwitsch", "voegelin", "published", "united", "state", "schutz", "published", "collection", "article", "wide", "variety", "topic", "explaining", "criticizing", "husserl", "thought", "examining", "work", "american", "philosopher", "william", "james", "george", "santanyana", "engaging", "continental", "philosopher", "max", "scheler", "jeanpaul", "sartre", "developing", "philosophical", "position", "social", "science", "temporality", "language", "multiple", "reality", "responsibility", "symbolism", "addressing", "sociopolitical", "question", "dealing", "stranger", "homecomers", "wellinformed", "citizen", "equality", "treating", "theme", "literature", "music", "several", "thinker", "continued", "schutz", "tradition", "philosophy", "sociology", "maurice", "natanson", "emphasized", "tension", "individual", "existential", "social", "anonymizing", "dimension", "everyday", "life", "experience", "thomas", "luckmann", "served", "coauthor", "posthumous", "publication", "schutz", "structure", "lifeworld", "developed", "sociology", "knowledge", "implication", "schutz", "thought", "stressed", "difference", "science", "lifeworld", "well", "importance", "language", "symbolism", "moral", "order", "society", "john", "neill", "fused", "schutz", "thought", "merleauponty", "focusing", "lived", "communicative", "body", "richard", "grathoff", "investigated", "experience", "normality", "within", "bounded", "situated", "context", "milieu", "ilja", "srubar", "developed", "pragmatic", "dimension", "schutz", "thought", "several", "economic", "political", "implication", "lester", "embree", "clarified", "typology", "science", "fred", "kersten", "expanded", "aesthetic", "insight", "drawing", "schutz", "thought", "harold", "garfinkel", "launched", "ethnomethodology", "george", "psathas", "commentator", "ethnomethodology", "played", "key", "role", "initiating", "new", "discipline", "conversation", "analysis", "several", "scholar", "worldwide", "dedicated", "schutz", "work", "development", "insight", "germany", "japan", "united", "state", "home", "archive", "containing", "schutz", "work", "correspondence", "2", "phenomenology", "social", "world", "principal", "work", "schutz", "placed", "three", "chapter", "philosophical", "discussion", "introductory", "concluding", "chapter", "discussed", "social", "scientific", "position", "philosophy", "attempted", "engage", "initial", "chapter", "schutz", "praised", "max", "weber", "view", "valuefreedom", "social", "science", "autonomy", "science", "visàvis", "activity", "eg", "politics", "commended", "weber", "methodological", "individualism", "idealtype", "methodology", "addition", "applauded", "weber", "refusal", "reduce", "social", "science", "natural", "science", "allowing", "idealtypical", "result", "testable", "adequacy", "however", "schutz", "also", "supplemented", "weber", "pointing", "interpretation", "involved", "even", "selecting", "experience", "one", "stream", "experience", "highlighting", "meaning", "action", "actor", "depended", "upon", "project", "guiding", "extended", "temporal", "process", "subacts", "leading", "realization", "initial", "criticism", "weber", "required", "schutz", "develop", "theory", "meaning", "action", "beginning", "husserl", "study", "consciousness", "internal", "time", "particular", "consciousness", "capacity", "capture", "reflectively", "distinguish", "lived", "experience", "first", "appear", "undefined", "phase", "melting", "schutz", "appropriated", "notion", "flowing", "consciousness", "duration", "bergson", "relied", "manuscript", "later", "published", "life", "form", "meaning", "structure", "manuscript", "analytic", "purpose", "split", "ego", "indivisible", "lived", "experience", "idealtypical", "construct", "various", "life", "form", "included", "living", "duration", "remembering", "acting", "thinking", "relating", "thou", "though", "schutz", "never", "made", "explicit", "reason", "publishing", "earlier", "manuscript", "helmut", "wagner", "rightly", "speculated", "ill", "ease", "since", "one", "could", "access", "duration", "act", "memory", "course", "constituted", "lifeform", "entirely", "separate", "duration", "result", "methodology", "relying", "distinct", "idealtypes", "duration", "began", "appear", "inaccessible", "dingansich", "husserl", "account", "consciousness", "inner", "time", "remedied", "problem", "carefully", "describing", "stream", "duration", "changed", "every", "moment", "remembered", "havingjustbeenthus", "primal", "impression", "passed", "primary", "remembrance", "retention", "continuum", "extending", "backward", "primal", "impression", "retention", "formed", "specious", "present", "reflective", "act", "secondary", "remembrance", "recollection", "reproduction", "turned", "differentiating", "one", "experience", "another", "sum", "husserl", "phenomenological", "description", "experience", "uncovered", "process", "retention", "bridged", "duration", "reflective", "memory", "gap", "bedeviled", "schutz", "earlier", "effort", "insofar", "relied", "idealtypical", "methodology", "prevented", "insight", "go", "within", "conscious", "process", "schutz", "though", "turned", "husserlian", "account", "temporality", "direction", "action", "theory", "demarcating", "level", "passive", "experience", "eg", "bodily", "reflex", "spontaneous", "activity", "without", "guiding", "project", "eg", "act", "noticing", "environmental", "stimulus", "deliberately", "planned", "projected", "activity", "known", "technically", "action", "eg", "writing", "book", "planning", "action", "realized", "future", "one", "relies", "reflective", "act", "projection", "like", "found", "reflective", "memory", "oriented", "future", "opposed", "past", "direction", "reflectivity", "one", "imago", "project", "completed", "future", "perfect", "tense", "realized", "one", "acting", "project", "also", "central", "importance", "martin", "heidegger", "pragmatist", "tradition", "establishes", "inorderto", "motive", "one", "action", "contrast", "one", "motif", "consist", "environmental", "historical", "factor", "influenced", "past", "decision", "embark", "upon", "project", "discovered", "investigating", "pluperfect", "tense", "exploring", "past", "factor", "preceded", "past", "decision", "schutz", "distinction", "relevant", "contemporary", "debate", "whether", "freedom", "compatible", "determinism", "since", "perspective", "lived", "inorderto", "motive", "one", "experience", "oneself", "free", "morally", "responsible", "perspective", "examining", "one", "motif", "completing", "one", "action", "one", "correlate", "observer", "oneself", "choice", "project", "historical", "determinant", "course", "schutz", "working", "within", "parameter", "husserl", "nonnaturalistic", "account", "consciousness", "would", "conceived", "determinant", "much", "empiricomechanical", "cause", "rather", "influence", "discoverable", "interpretive", "process", "associating", "earlier", "event", "later", "one", "seem", "influenced", "schutz", "position", "come", "closest", "roughly", "compatibilist", "outlook", "pf", "strawson", "thomas", "nagel", "distinguish", "participant", "observer", "attitude", "prior", "theoretical", "discussion", "align", "participant", "attitude", "freedom", "observer", "attitude", "determinism", "schutz", "however", "contributes", "unique", "insight", "attitude", "take", "place", "within", "distinctive", "temporal", "framework", "oriented", "toward", "future", "past", "schutz", "account", "temporal", "framework", "motivation", "permitted", "criticism", "weber", "view", "one", "could", "orient", "one", "action", "past", "behavior", "others", "since", "behavior", "might", "served", "motive", "action", "one", "could", "aim", "affecting", "another", "already", "completed", "action", "similarly", "failure", "appreciate", "temporality", "often", "lead", "misinterpretation", "action", "one", "assumes", "outcome", "act", "may", "motive", "without", "considering", "actor", "inorderto", "motive", "due", "unforeseen", "event", "may", "adjusted", "may", "led", "result", "contrary", "intended", "likewise", "one", "interpret", "economic", "action", "fact", "le", "rational", "without", "taking", "sufficient", "account", "limited", "information", "available", "actor", "time", "deciding", "act", "might", "make", "action", "seem", "perfectly", "rational", "moreover", "fact", "one", "temporal", "stream", "consciousness", "never", "completely", "coincides", "another", "whose", "sequence", "event", "intensity", "experience", "inevitably", "differs", "one", "place", "limit", "one", "understanding", "another", "consequence", "objective", "meaning", "language", "defined", "dictionary", "invariant", "regardless", "user", "also", "bear", "subjective", "connotation", "language", "user", "due", "unique", "history", "linguistic", "experience", "even", "though", "practical", "purpose", "communication", "able", "set", "aside", "difference", "instance", "one", "would", "consider", "depth", "goethe", "work", "whole", "understand", "meant", "demonic", "schutz", "basic", "point", "example", "involves", "getting", "behind", "constituted", "meaning", "temporal", "process", "actor", "build", "meaning", "actionsa", "meaningful", "buildup", "accentuated", "german", "title", "phenomenology", "social", "world", "der", "sinnhafte", "aufbau", "der", "sozialen", "welt", "addition", "account", "consciousness", "motivation", "action", "examined", "structure", "social", "world", "including", "consociates", "share", "time", "spatial", "access", "body", "contemporary", "one", "share", "time", "predecessor", "successor", "one", "share", "time", "whose", "lived", "body", "one", "lack", "access", "consociates", "present", "physically", "partake", "inner", "time", "onrolling", "life", "grasp", "building", "experience", "live", "werelationship", "entail", "growing", "older", "together", "consociates", "revise", "type", "immediately", "one", "must", "proceed", "inferentially", "contemporary", "predecessor", "successor", "constructing", "ideal", "type", "based", "letter", "report", "running", "greater", "risk", "misunderstanding", "depending", "degree", "anonymity", "person", "understood", "one", "could", "say", "weber", "method", "ideal", "type", "construction", "illustrated", "sociological", "account", "protestant", "origin", "capitalism", "really", "foreign", "everyday", "lifeworld", "actor", "beyond", "consociate", "level", "continually", "relate", "via", "type", "construction", "human", "actor", "everyday", "life", "already", "adopt", "toward", "attitude", "social", "scientist", "schutz", "conceived", "work", "developing", "phenomenological", "psychology", "inner", "experience", "focusing", "invariant", "feature", "lifeworld", "toward", "theoretician", "including", "social", "scientist", "turn", "reflectively", "although", "jürgen", "habermas", "criticizes", "schutz", "account", "lifeworld", "abridged", "culturalistic", "fashion", "addressing", "institutional", "order", "personality", "structure", "habermas", "1987", "2126132", "would", "seem", "schutz", "delimits", "work", "fashion", "according", "social", "scientist", "develop", "construct", "ideal", "type", "meaningcontexts", "lifeworld", "actor", "test", "type", "determine", "causally", "adequate", "conforming", "past", "experience", "meaning", "adequate", "consistent", "whatever", "else", "known", "actor", "responding", "mi", "critique", "weber", "idealtypes", "historically", "specific", "schutz", "suggested", "later", "weber", "ideal", "type", "economy", "society", "attain", "generality", "comparable", "mi", "economic", "theory", "could", "interpreted", "presenting", "idealtypical", "description", "behavior", "economic", "agent", "later", "weber", "type", "depict", "invariant", "subjective", "experience", "anyone", "act", "within", "economic", "framework", "defined", "principle", "marginal", "utility", "choosing", "maximize", "satisfaction", "3", "extension", "31", "bergson", "writing", "schutz", "manuscript", "bergson", "produced", "1925", "1927", "finally", "published", "english", "1982", "illuminate", "subsequent", "work", "share", "general", "purpose", "grounding", "social", "science", "thou", "experience", "schutz", "1982", "34", "reaction", "positivistic", "approach", "schlick", "circle", "felix", "kaufmann", "participated", "reduced", "experience", "method", "natural", "scientific", "observation", "found", "tolerable", "schutz", "sought", "give", "account", "lifeform", "prescientific", "experience", "preceding", "conceptualcategorical", "comprehension", "highest", "powerful", "lifeform", "schutz", "1982", "53", "course", "moving", "direction", "encountered", "problem", "faced", "georg", "wilhelm", "friedrich", "hegel", "wilfrid", "sellars", "john", "mcdowell", "robert", "brandom", "others", "namely", "possible", "access", "preconceptual", "without", "conceptualizing", "hence", "acknowledged", "work", "conflict", "material", "since", "forced", "resort", "conceptual", "formulation", "schutz", "1982", "70", "problem", "parallel", "problem", "reaching", "lifeform", "present", "unfolding", "experience", "duration", "since", "one", "speak", "arresting", "flow", "distinguishing", "moment", "thus", "remembering", "lapsedbut", "one", "new", "lifeform", "memory", "although", "gap", "present", "duration", "memory", "prompted", "turn", "husserlian", "phenomenology", "problematic", "highlighted", "pervasiveness", "hiddenness", "interpretive", "activity", "one", "move", "interpretive", "frameworksa", "principal", "theme", "later", "work", "took", "notice", "theme", "frequently", "pointed", "one", "reconstitution", "past", "experience", "memory", "varied", "according", "interest", "present", "one", "remembered", "past", "indeed", "favorite", "example", "bergson", "work", "involved", "actor", "reflecting", "upon", "prior", "process", "choosing", "interpreting", "choice", "two", "clearly", "defined", "possibility", "whereas", "fact", "process", "often", "oscillated", "several", "option", "retaining", "reproducing", "comparing", "modifying", "succession", "general", "schutz", "concurred", "bergson", "notion", "attention", "life", "plane", "consciousness", "body", "intersection", "outer", "inner", "temporality", "music", "model", "duration", "multiple", "type", "ordering", "rejected", "bioevolutionary", "theory", "vitalism", "idea", "suprapersonal", "elán", "32", "social", "science", "although", "schutz", "defended", "weber", "mi", "agreed", "many", "basic", "premise", "mi", "austrian", "tradition", "focused", "subjective", "preference", "purchaser", "conferring", "value", "object", "instead", "explaining", "value", "result", "objective", "process", "production", "cost", "labor", "time", "invested", "also", "shared", "mi", "supposition", "valuefreedom", "economic", "science", "need", "describe", "rather", "evaluate", "preference", "instrumental", "task", "science", "namely", "showing", "achieve", "end", "rather", "assessing", "value", "since", "mi", "considered", "acting", "economic", "insofar", "consumer", "choice", "involved", "maximizing", "satisfaction", "widest", "sense", "opposed", "narrow", "type", "homo", "economicus", "modeled", "businessperson", "driven", "solely", "economic", "motif", "expense", "others", "schutz", "however", "posited", "lifeworld", "wide", "diversity", "motivation", "base", "economic", "theory", "conceived", "theory", "adopting", "reflective", "perspective", "governed", "principle", "marginal", "utility", "namely", "ideal", "type", "ought", "constructed", "actor", "oriented", "lifeplans", "realize", "greatest", "utility", "minimal", "cost", "schutz", "1964", "87", "besides", "thus", "resuscitating", "version", "homo", "economicus", "schutz", "insisted", "economist", "study", "purposiverational", "action", "weber", "sense", "involved", "reflective", "comparison", "alternative", "project", "adopting", "one", "inorderto", "motive", "addition", "classified", "sense", "uneasiness", "mi", "described", "prompting", "search", "satisfaction", "category", "motif", "one", "first", "adopts", "rationally", "determined", "economic", "project", "retrospect", "discovers", "preceding", "dissatisfaction", "understand", "difference", "conceiving", "action", "economic", "conceiving", "economic", "action", "one", "type", "action", "within", "encompassing", "lifeworld", "one", "might", "compare", "mi", "schutz", "reference", "problem", "raised", "within", "contemporary", "discussion", "collective", "action", "namely", "traditional", "noneconomic", "value", "eg", "politics", "ethic", "ought", "intersect", "market", "mi", "would", "countenance", "economic", "agent", "registering", "value", "economically", "deciding", "purchase", "eg", "protest", "polluting", "company", "thereby", "converting", "value", "economic", "one", "whereas", "schutz", "would", "call", "process", "negotiating", "boundary", "different", "lifeworld", "value", "domain", "concept", "theory", "formation", "social", "science", "schutz", "addressed", "broader", "issue", "relationship", "philosophy", "social", "science", "general", "essay", "schutz", "responded", "ernest", "nagel", "positivistic", "view", "social", "science", "make", "use", "natural", "scientific", "method", "identifying", "evidence", "sensory", "observable", "data", "criticizing", "weberian", "method", "understanding", "appealing", "uncontrollable", "unverifiable", "introspection", "schutz", "agreed", "nagel", "several", "count", "namely", "social", "scientist", "needed", "validate", "theoretical", "belief", "lack", "predictability", "social", "science", "disqualify", "scientific", "character", "weber", "would", "wrong", "method", "subjective", "interpretation", "implied", "empathy", "unobservable", "introspective", "state", "problem", "though", "natural", "scientific", "approach", "social", "science", "insofar", "separated", "verifiable", "observable", "behavior", "unverifiable", "inner", "state", "purpose", "emotion", "seemed", "play", "map", "drawn", "descartes", "divorced", "body", "mind", "allowed", "statement", "former", "scientifically", "verifiable", "natural", "scientific", "approach", "depended", "basic", "presupposition", "since", "without", "first", "examining", "object", "social", "sciencesocial", "reality", "schutz", "termsone", "would", "simply", "presupposing", "method", "natural", "science", "appropriate", "study", "therefore", "schutz", "attempted", "first", "clarify", "social", "reality", "described", "depth", "phenomenology", "social", "world", "indicate", "actor", "sustain", "reality", "understanding", "inorderto", "motif", "typical", "term", "eg", "going", "school", "making", "purchase", "marrying", "mutual", "understanding", "take", "place", "without", "either", "somehow", "penetrating", "private", "inner", "sanctum", "reducing", "status", "animal", "organism", "responding", "stimulus", "given", "account", "social", "reality", "actor", "give", "meaning", "world", "opposed", "physical", "reality", "whose", "object", "eg", "electron", "quark", "interpret", "world", "schutz", "argued", "appropriate", "social", "scientific", "method", "involved", "developing", "construct", "everyday", "actor", "construct", "social", "scientific", "construct", "ideal", "type", "weber", "sense", "aimed", "capturing", "subjective", "meaning", "actor", "according", "weber", "intention", "meaning", "actor", "opposed", "social", "scientist", "introspective", "inner", "process", "schutz", "conceived", "statistical", "formulation", "social", "scientific", "law", "legitimate", "kind", "intellectual", "shorthand", "always", "presupposing", "meaningful", "activity", "individual", "social", "actor", "forgotten", "man", "social", "science", "schutz", "1964", "67", "ensure", "kind", "validation", "nagel", "sought", "mistakenly", "though", "restricting", "sensory", "observable", "data", "schutz", "proposed", "social", "scientist", "displace", "everyday", "practical", "interest", "favor", "guiding", "interest", "accurate", "scientific", "description", "observe", "postulate", "logical", "consistency", "adequacy", "experience", "described", "order", "elucidate", "meaning", "rational", "action", "schutz", "hypothesized", "rational", "actor", "would", "know", "even", "though", "completely", "rational", "action", "might", "never", "realized", "everyday", "life", "actor", "would", "know", "end", "relationship", "end", "consequence", "byproduct", "realizing", "end", "mean", "suitable", "end", "interaction", "mean", "end", "mean", "accessibility", "mean", "addition", "rational", "actor", "would", "need", "understand", "interactors", "understanding", "previous", "factor", "interpretation", "act", "others", "reaction", "people", "motivation", "useful", "category", "already", "discovered", "social", "world", "although", "social", "scientist", "might", "use", "model", "completely", "rational", "action", "ass", "rationality", "everyday", "actor", "schutz", "cautioned", "social", "scientist", "task", "describe", "lifeworld", "actor", "also", "needed", "wary", "replacing", "viewpoint", "everyday", "actor", "fictional", "nonexisting", "world", "constructed", "scientific", "observer", "fact", "central", "point", "discussion", "published", "correspondence", "schutz", "talcott", "parson", "concerned", "subjective", "viewpoint", "actor", "whose", "subacts", "example", "could", "adequately", "understood", "without", "comprehending", "actor", "overarching", "project", "whose", "temporal", "span", "first", "accessible", "actor", "finally", "noted", "schutz", "produced", "two", "piece", "applied", "research", "constructed", "ideal", "type", "stranger", "homecomer", "taking", "account", "experience", "meant", "instead", "social", "scientist", "others", "might", "think", "meant", "33", "philosophy", "although", "reference", "philosopher", "pragmatist", "tradition", "john", "dewey", "george", "herbert", "mead", "scattered", "schutz", "writing", "william", "james", "devoted", "first", "fulllength", "essay", "arriving", "united", "state", "briefly", "alluding", "methodological", "difference", "husserl", "james", "emphasized", "two", "point", "great", "master", "converged", "stream", "thought", "theory", "fringe", "thinker", "stressed", "personal", "consciousness", "involves", "multiplicity", "element", "needing", "reunited", "rather", "unity", "one", "separate", "component", "examined", "modification", "reflection", "introduces", "lived", "stream", "converting", "uncovering", "working", "intentionality", "husserl", "idea", "kernel", "meaning", "distinguishing", "object", "stood", "unthematized", "network", "relationship", "make", "horizon", "paralleled", "james", "belief", "topic", "fringes", "fringe", "connect", "topic", "experience", "instance", "one", "hear", "merely", "thunder", "thunderbreakinginuponsilenceandcontrastingwithit", "similarly", "jamesian", "idea", "grasping", "unity", "must", "learned", "manystepped", "process", "pythagorean", "theorem", "could", "translated", "husserlian", "terminology", "regarding", "monothetical", "grasping", "polythetic", "process", "likewise", "james", "discussion", "focusing", "object", "within", "broader", "topic", "resembled", "husserl", "view", "one", "could", "discern", "noema", "perspectival", "aspect", "thing", "constituted", "many", "aspect", "presented", "another", "american", "philosopher", "schutz", "dedicated", "entire", "essay", "george", "santayana", "whose", "domination", "power", "reviewed", "essay", "expository", "schutz", "praised", "santayana", "effort", "base", "politics", "philosophical", "anthropology", "insight", "enslaving", "potential", "technology", "however", "schutz", "doubt", "convinced", "mi", "positive", "assessment", "economic", "activity", "resisted", "santayana", "reduction", "domination", "likewise", "phenomenologist", "opposed", "santayana", "naturalistic", "founding", "spirit", "physical", "order", "nature", "schutz", "dissented", "conviction", "derived", "naturalism", "namely", "democracy", "could", "solve", "problem", "returning", "generative", "order", "agriculture", "besides", "interchange", "american", "philosopher", "schutz", "later", "career", "interpreted", "work", "max", "scheler", "earlier", "engaged", "thoroughly", "treatment", "intersubjectivity", "topic", "schutz", "insisted", "treated", "within", "natural", "attitude", "one", "never", "doubted", "existence", "others", "schutz", "agreed", "scheler", "belief", "given", "prior", "a", "position", "latter", "defended", "basis", "psychology", "child", "culture", "le", "accustomed", "selfreflection", "schutz", "supported", "priority", "however", "ground", "living", "one", "act", "natural", "attitude", "living", "also", "present", "experience", "unfolds", "one", "first", "clearly", "distinguish", "one", "thought", "others", "nevertheless", "soon", "one", "reflects", "stream", "consciousnessand", "child", "culture", "may", "develop", "capacity", "selfreflection", "laterhe", "becomes", "aware", "experience", "schutz", "found", "plausible", "scheler", "belief", "inner", "indubitable", "perception", "inner", "perception", "refers", "anything", "connected", "mental", "life", "one", "locates", "experience", "living", "vivid", "simultaneity", "within", "conscious", "stream", "schutz", "believed", "possible", "however", "much", "vivid", "simultaneity", "one", "might", "unable", "doubt", "existence", "one", "could", "still", "mistaken", "specific", "thought", "others", "since", "belonging", "stream", "consciousness", "thought", "share", "dubitability", "characterizing", "outer", "perception", "likewise", "transcendent", "one", "stream", "experience", "another", "figure", "le", "within", "phenomenological", "tradition", "whose", "view", "intersubjectivity", "schutz", "examined", "criticized", "jeanpaul", "sartre", "particularly", "sartre", "nothingness", "sartre", "theory", "alter", "ego", "schutz", "elucidated", "sartre", "attempt", "develop", "extraempirical", "real", "communication", "avoids", "extreme", "empiricist", "intersubjectivity", "beginning", "body", "idealist", "reduction", "series", "presentation", "explaining", "sartre", "difference", "regarding", "intersubjectivity", "husserl", "hegel", "heidegger", "schutz", "laid", "sartre", "existential", "account", "given", "subject", "look", "one", "turn", "objectify", "returning", "gaze", "although", "sartre", "intended", "describe", "one", "body", "given", "instead", "portrayed", "body", "given", "oneself", "assuming", "description", "reversible", "schutz", "believe", "problem", "intersubjectivity", "could", "addressed", "adequately", "within", "transcendental", "sphere", "applauded", "sartre", "rejection", "husserl", "transcendental", "approach", "intersubjectivity", "however", "sartre", "emphasis", "center", "activity", "reflected", "continuing", "husserlian", "influence", "main", "problem", "though", "sartre", "doctrine", "starting", "point", "mutual", "looking", "subject", "reduces", "object", "precluded", "possibility", "relationship", "isubject", "othersubject", "schutz", "wondered", "sartre", "would", "know", "body", "given", "way", "body", "subjectivity", "escaped", "i", "moreover", "schutz", "acknowledged", "interest", "might", "coincide", "failed", "see", "fact", "entailed", "either", "reduce", "utensil", "instead", "pointed", "mutual", "tuningin", "found", "making", "music", "together", "language", "proof", "subject", "interact", "coperforming", "subjectivity", "mutual", "interaction", "freedom", "better", "describes", "intersubjectivity", "sartre", "practical", "solipsism", "34", "application", "1945", "schutz", "published", "essay", "multiple", "reality", "extended", "theory", "phenomenology", "social", "world", "anticipated", "later", "essay", "applying", "theory", "reiterated", "earlier", "view", "level", "activity", "bergsonian", "tension", "consciousness", "structure", "social", "world", "work", "took", "decidedly", "pragmatic", "twist", "emphasizing", "working", "wirken", "involving", "bodily", "movement", "opposed", "covert", "performance", "mere", "thinking", "manuscript", "1930s", "phenomenology", "social", "world", "schutz", "already", "turned", "pragmatic", "direction", "multiple", "reality", "enlarged", "upon", "world", "working", "demonstrating", "reflection", "dissolve", "self", "unified", "lived", "action", "partial", "roletaking", "self", "expanding", "mead", "idea", "manipulatory", "sphere", "include", "world", "within", "potential", "reach", "either", "restorable", "past", "attainable", "future", "world", "working", "constitutes", "paramount", "reality", "organized", "interest", "face", "fundamental", "anxiety", "derives", "heidegger", "inescapability", "one", "death", "following", "husserl", "view", "consciousness", "modify", "stance", "toward", "reality", "deontologizing", "james", "subuniverses", "reality", "schutz", "developed", "notion", "various", "finite", "province", "meaning", "one", "enters", "province", "phantasm", "dream", "theater", "religious", "experience", "theoretical", "contemplation", "undergoing", "different", "type", "epoché", "analogous", "phenomenological", "prototype", "one", "slip", "daydream", "fall", "asleep", "watch", "theater", "curtain", "open", "commences", "ritual", "assumes", "scientist", "role", "province", "contains", "distinctive", "logical", "temporal", "corporal", "social", "dimension", "movement", "province", "becomes", "paradoxical", "eg", "asking", "phenomenologists", "able", "communicate", "private", "finding", "publicly", "one", "conceives", "province", "ontological", "static", "realm", "one", "transmigrates", "soul", "another", "world", "rather", "province", "permeable", "one", "adopts", "attitude", "scientist", "religious", "believer", "within", "world", "working", "seen", "another", "viewpoint", "communicative", "activity", "subtend", "province", "something", "paradoxical", "though", "describing", "one", "dream", "theorizing", "religious", "experience", "since", "give", "account", "one", "must", "absent", "oneself", "province", "one", "account", "kierkegaard", "notion", "indirect", "communication", "various", "postmodern", "critique", "theory", "address", "paradox", "essay", "multiple", "reality", "underpins", "schutz", "theory", "sign", "symbol", "symbol", "reality", "society", "published", "almost", "ten", "year", "later", "synthesizing", "notion", "potential", "reach", "earlier", "essay", "husserl", "concept", "appresentation", "namely", "one", "element", "pair", "refers", "another", "directly", "given", "experience", "schutz", "describes", "agent", "overcome", "whatever", "transcends", "hence", "leave", "mark", "bring", "within", "reach", "leave", "behind", "eg", "breaking", "twig", "remind", "oneself", "turn", "one", "return", "follow", "indication", "regular", "connection", "making", "eg", "smoke", "indicating", "yet", "visible", "fire", "bring", "within", "knowledge", "lie", "beyond", "sign", "however", "appresent", "intersubjective", "setting", "meaning", "one", "person", "another", "insuperable", "transcendence", "still", "remains", "insofar", "one", "stream", "consciousness", "therefore", "meaning", "never", "identical", "another", "finally", "symbol", "developed", "within", "group", "something", "given", "within", "everyday", "reality", "appresents", "reality", "belonging", "entirely", "different", "province", "meaning", "ultimate", "transcendence", "eg", "stone", "jacob", "dreamed", "ladder", "heaven", "memorializes", "god", "accessible", "within", "religious", "province", "meaning", "schutz", "dealt", "theme", "language", "context", "comparing", "husserl", "distinction", "prepredicative", "prepropositional", "predicative", "level", "kurt", "goldstein", "separation", "based", "study", "brain", "lesion", "concrete", "attitude", "relying", "automatic", "speech", "association", "abstract", "attitude", "forming", "proposition", "utilizing", "rational", "language", "husserl", "prepredicativepredicative", "differentiation", "play", "key", "role", "schutz", "essay", "type", "eidos", "husserl", "late", "philosophy", "show", "gradual", "development", "empirical", "type", "passively", "constituted", "within", "prepredicative", "sphere", "presumptive", "universal", "spontaneously", "formed", "predicative", "sphere", "predicative", "level", "scientific", "reflection", "transforms", "nonessential", "type", "eg", "whale", "fish", "essential", "one", "whale", "mammal", "philosophy", "seek", "eidetic", "universal", "end", "essay", "schutz", "speculates", "whether", "husserlian", "method", "freely", "varying", "example", "determine", "essential", "feature", "survive", "variation", "constrained", "ontological", "structure", "eg", "sound", "color", "socially", "shaped", "naturalattitude", "experience", "type", "essay", "tiresias", "knowledge", "future", "event", "produced", "contemporaneously", "type", "essay", "schutz", "explains", "knowledge", "based", "natural", "attitude", "type", "function", "contrast", "mythical", "tiresias", "knowledge", "future", "private", "detached", "present", "past", "experience", "type", "based", "past", "experience", "socially", "transmitted", "aim", "future", "occurrence", "uniqueness", "emptiness", "future", "event", "fill", "retrospect", "event", "occurs", "one", "able", "determine", "much", "event", "expected", "unexpected", "finally", "future", "event", "lying", "beyond", "one", "influence", "one", "expects", "conform", "past", "experience", "indeterminate", "project", "provide", "directionnot", "tightly", "thoughas", "one", "give", "shape", "within", "one", "power", "schutz", "trained", "pianist", "widely", "read", "musicologist", "integrated", "phenomenology", "understanding", "music", "music", "differing", "language", "nonrepresentative", "lends", "phenomenological", "analysis", "meaning", "carry", "beyond", "mere", "physical", "nature", "sound", "wave", "character", "ideal", "object", "must", "constituted", "unfolding", "stage", "ie", "polythetically", "music", "bound", "inner", "temporality", "theme", "even", "though", "note", "sequence", "vary", "according", "context", "require", "reflection", "recognition", "emerge", "interplay", "musical", "element", "listener", "attention", "interest", "schutz", "found", "music", "instructive", "regard", "social", "relationship", "insofar", "prior", "communication", "party", "musical", "performance", "establish", "nonlinguistic", "nonconceptual", "mutual", "tuning", "relationship", "tuningin", "sharing", "another", "flux", "experience", "inner", "time", "already", "described", "phenomenology", "clearly", "exhibited", "whenever", "listener", "musical", "performance", "participates", "quasisimultaneity", "composer", "stream", "consciousness", "coperformers", "orient", "composer", "audience", "hence", "schutz", "disagreed", "maurice", "halbwachs", "posited", "musical", "notation", "basis", "social", "relationship", "performer", "fact", "merely", "technical", "device", "accidental", "relationship", "another", "essay", "schutz", "depicted", "mozart", "social", "scientist", "presenting", "succession", "situation", "different", "character", "interpret", "schutz", "showed", "orchestral", "representation", "character", "mood", "melody", "made", "possible", "simultaneity", "flux", "inner", "time", "nonoperatic", "non", "musical", "dramatist", "could", "unfold", "successively", "without", "selfconsciously", "philosophizing", "mozart", "conveyed", "music", "better", "philosopher", "medium", "human", "being", "meet", "we", "fred", "kersten", "discovers", "schutz", "musical", "writing", "important", "philosophical", "insight", "instance", "music", "inner", "time", "unfold", "polythetically", "grasped", "monothetically", "one", "must", "live", "unfolding", "symphony", "inner", "experience", "conceptual", "summary", "content", "inevitably", "fails", "justice", "meaning", "however", "since", "conceptualization", "consists", "monothetical", "grasping", "polythetic", "stage", "schutz", "actually", "realizing", "certain", "dimension", "consciousness", "elude", "conceptualization", "thus", "demarcating", "limit", "rationalization", "pointed", "certain", "province", "meaning", "eg", "dream", "evade", "theoretic", "comprehension", "duration", "eludes", "memory", "according", "kersten", "schutz", "seen", "clearly", "passive", "association", "listening", "eg", "recognizing", "appearance", "symphonic", "theme", "differ", "sight", "eg", "apprehending", "object", "like", "house", "listening", "identify", "numerically", "distinct", "item", "produce", "illusion", "identification", "schutz", "conclusion", "sameness", "music", "involves", "numerical", "unity", "recurrent", "likeness", "challenge", "fundamental", "husserlian", "thesis", "synthesis", "passive", "identification", "universal", "basis", "constitution", "world", "schutz", "also", "master", "literature", "careful", "student", "work", "goethe", "author", "article", "analyzed", "miguel", "de", "cervantes", "quixote", "prism", "theory", "multiple", "reality", "cervantes", "repeatedly", "brings", "quixote", "world", "chivalry", "an", "order", "reality", "argument", "reality", "stock", "knowledge", "mode", "social", "reinforcement", "view", "space", "time", "causalityinto", "conflict", "world", "drama", "common", "sense", "science", "although", "quixote", "capable", "constructing", "defense", "chivalrous", "world", "within", "world", "fact", "phantasied", "world", "contains", "enclave", "dream", "cave", "montesinos", "end", "undermining", "raising", "possibility", "dream", "quixote", "withdrawal", "accent", "reality", "private", "province", "meaning", "reveals", "schutz", "importance", "paramount", "reality", "everyday", "life", "value", "sancho", "panza", "remains", "deeply", "rooted", "heritage", "common", "sense", "schutz", "1964", "158", "schutz", "also", "brought", "phenomenology", "bear", "political", "issue", "citizenship", "racial", "equality", "essay", "wellinformed", "citizen", "dealing", "citizenship", "also", "sociology", "knowledge", "rubric", "social", "distribution", "knowledge", "construct", "ideal", "type", "expert", "man", "street", "wellinformed", "citizen", "fall", "determine", "expert", "competent", "schutz", "delineates", "various", "zone", "interest", "relevance", "extending", "within", "reach", "absolutely", "irrelevant", "comment", "constant", "changeability", "relevance", "configuration", "differentiates", "relevance", "intrinsic", "theme", "one", "chooses", "imposed", "paradoxically", "modernity", "rationalization", "process", "heighten", "anonymity", "modern", "technology", "also", "brings", "everyone", "within", "reach", "nuclear", "arm", "race", "demonstrates", "schutz", "suggests", "solution", "citizen", "become", "broadly", "informed", "rather", "succumb", "narrow", "dogmatism", "man", "street", "shortsighted", "specialization", "expert", "becoming", "wellinformed", "one", "depends", "knowledge", "socially", "derived", "consultation", "eyewitness", "insider", "analyst", "commentator", "depending", "access", "fact", "governing", "relevance", "much", "alvin", "goldman", "social", "epistemology", "involves", "appraising", "veritistic", "value", "assorted", "agent", "claim", "practice", "schutz", "usually", "valuefree", "describer", "social", "reality", "conclusion", "endorses", "normative", "notion", "democracy", "duty", "privilege", "frequently", "available", "nondemocratic", "society", "wellinformed", "citizen", "express", "defend", "opinion", "often", "conflict", "uninformed", "opinion", "man", "street", "schutz", "composed", "equality", "meaning", "structure", "social", "world", "time", "legal", "decision", "brown", "v", "board", "education", "ended", "racially", "segregated", "education", "united", "state", "typical", "dispassion", "schutz", "explains", "meaning", "term", "equality", "depends", "domain", "relevance", "pertains", "eg", "economic", "equality", "equality", "civil", "right", "etc", "ingroup", "outgroup", "utilizing", "itand", "conceives", "interpretation", "term", "group", "rather", "individual", "spends", "essay", "contrasting", "subjective", "objective", "interpretation", "group", "membership", "equality", "equality", "opportunity", "construing", "subjective", "objective", "term", "ingroup", "outgroup", "interpretation", "regard", "group", "membership", "illustrates", "mere", "categorization", "another", "member", "group", "need", "discriminatory", "depends", "upon", "appropriate", "evaluation", "category", "viewpoint", "categorized", "individual", "ingroups", "outgroups", "differ", "whether", "understand", "equality", "merely", "formal", "ie", "nondiscrimination", "real", "calling", "special", "right", "service", "similarly", "group", "think", "equality", "opportunity", "outgroup", "perspective", "career", "open", "without", "appreciating", "ingroup", "member", "might", "subjectively", "experience", "insuperable", "obstacle", "trying", "avail", "opportunity", "supposedly", "objectively", "equal", "essay", "schutz", "concerned", "present", "final", "definition", "equality", "highlight", "difference", "ingroup", "outgroup", "understanding", "serve", "precondition", "discussion", "recently", "published", "text", "schutz", "authored", "ethic", "institute", "1956", "make", "possible", "even", "richer", "awareness", "view", "politics", "document", "recognizes", "complex", "unforeseen", "consequence", "resulting", "social", "change", "urge", "active", "engagement", "others", "crucial", "developing", "social", "civil", "judgment", "examines", "barrier", "sound", "civil", "judgment", "created", "government", "political", "party", "pressure", "organization", "mass", "medium", "educational", "familial", "religious", "professional", "institution", "one", "point", "even", "criticizes", "view", "limit", "democracy", "mere", "majoritarian", "rule", "insofar", "neglect", "importance", "single", "individual", "ability", "make", "personal", "opinion", "heard", "appreciated", "preferably", "smaller", "public", "family", "school", "local", "community", "cited", "l", "embree", "1999", "271", "one", "could", "take", "schutz", "thought", "converge", "political", "theory", "favoring", "today", "known", "deliberative", "democracy", "moreover", "normative", "judgment", "implementation", "democracy", "increase", "anonymity", "citizen", "suggests", "parallel", "normative", "even", "ethical", "dimension", "informs", "many", "theoretic", "endeavor", "retrieve", "anonymity", "neglected", "subjective", "viewpoint", "actor", "whether", "stranger", "homecomers", "victim", "discrimination", "forgotten", "man", "social", "science", "35", "phenomenology", "schutz", "philosophical", "targeting", "social", "world", "repercussion", "upon", "phenomenology", "particularly", "critique", "near", "end", "career", "husserl", "account", "also", "referred", "transcendental", "constitution", "person", "come", "appearance", "consciousness", "problem", "transcendental", "intersubjectivity", "husserl", "schutz", "first", "objected", "husserl", "fifth", "cartesian", "mediation", "prepared", "ground", "appearance", "consciousness", "methodology", "screening", "everything", "referred", "mind", "husserl", "begun", "cartesian", "meditation", "reflectively", "abstaining", "believing", "existence", "appeared", "experience", "order", "refrain", "dogmatic", "supposition", "since", "first", "epoché", "phenomenological", "reduction", "still", "left", "meaning", "intersubjective", "reference", "screening", "methodology", "second", "epoché", "became", "necessary", "husserl", "one", "actual", "potential", "experience", "correlate", "properly", "ego", "still", "would", "belong", "one", "sphere", "ownness", "one", "seek", "exclude", "reference", "correlate", "product", "sensedetermining", "subjectivity", "might", "subjectivity", "schutz", "however", "insofar", "experience", "properly", "ego", "supposedly", "confined", "within", "sphere", "ownness", "origin", "intersubjective", "world", "everyday", "life", "higher", "level", "phenomenological", "reflection", "presupposed", "seemed", "difficult", "see", "one", "could", "exclude", "correlate", "reference", "sensedetermininng", "subjectivity", "though", "husserl", "striving", "theoretical", "detachment", "ontological", "origin", "theory", "would", "allow", "addition", "schutz", "consciousness", "another", "inevitably", "instituted", "relationship", "husserl", "argument", "fifth", "meditation", "continued", "affirming", "nonratiocinative", "pairing", "occurred", "one", "transferred", "sense", "another", "living", "body", "another", "one", "could", "verify", "living", "body", "like", "one", "continued", "manifesting", "behavior", "congruent", "one", "would", "expect", "living", "body", "schutz", "challenged", "sensetransfer", "however", "since", "one", "experienced", "body", "outside", "unlike", "one", "given", "interiorly", "might", "similarity", "suffice", "transfer", "suggested", "verification", "congruent", "behavior", "drew", "socialworld", "presupposition", "body", "ought", "behave", "finally", "questioned", "whether", "philosopher", "refraining", "belief", "existence", "world", "others", "entering", "certain", "reflective", "solitude", "could", "ever", "experience", "transcendental", "community", "husserl", "spoke", "since", "constituted", "world", "transcendental", "ego", "intersubjectivity", "schutz", "concluded", "matter", "everyday", "life", "simply", "described", "constituted", "within", "transcendental", "sphere", "selfreflective", "consciousness", "giving", "account", "come", "appearance", "schutz", "argued", "social", "world", "dictated", "method", "social", "scientific", "investigation", "seemed", "prescribe", "phenomenology", "approach", "appropriate", "description", "last", "thirteen", "year", "life", "schutz", "preparing", "comprehensive", "phenomenology", "natural", "attitude", "one", "manuscript", "edited", "richard", "zaner", "posthumously", "published", "reflection", "problem", "relevance", "another", "coauthored", "thomas", "luckmann", "appeared", "structure", "life", "world", "former", "book", "distinguishes", "different", "set", "interest", "relevance", "topical", "focus", "attention", "theme", "interpretive", "confer", "meaning", "experience", "object", "motivational", "relevance", "often", "involve", "subject", "le", "systematic", "interest", "relevance", "interacting", "world", "interaction", "subject", "world", "becomes", "evident", "relevance", "actor", "relevance", "interdependent", "conjoined", "one", "system", "type", "category", "constitute", "stock", "knowledge", "schutz", "examines", "term", "genesis", "structure", "explores", "meaning", "one", "biographical", "situation", "including", "type", "relevance", "one", "body", "ontological", "constraint", "space", "time", "instance", "prevent", "one", "certain", "place", "certain", "time", "compel", "one", "wait", "salt", "dissolve", "water", "structure", "lifeworld", "represents", "complex", "thorough", "restatement", "many", "theme", "schutz", "addressed", "throughout", "life", "general", "account", "lifeworld", "relation", "science", "book", "take", "various", "stratification", "province", "meaning", "temporal", "spatial", "zone", "reach", "social", "structure", "schutz", "luckmann", "comment", "component", "one", "stock", "knowledge", "including", "learned", "nonlearned", "element", "relevance", "type", "trace", "buildup", "stock", "author", "study", "social", "conditioning", "one", "subjective", "stock", "knowledge", "inquire", "social", "stock", "knowledge", "group", "different", "possible", "combination", "knowledge", "distribution", "generalized", "specialized", "consider", "subjective", "knowledge", "becomes", "embodied", "social", "stock", "knowledge", "latter", "influence", "former", "addition", "author", "pursue", "issue", "structure", "consciousness", "action", "choosing", "project", "rational", "action", "form", "social", "action", "whether", "action", "unilateral", "reciprocal", "immediate", "mediate", "final", "section", "analyzes", "boundary", "experience", "different", "degree", "transcendency", "simply", "bringing", "object", "within", "reach", "experience", "death", "mechanism", "crossing", "boundary", "eg", "symbol", "4", "schutzian", "tradition", "year", "schutz", "death", "1959", "work", "posthumously", "published", "thought", "expanded", "several", "direction", "peter", "berger", "thomas", "luckmann", "wrote", "social", "construction", "reality", "focused", "subjective", "human", "process", "construct", "objective", "structure", "human", "subjectivity", "turn", "interprets", "reacts", "among", "widely", "read", "book", "social", "science", "twentieth", "century", "ilja", "srubar", "emphasized", "importance", "pragmatic", "dimension", "schutz", "corpus", "hansgeorg", "soeffner", "along", "jochen", "dreher", "developed", "symbolic", "aspect", "schutzian", "ground", "lester", "embree", "produced", "theory", "science", "model", "wissenschaftslehre", "george", "psathas", "extended", "schutz", "thought", "direction", "ethnomethodology", "conversation", "analysis", "recently", "sociologist", "hubert", "knoblauch", "carlos", "belvedere", "shown", "relevance", "schutz", "framework", "communication", "theory", "question", "social", "ontology", "respectively", "austrian", "economic", "school", "continued", "make", "use", "schutz", "work", "daniela", "griselda", "lópez", "shown", "lópez", "dreher", "argued", "schutzian", "theory", "adequately", "account", "exercise", "institutional", "power", "interplay", "objective", "structure", "subjective", "meaninginterpretation", "idea", "relevance", "imposed", "upon", "agent", "michael", "staudigl", "george", "berguno", "edited", "collection", "essay", "connection", "schutzian", "approach", "various", "hermeneutic", "tradition", "staudigl", "michael", "barber", "highlighted", "connection", "schutz", "philosophy", "multiple", "reality", "religion", "humor", "furthermore", "collection", "essay", "addressed", "value", "schutz", "paradigm", "music", "literature", "art", "work", "alfred", "schutz", "open", "wide", "field", "fruitful", "addressing", "multiple", "theme", "underpinning", "supporting", "multiple", "discipline", "2016", "scholarly", "community", "schutzian", "tradition", "commemorated", "passing", "thomas", "luckmann", "one", "schutz", "renowned", "student", "developed", "thought", "diverse", "way", "fiftieth", "anniversary", "publication", "social", "construction", "reality", "commemoration", "took", "place", "editing", "three", "major", "collection", "social", "constructivism", "paradigm", "lebenswelttheorie", "und", "gesellschaftsanalyse", "mathesis", "universalis", "work", "focus", "luckmann", "work", "including", "structure", "lifeworld", "luckmann", "coauthored", "schutz", "several", "essay", "address", "aspect", "schutz", "thought", "objective", "dimension", "societal", "institution", "contrast", "interpretation", "institution", "subjectivistic", "devoid", "powerrelationships", "eberle", "2019", "knoblauch", "2019", "mijić", "2018", "srubar", "2019", "possibility", "communicative", "construction", "reality", "knoblauch", "2019", "schutzian", "paradigm", "preservation", "agent", "potential", "resist", "societal", "control", "contrast", "bourdieu", "account", "habitus", "dreher", "2019", "role", "body", "werelationships", "meyer", "2018", "capacity", "schutzian", "framework", "account", "resilience", "face", "trauma", "endress", "2021", "inequality", "imposed", "relevance", "lópez", "2021", "space", "bodiliness", "pertinent", "lifeworld", "protosociology", "mijić", "2018", "dörfler", "rothfuss", "2021", "steets", "2021", "degree", "freedom", "within", "schutz", "relevance", "theory", "göttlich", "2021", "linkage", "schutz", "phenomenology", "recent", "representative", "frankfurt", "school", "hartmut", "rosa", "gros", "2021", "wannenmacher", "2021", "role", "lifeworld", "mathesis", "universalis", "groundstructure", "human", "experience", "make", "possible", "comparison", "culture", "without", "reliance", "specific", "feature", "one", "culture", "dreher", "2021", "meyer", "2021", "sebald", "2009"]}