{"url": "semiotics-medieval", "title": "Medieval Semiotics", "authorship": {"year": "Copyright © 2011", "author_text": "Stephan Meier-Oeser\n<meier-oeser@t-online.de>", "author_links": [{"http://www.geisteswissenschaften.fu-berlin.de/we01/institut/mitarbeiter/pd_apl_hon/meieroeser/": "Stephan Meier-Oeser"}, {"mailto:meier-oeser%40t-online%2ede": "meier-oeser@t-online.de"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2011</a> by\n\n<br/>\n<a href=\"http://www.geisteswissenschaften.fu-berlin.de/we01/institut/mitarbeiter/pd_apl_hon/meieroeser/\" target=\"other\">Stephan Meier-Oeser</a>\n&lt;<a href=\"mailto:meier-oeser%40t-online%2ede\"><em>meier-oeser<abbr title=\" at \">@</abbr>t-online<abbr title=\" dot \">.</abbr>de</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Fri Dec 19, 2003", "substantive revision Wed May 11, 2011"], "preamble": "\n\n\nThis entry intends to give an account of the most important stages\nof the medieval history of semiotics by providing a general\nchronological survey of the main sources and theoretical developments\nof the medieval notion of sign.\n", "toc": [{"#1": "1. Semiotics:its place in the framework of scholastic disciplines"}, {"#2": "2. The late ancient sources of medieval semiotics"}, {"#2.1": "2.1 Augustine (354–430)"}, {"#2.2": "2.2 Boethius (480–528)"}, {"#3": "3. Semiotic beginnings in the 11th and 12th century"}, {"#4": "4. The genesis of an elaborate theory of signs in the second half of 13th century"}, {"#4.1": "4.1 Ps.-Robert Kilwardby"}, {"#4.2": "4.2 Roger Bacon (ca. 1214-ca. 1293)"}, {"#5": "5. Grammatica Speculativa and its critics"}, {"#6": "6. Mental concepts as signs"}, {"#7": "7. The sign as a central notion in 14th-century logic"}, {"#8": "8. The concept of sign in scholastic logic of 15th and early 16th-century"}, {"#Bib": "Bibliography"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Semiotics: its place in the framework of scholastic disciplines\n\n\nTo speak of medieval semiotics is not to speak of a precisely\ndefined discipline besides, and distinct from, other medieval arts and\nsciences; it is rather to speak of a complex field of more or less\n— mostly more — elaborate reflections on the concept of\nsign, its nature, function, and classification. In order to understand\nthe enormous extent to which such theories grew during the Middle Ages\nsome basic formal features of the scholastic organization of knowledge\nhas to be kept in mind. First, scholastic learning is essentially a\ncommentary tradition. Most of the writings either are explicit\ncommentaries on what at a time were taken to be canonical texts (as\ne.g., the works of Aristotle, the Sentences of Peter Lombard,\nthe Grammar of Priscian, or the Summulae Logicales of\nPeter of Spain or Buridan) or are at least composed with constant\nreference to the topics treated there. A second point, closely related\nto the first, is the common scholastic practice of putting great effort\ninto the conceptual analysis of the basic terms and notions. Thus,\nwherever terms like ‘sign’ (signum) or\n‘representation’ (repraesentatio) appeared in the\ntexts commented on, scholastic authors felt obliged either to give an\nexplicit account of these concepts or at least to be able to refer to a\nplace where this has been done. In view of this, the fact that\nAristotle in his On Interpretation had incidentally called the\nword a ‘sign’ (semeion, symbol) of the mental\nconcept or that Augustine had termed the sacrament a ‘sacred\nsign’ (signum sacrum) became most important for the\nlater development of semiotics. For in both cases the outcome was a\nlarge number of detailed explorations of the nature and divisions of\nsign. Both points combined resulted in a general tendency towards an\nincreasing complexity and refinement of the scholastic discourse. For\nit is part of the intrinsic logic of any commentary tradition — a\nclose parallel can be found in the Indian tradition of logic and\nsemiotics that we do not discuss here — that all later\ncommentaries, which in many cases are actually meta-commentaries, have\nto compete with the previous ones and to surpass them in elaboration by\ntaking up, evaluating, or commenting on their arguments and\nterminological distinctions.\n\n\nThere are various areas within the scholastic system of arts and\nsciences where a rich tradition of semiotic questions and answers\naccumulated over the centuries (Maierù 1981; Meier-Oeser 1997,\n42–170; Fuchs 1999). Most important are those places located in the\nrealm of the so-called trivium (i.e., grammar, rhetoric and\nlogic), especially in logic where already the determination of its\nprimary subject as well as the discussion of the basic logical notions\n(like ‘term’ or ‘signification’) gave rise to\nexplicit remarks on the concept of sign. The most relevant loci\nclassici of logical contributions to a general theory of sign and\nsignification are: the comments on Aristotle's introductory chapter of\nOn Interpretation (esp. 1. 16a3–8), “the common starting\npoint for virtually all medieval theories of semantics” (Magee\n1989, 8), as well as the commentaries (especially from the\n15th and early 16th century) on the first tract\nof the so-called Summulae Logicales of Peter of Spain, and all\ntexts or parts of logical textbooks that are related to one of the\naforementioned passages. Further considerations with relevance to\nsemiotics within the sphere of logic are to be found, though less\nfrequently, in the commentaries on the final chapter of the Prior\nAnalytics (2, 27 70a-b) where Aristotle had outlined his doctrine\nof inference from\n signs.[1]\n Still within the sphere of trivium,\nvarious efforts to develop grammar into a regular science matching the\nAristotelian standards led, during the second half of 13th\ncentury, to approaches to language either starting from the general\nconcept of sign (Bacon, Ps.-Kilwardby) or taking grammar as a theory\nreflecting on the fundamental structure of sign systems (grammatica\nspeculativa).\n\n\nA rich source of semiotic material is also to be found in the\ntheologico-philosophical tradition. The loci classici of\nsemiotic discussions in the Commentaries on the Book of\nSentences (Liber Sententiarum) of Peter Lombard,\nthe basic scholastic textbook in theology, are particularly\nthe comments on book 1, distinction 1: the sign as subject and means of\nall instruction; bk. 1, dist. 3: the differences between images and\ntraces and their respective epistemic value; bk. 1, dist. 27: mental\nconcepts, spoken words and their signification; bk. 2, dist. 10: the\ncommunication of\n angels;[2]\n and, last but not least, bk. 4, dist. 1: the\nsacramental sign and the sign in\n general.[3]\n Outside the\nphilosophical and theological discourse, the notion of sign\ntraditionally played an important role in the theory and practice of\nmedical diagnostics (Maierù 1981: 64ff).\n2. The late ancient sources of medieval semiotics\n\n\nThe core set of ideas and doctrines from which medieval philosophers\ndeveloped their semiotic theories was provided to them mainly by two\nlate ancient authors. Besides Boethius (480–528), who transmitted\nAristotelian semantics to the Latin Middle Ages, Augustine's (354–430)\ndoctrine of sign is the most important junction of ancient and medieval\ntheories of sign and signification. Augustine's doctrine also has to be\nseen as a decisive turning point in the history of semiotics.\n2.1 Augustine (354–430)\n\n\nAugustine's assertions and remarks, even though they do not offer a\ncompletely uniform concept of sign, were fundamental to the development\nof medieval semiotic, and they constituted the only elaborate theory of\nsigns until the 13th century (apart from the original theory\nof Peter Abelard). In his incomplete early work, De\nDialectica, Augustine massively draws on the terminology of the\nStoic philosophy of language, though in many points fundamentally\nmodifying its sense.[4]\n It is especially in the concept of sign\nwhere his difference from Stoic doctrines becomes apparent. For\naccording to the most refined theory of Stoic logicians, a sign in the\nproper technical sense (semeion) was seen as the abstract\npropositional content of a sentence insofar it is functioning as the\nantecedent in a true implication by means of which a hitherto unknown\ntruth is revealed. By contrast, Augustine is favoring a reifying\nconcept of sign. A sign, as he defines it in line with the descriptions\ngiven by Cicero and the Latin tradition of\n rhetoric,[5]\n is “something that shows itself to the senses and something other\nthan itself to the mind” (Signum est quod se ipsum sensui et\npraeter se aliquid animo ostendit) (Augustine De dial.\n1975, 86). The concept of sign, thus defined in terms of a triadic\nrelation (a sign is always a sign of something to\nsome mind), provides the general basis for Augustine's theory of\nlanguage: “To speak is to give a sign in articulate voice”\n(Loqui est articulata voce signum dare) (Augustine De\ndial. 1975, 86). Speech, in further contrast to Stoic semantics,\nis essentially characterized by its communicative function. A word, by\ndefinition, is a “sign of something, which can be understood by\nthe hearer when pronounced by the speaker” (uniuscuiusque rei\nsignum, quod ab audiente possit intelligi, a loquente prolatum)\n(Augustine De dial. 1975, 86). The communicative\nfunction[6]\n is thus essential to the linguistic sign:\n“There is no reason for signifying, i.e., for giving signs except\nto convey into another's mind what the sign-giver has in his own\nmind” (Nec ulla causa est nobis significandi, id est signi\ndandi, nisi ad … traiciendum in alterius animum id quod animo\ngerit qui signum dat) (Augustine De doctr. chr. II 3,\n1963, 34: 17–20). In his dialogue De Magistro (On the\nTeacher), however, written shortly after De Dialectica,\nAugustine denies that words or signs have the power of\n‘showing’ anything in the sense of making something present\nto the understanding (Non … mihi rem, quam significat,\nostendit verbum…) (Augustine De magistro X 32,\n1974, 191). For this reason, still influenced by the tenets of the\nskeptical tradition at that\n time,[7]\n Augustine was limiting\nthe capacity of the sign to its admonitory or commemorative function\n(Augustine De magistro XI 36, 1974, 194).\n\n\nBut in De Doctrina Christiana, after abandoning the\nskeptical position, Augustine redefines the sign accordingly, claiming\nthat “a sign is something which, offering itself to the senses,\nconveys something other to the intellect (Signum … est res\npraeter speciem quam ingerit sensibus, aliud aliquid ex se faciens in\ncogitationem venire) (Augustine De doctr. chr. II 1,\n1963, 33). In contrast to his former view, he is now attributing a\nfundamental epistemic function to the sign, claiming that “all\ninstruction is either about things or about signs; but things are\nlearnt by means of signs” (Omnis doctrina vel rerum est vel\nsignorum, sed res per signa discuntur) (Augustine De doctr.\nchr. I 1, 1963, 9). The borderline between things and signs and\nthus the sign itself is defined functionally rather than ontologically:\nsigns are things employed to signify something (res … quae\nad significandum aliquid adhibentur) (Augustine De doctr.\nchr. I 1, 1963, 9). Augustine divides the sign into the two main\nclasses of natural signs (signa naturalia) and given signs\n(signa data). “Natural signs are those which, apart from\nany intention or desire of using them as signs, do yet lead to the\nknowledge of something\n else”,[8]\n as, for example, smoke\nwhen it indicates fire, the footprint of an animal passing by, or the\ncountenance of an angry or sorrowful man. “Conventional signs, on\nthe other hand, are those which living beings mutually exchange in\norder to show, as well as they can, the feelings of their minds, or\ntheir perceptions, or their\n thoughts.”[9]\n Whether and to what\nextent such an “intention to signify” (voluntas\nsignificandi) can be assumed in cases of animal sign communication\nAugustine leaves\n open.[10]\n\n\nThe signs used in human communication are further subdivided with\nregard to the senses to which they address themselves: “some\nrelate to the sense of sight, some to that of hearing, a very few to\nthe other senses”. The preeminent role among all sorts of\n“given signs”, that Augustine is claiming for the words,\ndoes not result from their quantitative preponderance but rather from\nthe fact that, as he points out, everything that is indicated by\nnonverbal signs can be put into words but not vice versa\n(Augustine De doctr. chr. II 7, 1963, 35). ‘Word’\n(verbum) in its proper sense means — at least for the\nearly Augustine — ‘spoken word’. Writing\n(litterae), introduced by man in order to impart permanency to\nspoken language, is just a secondary system of signs, consisting of\n“signs of words” (signa verborum) rather than of\nwords itself (Augustine, De doctr. chr. II 8, (Ibid.); De\ndial. 1975, 86f.).\n\n\nIn close analogy to this devaluation of the written word against the\nspoken one, Augustine in his later theory of verbum mentis\n(mental word) is advocating the devaluation of the spoken word\nand the external sign in general against the internal sphere of mental\ncognition. It is now the mental or interior word (verbum\ninterius), i.e., the mental concept, that is considered as word in\nits most proper sense, whereas the spoken word appears as a mere sign\nor voice of the word (signum verbi, vox verbi)\n(Augustine, De Trinitate XV 11 20, 1968,\n 486f.).[11]\n Thoughts\n(cogitationes) are performed in mental words. The verbum\nmentis, corresponding to what later was called the conceptus\nmentis or intellectus, is by no means a\n‘linguistic’ entity in the proper sense, for it is\n“nullius linguae”, i.e., it does not belong to any\nparticular spoken language like Latin or Greek. So we are confronted\nwith the paradoxical situation that linguistic terminology (e.g.,\nverbum, locutio, oratio, dicere, etc.) is used to describe a\nphenomenon whose independence from any language is strongly emphasized\nat the same time.\n\n\nDespite all the internal ruptures and inconsistencies, Augustine's\ndoctrine of sign is based on a definition of the sign that, for the\nfirst time, intends to embrace both the natural indexical sign and the\nconventional linguistic sign as species of an all-embracing generic\nnotion of sign, thus marking a turning point in the history of\nsemiotics.\n2.2 Boethius (480–528)\n\n\nEven though Boethius, in line with the Aristotelian writings he\ncommented on, focuses on the concept of linguistic signification and\nhardly ever explicitly speaks of signs (notae) in general\n(Magee 1989, 61ff.), he is, besides Augustine, the main source for\nmedieval theories of signs. This is explained by the fact that, due to\nAugustine's influence, the semantics of linguistic signs became the\nfocus of semiotic theory, and that Boethius with his translations of\nand comments on parts of the Aristotelian Organon (especially\nPeri Hermeneias) is the most important, and for a long time\nthe only available, source for medieval acquaintance with the semantics\nof Aristotle and his Neoplatonic commentators of late antiquity. Thus,\nthe medieval philosophers viewed Aristotle's logic at first through the\neyes of Boethius, who has made some influential decisions concerning\nsemantic terminology (Engels 1963), as well as the interpretation of\nthe Aristotelian text. What they learned through his writings were\ninter alia the insight into the conventional character of\nlanguage, the view that meaning is established by an act of\n‘imposition’, i.e., name-giving or reference-setting, and\nthe influential idea that to signify (significare) is to\n“establish an understanding” (intellectum\nconstituere).\n\n\n\n\nEspecially in his more elaborate second commentary on Peri\nHermeneias, Boethius discusses at length the interrelations\nbetween the four elements of linguistic semeiosis mentioned by\nAristotle, i.e., between external objects or things (res),\nmental concepts or representations (passiones,\nintellectus), spoken words (voces), and written words\n(scripta). These elements are arranged so that they build up\nwhat Boethius calls the “order of speaking” (ordo\norandi) (Magee 1989, 64–92) which is characterized by the fact\nthat among the elements mentioned the former in each case ontologically\nprecedes the latter. Thus, without the existence of things there would\nbe no concepts, without concepts no spoken words, and without spoken\nwords no written ones. This, however, is not reversible in that sense\nthat the use of written characters in any case demands the knowledge of\nthe vocal expressions denoted by them, that there is always a concept\nbehind a spoken word, and that every concept refers to a real thing as\nits object (Boethius In Periherm. ed. sec., 1880: 21, 28–30).\nIn any case, the ordo orandi determines the direction of\nlinguistic signification: written characters signify spoken words,\nwhereas spoken words primarily signify mental concepts and, by means of\nthe latter, secondaryly denote the things. Thus, scriptura\nleft aside, the remaining three elements are structurally organized\nalong the lines of the prominent ‘semiotic triangle’\naccording to which signs refer to things by means of concepts (Boethius\nIn Periherm. ed. sec., 1880: 24, 33). In his further\ndiscussion of the ordo orandi Boethius divides, with reference\nto Porphyrius and the Aristotelians (peripatetici), three\nlevels of speech: besides — or rather at the fundament of —\nwritten and spoken discourse there is a mental speech (oratio\nmentis) in which thinking is\n performed.[12]\n It is, just like the\nAugustinian mental word, not made up from words of any national\nlanguages but rather from transidiomatic or even non-linguistic mental\nconcepts which are, as Aristotle has claimed, the same for all men.\n3. Semiotic beginnings in the 11th and 12th century\n\n\nIn the late 11th century Anselm of Canterbury (1033–1109)\nrevived the Augustinian doctrine of the verbum mentis,\ncombining it with the Aristotelian view on mental concepts outlined in\nthe opening chapter of Peri Hermeneias. Thus, the two aspects\nof the mental word — which are found more or less implicitly in\nAugustine's work already — became explicit in Anselm. First:\nmental words are natural words and thus identical for all human beings\n(they are “verba … naturalia … et apud omnes\ngentes eadem”) (Anselm of Canterbury, Monolog.,\n1968: 25); and second: they are similitudes and mental images of things\n(similitudines et imagines\n rerum).[13]\n Due to this, they\nsignify their objects in a more expressive way (expressius\nsignant) than any other kind of words, and thus they are, as\nAnselm agrees with Augustine, what has to be termed ‘word’\nin its most proper sense (Anselm of Canterbury, Monolog.,\n1968: 25).\n\n\nA constitutive factor of the emergence of a medieval theory of signs\nwithin the context of grammar and logic is the resumption of\nAugustine's practice of embedding the concept of language into the\ngeneric notion of sign. Already Peter Abelard (1079–1142), in many\nrespects the most important author of the 12th century,\npoints out, that the phenomenon of linguistic signification\n(significatio vocum), falling into the sphere of competence of\nlogic, does not cover the whole range of sign processes (Abelard:\nDe dial., 1956: 111). For things in the broadest sense may\nfunction as signs, too, if they are connected to each other in such a\nway that the perception of one leads to the cognition of the other.\nThis can be the case when the one thing is an image of the other, when\nthings are either arbitrarily imposed to exercise the function of\nsignifying (significandi officium), as for instance the famous\ncirculus vini, a wreath of foliage, attached outside the\ntavern, indicating that wine is sold inside, or the conventional\ngestures of monastic sign\n languages,[14]\n or when two things, by being repeatedly noticed in conjunction, are\ncustomarily (secundum consuetudinem) associated with each\nother, or, finally, when they bear some sort of relationship to each\nother (secundum aliquam earum ad se\n habitudinem).[15]\n\n\nAbelard apparently is well aware of the fact that the concept of\nsign that results from taking into account all these cases as instances\nof signification is not only general but also unspecific. In order to\nbe able to single out cases of “properly signifying”\n(proprie significare) from such a ‘pansemiotic’\nsetting, he introduces a distinction, distinguishing between signs that\nsimply signify (signa significantia) and signs that are, as\nsignificative signs (signa significativa), i.e., as bearers of\nmeaning, involved in processes of intended sign-giving (Abelard De\ndial., 1956: 111; Log. ‘Ingredientibus’,\n1927: 336ff).\n4. The genesis of an elaborate theory of signs in the second half of 13th century\n\n\nThe genesis of an elaborate theory of signs in the second half of\nthe 13th century is the result of a complex interplay of\nAristotelian and Augustinian influences. Since the mid-13th\ncentury Augustinian views, until then effective mainly in theological\ndiscussions, begin to invade the faculties of arts. Due to this, the\nsign is increasingly taken as the basic concept of the\n‘linguistic science’ (scientia\nsermocinalis):[16]\n “Speech is nothing but a sign”\n(Sermo totaliter signum est), Robert Kilwardby asserts\n(Kilwardby De ortu scientiarum, 1976, 160). Roger Bacon\npraises the sign even as the principal instrument of all Liberal\n Arts.[17]\n It is true, the consciousness of words\nbeing signs is nothing new. From this point onward, however, it gives\nrise, at first in the framework of grammar theory, to semiotic\nreflections that go beyond what is known from earlier centuries.\n4.1 Ps.-Robert Kilwardby\n\n\nThe unknown author, now commonly named Ps.-Robert Kilwardby, opens\nhis commentary on Priscianus maior (written somewhere between\n1250 and 1280)[18]\n by modifying Augustine's prominent dictum\nthat “all instruction is either about things or about\nsigns” into the stronger and more ‘semiotic-minded’\nthesis that “every science is about signs or things\nsignified” (scientia omnis aut est de signis aut de rebus\nsignificatis) (Ps.-Robert Kilwardby: Comment. on “Prisc.\nMaior”, 1975, 1). This statement he takes as starting point\nof a detailed discussion of the questions of whether there can be a\n(special) science of\n signs[19]\n and, if so, what its relationship towards\nthe sciences dealing with things would be\n like.[20]\n Ps.-Kilwardby points\nout that there are several ‘sciences of signs’\n(diversae sunt scientiae de signis) according to the various\nkinds of signs (Ps.-Robert Kilwardby: Comment. on “Prisc.\nMaior”, 1975, 3). Since, however, any discipline, in order\nto meet the Aristotelian standard of science as it began to be accepted\nat that time, must have a general subject matter, the scientia de\nsignis necessarily contemplates the sign “in terms of a\nuniversal notion abstracted from the particular signs” (sub\nratione universalis abstracti a particularibus signis) (Ps.-Robert\nKilwardby: Comment. on “Prisc. Maior”, 1975, 4).\nIn case of natural signs (signa naturalia) as well as\n“moral signs” (signa moralia), as e.g., actions in\nrelation to the good or bad will, the theory of signs cannot be\nseparated from the theory of things signified; therefore, these signs\nfall under natural and moral science, respectively (Ps.-Robert\nKilwardby: Comment. on “Prisc. Maior”, 1975, 6).\nThe linguistic signs, however, produced by the human understanding for\nthe purpose of communicating its ideas, are the subject-matter of a\nrational science (scientia rationalis), the science of\nsigns.\n4.2 Roger Bacon (ca. 1214-ca. 1293)\n\n\nRoger Bacon is probably the most important medieval theorist of sign\n— at least he is the author of the most extensive medieval tract\non signs known so\n far.[21]\n Starting from a minute analysis of the\nnotion of sign and its various divisions, Bacon develops both in De\nsignis (ca. 1267) and in his Compendium studii theologiae\n(1292) a general conception of signification as well as a detailed\ntheory of the linguistic sign, so that here, as in Augustine, semantics\nis integrated into a broader theory of sign in general. According to\nBacon, the concept of sign belongs to the category of relation. To be\nmore precise, a sign, as it was pointed out already in Augustine's\ndefinition, is a triadic relation, such that it is — in principle\n— a sign of something to someone. This way of\nputting the point, however, gives rise to the question of whether both\nrelata of this relation are equally essential for its\nexistence. What would happen if one of these relata did not\nexist? What if the designated thing ceased to exist? And what if there\nwere no cognitive power taking notice or even being able to take notice\nof the sign?\n\n\nBonaventura (ca. 1217–1274), one of the most renowned theologians of\nthe time, explicitly places emphasis on the sign's relation to the\nsignificate, claiming that\n… a sign has a twofold comparison: both to that\nwhich it signifies, and to that to which it signifies; and the first is\nessential and the sign always has it in act, but the second it has in\nhabit; and it is from the first that it is called a sign, not\nfrom the second. Whence a circle above a tavern is always a sign, even\nif no one looks at\n it.[22]\n\n\nIn direct opposition to this commonly accepted manner of\npresentation, Bacon lay stress on the ‘pragmatic’ relation\nto the sign-interpreter, for the notion of sign is, as he claims,\n“essentially predicated with respect to someone to whom it\nsignifies. … For if no one could conceive something through the\nsign, it would be void and vain, nay, it wouldn't be a sign.”\n(Roger Bacon, De signis, 1978, 81). Other than the essential\nrelation of an actual sign to its interpreter, which must be in any a\ncase what was called a ‘real relation’ (relatio\nrealis), the relation to the significate can be a so-called a\n‘relation of reason’ (relatio rationis), for, as\nBacon adds: “It does not follow ‘a sign is in act,\ntherefore the thing signified exists’, because nonentities can be\nsignified by words just like entities” (Roger Bacon, De\nsignis, 1978, 81). There are other important points in which Bacon\ndeviates from the common opinion: He defines the sign as “that\nwhich upon being offered to the sense or intellect designates something\nto the intellect itself” (illud quod oblatum sensui vel\nintellectui aliquid designat ipsi intellectui), and emphasizes\nthat, contrary to what the common description says, there are signs\nwhich are offered only to the\n intellect.[23]\n\n\nBacon presents a detailed classification of\n signs[24]\n by\ntaking up, combining, and modifying elements of several prior sign\ntypologies. The division of the two main classes of natural and given\nsigns is taken from Augustine, the distinction between necessary and\nprobable signs is borrowed from Aristotle (an. pr. II, 27, 70a3-b5),\nand their subdivision according to their temporal reference is a\ntraditional element in the theories of the sacramental\n sign.[25]\n\n1. NATURAL SIGNS \n\n\n1.1 signifying by inference, concomitance, consequence \n\n\n1.1.1 signifying necessarily \n\n\n1.1.1.1 signifying something present (large extremeties →\nstrength)\n1.1.1.2 signifying something past (lactation → birth of a\nchild)\n1.1.1.3 signifying something future (dawn → imminent\nsunrise)\n\n\n1.1.2 signifying with probability \n\n\n1.1.2.1 signifying sth. present (to be a mother → love)\n1.1.2.2 signifying sth. past (wet ground → previous rain)\n1.1.2.3 signifying sth. future (red sky in the morning →\nrain)\n\n\n\n\n1.2 signifying by configuration and likeness (images, pictures,\nspecies of colour)\n1.3 signifying by causality (tracks → animal)\n\n\n2. SIGNS GIVEN AND DIRECTED BY A SOUL \n\n\n2.1 signifying instinctively without deliberation (sigh →\npain; laughter → joy)\n2.2 signifying with deliberation (words)\n2.3 interjections\n\n\n\n\n\nThe general class of natural signs signifying unintentionally by\ntheir essence (1) is divided according to the relation between a sign\nand its significate into the three subclasses of (1.1) inferential\nsigns based on a more or less constant concomitance of sign and\nsignificate, (1.2) iconic signs, based on similarity in appearance, and\n(1.3) signs based on a causal relation between the sign and the\nsignified thing. The signs of inference (illatio) are\nsubdivided into (1.1.1) necessary and (1.1.2) probable signs, both of\nwhich are further differentiated according to the three possible\ndirections of temporal reference (present, past, future). Bacon gives\nto understand that he takes inferential and iconic signs to be signs\nmore properly than the members of third class, i.e., signs based on a\ncausal relation (later in the Compendium studii theologiae he\nwill drop this class entirely). He justifies this by pointing to the\nfundamental difference between sign relations and causal relation:\nwhereas sign relations are necessarily constituted by an interpreter,\ncausal relations exist independently of any such one alone by reason of\nthe order of\n nature.[26]\n\n\nThe general class of signs given and directed by a soul (signa\nordinata ab anima) (2) is divided according to whether the living\nbeing brings forth the sign (2.1) together with a deliberation by\nreason and choice of will (cum deliberatione rationis et electione\nvoluntatis), or (2.2) by a natural instinct or impulse\n(instictu naturali et impetu naturae). The reason for\ndistinguishing two modes of natural signifying, as they appear in (1)\nand (2.1), is, on the one hand, an equivocation of the concept of\nnature, meaning “substance or essence of something”\n(substantia sive essentia cuiuslibet), as well as “force\nacting without deliberation” (virtus agens sine\ndeliberatione) (De signis, 1978, 85f.) and, on the other\nhand, the insight that, contrary to what holds for the natural signs in\nthe first sense, in the case of the latter there is always a\nsign-giver, not only someone taking something as a sign. Interjections\n(2.3) are considered as a hybrid of the two other sorts of given\nsigns.\n\n\nIt has to be noticed that in Bacon's, as well as in any other\nmedieval sign-typology, the classes of signs — even though this\nis not explicitly stated by the authors themselves — distinguish\nmodes of signifying rather than signs in the sense of sign-vehicles.\nTherefore, one and the same thing, fact, or event may, in different\nrespects, fall under various and even opposite sign-classes. This fact\nis especially important for the full account of sign-processes in which\nspoken language is involved.\n\n\nThe primary intention of Bacon's semiotic analyses is, as it was\nalready with Augustine, to provide the foundations for the semantics of\nspoken language.[27]\n According to Bacon, an adequate and\ncomplete account of the “difficult issue” (difficilis\ndubitatio) of what the significate of a vocal expression is has to\nconsider three different aspects: 1) the signification of vocal\nexpressions apart from impositio, i.e., apart from their being\nendowed with (conventional) meaning by ‘imposition’, 2)\ntheir signification according to imposition, and 3) their signification\nover and above imposition.\n\n\n1) Each vocal expression may serve independently from its imposition\nas a natural sign (De signis, 1978, 86f.) Words indicate for\ninstance the speaker being close, and they may ‘tell’\nsomething about him in the same way as an artwork is indicating the\nskills of the artist. Furthermore, the spoken word is a natural sign\nimplying that the speaker possesses the concept of the object meant by\nthe word according to its regular meaning. For the significative use of\nlanguage presupposes the presence of a concept in the speaker's mind\nthat corresponds to the object denoted (De signis, 1978, 85f.,\nComp. studii theol., 1988, 64). Thus, the relation between the\nvocal expression and the mental concept is, contrary to what was the\ncommon opinion since the days of Augustine and Boethius, not a relation\nof expression but rather of indexical signification.\n\n\n2) In his account of signification of words regarding their\n‘impositio’ Bacon accentuates the arbitrariness of\nmeaning.[28]\n But even though the first\n‘impositor’ (name-giver) is free to impose a word or sign\non anything whatsoever, he does perform the act of imposition according\nto the paradigm of baptism: “all names which we impose on things\nwe impose inasmuch as they are present to us, as in the case of names\nof people in\n Baptism”.[29]\n Contrary to the venerable tradition of\nAristotelian, Boethian or Porphyrian\n Semantics,[30]\n holding that spoken\nwords, at least immediately, signify mental concepts, Bacon favors the\nview that words, according to their imposition, immediately and\nproperly signify the things themselves. With this account of linguistic\nsignification Bacon abandons the model of the semantic\n triangle[31]\n and\nmarks an important turning point on the way from the traditional\nintensionalist semantics to the extensionalist reference semantics as\nit became increasingly accepted in the 14th\n century.[32]\n\n\nBacon is, however, well aware of the fact that the use of names and\nwords in general is not restricted to the meaning endowed through the\nfirst act of imposition (the term ‘homo’ does not only\ndenote those men that have been present when the original act of its\nimposition took place); nor do words cease to be used when their\noriginal significata (things signified) no longer physically\nexist (Bacon, De signis, 1978, 128). Bacon intends to solve\nthe resulting difficulties (which every causal theory of meaning based\non the concepts of ‘reference setting’ and ‘reference\nborrowing’ has to face) by distinguishing two modes of\nimposition. This can be seen as his most inventive contribution to\nsemantics.[33]\n Besides the ‘formal’ mode of\nimposition conducted by a ‘perlocutionary’ vocal expression\nlike “I call this …” (modus imponendi sub forma\nimpositionis vocaliter expressa) there is another kind taking\nplace tacitly (sine forma imponendi vocaliter expressa)\nwhenever a term is applied (transumitur) to any object other\nthan the first name-giver has ‘baptized’ (Bacon, De\nsignis, 1978, 130). Whereas the formal mode of imposition refers\neither to the mythical situation of a first invention of language or to\nthe act of explicitly coining a new word, the second kind of imposition\ndescribes what actually happens during the everyday use of language.\nThis modification of the meaning of words is constantly taking place\nwithout the speaker or anyone else being actually aware of it. For just\nby using language we “all day long impose names without being\nconscious of when and how” (nos tota die imponimus nomina et\nnon advertimus quando et quomodo) (Bacon, De signis,\n1978, 100, 130f.)\n\n\n3) Even if impositio in the described sense is of pivotal\nimportance for the constitution of linguistic meaning, the\nsignification of words is by no means limited to it: “a vocal\nexpression signifies many things for which it is not imposed, as it\nsignifies all those things that bear an essential relation to the thing\nfor which the word is\n imposed.”[34]\n In this way, Bacon\nclaims, words signify, as it were, infinitely many\n things.[35]\n5. Grammatica Speculativa and its critics\n\n\nThe idea, fundamental both for Bacon and Ps.-Kilwardby, that grammar\nis a regular science rather than a propaedeutic art, is shared by the\nschool of the so-called “modist grammarians”\n(modistae) emerging around 1270 in the Faculty of Arts of the\nUniversity of Paris and culminating in the Grammatica\nSpeculativa of Thomas of Erfurt around 1300. The members of this\nschool, taking it for granted that the objective of any regular science\nwas to explain the facts by giving reasons for them rather than to\nsimply describe them, make it their business to deduce the grammatical\nfeatures common to all languages from universal modes of being by means\nof corresponding modes of understanding. Thus the tradition of\nspeculative grammar (grammatica speculativa) develops the\ncommonly accepted Aristotelian claim (De Interpretatione\n1.16a3–9) that the mental concepts, just as the things, are the same\nfor all men (eadem apud omnes) further to the thesis of a\nuniversal grammar based on the structural analogy between the\n“modes of being” (modi essendi), the “modes\nof understanding” (modi intelligendi), and the\n“modes of signifying” (modi significandi) that are\nthe same for all languages. Along this line, Boethius Dacus (Boethius\nthe Dane), one of the most important theoreticians of speculative\ngrammar,[36]\n states that\n… all national languages are grammatically\nidentical. The reason for this is that the whole grammar is borrowed\nfrom the things … and just as the natures of things are similar\nfor those who speak different languages, so are the modes of being and\nthe modes of understanding; and consequently the modes of signifying\nare similar, whence, so are the modes of grammatical construction or\nspeech. And therefore the whole grammar which is in one language is\nsimilar to the one which is in another\n language.[37]\n\n\nEven though the words are arbitrarily imposed (whence arise the\ndifferences between all languages), the modes of signifying are\nuniformly related to the modes of being by means of the modes of\nunderstanding (whence arise the grammatical similarities among all\nlanguages). Focusing on the terms of ‘sign’ and\n‘signification’, speculative grammar, as a science of\ngeneral cognitive-linguistic structures, prescinds from all the\ndifferent national languages — and even from vocal language as\nsuch. For it is, as Martinus Dacus points out, not essential for\nspeculative grammar to deal with vocal expressions or with structures\nof vocal sign systems, because any kind of signs could be the object of\nthe considerations of a modist grammarian. The fact that he is\nconcerned with linguistic signs rather than with gestures or the\n“language of eyes” is only due to the fact that vocal\nexpressions are, compared to other kind of signs, more apt for human\ncommunication.[38]\n\n\nSoon after 1300 the modistic approach came under substantial\ncriticism. The main point that critics like Ockham oppose is not the\nassumption of a basic universal grammar, for such a claim is implied in\nOckham's concept of mental grammar, too. Two other aspects of modism\nare in the focus of these criticisms: (1) the assertion of a close\nstructural analogy between spoken or mental language and external\nreality (consimilis distinctio inter voces vel intentiones in anima\nsignificantes et inter ipsa significata) (William of Ockham,\nExpos. in lIbid. Porphyrii de praed., 1978, 158); (2) the\ninadmissible reification of the modus significandi adherent to\nits description as some quality or form added to the articulate voice\n(dictioni superadditum) through the act of imposition. To say\nthat vocal expressions ‘have’ different modes of signifying\nis, as Ockham points out, just a metaphorical manner of speaking; for\nwhat is meant is simply the fact that different words signify whatever\nthey signify in different\n ways.[39]\n According to John\nAurifaber (fl. ca. 1300), a vocal term is significative, or is a sign,\nsolely by being used significatively, not on grounds of something\ninherent in the\n sound.[40]\n In order to assign signification a proper\nplace in reality, it must be ascribed to the intellect rather than to\nthe vocal sound (significare est accidens intellectus; sed vox est\nillud quo significat intellectus) (Aurifaber, Determ. de modis\nsignif., 1967, 226). The criticism of modist grammar is based on a\nfundamental redefinition of the concept of sign, coming about after the\nmid-13th century. For the translocation of signification in\nthe proper sense from the word to the intellect is based on the\npresupposition that, whatever Augustine may have said, mental concepts\nare signs themselves.\n6. Mental concepts as signs\n\n\nIn 12th- and early 13th-century logical\ntextbooks the concept of sign does not play an important role yet.\n‘Sign’ in its technical sense is taken as the name of the\nso-called syncategorematic terms (e.g., omnis [every],\nnullus [no] as signa universalia or universal signs,\nquidam [a certain], aliquis [some] as signa\nparticularia or particular signs) (L. M. de Rijk, 1965–67,\nII/2.383).[41]\n In line with the text of Aristotle's\nPeri Hermeneias and its translation by Boethius, only written\nand spoken words were said to signify. Mental concepts (passiones\nanimae, intellectus, conceptus) were seen as\nlikenesses (similitudines) rather than as signs of things.\nOnce again, it is the mid-13th century where a conceptual\nchange is taking place which, although at first it may seem to be a\nmatter of nuance, turns out to be one of the most important junctures\nin the history of semiotics: mental concepts — without at first\nlosing their status of being likenesses of things — begin to be\ncharacterized as signs of things (signa rerum). It is true\nthat there are some few passages in Boethius, Anselm, and Abelard\nalready pointing in this direction (Boethius, In Periherm. ed.\nsec., 1880, 24; cf. Magee, 1989, 71; Anselm of Canterbury,\nMonolog., 1968, 25; Abelard, Log.\n‘Ingredientibus’, 1927, 315f.). But it is not until\nthe second half of 13th century that this idea achieves\ngeneral acceptance and gains relevance to the theory of\n sign.[42]\n\n\nThe consequences of this view are many: for instance, the rejection,\nor at least the modification, of Augustine's venerable definition of\nthe sign, and the new possibility to describe the relationship between\nthe concept and its object without referring to the notion of\nsimilitude. Furthermore, in the semantic triangle, the Boethian\nordo orandi now can be described entirely in terms of sign and\nsignificate.[43]\n Insofar as concepts agree with vocal\nexpressions in their function of being signs, it makes sense to\nconceive of thought processes as a kind of mental speech (oratio\nmentalis) showing close analogies to spoken discourse. This again\npaves the way for the development of a mentalist logic, the principal\nobjects of which are not the vocal terms and propositions any longer,\nbut rather the corresponding mental acts. The definition of mental\nconcepts as signa rerum also provides the basis of a close\ninterconnection of logic and epistemology as it is characteristic\nespecially of the later Middle Ages. In conjunction with this, a\nredefinition of the notion of signification (significare) is\ntaking place. For where the mental concepts, i.e., the acts of\nunderstanding (intellectus), are considered to be signs\nthemselves, the Aristotelian definition of significare\n(signifying) as to constitute an understanding (constituere\nintellectum) can no longer be regarded as adequate. As a result,\nthe terminology of ‘representation’\n(repraesentatio, repraesentare, facere\npraesens), originally used mainly in epistemological contexts,\nachieves an increasing importance for logical semantics by being fused\nwith the terminology of ‘signification’. Finally, the\ndescription of mental concepts as signs can also be seen as one of the\nmain motifs for the general account of signs as it emerges in late\nmedieval logic. For it is only under this condition that logic is no\nlonger concerned exclusively with arbitrary signs but also — and\neven primarily — with natural signs.\n7. The sign as a central notion in 14th-century logic\n\n\nEven though in 13th-century terminist logic\n‘significatio’ is seen as the foundation of all\n‘properties of terms’ (proprietates terminorum),\nthe generation of William of Sherwood and Peter of Spain is not\nparticularly interested in the concept of signification.\nSignificatio is shortly described as “presentation of\nsome form to the intellect” (praesentatio alicuius formae ad\nintellectus)[44]\n or as “representation of a thing by\nmeans of a conventional vocal expression” (rei per vocem\nsecundum placitum repraesentatio) (Peter of Spain, Summule\nlogicales, 1972, 79). But the detailed logical discussion\nstarts right away with the concept of suppositio\n(supposition), i.e., from the capacity of substantive terms to stand\nfor something in a propositional context.\n\n\nWith William of Ockham (ca. 1285–1347/49), however, the concepts of\nsign and signification begin to take center stage in logic (Biard\n1981, 452; Biard 1989, Lenz 2003, Panaccio 2004). Logic is seen as\nexclusively concerned with signs, primarily with mental signs,\nsecondarily with vocal or written signs.  Ockham integrates the\nconcept of supposition into his definition of sign. He recognizes that\nthe general notion of sign as something that makes something else come\ninto cognition is too broad to be useful in logic and semantic theory;\ntherefore, he adds to the definition the criterion that a sign, as far\nas its use in logic is concerned, has to be apt to stand for the thing\nit makes come into cognition, or else it has to be such that it could\nbe added to such a sign standing for something (natum est pro illo\nsupponere vel tali addi in propositione) (William of\nOckham, Summa log., 1974, 9).[45] Thus, Ockham's logical concept of sign is\nrestricted to what later will be termed a ‘propositional\nsign’ (signum propositionale) (John Raulin, In log.\nArist. comment., 1500, fol. a5rb). Due to the central\nposition of the notion of sign in his logic, one is entitled to\ncharacterize Ockham's logic as “ruled by the concept of\nsign” (“régie par le concept de signe”)\n(Biard 1989, 102). Ockham, constantly referring to the notion of sign,\nventures in many cases a semiological redefinition of basic logical\nconcepts (Biard 1989, 102–25), which in turn allows him to reformulate\ntraditional ontological issues, as for instance the questions of\nuniversals, the number of categories, or the ontological status of\nrelations, as semantic questions.\n\n\nOckham's logic marks an important, though not the only important,\nstep in the process that might be described as a progressive\n‘mentalization’ of sign. The idea behind this process is\nthe contention that without some sort of ‘intentionality’\nthe phenomena of sign, signification and semiosis in general must\nremain inconceivable. This tendency of relocating the notions of sign\nand signification from the realm of spoken words to the sphere of the\nmind is characteristic of the mentalist logic arising in the early\n14th century, and remaining dominant throughout the later\nMiddle Ages. Words or signs, insofar as they concern rational\ndiscourse, were traditionally held to be the essential subject matter\nof logic. According to mentalist logic, however, the\n‘words’ or ‘signs’ primarily relevant to logic\nare not the spoken words, but the trans-idiomatic mental words\n(verba mentis) or mental concepts. Thus, in later medieval\nlogic, as already in Burleigh and Ockham, the mental sign will be the\nfocus of logical semantics. According to a distinction introduced by\nPeter of Ailly (1330–1421) in the second half of 14th\ncentury,\n…a thing can be called a sign in two senses. In the\nfirst sense, because it leads to an act of knowing the thing of which\nit is a sign. In a second sense, because it is itself the act of\nknowing the thing. In the second sense we may say that a concept is a\nsign of a thing of which such a concept is a natural likeness —\nnot that it leads to an act of knowing that thing, but because it is\nthe very act itself of knowing the thing, [an act that] naturally and\nproperly represents that thing (Peter of Ailly, Concepts,\n1980, 17).\n\n\nEven if Ockham's semantics, as well as his theory of mental language\ngoverned by a trans-idiomatic mental grammar transforming the theorems\nof terminist logic into a theory of thought processes (William of\nOckham, Summa log., 1974,\n 11ff),[46]\n was by no means\nundisputed, and came under severe criticism by his opponents as well as\nno less severe modifications by his ‘followers’. What,\ndespite all the differences, logical authors from the\n14thcentury on generally have in common is their awareness\nof the importance of the concept of sign — even though, of\ncourse, there were exceptions to this rule. Some realistic-minded\ntheologians, such as John Wyclif (1330–1384) or Stanislas of Znoymo\n(fl. ca. 1400), harshly criticize the alleged overestimation of the\nsign by the “teachers of signs” (doctores\nsignorum), as the latter calls them. According to Stanislas, the\nhuman ‘errantry through the vain and useless signs’ of\nlogic is nothing but the necessary consequence of the fall of mankind\n(in penam peccati sumus necessitati in his vacuis et inanis signis\nerranter ambulare) (Stanislas of Znoymo, De vero et\nfalso, 1971,\n 207).[47]\n8. The concept of sign in scholastic logic of 15th and early 16th-century\n\n\nWith Ockham, the concept of sign becomes a central notion of logical\ntheory. However, as a result of Ockham's focus on the propositional\nsign as the only sign relevant to logic, initially only a narrow\nsection of semiotic topics were dealt with in logic. In contrast to\nOckham, late scholastic terminist logic is characterized by an approach\nof discussing logico-semantic topics on the basis of a most general\nunderstanding of the pertinent vocabulary (e.g., terminus,\nsignificare, repraesentare, signum etc.).\nDue to this practice, topics of semiotic relevance, even though not of\ndirect logical concern, began to accumulate at the margins of the\nlogical discourse. The culmination point of this development is reached\nin the Paris school of John Major (John Mair, 1469–1547), the most\nimportant and most influential center of late-scholastic logical\nstudies.[48]\n\n\nThe members of this school take signification or “to\nsignify” in the general sense of to “make (someone) know\n(something)” (facere cognoscere) (Petrus Margallus,\nLog. utriusque scholia, 1520,\n 148),[49]\n and conceive it along\nthe lines of the older description of ‘repraesentare’ in\nits broadest sense according to which the function of representation\ncould be ascribed to all which “in some way contributes to a\nthing being known” (quod aliquo modo facit ad hoc quod res\ncognoscatur).[50]\n Consequently, “to signify”\noften is characterized as “to represent something to an\nintellect” (aliquid intellectui respraesentare) (Albert\nof Saxony, Quaest. in artem vet, 1988, 472; John Raulin,\nIn log. Arist. Comment, 1500, fol. g4vb). In order\nto make this definition cover cases of non intellectual sign\ninterpreters (animals)[51]\n as well as the so-called syncategorematic\nterms which do not properly signify ‘something’\n(aliquid), a still more general version was put forward,\ndefining the act of signifying as “to represent something or some\nthings or somehow to a cognitive power (aliquid vel aliqua vel\naliqualiter potentiae cognitivae repraesentare) (Gaspar Lax,\nParve divis. term., ca. 1502, fol a4vb). This\ndefinition roughly expresses what is basically uncontroversial\nregarding the concept of signification among logicians from late\n14th to early 16th century. Even if there were\nnumerous definitional variants of the concept of signification, which\noften gave occasion to controversies, nevertheless, common to all these\nvariations was their primarily epistemological orientation. Contrary to\nOckham's concept of sign, it is not the logical function of referring\nto a significatum that stands in the foreground, but rather\nthe sign's relation to a cognitive power. In other words, the sign is\nnot primarily characterized by its appropriateness to fulfill a\nsemantic function in the context of a proposition, but rather by its\ncapability to act in an epistemologically efficient way on a cognitive\npower: “A sign is something that makes think” (signum\nest res faciens cogitare) (Petrus Margallus, Log. utriusque\nscholia, 1520, 146). Unlike Ockham's semantic concept of sign, the\none favored by the later authors is predominantly pragmatic.\n\n\nThis tendency is already obvious when Peter of Ailly defines the act\nof signifying as “to represent something, or some things, or\nsomehow to a cognitive power by vitally changing it” (aliquid\nvel aliqua vel aliqualiter potentiae cognitivae ipsam vitaliter\nimmutando repraesentare) (Peter of Ailly, Concepts, 1980,\n16).[52]\n With the particle “vitally changing\nit” (vitaliter immutare) entering into the definition of\n‘significare’ the relatedness to cognition or to a\ncognitive power becomes an essential factor of signification. For, as\nJohn Gebwiler later underlines: “without such a vital change\nnothing is signified to whomsoever” (absque vitali\nimmutatione nihil cuipiam significatur) (John Gebwiler,\nMagistralis totius parvuli artis log. compil., 1511, fol.\nh4r-h4v).\n\n\nIn view of this it should be clear that the widespread opinion\naccording to which in medieval philosophy the sign was characterized by\nthe “classical definition” or the “famous formula of\naliquid stat pro aliquo” (something stands for\nsomething)[53]\n is mistaken. It is suppositio,\nnot significatio, that is characterized by that\nformula.[54]\n Even in Ockham's concept of sign, which\ncomes closest to such a description, the aptitude ‘to stand for\nsomething’ is just one component of the whole function of the\nsign. In no case has the sign or act of signifying been conceived as a\nsimple two-term relation of “something standing for\nsomething”.\n\n\nOn the basis of an extended notion of sign, the authors of late\n15th- and early 16th-century logic discussed at\nlength topics like the different kinds of signification and\nrepresentation (Gaspar Lax, Parve divis. term., ca. 1502, fol.\na5[55]\n or the traditional distinction of natural\nand conventional signs, showing that there exist intermediate forms,\nlike those signs that signify by custom (ex consuetudine)\n(Hagenau, Comment. in prim. et quart. tract. Petri Hisp, 1495,\nfol. a7v; Conrad Pschlacher, Compendiarius parv. log.\nLiber, 1512, fol. 6r-6v), which are\ninstituted neither by nature nor by an act of imposition, but rather\nare established by repetition (frequentatio) (Juan de Oria,\nSummul. vol. Primum, 1987, 109).\n\n\nThe universality of the concept of sign, according to which in some\nrespect “anything in the world is a sign” (omnis res\nmundi est signum) (Peter Margallus, Logices utriusque\nscholia, 1520, 146f.), is counterbalanced by the emphasis laid on\nthe mental sign (signum mentale) providing the basis for the\nwhole range of sign processes. Spoken words, just like any external\nsigns in general, can signify only by mediation of an immediate\nsignification, provided by the mental\n concepts.[56]\n Thus, as Petrus a\nSpinosa says, the whole signification depends on the mental term\n(tota significatio dependet a [termino]\nmentali) (Pedro de Espinosa, Tractatus terminorum,\ncited in Muñoz Delgado, 1983, 152f.) In some respect this claim\neven goes beyond John Gerson's thesis, that “signification is not\nproperly or aptly understood except with respect to an intellectual\nnature that is able to use the sign” (Significatio nec\nproprie nec convenienter accipitur, nisi per respectum ad naturam\nintellectualem, quae potest uti signo) (John Gerson, De modis\nsignificandi, 1706, 816). For what makes any signification\npossible, the cognitive act, is conceived to be a sign or an act of\nsignification in the most proper sense, so that any other sign or\nsignification can be termed a such only with reference to the mental\nsign (ipsa cognitio formalis… est propriissima significatio,\nita quod alia dicuntur significare per attributionem ad istam)\n(Hieronymus de S. Marcho, Compendium praeclarum, 1507, fol.\nB1[57]\n\n\nWhereas according to Augustine the sign, being an external entity by\ndefinition, was precluded from the sphere of the mind, it is now the\nmental sign, i.e., the mental concept or mental term (terminus\nmentalis), that is seen as the primary and most principal sign\n(signum mentale est primum et principalissimum signum, sine quo\nvoces et scripta significare non possunt) (Florentius Diel,\nModernorum summulae log., 1489, fol. a5v) as well\nas the ultimate ground of all\n signification.[58]\n Without such an\nultimate and immediate signification instantiated in the formal\nsignification of the mental concept, there would be, as John Raulin\nremarks, an infinite regress (processus in infinitum) in any\nsignification, something like a Peircean ‘infinite\nsemeiosis’.[59]\n Unlike the infinite semeiosis of Peirce,\nhowever, such a regress, according to late medieval authors, would not\nhave the character of a steady and permanent differentiation of\nsignification but rather would be, as John Major calls it, an\n“abyss in signifying” (abyssus in significando)\n(John Major: Introd. perutile in Arist. dial. (1527: fol.\n14ra), i.e., a process never resulting in a actual\nsignification.\n\n\nTogether with the deliberately extended notions of\n‘sign’ and ‘term’ and the emphasis of the role\nof the mental sign, a fundamental redefinition of written signs, i.e.,\ninscriptions is emerging in logic around 1500. Taking their cue from\nthe view introduced by Peter of Ailly, the later authors free the\nwritten sign from its traditional subordination to the vocal sign by\nimmediately subordinating it to the mental sign (Florentius Diel,\nModernorum summulae log., 1489, fol. d5v; Peter\nTartaretus, Expos. in summulas Petri Hisp, 1514, fol.\n37rb-va; Antonius Coronel, Termini,\n1506, fol. B3ra-b; Hieronymus Pardo, Medulla\ndyalect., 1505, fol. 7rb; John Eck, In summulis\nPetri Hisp., 1516, fol. 5 vb). Thus scriptura,\nno longer viewed as a secondary sign system and as a mere supplement of\nvocal speech, is no longer restricted to alphabetic writing. This in\nturn provides the ground for a dramatic generalization of the notion of\nwritten sign as well. When logical discourse extends its boundaries in\norder to give an account of all sorts of signs, integrating the whole\nrange of signs into the traditional framework of logic and, at the same\ntime, these signs have to be described along the lines of the\ntraditional distinction of mental, vocal, and written terms, then it is\nthe written term (terminus scriptus) that provides the most\nsuitable opportunity for such an integration. This, of course,\npresupposes a radically extended notion of inscriptions as it arose in\nParisian logic around 1500, where an inscription is no longer\ncharacterized in terms of its derivative relation to spoken language,\nbut rather in terms of its specific relation to the human sensory\napparatus. In this sense, John Major and others define the written term\nas a “term that can be perceived by a corporeal eye”\n(terminus scriptus est terminus qui oculo corporali percipi\npotest) (John Major, Libri quos in artibus in collegio Montis\nAcuti Parisius regentando compilavit, 1508, fol.\n 4[60]\n And Juan\nde Oria more explicitly states: “A written term is not called so\nbecause of being an inscription made up from characters or letters but\nrather because of representing something to the cognitive faculty by\nmeans of sight” (non enim dicitur terminus scriptus, quia sit\nscriptura ex caracteribus aut litteris constans, sed quia potentie\ncognitive aliquid proprie representat, mediante visu) (Juan de\nOria, Summul. vol. Primum, 1987, 106). The written term being\nthus defined, even the circulus vini can count as a written\nterm (John Maior , Libri…, 1508, fol. 4va).\nSome authors extend the notion of writing even further and call\nterminus scriptus “a term perceptible by senses other\nthan haering” (terminus alio sensu quam auditu\nperceptibilis) (Peter Margallus, Log. utriusque scholia,\n1520, 92) so that every corporeal being perceivable by one of the four\nexternal senses different from hearing may be an instance of written\nterms (omne sensibile corpus quattuor externis sensibus posse esse\nterminum scriptum) (Peter Margallus, Log. utriusque\nscholia, 1520, 162f.)\n\n\nThe basic idea behind this theoretical extension of the notion of\ninscription is the indifference of de sign-function to the material\ninstantiation of the sign. This arbitrariness of the medium of the sign\nholds for the signs not only with regard to their communicative\ncapacity, but also with regard to their function in logical operations.\nAs Paul of Venice points out, in principle it would be possible to form\nsyllogisms or to draw conclusions by using sticks and stones instead of\nwords or sentences (… possemus cum baculis syllogizare et\ncum lapidibus concludere) (Paul of Venice, Logica magna, prima\npars, Tract. de terminis, 1979, 78). The fact that we, in general,\ndo not do so, and that we do not communicate by means of sensible\nqualities like warms or smell, but rather use vocal or written terms in\nthe strict sense, is only due to their greater operability (Paul of\nVenice, Logica magna, prima pars, Tract. de terminis, 1979,\n78).[61]\n For we can utter articulated sounds\nwhenever we want to but cannot produce with the same ease and\ndistinctness the possible objects of the other senses like certain\ncolors or smells.[62]\n\n\nExtending the notion of terminus opens the horizon for\ntaking into account further semiotic issues, such as the distinction\nbetween terms that signify absolutely (terminus absolute\nsignificans) and terms that signify on account of circumstances\n(terminus ex circumstantia significans) (Juan de Oria,\nSummul. vol. Primum, 1987, 106f.) Whereas spoken or written\nwords are members of the first class, the second class is made up from\nany other kind of conventional signs, like the toll of bells, the\ncrucifix or the circulus vini. With this distinction, Johannes\nde Oria underscores the influence of the situational context on the\nsignification of non-linguistic signs. As he notices, it depends on the\ncircumstances of time and place whether the toll of a bell is an\ninvitation to go to the chapter congregation or to a meal; an image of\nthe crucified Christ denotes that he has to be adored only in the\nsituational context of a church building, but not in the studio of the\npainter or sculptor (imago crucifixi in ecclesia posita,\nrepresentat quod est adoranda, ubi non sic representaret in domo\npictoris vel statuifici) (Juan de Oria, Summul. vol.\nPrimum, 1987, 106f.); a wreath of foliage denotes the vine-selling\nonly when attached outside a tavern, but not in the woods (Peter\nMargallus, Log. utriusque scholia, 1965, 166). Moreover, the\nterms that signify on account of circumstances are characterized\naccording to John of Oria by the fact that they regularly signify a\nstate of affairs and thus function as propositional signs (terminus\nex circumstantia significans regulariter representat aliquid esse vel\nnon esse. Ex quo fit quod omnis talis terminus est propositio)\n(Juan de Oria, Summul. vol. Primum, 1987, 106).\n\n\nWhereas in Western Europe, under the growing influence of humanism,\nthe scholastic tradition of terminist logic came to an end in the third\ndecade of the 16th century, it had a vigorous, though not\nunaltered, continuation on the Iberian Peninsula until the\n18th century. From there it was re-imported to the\nuniversities and academic schools in Western Europe, after the late\n16th and early 17th century, mainly but not\nexclusively in Catholic areas. Even if the scholastic doctrine of signs\nwas presented in a so to speak “light version” by authors\nlike Domingo de Soto[63]\n and Franciscus Toletus, the rudiments of\nmedieval semiotics transmitted through their writings, provided the\ngroundwork on which a great number of 17th-century logicians\nwere developing a highly elaborated sign theory (Meier-Oeser 1997,\n171–335). The most important of these are the so-called Conimbricenses,\nJohn of St. Thomas (alias John Poinsot), Peter of Candamo and Silvester\nAranha, but a large number of texts is still awaiting to be\nexplored.\n", "bibliography": {"categories": ["Primary Sources", "Secondary Sources"], "cat_ref_text": {"Primary Sources": ["</h3>\n<ul class=\"hanging\">", "Albert of Saxony: 1522, <em>Perutilis logica</em>, Venice, rpt.\nHildesheim: Olms, 1974.", "Albert of Saxony: 1988, <em>Quaestiones in artem veterem</em>, ed.\nA. Muñoz García, Maracaibo: Univ. del Zulia.", "Anselm of Canterbury: 1968, <em>Monologion</em>, in: <em>S. Anselmi\nCantuariensis Archiepiscopi Opera Omnia</em>, vol. 1, ed. F. S.\nSchmitt. Stuttgart-Bad Cannstatt: Friedrich Fromann Verlag.", "Antonius Andreas: 1508, <em>Scriptum in arte veteri</em>,\nVenice.", "Antonius Coronel: 1506, <em>Termini</em>, Paris.", "Antverps: 1486, <em>Loycalia duodecim tractatuum Petri hyspani et\ntractatus exponibilium cum pulcherrimo commento ex doctissimorum\nvirorum … disputatis …collecto</em>, Antverps.", "Augustine: 1963, <em>De doctrina christiana</em>, in: <em>Sancti\nAugustini Opera</em>, ed. W. M. Green, CSEL 80, Vienna.", "Augustine: 1967, <em>De trinitate</em>, in: <em>Aurelii Augustini\nOpera</em>, pars 16,2, ed. W. J. Mountain (CCSL 50) Turnhout:\nBrepols.", "Augustine: 1970, <em>De magistro</em>, in: <em>Aurelii Augustini\nOpera</em>, pars 2,2, ed. K.-D. Daur (CCSL 29) Turnhout: Brepols.", "Augustine: 1975, <em>De dialectica</em>, ed. Jan Pinborg,\ntranslation with introd. and notes by B. Darrel Jackson, Dordrecht:\nReidel.", "Bartholomaeus Arnoldi of Usingen: 1507, <em>Summa compendiaria\ntotius logicae</em>, Basle.", "Bernardus Borgensis: <em>Explanatio brevis sive introductorium in\nsummulas Petri Hispani</em>, Florence 1514.", "Bernhard of Cluny: 1987, <em>De notitia signorum</em>, in: J.\nUmiker-Sebeok and Th. A. Sebeok (Eds.): Monastic Sign Languages,\nApproaches to Semiotics 76, Amsterdam: Benjamins, 345–49.", "Boethius Dacus: 1969, <em>Modi Significandi sive Quaestiones super\nPriscianum Maiorem</em>, ed. J. Pinborg, H. Roos and P. J. Jensen,\nCorpus Philosophorum Danicorum Medii Aevi, 4/1, Copenhagen: G. E. C.\nGad.", "Boethius, A. M. S.: 1880, <em>In Perihermeneias editio\nsecunda</em>, ed. C. Meiser, Leipzig: Teubner.", "Bonaventura: 1889, <em>Commentarius in quartum librum\nSententiarum</em>, Opera omnia, t. 4, Quaracchi: Collegium S.\nBonaventurae.", "Conimbricenses: 1607,<em>In libros Aristotelis de\ninterpretatione</em>, in: <em>Commentarii collegii Conimbricensis e\nSocietate Jesu in universam dialecticam Aristotelis</em>, Cologne, rpt.\nHildesheim: Olms 1976.", "Conimbricenses: 2001, <em>Some Questions on signs</em>, translated\nwith an introduction and notes by John P. Doyle, Milwaukee, Wisc.:\nMarquette Univ. Press.", "Domingo de Soto: 1554, <em>Summulae</em>, fifth ed. Salamanca, rpt.\nHildesheim: Olms 1980.", "Florentius Diel: 1489, <em>Modernorum summulae logicales</em>,\nSpeyer.", "Franciscus Toletus: 1615,<em>Introductio in universam Aristotelis\nlogicam</em>, in: <em>Opera omnia philosophica</em>, vol. 1, Cologne,\nrpt. Hildesheim: Olms, 1985.", "Gaspar Lax: ca. 1502, <em>Parve divisiones terminorum</em>,\nParis.", "Gerard Frilden: 1507, <em>Exercitium veteris artis</em>,\nRostock.", "Giles of Rome: 1499, <em>Super libros Priorum analeticorum\nAristotelis expositio et interpretatio</em>, Venice.", "Giles of Rome: 1507, <em>Expositio in artem veterem</em>, Venice,\nrpt. Frankfurt/M.: Minerva, 1968.", "Hagenau 1495, <em>Commentum in primum et quartum tractatum Petri\nHispani, Hagenau</em>, rpt. Frankfurt/M.: Minerva, 1967; The reprint\nhas falsly Marsilius of Inghen as author.", "Hieronymus de S. Marcho: <em>Compendium praeclarum quod parva\nlogica seu summulae dicitur</em>, Cologne 1507.", "Hieronymus Pardo: 1505, <em>Medulla dyalectices</em>, Paris.", "Hugolino of Orvieto: 1972, <em>Physikkommentar</em>, ed. W.\nEckermann, Berlin: W. de Gruyter.", "John Altenstaig: 1514, <em>Dialectica</em>, Hagenau.", "John Aurifaber: 1967, <em>Determinatio de modis significandi</em>,\ned. J. Pinborg: <em>Die Entwicklung der Sprachtheorie im\nMittelalter</em>, Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter XLII.2, Münster: Aschendorff.", "John Dorp: 1499, <em>Perutile compendium totius logicae Joannis\nBuridani cum praeclarissima … Joannis dorp expositione</em>,\nVenice, rpt. Frankfurt/M.: Minerva, 1965.", "John Dullaert: 1515, <em>Quaestiones super duos libros Peri\nhermeneias Aristotelis</em>, Paris, first ed. 1509.", "John Eck: 1516, <em>In summulis Petri Hispani extemporaria et\nsuccinsta sed succosa explanatio per superioris Germaniae\nscholasticis</em>, Augsburg.", "John Eck: 1517, <em>Aristotelis Stagyrite Dialectica</em>, vol. 2,\nAugsburg.", "John Gebwiler: 1511, <em>Magistralis totius parvuli artis logices\ncompilatio</em>, Basle.", "John Gerson: 1706, <em>De modis significandi</em>, Opera omnia, t.\n4, ed. Louis Ellies du Pin, Antverps, rpt. Hildesheim 1987.", "John Major: 1508, <em>Libri quos in artibus in collegio Montis\nAcuti Parisius regentando compilavit</em>, Lyons, first edition Paris\n1506.", "John Major: 1527, <em>Introductorium perutile in Aristotelis\ndialecticen</em>, Paris.", "John of St. Thomas: 1948,<em>Ars logica seu forma et materia\nratiocinandi</em>, in: Cursus philosophicus thomisticus, t.1, 2.\nrevised ed. B. Reiser, Torino: Marietti 1948.", "John Poinsot [aka John of St. Thomas]: 1985, <em>Tractatus de\nsignis: The Semiotic of John Poinsot.</em> Interpretive Arrangement by\nJohn N. Deely in Consultation with Ralph Austin Powell , Berkeley:\nUniversity of California Press.", "John Raulin: 1500, In logicam Aristotelis commentarium, Paris.", "John Tinctoris: 1486, <em>Dicta Tinctoris super summulas Petri\nHispani</em>, Reutlingen.", "John Versor: 1494, <em>Quaestiones super totam veterem artem\nAristotelis</em>, Cologne, repr. Frankfurt/ M.: Minerva 1967.", "Juan de Celaya: ca. 1511, <em>Introductiones dialecticae</em>,\nParis.", "Juan de Oria: 1987, <em>Summularum volumen primum</em>, in:\n<em>Opera logica</em> I:, ed.V. Muñoz Delgado, Madrid: C. S. I.\nC.", "Juan Dolz: ca. 1511, <em>Termini</em>, Paris.", "Lambert of Auxerre: 1971, <em>Logica. Summa Lamberti</em>, ed. F.\nAlessio, Florence: La nuova editrice.", "Magnus Hundt: 1507, <em>Compendium totius logices</em>,\nLeipzig.", "Martinus de Dacia: 1961, <em>Modi significandi</em>, in:\n<em>Opera</em>, ed. H. Roos, Corpus Philosophorum Danicorum Medii Aevi\n2, Copenhagen: G. E. C. Gad.", "Menghus Blanchellus: 1492, <em>Commentum cum quaestionibus super\nlogicam Pauli Veneti</em>, Venice.", "Paul of Venice: <em>Logica magna, prima pars, Tractatus de\nterminis</em>, ed. N. Kretzmann, Oxford: Oxford Univ. Press 1979.", "Peter Abelard: 1927, <em>Logica ‘Ingredientibus'</em>,\n<em>Glossae super Peri hermeneias, Philosophische Schriften</em>, ed.\nB. Geyer, in: <em>Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter</em> 21, 3, Münster: Aschendorff.", "Peter Abelard: 1956 <em>Dialectica</em>, ed. L. M. de Rijk, Assen:\nVan Gorcum.", "Peter Margallus: 1520, <em>Logices utriusque scholia</em>,\nSalamanca, rpt. Lisbon 1965.", "Peter of Ailly: Concepts and Insolubles. An Annotated Translation\nby P. V. Spade, Dordrecht: Reidel, 1980.", "Peter of Candamo: 1697, <em>Opusculum de signis, notitiis et\nconceptibus per quaestiones et capita divisum</em> , Valladolid.", "<em>Peter of</em> Spain<em>: Tractatus called afterwards Summule\nlogicales</em>. First Critical Edition from the Manuscripts with an\nIntroduction by L.M. de Rijk, Assen: Van Gorcum 1972.", "Peter Tartaretus: 1514, <em>Expositio in summulas Petri\nHispani</em>, Basle.", "Ps.- Robert Kilwardby: 1975, <em>The Commentary on “Priscian\nMaior” ascribed to Robert Kilwardby</em>, K. M. Fredborg, et\nal. (eds.), in <em>Cahiers de l'Institut du Moyen-Age grec et latin</em> 15:\n1–146.", "Pschlacher, Conrad: 1512, <em>Compendiarius parvorum logicalium\nliber</em>, Vienna.", "Robert Kilwardby: 1976, De ortu scientiarum, ed. A. G. Judy,\nAuctores Britannici Medii Aevi, 4, London: Oxford Univ. Press.", "Roger Bacon: 1978, <em>De signis</em>, ed. K. M. Fredborg, L.\nNielsen, and J. Pinborg, in: <em>Traditio</em> 34: 75–136.", "Roger Bacon: 1986, <em>Summulae dialectices. I. De termino II. De\nenuntiatione</em>, ed. A. de Libera, in: <em>Archives d'histoire\ndoctrinale et littéraire du Moyen Age</em> 53: 139–289.", "Roger Bacon: 1988, <em>Compendium studii theologiae</em>, ed. Th.\nS. Maloney, Leiden: Brill.", "Silvester Aranha: 1745, <em>Disputationes logicae…, pars\ntertia: de signis</em>, 2. ed., Coimbra (1. ed. 1736).", "Stanislas of Znoymo: 1971, <em>De vero et falso</em>, ed. V.\nHerold, Prague.", "Walter Burley: 1497, <em>Super artem veterem</em>, Venice, rpt.\nFrankfurt/M: Minerva, 1967.", "William Manderston: <em>Compendiosa Dialectices Epitome</em>, Paris\n1528.", "William of Militona: 1961, <em>Quaestiones de sacramentis</em>,\nQuaracchi: Collegium S. Bonaventurae.", "William of Ockham: 1974, <em>Summa logicae</em>, ed. Ph. Boehner et\nal., Opera philosophica I, St. Bonaventure, N.Y: The Franciscan\nInstitute.", "William of Ockham: 1978, <em>Expositio in librum Porphyrii, in\nlibrum Praedicamentorum Aristotelis, in librum\nPerihermeneias</em>…, ed. E. A. Moody et al., <em>Opera\nphilosophica</em> II, St. Bonaventure, N.Y: The Franciscan\nInstitute.\n</ul>\n<h3>"], "Secondary Sources": ["</h3>\n<ul class=\"hanging\">", "Ashworth, E. Jennifer: 1969, “The doctrine of supposition in\nthe 16<sup>th</sup> and 17<sup>th</sup> Centuries”, <em>Archiv\nfür Geschichte der Philosophie</em>, 51: 260–285.", "Ashworth, E. Jennifer: 1974, <em>Language and Logic in the\npost-medieval period</em>, Dordrecht: Reidel.", "Ashworth, E. Jennifer: 1977, <em>The Tradition of Medieval Logic\nand Speculative Grammar</em>, Toronto: Pontifical Institute of\nMediaeval Studies.", "Ashworth, E. Jennifer. 1982. “The Structure of Mental\nLanguage: Some Problems Discussed by Early Sixteenth Century\nLogicians”, <em>Vivarium</em>, 20: 59–83 (rpt. in Ashworth 1985,\nch. V).", "Ashworth, E. Jennifer. 1985. Studies in Post-Medieval Semantics.\nLondon: Variorum Reprints.", "Ashworth, E. Jennifer: 1987, “Jacobus Naveros (fl. ca. 1533)\non the Question: ‘Do Spoken words signifiy Concepts or\nThings?’“, in <em>Logos and Pragma</em>, ed. L. M. de Rijk\nand C. A. G. Braakhuis, Nijmegen: Ingenium, 189–214.", "Ashworth, E. Jennifer: 1990, “Domingo de Soto (1494–1560) and\nthe Doctrine of Signs”, in <em>De ortu grammaticae: studies in\nmedieval grammar and linguistic theory in memory of Jan Pinborg</em>,\ned. G. L. Bursill-Hall, S. Ebbesen and E. F. K. Koerner, Amsterdam:\nBenjamins, 35–48.", "Beuchot, Mauricio: 1980, “La doctrina tomistica\nclásica sobre el signo. Domingo de Soto, Francisco de\nAraújo y Juan de Santo Tomás”, <em>Critica</em>, 12:\n39–60.", "Biard, Joël: 1981, <em>La redéfinition Ockhamiste de la\nsignification</em>, In <em>Sprache und Erkenntnis im Mittelalter</em>\n(= Miscellanea Mediaevalia 13/1–2), ed. W. Kluxen et al., Berlin,\nNew York: W. de Gruyter, vol. 1, 451–58.", "Biard, Joël: 1989, <em>Logique et théorie du signe au\nXIV<sup>e</sup> siècle</em>, Vrin, Paris.", "Biard, Joël (ed.): 2009, Le langage mental du moyen âge\nà 'âge classique, Louvain, Paris: Éditions\nPeeters.", "Borsche, Tilman: 1994, “Zeichentheorie im Übergang von\nden Stoikern zu Augustin”, <em>Allgemeine Zeitschrift für\nPhilosophie</em> 19: 41–52.", "Braakhuis, H. A. G.: 1985, “Kilwardby vs Bacon? The\nContribution to the Discussion on Univocal Signification of Beings and\nNon-Beings Found in a Sophism Attributed to Robert Kilwardby”,\nin: <em>Medieval Semantics and Metaphysics</em>, ed. E. P. Bos,\nNijmegen: Ingenium, 111–142.", "Broadie, Alexander: 1985, <em>The circle of John Mair. Logic and\nLogicians in Pre-Reformation Scotland</em>, Oxford: Oxford University\nPress.", "Broadie, Alexander: 1989<em>, Notion and Object. Aspects of Late\nMedieval Epistemology</em>, Oxford: Clarendon.", "Bursill-Hall, G. L.: 1971, <em>Speculative Grammars of the Middle\nAges: The Doctrine of the partes orationis of the Modistae</em>,\nApproaches to Semantics, 11, The Hague: Mouton.", "Bursill-Hall, G. L.: 1976, “Some Notes on the Grammatical\nTheory of Boethius of Dacia”. In <em>History of Linguistic\nThought and Contemporary Linguistics</em>, ed. H. Parret, Berlin: W. de\nGruyter, 164–88.", "de Rijk, Lambert Marie: 1962–67, <em>Logica modernorum.</em> <em>A\nContribution to the History of Early Terminist Logic</em>, Assen: Van\nGorcum.", "Duchrow, Ulrich: 1965, <em>Sprachverständnis und biblisches\nHören bei Augustinus</em>, Tübingen: Mohr.", "Ebbesen, Sten: 1983, “The Odyssey of Semantics from the Stoa\nto Buridan”, in: <em>History of Semiotics</em>, ed. A. Eschbach\nand J. Trabant, Amsterdam: Benjamins, 67–85.", "Ebbesen, Sten. 1995. “Introduction”, in: S. Ebbesen\n(ed.), <em>Sprachtheorien in Spätantike und Mittelalter</em> (= P.\nSchmitter, ed., Geschichte der Sprachtheorie 3). Tübingen: Gunter\nNarr Verlag, XI-XX.", "Eco, Umberto: 1988, “Wer ist schuld an der Konfusion von\nDenotation und Bedeutung? Versuch einer Spurensicherung”,\n<em>Zeitschrift für Semiotik</em>, 10: 189–207.", "Eco, Umberto et al.: 1989, On animal language in the medieval\nclassification of signs, in <em>On the Medieval Theory of Signs</em>,\ned. U. Eco and C. Marmo, Amsterdam: Benjamins, 3–41.", "Engels, J.: 1962, La doctrine du signe chez Saint Augustine, in\n<em>Studia Patristica</em>, ed. F. L. Cross, Berlin: Akademie-Verlag,\n366–73.", "Engels, J.: 1963, Origine, sens et survie du terme boécien\n“secundum placitum”, <em>Vivarium</em>, 1: 87–114.", "Eschbach, Achim and Trabant, Jürgen: 1983, <em>History of\nSemiotics</em>, Amsterdam: Benjamins.", "Faes de Mottoni, Barbara: 1986, “Enuntiatores divini\nsilentii: Tommaso d'Aquino e il linguaggo degli angeli”;\n<em>Medioevo</em>, 12: 197–228.", "Faes de Mottoni, Barbara: 1988, “Voci,\n‘Alphabeto’ e altri segni degli angeli nella quaestio 12\ndel de cognitione angelorum di Egidio Romano”; <em>Medioevo</em>,\n14: 71–105.", "Fredborg, Karin Margareta: 1980, “Universal Grammar According\nto Some 12th-Century Grammarians,” in <em>Studies in Medieval\nLinguistic Thought</em>, ed. Konrad Koerner et al., Historiagraphia\nLinguistica, VII.1/2, John Benjamins, Amsterdam, 69–84.", "Fredborg, Karen Margarete: 1981, “Roger Bacon on\n‘Impositio vocis ad significandum’“, in: <em>English\nLogic and Semantics: From the End of the Twelfth Century to the Time of\nOckham and Burleigh</em>, ed. H. A. G. Braakhuis, C. H. Kneepkens, and\nL. M. de Rijk, Nijmegen: Ingenium, 167–191.", "Fuchs, Michael: 1999, Zeichen und Wissen. Das Verhältnis der\nZeichentheorie zur Theorie des Wissens und der Wissenschaften im\ndreizehnten Jahrhundert, Aschendorff, Münster in Westfalen.", "Gill, Harjeet Singh: 1999, “The Abélardian Tradition\nof Semiotics”. In <em>Signs and Signification</em>, vol. 1, ed.\nH. Singh Gill and G. Manetti, New Delhi: Bahri, 35–67.", "Glidden, David: 1983, “Skeptic semiotics”,\n<em>Phronesis</em>, 28: 213–55.", "Grassi, Onorato: 1986, <em>Intuizione e significato. Adam Wodeham\ned il problema della conoscenza nel XIV secolo</em>, Jaca,\nMailand.", "Haller, Rudolf: 1962, “Untersuchungen zum Bedeutungsproblem\nin der antiken und mittelalterlichen Philosophie”, <em>Archiv\nfür Begriffgeschichte</em>, 7: 57–119.", "Häring, Nikolaus M.: 1956, “Caracter, Signum und\nSignaculum. Der Weg von Petrus Damiani bis zur eigentlichen Aufnahme in\ndie Sakramentenlehre im 12. Jahrhundert”, <em>Scholastik</em>, 31:\n41–69.", "Howell, Kenneth: 1987, “Two aspects of Roger Bacon's semiotic\ntheory in De signis”, <em>Semiotica</em>, 63: 73–81.", "Hübener, Wolfgang: 1968, <em>Studien zur kognitiven\nRepräsentation in der mittelalterlichen Philosophie</em>.\nUnpublished Habilitationsschrift. Berlin.", "Hübener, Wolfgang: 1974, “Der theologisch-philosophische\nKonservativismus des Jean Gerson”. In <em>Antiqui und moderni:\nTraditionsbewusstsein und Fortschrittsbewusstsein im späten\nMittelalter</em> (= Miscellanea mediaevalia 9), ed. A. Zimmermann,\nBerlin, New York: W. de Gruyter, 171–200.", "Hübener, Wolfgang: 1981, “‘Oratio mentalis’\nund ‘oratio vocalis’ in der Philosophie des 14.\nJahrhunderts”. In <em>Sprache und Erkenntnis im Mittelalter</em>\n(= Miscellanea Mediaevalia 13/1–2), W. Kluxen <em>et al</em>. (eds.),\nBerlin, New York: W. de Gruyter, vol. 1, 488–97.", "Hübener, Wolfgang: 1990, “Wyclifs Kritik an den Doctores\nsignorum”. In <em>Die Gegenwart Ockhams</em>, ed. W. Vossenkuhl\nand R. Schönberger, Weinheim: VCH, 128–46.", "Jackson, B. Darrell: 1969, “The Theory of Signs in St.\nAugustine's De doctrina christiana”, <em>Revue des Études\nAugustiniennes</em>, 15: 9–49.", "Jolivet, Jean: 1969, <em>Arts du langage et théologie chez\nAbélard</em>, Paris: Vrin.", "Kaczmarek, Ludger: 1983, Significatio in der Zeichen- und\nSprachtheorie Ockhams. In <em>History of Semiotics</em>, ed. Achim\nEschbach and Jürgen Trabant, Benjamins, Amsterdam, Philadelphia,\n87–104.", "Kneepkens, C. H.: 1995, “The Priscianic Tradition,” in\n<em>Sprachtheorien in Spätantike und Mittelalter</em>, ed. Sten\nEbbesen, Gunter Narr Verlag, Tübingen, 239–64.", "Kretzmann, Norman (ed.): 1988, Meaning and Inference in Medieval\nPhilosophy, Dordrecht: Kluwer.", "Lenz, Martin: 2003, <em>Mentale Sätze: Wilhelm von Ockhams\nThesen zur Sprachlichkeit des Denkens</em>, Wiesbaden: Franz Steiner\nVerlag.", "Magee, John: 1989, <em>Boethius on signification and mind</em>,\nLeiden: Brill.", "Maierù, Alfonso: 1981, “'Signum’ dans la culture\nmédiévale”. In <em>Sprache und Erkenntnis im\nMittelalter</em>, ed. W. Kluxen et al. (= Miscellanea Mediaevalia\n13/1–2), Berlin, New York: W. de Gruyter, vol. 1, 51–71.", "Maloney, Thomas S.: 1983a, “The Semiotics of Roger\nBacon”, <em>Medieval Studies</em>, 45: 120–154.", "Maloney, Thomas S.: 1983b, “Roger Bacon on the significatum\nof words”. In Archélogie du signe, ed. L. Brind'Amour and\nE. Vance, Recueils d’Études Médiévales 3, Ontario,\nToronto.", "Markus, Robert A.: 1957, “St. Augustine on Signs”,\n<em>Phronesis</em> 2: 60–83.", "Marmo, Costantino: 1994, <em>Semiotica e linguaggio nella\nscolastica: Parigi, Bologna, Erfurt, 1270–1330</em>. <em>La semiotica\ndei Modisti</em>, Roma: Instituto Storico Italiano per il\nMedioevo.", "Marmo, Constantino (ed.): 1997, <em>Vestigia, Imagines,\nVerba. Semiotics and Logic in Medieval Theological texts (XIIth-XIVth\nCentury)</em>, Brepols: Turnhout.", "Meier-Oeser, Stephan: 1995a, “Semiotik, Semiologie”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 9, Basle: Schwabe, 601–607.", "Meier-Oeser, Stephan: 1995b, “Signifikation”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 9, Basle: Schwabe, 759–795.", "Meier-Oeser, Stephan: 1997, <em>Die Spur des Zeichen. Das Zeichen\nund seine Funktion in der Philosophie des Mittelalters und der Fruehen\nNeuzeit</em>, Berlin, New York: W. de Gruyter.", "Meier-Oeser, Stephan: 1998, “Synkategorem”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 10, Basle: Schwabe, 787–799.", "Meier-Oeser, Stephan: 2004, “Mental Language and Mental\nRepresentation in Late Scholastic Logic”, in S. Ebbesen and\nR. L. Friedman (eds.), <em>John Buridan and Beyond. The Language\nSciences, and their Connection to the Theories of Mind 1300–1700</em>,\nCopenhagen: Reitzel, pp. 237–265.", "Meier-Oeser, Stephan: 2009, “Walter Burley's\n‘propositio in re’ and the Systematization of the\n‘ordo significationis’”, in <em>Philosophical\nDebates at Paris in the Early Fourteenth Century</em>,\ned. S. F. Brown, Th. Dewender and Th. Kobusch (eds.), Leiden, Boston:\nBrill, p. 483–505.", "Muñoz Delgado, Vicente: 1964, <em>La Lógica\nNominalista en la Universidad de Salamanca (1510–1530)</em>, Madrid:\nRevista Estudios.", "Muñoz Delgado, Vicente: 1966, “La lógica como\n‘scientia sermocinalis’ en la obra de Pedro Sánchez\nCiruelo (1470–1554)”, <em>Estudios</em>, 22: 23–52.", "Muñoz Delgado, Vicente: 1970, “La obra lógica\nde los españoles en Paris (1500–1525)”, <em>Estudios</em>,\n26: 209–280.", "Muñoz Delgado, Vicente: 1983, “Pedro de Espinosa y la\nlogica en Salamanca hasta 1550”, <em>Anuario filosofico</em>, 16:\n119–208.", "Nuchelmans, Gabriel: 1980, <em>Late-Scholastic and Humanist Theorys\nof the Proposition</em>, Amsterdam: North Holland\nPublications.", "Marmo, Costantino: 1999, “The Semantics of the\n<em>Modistae</em>,” in <em>Medieval Analyses in Language and\nCognition</em>, Acts of the Symposium, ‘The Copenhagen School of\nMedieval Philosophy’, January 10–13, 1996, ed. Sten Ebbesen and\nRussell L. Friedman, Royal Danish Academy of Sciences and Letters,\nCopenhagen: C. A. Reitzel, 83–104.", "Panaccio, Claude: 1996, “Le langage mental en discussion:\n1320–1355”. <em>Les Études philosophiques</em>, 3:\n323–39.", "Panaccio, Claude: 1999a: “Grammar and Mental Language in\nPseudo-Kilwardby”, in <em>Medieval Analyses in Language and\nCognition</em>, Acts of the Symposium, ‘The Copenhagen School of\nMedieval Philosophy’, January 10–13, 1996, ed. Sten Ebbesen and\nRussell L. Friedman, Royal Danish Academy of Sciences and Letters,\nCopenhagen: Reitzel, 397–413.", "Panaccio, Claude: 1999b, <em>Le discours intérieur de Platon\na Guillaume d'Ockham</em>, Paris: Seuil.", "Panaccio, Claude: 2004, <em>Ockham on Concepts</em>, Aldershot:\nAshgate.", "Pinborg, Jan: 1962, “Das Sprachdenken der Stoa und Augustins\nDialektik”, <em>Classica et Mediaevalia</em>, 23: 148–77.", "Pinborg, Jan: 1967, <em>Die Entwicklung der Sprachtheorie im\nMittelalter</em>, Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter XLII.2, Münster: Aschendorff.", "Pinborg, Jan: 1971, “Bezeichnung in der Logik des XIII\nJahrhunderts”. in <em>Der Begriff der repraesentatio im\nMittelalter, Stellvertretung – Symbol – Zeichen –\nBild</em>, ed. A. Zimmermann (= Miscellanea mediaevalia 8) Berlin,\nNew York: W. de Gruyter, 237–281.", "Pinborg, Jan: 1972, <em>Logik und Semantik im Mittelalter. Ein\nÜberblick</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog.", "Pinborg, Jan: 1976, “Some Problems of Semantic Representation\nin Medieval Logic”. In <em>History of Linguistic Thought and\nContemporary Linguistics</em>, ed. H. Parret, Berlin, New York: W. de\nGruyter, 254–78.", "Pinborg, Jan: 1981, “Roger Bacon on Signs: A Newly Recovered\nPart of the Opus maius”, in <em>Sprache und Erkenntnis im\nMittelalter</em>, ed. W. Kluxen et al. (= Miscellanea Mediaevalia\n13/1–2), Berlin, New York: W. de Gruyter, vol. 1, 403–412.", "Pinborg, Jan: 1982, “Speculative Grammar,” in <em>The\nCambridge History of Later Medieval Philosophy</em>, ed. Norman\nKretzmann, Anthony Kenny, and Jan Pinborg, Cambridge: Cambridge\nUniversity Press, 254–69.", "Posner, Roland, Robering, Klaus and Sebeok, Thomas A. (Eds.): 1997,\nSemiotik – Semiotics. Ein Handbuch zu den zeichentheoretischen\nGrundlagen von Natur und Kultur, vol. 1, Berlin, New York: W. de\nGruyter.", "Rosier, Irène: 1994, <em>La parole comme acte. Sur la\ngrammaire et la sémantique au XIIIe siècle</em>, Paris:\nVrin.", "Rosier, Irène: 1995, “<em>Res significata et modus\nsignificandi</em>: Les implications d'une distinction\nmédiévale,” in <em>Sprachtheorien in\nSpätantike und Mittelalter</em>, ed. Sten Ebbesen, Gunter Narr\nVerlag, Tübingen, 135–68.", "Rosier-Catach, Irène: 2000, Aristotle and Augustine. Two\nModels of Occidental Medieval Semantics, in: In <em>Signs and\nSignification</em>, vol. 2, ed. H. Singh Gill and G. Manetti, New\nDelhi: Bahri, 41–62.", "Rosier-Catach, Irène: forthcoming <em>Signes et sacrements.\nLa parole efficace</em>, Paris: Seuil.", "Ruef, Hans 1981, Augustin über Semiotik und Sprache.\nSprachtheoretische Analysen zu Augustins Schrift “De\nDialectica”, Bern: Wyss Erben.", "Simone, Raffaele: 1972, “Sémiologie\naugustinienne”. <em>Semiotica</em>, 6: 1–31.", "Sirridge, Mary: 1999, “‘Quam videndo intus\ndicimus’: Seeing and Saying in De Trinitate XV” in\n<em>Medieval Analyses in Language and Cognition</em>, Acts of the\nSymposium, ‘The Copenhagen School of Medieval Philosophy’,\nJanuary 10–13, 1996, ed. Sten Ebbesen and Russell L. Friedman, Royal\nDanish Academy of Sciences and Letters, Copenhagen: Reitzel,\n318–330.", "Tabarroni, Andrea: 1989, “Mental signs and the theory of\nrepresentation in Ockham”, in <em>On the Medieval Theory of\nSigns</em>, ed. U. Eco and C. Marmo, Amsterdam: Benjamins,\n195–224.", "Tweedale, Martin: 1990. “Mental Representation in Later\nMedieval Scholasticism”, in: <em>Historical Foundations of\nCognitive Science</em>, ed. J.-C. Smith, Dordrecht: Kluwer, 35-52.", "Umiker-Sebeok, J. and Sebeok, Thomas A. (Eds.): 1987, <em>Monastic\nSign Languages</em>, Approaches to Semiotics 76, Amsterdam:\nBenjamins.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Albert of Saxony: 1522, <em>Perutilis logica</em>, Venice, rpt.\nHildesheim: Olms, 1974.</li>\n<li>Albert of Saxony: 1988, <em>Quaestiones in artem veterem</em>, ed.\nA. Muñoz García, Maracaibo: Univ. del Zulia.</li>\n<li>Anselm of Canterbury: 1968, <em>Monologion</em>, in: <em>S. Anselmi\nCantuariensis Archiepiscopi Opera Omnia</em>, vol. 1, ed. F. S.\nSchmitt. Stuttgart-Bad Cannstatt: Friedrich Fromann Verlag.</li>\n<li>Antonius Andreas: 1508, <em>Scriptum in arte veteri</em>,\nVenice.</li>\n<li>Antonius Coronel: 1506, <em>Termini</em>, Paris.</li>\n<li>Antverps: 1486, <em>Loycalia duodecim tractatuum Petri hyspani et\ntractatus exponibilium cum pulcherrimo commento ex doctissimorum\nvirorum … disputatis …collecto</em>, Antverps.</li>\n<li>Augustine: 1963, <em>De doctrina christiana</em>, in: <em>Sancti\nAugustini Opera</em>, ed. W. M. Green, CSEL 80, Vienna.</li>\n<li>Augustine: 1967, <em>De trinitate</em>, in: <em>Aurelii Augustini\nOpera</em>, pars 16,2, ed. W. J. Mountain (CCSL 50) Turnhout:\nBrepols.</li>\n<li>Augustine: 1970, <em>De magistro</em>, in: <em>Aurelii Augustini\nOpera</em>, pars 2,2, ed. K.-D. Daur (CCSL 29) Turnhout: Brepols.</li>\n<li>Augustine: 1975, <em>De dialectica</em>, ed. Jan Pinborg,\ntranslation with introd. and notes by B. Darrel Jackson, Dordrecht:\nReidel.</li>\n<li>Bartholomaeus Arnoldi of Usingen: 1507, <em>Summa compendiaria\ntotius logicae</em>, Basle.</li>\n<li>Bernardus Borgensis: <em>Explanatio brevis sive introductorium in\nsummulas Petri Hispani</em>, Florence 1514.</li>\n<li>Bernhard of Cluny: 1987, <em>De notitia signorum</em>, in: J.\nUmiker-Sebeok and Th. A. Sebeok (Eds.): Monastic Sign Languages,\nApproaches to Semiotics 76, Amsterdam: Benjamins, 345–49.</li>\n<li>Boethius Dacus: 1969, <em>Modi Significandi sive Quaestiones super\nPriscianum Maiorem</em>, ed. J. Pinborg, H. Roos and P. J. Jensen,\nCorpus Philosophorum Danicorum Medii Aevi, 4/1, Copenhagen: G. E. C.\nGad.</li>\n<li>Boethius, A. M. S.: 1880, <em>In Perihermeneias editio\nsecunda</em>, ed. C. Meiser, Leipzig: Teubner.</li>\n<li>Bonaventura: 1889, <em>Commentarius in quartum librum\nSententiarum</em>, Opera omnia, t. 4, Quaracchi: Collegium S.\nBonaventurae.</li>\n<li>Conimbricenses: 1607,<em>In libros Aristotelis de\ninterpretatione</em>, in: <em>Commentarii collegii Conimbricensis e\nSocietate Jesu in universam dialecticam Aristotelis</em>, Cologne, rpt.\nHildesheim: Olms 1976.</li>\n<li>Conimbricenses: 2001, <em>Some Questions on signs</em>, translated\nwith an introduction and notes by John P. Doyle, Milwaukee, Wisc.:\nMarquette Univ. Press.</li>\n<li>Domingo de Soto: 1554, <em>Summulae</em>, fifth ed. Salamanca, rpt.\nHildesheim: Olms 1980.</li>\n<li>Florentius Diel: 1489, <em>Modernorum summulae logicales</em>,\nSpeyer.</li>\n<li>Franciscus Toletus: 1615,<em>Introductio in universam Aristotelis\nlogicam</em>, in: <em>Opera omnia philosophica</em>, vol. 1, Cologne,\nrpt. Hildesheim: Olms, 1985.</li>\n<li>Gaspar Lax: ca. 1502, <em>Parve divisiones terminorum</em>,\nParis.</li>\n<li>Gerard Frilden: 1507, <em>Exercitium veteris artis</em>,\nRostock.</li>\n<li>Giles of Rome: 1499, <em>Super libros Priorum analeticorum\nAristotelis expositio et interpretatio</em>, Venice.</li>\n<li>Giles of Rome: 1507, <em>Expositio in artem veterem</em>, Venice,\nrpt. Frankfurt/M.: Minerva, 1968.</li>\n<li>Hagenau 1495, <em>Commentum in primum et quartum tractatum Petri\nHispani, Hagenau</em>, rpt. Frankfurt/M.: Minerva, 1967; The reprint\nhas falsly Marsilius of Inghen as author.</li>\n<li>Hieronymus de S. Marcho: <em>Compendium praeclarum quod parva\nlogica seu summulae dicitur</em>, Cologne 1507.</li>\n<li>Hieronymus Pardo: 1505, <em>Medulla dyalectices</em>, Paris.</li>\n<li>Hugolino of Orvieto: 1972, <em>Physikkommentar</em>, ed. W.\nEckermann, Berlin: W. de Gruyter.</li>\n<li>John Altenstaig: 1514, <em>Dialectica</em>, Hagenau.</li>\n<li>John Aurifaber: 1967, <em>Determinatio de modis significandi</em>,\ned. J. Pinborg: <em>Die Entwicklung der Sprachtheorie im\nMittelalter</em>, Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter XLII.2, Münster: Aschendorff.</li>\n<li>John Dorp: 1499, <em>Perutile compendium totius logicae Joannis\nBuridani cum praeclarissima … Joannis dorp expositione</em>,\nVenice, rpt. Frankfurt/M.: Minerva, 1965.</li>\n<li>John Dullaert: 1515, <em>Quaestiones super duos libros Peri\nhermeneias Aristotelis</em>, Paris, first ed. 1509.</li>\n<li>John Eck: 1516, <em>In summulis Petri Hispani extemporaria et\nsuccinsta sed succosa explanatio per superioris Germaniae\nscholasticis</em>, Augsburg.</li>\n<li>John Eck: 1517, <em>Aristotelis Stagyrite Dialectica</em>, vol. 2,\nAugsburg.</li>\n<li>John Gebwiler: 1511, <em>Magistralis totius parvuli artis logices\ncompilatio</em>, Basle.</li>\n<li>John Gerson: 1706, <em>De modis significandi</em>, Opera omnia, t.\n4, ed. Louis Ellies du Pin, Antverps, rpt. Hildesheim 1987.</li>\n<li>John Major: 1508, <em>Libri quos in artibus in collegio Montis\nAcuti Parisius regentando compilavit</em>, Lyons, first edition Paris\n1506.</li>\n<li>John Major: 1527, <em>Introductorium perutile in Aristotelis\ndialecticen</em>, Paris.</li>\n<li>John of St. Thomas: 1948,<em>Ars logica seu forma et materia\nratiocinandi</em>, in: Cursus philosophicus thomisticus, t.1, 2.\nrevised ed. B. Reiser, Torino: Marietti 1948.</li>\n<li>John Poinsot [aka John of St. Thomas]: 1985, <em>Tractatus de\nsignis: The Semiotic of John Poinsot.</em> Interpretive Arrangement by\nJohn N. Deely in Consultation with Ralph Austin Powell , Berkeley:\nUniversity of California Press.</li>\n<li>John Raulin: 1500, In logicam Aristotelis commentarium, Paris.</li>\n<li>John Tinctoris: 1486, <em>Dicta Tinctoris super summulas Petri\nHispani</em>, Reutlingen.</li>\n<li>John Versor: 1494, <em>Quaestiones super totam veterem artem\nAristotelis</em>, Cologne, repr. Frankfurt/ M.: Minerva 1967.</li>\n<li>Juan de Celaya: ca. 1511, <em>Introductiones dialecticae</em>,\nParis.</li>\n<li>Juan de Oria: 1987, <em>Summularum volumen primum</em>, in:\n<em>Opera logica</em> I:, ed.V. Muñoz Delgado, Madrid: C. S. I.\nC.</li>\n<li>Juan Dolz: ca. 1511, <em>Termini</em>, Paris.</li>\n<li>Lambert of Auxerre: 1971, <em>Logica. Summa Lamberti</em>, ed. F.\nAlessio, Florence: La nuova editrice.</li>\n<li>Magnus Hundt: 1507, <em>Compendium totius logices</em>,\nLeipzig.</li>\n<li>Martinus de Dacia: 1961, <em>Modi significandi</em>, in:\n<em>Opera</em>, ed. H. Roos, Corpus Philosophorum Danicorum Medii Aevi\n2, Copenhagen: G. E. C. Gad.</li>\n<li>Menghus Blanchellus: 1492, <em>Commentum cum quaestionibus super\nlogicam Pauli Veneti</em>, Venice.</li>\n<li>Paul of Venice: <em>Logica magna, prima pars, Tractatus de\nterminis</em>, ed. N. Kretzmann, Oxford: Oxford Univ. Press 1979.</li>\n<li>Peter Abelard: 1927, <em>Logica ‘Ingredientibus'</em>,\n<em>Glossae super Peri hermeneias, Philosophische Schriften</em>, ed.\nB. Geyer, in: <em>Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter</em> 21, 3, Münster: Aschendorff.</li>\n<li>Peter Abelard: 1956 <em>Dialectica</em>, ed. L. M. de Rijk, Assen:\nVan Gorcum.</li>\n<li>Peter Margallus: 1520, <em>Logices utriusque scholia</em>,\nSalamanca, rpt. Lisbon 1965.</li>\n<li>Peter of Ailly: Concepts and Insolubles. An Annotated Translation\nby P. V. Spade, Dordrecht: Reidel, 1980.</li>\n<li>Peter of Candamo: 1697, <em>Opusculum de signis, notitiis et\nconceptibus per quaestiones et capita divisum</em> , Valladolid.</li>\n<li><em>Peter of</em> Spain<em>: Tractatus called afterwards Summule\nlogicales</em>. First Critical Edition from the Manuscripts with an\nIntroduction by L.M. de Rijk, Assen: Van Gorcum 1972.</li>\n<li>Peter Tartaretus: 1514, <em>Expositio in summulas Petri\nHispani</em>, Basle.</li>\n<li>Ps.- Robert Kilwardby: 1975, <em>The Commentary on “Priscian\nMaior” ascribed to Robert Kilwardby</em>, K. M. Fredborg, et\nal. (eds.), in <em>Cahiers de l'Institut du Moyen-Age grec et latin</em> 15:\n1–146.</li>\n<li>Pschlacher, Conrad: 1512, <em>Compendiarius parvorum logicalium\nliber</em>, Vienna.</li>\n<li>Robert Kilwardby: 1976, De ortu scientiarum, ed. A. G. Judy,\nAuctores Britannici Medii Aevi, 4, London: Oxford Univ. Press.</li>\n<li>Roger Bacon: 1978, <em>De signis</em>, ed. K. M. Fredborg, L.\nNielsen, and J. Pinborg, in: <em>Traditio</em> 34: 75–136.</li>\n<li>Roger Bacon: 1986, <em>Summulae dialectices. I. De termino II. De\nenuntiatione</em>, ed. A. de Libera, in: <em>Archives d'histoire\ndoctrinale et littéraire du Moyen Age</em> 53: 139–289.</li>\n<li>Roger Bacon: 1988, <em>Compendium studii theologiae</em>, ed. Th.\nS. Maloney, Leiden: Brill.</li>\n<li>Silvester Aranha: 1745, <em>Disputationes logicae…, pars\ntertia: de signis</em>, 2. ed., Coimbra (1. ed. 1736).</li>\n<li>Stanislas of Znoymo: 1971, <em>De vero et falso</em>, ed. V.\nHerold, Prague.</li>\n<li>Walter Burley: 1497, <em>Super artem veterem</em>, Venice, rpt.\nFrankfurt/M: Minerva, 1967.</li>\n<li>William Manderston: <em>Compendiosa Dialectices Epitome</em>, Paris\n1528.</li>\n<li>William of Militona: 1961, <em>Quaestiones de sacramentis</em>,\nQuaracchi: Collegium S. Bonaventurae.</li>\n<li>William of Ockham: 1974, <em>Summa logicae</em>, ed. Ph. Boehner et\nal., Opera philosophica I, St. Bonaventure, N.Y: The Franciscan\nInstitute.</li>\n<li>William of Ockham: 1978, <em>Expositio in librum Porphyrii, in\nlibrum Praedicamentorum Aristotelis, in librum\nPerihermeneias</em>…, ed. E. A. Moody et al., <em>Opera\nphilosophica</em> II, St. Bonaventure, N.Y: The Franciscan\nInstitute.</li>\n</ul>\n<h3>Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Ashworth, E. Jennifer: 1969, “The doctrine of supposition in\nthe 16<sup>th</sup> and 17<sup>th</sup> Centuries”, <em>Archiv\nfür Geschichte der Philosophie</em>, 51: 260–285.</li>\n<li>Ashworth, E. Jennifer: 1974, <em>Language and Logic in the\npost-medieval period</em>, Dordrecht: Reidel.</li>\n<li>Ashworth, E. Jennifer: 1977, <em>The Tradition of Medieval Logic\nand Speculative Grammar</em>, Toronto: Pontifical Institute of\nMediaeval Studies.</li>\n<li>Ashworth, E. Jennifer. 1982. “The Structure of Mental\nLanguage: Some Problems Discussed by Early Sixteenth Century\nLogicians”, <em>Vivarium</em>, 20: 59–83 (rpt. in Ashworth 1985,\nch. V).</li>\n<li>Ashworth, E. Jennifer. 1985. Studies in Post-Medieval Semantics.\nLondon: Variorum Reprints.</li>\n<li>Ashworth, E. Jennifer: 1987, “Jacobus Naveros (fl. ca. 1533)\non the Question: ‘Do Spoken words signifiy Concepts or\nThings?’“, in <em>Logos and Pragma</em>, ed. L. M. de Rijk\nand C. A. G. Braakhuis, Nijmegen: Ingenium, 189–214.</li>\n<li>Ashworth, E. Jennifer: 1990, “Domingo de Soto (1494–1560) and\nthe Doctrine of Signs”, in <em>De ortu grammaticae: studies in\nmedieval grammar and linguistic theory in memory of Jan Pinborg</em>,\ned. G. L. Bursill-Hall, S. Ebbesen and E. F. K. Koerner, Amsterdam:\nBenjamins, 35–48.</li>\n<li>Beuchot, Mauricio: 1980, “La doctrina tomistica\nclásica sobre el signo. Domingo de Soto, Francisco de\nAraújo y Juan de Santo Tomás”, <em>Critica</em>, 12:\n39–60.</li>\n<li>Biard, Joël: 1981, <em>La redéfinition Ockhamiste de la\nsignification</em>, In <em>Sprache und Erkenntnis im Mittelalter</em>\n(= Miscellanea Mediaevalia 13/1–2), ed. W. Kluxen et al., Berlin,\nNew York: W. de Gruyter, vol. 1, 451–58.</li>\n<li>Biard, Joël: 1989, <em>Logique et théorie du signe au\nXIV<sup>e</sup> siècle</em>, Vrin, Paris.</li>\n<li>Biard, Joël (ed.): 2009, Le langage mental du moyen âge\nà 'âge classique, Louvain, Paris: Éditions\nPeeters.</li>\n<li>Borsche, Tilman: 1994, “Zeichentheorie im Übergang von\nden Stoikern zu Augustin”, <em>Allgemeine Zeitschrift für\nPhilosophie</em> 19: 41–52.</li>\n<li>Braakhuis, H. A. G.: 1985, “Kilwardby vs Bacon? The\nContribution to the Discussion on Univocal Signification of Beings and\nNon-Beings Found in a Sophism Attributed to Robert Kilwardby”,\nin: <em>Medieval Semantics and Metaphysics</em>, ed. E. P. Bos,\nNijmegen: Ingenium, 111–142.</li>\n<li>Broadie, Alexander: 1985, <em>The circle of John Mair. Logic and\nLogicians in Pre-Reformation Scotland</em>, Oxford: Oxford University\nPress.</li>\n<li>Broadie, Alexander: 1989<em>, Notion and Object. Aspects of Late\nMedieval Epistemology</em>, Oxford: Clarendon.</li>\n<li>Bursill-Hall, G. L.: 1971, <em>Speculative Grammars of the Middle\nAges: The Doctrine of the partes orationis of the Modistae</em>,\nApproaches to Semantics, 11, The Hague: Mouton.</li>\n<li>Bursill-Hall, G. L.: 1976, “Some Notes on the Grammatical\nTheory of Boethius of Dacia”. In <em>History of Linguistic\nThought and Contemporary Linguistics</em>, ed. H. Parret, Berlin: W. de\nGruyter, 164–88.</li>\n<li>de Rijk, Lambert Marie: 1962–67, <em>Logica modernorum.</em> <em>A\nContribution to the History of Early Terminist Logic</em>, Assen: Van\nGorcum.</li>\n<li>Duchrow, Ulrich: 1965, <em>Sprachverständnis und biblisches\nHören bei Augustinus</em>, Tübingen: Mohr.</li>\n<li>Ebbesen, Sten: 1983, “The Odyssey of Semantics from the Stoa\nto Buridan”, in: <em>History of Semiotics</em>, ed. A. Eschbach\nand J. Trabant, Amsterdam: Benjamins, 67–85.</li>\n<li>Ebbesen, Sten. 1995. “Introduction”, in: S. Ebbesen\n(ed.), <em>Sprachtheorien in Spätantike und Mittelalter</em> (= P.\nSchmitter, ed., Geschichte der Sprachtheorie 3). Tübingen: Gunter\nNarr Verlag, XI-XX.</li>\n<li>Eco, Umberto: 1988, “Wer ist schuld an der Konfusion von\nDenotation und Bedeutung? Versuch einer Spurensicherung”,\n<em>Zeitschrift für Semiotik</em>, 10: 189–207.</li>\n<li>Eco, Umberto et al.: 1989, On animal language in the medieval\nclassification of signs, in <em>On the Medieval Theory of Signs</em>,\ned. U. Eco and C. Marmo, Amsterdam: Benjamins, 3–41.</li>\n<li>Engels, J.: 1962, La doctrine du signe chez Saint Augustine, in\n<em>Studia Patristica</em>, ed. F. L. Cross, Berlin: Akademie-Verlag,\n366–73.</li>\n<li>Engels, J.: 1963, Origine, sens et survie du terme boécien\n“secundum placitum”, <em>Vivarium</em>, 1: 87–114.</li>\n<li>Eschbach, Achim and Trabant, Jürgen: 1983, <em>History of\nSemiotics</em>, Amsterdam: Benjamins.</li>\n<li>Faes de Mottoni, Barbara: 1986, “Enuntiatores divini\nsilentii: Tommaso d'Aquino e il linguaggo degli angeli”;\n<em>Medioevo</em>, 12: 197–228.</li>\n<li>Faes de Mottoni, Barbara: 1988, “Voci,\n‘Alphabeto’ e altri segni degli angeli nella quaestio 12\ndel de cognitione angelorum di Egidio Romano”; <em>Medioevo</em>,\n14: 71–105.</li>\n<li>Fredborg, Karin Margareta: 1980, “Universal Grammar According\nto Some 12th-Century Grammarians,” in <em>Studies in Medieval\nLinguistic Thought</em>, ed. Konrad Koerner et al., Historiagraphia\nLinguistica, VII.1/2, John Benjamins, Amsterdam, 69–84.</li>\n<li>Fredborg, Karen Margarete: 1981, “Roger Bacon on\n‘Impositio vocis ad significandum’“, in: <em>English\nLogic and Semantics: From the End of the Twelfth Century to the Time of\nOckham and Burleigh</em>, ed. H. A. G. Braakhuis, C. H. Kneepkens, and\nL. M. de Rijk, Nijmegen: Ingenium, 167–191.</li>\n<li>Fuchs, Michael: 1999, Zeichen und Wissen. Das Verhältnis der\nZeichentheorie zur Theorie des Wissens und der Wissenschaften im\ndreizehnten Jahrhundert, Aschendorff, Münster in Westfalen.</li>\n<li>Gill, Harjeet Singh: 1999, “The Abélardian Tradition\nof Semiotics”. In <em>Signs and Signification</em>, vol. 1, ed.\nH. Singh Gill and G. Manetti, New Delhi: Bahri, 35–67.</li>\n<li>Glidden, David: 1983, “Skeptic semiotics”,\n<em>Phronesis</em>, 28: 213–55.</li>\n<li>Grassi, Onorato: 1986, <em>Intuizione e significato. Adam Wodeham\ned il problema della conoscenza nel XIV secolo</em>, Jaca,\nMailand.</li>\n<li>Haller, Rudolf: 1962, “Untersuchungen zum Bedeutungsproblem\nin der antiken und mittelalterlichen Philosophie”, <em>Archiv\nfür Begriffgeschichte</em>, 7: 57–119.</li>\n<li>Häring, Nikolaus M.: 1956, “Caracter, Signum und\nSignaculum. Der Weg von Petrus Damiani bis zur eigentlichen Aufnahme in\ndie Sakramentenlehre im 12. Jahrhundert”, <em>Scholastik</em>, 31:\n41–69.</li>\n<li>Howell, Kenneth: 1987, “Two aspects of Roger Bacon's semiotic\ntheory in De signis”, <em>Semiotica</em>, 63: 73–81.</li>\n<li>Hübener, Wolfgang: 1968, <em>Studien zur kognitiven\nRepräsentation in der mittelalterlichen Philosophie</em>.\nUnpublished Habilitationsschrift. Berlin.</li>\n<li>Hübener, Wolfgang: 1974, “Der theologisch-philosophische\nKonservativismus des Jean Gerson”. In <em>Antiqui und moderni:\nTraditionsbewusstsein und Fortschrittsbewusstsein im späten\nMittelalter</em> (= Miscellanea mediaevalia 9), ed. A. Zimmermann,\nBerlin, New York: W. de Gruyter, 171–200.</li>\n<li>Hübener, Wolfgang: 1981, “‘Oratio mentalis’\nund ‘oratio vocalis’ in der Philosophie des 14.\nJahrhunderts”. In <em>Sprache und Erkenntnis im Mittelalter</em>\n(= Miscellanea Mediaevalia 13/1–2), W. Kluxen <em>et al</em>. (eds.),\nBerlin, New York: W. de Gruyter, vol. 1, 488–97.</li>\n<li>Hübener, Wolfgang: 1990, “Wyclifs Kritik an den Doctores\nsignorum”. In <em>Die Gegenwart Ockhams</em>, ed. W. Vossenkuhl\nand R. Schönberger, Weinheim: VCH, 128–46.</li>\n<li>Jackson, B. Darrell: 1969, “The Theory of Signs in St.\nAugustine's De doctrina christiana”, <em>Revue des Études\nAugustiniennes</em>, 15: 9–49.</li>\n<li>Jolivet, Jean: 1969, <em>Arts du langage et théologie chez\nAbélard</em>, Paris: Vrin.</li>\n<li>Kaczmarek, Ludger: 1983, Significatio in der Zeichen- und\nSprachtheorie Ockhams. In <em>History of Semiotics</em>, ed. Achim\nEschbach and Jürgen Trabant, Benjamins, Amsterdam, Philadelphia,\n87–104.</li>\n<li>Kneepkens, C. H.: 1995, “The Priscianic Tradition,” in\n<em>Sprachtheorien in Spätantike und Mittelalter</em>, ed. Sten\nEbbesen, Gunter Narr Verlag, Tübingen, 239–64.</li>\n<li>Kretzmann, Norman (ed.): 1988, Meaning and Inference in Medieval\nPhilosophy, Dordrecht: Kluwer.</li>\n<li>Lenz, Martin: 2003, <em>Mentale Sätze: Wilhelm von Ockhams\nThesen zur Sprachlichkeit des Denkens</em>, Wiesbaden: Franz Steiner\nVerlag.</li>\n<li>Magee, John: 1989, <em>Boethius on signification and mind</em>,\nLeiden: Brill.</li>\n<li>Maierù, Alfonso: 1981, “'Signum’ dans la culture\nmédiévale”. In <em>Sprache und Erkenntnis im\nMittelalter</em>, ed. W. Kluxen et al. (= Miscellanea Mediaevalia\n13/1–2), Berlin, New York: W. de Gruyter, vol. 1, 51–71.</li>\n<li>Maloney, Thomas S.: 1983a, “The Semiotics of Roger\nBacon”, <em>Medieval Studies</em>, 45: 120–154.</li>\n<li>Maloney, Thomas S.: 1983b, “Roger Bacon on the significatum\nof words”. In Archélogie du signe, ed. L. Brind'Amour and\nE. Vance, Recueils d’Études Médiévales 3, Ontario,\nToronto.</li>\n<li>Markus, Robert A.: 1957, “St. Augustine on Signs”,\n<em>Phronesis</em> 2: 60–83.</li>\n<li>Marmo, Costantino: 1994, <em>Semiotica e linguaggio nella\nscolastica: Parigi, Bologna, Erfurt, 1270–1330</em>. <em>La semiotica\ndei Modisti</em>, Roma: Instituto Storico Italiano per il\nMedioevo.</li>\n<li>Marmo, Constantino (ed.): 1997, <em>Vestigia, Imagines,\nVerba. Semiotics and Logic in Medieval Theological texts (XIIth-XIVth\nCentury)</em>, Brepols: Turnhout.</li>\n<li>Meier-Oeser, Stephan: 1995a, “Semiotik, Semiologie”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 9, Basle: Schwabe, 601–607.</li>\n<li>Meier-Oeser, Stephan: 1995b, “Signifikation”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 9, Basle: Schwabe, 759–795.</li>\n<li>Meier-Oeser, Stephan: 1997, <em>Die Spur des Zeichen. Das Zeichen\nund seine Funktion in der Philosophie des Mittelalters und der Fruehen\nNeuzeit</em>, Berlin, New York: W. de Gruyter.</li>\n<li>Meier-Oeser, Stephan: 1998, “Synkategorem”. In\n<em>Historisches Wörterbuch der Philosophie</em>, ed. J. Ritter\nand K. Gründer, vol. 10, Basle: Schwabe, 787–799.</li>\n<li>Meier-Oeser, Stephan: 2004, “Mental Language and Mental\nRepresentation in Late Scholastic Logic”, in S. Ebbesen and\nR. L. Friedman (eds.), <em>John Buridan and Beyond. The Language\nSciences, and their Connection to the Theories of Mind 1300–1700</em>,\nCopenhagen: Reitzel, pp. 237–265.</li>\n<li>Meier-Oeser, Stephan: 2009, “Walter Burley's\n‘propositio in re’ and the Systematization of the\n‘ordo significationis’”, in <em>Philosophical\nDebates at Paris in the Early Fourteenth Century</em>,\ned. S. F. Brown, Th. Dewender and Th. Kobusch (eds.), Leiden, Boston:\nBrill, p. 483–505.</li>\n<li>Muñoz Delgado, Vicente: 1964, <em>La Lógica\nNominalista en la Universidad de Salamanca (1510–1530)</em>, Madrid:\nRevista Estudios.</li>\n<li>Muñoz Delgado, Vicente: 1966, “La lógica como\n‘scientia sermocinalis’ en la obra de Pedro Sánchez\nCiruelo (1470–1554)”, <em>Estudios</em>, 22: 23–52.</li>\n<li>Muñoz Delgado, Vicente: 1970, “La obra lógica\nde los españoles en Paris (1500–1525)”, <em>Estudios</em>,\n26: 209–280.</li>\n<li>Muñoz Delgado, Vicente: 1983, “Pedro de Espinosa y la\nlogica en Salamanca hasta 1550”, <em>Anuario filosofico</em>, 16:\n119–208.</li>\n<li>Nuchelmans, Gabriel: 1980, <em>Late-Scholastic and Humanist Theorys\nof the Proposition</em>, Amsterdam: North Holland\nPublications.</li>\n<li>Marmo, Costantino: 1999, “The Semantics of the\n<em>Modistae</em>,” in <em>Medieval Analyses in Language and\nCognition</em>, Acts of the Symposium, ‘The Copenhagen School of\nMedieval Philosophy’, January 10–13, 1996, ed. Sten Ebbesen and\nRussell L. Friedman, Royal Danish Academy of Sciences and Letters,\nCopenhagen: C. A. Reitzel, 83–104.</li>\n<li>Panaccio, Claude: 1996, “Le langage mental en discussion:\n1320–1355”. <em>Les Études philosophiques</em>, 3:\n323–39.</li>\n<li>Panaccio, Claude: 1999a: “Grammar and Mental Language in\nPseudo-Kilwardby”, in <em>Medieval Analyses in Language and\nCognition</em>, Acts of the Symposium, ‘The Copenhagen School of\nMedieval Philosophy’, January 10–13, 1996, ed. Sten Ebbesen and\nRussell L. Friedman, Royal Danish Academy of Sciences and Letters,\nCopenhagen: Reitzel, 397–413.</li>\n<li>Panaccio, Claude: 1999b, <em>Le discours intérieur de Platon\na Guillaume d'Ockham</em>, Paris: Seuil.</li>\n<li>Panaccio, Claude: 2004, <em>Ockham on Concepts</em>, Aldershot:\nAshgate.</li>\n<li>Pinborg, Jan: 1962, “Das Sprachdenken der Stoa und Augustins\nDialektik”, <em>Classica et Mediaevalia</em>, 23: 148–77.</li>\n<li>Pinborg, Jan: 1967, <em>Die Entwicklung der Sprachtheorie im\nMittelalter</em>, Beiträge zur Geschichte der Philosophie und\nTheologie im Mittelalter XLII.2, Münster: Aschendorff.</li>\n<li>Pinborg, Jan: 1971, “Bezeichnung in der Logik des XIII\nJahrhunderts”. in <em>Der Begriff der repraesentatio im\nMittelalter, Stellvertretung – Symbol – Zeichen –\nBild</em>, ed. A.  Zimmermann (= Miscellanea mediaevalia 8) Berlin,\nNew York: W. de Gruyter, 237–281.</li>\n<li>Pinborg, Jan: 1972, <em>Logik und Semantik im Mittelalter. Ein\nÜberblick</em>, Stuttgart-Bad Cannstatt: Frommann-Holzboog.</li>\n<li>Pinborg, Jan: 1976, “Some Problems of Semantic Representation\nin Medieval Logic”. In <em>History of Linguistic Thought and\nContemporary Linguistics</em>, ed. H. Parret, Berlin, New York: W. de\nGruyter, 254–78.</li>\n<li>Pinborg, Jan: 1981, “Roger Bacon on Signs: A Newly Recovered\nPart of the Opus maius”, in <em>Sprache und Erkenntnis im\nMittelalter</em>, ed. W. Kluxen et al. (= Miscellanea Mediaevalia\n13/1–2), Berlin, New York: W. de Gruyter, vol. 1, 403–412.</li>\n<li>Pinborg, Jan: 1982, “Speculative Grammar,” in <em>The\nCambridge History of Later Medieval Philosophy</em>, ed. Norman\nKretzmann, Anthony Kenny, and Jan Pinborg, Cambridge: Cambridge\nUniversity Press, 254–69.</li>\n<li>Posner, Roland, Robering, Klaus and Sebeok, Thomas A. (Eds.): 1997,\nSemiotik – Semiotics. Ein Handbuch zu den zeichentheoretischen\nGrundlagen von Natur und Kultur, vol. 1, Berlin, New York: W. de\nGruyter.</li>\n<li>Rosier, Irène: 1994, <em>La parole comme acte. Sur la\ngrammaire et la sémantique au XIIIe siècle</em>, Paris:\nVrin.</li>\n<li>Rosier, Irène: 1995, “<em>Res significata et modus\nsignificandi</em>: Les implications d'une distinction\nmédiévale,” in <em>Sprachtheorien in\nSpätantike und Mittelalter</em>, ed. Sten Ebbesen, Gunter Narr\nVerlag, Tübingen, 135–68.</li>\n<li>Rosier-Catach, Irène: 2000, Aristotle and Augustine. Two\nModels of Occidental Medieval Semantics, in: In <em>Signs and\nSignification</em>, vol. 2, ed. H. Singh Gill and G. Manetti, New\nDelhi: Bahri, 41–62.</li>\n<li>Rosier-Catach, Irène: forthcoming <em>Signes et sacrements.\nLa parole efficace</em>, Paris: Seuil.</li>\n<li>Ruef, Hans 1981, Augustin über Semiotik und Sprache.\nSprachtheoretische Analysen zu Augustins Schrift “De\nDialectica”, Bern: Wyss Erben.</li>\n<li>Simone, Raffaele: 1972, “Sémiologie\naugustinienne”. <em>Semiotica</em>, 6: 1–31.</li>\n<li>Sirridge, Mary: 1999, “‘Quam videndo intus\ndicimus’: Seeing and Saying in De Trinitate XV” in\n<em>Medieval Analyses in Language and Cognition</em>, Acts of the\nSymposium, ‘The Copenhagen School of Medieval Philosophy’,\nJanuary 10–13, 1996, ed. Sten Ebbesen and Russell L. Friedman, Royal\nDanish Academy of Sciences and Letters, Copenhagen: Reitzel,\n318–330.</li>\n<li>Tabarroni, Andrea: 1989, “Mental signs and the theory of\nrepresentation in Ockham”, in <em>On the Medieval Theory of\nSigns</em>, ed. U. Eco and C. Marmo, Amsterdam: Benjamins,\n195–224.</li>\n<li>Tweedale, Martin: 1990. “Mental Representation in Later\nMedieval Scholasticism”, in: <em>Historical Foundations of\nCognitive Science</em>, ed. J.-C. Smith, Dordrecht: Kluwer, 35-52.</li>\n<li>Umiker-Sebeok, J. and Sebeok, Thomas A. (Eds.): 1987, <em>Monastic\nSign Languages</em>, Approaches to Semiotics 76, Amsterdam:\nBenjamins.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["mental representation: in medieval philosophy", "Ockham [Occam], William", "Peirce, Charles Sanders", "Thomas of Erfurt"], "entry_link": [{"../representation-medieval/": "mental representation: in medieval philosophy"}, {"../ockham/": "Ockham [Occam], William"}, {"../peirce/": "Peirce, Charles Sanders"}, {"../erfurt/": "Thomas of Erfurt"}]}, "academic_tools": {"listed_text": ["<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=semiotics-medieval\" target=\"other\">How to cite this entry</a>.", "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/semiotics-medieval/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=semiotics-medieval&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"http://philpapers.org/sep/semiotics-medieval/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=semiotics-medieval": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/semiotics-medieval/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=semiotics-medieval&redirect=True": "Look up topics and thinkers related to this entry"}, {"http://philpapers.org/sep/semiotics-medieval/": "Enhanced bibliography for this entry"}, {"http://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [], "listed_links": []}, "tokenized_text": ["1", "semiotics", "place", "framework", "scholastic", "discipline", "speak", "medieval", "semiotics", "speak", "precisely", "defined", "discipline", "besides", "distinct", "medieval", "art", "science", "rather", "speak", "complex", "field", "le", "mostly", "elaborate", "reflection", "concept", "sign", "nature", "function", "classification", "order", "understand", "enormous", "extent", "theory", "grew", "middle", "age", "basic", "formal", "feature", "scholastic", "organization", "knowledge", "kept", "mind", "first", "scholastic", "learning", "essentially", "commentary", "tradition", "writing", "either", "explicit", "commentary", "time", "taken", "canonical", "text", "eg", "work", "aristotle", "sentence", "peter", "lombard", "grammar", "priscian", "summulae", "logicales", "peter", "spain", "buridan", "least", "composed", "constant", "reference", "topic", "treated", "second", "point", "closely", "related", "first", "common", "scholastic", "practice", "putting", "great", "effort", "conceptual", "analysis", "basic", "term", "notion", "thus", "wherever", "term", "like", "sign", "signum", "representation", "repraesentatio", "appeared", "text", "commented", "scholastic", "author", "felt", "obliged", "either", "give", "explicit", "account", "concept", "least", "able", "refer", "place", "done", "view", "fact", "aristotle", "interpretation", "incidentally", "called", "word", "sign", "semeion", "symbol", "mental", "concept", "augustine", "termed", "sacrament", "sacred", "sign", "signum", "sacrum", "became", "important", "later", "development", "semiotics", "case", "outcome", "large", "number", "detailed", "exploration", "nature", "division", "sign", "point", "combined", "resulted", "general", "tendency", "towards", "increasing", "complexity", "refinement", "scholastic", "discourse", "part", "intrinsic", "logic", "commentary", "tradition", "close", "parallel", "found", "indian", "tradition", "logic", "semiotics", "discus", "later", "commentary", "many", "case", "actually", "metacommentaries", "compete", "previous", "one", "surpass", "elaboration", "taking", "evaluating", "commenting", "argument", "terminological", "distinction", "various", "area", "within", "scholastic", "system", "art", "science", "rich", "tradition", "semiotic", "question", "answer", "accumulated", "century", "maierù", "1981", "meieroeser", "1997", "42170", "fuchs", "1999", "important", "place", "located", "realm", "socalled", "trivium", "ie", "grammar", "rhetoric", "logic", "especially", "logic", "already", "determination", "primary", "subject", "well", "discussion", "basic", "logical", "notion", "like", "term", "signification", "gave", "rise", "explicit", "remark", "concept", "sign", "relevant", "locus", "classici", "logical", "contribution", "general", "theory", "sign", "signification", "comment", "aristotle", "s", "introductory", "chapter", "interpretation", "esp", "1", "16a38", "common", "starting", "point", "virtually", "medieval", "theory", "semantics", "magee", "1989", "8", "well", "commentary", "especially", "15th", "early", "16th", "century", "first", "tract", "socalled", "summulae", "logicales", "peter", "spain", "text", "part", "logical", "textbook", "related", "one", "aforementioned", "passage", "consideration", "relevance", "semiotics", "within", "sphere", "logic", "found", "though", "le", "frequently", "commentary", "final", "chapter", "prior", "analytics", "2", "27", "70ab", "aristotle", "outlined", "doctrine", "inference", "sign", "1", "still", "within", "sphere", "trivium", "various", "effort", "develop", "grammar", "regular", "science", "matching", "aristotelian", "standard", "led", "second", "half", "13th", "century", "approach", "language", "either", "starting", "general", "concept", "sign", "bacon", "pskilwardby", "taking", "grammar", "theory", "reflecting", "fundamental", "structure", "sign", "system", "grammatica", "speculativa", "rich", "source", "semiotic", "material", "also", "found", "theologicophilosophical", "tradition", "locus", "classici", "semiotic", "discussion", "commentary", "book", "sentence", "liber", "sententiarum", "peter", "lombard", "basic", "scholastic", "textbook", "theology", "particularly", "comment", "book", "1", "distinction", "1", "sign", "subject", "mean", "instruction", "bk", "1", "dist", "3", "difference", "image", "trace", "respective", "epistemic", "value", "bk", "1", "dist", "27", "mental", "concept", "spoken", "word", "signification", "bk", "2", "dist", "10", "communication", "angel", "2", "last", "least", "bk", "4", "dist", "1", "sacramental", "sign", "sign", "general", "3", "outside", "philosophical", "theological", "discourse", "notion", "sign", "traditionally", "played", "important", "role", "theory", "practice", "medical", "diagnostics", "maierù", "1981", "64ff", "2", "late", "ancient", "source", "medieval", "semiotics", "core", "set", "idea", "doctrine", "medieval", "philosopher", "developed", "semiotic", "theory", "provided", "mainly", "two", "late", "ancient", "author", "besides", "boethius", "480528", "transmitted", "aristotelian", "semantics", "latin", "middle", "age", "augustine", "s", "354430", "doctrine", "sign", "important", "junction", "ancient", "medieval", "theory", "sign", "signification", "augustine", "s", "doctrine", "also", "seen", "decisive", "turning", "point", "history", "semiotics", "21", "augustine", "354430", "augustine", "s", "assertion", "remark", "even", "though", "offer", "completely", "uniform", "concept", "sign", "fundamental", "development", "medieval", "semiotic", "constituted", "elaborate", "theory", "sign", "13th", "century", "apart", "original", "theory", "peter", "abelard", "incomplete", "early", "work", "de", "dialectica", "augustine", "massively", "draw", "terminology", "stoic", "philosophy", "language", "though", "many", "point", "fundamentally", "modifying", "sense", "4", "especially", "concept", "sign", "difference", "stoic", "doctrine", "becomes", "apparent", "according", "refined", "theory", "stoic", "logician", "sign", "proper", "technical", "sense", "semeion", "seen", "abstract", "propositional", "content", "sentence", "insofar", "functioning", "antecedent", "true", "implication", "mean", "hitherto", "unknown", "truth", "revealed", "contrast", "augustine", "favoring", "reifying", "concept", "sign", "sign", "defines", "line", "description", "given", "cicero", "latin", "tradition", "rhetoric", "5", "something", "show", "sens", "something", "mind", "signum", "est", "quod", "se", "ipsum", "sensui", "et", "praeter", "se", "aliquid", "animo", "ostendit", "augustine", "de", "dial", "1975", "86", "concept", "sign", "thus", "defined", "term", "triadic", "relation", "sign", "always", "sign", "something", "mind", "provides", "general", "basis", "augustine", "s", "theory", "language", "speak", "give", "sign", "articulate", "voice", "loqui", "est", "articulata", "voce", "signum", "dare", "augustine", "de", "dial", "1975", "86", "speech", "contrast", "stoic", "semantics", "essentially", "characterized", "communicative", "function", "word", "definition", "sign", "something", "understood", "hearer", "pronounced", "speaker", "uniuscuiusque", "rei", "signum", "quod", "ab", "audiente", "possit", "intelligi", "loquente", "prolatum", "augustine", "de", "dial", "1975", "86", "communicative", "function", "6", "thus", "essential", "linguistic", "sign", "reason", "signifying", "ie", "giving", "sign", "except", "convey", "another", "s", "mind", "signgiver", "mind", "nec", "ulla", "causa", "est", "nobis", "significandi", "id", "est", "signi", "dandi", "nisi", "ad", "traiciendum", "alterius", "animum", "id", "quod", "animo", "gerit", "qui", "signum", "dat", "augustine", "de", "doctr", "chr", "ii", "3", "1963", "34", "1720", "dialogue", "de", "magistro", "teacher", "however", "written", "shortly", "de", "dialectica", "augustine", "denies", "word", "sign", "power", "showing", "anything", "sense", "making", "something", "present", "understanding", "non", "mihi", "rem", "quam", "significat", "ostendit", "verbum", "augustine", "de", "magistro", "x", "32", "1974", "191", "reason", "still", "influenced", "tenet", "skeptical", "tradition", "time", "7", "augustine", "limiting", "capacity", "sign", "admonitory", "commemorative", "function", "augustine", "de", "magistro", "xi", "36", "1974", "194", "de", "doctrina", "christiana", "abandoning", "skeptical", "position", "augustine", "redefines", "sign", "accordingly", "claiming", "sign", "something", "offering", "sens", "conveys", "something", "intellect", "signum", "est", "re", "praeter", "speciem", "quam", "ingerit", "sensibus", "aliud", "aliquid", "ex", "se", "faciens", "cogitationem", "venire", "augustine", "de", "doctr", "chr", "ii", "1", "1963", "33", "contrast", "former", "view", "attributing", "fundamental", "epistemic", "function", "sign", "claiming", "instruction", "either", "thing", "sign", "thing", "learnt", "mean", "sign", "omnis", "doctrina", "vel", "rerum", "est", "vel", "signorum", "sed", "re", "per", "signa", "discuntur", "augustine", "de", "doctr", "chr", "1", "1963", "9", "borderline", "thing", "sign", "thus", "sign", "defined", "functionally", "rather", "ontologically", "sign", "thing", "employed", "signify", "something", "re", "quae", "ad", "significandum", "aliquid", "adhibentur", "augustine", "de", "doctr", "chr", "1", "1963", "9", "augustine", "divide", "sign", "two", "main", "class", "natural", "sign", "signa", "naturalia", "given", "sign", "signa", "data", "natural", "sign", "apart", "intention", "desire", "using", "sign", "yet", "lead", "knowledge", "something", "else", "8", "example", "smoke", "indicates", "fire", "footprint", "animal", "passing", "countenance", "angry", "sorrowful", "man", "conventional", "sign", "hand", "living", "being", "mutually", "exchange", "order", "show", "well", "feeling", "mind", "perception", "thoughts", "9", "whether", "extent", "intention", "signify", "voluntas", "significandi", "assumed", "case", "animal", "sign", "communication", "augustine", "leaf", "open", "10", "sign", "used", "human", "communication", "subdivided", "regard", "sens", "address", "relate", "sense", "sight", "hearing", "sens", "preeminent", "role", "among", "sort", "given", "sign", "augustine", "claiming", "word", "result", "quantitative", "preponderance", "rather", "fact", "point", "everything", "indicated", "nonverbal", "sign", "put", "word", "vice", "versa", "augustine", "de", "doctr", "chr", "ii", "7", "1963", "35", "word", "verbum", "proper", "sense", "mean", "least", "early", "augustine", "spoken", "word", "writing", "litterae", "introduced", "man", "order", "impart", "permanency", "spoken", "language", "secondary", "system", "sign", "consisting", "sign", "word", "signa", "verborum", "rather", "word", "augustine", "de", "doctr", "chr", "ii", "8", "ibid", "de", "dial", "1975", "86f", "close", "analogy", "devaluation", "written", "word", "spoken", "one", "augustine", "later", "theory", "verbum", "mentis", "mental", "word", "advocating", "devaluation", "spoken", "word", "external", "sign", "general", "internal", "sphere", "mental", "cognition", "mental", "interior", "word", "verbum", "interius", "ie", "mental", "concept", "considered", "word", "proper", "sense", "whereas", "spoken", "word", "appears", "mere", "sign", "voice", "word", "signum", "verbi", "vox", "verbi", "augustine", "de", "trinitate", "xv", "11", "20", "1968", "486f", "11", "thought", "cogitationes", "performed", "mental", "word", "verbum", "mentis", "corresponding", "later", "called", "conceptus", "mentis", "intellectus", "mean", "linguistic", "entity", "proper", "sense", "nullius", "lingua", "ie", "belong", "particular", "spoken", "language", "like", "latin", "greek", "confronted", "paradoxical", "situation", "linguistic", "terminology", "eg", "verbum", "locutio", "oratio", "dicere", "etc", "used", "describe", "phenomenon", "whose", "independence", "language", "strongly", "emphasized", "time", "despite", "internal", "rupture", "inconsistency", "augustine", "s", "doctrine", "sign", "based", "definition", "sign", "first", "time", "intends", "embrace", "natural", "indexical", "sign", "conventional", "linguistic", "sign", "specie", "allembracing", "generic", "notion", "sign", "thus", "marking", "turning", "point", "history", "semiotics", "22", "boethius", "480528", "even", "though", "boethius", "line", "aristotelian", "writing", "commented", "focus", "concept", "linguistic", "signification", "hardly", "ever", "explicitly", "speaks", "sign", "notae", "general", "magee", "1989", "61ff", "besides", "augustine", "main", "source", "medieval", "theory", "sign", "explained", "fact", "due", "augustine", "s", "influence", "semantics", "linguistic", "sign", "became", "focus", "semiotic", "theory", "boethius", "translation", "comment", "part", "aristotelian", "organon", "especially", "peri", "hermeneias", "important", "long", "time", "available", "source", "medieval", "acquaintance", "semantics", "aristotle", "neoplatonic", "commentator", "late", "antiquity", "thus", "medieval", "philosopher", "viewed", "aristotle", "s", "logic", "first", "eye", "boethius", "made", "influential", "decision", "concerning", "semantic", "terminology", "engels", "1963", "well", "interpretation", "aristotelian", "text", "learned", "writing", "inter", "alia", "insight", "conventional", "character", "language", "view", "meaning", "established", "act", "imposition", "ie", "namegiving", "referencesetting", "influential", "idea", "signify", "significare", "establish", "understanding", "intellectum", "constituere", "especially", "elaborate", "second", "commentary", "peri", "hermeneias", "boethius", "discus", "length", "interrelation", "four", "element", "linguistic", "semeiosis", "mentioned", "aristotle", "ie", "external", "object", "thing", "re", "mental", "concept", "representation", "passiones", "intellectus", "spoken", "word", "vox", "written", "word", "scripta", "element", "arranged", "build", "boethius", "call", "order", "speaking", "ordo", "orandi", "magee", "1989", "6492", "characterized", "fact", "among", "element", "mentioned", "former", "case", "ontologically", "precedes", "latter", "thus", "without", "existence", "thing", "would", "concept", "without", "concept", "spoken", "word", "without", "spoken", "word", "written", "one", "however", "reversible", "sense", "use", "written", "character", "case", "demand", "knowledge", "vocal", "expression", "denoted", "always", "concept", "behind", "spoken", "word", "every", "concept", "refers", "real", "thing", "object", "boethius", "periherm", "ed", "sec", "1880", "21", "2830", "case", "ordo", "orandi", "determines", "direction", "linguistic", "signification", "written", "character", "signify", "spoken", "word", "whereas", "spoken", "word", "primarily", "signify", "mental", "concept", "mean", "latter", "secondaryly", "denote", "thing", "thus", "scriptura", "left", "aside", "remaining", "three", "element", "structurally", "organized", "along", "line", "prominent", "semiotic", "triangle", "according", "sign", "refer", "thing", "mean", "concept", "boethius", "periherm", "ed", "sec", "1880", "24", "33", "discussion", "ordo", "orandi", "boethius", "divide", "reference", "porphyrius", "aristotelian", "peripatetici", "three", "level", "speech", "besides", "rather", "fundament", "written", "spoken", "discourse", "mental", "speech", "oratio", "mentis", "thinking", "performed", "12", "like", "augustinian", "mental", "word", "made", "word", "national", "language", "rather", "transidiomatic", "even", "nonlinguistic", "mental", "concept", "aristotle", "claimed", "men", "3", "semiotic", "beginning", "11th", "12th", "century", "late", "11th", "century", "anselm", "canterbury", "10331109", "revived", "augustinian", "doctrine", "verbum", "mentis", "combining", "aristotelian", "view", "mental", "concept", "outlined", "opening", "chapter", "peri", "hermeneias", "thus", "two", "aspect", "mental", "word", "found", "le", "implicitly", "augustine", "s", "work", "already", "became", "explicit", "anselm", "first", "mental", "word", "natural", "word", "thus", "identical", "human", "being", "verba", "naturalia", "et", "apud", "omnes", "gens", "eadem", "anselm", "canterbury", "monolog", "1968", "25", "second", "similitude", "mental", "image", "thing", "similitudines", "et", "imago", "rerum", "13", "due", "signify", "object", "expressive", "way", "expressius", "signant", "kind", "word", "thus", "anselm", "agrees", "augustine", "termed", "word", "proper", "sense", "anselm", "canterbury", "monolog", "1968", "25", "constitutive", "factor", "emergence", "medieval", "theory", "sign", "within", "context", "grammar", "logic", "resumption", "augustine", "s", "practice", "embedding", "concept", "language", "generic", "notion", "sign", "already", "peter", "abelard", "10791142", "many", "respect", "important", "author", "12th", "century", "point", "phenomenon", "linguistic", "signification", "significatio", "vocum", "falling", "sphere", "competence", "logic", "cover", "whole", "range", "sign", "process", "abelard", "de", "dial", "1956", "111", "thing", "broadest", "sense", "may", "function", "sign", "connected", "way", "perception", "one", "lead", "cognition", "case", "one", "thing", "image", "thing", "either", "arbitrarily", "imposed", "exercise", "function", "signifying", "significandi", "officium", "instance", "famous", "circulus", "vini", "wreath", "foliage", "attached", "outside", "tavern", "indicating", "wine", "sold", "inside", "conventional", "gesture", "monastic", "sign", "language", "14", "two", "thing", "repeatedly", "noticed", "conjunction", "customarily", "secundum", "consuetudinem", "associated", "finally", "bear", "sort", "relationship", "secundum", "aliquam", "earum", "ad", "se", "habitudinem", "15", "abelard", "apparently", "well", "aware", "fact", "concept", "sign", "result", "taking", "account", "case", "instance", "signification", "general", "also", "unspecific", "order", "able", "single", "case", "properly", "signifying", "proprie", "significare", "pansemiotic", "setting", "introduces", "distinction", "distinguishing", "sign", "simply", "signify", "signa", "significantia", "sign", "significative", "sign", "signa", "significativa", "ie", "bearer", "meaning", "involved", "process", "intended", "signgiving", "abelard", "de", "dial", "1956", "111", "log", "ingredientibus", "1927", "336ff", "4", "genesis", "elaborate", "theory", "sign", "second", "half", "13th", "century", "genesis", "elaborate", "theory", "sign", "second", "half", "13th", "century", "result", "complex", "interplay", "aristotelian", "augustinian", "influence", "since", "mid13th", "century", "augustinian", "view", "effective", "mainly", "theological", "discussion", "begin", "invade", "faculty", "art", "due", "sign", "increasingly", "taken", "basic", "concept", "linguistic", "science", "scientia", "sermocinalis", "16", "speech", "nothing", "sign", "sermo", "totaliter", "signum", "est", "robert", "kilwardby", "asserts", "kilwardby", "de", "ortu", "scientiarum", "1976", "160", "roger", "bacon", "praise", "sign", "even", "principal", "instrument", "liberal", "art", "17", "true", "consciousness", "word", "sign", "nothing", "new", "point", "onward", "however", "give", "rise", "first", "framework", "grammar", "theory", "semiotic", "reflection", "go", "beyond", "known", "earlier", "century", "41", "psrobert", "kilwardby", "unknown", "author", "commonly", "named", "psrobert", "kilwardby", "open", "commentary", "priscianus", "maior", "written", "somewhere", "1250", "1280", "18", "modifying", "augustine", "s", "prominent", "dictum", "instruction", "either", "thing", "sign", "stronger", "semioticminded", "thesis", "every", "science", "sign", "thing", "signified", "scientia", "omnis", "aut", "est", "de", "signis", "aut", "de", "rebus", "significatis", "psrobert", "kilwardby", "comment", "prisc", "maior", "1975", "1", "statement", "take", "starting", "point", "detailed", "discussion", "question", "whether", "special", "science", "sign", "19", "relationship", "towards", "science", "dealing", "thing", "would", "like", "20", "pskilwardby", "point", "several", "science", "sign", "diversae", "sunt", "scientiae", "de", "signis", "according", "various", "kind", "sign", "psrobert", "kilwardby", "comment", "prisc", "maior", "1975", "3", "since", "however", "discipline", "order", "meet", "aristotelian", "standard", "science", "began", "accepted", "time", "must", "general", "subject", "matter", "scientia", "de", "signis", "necessarily", "contemplates", "sign", "term", "universal", "notion", "abstracted", "particular", "sign", "sub", "ratione", "universalis", "abstracti", "particularibus", "signis", "psrobert", "kilwardby", "comment", "prisc", "maior", "1975", "4", "case", "natural", "sign", "signa", "naturalia", "well", "moral", "sign", "signa", "moralia", "eg", "action", "relation", "good", "bad", "theory", "sign", "separated", "theory", "thing", "signified", "therefore", "sign", "fall", "natural", "moral", "science", "respectively", "psrobert", "kilwardby", "comment", "prisc", "maior", "1975", "6", "linguistic", "sign", "however", "produced", "human", "understanding", "purpose", "communicating", "idea", "subjectmatter", "rational", "science", "scientia", "rationalis", "science", "sign", "42", "roger", "bacon", "ca", "1214ca", "1293", "roger", "bacon", "probably", "important", "medieval", "theorist", "sign", "least", "author", "extensive", "medieval", "tract", "sign", "known", "far", "21", "starting", "minute", "analysis", "notion", "sign", "various", "division", "bacon", "develops", "de", "signis", "ca", "1267", "compendium", "studii", "theologiae", "1292", "general", "conception", "signification", "well", "detailed", "theory", "linguistic", "sign", "augustine", "semantics", "integrated", "broader", "theory", "sign", "general", "according", "bacon", "concept", "sign", "belongs", "category", "relation", "precise", "sign", "pointed", "already", "augustine", "s", "definition", "triadic", "relation", "principle", "sign", "something", "someone", "way", "putting", "point", "however", "give", "rise", "question", "whether", "relatum", "relation", "equally", "essential", "existence", "would", "happen", "one", "relatum", "exist", "designated", "thing", "ceased", "exist", "cognitive", "power", "taking", "notice", "even", "able", "take", "notice", "sign", "bonaventura", "ca", "12171274", "one", "renowned", "theologian", "time", "explicitly", "place", "emphasis", "sign", "s", "relation", "significate", "claiming", "sign", "twofold", "comparison", "signifies", "signifies", "first", "essential", "sign", "always", "act", "second", "habit", "first", "called", "sign", "second", "whence", "circle", "tavern", "always", "sign", "even", "one", "look", "22", "direct", "opposition", "commonly", "accepted", "manner", "presentation", "bacon", "lay", "stress", "pragmatic", "relation", "signinterpreter", "notion", "sign", "claim", "essentially", "predicated", "respect", "someone", "signifies", "one", "could", "conceive", "something", "sign", "would", "void", "vain", "nay", "would", "nt", "sign", "roger", "bacon", "de", "signis", "1978", "81", "essential", "relation", "actual", "sign", "interpreter", "must", "case", "called", "real", "relation", "relatio", "realis", "relation", "significate", "socalled", "relation", "reason", "relatio", "rationis", "bacon", "add", "follow", "sign", "act", "therefore", "thing", "signified", "exists", "nonentity", "signified", "word", "like", "entity", "roger", "bacon", "de", "signis", "1978", "81", "important", "point", "bacon", "deviate", "common", "opinion", "defines", "sign", "upon", "offered", "sense", "intellect", "designates", "something", "intellect", "illud", "quod", "oblatum", "sensui", "vel", "intellectui", "aliquid", "designat", "ipsi", "intellectui", "emphasizes", "contrary", "common", "description", "say", "sign", "offered", "intellect", "23", "bacon", "present", "detailed", "classification", "sign", "24", "taking", "combining", "modifying", "element", "several", "prior", "sign", "typology", "division", "two", "main", "class", "natural", "given", "sign", "taken", "augustine", "distinction", "necessary", "probable", "sign", "borrowed", "aristotle", "pr", "ii", "27", "70a3b5", "subdivision", "according", "temporal", "reference", "traditional", "element", "theory", "sacramental", "sign", "25", "1", "natural", "sign", "11", "signifying", "inference", "concomitance", "consequence", "111", "signifying", "necessarily", "1111", "signifying", "something", "present", "large", "extremeties", "strength", "1112", "signifying", "something", "past", "lactation", "birth", "child", "1113", "signifying", "something", "future", "dawn", "imminent", "sunrise", "112", "signifying", "probability", "1121", "signifying", "sth", "present", "mother", "love", "1122", "signifying", "sth", "past", "wet", "ground", "previous", "rain", "1123", "signifying", "sth", "future", "red", "sky", "morning", "rain", "12", "signifying", "configuration", "likeness", "image", "picture", "specie", "colour", "13", "signifying", "causality", "track", "animal", "2", "sign", "given", "directed", "soul", "21", "signifying", "instinctively", "without", "deliberation", "sigh", "pain", "laughter", "joy", "22", "signifying", "deliberation", "word", "23", "interjection", "general", "class", "natural", "sign", "signifying", "unintentionally", "essence", "1", "divided", "according", "relation", "sign", "significate", "three", "subclass", "11", "inferential", "sign", "based", "le", "constant", "concomitance", "sign", "significate", "12", "iconic", "sign", "based", "similarity", "appearance", "13", "sign", "based", "causal", "relation", "sign", "signified", "thing", "sign", "inference", "illatio", "subdivided", "111", "necessary", "112", "probable", "sign", "differentiated", "according", "three", "possible", "direction", "temporal", "reference", "present", "past", "future", "bacon", "give", "understand", "take", "inferential", "iconic", "sign", "sign", "properly", "member", "third", "class", "ie", "sign", "based", "causal", "relation", "later", "compendium", "studii", "theologiae", "drop", "class", "entirely", "justifies", "pointing", "fundamental", "difference", "sign", "relation", "causal", "relation", "whereas", "sign", "relation", "necessarily", "constituted", "interpreter", "causal", "relation", "exist", "independently", "one", "alone", "reason", "order", "nature", "26", "general", "class", "sign", "given", "directed", "soul", "signa", "ordinata", "ab", "anima", "2", "divided", "according", "whether", "living", "brings", "forth", "sign", "21", "together", "deliberation", "reason", "choice", "cum", "deliberatione", "rationis", "et", "electione", "voluntatis", "22", "natural", "instinct", "impulse", "instictu", "naturali", "et", "impetu", "naturae", "reason", "distinguishing", "two", "mode", "natural", "signifying", "appear", "1", "21", "one", "hand", "equivocation", "concept", "nature", "meaning", "substance", "essence", "something", "substantia", "sive", "essentia", "cuiuslibet", "well", "force", "acting", "without", "deliberation", "virtu", "agens", "sine", "deliberatione", "de", "signis", "1978", "85f", "hand", "insight", "contrary", "hold", "natural", "sign", "first", "sense", "case", "latter", "always", "signgiver", "someone", "taking", "something", "sign", "interjection", "23", "considered", "hybrid", "two", "sort", "given", "sign", "noticed", "bacon", "s", "well", "medieval", "signtypology", "class", "sign", "even", "though", "explicitly", "stated", "author", "distinguish", "mode", "signifying", "rather", "sign", "sense", "signvehicles", "therefore", "one", "thing", "fact", "event", "may", "different", "respect", "fall", "various", "even", "opposite", "signclasses", "fact", "especially", "important", "full", "account", "signprocesses", "spoken", "language", "involved", "primary", "intention", "bacon", "s", "semiotic", "analysis", "already", "augustine", "provide", "foundation", "semantics", "spoken", "language", "27", "according", "bacon", "adequate", "complete", "account", "difficult", "issue", "difficilis", "dubitatio", "significate", "vocal", "expression", "consider", "three", "different", "aspect", "1", "signification", "vocal", "expression", "apart", "impositio", "ie", "apart", "endowed", "conventional", "meaning", "imposition", "2", "signification", "according", "imposition", "3", "signification", "imposition", "1", "vocal", "expression", "may", "serve", "independently", "imposition", "natural", "sign", "de", "signis", "1978", "86f", "word", "indicate", "instance", "speaker", "close", "may", "tell", "something", "way", "artwork", "indicating", "skill", "artist", "furthermore", "spoken", "word", "natural", "sign", "implying", "speaker", "posse", "concept", "object", "meant", "word", "according", "regular", "meaning", "significative", "use", "language", "presupposes", "presence", "concept", "speaker", "s", "mind", "corresponds", "object", "denoted", "de", "signis", "1978", "85f", "comp", "studii", "theol", "1988", "64", "thus", "relation", "vocal", "expression", "mental", "concept", "contrary", "common", "opinion", "since", "day", "augustine", "boethius", "relation", "expression", "rather", "indexical", "signification", "2", "account", "signification", "word", "regarding", "impositio", "bacon", "accentuates", "arbitrariness", "meaning", "28", "even", "though", "first", "impositor", "namegiver", "free", "impose", "word", "sign", "anything", "whatsoever", "perform", "act", "imposition", "according", "paradigm", "baptism", "name", "impose", "thing", "impose", "inasmuch", "present", "u", "case", "name", "people", "baptism", "29", "contrary", "venerable", "tradition", "aristotelian", "boethian", "porphyrian", "semantics", "30", "holding", "spoken", "word", "least", "immediately", "signify", "mental", "concept", "bacon", "favor", "view", "word", "according", "imposition", "immediately", "properly", "signify", "thing", "account", "linguistic", "signification", "bacon", "abandon", "model", "semantic", "triangle", "31", "mark", "important", "turning", "point", "way", "traditional", "intensionalist", "semantics", "extensionalist", "reference", "semantics", "became", "increasingly", "accepted", "14th", "century", "32", "bacon", "however", "well", "aware", "fact", "use", "name", "word", "general", "restricted", "meaning", "endowed", "first", "act", "imposition", "term", "homo", "denote", "men", "present", "original", "act", "imposition", "took", "place", "word", "cease", "used", "original", "significata", "thing", "signified", "longer", "physically", "exist", "bacon", "de", "signis", "1978", "128", "bacon", "intends", "solve", "resulting", "difficulty", "every", "causal", "theory", "meaning", "based", "concept", "reference", "setting", "reference", "borrowing", "face", "distinguishing", "two", "mode", "imposition", "seen", "inventive", "contribution", "semantics", "33", "besides", "formal", "mode", "imposition", "conducted", "perlocutionary", "vocal", "expression", "like", "call", "modus", "imponendi", "sub", "forma", "impositionis", "vocaliter", "expressa", "another", "kind", "taking", "place", "tacitly", "sine", "forma", "imponendi", "vocaliter", "expressa", "whenever", "term", "applied", "transumitur", "object", "first", "namegiver", "baptized", "bacon", "de", "signis", "1978", "130", "whereas", "formal", "mode", "imposition", "refers", "either", "mythical", "situation", "first", "invention", "language", "act", "explicitly", "coining", "new", "word", "second", "kind", "imposition", "describes", "actually", "happens", "everyday", "use", "language", "modification", "meaning", "word", "constantly", "taking", "place", "without", "speaker", "anyone", "else", "actually", "aware", "using", "language", "day", "long", "impose", "name", "without", "conscious", "no", "tota", "die", "imponimus", "nomina", "et", "non", "advertimus", "quando", "et", "quomodo", "bacon", "de", "signis", "1978", "100", "130f", "3", "even", "impositio", "described", "sense", "pivotal", "importance", "constitution", "linguistic", "meaning", "signification", "word", "mean", "limited", "vocal", "expression", "signifies", "many", "thing", "imposed", "signifies", "thing", "bear", "essential", "relation", "thing", "word", "imposed", "34", "way", "bacon", "claim", "word", "signify", "infinitely", "many", "thing", "35", "5", "grammatica", "speculativa", "critic", "idea", "fundamental", "bacon", "pskilwardby", "grammar", "regular", "science", "rather", "propaedeutic", "art", "shared", "school", "socalled", "modist", "grammarian", "modistae", "emerging", "around", "1270", "faculty", "art", "university", "paris", "culminating", "grammatica", "speculativa", "thomas", "erfurt", "around", "1300", "member", "school", "taking", "granted", "objective", "regular", "science", "explain", "fact", "giving", "reason", "rather", "simply", "describe", "make", "business", "deduce", "grammatical", "feature", "common", "language", "universal", "mode", "mean", "corresponding", "mode", "understanding", "thus", "tradition", "speculative", "grammar", "grammatica", "speculativa", "develops", "commonly", "accepted", "aristotelian", "claim", "de", "interpretatione", "116a39", "mental", "concept", "thing", "men", "eadem", "apud", "omnes", "thesis", "universal", "grammar", "based", "structural", "analogy", "mode", "modi", "essendi", "mode", "understanding", "modi", "intelligendi", "mode", "signifying", "modi", "significandi", "language", "along", "line", "boethius", "dacus", "boethius", "dane", "one", "important", "theoretician", "speculative", "grammar", "36", "state", "national", "language", "grammatically", "identical", "reason", "whole", "grammar", "borrowed", "thing", "nature", "thing", "similar", "speak", "different", "language", "mode", "mode", "understanding", "consequently", "mode", "signifying", "similar", "whence", "mode", "grammatical", "construction", "speech", "therefore", "whole", "grammar", "one", "language", "similar", "one", "another", "language", "37", "even", "though", "word", "arbitrarily", "imposed", "whence", "arise", "difference", "language", "mode", "signifying", "uniformly", "related", "mode", "mean", "mode", "understanding", "whence", "arise", "grammatical", "similarity", "among", "language", "focusing", "term", "sign", "signification", "speculative", "grammar", "science", "general", "cognitivelinguistic", "structure", "prescinds", "different", "national", "language", "even", "vocal", "language", "martinus", "dacus", "point", "essential", "speculative", "grammar", "deal", "vocal", "expression", "structure", "vocal", "sign", "system", "kind", "sign", "could", "object", "consideration", "modist", "grammarian", "fact", "concerned", "linguistic", "sign", "rather", "gesture", "language", "eye", "due", "fact", "vocal", "expression", "compared", "kind", "sign", "apt", "human", "communication", "38", "soon", "1300", "modistic", "approach", "came", "substantial", "criticism", "main", "point", "critic", "like", "ockham", "oppose", "assumption", "basic", "universal", "grammar", "claim", "implied", "ockham", "s", "concept", "mental", "grammar", "two", "aspect", "modism", "focus", "criticism", "1", "assertion", "close", "structural", "analogy", "spoken", "mental", "language", "external", "reality", "consimilis", "distinctio", "inter", "vox", "vel", "intentiones", "anima", "significantes", "et", "inter", "ipsa", "significata", "william", "ockham", "expo", "libid", "porphyrii", "de", "praed", "1978", "158", "2", "inadmissible", "reification", "modus", "significandi", "adherent", "description", "quality", "form", "added", "articulate", "voice", "dictioni", "superadditum", "act", "imposition", "say", "vocal", "expression", "different", "mode", "signifying", "ockham", "point", "metaphorical", "manner", "speaking", "meant", "simply", "fact", "different", "word", "signify", "whatever", "signify", "different", "way", "39", "according", "john", "aurifaber", "fl", "ca", "1300", "vocal", "term", "significative", "sign", "solely", "used", "significatively", "ground", "something", "inherent", "sound", "40", "order", "assign", "signification", "proper", "place", "reality", "must", "ascribed", "intellect", "rather", "vocal", "sound", "significare", "est", "accidens", "intellectus", "sed", "vox", "est", "illud", "quo", "significat", "intellectus", "aurifaber", "determ", "de", "modis", "signif", "1967", "226", "criticism", "modist", "grammar", "based", "fundamental", "redefinition", "concept", "sign", "coming", "mid13th", "century", "translocation", "signification", "proper", "sense", "word", "intellect", "based", "presupposition", "whatever", "augustine", "may", "said", "mental", "concept", "sign", "6", "mental", "concept", "sign", "12th", "early", "13thcentury", "logical", "textbook", "concept", "sign", "play", "important", "role", "yet", "sign", "technical", "sense", "taken", "name", "socalled", "syncategorematic", "term", "eg", "omnis", "every", "nullus", "signa", "universalia", "universal", "sign", "quidam", "certain", "aliquis", "signa", "particularia", "particular", "sign", "l", "m", "de", "rijk", "196567", "ii2383", "41", "line", "text", "aristotle", "s", "peri", "hermeneias", "translation", "boethius", "written", "spoken", "word", "said", "signify", "mental", "concept", "passiones", "animae", "intellectus", "conceptus", "seen", "likeness", "similitudines", "rather", "sign", "thing", "mid13th", "century", "conceptual", "change", "taking", "place", "although", "first", "may", "seem", "matter", "nuance", "turn", "one", "important", "juncture", "history", "semiotics", "mental", "concept", "without", "first", "losing", "status", "likeness", "thing", "begin", "characterized", "sign", "thing", "signa", "rerum", "true", "passage", "boethius", "anselm", "abelard", "already", "pointing", "direction", "boethius", "periherm", "ed", "sec", "1880", "24", "cf", "magee", "1989", "71", "anselm", "canterbury", "monolog", "1968", "25", "abelard", "log", "ingredientibus", "1927", "315f", "second", "half", "13th", "century", "idea", "achieves", "general", "acceptance", "gain", "relevance", "theory", "sign", "42", "consequence", "view", "many", "instance", "rejection", "least", "modification", "augustine", "s", "venerable", "definition", "sign", "new", "possibility", "describe", "relationship", "concept", "object", "without", "referring", "notion", "similitude", "furthermore", "semantic", "triangle", "boethian", "ordo", "orandi", "described", "entirely", "term", "sign", "significate", "43", "insofar", "concept", "agree", "vocal", "expression", "function", "sign", "make", "sense", "conceive", "thought", "process", "kind", "mental", "speech", "oratio", "mentalis", "showing", "close", "analogy", "spoken", "discourse", "pave", "way", "development", "mentalist", "logic", "principal", "object", "vocal", "term", "proposition", "longer", "rather", "corresponding", "mental", "act", "definition", "mental", "concept", "signa", "rerum", "also", "provides", "basis", "close", "interconnection", "logic", "epistemology", "characteristic", "especially", "later", "middle", "age", "conjunction", "redefinition", "notion", "signification", "significare", "taking", "place", "mental", "concept", "ie", "act", "understanding", "intellectus", "considered", "sign", "aristotelian", "definition", "significare", "signifying", "constitute", "understanding", "constituere", "intellectum", "longer", "regarded", "adequate", "result", "terminology", "representation", "repraesentatio", "repraesentare", "facere", "praesens", "originally", "used", "mainly", "epistemological", "context", "achieves", "increasing", "importance", "logical", "semantics", "fused", "terminology", "signification", "finally", "description", "mental", "concept", "sign", "also", "seen", "one", "main", "motif", "general", "account", "sign", "emerges", "late", "medieval", "logic", "condition", "logic", "longer", "concerned", "exclusively", "arbitrary", "sign", "also", "even", "primarily", "natural", "sign", "7", "sign", "central", "notion", "14thcentury", "logic", "even", "though", "13thcentury", "terminist", "logic", "significatio", "seen", "foundation", "property", "term", "proprietates", "terminorum", "generation", "william", "sherwood", "peter", "spain", "particularly", "interested", "concept", "signification", "significatio", "shortly", "described", "presentation", "form", "intellect", "praesentatio", "alicuius", "formae", "ad", "intellectus", "44", "representation", "thing", "mean", "conventional", "vocal", "expression", "rei", "per", "vocem", "secundum", "placitum", "repraesentatio", "peter", "spain", "summule", "logicales", "1972", "79", "detailed", "logical", "discussion", "start", "right", "away", "concept", "suppositio", "supposition", "ie", "capacity", "substantive", "term", "stand", "something", "propositional", "context", "william", "ockham", "ca", "1285134749", "however", "concept", "sign", "signification", "begin", "take", "center", "stage", "logic", "biard", "1981", "452", "biard", "1989", "lenz", "2003", "panaccio", "2004", "logic", "seen", "exclusively", "concerned", "sign", "primarily", "mental", "sign", "secondarily", "vocal", "written", "sign", "ockham", "integrates", "concept", "supposition", "definition", "sign", "recognizes", "general", "notion", "sign", "something", "make", "something", "else", "come", "cognition", "broad", "useful", "logic", "semantic", "theory", "therefore", "add", "definition", "criterion", "sign", "far", "use", "logic", "concerned", "apt", "stand", "thing", "make", "come", "cognition", "else", "could", "added", "sign", "standing", "something", "natum", "est", "pro", "illo", "supponere", "vel", "talus", "addi", "propositione", "william", "ockham", "summa", "log", "1974", "9", "45", "thus", "ockham", "s", "logical", "concept", "sign", "restricted", "later", "termed", "propositional", "sign", "signum", "propositionale", "john", "raulin", "log", "arist", "comment", "1500", "fol", "a5rb", "due", "central", "position", "notion", "sign", "logic", "one", "entitled", "characterize", "ockham", "s", "logic", "ruled", "concept", "sign", "régie", "par", "le", "concept", "de", "signe", "biard", "1989", "102", "ockham", "constantly", "referring", "notion", "sign", "venture", "many", "case", "semiological", "redefinition", "basic", "logical", "concept", "biard", "1989", "10225", "turn", "allows", "reformulate", "traditional", "ontological", "issue", "instance", "question", "universal", "number", "category", "ontological", "status", "relation", "semantic", "question", "ockham", "s", "logic", "mark", "important", "though", "important", "step", "process", "might", "described", "progressive", "mentalization", "sign", "idea", "behind", "process", "contention", "without", "sort", "intentionality", "phenomenon", "sign", "signification", "semiosis", "general", "must", "remain", "inconceivable", "tendency", "relocating", "notion", "sign", "signification", "realm", "spoken", "word", "sphere", "mind", "characteristic", "mentalist", "logic", "arising", "early", "14th", "century", "remaining", "dominant", "throughout", "later", "middle", "age", "word", "sign", "insofar", "concern", "rational", "discourse", "traditionally", "held", "essential", "subject", "matter", "logic", "according", "mentalist", "logic", "however", "word", "sign", "primarily", "relevant", "logic", "spoken", "word", "transidiomatic", "mental", "word", "verba", "mentis", "mental", "concept", "thus", "later", "medieval", "logic", "already", "burleigh", "ockham", "mental", "sign", "focus", "logical", "semantics", "according", "distinction", "introduced", "peter", "ailly", "13301421", "second", "half", "14th", "century", "a", "thing", "called", "sign", "two", "sens", "first", "sense", "lead", "act", "knowing", "thing", "sign", "second", "sense", "act", "knowing", "thing", "second", "sense", "may", "say", "concept", "sign", "thing", "concept", "natural", "likeness", "lead", "act", "knowing", "thing", "act", "knowing", "thing", "act", "naturally", "properly", "represents", "thing", "peter", "ailly", "concept", "1980", "17", "even", "ockham", "s", "semantics", "well", "theory", "mental", "language", "governed", "transidiomatic", "mental", "grammar", "transforming", "theorem", "terminist", "logic", "theory", "thought", "process", "william", "ockham", "summa", "log", "1974", "11ff", "46", "mean", "undisputed", "came", "severe", "criticism", "opponent", "well", "le", "severe", "modification", "follower", "despite", "difference", "logical", "author", "14thcentury", "generally", "common", "awareness", "importance", "concept", "sign", "even", "though", "course", "exception", "rule", "realisticminded", "theologian", "john", "wyclif", "13301384", "stanislas", "znoymo", "fl", "ca", "1400", "harshly", "criticize", "alleged", "overestimation", "sign", "teacher", "sign", "doctores", "signorum", "latter", "call", "according", "stanislas", "human", "errantry", "vain", "useless", "sign", "logic", "nothing", "necessary", "consequence", "fall", "mankind", "penam", "peccati", "sumus", "necessitati", "vacuis", "et", "inanis", "signis", "erranter", "ambulare", "stanislas", "znoymo", "de", "vero", "et", "falso", "1971", "207", "47", "8", "concept", "sign", "scholastic", "logic", "15th", "early", "16thcentury", "ockham", "concept", "sign", "becomes", "central", "notion", "logical", "theory", "however", "result", "ockham", "s", "focus", "propositional", "sign", "sign", "relevant", "logic", "initially", "narrow", "section", "semiotic", "topic", "dealt", "logic", "contrast", "ockham", "late", "scholastic", "terminist", "logic", "characterized", "approach", "discussing", "logicosemantic", "topic", "basis", "general", "understanding", "pertinent", "vocabulary", "eg", "terminus", "significare", "repraesentare", "signum", "etc", "due", "practice", "topic", "semiotic", "relevance", "even", "though", "direct", "logical", "concern", "began", "accumulate", "margin", "logical", "discourse", "culmination", "point", "development", "reached", "paris", "school", "john", "major", "john", "mair", "14691547", "important", "influential", "center", "latescholastic", "logical", "study", "48", "member", "school", "take", "signification", "signify", "general", "sense", "make", "someone", "know", "something", "facere", "cognoscere", "petrus", "margallus", "log", "utriusque", "scholia", "1520", "148", "49", "conceive", "along", "line", "older", "description", "repraesentare", "broadest", "sense", "according", "function", "representation", "could", "ascribed", "way", "contributes", "thing", "known", "quod", "aliquo", "modo", "facit", "ad", "hoc", "quod", "re", "cognoscatur", "50", "consequently", "signify", "often", "characterized", "represent", "something", "intellect", "aliquid", "intellectui", "respraesentare", "albert", "saxony", "quaest", "artem", "vet", "1988", "472", "john", "raulin", "log", "arist", "comment", "1500", "fol", "g4vb", "order", "make", "definition", "cover", "case", "non", "intellectual", "sign", "interpreter", "animal", "51", "well", "socalled", "syncategorematic", "term", "properly", "signify", "something", "aliquid", "still", "general", "version", "put", "forward", "defining", "act", "signifying", "represent", "something", "thing", "somehow", "cognitive", "power", "aliquid", "vel", "aliqua", "vel", "aliqualiter", "potentiae", "cognitivae", "repraesentare", "gaspar", "lax", "parve", "divis", "term", "ca", "1502", "fol", "a4vb", "definition", "roughly", "express", "basically", "uncontroversial", "regarding", "concept", "signification", "among", "logician", "late", "14th", "early", "16th", "century", "even", "numerous", "definitional", "variant", "concept", "signification", "often", "gave", "occasion", "controversy", "nevertheless", "common", "variation", "primarily", "epistemological", "orientation", "contrary", "ockham", "s", "concept", "sign", "logical", "function", "referring", "significatum", "stand", "foreground", "rather", "sign", "s", "relation", "cognitive", "power", "word", "sign", "primarily", "characterized", "appropriateness", "fulfill", "semantic", "function", "context", "proposition", "rather", "capability", "act", "epistemologically", "efficient", "way", "cognitive", "power", "sign", "something", "make", "think", "signum", "est", "re", "faciens", "cogitare", "petrus", "margallus", "log", "utriusque", "scholia", "1520", "146", "unlike", "ockham", "s", "semantic", "concept", "sign", "one", "favored", "later", "author", "predominantly", "pragmatic", "tendency", "already", "obvious", "peter", "ailly", "defines", "act", "signifying", "represent", "something", "thing", "somehow", "cognitive", "power", "vitally", "changing", "aliquid", "vel", "aliqua", "vel", "aliqualiter", "potentiae", "cognitivae", "ipsam", "vitaliter", "immutando", "repraesentare", "peter", "ailly", "concept", "1980", "16", "52", "particle", "vitally", "changing", "vitaliter", "immutare", "entering", "definition", "significare", "relatedness", "cognition", "cognitive", "power", "becomes", "essential", "factor", "signification", "john", "gebwiler", "later", "underline", "without", "vital", "change", "nothing", "signified", "whomsoever", "absque", "vitali", "immutatione", "nihil", "cuipiam", "significatur", "john", "gebwiler", "magistralis", "totius", "parvuli", "artis", "log", "compil", "1511", "fol", "h4rh4v", "view", "clear", "widespread", "opinion", "according", "medieval", "philosophy", "sign", "characterized", "classical", "definition", "famous", "formula", "aliquid", "stat", "pro", "aliquo", "something", "stand", "something", "53", "mistaken", "suppositio", "significatio", "characterized", "formula", "54", "even", "ockham", "s", "concept", "sign", "come", "closest", "description", "aptitude", "stand", "something", "one", "component", "whole", "function", "sign", "case", "sign", "act", "signifying", "conceived", "simple", "twoterm", "relation", "something", "standing", "something", "basis", "extended", "notion", "sign", "author", "late", "15th", "early", "16thcentury", "logic", "discussed", "length", "topic", "like", "different", "kind", "signification", "representation", "gaspar", "lax", "parve", "divis", "term", "ca", "1502", "fol", "a5", "55", "traditional", "distinction", "natural", "conventional", "sign", "showing", "exist", "intermediate", "form", "like", "sign", "signify", "custom", "ex", "consuetudine", "hagenau", "comment", "prim", "et", "quart", "tract", "petri", "hisp", "1495", "fol", "a7v", "conrad", "pschlacher", "compendiarius", "parv", "log", "liber", "1512", "fol", "6r6v", "instituted", "neither", "nature", "act", "imposition", "rather", "established", "repetition", "frequentatio", "juan", "de", "oria", "summul", "vol", "primum", "1987", "109", "universality", "concept", "sign", "according", "respect", "anything", "world", "sign", "omnis", "re", "mundi", "est", "signum", "peter", "margallus", "logices", "utriusque", "scholia", "1520", "146f", "counterbalanced", "emphasis", "laid", "mental", "sign", "signum", "mentale", "providing", "basis", "whole", "range", "sign", "process", "spoken", "word", "like", "external", "sign", "general", "signify", "mediation", "immediate", "signification", "provided", "mental", "concept", "56", "thus", "petrus", "spinosa", "say", "whole", "signification", "depends", "mental", "term", "tota", "significatio", "dependet", "termino", "mentali", "pedro", "de", "espinosa", "tractatus", "terminorum", "cited", "muñoz", "delgado", "1983", "152f", "respect", "claim", "even", "go", "beyond", "john", "gerson", "s", "thesis", "signification", "properly", "aptly", "understood", "except", "respect", "intellectual", "nature", "able", "use", "sign", "significatio", "nec", "proprie", "nec", "convenienter", "accipitur", "nisi", "per", "respectum", "ad", "naturam", "intellectualem", "quae", "potest", "uti", "signo", "john", "gerson", "de", "modis", "significandi", "1706", "816", "make", "signification", "possible", "cognitive", "act", "conceived", "sign", "act", "signification", "proper", "sense", "sign", "signification", "termed", "reference", "mental", "sign", "ipsa", "cognitio", "formalis", "est", "propriissima", "significatio", "ita", "quod", "alia", "dicuntur", "significare", "per", "attributionem", "ad", "istam", "hieronymus", "de", "s", "marcho", "compendium", "praeclarum", "1507", "fol", "b1", "57", "whereas", "according", "augustine", "sign", "external", "entity", "definition", "precluded", "sphere", "mind", "mental", "sign", "ie", "mental", "concept", "mental", "term", "terminus", "mentalis", "seen", "primary", "principal", "sign", "signum", "mentale", "est", "primum", "et", "principalissimum", "signum", "sine", "quo", "vox", "et", "scripta", "significare", "non", "possunt", "florentius", "diel", "modernorum", "summulae", "log", "1489", "fol", "a5v", "well", "ultimate", "ground", "signification", "58", "without", "ultimate", "immediate", "signification", "instantiated", "formal", "signification", "mental", "concept", "would", "john", "raulin", "remark", "infinite", "regress", "processus", "infinitum", "signification", "something", "like", "peircean", "infinite", "semeiosis", "59", "unlike", "infinite", "semeiosis", "peirce", "however", "regress", "according", "late", "medieval", "author", "would", "character", "steady", "permanent", "differentiation", "signification", "rather", "would", "john", "major", "call", "abyss", "signifying", "abyssus", "significando", "john", "major", "introd", "perutile", "arist", "dial", "1527", "fol", "14ra", "ie", "process", "never", "resulting", "actual", "signification", "together", "deliberately", "extended", "notion", "sign", "term", "emphasis", "role", "mental", "sign", "fundamental", "redefinition", "written", "sign", "ie", "inscription", "emerging", "logic", "around", "1500", "taking", "cue", "view", "introduced", "peter", "ailly", "later", "author", "free", "written", "sign", "traditional", "subordination", "vocal", "sign", "immediately", "subordinating", "mental", "sign", "florentius", "diel", "modernorum", "summulae", "log", "1489", "fol", "d5v", "peter", "tartaretus", "expo", "summulas", "petri", "hisp", "1514", "fol", "37rbva", "antonius", "coronel", "terminus", "1506", "fol", "b3rab", "hieronymus", "pardo", "medulla", "dyalect", "1505", "fol", "7rb", "john", "eck", "summulis", "petri", "hisp", "1516", "fol", "5", "vb", "thus", "scriptura", "longer", "viewed", "secondary", "sign", "system", "mere", "supplement", "vocal", "speech", "longer", "restricted", "alphabetic", "writing", "turn", "provides", "ground", "dramatic", "generalization", "notion", "written", "sign", "well", "logical", "discourse", "extends", "boundary", "order", "give", "account", "sort", "sign", "integrating", "whole", "range", "sign", "traditional", "framework", "logic", "time", "sign", "described", "along", "line", "traditional", "distinction", "mental", "vocal", "written", "term", "written", "term", "terminus", "scriptus", "provides", "suitable", "opportunity", "integration", "course", "presupposes", "radically", "extended", "notion", "inscription", "arose", "parisian", "logic", "around", "1500", "inscription", "longer", "characterized", "term", "derivative", "relation", "spoken", "language", "rather", "term", "specific", "relation", "human", "sensory", "apparatus", "sense", "john", "major", "others", "define", "written", "term", "term", "perceived", "corporeal", "eye", "terminus", "scriptus", "est", "terminus", "qui", "oculo", "corporali", "percipi", "potest", "john", "major", "libri", "quos", "artibus", "collegio", "montis", "acuti", "parisius", "regentando", "compilavit", "1508", "fol", "4", "60", "juan", "de", "oria", "explicitly", "state", "written", "term", "called", "inscription", "made", "character", "letter", "rather", "representing", "something", "cognitive", "faculty", "mean", "sight", "non", "enim", "dicitur", "terminus", "scriptus", "quia", "sit", "scriptura", "ex", "caracteribus", "aut", "litteris", "constans", "sed", "quia", "potentie", "cognitive", "aliquid", "proprie", "representat", "mediante", "visu", "juan", "de", "oria", "summul", "vol", "primum", "1987", "106", "written", "term", "thus", "defined", "even", "circulus", "vini", "count", "written", "term", "john", "maior", "libri", "1508", "fol", "4va", "author", "extend", "notion", "writing", "even", "call", "terminus", "scriptus", "term", "perceptible", "sens", "haering", "terminus", "alio", "sensu", "quam", "auditu", "perceptibilis", "peter", "margallus", "log", "utriusque", "scholia", "1520", "92", "every", "corporeal", "perceivable", "one", "four", "external", "sens", "different", "hearing", "may", "instance", "written", "term", "omne", "sensibile", "corpus", "quattuor", "externis", "sensibus", "posse", "esse", "terminum", "scriptum", "peter", "margallus", "log", "utriusque", "scholia", "1520", "162f", "basic", "idea", "behind", "theoretical", "extension", "notion", "inscription", "indifference", "de", "signfunction", "material", "instantiation", "sign", "arbitrariness", "medium", "sign", "hold", "sign", "regard", "communicative", "capacity", "also", "regard", "function", "logical", "operation", "paul", "venice", "point", "principle", "would", "possible", "form", "syllogism", "draw", "conclusion", "using", "stick", "stone", "instead", "word", "sentence", "possemus", "cum", "baculis", "syllogizare", "et", "cum", "lapidibus", "concludere", "paul", "venice", "logica", "magna", "prima", "par", "tract", "de", "terminis", "1979", "78", "fact", "general", "communicate", "mean", "sensible", "quality", "like", "warms", "smell", "rather", "use", "vocal", "written", "term", "strict", "sense", "due", "greater", "operability", "paul", "venice", "logica", "magna", "prima", "par", "tract", "de", "terminis", "1979", "78", "61", "utter", "articulated", "sound", "whenever", "want", "produce", "ease", "distinctness", "possible", "object", "sens", "like", "certain", "color", "smell", "62", "extending", "notion", "terminus", "open", "horizon", "taking", "account", "semiotic", "issue", "distinction", "term", "signify", "absolutely", "terminus", "absolute", "significans", "term", "signify", "account", "circumstance", "terminus", "ex", "circumstantia", "significans", "juan", "de", "oria", "summul", "vol", "primum", "1987", "106f", "whereas", "spoken", "written", "word", "member", "first", "class", "second", "class", "made", "kind", "conventional", "sign", "like", "toll", "bell", "crucifix", "circulus", "vini", "distinction", "johannes", "de", "oria", "underscore", "influence", "situational", "context", "signification", "nonlinguistic", "sign", "notice", "depends", "circumstance", "time", "place", "whether", "toll", "bell", "invitation", "go", "chapter", "congregation", "meal", "image", "crucified", "christ", "denotes", "adored", "situational", "context", "church", "building", "studio", "painter", "sculptor", "imago", "crucifixi", "ecclesia", "posita", "representat", "quod", "est", "adoranda", "ubi", "non", "sic", "representaret", "domo", "pictoris", "vel", "statuifici", "juan", "de", "oria", "summul", "vol", "primum", "1987", "106f", "wreath", "foliage", "denotes", "vineselling", "attached", "outside", "tavern", "wood", "peter", "margallus", "log", "utriusque", "scholia", "1965", "166", "moreover", "term", "signify", "account", "circumstance", "characterized", "according", "john", "oria", "fact", "regularly", "signify", "state", "affair", "thus", "function", "propositional", "sign", "terminus", "ex", "circumstantia", "significans", "regulariter", "representat", "aliquid", "esse", "vel", "non", "esse", "ex", "quo", "fit", "quod", "omnis", "talis", "terminus", "est", "propositio", "juan", "de", "oria", "summul", "vol", "primum", "1987", "106", "whereas", "western", "europe", "growing", "influence", "humanism", "scholastic", "tradition", "terminist", "logic", "came", "end", "third", "decade", "16th", "century", "vigorous", "though", "unaltered", "continuation", "iberian", "peninsula", "18th", "century", "reimported", "university", "academic", "school", "western", "europe", "late", "16th", "early", "17th", "century", "mainly", "exclusively", "catholic", "area", "even", "scholastic", "doctrine", "sign", "presented", "speak", "light", "version", "author", "like", "domingo", "de", "soto", "63", "franciscus", "toletus", "rudiment", "medieval", "semiotics", "transmitted", "writing", "provided", "groundwork", "great", "number", "17thcentury", "logician", "developing", "highly", "elaborated", "sign", "theory", "meieroeser", "1997", "171335", "important", "socalled", "conimbricenses", "john", "st", "thomas", "alias", "john", "poinsot", "peter", "candamo", "silvester", "aranha", "large", "number", "text", "still", "awaiting", "explored"]}