{"url": "voltaire", "title": "Voltaire", "authorship": {"year": "Copyright © 2020", "author_text": "J.B. Shank\n<jbshank@umn.edu>", "author_links": [{"http://www.hist.umn.edu/people/profile.php?UID=jbshank": "J.B. Shank"}, {"mailto:jbshank%40umn%2eedu": "jbshank@umn.edu"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.hist.umn.edu/people/profile.php?UID=jbshank\" target=\"other\">J.B. Shank</a>\n&lt;<a href=\"mailto:jbshank%40umn%2eedu\"><em>jbshank<abbr title=\" at \">@</abbr>umn<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Mon Aug 31, 2009", "substantive revision Fri May 29, 2020"], "preamble": "\nFrançois-Marie d’Arouet (1694–1778), better known by his pen name Voltaire, was a French writer and public activist who played a singular role in defining the eighteenth-century movement called the Enlightenment. At the center of his work was a new conception of philosophy and the philosopher that in several crucial respects influenced the modern concept of each. Yet in other ways Voltaire was not a philosopher at all in the modern sense of the term. He wrote as many plays, stories, and poems as patently philosophical tracts, and he in fact directed many of his critical writings against the philosophical pretensions of recognized philosophers such as Leibniz, Malebranche, and Descartes. He was, however, a vigorous defender of a conception of natural science that served in his mind as the antidote to vain and fruitless philosophical investigation. In clarifying this new distinction between science and philosophy, and especially in fighting vigorously for it in public campaigns directed against the perceived enemies of fanaticism and superstition, Voltaire pointed modern philosophy down several paths that it subsequently followed.\nTo capture Voltaire’s unconventional place in the history of philosophy, this article will be structured in a particular way. First, a full account of Voltaire’s life is offered, not merely as background context for his philosophical work, but as an argument about the way that his particular career produced his particular contributions to European philosophy. Second, a survey of Voltaire’s philosophical views is offered so as to attach the legacy of what Voltaire did with the intellectual viewpoints that his activities reinforced.\n", "toc": [{"#VolLifPhiCriPubAct": "1. Voltaire’s Life: The Philosopher as Critic and Public Activist"}, {"#VolEarYea169": "1.1 Voltaire’s Early Years (1694–1726)"}, {"#EngPer172": "1.2 The English Period (1726–1729)"}, {"#BecPhi": "1.3 Becoming a Philosophe"}, {"#NewWar173": "1.4 The Newton Wars (1732–1745)"}, {"#FreNewEnlPhi174": "1.5 From French Newtonian to Enlightenment Philosophe (1745–1755)"}, {"#FigForPhi175": "1.6 Fighting for Philosophie (1755–1778)"}, {"#VolPhiIcoEnlPhi177": "1.7 Voltaire, Philosophe Icon of Enlightenment Philosophie (1778–Present)"}, {"#VolEnl": "2. Voltaire’s Enlightenment Philosophy"}, {"#Lib": "2.1 Liberty"}, {"#Hed": "2.2 Hedonism"}, {"#Ske": "2.3 Skepticism"}, {"#NewEmpSci": "2.4 Newtonian Empirical Science"}, {"#TowSciWitMet": "2.5 Toward Science without Metaphysics"}, {"#Bib": "Bibliography"}, {"#PriLit": "Primary Literature"}, {"#PriLitTra": "Primary Literature in Translation"}, {"#SecLit": "Secondary Literature "}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. Voltaire’s Life: The Philosopher as Critic and Public Activist\nVoltaire only began to identify himself with philosophy and the philosophe identity during middle age. His work Lettres philosophiques, published in 1734 when he was forty years old, was the key turning point in this transformation. Before this date, Voltaire’s life in no way pointed him toward the philosophical destiny that he was later to assume. His early orientation toward literature and libertine sociability, however, shaped his philosophical identity in crucial ways.\n1.1 Voltaire’s Early Years (1694–1726)\nFrançois-Marie d’Arouet was born in 1694, the fourth of five children, to a well-to-do public official and his well bred aristocratic wife. In its fusion of traditional French aristocratic pedigree with the new wealth and power of royal bureaucratic administration, the d’Arouet family was representative of elite society in France during the reign of Louis XIV. The young François-Marie acquired from his parents the benefits of prosperity and political favor, and from the Jesuits at the prestigious Collège Louis-le-Grand in Paris he also acquired a first-class education. François-Marie also acquired an introduction to modern letters from his father who was active in the literary culture of the period both in Paris and at the royal court of Versailles. François senior appears to have enjoyed the company of men of letters, yet his frustration with his son’s ambition to become a writer is notorious. From early in his youth, Voltaire aspired to emulate his idols Molière, Racine, and Corneille and become a playwright, yet Voltaire’s father strenuously opposed the idea, hoping to install his son instead in a position of public authority. First as a law student, then as a lawyer’s apprentice, and finally as a secretary to a French diplomat, Voltaire attempted to fulfill his father’s wishes. But in each case, he ended up abandoning his posts, sometimes amidst scandal.\nEscaping from the burdens of these public obligations, Voltaire would retreat into the libertine sociability of Paris. It was here in the 1720s, during the culturally vibrant period of the Regency government between the reigns of Louis XIV and XV (1715–1723), that Voltaire established one dimension of his identity. His wit and congeniality were legendary even as a youth, so he had few difficulties establishing himself as a popular figure in Regency literary circles. He also learned how to play the patronage game so important to those with writerly ambitions. Thanks, therefore, to some artfully composed writings, a couple of well-made contacts, more than a few bon mots, and a little successful investing, especially during John Law’s Mississippi Bubble fiasco, Voltaire was able to establish himself as an independent man of letters in Paris. His literary debut occurred in 1718 with the publication of his Oedipe, a reworking of the ancient tragedy that evoked the French classicism of Racine and Corneille. The play was first performed at the home of the Duchesse du Maine at Sceaux, a sign of Voltaire’s quick ascent to the very pinnacle of elite literary society. Its published title page also announced the new pen name that Voltaire would ever after deploy.\nDuring the Regency, Voltaire circulated widely in elite circles such as those that congregated at Sceaux, but he also cultivated more illicit and libertine sociability as well. This pairing was not at all uncommon during this time, and Voltaire’s intellectual work in the 1720s—a mix of poems and plays that shifted between playful libertinism and serious classicism seemingly without pause—illustrated perfectly the values of pleasure, honnêteté, and good taste that were the watchwords of this cultural milieu. Philosophy was also a part of this mix, and during the Regency the young Voltaire was especially shaped by his contacts with the English aristocrat, freethinker,and Jacobite Lord Bolingbroke. Bolingbroke lived in exile in France during the Regency period, and Voltaire was a frequent visitor to La Source, the Englishman’s estate near Orléans. The chateau served as a reunion point for a wide range of intellectuals, and many believe that Voltaire was first introduced to natural philosophy generally, and to the work of Locke and the English Newtonians specifically, at Bolingbroke’s estate. It was certainly true that these ideas, especially in their more deistic and libertine configurations, were at the heart of Bolingbroke’s identity.\n1.2 The English Period (1726–1729)\nYet even if Voltaire was introduced to English philosophy in this way, its influence on his thought was most shaped by his brief exile in England between 1726–29. The occasion for his departure was an affair of honor. A very powerful aristocrat, the Duc de Rohan, accused Voltaire of defamation, and in the face of this charge the untitled writer chose to save face and avoid more serious prosecution by leaving the country indefinitely. In the spring of 1726, therefore, Voltaire left Paris for England.\nIt was during his English period that Voltaire’s transition into his mature philosophe identity began. Bolingbroke, whose address Voltaire left in Paris as his own forwarding address, was one conduit of influence. In particular, Voltaire met through Bolingbroke Jonathan Swift, Alexander Pope, and John Gay, writers who were at that moment beginning to experiment with the use of literary forms such as the novel and theater in the creation of a new kind of critical public politics. Swift’s Gulliver’s Travels, which appeared only months before Voltaire’s arrival, is the most famous exemplar of this new fusion of writing with political criticism. Later the same year Bolingbroke also brought out the first issue of the Craftsman, a political journal that served as the public platform for his circle’s Tory opposition to the Whig oligarchy in England. The Craftsman helped to create English political journalism in the grand style, and for the next three years Voltaire moved in Bolingbroke’s circle, absorbing the culture and sharing in the public political contestation that was percolating all around him.\nVoltaire did not restrict himself to Bolingbroke’s circle alone, however. After Bolingbroke, his primary contact in England was a merchant by the name of Everard Fawkener. Fawkener introduced Voltaire to a side of London life entirely different from that offered by Bolingbroke’s circle of Tory intellectuals. This included the Whig circles that Bolingbroke’s group opposed. It also included figures such as Samuel Clarke and other self-proclaimed Newtonians. Voltaire did not meet Newton himself before Sir Isaac’s death in March, 1727, but he did meet his sister—learning from her the famous myth of Newton’s apple, which Voltaire would play a major role in making famous. Voltaire also came to know the other Newtonians in Clarke’s circle, and since he became proficient enough with English to write letters and even fiction in the language, it is very likely that he immersed himself in their writings as well. Voltaire also visited Holland during these years, forming important contacts with Dutch journalists and publishers and meeting Willem’s Gravesande and other Dutch Newtonian savants. Given his other activities, it is also likely that Voltaire frequented the coffeehouses of London even if no firm evidence survives confirming that he did. It would not be surprising, therefore, to learn that Voltaire attended the Newtonian public lectures of John Theophilus Desaguliers or those of one of his rivals. Whatever the precise conduits, all of his encounters in England made Voltaire into a very knowledgeable student of English natural philosophy.\n1.3 Becoming a Philosophe\nWhen French officials granted Voltaire permission to re-enter Paris in 1729, he was devoid of pensions and banned from the royal court at Versailles. But he was also a different kind of writer and thinker. It is no doubt overly grandiose to say with Lord Morley that, “Voltaire left France a poet and returned to it a sage.” It is also an exaggeration to say that he was transformed from a poet into a philosophe while in England. For one, these two sides of Voltaire’s intellectual identity were forever intertwined, and he never experienced an absolute transformation from one into the other at any point in his life. But the English years did trigger a transformation in him.\nAfter his return to France, Voltaire worked hard to restore his sources of financial and political support. The financial problems were the easiest to solve. In 1729, the French government staged a sort of lottery to help amortize some of the royal debt. A friend perceived an opportunity for investors in the structure of the government’s offering, and at a dinner attended by Voltaire he formed a society to purchase shares. Voltaire participated, and in the fall of that year when the returns were posted he had made a fortune. Voltaire’s inheritance from his father also became available to him at the same time, and from this date forward Voltaire never again struggled financially. This result was no insignificant development since Voltaire’s financial independence effectively freed him from one dimension of the patronage system so necessary to aspiring writers and intellectuals in the period. In particular, while other writers were required to appeal to powerful financial patrons in order to secure the livelihood that made possible their intellectual careers, Voltaire was never again beholden to these imperatives.\nThe patronage structures of Old Regime France provided more than economic support to writers, however, and restoring the crédit upon which his reputation as a writer and thinker depended was far less simple. Gradually, however, through a combination of artfully written plays, poems, and essays and careful self-presentation in Parisian society, Voltaire began to regain his public stature. In the fall of 1732, when the next stage in his career began to unfold, Voltaire was residing at the royal court of Versailles, a sign that his re-establishment in French society was all but complete.\nDuring this rehabilitation, Voltaire also formed a new relationship that was to prove profoundly influential in the subsequent decades. He became reacquainted with Emilie Le Tonnier de Breteuil,the daughter of one of his earliest patrons, who married in 1722 to become the Marquise du Châtelet. Emilie du Châtelet was twenty-nine years old in the spring of 1733 when Voltaire began his relationship with her. She was also a uniquely accomplished woman. Du Châtelet’s father, the Baron de Breteuil, hosted a regular gathering of men of letters that included Voltaire, and his daughter, ten years younger than Voltaire, shared in these associations. Her father also ensured that Emilie received an education that was exceptional for girls at the time. She studied Greek and Latin and trained in mathematics, and when Voltaire reconnected with her in 1733 she was a very knowledgeable thinker in her own right even if her own intellectual career, which would include an original treatise in natural philosophy and a complete French translation of Newton’s Principia Mathematica—still the only complete French translation ever published—had not yet begun. Her intellectual talents combined with her vivacious personality drew Voltaire to her, and although Du Châtelet was a titled aristocrat married to an important military officer, the couple was able to form a lasting partnership that did not interfere with Du Châtelet’s marriage. This arrangement proved especially beneficial to Voltaire when scandal forced him to flee Paris and to establish himself permanently at the Du Châtelet family estate at Cirey. From 1734, when this arrangement began, to 1749, when Du Châtelet died during childbirth, Cirey was the home to each along with the site of an intense intellectual collaboration. It was during this period that both Voltaire and Du Châtelet became widely known philosophical figures, and the intellectual history of each before 1749 is most accurately described as the history of the couple’s joint intellectual endeavors.\n1.4 The Newton Wars (1732–1745)\nFor Voltaire, the events that sent him fleeing to Cirey were also the impetus for much of his work while there. While in England, Voltaire had begun to compose a set of letters framed according to the well-established genre of a traveler reporting to friends back home about foreign lands. Montesquieu’s 1721 Lettres Persanes, which offered a set of fictionalized letters by Persians allegedly traveling in France, and Swift’s 1726 Gulliver’s Travels were clear influences when Voltaire conceived his work. But unlike the authors of these overtly fictionalized accounts, Voltaire innovated by adopting a journalistic stance instead, one that offered readers an empirically recognizable account of several aspects of English society. Originally titled Letters on England, Voltaire left a draft of the text with a London publisher before returning home in 1729. Once in France, he began to expand the work, adding to the letters drafted while in England, which focused largely on the different religious sects of England and the English Parliament, several new letters including some on English philosophy. The new text, which included letters on Bacon, Locke, Newton and the details of Newtonian natural philosophy along with an account of the English practice of inoculation for smallpox, also acquired a new title when it was first published in France in 1734: Lettres philosophiques.\nBefore it appeared, Voltaire attempted to get official permission for the book from the royal censors, a requirement in France at the time. His publisher, however, ultimately released the book without these approvals and without Voltaire’s permission. This made the first edition of the Lettres philosophiques illicit, a fact that contributed to the scandal that it triggered, but one that in no way explains the furor the book caused. Historians in fact still scratch their heads when trying to understand why Voltaire’s Lettres philosophiques proved to be so controversial. The only thing that is clear is that the work did cause a sensation that subsequently triggered a rapid and overwhelming response on the part of the French authorities. The book was publicly burned by the royal hangman several months after its release, and this act turned Voltaire into a widely known intellectual outlaw. Had it been executed, a royal lettre de cachet would have sent Voltaire to the royal prison of the Bastille as a result of his authorship of Lettres philosophiques; instead, he was able to flee with Du Châtelet to Cirey where the couple used the sovereignty granted by her aristocratic title to create a safe haven and base for Voltaire’s new position as a philosophical rebel and writer in exile.\nHad Voltaire been able to avoid the scandal triggered by the Lettres philosophiques, it is highly likely that he would have chosen to do so. Yet once it was thrust upon him, he adopted the identity of the philosophical exile and outlaw writer with conviction, using it to create a new identity for himself, one that was to have far reaching consequences for the history of Western philosophy. At first, Newtonian science served as the vehicle for this transformation. In the decades before 1734, a series of controversies had erupted, especially in France, about the character and legitimacy of Newtonian science, especially the theory of universal gravitation and the physics of gravitational attraction through empty space. Voltaire positioned his Lettres philosophiques as an intervention into these controversies, drafting a famous and widely cited letter that used an opposition between Newton and Descartes to frame a set of fundamental differences between English and French philosophy at the time. He also included other letters about Newtonian science in the work while linking (or so he claimed) the philosophies of Bacon, Locke, and Newton into an English philosophical complex that he championed as a remedy for the perceived errors and illusions perpetuated on the French by René Descartes and Nicolas Malebranche. Voltaire did not invent this framework, but he did use it to enflame a set of debates that were then raging, debates that placed him and a small group of young members of the Royal Academy of Sciences in Paris into apparent opposition to the older and more established members of this bastion of official French science. Once installed at Cirey, both Voltaire and Du Châtelet further exploited this apparent division by engaging in a campaign on behalf of Newtonianism, one that continually targeted an imagined monolith called French Academic Cartesianism as the enemy against which they in the name of Newtonianism were fighting.\nThe centerpiece of this campaign was Voltaire’s Éléments de la Philosophie de Newton, which was first published in 1738 and then again in 1745 in a new and definitive edition that included a new section, first published in 1740, devoted to Newton’s metaphysics. Voltaire offered this book as a clear, accurate, and accessible account of Newton’s philosophy suitable for ignorant Frenchman (a group that he imagined to be large). But he also conceived of it as a machine de guerre directed against the Cartesian establishment, which he believed was holding France back from the modern light of scientific truth. Vociferous criticism of Voltaire and his work quickly erupted, with some critics emphasizing his rebellious and immoral proclivities while others focused on his precise scientific views. Voltaire collapsed both challenges into a singular vision of his enemy as “backward Cartesianism”. As he fought fiercely to defend his positions, an unprecedented culture war erupted in France centered on the character and value of Newtonian natural philosophy. Du Châtelet contributed to this campaign by writing a celebratory review of Voltaire’s Éléments in the Journal des savants, the most authoritative French learned periodical of the day. The couple also added to their scientific credibility by receiving separate honorable mentions in the 1738 Paris Academy prize contest on the nature of fire. Voltaire likewise worked tirelessly rebutting critics and advancing his positions in pamphlets and contributions to learned periodicals. By 1745, when the definitive edition of Voltaire’s Éléments was published, the tides of thought were turning his way, and by 1750 the perception had become widespread that France had been converted from backward, erroneous Cartesianism to modern, Enlightened Newtonianism thanks to the heroic intellectual efforts of figures like Voltaire.\n1.5 From French Newtonian to Enlightenment Philosophe (1745–1755)\nThis apparent victory in the Newton Wars of the 1730s and 1740s allowed Voltaire’s new philosophical identity to solidify. Especially crucial was the way that it allowed Voltaire’s outlaw status, which he had never fully repudiated, to be rehabilitated in the public mind as a necessary and heroic defense of philosophical truth against the enemies of error and prejudice. From this perspective, Voltaire’s critical stance could be reintegrated into traditional Old Regime society as a new kind of legitimate intellectual martyrdom. Since Voltaire also coupled his explicitly philosophical writings and polemics during the 1730s and 1740s with an equally extensive stream of plays, poems, stories, and narrative histories, many of which were orthogonal in both tone and content to the explicit campaigns of the Newton Wars, Voltaire was further able to reestablish his old identity as an Old Regime man of letters despite the scandals of these years. In 1745, Voltaire was named the Royal Historiographer of France, a title bestowed upon him as a result of his histories of Louis XIV and the Swedish King Charles II. This royal office also triggered the writing of arguably Voltaire’s most widely read and influential book, at least in the eighteenth century, Essais sur les moeurs et l’esprit des nations (1751), a pioneering work of universal history. The position also legitimated him as an officially sanctioned savant. In 1749, after the death of du Châtelet, Voltaire reinforced this impression by accepting an invitation to join the court of the young Frederick the Great in Prussia, a move that further assimilated him into the power structures of Old Regime society.\nHad this assimilationist trajectory continued during the remainder of Voltaire’s life, his legacy in the history of Western philosophy might not have been so great. Yet during the 1750s, a set of new developments pulled Voltaire back toward his more radical and controversial identity and allowed him to rekindle the critical philosophe persona that he had innovated during the Newton Wars. The first step in this direction involved a dispute with his onetime colleague and ally, Pierre-Louis Moreau de Maupertuis. Maupertuis had preceded Voltaire as the first aggressive advocate for Newtonian science in France. When Voltaire was preparing his own Newtonian intervention in the Lettres philosophiques in 1732, he consulted with Maupertuis, who was by this date a pensioner in the French Royal Academy of Sciences. It was largely around Maupertuis that the young cohort of French academic Newtonians gathered during the Newton wars of 1730s and 40s, and with Voltaire fighting his own public campaigns on behalf of this same cause during the same period, the two men became the most visible faces of French Newtonianism even if they never really worked as a team in this effort. Like Voltaire, Maupertuis also shared a relationship with Emilie du Châtelet, one that included mathematical collaborations that far exceeded Voltaire’s capacities. Maupertuis was also an occasional guest at Cirey, and a correspondent with both du Châtelet and Voltaire throughout these years. But in 1745 Maupertuis surprised all of French society by moving to Berlin to accept the directorship of Frederick the Great’s newly reformed Berlin Academy of Sciences.\nMaupertuis’s thought at the time of his departure for Prussia was turning toward the metaphysics and rationalist epistemology of Leibniz as a solution to certain questions in natural philosophy. Du Châtelet also shared this tendency, producing in 1740 her Institutions de physiques, a systematic attempt to wed Newtonian mechanics with Leibnizian rationalism and metaphysics. Voltaire found this Leibnizian turn dyspeptic, and he began to craft an anti-Leibnizian discourse in the 1740s that became a bulwark of his brand of Newtonianism. This placed him in opposition to Du Châtelet, even if this intellectual rift in no way soured their relationship. Yet after she died in 1749, and Voltaire joined Maupertuis at Frederick the Great’s court in Berlin, this anti-Leibnizianism became the centerpiece of a rift with Maupertuis. Voltaire’s public satire of the President of the Royal Academy of Sciences of Berlin published in late 1752, which presented Maupertuis as a despotic philosophical buffoon, forced Frederick to make a choice. He sided with Maupertuis, ordering Voltaire to either retract his libelous text or leave Berlin. Voltaire chose the latter, falling once again into the role of scandalous rebel and exile as a result of his writings.\n1.6 Fighting for Philosophie (1755–1778)\nThis event proved to be Voltaire’s last official rupture with establishment authority. Rather than returning home to Paris and restoring his reputation, Voltaire instead settled in Geneva. When this austere Calvinist enclave proved completely unwelcoming, he took further steps toward independence by using his personal fortune to buy a chateau of his own in the hinterlands between France and Switzerland. Voltaire installed himself permanently at Ferney in early 1759, and from this date until his death in 1778 he made the chateau his permanent home and capital, at least in the minds of his intellectual allies, of the emerging French Enlightenment.\nDuring this period, Voltaire also adopted what would become his most famous and influential intellectual stance, announcing himself as a member of the “party of humanity” and devoting himself toward waging war against the twin hydras of fanaticism and superstition. While the singular defense of Newtonian science had focused Voltaire’s polemical energies in the 1730s and 1740s, after 1750 the program became the defense of philosophie tout court and the defeat of its perceived enemies within the ecclesiastical and aristo-monarchical establishment. In this way, Enlightenment philosophie became associated through Voltaire with the cultural and political program encapsulated in his famous motto, “Écrasez l’infâme!” (“Crush the infamy!”). This entanglement of philosophy with social criticism and reformist political action, a contingent historical outcome of Voltaire’s particular intellectual career, would become his most lasting contribution to the history of philosophy.\nThe first cause to galvanize this new program was Diderot and d’Alembert’s Encyclopédie. The first volume of this compendium of definitions appeared in 1751, and almost instantly the work became buried in the kind of scandal to which Voltaire had grown accustomed. Voltaire saw in the controversy a new call to action, and he joined forces with the project soon after its appearance, penning numerous articles that began to appear with volume 5 in 1755. Scandal continued to chase the Encyclopédie, however, and in 1759 the work’s publication privilege was revoked in France, an act that did not kill the project but forced it into illicit production in Switzerland. During these scandals, Voltaire fought vigorously alongside the project’s editors to defend the work, fusing the Encyclopédie’s enemies, particularly the Parisian Jesuits who edited the monthly periodical the Journal de Trevoux, into a monolithic “infamy” devoted to eradicating truth and light from the world. This framing was recapitulated by the opponents of the Encyclopédie, who began to speak of the loose assemblage of authors who contributed articles to the work as a subversive coterie of philosophes devoted to undermining legitimate social and moral order.\nAs this polemic crystallized and grew in both energy and influence, Voltaire embraced its terms and made them his cause. He formed particularly close ties with d’Alembert, and with him began to generalize a broad program for Enlightenment centered on rallying the newly self-conscious philosophes (a term often used synonymously with the Encyclopédistes) toward political and intellectual change. In this program, the philosophes were not unified by any shared philosophy but through a commitment to the program of defending philosophie itself against its perceived enemies. They were also imagined as activists fighting to eradicate error and superstition from the world. The ongoing defense of the Encyclopédie was one rallying point, and soon the removal of the Jesuits—the great enemies of Enlightenment, the philosophes proclaimed—became a second unifying cause. This effort achieved victory in 1763, and soon the philosophes were attempting to infiltrate the academies and other institutions of knowledge in France. One climax in this effort was reached in 1774 when the Encyclopédiste and friend of Voltaire and the philosophes, Anne-Robert Jacques Turgot, was named Controller-General of France, the most powerful ministerial position in the kingdom, by the newly crowned King Louis XVI. Voltaire and his allies had paved the way for this victory through a barrage of writings throughout the 1760s and 1770s that presented philosophie like that espoused by Turgot as an agent of enlightened reform and its critics as prejudicial defenders of an ossified tradition.\nVoltaire did bring out one explicitly philosophical book in support this campaign, his Dictionnaire philosophique of 1764–1770. This book republished his articles from the original Encyclopédie while adding new entries conceived in the spirit of the original work. Yet to fully understand the brand of philosophie that Voltaire made foundational to the Enlightenment, one needs to recognize that it just as often circulated in fictional stories, satires, poems, pamphlets, and other less obviously philosophical genres. Voltaire’s most widely known text, for instance, Candide, ou l’Optimisme, first published in 1759, is a fictional story of a wandering traveler engaged in a set of farcical adventures. Yet contained in the text is a serious attack on Leibnizian philosophy, one that in many ways marks the culmination of Voltaire’s decades long attack on this philosophy started during the Newton wars. Philosophie à la Voltaire also came in the form of political activism, such as his public defense of Jean Calas who, Voltaire argued, was a victim of a despotic state and an irrational and brutal judicial system. Voltaire often attached philosophical reflection to this political advocacy, such as when he facilitated a French translation of Cesare Beccaria’s treatise on humanitarian justice and penal reform and then prefaced the work with his own essay on justice and religious toleration (Calas was a French protestant persecuted by a Catholic monarchy). Public philosophic campaigns such as these that channeled critical reason in a direct, oppositionalist way against the perceived injustices and absurdities of Old Regime life were the hallmark of philosophie as Voltaire understood the term.\n1.7 Voltaire, Philosophe Icon of Enlightenment Philosophie (1778–Present)\nVoltaire lived long enough to see some of his long-term legacies start to concretize. With the ascension of Louis XVI in 1774 and the appointment of Turgot as Controller-General, the French establishment began to embrace the philosophes and their agenda in a new way. Critics of Voltaire and his program for philosophie remained powerful, however, and they would continue to survive as the necessary backdrop to the positive image of the Enlightenment philosophe as a modernizer, progressive reformer, and courageous scourge against traditional authority that Voltaire bequeathed to later generations. During Voltaire’s lifetime, this new acceptance translated into a final return to Paris in early 1778. Here, as a frail and sickly octogenarian, Voltaire was welcomed by the city as the hero of the Enlightenment that he now personified. A statue was commissioned as a permanent shrine to his legacy, and a public performance of his play Irène was performed in a way that allowed its author to be celebrated as a national hero. Voltaire died several weeks after these events, but the canonization that they initiated has continued right up until the present.\nWestern philosophy was profoundly shaped by the conception of the philosophe and the program for Enlightenment philosophie that Voltaire came to personify. The model he offered of the philosophe as critical public citizen and advocate first and foremost, and as abstruse and systematic thinker only when absolutely necessary, was especially influential in the subsequent development of the European philosophy. Also influential was the example he offered of the philosopher measuring the value of any philosophy according by its ability to effect social change. In this respect, Karl Marx’s famous thesis that philosophy should aspire to change the world, not merely interpret it, owes more than a little debt Voltaire. The link between Voltaire and Marx was also established through the French revolutionary tradition, which similarly adopted Voltaire as one of its founding heroes. Voltaire was the first person to be honored with re-burial in the newly created Pantheon of the Great Men of France that the new revolutionary government created in 1791. This act served as a tribute to the connections that the revolutionaries saw between Voltaire’s philosophical program and the cause of revolutionary modernization as a whole. In a similar way, Voltaire remains today an iconic hero for everyone who sees a positive linkage between critical reason and political resistance in projects of progressive, modernizing reform.\n2. Voltaire’s Enlightenment Philosophy\nVoltaire’s philosophical legacy ultimately resides as much in how he practiced philosophy, and in the ends toward which he directed his philosophical activity, as in any specific doctrine or original idea. Yet the particular philosophical positions he took, and the way that he used his wider philosophical campaigns to champion certain understandings while disparaging others, did create a constellation appropriately called Voltaire’s Enlightenment philosophy. True to Voltaire’s character, this constellation is best described as a set of intellectual stances and orientations rather than as a set of doctrines or systematically defended positions. Nevertheless, others found in Voltaire both a model of the well-oriented philosophe and a set of particular philosophical positions appropriate to this stance. Each side of this equation played a key role in defining the Enlightenment philosophie that Voltaire came to personify.\n2.1 Liberty\nCentral to this complex is Voltaire’s conception of liberty. Around this category, Voltaire’s social activism and his relatively rare excursions into systematic philosophy also converged. In 1734, in the wake of the scandals triggered by the Lettres philosophiques, Voltaire wrote, but left unfinished at Cirey, a Traité de metaphysique that explored the question of human freedom in philosophical terms. The question was particularly central to European philosophical discussions at the time, and Voltaire’s work explicitly referenced thinkers like Hobbes and Leibniz while wrestling with the questions of materialism, determinism, and providential purpose that were then central to the writings of the so-called deists, figures such as John Toland and Anthony Collins. The great debate between Samuel Clarke and Leibniz over the principles of Newtonian natural philosophy was also influential as Voltaire struggled to understand the nature of human existence and ethics within a cosmos governed by rational principles and impersonal laws.\nVoltaire adopted a stance in this text somewhere between the strict determinism of rationalist materialists and the transcendent spiritualism and voluntarism of contemporary Christian natural theologians. For Voltaire, humans are not deterministic machines of matter and motion, and free will thus exists. But humans are also natural beings governed by inexorable natural laws, and his ethics anchored right action in a self that possessed the natural light of reason immanently. This stance distanced him from more radical deists like Toland, and he reinforced this position by also adopting an elitist understanding of the role of religion in society. For Voltaire, those equipped to understand their own reason could find the proper course of free action themselves. But since many were incapable of such self-knowledge and self-control, religion, he claimed, was a necessary guarantor of social order. This stance distanced Voltaire from the republican politics of Toland and other materialists, and Voltaire echoed these ideas in his political musings, where he remained throughout his life a liberal, reform-minded monarchist and a skeptic with respect to republican and democratic ideas.\nIn the Lettres philosophiques, Voltaire had suggested a more radical position with respect to human determinism, especially in his letter on Locke, which emphasized the materialist reading of the Lockean soul that was then a popular figure in radical philosophical discourse. Some readers singled out this part of the book as the major source of its controversy, and in a similar vein the very materialist account of “Âme,” or the soul, which appeared in volume 1 of Diderot and d’Alembert’s Encyclopédie, was also a flashpoint of controversy. Voltaire also defined his own understanding of the soul in similar terms in his own Dictionnaire philosophique. What these examples point to is Voltaire’s willingness, even eagerness, to publicly defend controversial views even when his own, more private and more considered writings often complicated the understanding that his more public and polemical writings insisted upon. In these cases, one often sees Voltaire defending less a carefully reasoned position on a complex philosophical problem than adopting a political position designed to assert his conviction that liberty of speech, no matter what the topic, is sacred and cannot be violated.\nVoltaire never actually said “I disagree with what you say, but I will defend to the death your right to say it.” Yet the myth that associates this dictum with his name remains very powerful, and one still hears his legacy invoked through the redeclaration of this pronouncement that he never actually declared. Part of the deep cultural tie that joins Voltaire to this dictum is the fact that even while he did not write these precise words, they do capture, however imprecisely, the spirit of his philosophy of liberty. In his voluminous correspondence especially, and in the details of many of his more polemical public texts, one does find Voltaire articulating a view of intellectual and civil liberty that makes him an unquestioned forerunner of modern civil libertarianism. He never authored any single philosophical treatise on this topic, however, yet the memory of his life and philosophical campaigns was influential in advancing these ideas nevertheless. Voltaire’s influence is palpably present, for example, in Kant’s famous argument in his essay “What is Enlightenment?” that Enlightenment stems from the free and public use of critical reason, and from the liberty that allows such critical debate to proceed untrammeled. The absence of a singular text that anchors this linkage in Voltaire’s collected works in no way removes the unmistakable presence of Voltaire’s influence upon Kant’s formulation.\n2.2 Hedonism\nVoltaire’s notion of liberty also anchored his hedonistic morality, another key feature of Voltaire’s Enlightenment philosophy. One vehicle for this philosophy was Voltaire’s salacious poetry, a genre that both reflected in its eroticism and sexual innuendo the lived culture of libertinism that was an important feature of Voltaire’s biography. But Voltaire also contributed to philosophical libertinism and hedonism through his celebration of moral freedom through sexual liberty. Voltaire’s avowed hedonism became a central feature of his wider philosophical identity since his libertine writings and conduct were always invoked by those who wanted to indict him for being a reckless subversive devoted to undermining legitimate social order. Voltaire’s refusal to defer to such charges, and his vigor in opposing them through a defense of the very libertinism that was used against him, also injected a positive philosophical program into these public struggles that was very influential. In particular, through his cultivation of a happily libertine persona, and his application of philosophical reason toward the moral defense of this identity, often through the widely accessible vehicles of poetry and witty prose, Voltaire became a leading force in the wider Enlightenment articulation of a morality grounded in the positive valuation of personal, and especially bodily, pleasure, and an ethics rooted in a hedonistic calculus of maximizing pleasure and minimizing pain. He also advanced this cause by sustaining an unending attack upon the repressive and, to his mind, anti-human demands of traditional Christian asceticism, especially priestly celibacy, and the moral codes of sexual restraint and bodily self-abnegation that were still central to the traditional moral teachings of the day.\nThis same hedonistic ethics was also crucial to the development of liberal political economy during the Enlightenment, and Voltaire applied his own libertinism toward this project as well. In the wake of the scandals triggered by Mandeville’s famous argument in The Fable of the Bees (a poem, it should be remembered) that the pursuit of private vice, namely greed, leads to public benefits, namely economic prosperity, a French debate about the value of luxury as a moral good erupted that drew Voltaire’s pen. In the 1730s, he drafted a poem called Le Mondain that celebrated hedonistic worldly living as a positive force for society, and not as the corrupting element that traditional Christian morality held it to be. In his Essay sur les moeurs he also joined with other Enlightenment historians in celebrating the role of material acquisition and commerce in advancing the progress of civilization. Adam Smith would famously make similar arguments in his founding tract of Enlightenment liberalism, On the Wealth of Nations, published in 1776. Voltaire was certainly no great contributor to the political economic science that Smith practiced, but he did contribute to the wider philosophical campaigns that made the concepts of liberty and hedonistic morality central to their work both widely known and more generally accepted.\nThe ineradicable good of personal and philosophical liberty is arguably the master theme in Voltaire’s philosophy, and if it is, then two other themes are closely related to it. One is the importance of skepticism, and the second is the importance of empirical science as a solvent to dogmatism and the pernicious authority it engenders.\n2.3 Skepticism\nVoltaire’s skepticism descended directly from the neo-Pyrrhonian revival of the Renaissance, and owes a debt in particular to Montaigne, whose essays wedded the stance of doubt with the positive construction of a self grounded in philosophical skepticism. Pierre Bayle’s skepticism was equally influential, and what Voltaire shared with these forerunners, and what separated him from other strands of skepticism, such as the one manifest in Descartes, is the insistence upon the value of the skeptical position in its own right as a final and complete philosophical stance. Among the philosophical tendencies that Voltaire most deplored, in fact, were those that he associated most powerfully with Descartes who, he believed, began in skepticism but then left it behind in the name of some positive philosophical project designed to eradicate or resolve it. Such urges usually led to the production of what Voltaire liked to call “philosophical romances,” which is to say systematic accounts that overcome doubt by appealing to the imagination and its need for coherent explanations. Such explanations, Voltaire argued, are fictions, not philosophy, and the philosopher needs to recognize that very often the most philosophical explanation of all is to offer no explanation at all.\nSuch skepticism often acted as bulwark for Voltaire’s defense of liberty since he argued that no authority, no matter how sacred, should be immune to challenge by critical reason. Voltaire’s views on religion as manifest in his private writings are complex, and based on the evidence of these texts it would be wrong to call Voltaire an atheist, or even an anti-Christian so long as one accepts a broad understanding of what Christianity can entail. But even if his personal religious views were subtle, Voltaire was unwavering in his hostility to church authority and the power of the clergy. For similar reasons, he also grew as he matured ever more hostile toward the sacred mysteries upon which monarchs and Old Regime aristocratic society based their authority. In these cases, Voltaire’s skepticism was harnessed to his libertarian convictions through his continual effort to use critical reason as a solvent for these “superstitions” and the authority they anchored. The philosophical authority of romanciers such as Descartes, Malebranche, and Leibniz was similarly subjected to the same critique, and here one sees how the defense of skepticism and liberty, more than any deeply held opposition to religiosity per se, was often the most powerful motivator for Voltaire.\nFrom this perspective, Voltaire might fruitfully be compared with Socrates, another founding figure in Western philosophy who made a refusal to declaim systematic philosophical positions a central feature of his philosophical identity. Socrates’s repeated assertion that he knew nothing was echoed in Voltaire’s insistence that the true philosopher is the one who dares not to know and then has the courage to admit his ignorance publicly. Voltaire was also, like Socrates, a public critic and controversialist who defined philosophy primarily in terms of its power to liberate individuals from domination at the hands of authoritarian dogmatism and irrational prejudice. Yet while Socrates championed rigorous philosophical dialectic as the agent of this emancipation, Voltaire saw this same dialectical rationalism at the heart of the dogmatism that he sought to overcome. Voltaire often used satire, mockery and wit to undermine the alleged rigor of philosophical dialectic, and while Socrates saw this kind of rhetorical word play as the very essence of the erroneous sophism that he sought to alleviate, Voltaire cultivated linguistic cleverness as a solvent to the false and deceptive dialectic that anchored traditional philosophy.\n2.4 Newtonian Empirical Science\nAgainst the acceptance of ignorance that rigorous skepticism often demanded, and against the false escape from it found in sophistical knowledge—or what Voltaire called imaginative philosophical romances—Voltaire offered a different solution than the rigorous dialectical reasoning of Socrates: namely, the power and value of careful empirical science. Here one sees the debt that Voltaire owed to the currents of Newtonianism that played such a strong role in launching his career. Voltaire’s own critical discourse against imaginative philosophical romances originated, in fact, with English and Dutch Newtonians, many of whom were expatriate French Huguenots, who developed these tropes as rhetorical weapons in their battles with Leibniz and European Cartesians who challenged the innovations of Newtonian natural philosophy. In his Principia Mathematica (1687; 2nd rev. edition 1713), Newton had offered a complete mathematical and empirical description of how celestial and terrestrial bodies behaved. Yet when asked to explain how bodies were able to act in the way that he mathematically and empirically demonstrated that they did, Newton famously replied “I feign no hypotheses.” From the perspective of traditional natural philosophy, this was tantamount to hand waving since offering rigorous causal accounts of the nature of bodies in motion was the very essence of this branch of the sciences. Newton’s major philosophical innovation rested, however, in challenging this very epistemological foundation, and the assertion and defense of Newton’s position against its many critics, not least by Voltaire, became arguably the central dynamic of philosophical change in the first half of the eighteenth century.\nWhile Newtonian epistemology admitted of many variations, at its core rested a new skepticism about the validity of apriori rationalist accounts of nature and a new assertion of brute empirical fact as a valid philosophical understanding in its own right. European Natural philosophers in the second half of the seventeenth century had thrown out the metaphysics and physics of Aristotle with its four part causality and teleological understanding of bodies, motion and the cosmic order. In its place, however, a new mechanical causality was introduced that attempted to explain the world in equally comprehensive terms through the mechanisms of an inert matter acting by direct contact and action alone. This approach lead to the vortical account of celestial mechanics, a view that held material bodies to be swimming in an ethereal sea whose action pushed and pulled objects in the manner we observe. What could not be observed, however, was the ethereal sea itself, or the other agents of this supposedly comprehensive mechanical cosmos. Yet rationality nevertheless dictated that such mechanisms must exist since without them philosophy would be returned to the occult causes of the Aristotelian natural tendencies and teleological principles. Figuring out what these point-contact mechanisms were and how they worked was, therefore, the charge of the new mechanical natural philosophy of the late seventeenth century. Figures such as Descartes, Huygens, and Leibniz established their scientific reputations through efforts to realize this goal.\nNewton pointed natural philosophy in a new direction. He offered mathematical analysis anchored in inescapable empirical fact as the new foundation for a rigorous account of the cosmos. From this perspective, the great error of both Aristotelian and the new mechanical natural philosophy was its failure to adhere strictly enough to empirical facts. Vortical mechanics, for example, claimed that matter was moved by the action of an invisible agent, yet this, the Newtonians began to argue, was not to explain what is really happening but to imagine a fiction that gives us a speciously satisfactory rational explanation of it. Natural philosophy needs to resist the allure of such rational imaginings and to instead deal only with the empirically provable. Moreover, the Newtonians argued, if a set of irrefutable facts cannot be explained other then by accepting the brute facticity of their truth, this is not a failure of philosophical explanation so much as a devotion to appropriate rigor. Such epistemological battles became especially intense around Newton’s theory of universal gravitation. Few questioned that Newton had demonstrated an irrefutable mathematical law whereby bodies appear to attract one another in relation to their masses and in inverse relation to the square of the distance between them. But was this rigorous mathematical and empirical description a philosophical account of bodies in motion? Critics such as Leibniz said no, since mathematical description was not the same thing as philosophical explanation, and Newton refused to offer an explanation of how and why gravity operated the way that it did. The Newtonians countered that phenomenal descriptions were scientifically adequate so long as they were grounded in empirical facts, and since no facts had yet been discerned that explained what gravity is or how it works, no scientific account of it was yet possible. They further insisted that it was enough that gravity did operate the way that Newton said it did, and that this was its own justification for accepting his theory. They further mocked those who insisted on dreaming up chimeras like the celestial vortices as explanations for phenomena when no empirical evidence existed to support of such theories.\nThe previous summary describes the general core of the Newtonian position in the intense philosophical contests of the first decades of the eighteenth century. It also describes Voltaire’s own stance in these same battles. His contribution, therefore, was not centered on any innovation within these very familiar Newtonian themes; rather, it was his accomplishment to become a leading evangelist for this new Newtonian epistemology, and by consequence a major reason for its widespread dissemination and acceptance in France and throughout Europe. A comparison with David Hume’s role in this same development might help to illuminate the distinct contributions of each. Both Hume and Voltaire began with the same skepticism about rationalist philosophy, and each embraced the Newtonian criterion that made empirical fact the only guarantor of truth in philosophy. Yet Hume’s target remained traditional philosophy, and his contribution was to extend skepticism all the way to the point of denying the feasibility of transcendental philosophy itself. This argument would famously awake Kant’s dogmatic slumbers and lead to the reconstitution of transcendental philosophy in new terms, but Voltaire had different fish to fry. His attachment was to the new Newtonian empirical scientists, and while he was never more than a dilettante scientist himself, his devotion to this form of natural inquiry made him in some respects the leading philosophical advocate and ideologist for the new empirico-scientific conception of philosophy that Newton initiated.\nFor Voltaire (and many other eighteenth-century Newtonians) the most important project was defending empirical science as an alternative to traditional natural philosophy. This involved sharing in Hume’s critique of abstract rationalist systems, but it also involved the very different project of defending empirical induction and experimental reasoning as the new epistemology appropriate for a modern Enlightened philosophy. In particular, Voltaire fought vigorously against the rationalist epistemology that critics used to challenge Newtonian reasoning. His famous conclusion in Candide, for example, that optimism was a philosophical chimera produced when dialectical reason remains detached from brute empirical facts owed a great debt to his Newtonian convictions. His alternative offered in the same text of a life devoted to simple tasks with clear, tangible, and most importantly useful ends was also derived from the utilitarian discourse that Newtonians also used to justify their science. Voltaire’s campaign on behalf of smallpox inoculation, which began with his letter on the topic in the Lettres philosophiques, was similarly grounded in an appeal to the facts of the case as an antidote to the fears generated by logical deductions from seemingly sound axiomatic principles. All of Voltaire’s public campaigns, in fact, deployed empirical fact as the ultimate solvent for irrational prejudice and blind adherence to preexisting understandings. In this respect, his philosophy as manifest in each was deeply indebted to the epistemological convictions he gleaned from Newtonianism.\n2.5 Toward Science without Metaphysics\nVoltaire also contributed directly to the new relationship between science and philosophy that the Newtonian revolution made central to Enlightenment modernity. Especially important was his critique of metaphysics and his argument that it be eliminated from any well-ordered science. At the center of the Newtonian innovations in natural philosophy was the argument that questions of body per se were either irrelevant to, or distracting from, a well focused natural science. Against Leibniz, for example, who insisted that all physics begin with an accurate and comprehensive conception of the nature of bodies as such, Newton argued that the character of bodies was irrelevant to physics since this science should restrict itself to a quantified description of empirical effects only and resist the urge to speculate about that which cannot be seen or measured. This removal of metaphysics from physics was central to the overall Newtonian stance toward science, but no one fought more vigorously for it, or did more to clarify the distinction and give it a public audience than Voltaire.\nThe battles with Leibnizianism in the 1740s were the great theater for Voltaire’s work in this regard. In 1740, responding to Du Châtelet’s efforts in her Institutions de physiques to reconnect metaphysics and physics through a synthesis of Leibniz with Newton, Voltaire made his opposition to such a project explicit in reviews and other essays he published. He did the same during the brief revival of the so-called “vis viva controversy” triggered by du Châtelet’s treatise, defending the empirical and mechanical conception of body and force against those who defended Leibniz’s more metaphysical conception of the same thing. In the same period, Voltaire also composed a short book entitled La Metaphysique de Newton, publishing it in 1740 as an implicit counterpoint to Châtelet’s Institutions. This tract did not so much articulate Newton’s metaphysics as celebrate the fact that he avoided practicing such speculations altogether. It also accused Leibniz of becoming deluded by his zeal to make metaphysics the foundation of physics. In the definitive 1745 edition of his Éléments de la philosophie de Newton, Voltaire also appended his tract on Newton’s metaphysics as the book’s introduction, thus framing his own understanding of the relationship between metaphysics and empirical science in direct opposition to Châtelet’s Leibnizian understanding of the same. He also added personal invective and satire to this same position in his indictment of Maupertuis in the 1750s, linking Maupertuis’s turn toward metaphysical approaches to physics in the 1740s with his increasingly deluded philosophical understanding and his authoritarian manner of dealing with his colleagues and critics.\nWhile Voltaire’s attacks on Maupertuis crossed the line into ad hominem, at their core was a fierce defense of the way that metaphysical reasoning both occludes and deludes the work of the physical scientist. Moreover, to the extent that eighteenth-century Newtonianism provoked two major trends in later philosophy, first the reconstitution of transcendental philosophy à la Kant through his “Copernican Revolution” that relocated the remains of metaphysics in the a priori categories of reason, and second, the marginalization of metaphysics altogether through the celebration of philosophical positivism and the anti-speculative scientific method that anchored it, Voltaire should be seen as a major progenitor of the latter. By also attaching what many in the nineteenth century saw as Voltaire’s proto-positivism to his celebrated campaigns to eradicate priestly and aristo-monarchical authority through the debunking of the “irrational superstitions” that appeared to anchor such authority, Voltaire’s legacy also cemented the alleged linkage that joined positivist science on the one hand with secularizing disenchantment and dechristianization on the other. In this way, Voltaire should be seen as the initiator of a philosophical tradition that runs from him to Auguste Comte and Charles Darwin, and then on to Karl Popper and Richard Dawkins in the twentieth century.\n", "bibliography": {"categories": ["<a name=\"PriLit\">Primary Literature</a>", "<a name=\"PriLitTra\">Primary Literature in Translation</a>", "<a name=\"SecLit\">Secondary Literature</a>"], "cat_ref_text": {"<a name=\"PriLit\">Primary Literature</a>": ["</h3>\n<p>Because of Voltaire’s celebrity, efforts to collect and canonize his writings began immediately after his death, and still continue today. The result has been the production of three major collections of his writings including his vast correspondence, the last unfinished. Together these constitute the authoritative corpus of Voltaire’s written work.</p>\n<ul>", "<em>Oeuvres complètes de Voltaire</em>, edited by A. Beuchot. 72 vols. Paris: Lefevre, 1829–1840.", "<em>Oeuvres complètes de Voltaire</em>, edited by L.E.D. Moland and G. Bengesco. 52 vols. Paris: Garnier Frères, 1877–1885.", "<em>Oeuvres complètes de Voltaire</em>, edited by Theodore Besterman. 135 vols. (projected) Geneva, Banbury, and Oxford: Voltaire Foundation, 1968–.\n</ul>\n<h3>"], "<a name=\"PriLitTra\">Primary Literature in Translation</a>": ["</h3>\n<h4>Collections of Writings</h4>\n<ul>", "<em>The Works of Voltaire: A Contemporary Version</em>, William F. Fleming (ed. and tr.), 21 vols., New York: E.R. Du Mont, 1901. [Complete edition available at the <a href=\"http://oll.libertyfund.org/index.php?option=com_staticxt&amp;staticfile=show.php&amp;title=351\" target=\"other\">Online Library of Liberty</a>]", "<em>The Portable Voltaire</em>, Ben Ray Redman (ed.), New York: Penguin Books, 1977.", "<em>Selected Works of Voltaire</em>, Joseph McCabe (ed.), London: Watts, 2007.", "<em>Shorter Writings of Voltaire</em>, J.I. Rodale (ed.), New York: A.S. Barnes, 1960.", "<em>Voltaire in his Letters, Being a Selection of his Correspondence</em>, S.G. Tallentyre (tr.), Honolulu, HI: University Press of the Pacific, 2004.", "<em>Voltaire on Religion: Selected Writings</em>, Kenneth W. Applegate (ed.), New York: F. Ungar, 1974.", "<em>Voltaire: Selected Writings</em>, Christopher Thacker (ed.), London: Dent, 1995.", "<em>Voltaire: Selections</em>, Paul Edwards (ed.), New York: Macmillan, 1989.\n</ul>\n<h5>Theater</h5>\n<ul>", "Translations of Voltaire’s major plays are found in: <em>The Works of Voltaire: A Contemporary Version</em>, William F. Fleming (ed. and tr.), New York: E.R. Du Mont, 1901. [Complete edition available at the <a href=\"http://oll.libertyfund.org/index.php?option=com_staticxt&amp;staticfile=show.php&amp;title=351\" target=\"other\">Online Library of Liberty</a>]", "<em>Seven Plays (Mérope (1737), Olympia (1761), Alzire (1734), Orestes (1749), Oedipus (1718), Zaire, Caesar)</em>, William Fleming (tr.), New York: Howard Fertig, 1988.\n</ul>\n<h5>History</h5>\n<ul>", "<em>The Age of Louis XIV (1733) and other Selected Writings</em>, J.H. Brumfitt (ed.), New York: Twayne, 1963.", "<em>The Age of Louis XIV (1733)</em>, Martyn P. Pollack (tr.), London and New York: Dutton, 1978.", "<em>History of Charles XII, King of Sweden (1727)</em>, Honolulu, HI: University Press of the Pacific, 2002.", "<em>History of Charles XII, King of Sweden (1727)</em>, Antonia White and Ragnhild Marie Hatton (eds.), New York: Barnes &amp; Noble Books, 1993.", "<em>The Philosophy of History (1764)</em>, New York: The Philosophical Library, 1965.\n</ul>\n<h5>Essays, Letters, and Stories</h5>\n<ul>", "<em>The Complete Tales of Voltaire</em>, William Walton (tr.), 3 vols., New York: Howard Fertig, 1990.\n\n\t<ul>", "Vol. 1: The Huron (1771), The History of Jenni (1774), The One-eyed Street Porter, Cosi-sancta (1715), An Incident of Memory (1773), The Travels of Reason (1774), The Man with Forty Crowns (1768), Timon (1755), The King of Boutan (1761), and The City of Cashmere (1760).", "Vol. 2: The Letters of Amabed (1769), The Blind Judges of Colors (1766), The Princess of Babylon (1768), The Ears of Lord Chesterfield and Chaplain Goudman (1775), Story of a Good Brahman (1759), An Indian Adventure (1764), and Zadig, or, Destiny (1757).", "Vol. 3: Micromegas (1738), Candide, or Optimism (1758), The World as it Goes (1750), The White and the Black (1764), Jeannot and Colin (1764), The Travels of Scarmentado (1756), The White Bull (1772), Memnon (1750), Plato’s Dream (1737), Bababec and the Fakirs (1750), and The Two Consoled Ones (1756).\n</ul>", "<em>The English Essays of 1727</em>, David Williams and Richard Walker (eds.), Oxford: Voltaire Foundation, 1996.", "<em>Epistle of M. Voltaire to the King of Prussia (1738)</em>, Glasgow, 1967.", "<em>The History of the Travels of Scarmentado (1756)</em>, Glasgow: The College Press, 1969.", "<em>Micromégas and other Short Fictions</em> (1738), Theo Cuffe and Haydn Mason (eds.), London and New York: Penguin Books, 2002.", "<em>The Princess of Babylon (1768)</em>, London: Signet Books, 1969.", "<em>The Virgin of Orleans, or Joan of Arc (1755)</em>, Howard Nelson (tr.), Denver: A. Swallow, 1965.", "<em>Voltaire. Essay on Milton (1727)</em>, Cambridge: Cambridge University Press, 1954.", "<em>Voltaire’s Romances</em>, New York: P. Eckler, 1986.", "<em>Zadig, or L’Ingénu</em> (1757), London: Penguin Books, 1984.", "<em>Zadig, or the Book of Fate (1757)</em>, New York: Garland, 1974.", "<em>Zadig, or The Book of Fate an Oriental History (1757)</em>, Woodbridge, CT: Research Publications, 1982.\n</ul>\n<h5>Politics</h5>\n<ul>", "<em>The Calas Affair: A Treatise on Tolerance (1762)</em>, Brian Masters (ed.), London: The Folio Society, 1994.", "<em>The Sermon of the Fifty (1759)</em>, J.A.R. Séguin (ed.), Jersey City, NJ: R. Paxton, 1963.", "<em>A Treatise on Toleration and Other Essays</em>, Joseph McCabe (ed.), Amherst, NY: Prometheus Books, 1994.", "<em>A Treatise on Tolerance and other Writings</em>, edited by Brian Masters, Cambridge and New York: Cambridge University Press, 1994", "<em>Voltaire. Political Writings</em>, edited by David Williams, Cambridge and New York: Cambridge University Press, 1994\n</ul>\n<h5>Editions of Major Individual Works</h5>\n<ul>", "<em>The Elements of Sir Isaac Newton’s Philosophy</em> (1738; 2nd expanded edition, 1745)\n\n\t<ul>", "Translated John Hanna. London: Cass, 1967.", "Birmingham, AL: Gryphon Editions, 1991.\n</ul>", "<em>Philosophical Dictionary (1752)</em>\n<ul>", "Edited by Theodore Besterman. London: Penguin Books, 2002.", "Translated by Peter Gay. New York: Basic Books, 1962.", "<em>Philosophical Dictionary: A Compendium</em>, Wade Baskin (ed.), New York: Philosophical Library, 1961.", "<em>Philosophical Dictionary: Selections</em>, Chicago: The Great Books Foundation, 1965.\n</ul>", "<em>Philosophical Letters (Letters on the English Nation, Letters on England) (1734)</em>\n<ul>", "John Leigh and Prudence L. Steiner (ed.), Indianapolis, IN: Hackett, 2007.", "Leonard Tancock (ed.), London and New York: Penguin Books, 2003.", "Ernest Dilworth (ed.), Mineola, NY: Dover, 2003.", "Nicholas Cronk (ed.), New York: Oxford University Press, 1994.", "F.A. Taylor (ed.), Oxford: Basil Blackwell, 1946.", "Harvard Classics, Vol. 34, Part 2. [<a href=\"http://bartleby.com/34/2/\" target=\"other\">Available online from Bartleby.com</a>]\n</ul>", "<em>Voltaire’s Letters on the Quakers (1727)</em>, Philadelphia: William H. Allen, 1953.", "<em>Candide, or Optimism (1758)</em>. Hundreds of English editions of this text have been published, so this list is restricted to the most important scholarly editions published since 1960.\n\t<ul>", "C.H.R. Niven (ed.), London: Longman, 1980.", "<em>Candide and other Writings</em>, Haskell M. Block (ed.), New York: Modern Library, 1985.", "Richard Aldington, Ernest Dilworth, and others (eds.), New York: Modern Library, 1992.", "Shane Weller (ed.), New York: Dover, 1993.", "<em>Candide: A Dual Language Book</em>, New York: Barnes &amp; Noble Books, 1993.", "Robert Martin Adams (ed.), New York: W.W. Norton, 1996.", "Electronic Scholarly Publishing Project, 1998. [Available online at <a href=\"http://www.esp.org/books/voltaire/candide.pdf\" target=\"other\">Electronic Scholarly Publishing Project</a>]", "Daniel Gordon (ed.), Boston: Bedford/St. Martin’s, 1999.", "<em>Candide and Related Texts</em>, David Wooton (ed.), Indianapolis, IN: Hackett, 2000.", "Lowell Bair (ed.), New York: Bantam Books, 2003.", "<em>Candide &amp; Zadig</em>, Lester G. Crocker (ed.), New York: Pocket Books, 2005.", "Raffael Burton (ed.), New Haven: Yale University Press, 2007.", "Theo Cuffe (ed.), London and New York: Penguin Books, 2007.", "<em>Candide and other Stories</em>, Roger Pearson (ed.), Oxford: Oxford University Press, 2008.", "<em>Candide, Zadig, and Selected Stories</em>, Donald Frame (tr. and ed.), New York: Signet Classic, 2009.\n</ul>\n\n</ul>\n<h3>"], "<a name=\"SecLit\">Secondary Literature</a>": ["</h3>\n<p>The scholarly literature on Voltaire is vast, and growing larger every day. The summary here, therefore, will be largely restricted to scholarly books, with only a few articles of singular import listed. The Voltaire Foundation’s series <em>Studies on Voltaire and the Eighteenth Century</em> changed its name in 2013 to <em>Oxford University Studies on Enlightenment</em>. The original series published over 450 volumes, many related to Voltaire, and while the new title reflects a change toward a broader publishing agenda, it remains, along with <em>Cahier Voltaire</em> published by La Fondation Voltaire à Ferney, the best periodical source for new scholarship on Voltaire.</p>\n<ul class=\"hanging\">", "Aldridge, Alfred Owen, 1975, <em>Voltaire and the Century of Light</em>, Princeton: Princeton University Press.", "Badinter, Elizabeth, 1983, <em>Émilie, Émilie, l’ambition féminine au XVIIIe siècle</em>, Paris: Flammarion.", "–––, 1999–2002, <em>Les Passions intellectuelles</em>, 2 volumes, Paris: Fayard.", "Barber, W.H., 1955, <em>Leibniz in France from Arnauld to Voltaire: A Study in French Reactions to Leibnizianism 1670–1760</em>, Oxford: Clarendon Press.", "Barrell, Rex A., 1988, <em>Bolingbroke and France</em>, Lanham, MD: University Press of America.", "Besterman, Theodore, 1969, <em>Voltaire</em>, New York: Harcourt, Brace, &amp; World.", "Bird, Stephen, 2000, <em>Reinventing Voltaire: The Politics of Commemoration in Nineteenth-century France</em>, Oxford: Oxford University Studies on Enlightenment.", "Brooks, Richard A., 1964, <em>Voltaire and Leibniz</em>, Geneva: Droz.", "Brown, Harcourt, 1947, <em>Voltaire and the Royal Society of London</em>, Toronto: University of Toronto Quarterly.", "Brumfitt, J.H., 1970, <em>Voltaire: historian</em>, London: Oxford University Press.", "–––, 1973, <em>The French Enlightenment</em>, Cambridge: Schenkman Pub. Co.", "Brunel, Lucien, 1967, <em>Les Philosophes et l’académie française au dix-huitième siècle</em>, Genève: Slatkine Reprints.", "Brunet, Pierre, 1931, <em>L’introduction des théories de Newton en France au XVIIIe siècle</em>, Paris: A. Blanchard.", "Collins, J. Churton, 1908, <em>Voltaire, Montesquieu, and Rousseau in England</em>, London: E. Nash.", "Conlon, Pierre M., 1961, <em>Voltaire’s literary career from 1728 to 1750</em>, Genève: Institut et Musée Voltaire.", "Cottret, Bernard, 1992, <em>Bolingbroke: exil et écriture au siècle des Lumières</em>, Paris: Klincksieck.", "Cronk, Nicolas, 2009, <em>The Cambridge Companion to Voltaire</em>, Cambridge: Cambridge University Press.", "–––, 2014, <em>Voltaire: a very short introduction</em>, Oxford: The Voltaire Foundation.", "Darnton, Robert, 1979, <em>The Business of Enlightenment: The Publishing History of the Encyclopédie</em>, 1775–1800, Cambridge: Harvard University Press.", "–––, 1982, <em>The Literary Underground of the Old Regime</em>, Cambridge: Harvard University Press.", "Dickinson, H.T., 1970, <em>Bolingbroke</em>, London: Constable.", "Dieckmann, Herbert, 1943, <em>Le Philosophe: Texts and Interpretations</em>, (Washington University Studies, New Series, Language and Literature, no. 18), St. Louis: Washington University Press.", "Duchet, Michèle, 1971, <em>Anthropologie et histoire au siècle des lumières Buffon, Voltaire, Rousseau, Helvetius, Diderot</em>, Paris: F. Maspero.", "Ehrman, Esther, 1986, <em>Mme. du Châtelet: Scientist, Philosopher and Feminist of the Enlightenment</em>, Leamington [Spa]: Berg.", "Gandt, François de, 2001, <em>Cirey dans la vie intellectuelle: la réception de Newton en France</em>, Oxford: Voltaire Foundation.", "Gardiner Janik, Linda, 1982, “Searching for the Metaphysics of Science: The Structure and Composition of Mme. Du Châtelet’s <em>Institutions de physiques</em>, 1737–1740”, <em>Studies on Voltaire and the Eighteenth Century</em>, 201: 85–113.", "Gay, Peter, 1954, <em>The Party of Humanity: Essays in the French Enlightenment</em>, New York: Knopf.", "Gay, Peter, 1969, <em>The Enlightenment: An Interpretation</em> (Volume 1: <em>The Science of Freedom</em>), New York: Knopf.", "–––, 1977, <em>The Enlightenment: An Interpretation</em> (Volume 2: <em>The Rise of Modern Paganism</em>), New York: Knopf 1977.", "–––, 1988, <em>Voltaire’s Politics: The Poet as Realist</em>, New Haven: Yale University Press.", "Guerlac, Henry, 1981,<em>Newton on the Continent</em>, Ithaca.", "Gurrado, Antonio, 2013, <em>Voltaire cattolico</em>, Torino: Lindau.", "Hagengruber, Ruth (ed.), 2011, <em> Emilie du Châtelet between Leibniz and Newton</em>, Dordrecht: Springer.", "Ḥadīd, Javādī, 2012, <em>Voltaire et l’Islam</em>, Ozoir la Ferriere : Albouraq.", "Hellman, Lilian, 1980, Dorothy Parker, John La Touche, Richard Wilbur, and Leonard Bernstein, 1956–1957, <em>Candide, An Operetta in Two Acts</em>, New York: Jaini Publications.", "Hutchison, Ross, 1991, <em>Locke in France: 1688–1734</em>, Oxford: Voltaire Foundation.", "Iltis, Carolyn, 1977, “Madame du Châtelet’s metaphysics and mechanics”, <em>Studies in the History and Philosophy of Science</em>, 8: 29–48.", "Israel, Jonathan, 2000, <em>The Radical Enlightenment: Philosophy and the Making of Modernity, 1650–1750</em>, Oxford: Oxford University Press.", "–––, 2006, <em>Enlightenment Contested: Philosophy, Modernity, and the Emancipation of Man 1670–1752</em>, Oxford: Oxford University Press.", "–––, 2009, <em>A Revolution of the Mind: Radical Enlightenment and the Intellectual Origins of Modern Democracy</em>, Oxford: Oxford University Press.", "–––, 2011, <em>Democratic Enlightenment: Philosophy, Revolution, and Human Rights 1750–1790</em>, Oxford: Oxford University Press.", "–––, 2014, <em>Revolutionary Ideas: An Intellectual History of the French Revolution from The Rights of Man to Robespierre</em>, Oxford: Oxford University Press.", "Jacob, Margaret, 1981, <em>The Radical Enlightenment: Pantheists, Freemasons, and Republicans</em>, London: Cornerstone Book Publishers.", "Kramnick, Isaac, 1968, <em>Bolingbroke and His Circle: The Politics of Nostalgia in the Age of Walpole</em>, Cambridge: Harvard University Press.", "Lanson, Gustave, 1894, <em>Histoire de la littérature française</em>, Paris: Hachette.", "Lanson, Gustave, 1906, <em>Voltaire</em>, Paris: Hachette.", "Libby, Margaret Sherwood, 1935, <em>The Attitude of Voltaire to Magic and the Sciences</em>, New York: Columbia University Press, 1935.", "Lilti, Antoine, 2005, <em>Le monde des salons. Sociabilité et mondanité à Paris au XVIIIe siècle</em>, Paris: Fayard.", "Mason, Haydn Trevor, 1963, <em>Pierre Bayle and Voltaire</em>, London: Oxford University Press.", "–––, 1975, <em>Voltaire</em>, New York: St. Martin’s.", "Masseau, Didier, 1994, <em>L’Invention de l’intellectual dans l’Europe du XVIIIe siècle</em>, Paris: Presses Universitaires de France.", "Mattei, Silvia, 2010, <em>Voltaire et les voyages de la raison</em>, Paris: Harmattan.", "Maurois, André, 1935, <em>Voltaire</em>, Paris: Gallimard.", "Mauzi, Robert, 1960, <em>L’idée du bonheur dans la litterature et la pensée francaises au XVIIIe siècle</em>, Paris: A. Colin.", "McKenna, Antony, 1994, <em>Écraser l’infame, 1759–1770</em>, <em>Voltaire en son temps</em> (Volume 4), René Pomeau (ed.), Oxford: Voltaire Foundation.", "McMahon, Darrin M., 2001, <em>Enemies of the Enlightenment: The French Counter-enlightenment and the Making of Modernity</em>, New York: Oxford University Press.", "McNutt, Jennifer Powell, 2013, <em>Calvin meets Voltaire: the clergy of Geneva in the age of enlightenment, 1685–1798</em>, Burlington: Ashgate.", "Melton, James Van Horn, 2001, <em>The Rise of the Public in Enlightenment Europe</em>, Cambridge: Cambridge University Press.", "Méricam-Bourdet, Myrtille, 2012, <em>Voltaire et l’écriture de l’histoire: un enjeu politique</em>, Oxford: Voltaire Foundation.", "Mervaud, Christiane, 1991, <em>De la cour au jardin, 1750–1759</em>, <em>Voltaire en son temps</em> (Volume 3), René Pomeau (ed.), Oxford: Voltaire Foundation.", "Mitchell, Harvey, 2104, <em>Voltaire’s Jews and modern Jewish identity: rethinking the Enlightenment</em>, London: Routledge.", "Morize, André, 1909, <em>L’Apologie du luxe au XVIIIe Siècle: “Le Mondain” et ses Sources</em>, Paris: H. Didier.", "Neiertz, Patrick, 2012, <em>Voltaire et l’économie politique</em>, Oxford: Voltaire Foundation.", "Northeast, Catherine M., 1991, <em>The Parisian Jesuits and the Enlightenment, 1700–1762</em>, Oxford: Voltaire Foundation.", "Orieux, Jean, 1966, <em>Voltaire, ou la Royauté de l’esprit</em>, Paris: Flammarion.", "Palmer, Robert R., 1939, <em>Catholics and Unbelievers in 18<sup>th</sup> Century France</em>, Princeton: Princeton University Press.", "Pappas, John N., 1957, <em>Berthier’s Journal de Trevoux and the Philosophes</em> (Studies on Voltaire and the Eighteenth Century, Volume 3), Geneva: Institut and Musée Voltaire.", "–––, 1962, <em>Voltaire and d’Alembert</em>, Bloomington: Indiana University Press.", "Pearson, Roger, 1993, <em>The Fables of Reason: A Study of Voltaire’s “Contes philosophiques”</em>, Oxford: Clarendon Press.", "–––, 2005, <em>Voltaire Almighty: A Life in Pursuit of Freedom</em>, London: Bloomsbury Publishing.", "Perry, Norma, 1975, <em>Sir Everard Fawkener, friend and correspondent of Voltaire</em>, Oxford: Voltaire Foundation.", "Pettit, Alexander, 1997, <em>Illusory Consensus: Bolingbroke and the Polemical Responses to Walpole, 1730–1737</em>, Newark: University of Delaware Press.", "Pomeau, René, 1969, <em>La réligion de Voltaire</em>, Paris: Nizet.", "–––, 1985, <em>D’Arouet à Voltaire, 1694–1734</em>, <em>Voltaire en son temps</em> (Volume 1), René Pomeau (ed.), Oxford: Voltaire Foundation.", "–––, 1994, <em>On a voulu l’enterrer, 1770–1791</em>, <em>Voltaire en son temps</em> (Volume 5), René Pomeau (ed.), Oxford: Voltaire Foundation.", "Pomeau, René (ed)., 1985–1994, <em>Voltaire en son temps</em>, 5 vols., Oxford: Voltaire Foundation.", "Popkin, Richard Henry, 1979, <em>The History of Scepticism from Erasmus to Spinoza</em>, Berkeley: University of California Press.", "Proust, Jacques, 1962, <em>Diderot et l’Encyclopédie</em>, Paris: Slatkine.", "Rasmussen, Dennis Carl, 2014, <em>The pragmatic enlightenment: recovering the liberalism of Hume, Smith, Montesquieu, and Voltaire</em>, Cambridge: Cambridge University Press.", "Rousseau, André Michel, 1976, <em>L’Angleterre et Voltaire (1718–1789)</em>, Oxford: Voltaire Foundation.", "Saigey, Émile, 1873, <em>Les sciences au XVIIIe siècle: la physique de Voltaire</em>, Paris: G. Baillière.", "Schlereth, Thomas J., 1977, <em>The cosmopolitan ideal in Enlightenment thought, its form and function in the ideas of Franklin, Hume, and Voltaire, 1694–1790</em>, South Bend, IN: University of Notre Dame Press.", "Shank, J.B., 2008, <em>The Newton Wars and the Beginning of the French Enlightenment</em>, Chicago: University of Chicago Press.", "Sharpe, Matthew, 2015, “On a Neglected Argument in French Philosophy: Sceptical Humanism in Montaigne, Voltaire and Camus”, <em>Critical Horizons: A Journal of Philosophy and Social Theory</em>, 16(1): 1–26.", "Spink, John Stephenson, 1960, <em>French Free-thought from Gassendi to Voltaire</em>, London: University of London, Athlone Press.", "Terrall, Mary, 2002, <em>The Man Who Flattened the Earth: Maupertuis and the Sciences in the Enlightenment</em>, Chicago: University of Chicago Press.", "Tlili, Mahbouba Saï, 2009, <em>Voltaire et l’Islam</em> Tunis: Arabesques.", "Torrey, Norman L., 1930, <em>Voltaire and the English Deists</em>, New Haven: Yale University Press, 2<sup>nd</sup> edition, Hamden, CT: Archon Books, 1967.", "–––,1938, <em>The Spirit of Voltaire</em>, New York: Russell and Russell, 2<sup>nd</sup> edition, 1968.", "Undank, Jack, 1989, “Portrait of the Philosopher as Tramp”, in <em>A New History of French Literature</em>, Dennis Hollier (ed.), Cambridge: Harvard University Press, 1989, pp. 421–428.", "Vaillot, René, 1988, <em>Avec madame Du Châtelet, 1734–1749</em>, <em>Voltaire en son temps</em> (Volume 2), René Pomeau (ed.), Oxford: Voltaire Foundation.", "Van Kley, Dale, 1975, <em>The Jansenists and the Expulsion of the Jesuits in France, 1757–1767</em>, New Haven: Yale University Press.", "Vercruysse, Jeroom, 1966, <em>Voltaire et la Holland, </em> Genève: Institut et Musée Voltaire.", "Vernière, Paul, 1954, <em>Spinoza et la pensée française avant la Révolution</em>, Paris: Presses Universitaires de France.", "Wade, Ira Owen, 1938, <em>The Clandestine Organization and Diffusion of Philosophic Ideas in France from 1700 to 1750</em>, Princeton: Princeton University Press.", "–––, 1941, <em>Voltaire and Madame du Châtelet: An Essay on the Intellectual Activity at Cirey</em>, Princeton: Princeton University Press.", "–––, 1947, <em>Studies on Voltaire with Some Unpublished Papers of Mme. du Châtelet</em>, Princeton: Princeton University Press.", "–––, 1969, <em>The Intellectual Devevelopment of Voltaire</em>, Princeton: Princeton University Press.", "Zinsser, Judith, 2006, <em>La Dame d’Esprit: A Biography of the Marquise du Châtelet</em>, New York: Viking.", "Zinsser, Judith and Hayes, Julie (eds.), 2006, <em>Emilie du Châtelet: Rewriting Enlightenment Philosophy and Science</em>, Oxford: Voltaire Foundation.\n</ul>\n</div>"]}, "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriLit\">Primary Literature</a></h3>\n<p>Because of Voltaire’s celebrity, efforts to collect and canonize his writings began immediately after his death, and still continue today. The result has been the production of three major collections of his writings including his vast correspondence, the last unfinished. Together these constitute the authoritative corpus of Voltaire’s written work.</p>\n<ul>\n<li><em>Oeuvres complètes de Voltaire</em>, edited by A. Beuchot. 72 vols. Paris: Lefevre, 1829–1840.</li>\n<li><em>Oeuvres complètes de Voltaire</em>, edited by L.E.D. Moland and G. Bengesco. 52 vols. Paris: Garnier Frères, 1877–1885.</li>\n<li><em>Oeuvres complètes de Voltaire</em>, edited by Theodore Besterman. 135 vols. (projected) Geneva, Banbury, and Oxford: Voltaire Foundation, 1968–.</li>\n</ul>\n<h3><a name=\"PriLitTra\">Primary Literature in Translation</a></h3>\n<h4>Collections of Writings</h4>\n<ul>\n<li><em>The Works of Voltaire: A Contemporary Version</em>, William F. Fleming (ed. and tr.), 21 vols., New York: E.R. Du Mont, 1901. [Complete edition available at the <a href=\"http://oll.libertyfund.org/index.php?option=com_staticxt&amp;staticfile=show.php&amp;title=351\" target=\"other\">Online Library of Liberty</a>]</li>\n<li><em>The Portable Voltaire</em>, Ben Ray Redman (ed.), New York: Penguin Books, 1977.</li>\n<li><em>Selected Works of Voltaire</em>, Joseph McCabe (ed.), London: Watts, 2007.</li>\n<li><em>Shorter Writings of Voltaire</em>, J.I. Rodale (ed.), New York: A.S. Barnes, 1960.</li>\n<li><em>Voltaire in his Letters, Being a Selection of his Correspondence</em>, S.G. Tallentyre (tr.), Honolulu, HI: University Press of the Pacific, 2004.</li>\n<li><em>Voltaire on Religion: Selected Writings</em>, Kenneth W. Applegate (ed.), New York: F. Ungar, 1974.</li>\n<li><em>Voltaire: Selected Writings</em>, Christopher Thacker (ed.), London: Dent, 1995.</li>\n<li><em>Voltaire: Selections</em>, Paul Edwards (ed.), New York: Macmillan, 1989.</li>\n</ul>\n<h5>Theater</h5>\n<ul>\n<li>Translations of Voltaire’s major plays are found in: <em>The Works of Voltaire: A Contemporary Version</em>, William F. Fleming (ed. and tr.), New York: E.R. Du Mont, 1901. [Complete edition available at the <a href=\"http://oll.libertyfund.org/index.php?option=com_staticxt&amp;staticfile=show.php&amp;title=351\" target=\"other\">Online Library of Liberty</a>]</li>\n<li><em>Seven Plays (Mérope (1737), Olympia (1761), Alzire (1734), Orestes (1749), Oedipus (1718), Zaire, Caesar)</em>, William Fleming (tr.), New York: Howard Fertig, 1988.</li>\n</ul>\n<h5>History</h5>\n<ul>\n<li><em>The Age of Louis XIV (1733) and other Selected Writings</em>, J.H. Brumfitt (ed.), New York: Twayne, 1963.</li>\n<li><em>The Age of Louis XIV (1733)</em>, Martyn P. Pollack (tr.), London and New York: Dutton, 1978.</li>\n<li><em>History of Charles XII, King of Sweden (1727)</em>, Honolulu, HI: University Press of the Pacific, 2002.</li>\n<li><em>History of Charles XII, King of Sweden (1727)</em>, Antonia White and Ragnhild Marie Hatton (eds.), New York: Barnes &amp; Noble Books, 1993.</li>\n<li><em>The Philosophy of History (1764)</em>, New York: The Philosophical Library, 1965.</li>\n</ul>\n<h5>Essays, Letters, and Stories</h5>\n<ul>\n<li><em>The Complete Tales of Voltaire</em>, William Walton (tr.), 3 vols., New York: Howard Fertig, 1990.\n\n\t<ul>\n<li>Vol. 1: The Huron (1771), The History of Jenni (1774), The One-eyed Street Porter, Cosi-sancta (1715), An Incident of Memory (1773), The Travels of Reason (1774), The Man with Forty Crowns (1768), Timon (1755), The King of Boutan (1761), and The City of Cashmere (1760).</li>\n<li>Vol. 2: The Letters of Amabed (1769), The Blind Judges of Colors (1766), The Princess of Babylon (1768), The Ears of Lord Chesterfield and Chaplain Goudman (1775), Story of a Good Brahman (1759), An Indian Adventure (1764), and Zadig, or, Destiny (1757).</li>\n<li>Vol. 3: Micromegas (1738), Candide, or Optimism (1758), The World as it Goes (1750), The White and the Black (1764), Jeannot and Colin (1764), The Travels of Scarmentado (1756), The White Bull (1772), Memnon (1750), Plato’s Dream (1737), Bababec and the Fakirs (1750), and The Two Consoled Ones (1756).</li>\n</ul>\n</li>\n<li><em>The English Essays of 1727</em>, David Williams and Richard Walker (eds.), Oxford: Voltaire Foundation, 1996.</li>\n<li><em>Epistle of M. Voltaire to the King of Prussia (1738)</em>, Glasgow, 1967.</li>\n<li><em>The History of the Travels of Scarmentado (1756)</em>, Glasgow: The College Press, 1969.</li>\n<li><em>Micromégas and other Short Fictions</em> (1738), Theo Cuffe and Haydn Mason (eds.), London and New York: Penguin Books, 2002.</li>\n<li><em>The Princess of Babylon (1768)</em>, London: Signet Books, 1969.</li>\n<li><em>The Virgin of Orleans, or Joan of Arc (1755)</em>, Howard Nelson (tr.), Denver: A. Swallow, 1965.</li>\n<li><em>Voltaire. Essay on Milton (1727)</em>, Cambridge: Cambridge University Press, 1954.</li>\n<li><em>Voltaire’s Romances</em>, New York: P. Eckler, 1986.</li>\n<li><em>Zadig, or L’Ingénu</em> (1757), London: Penguin Books, 1984.</li>\n<li><em>Zadig, or the Book of Fate (1757)</em>, New York: Garland, 1974.</li>\n<li><em>Zadig, or The Book of Fate an Oriental History (1757)</em>, Woodbridge, CT: Research Publications, 1982.</li>\n</ul>\n<h5>Politics</h5>\n<ul>\n<li><em>The Calas Affair: A Treatise on Tolerance (1762)</em>, Brian Masters (ed.), London: The Folio Society, 1994.</li>\n<li><em>The Sermon of the Fifty (1759)</em>, J.A.R. Séguin (ed.), Jersey City, NJ: R. Paxton, 1963.</li>\n<li><em>A Treatise on Toleration and Other Essays</em>, Joseph McCabe (ed.), Amherst, NY: Prometheus Books, 1994.</li>\n<li><em>A Treatise on Tolerance and other Writings</em>, edited by Brian Masters, Cambridge and New York: Cambridge University Press, 1994</li>\n<li><em>Voltaire. Political Writings</em>, edited by David Williams, Cambridge and New York: Cambridge University Press, 1994</li>\n</ul>\n<h5>Editions of Major Individual Works</h5>\n<ul>\n<li><em>The Elements of Sir Isaac Newton’s Philosophy</em> (1738; 2nd expanded edition, 1745)\n\n\t<ul>\n<li>Translated John Hanna. London: Cass, 1967.</li>\n<li>Birmingham, AL: Gryphon Editions, 1991.</li>\n</ul>\n</li>\n<li><em>Philosophical Dictionary (1752)</em>\n<ul>\n<li>Edited by Theodore Besterman. London: Penguin Books, 2002.</li>\n<li>Translated by Peter Gay. New York: Basic Books, 1962.</li>\n<li><em>Philosophical Dictionary: A Compendium</em>, Wade Baskin (ed.), New York: Philosophical Library, 1961.</li>\n<li><em>Philosophical Dictionary: Selections</em>, Chicago: The Great Books Foundation, 1965.</li>\n</ul>\n</li>\n<li><em>Philosophical Letters (Letters on the English Nation, Letters on England) (1734)</em>\n<ul>\n<li>John Leigh and Prudence L. Steiner (ed.), Indianapolis, IN: Hackett, 2007.</li>\n<li>Leonard Tancock (ed.), London and New York: Penguin Books, 2003.</li>\n<li>Ernest Dilworth (ed.), Mineola, NY: Dover, 2003.</li>\n<li>Nicholas Cronk (ed.), New York: Oxford University Press, 1994.</li>\n<li>F.A. Taylor (ed.), Oxford: Basil Blackwell, 1946.</li>\n<li>Harvard Classics, Vol. 34, Part 2. [<a href=\"http://bartleby.com/34/2/\" target=\"other\">Available online from Bartleby.com</a>]</li>\n</ul>\n</li>\n<li><em>Voltaire’s Letters on the Quakers (1727)</em>, Philadelphia: William H. Allen, 1953.</li>\n<li><em>Candide, or Optimism (1758)</em>. Hundreds of English editions of this text have been published, so this list is restricted to the most important scholarly editions published since 1960.\n\t<ul>\n<li>C.H.R. Niven (ed.), London: Longman, 1980.</li>\n<li><em>Candide and other Writings</em>, Haskell M. Block (ed.), New York: Modern Library, 1985.</li>\n<li>Richard Aldington, Ernest Dilworth, and others (eds.), New York: Modern Library, 1992.</li>\n<li>Shane Weller (ed.), New York: Dover, 1993.</li>\n<li><em>Candide: A Dual Language Book</em>, New York: Barnes &amp; Noble Books, 1993.</li>\n<li>Robert Martin Adams (ed.), New York: W.W. Norton, 1996.</li>\n<li>Electronic Scholarly Publishing Project, 1998. [Available online at <a href=\"http://www.esp.org/books/voltaire/candide.pdf\" target=\"other\">Electronic Scholarly Publishing Project</a>]</li>\n<li>Daniel Gordon (ed.), Boston: Bedford/St. Martin’s, 1999.</li>\n<li><em>Candide and Related Texts</em>, David Wooton (ed.), Indianapolis, IN: Hackett, 2000.</li>\n<li>Lowell Bair (ed.), New York: Bantam Books, 2003.</li>\n<li><em>Candide &amp; Zadig</em>, Lester G. Crocker (ed.), New York: Pocket Books, 2005.</li>\n<li>Raffael Burton (ed.), New Haven: Yale University Press, 2007.</li>\n<li>Theo Cuffe (ed.), London and New York: Penguin Books, 2007.</li>\n<li><em>Candide and other Stories</em>, Roger Pearson (ed.), Oxford: Oxford University Press, 2008.</li>\n<li><em>Candide, Zadig, and Selected Stories</em>, Donald Frame (tr. and ed.), New York: Signet Classic, 2009.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<p>The scholarly literature on Voltaire is vast, and growing larger every day. The summary here, therefore, will be largely restricted to scholarly books, with only a few articles of singular import listed. The Voltaire Foundation’s series <em>Studies on Voltaire and the Eighteenth Century</em> changed its name in 2013 to <em>Oxford University Studies on Enlightenment</em>. The original series published over 450 volumes, many related to Voltaire, and while the new title reflects a change toward a broader publishing agenda, it remains, along with <em>Cahier Voltaire</em> published by La Fondation Voltaire à Ferney, the best periodical source for new scholarship on Voltaire.</p>\n<ul class=\"hanging\">\n<li>Aldridge, Alfred Owen, 1975, <em>Voltaire and the Century of Light</em>, Princeton: Princeton University Press.</li>\n<li>Badinter, Elizabeth, 1983, <em>Émilie, Émilie, l’ambition féminine au XVIIIe siècle</em>, Paris: Flammarion.</li>\n<li>–––, 1999–2002, <em>Les Passions intellectuelles</em>, 2 volumes, Paris: Fayard.</li>\n<li>Barber, W.H., 1955, <em>Leibniz in France from Arnauld to Voltaire: A Study in French Reactions to Leibnizianism 1670–1760</em>, Oxford: Clarendon Press.</li>\n<li>Barrell, Rex A., 1988, <em>Bolingbroke and France</em>, Lanham, MD: University Press of America.</li>\n<li>Besterman, Theodore, 1969, <em>Voltaire</em>, New York: Harcourt, Brace, &amp; World.</li>\n<li>Bird, Stephen, 2000, <em>Reinventing Voltaire: The Politics of Commemoration in Nineteenth-century France</em>, Oxford: Oxford University Studies on Enlightenment.</li>\n<li>Brooks, Richard A., 1964, <em>Voltaire and Leibniz</em>, Geneva: Droz.</li>\n<li>Brown, Harcourt, 1947, <em>Voltaire and the Royal Society of London</em>, Toronto: University of Toronto Quarterly.</li>\n<li>Brumfitt, J.H., 1970, <em>Voltaire: historian</em>, London: Oxford University Press.</li>\n<li>–––, 1973, <em>The French Enlightenment</em>, Cambridge: Schenkman Pub. Co.</li>\n<li>Brunel, Lucien, 1967, <em>Les Philosophes et l’académie française au dix-huitième siècle</em>, Genève: Slatkine Reprints.</li>\n<li>Brunet, Pierre, 1931, <em>L’introduction des théories de Newton en France au XVIIIe siècle</em>, Paris: A. Blanchard.</li>\n<li>Collins, J. Churton, 1908, <em>Voltaire, Montesquieu, and Rousseau in England</em>, London: E. Nash.</li>\n<li>Conlon, Pierre M., 1961, <em>Voltaire’s literary career from 1728 to 1750</em>, Genève: Institut et Musée Voltaire.</li>\n<li>Cottret, Bernard, 1992, <em>Bolingbroke: exil et écriture au siècle des Lumières</em>, Paris: Klincksieck.</li>\n<li>Cronk, Nicolas, 2009, <em>The Cambridge Companion to Voltaire</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2014, <em>Voltaire: a very short introduction</em>, Oxford: The Voltaire Foundation.</li>\n<li>Darnton, Robert, 1979, <em>The Business of Enlightenment: The Publishing History of the Encyclopédie</em>, 1775–1800, Cambridge: Harvard University Press.</li>\n<li>–––, 1982, <em>The Literary Underground of the Old Regime</em>, Cambridge: Harvard University Press.</li>\n<li>Dickinson, H.T., 1970, <em>Bolingbroke</em>, London: Constable.</li>\n<li>Dieckmann, Herbert, 1943, <em>Le Philosophe: Texts and Interpretations</em>, (Washington University Studies, New Series, Language and Literature, no. 18), St. Louis: Washington University Press.</li>\n<li>Duchet, Michèle, 1971, <em>Anthropologie et histoire au siècle des lumières Buffon, Voltaire, Rousseau, Helvetius, Diderot</em>, Paris: F. Maspero.</li>\n<li>Ehrman, Esther, 1986, <em>Mme. du Châtelet: Scientist, Philosopher and Feminist of the Enlightenment</em>, Leamington [Spa]: Berg.</li>\n<li>Gandt, François de, 2001, <em>Cirey dans la vie intellectuelle: la réception de Newton en France</em>, Oxford: Voltaire Foundation.</li>\n<li>Gardiner Janik, Linda, 1982, “Searching for the Metaphysics of Science: The Structure and Composition of Mme. Du Châtelet’s <em>Institutions de physiques</em>, 1737–1740”, <em>Studies on Voltaire and the Eighteenth Century</em>, 201: 85–113.</li>\n<li>Gay, Peter, 1954, <em>The Party of Humanity: Essays in the French Enlightenment</em>, New York: Knopf.</li>\n<li>Gay, Peter, 1969, <em>The Enlightenment: An Interpretation</em> (Volume 1: <em>The Science of Freedom</em>), New York: Knopf.</li>\n<li>–––, 1977, <em>The Enlightenment: An Interpretation</em> (Volume 2: <em>The Rise of Modern Paganism</em>), New York: Knopf 1977.</li>\n<li>–––, 1988, <em>Voltaire’s Politics: The Poet as Realist</em>, New Haven: Yale University Press.</li>\n<li>Guerlac, Henry, 1981,<em>Newton on the Continent</em>, Ithaca.</li>\n<li>Gurrado, Antonio, 2013, <em>Voltaire cattolico</em>, Torino: Lindau.</li>\n<li>Hagengruber, Ruth (ed.), 2011, <em> Emilie du Châtelet between Leibniz and Newton</em>, Dordrecht: Springer.</li>\n<li>Ḥadīd, Javādī, 2012, <em>Voltaire et l’Islam</em>, Ozoir la Ferriere : Albouraq.</li>\n<li>Hellman, Lilian, 1980, Dorothy Parker, John La Touche, Richard Wilbur, and Leonard Bernstein, 1956–1957, <em>Candide, An Operetta in Two Acts</em>, New York: Jaini Publications.</li>\n<li>Hutchison, Ross, 1991, <em>Locke in France: 1688–1734</em>, Oxford: Voltaire Foundation.</li>\n<li>Iltis, Carolyn, 1977, “Madame du Châtelet’s metaphysics and mechanics”, <em>Studies in the History and Philosophy of Science</em>, 8: 29–48.</li>\n<li>Israel, Jonathan, 2000, <em>The Radical Enlightenment: Philosophy and the Making of Modernity, 1650–1750</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2006, <em>Enlightenment Contested: Philosophy, Modernity, and the Emancipation of Man 1670–1752</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2009, <em>A Revolution of the Mind: Radical Enlightenment and the Intellectual Origins of Modern Democracy</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2011, <em>Democratic Enlightenment: Philosophy, Revolution, and Human Rights 1750–1790</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2014, <em>Revolutionary Ideas: An Intellectual History of the French Revolution from The Rights of Man to Robespierre</em>, Oxford: Oxford University Press.</li>\n<li>Jacob, Margaret, 1981, <em>The Radical Enlightenment: Pantheists, Freemasons, and Republicans</em>, London: Cornerstone Book Publishers.</li>\n<li>Kramnick, Isaac, 1968, <em>Bolingbroke and His Circle: The Politics of Nostalgia in the Age of Walpole</em>, Cambridge: Harvard University Press.</li>\n<li>Lanson, Gustave, 1894, <em>Histoire de la littérature française</em>, Paris: Hachette.</li>\n<li>Lanson, Gustave, 1906, <em>Voltaire</em>, Paris: Hachette.</li>\n<li>Libby, Margaret Sherwood, 1935, <em>The Attitude of Voltaire to Magic and the Sciences</em>, New York: Columbia University Press, 1935.</li>\n<li>Lilti, Antoine, 2005, <em>Le monde des salons. Sociabilité et mondanité à Paris au XVIIIe siècle</em>, Paris: Fayard.</li>\n<li>Mason, Haydn Trevor, 1963, <em>Pierre Bayle and Voltaire</em>, London: Oxford University Press.</li>\n<li>–––, 1975, <em>Voltaire</em>, New York: St. Martin’s.</li>\n<li>Masseau, Didier, 1994, <em>L’Invention de l’intellectual dans l’Europe du XVIIIe siècle</em>, Paris: Presses Universitaires de France.</li>\n<li>Mattei, Silvia, 2010, <em>Voltaire et les voyages de la raison</em>, Paris: Harmattan.</li>\n<li>Maurois, André, 1935, <em>Voltaire</em>, Paris: Gallimard.</li>\n<li>Mauzi, Robert, 1960, <em>L’idée du bonheur dans la litterature et la pensée francaises au XVIIIe siècle</em>, Paris: A. Colin.</li>\n<li>McKenna, Antony, 1994, <em>Écraser l’infame, 1759–1770</em>, <em>Voltaire en son temps</em> (Volume 4), René Pomeau (ed.), Oxford: Voltaire Foundation.</li>\n<li>McMahon, Darrin M., 2001, <em>Enemies of the Enlightenment: The French Counter-enlightenment and the Making of Modernity</em>, New York: Oxford University Press.</li>\n<li>McNutt, Jennifer Powell, 2013, <em>Calvin meets Voltaire: the clergy of Geneva in the age of enlightenment, 1685–1798</em>, Burlington: Ashgate.</li>\n<li>Melton, James Van Horn, 2001, <em>The Rise of the Public in Enlightenment Europe</em>, Cambridge: Cambridge University Press.</li>\n<li>Méricam-Bourdet, Myrtille, 2012, <em>Voltaire et l’écriture de l’histoire: un enjeu politique</em>, Oxford: Voltaire Foundation.</li>\n<li>Mervaud, Christiane, 1991, <em>De la cour au jardin, 1750–1759</em>, <em>Voltaire en son temps</em> (Volume 3), René Pomeau (ed.), Oxford: Voltaire Foundation.</li>\n<li>Mitchell, Harvey, 2104, <em>Voltaire’s Jews and modern Jewish identity: rethinking the Enlightenment</em>, London: Routledge.</li>\n<li>Morize, André, 1909, <em>L’Apologie du luxe au XVIIIe Siècle: “Le Mondain” et ses Sources</em>, Paris: H. Didier.</li>\n<li>Neiertz, Patrick, 2012, <em>Voltaire et l’économie politique</em>, Oxford: Voltaire Foundation.</li>\n<li>Northeast, Catherine M., 1991, <em>The Parisian Jesuits and the Enlightenment, 1700–1762</em>, Oxford: Voltaire Foundation.</li>\n<li>Orieux, Jean, 1966, <em>Voltaire, ou la Royauté de l’esprit</em>, Paris: Flammarion.</li>\n<li>Palmer, Robert R., 1939, <em>Catholics and Unbelievers in 18<sup>th</sup> Century France</em>, Princeton: Princeton University Press.</li>\n<li>Pappas, John N., 1957, <em>Berthier’s Journal de Trevoux and the Philosophes</em> (Studies on Voltaire and the Eighteenth Century, Volume 3), Geneva: Institut and Musée Voltaire.</li>\n<li>–––, 1962, <em>Voltaire and d’Alembert</em>, Bloomington: Indiana University Press.</li>\n<li>Pearson, Roger, 1993, <em>The Fables of Reason: A Study of Voltaire’s “Contes philosophiques”</em>, Oxford: Clarendon Press.</li>\n<li>–––, 2005, <em>Voltaire Almighty: A Life in Pursuit of Freedom</em>, London: Bloomsbury Publishing.</li>\n<li>Perry, Norma, 1975, <em>Sir Everard Fawkener, friend and correspondent of Voltaire</em>, Oxford: Voltaire Foundation.</li>\n<li>Pettit, Alexander, 1997, <em>Illusory Consensus: Bolingbroke and the Polemical Responses to Walpole, 1730–1737</em>, Newark: University of Delaware Press.</li>\n<li>Pomeau, René, 1969, <em>La réligion de Voltaire</em>, Paris: Nizet.</li>\n<li>–––, 1985, <em>D’Arouet à Voltaire, 1694–1734</em>, <em>Voltaire en son temps</em> (Volume 1), René Pomeau (ed.), Oxford: Voltaire Foundation.</li>\n<li>–––, 1994, <em>On a voulu l’enterrer, 1770–1791</em>, <em>Voltaire en son temps</em> (Volume 5), René Pomeau (ed.), Oxford: Voltaire Foundation.</li>\n<li>Pomeau, René (ed)., 1985–1994, <em>Voltaire en son temps</em>, 5 vols., Oxford: Voltaire Foundation.</li>\n<li>Popkin, Richard Henry, 1979, <em>The History of Scepticism from Erasmus to Spinoza</em>, Berkeley: University of California Press.</li>\n<li>Proust, Jacques, 1962, <em>Diderot et l’Encyclopédie</em>, Paris: Slatkine.</li>\n<li>Rasmussen, Dennis Carl, 2014, <em>The pragmatic enlightenment: recovering the liberalism of Hume, Smith, Montesquieu, and Voltaire</em>, Cambridge: Cambridge University Press.</li>\n<li>Rousseau, André Michel, 1976, <em>L’Angleterre et Voltaire (1718–1789)</em>, Oxford: Voltaire Foundation.</li>\n<li>Saigey, Émile, 1873, <em>Les sciences au XVIIIe siècle: la physique de Voltaire</em>, Paris: G. Baillière.</li>\n<li>Schlereth, Thomas J., 1977, <em>The cosmopolitan ideal in Enlightenment thought, its form and function in the ideas of Franklin, Hume, and Voltaire, 1694–1790</em>, South Bend, IN: University of Notre Dame Press.</li>\n<li>Shank, J.B., 2008, <em>The Newton Wars and the Beginning of the French Enlightenment</em>, Chicago: University of Chicago Press.</li>\n<li>Sharpe, Matthew, 2015, “On a Neglected Argument in French Philosophy: Sceptical Humanism in Montaigne, Voltaire and Camus”, <em>Critical Horizons: A Journal of Philosophy and Social Theory</em>, 16(1): 1–26.</li>\n<li>Spink, John Stephenson, 1960, <em>French Free-thought from Gassendi to Voltaire</em>, London: University of London, Athlone Press.</li>\n<li>Terrall, Mary, 2002, <em>The Man Who Flattened the Earth: Maupertuis and the Sciences in the Enlightenment</em>, Chicago: University of Chicago Press.</li>\n<li>Tlili, Mahbouba Saï, 2009, <em>Voltaire et l’Islam</em> Tunis: Arabesques.</li>\n<li>Torrey, Norman L., 1930, <em>Voltaire and the English Deists</em>, New Haven: Yale University Press, 2<sup>nd</sup> edition, Hamden, CT: Archon Books, 1967.</li>\n<li>–––,1938, <em>The Spirit of Voltaire</em>, New York: Russell and Russell, 2<sup>nd</sup> edition, 1968.</li>\n<li>Undank, Jack, 1989, “Portrait of the Philosopher as Tramp”, in <em>A New History of French Literature</em>, Dennis Hollier (ed.), Cambridge: Harvard University Press, 1989, pp. 421–428.</li>\n<li>Vaillot, René, 1988, <em>Avec madame Du Châtelet, 1734–1749</em>, <em>Voltaire en son temps</em> (Volume 2), René Pomeau (ed.), Oxford: Voltaire Foundation.</li>\n<li>Van Kley, Dale, 1975, <em>The Jansenists and the Expulsion of the Jesuits in France, 1757–1767</em>, New Haven: Yale University Press.</li>\n<li>Vercruysse, Jeroom, 1966, <em>Voltaire et la Holland, </em> Genève: Institut et Musée Voltaire.</li>\n<li>Vernière, Paul, 1954, <em>Spinoza et la pensée française avant la Révolution</em>, Paris: Presses Universitaires de France.</li>\n<li>Wade, Ira Owen, 1938, <em>The Clandestine Organization and Diffusion of Philosophic Ideas in France from 1700 to 1750</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1941, <em>Voltaire and Madame du Châtelet: An Essay on the Intellectual Activity at Cirey</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1947, <em>Studies on Voltaire with Some Unpublished Papers of Mme. du Châtelet</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1969, <em>The Intellectual Devevelopment of Voltaire</em>, Princeton: Princeton University Press.</li>\n<li>Zinsser, Judith, 2006, <em>La Dame d’Esprit: A Biography of the Marquise du Châtelet</em>, New York: Viking.</li>\n<li>Zinsser, Judith and Hayes, Julie (eds.), 2006, <em>Emilie du Châtelet: Rewriting Enlightenment Philosophy and Science</em>, Oxford: Voltaire Foundation.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Clarke, Samuel", "Descartes, René", "hedonism", "Hume, David: Newtonianism and Anti-Newtonianism", "Leibniz, Gottfried Wilhelm", "liberty: positive and negative", "Newton, Isaac", "skepticism"], "entry_link": [{"../clarke/": "Clarke, Samuel"}, {"../descartes/": "Descartes, René"}, {"../hedonism/": "hedonism"}, {"../hume-newton/": "Hume, David: Newtonianism and Anti-Newtonianism"}, {"../leibniz/": "Leibniz, Gottfried Wilhelm"}, {"../liberty-positive-negative/": "liberty: positive and negative"}, {"../newton/": "Newton, Isaac"}, {"../skepticism/": "skepticism"}]}, "academic_tools": {"listed_text": ["<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=voltaire\" target=\"other\">How to cite this entry</a>.", "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/voltaire/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=voltaire&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"https://philpapers.org/sep/voltaire/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=voltaire": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/voltaire/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=voltaire&redirect=True": "Look up topics and thinkers related to this entry"}, {"https://philpapers.org/sep/voltaire/": "Enhanced bibliography for this entry"}, {"https://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": ["<a href=\"https://web.archive.org/web/20210815130009/http://www.visitvoltaire.com/\" target=\"other\">Château de Cirey</a>, (Champagne, France), Residence of Voltaire.", "<a href=\"http://www.ville-ge.ch/bge/imv/index.html\" target=\"other\">Institut et Musée Voltaire</a>, Geneva.", "<a href=\"http://societe-voltaire.org/\" target=\"other\">La Société Voltaire</a>.", "<a href=\"http://www.voltaire.ox.ac.uk/\">The Voltaire Foundation</a>, Oxford University.", "<a href=\"https://fivebooks.com/best-books/voltaire-nicholas-cronk/\" target=\"other\">The Best Voltaire Books</a>, recommended by Nicholas Cronk."], "listed_links": [{"https://web.archive.org/web/20210815130009/http://www.visitvoltaire.com/": "Château de Cirey"}, {"http://www.ville-ge.ch/bge/imv/index.html": "Institut et Musée Voltaire"}, {"http://societe-voltaire.org/": "La Société Voltaire"}, {"http://www.voltaire.ox.ac.uk/": "The Voltaire Foundation"}, {"https://fivebooks.com/best-books/voltaire-nicholas-cronk/": "The Best Voltaire Books"}]}, "tokenized_text": ["1", "voltaire", "life", "philosopher", "critic", "public", "activist", "voltaire", "began", "identify", "philosophy", "philosophe", "identity", "middle", "age", "work", "lettres", "philosophiques", "published", "1734", "forty", "year", "old", "key", "turning", "point", "transformation", "date", "voltaire", "life", "way", "pointed", "toward", "philosophical", "destiny", "later", "assume", "early", "orientation", "toward", "literature", "libertine", "sociability", "however", "shaped", "philosophical", "identity", "crucial", "way", "11", "voltaire", "early", "year", "16941726", "françoismarie", "arouet", "born", "1694", "fourth", "five", "child", "welltodo", "public", "official", "well", "bred", "aristocratic", "wife", "fusion", "traditional", "french", "aristocratic", "pedigree", "new", "wealth", "power", "royal", "bureaucratic", "administration", "arouet", "family", "representative", "elite", "society", "france", "reign", "louis", "xiv", "young", "françoismarie", "acquired", "parent", "benefit", "prosperity", "political", "favor", "jesuit", "prestigious", "collège", "louislegrand", "paris", "also", "acquired", "firstclass", "education", "françoismarie", "also", "acquired", "introduction", "modern", "letter", "father", "active", "literary", "culture", "period", "paris", "royal", "court", "versailles", "françois", "senior", "appears", "enjoyed", "company", "men", "letter", "yet", "frustration", "son", "ambition", "become", "writer", "notorious", "early", "youth", "voltaire", "aspired", "emulate", "idol", "molière", "racine", "corneille", "become", "playwright", "yet", "voltaire", "father", "strenuously", "opposed", "idea", "hoping", "install", "son", "instead", "position", "public", "authority", "first", "law", "student", "lawyer", "apprentice", "finally", "secretary", "french", "diplomat", "voltaire", "attempted", "fulfill", "father", "wish", "case", "ended", "abandoning", "post", "sometimes", "amidst", "scandal", "escaping", "burden", "public", "obligation", "voltaire", "would", "retreat", "libertine", "sociability", "paris", "1720s", "culturally", "vibrant", "period", "regency", "government", "reign", "louis", "xiv", "xv", "17151723", "voltaire", "established", "one", "dimension", "identity", "wit", "congeniality", "legendary", "even", "youth", "difficulty", "establishing", "popular", "figure", "regency", "literary", "circle", "also", "learned", "play", "patronage", "game", "important", "writerly", "ambition", "thanks", "therefore", "artfully", "composed", "writing", "couple", "wellmade", "contact", "bon", "mot", "little", "successful", "investing", "especially", "john", "law", "mississippi", "bubble", "fiasco", "voltaire", "able", "establish", "independent", "man", "letter", "paris", "literary", "debut", "occurred", "1718", "publication", "oedipe", "reworking", "ancient", "tragedy", "evoked", "french", "classicism", "racine", "corneille", "play", "first", "performed", "home", "duchesse", "du", "maine", "sceaux", "sign", "voltaire", "quick", "ascent", "pinnacle", "elite", "literary", "society", "published", "title", "page", "also", "announced", "new", "pen", "name", "voltaire", "would", "ever", "deploy", "regency", "voltaire", "circulated", "widely", "elite", "circle", "congregated", "sceaux", "also", "cultivated", "illicit", "libertine", "sociability", "well", "pairing", "uncommon", "time", "voltaire", "intellectual", "work", "1720sa", "mix", "poem", "play", "shifted", "playful", "libertinism", "serious", "classicism", "seemingly", "without", "pauseillustrated", "perfectly", "value", "pleasure", "honnêteté", "good", "taste", "watchword", "cultural", "milieu", "philosophy", "also", "part", "mix", "regency", "young", "voltaire", "especially", "shaped", "contact", "english", "aristocrat", "freethinker", "jacobite", "lord", "bolingbroke", "bolingbroke", "lived", "exile", "france", "regency", "period", "voltaire", "frequent", "visitor", "la", "source", "englishman", "estate", "near", "orléans", "chateau", "served", "reunion", "point", "wide", "range", "intellectual", "many", "believe", "voltaire", "first", "introduced", "natural", "philosophy", "generally", "work", "locke", "english", "newtonian", "specifically", "bolingbroke", "estate", "certainly", "true", "idea", "especially", "deistic", "libertine", "configuration", "heart", "bolingbroke", "identity", "12", "english", "period", "17261729", "yet", "even", "voltaire", "introduced", "english", "philosophy", "way", "influence", "thought", "shaped", "brief", "exile", "england", "172629", "occasion", "departure", "affair", "honor", "powerful", "aristocrat", "duc", "de", "rohan", "accused", "voltaire", "defamation", "face", "charge", "untitled", "writer", "chose", "save", "face", "avoid", "serious", "prosecution", "leaving", "country", "indefinitely", "spring", "1726", "therefore", "voltaire", "left", "paris", "england", "english", "period", "voltaire", "transition", "mature", "philosophe", "identity", "began", "bolingbroke", "whose", "address", "voltaire", "left", "paris", "forwarding", "address", "one", "conduit", "influence", "particular", "voltaire", "met", "bolingbroke", "jonathan", "swift", "alexander", "pope", "john", "gay", "writer", "moment", "beginning", "experiment", "use", "literary", "form", "novel", "theater", "creation", "new", "kind", "critical", "public", "politics", "swift", "gulliver", "travel", "appeared", "month", "voltaire", "arrival", "famous", "exemplar", "new", "fusion", "writing", "political", "criticism", "later", "year", "bolingbroke", "also", "brought", "first", "issue", "craftsman", "political", "journal", "served", "public", "platform", "circle", "tory", "opposition", "whig", "oligarchy", "england", "craftsman", "helped", "create", "english", "political", "journalism", "grand", "style", "next", "three", "year", "voltaire", "moved", "bolingbroke", "circle", "absorbing", "culture", "sharing", "public", "political", "contestation", "percolating", "around", "voltaire", "restrict", "bolingbroke", "circle", "alone", "however", "bolingbroke", "primary", "contact", "england", "merchant", "name", "everard", "fawkener", "fawkener", "introduced", "voltaire", "side", "london", "life", "entirely", "different", "offered", "bolingbroke", "circle", "tory", "intellectual", "included", "whig", "circle", "bolingbroke", "group", "opposed", "also", "included", "figure", "samuel", "clarke", "selfproclaimed", "newtonian", "voltaire", "meet", "newton", "sir", "isaac", "death", "march", "1727", "meet", "sisterlearning", "famous", "myth", "newton", "apple", "voltaire", "would", "play", "major", "role", "making", "famous", "voltaire", "also", "came", "know", "newtonian", "clarke", "circle", "since", "became", "proficient", "enough", "english", "write", "letter", "even", "fiction", "language", "likely", "immersed", "writing", "well", "voltaire", "also", "visited", "holland", "year", "forming", "important", "contact", "dutch", "journalist", "publisher", "meeting", "willem", "gravesande", "dutch", "newtonian", "savant", "given", "activity", "also", "likely", "voltaire", "frequented", "coffeehouse", "london", "even", "firm", "evidence", "survives", "confirming", "would", "surprising", "therefore", "learn", "voltaire", "attended", "newtonian", "public", "lecture", "john", "theophilus", "desaguliers", "one", "rival", "whatever", "precise", "conduit", "encounter", "england", "made", "voltaire", "knowledgeable", "student", "english", "natural", "philosophy", "13", "becoming", "philosophe", "french", "official", "granted", "voltaire", "permission", "reenter", "paris", "1729", "devoid", "pension", "banned", "royal", "court", "versailles", "also", "different", "kind", "writer", "thinker", "doubt", "overly", "grandiose", "say", "lord", "morley", "voltaire", "left", "france", "poet", "returned", "sage", "also", "exaggeration", "say", "transformed", "poet", "philosophe", "england", "one", "two", "side", "voltaire", "intellectual", "identity", "forever", "intertwined", "never", "experienced", "absolute", "transformation", "one", "point", "life", "english", "year", "trigger", "transformation", "return", "france", "voltaire", "worked", "hard", "restore", "source", "financial", "political", "support", "financial", "problem", "easiest", "solve", "1729", "french", "government", "staged", "sort", "lottery", "help", "amortize", "royal", "debt", "friend", "perceived", "opportunity", "investor", "structure", "government", "offering", "dinner", "attended", "voltaire", "formed", "society", "purchase", "share", "voltaire", "participated", "fall", "year", "return", "posted", "made", "fortune", "voltaire", "inheritance", "father", "also", "became", "available", "time", "date", "forward", "voltaire", "never", "struggled", "financially", "result", "insignificant", "development", "since", "voltaire", "financial", "independence", "effectively", "freed", "one", "dimension", "patronage", "system", "necessary", "aspiring", "writer", "intellectual", "period", "particular", "writer", "required", "appeal", "powerful", "financial", "patron", "order", "secure", "livelihood", "made", "possible", "intellectual", "career", "voltaire", "never", "beholden", "imperative", "patronage", "structure", "old", "regime", "france", "provided", "economic", "support", "writer", "however", "restoring", "crédit", "upon", "reputation", "writer", "thinker", "depended", "far", "le", "simple", "gradually", "however", "combination", "artfully", "written", "play", "poem", "essay", "careful", "selfpresentation", "parisian", "society", "voltaire", "began", "regain", "public", "stature", "fall", "1732", "next", "stage", "career", "began", "unfold", "voltaire", "residing", "royal", "court", "versailles", "sign", "reestablishment", "french", "society", "complete", "rehabilitation", "voltaire", "also", "formed", "new", "relationship", "prove", "profoundly", "influential", "subsequent", "decade", "became", "reacquainted", "emilie", "le", "tonnier", "de", "breteuil", "daughter", "one", "earliest", "patron", "married", "1722", "become", "marquise", "du", "châtelet", "emilie", "du", "châtelet", "twentynine", "year", "old", "spring", "1733", "voltaire", "began", "relationship", "also", "uniquely", "accomplished", "woman", "du", "châtelet", "father", "baron", "de", "breteuil", "hosted", "regular", "gathering", "men", "letter", "included", "voltaire", "daughter", "ten", "year", "younger", "voltaire", "shared", "association", "father", "also", "ensured", "emilie", "received", "education", "exceptional", "girl", "time", "studied", "greek", "latin", "trained", "mathematics", "voltaire", "reconnected", "1733", "knowledgeable", "thinker", "right", "even", "intellectual", "career", "would", "include", "original", "treatise", "natural", "philosophy", "complete", "french", "translation", "newton", "principia", "mathematicastill", "complete", "french", "translation", "ever", "publishedhad", "yet", "begun", "intellectual", "talent", "combined", "vivacious", "personality", "drew", "voltaire", "although", "du", "châtelet", "titled", "aristocrat", "married", "important", "military", "officer", "couple", "able", "form", "lasting", "partnership", "interfere", "du", "châtelet", "marriage", "arrangement", "proved", "especially", "beneficial", "voltaire", "scandal", "forced", "flee", "paris", "establish", "permanently", "du", "châtelet", "family", "estate", "cirey", "1734", "arrangement", "began", "1749", "du", "châtelet", "died", "childbirth", "cirey", "home", "along", "site", "intense", "intellectual", "collaboration", "period", "voltaire", "du", "châtelet", "became", "widely", "known", "philosophical", "figure", "intellectual", "history", "1749", "accurately", "described", "history", "couple", "joint", "intellectual", "endeavor", "14", "newton", "war", "17321745", "voltaire", "event", "sent", "fleeing", "cirey", "also", "impetus", "much", "work", "england", "voltaire", "begun", "compose", "set", "letter", "framed", "according", "wellestablished", "genre", "traveler", "reporting", "friend", "back", "home", "foreign", "land", "montesquieu", "1721", "lettres", "persanes", "offered", "set", "fictionalized", "letter", "persian", "allegedly", "traveling", "france", "swift", "1726", "gulliver", "travel", "clear", "influence", "voltaire", "conceived", "work", "unlike", "author", "overtly", "fictionalized", "account", "voltaire", "innovated", "adopting", "journalistic", "stance", "instead", "one", "offered", "reader", "empirically", "recognizable", "account", "several", "aspect", "english", "society", "originally", "titled", "letter", "england", "voltaire", "left", "draft", "text", "london", "publisher", "returning", "home", "1729", "france", "began", "expand", "work", "adding", "letter", "drafted", "england", "focused", "largely", "different", "religious", "sect", "england", "english", "parliament", "several", "new", "letter", "including", "english", "philosophy", "new", "text", "included", "letter", "bacon", "locke", "newton", "detail", "newtonian", "natural", "philosophy", "along", "account", "english", "practice", "inoculation", "smallpox", "also", "acquired", "new", "title", "first", "published", "france", "1734", "lettres", "philosophiques", "appeared", "voltaire", "attempted", "get", "official", "permission", "book", "royal", "censor", "requirement", "france", "time", "publisher", "however", "ultimately", "released", "book", "without", "approval", "without", "voltaire", "permission", "made", "first", "edition", "lettres", "philosophiques", "illicit", "fact", "contributed", "scandal", "triggered", "one", "way", "explains", "furor", "book", "caused", "historian", "fact", "still", "scratch", "head", "trying", "understand", "voltaire", "lettres", "philosophiques", "proved", "controversial", "thing", "clear", "work", "cause", "sensation", "subsequently", "triggered", "rapid", "overwhelming", "response", "part", "french", "authority", "book", "publicly", "burned", "royal", "hangman", "several", "month", "release", "act", "turned", "voltaire", "widely", "known", "intellectual", "outlaw", "executed", "royal", "lettre", "de", "cachet", "would", "sent", "voltaire", "royal", "prison", "bastille", "result", "authorship", "lettres", "philosophiques", "instead", "able", "flee", "du", "châtelet", "cirey", "couple", "used", "sovereignty", "granted", "aristocratic", "title", "create", "safe", "base", "voltaire", "new", "position", "philosophical", "rebel", "writer", "exile", "voltaire", "able", "avoid", "scandal", "triggered", "lettres", "philosophiques", "highly", "likely", "would", "chosen", "yet", "thrust", "upon", "adopted", "identity", "philosophical", "exile", "outlaw", "writer", "conviction", "using", "create", "new", "identity", "one", "far", "reaching", "consequence", "history", "western", "philosophy", "first", "newtonian", "science", "served", "vehicle", "transformation", "decade", "1734", "series", "controversy", "erupted", "especially", "france", "character", "legitimacy", "newtonian", "science", "especially", "theory", "universal", "gravitation", "physic", "gravitational", "attraction", "empty", "space", "voltaire", "positioned", "lettres", "philosophiques", "intervention", "controversy", "drafting", "famous", "widely", "cited", "letter", "used", "opposition", "newton", "descartes", "frame", "set", "fundamental", "difference", "english", "french", "philosophy", "time", "also", "included", "letter", "newtonian", "science", "work", "linking", "claimed", "philosophy", "bacon", "locke", "newton", "english", "philosophical", "complex", "championed", "remedy", "perceived", "error", "illusion", "perpetuated", "french", "rené", "descartes", "nicolas", "malebranche", "voltaire", "invent", "framework", "use", "enflame", "set", "debate", "raging", "debate", "placed", "small", "group", "young", "member", "royal", "academy", "science", "paris", "apparent", "opposition", "older", "established", "member", "bastion", "official", "french", "science", "installed", "cirey", "voltaire", "du", "châtelet", "exploited", "apparent", "division", "engaging", "campaign", "behalf", "newtonianism", "one", "continually", "targeted", "imagined", "monolith", "called", "french", "academic", "cartesianism", "enemy", "name", "newtonianism", "fighting", "centerpiece", "campaign", "voltaire", "éléments", "de", "la", "philosophie", "de", "newton", "first", "published", "1738", "1745", "new", "definitive", "edition", "included", "new", "section", "first", "published", "1740", "devoted", "newton", "metaphysics", "voltaire", "offered", "book", "clear", "accurate", "accessible", "account", "newton", "philosophy", "suitable", "ignorant", "frenchman", "group", "imagined", "large", "also", "conceived", "machine", "de", "guerre", "directed", "cartesian", "establishment", "believed", "holding", "france", "back", "modern", "light", "scientific", "truth", "vociferous", "criticism", "voltaire", "work", "quickly", "erupted", "critic", "emphasizing", "rebellious", "immoral", "proclivity", "others", "focused", "precise", "scientific", "view", "voltaire", "collapsed", "challenge", "singular", "vision", "enemy", "backward", "cartesianism", "fought", "fiercely", "defend", "position", "unprecedented", "culture", "war", "erupted", "france", "centered", "character", "value", "newtonian", "natural", "philosophy", "du", "châtelet", "contributed", "campaign", "writing", "celebratory", "review", "voltaire", "éléments", "journal", "de", "savant", "authoritative", "french", "learned", "periodical", "day", "couple", "also", "added", "scientific", "credibility", "receiving", "separate", "honorable", "mention", "1738", "paris", "academy", "prize", "contest", "nature", "fire", "voltaire", "likewise", "worked", "tirelessly", "rebutting", "critic", "advancing", "position", "pamphlet", "contribution", "learned", "periodical", "1745", "definitive", "edition", "voltaire", "éléments", "published", "tide", "thought", "turning", "way", "1750", "perception", "become", "widespread", "france", "converted", "backward", "erroneous", "cartesianism", "modern", "enlightened", "newtonianism", "thanks", "heroic", "intellectual", "effort", "figure", "like", "voltaire", "15", "french", "newtonian", "enlightenment", "philosophe", "17451755", "apparent", "victory", "newton", "war", "1730s", "1740s", "allowed", "voltaire", "new", "philosophical", "identity", "solidify", "especially", "crucial", "way", "allowed", "voltaire", "outlaw", "status", "never", "fully", "repudiated", "rehabilitated", "public", "mind", "necessary", "heroic", "defense", "philosophical", "truth", "enemy", "error", "prejudice", "perspective", "voltaire", "critical", "stance", "could", "reintegrated", "traditional", "old", "regime", "society", "new", "kind", "legitimate", "intellectual", "martyrdom", "since", "voltaire", "also", "coupled", "explicitly", "philosophical", "writing", "polemic", "1730s", "1740s", "equally", "extensive", "stream", "play", "poem", "story", "narrative", "history", "many", "orthogonal", "tone", "content", "explicit", "campaign", "newton", "war", "voltaire", "able", "reestablish", "old", "identity", "old", "regime", "man", "letter", "despite", "scandal", "year", "1745", "voltaire", "named", "royal", "historiographer", "france", "title", "bestowed", "upon", "result", "history", "louis", "xiv", "swedish", "king", "charles", "ii", "royal", "office", "also", "triggered", "writing", "arguably", "voltaire", "widely", "read", "influential", "book", "least", "eighteenth", "century", "essais", "sur", "le", "moeurs", "et", "l", "esprit", "de", "nation", "1751", "pioneering", "work", "universal", "history", "position", "also", "legitimated", "officially", "sanctioned", "savant", "1749", "death", "du", "châtelet", "voltaire", "reinforced", "impression", "accepting", "invitation", "join", "court", "young", "frederick", "great", "prussia", "move", "assimilated", "power", "structure", "old", "regime", "society", "assimilationist", "trajectory", "continued", "remainder", "voltaire", "life", "legacy", "history", "western", "philosophy", "might", "great", "yet", "1750s", "set", "new", "development", "pulled", "voltaire", "back", "toward", "radical", "controversial", "identity", "allowed", "rekindle", "critical", "philosophe", "persona", "innovated", "newton", "war", "first", "step", "direction", "involved", "dispute", "onetime", "colleague", "ally", "pierrelouis", "moreau", "de", "maupertuis", "maupertuis", "preceded", "voltaire", "first", "aggressive", "advocate", "newtonian", "science", "france", "voltaire", "preparing", "newtonian", "intervention", "lettres", "philosophiques", "1732", "consulted", "maupertuis", "date", "pensioner", "french", "royal", "academy", "science", "largely", "around", "maupertuis", "young", "cohort", "french", "academic", "newtonian", "gathered", "newton", "war", "1730s", "40", "voltaire", "fighting", "public", "campaign", "behalf", "cause", "period", "two", "men", "became", "visible", "face", "french", "newtonianism", "even", "never", "really", "worked", "team", "effort", "like", "voltaire", "maupertuis", "also", "shared", "relationship", "emilie", "du", "châtelet", "one", "included", "mathematical", "collaboration", "far", "exceeded", "voltaire", "capacity", "maupertuis", "also", "occasional", "guest", "cirey", "correspondent", "du", "châtelet", "voltaire", "throughout", "year", "1745", "maupertuis", "surprised", "french", "society", "moving", "berlin", "accept", "directorship", "frederick", "great", "newly", "reformed", "berlin", "academy", "science", "maupertuis", "thought", "time", "departure", "prussia", "turning", "toward", "metaphysics", "rationalist", "epistemology", "leibniz", "solution", "certain", "question", "natural", "philosophy", "du", "châtelet", "also", "shared", "tendency", "producing", "1740", "institution", "de", "physique", "systematic", "attempt", "wed", "newtonian", "mechanic", "leibnizian", "rationalism", "metaphysics", "voltaire", "found", "leibnizian", "turn", "dyspeptic", "began", "craft", "antileibnizian", "discourse", "1740s", "became", "bulwark", "brand", "newtonianism", "placed", "opposition", "du", "châtelet", "even", "intellectual", "rift", "way", "soured", "relationship", "yet", "died", "1749", "voltaire", "joined", "maupertuis", "frederick", "great", "court", "berlin", "antileibnizianism", "became", "centerpiece", "rift", "maupertuis", "voltaire", "public", "satire", "president", "royal", "academy", "science", "berlin", "published", "late", "1752", "presented", "maupertuis", "despotic", "philosophical", "buffoon", "forced", "frederick", "make", "choice", "sided", "maupertuis", "ordering", "voltaire", "either", "retract", "libelous", "text", "leave", "berlin", "voltaire", "chose", "latter", "falling", "role", "scandalous", "rebel", "exile", "result", "writing", "16", "fighting", "philosophie", "17551778", "event", "proved", "voltaire", "last", "official", "rupture", "establishment", "authority", "rather", "returning", "home", "paris", "restoring", "reputation", "voltaire", "instead", "settled", "geneva", "austere", "calvinist", "enclave", "proved", "completely", "unwelcoming", "took", "step", "toward", "independence", "using", "personal", "fortune", "buy", "chateau", "hinterland", "france", "switzerland", "voltaire", "installed", "permanently", "ferney", "early", "1759", "date", "death", "1778", "made", "chateau", "permanent", "home", "capital", "least", "mind", "intellectual", "ally", "emerging", "french", "enlightenment", "period", "voltaire", "also", "adopted", "would", "become", "famous", "influential", "intellectual", "stance", "announcing", "member", "party", "humanity", "devoting", "toward", "waging", "war", "twin", "hydra", "fanaticism", "superstition", "singular", "defense", "newtonian", "science", "focused", "voltaire", "polemical", "energy", "1730s", "1740s", "1750", "program", "became", "defense", "philosophie", "tout", "court", "defeat", "perceived", "enemy", "within", "ecclesiastical", "aristomonarchical", "establishment", "way", "enlightenment", "philosophie", "became", "associated", "voltaire", "cultural", "political", "program", "encapsulated", "famous", "motto", "écrasez", "l", "infâme", "crush", "infamy", "entanglement", "philosophy", "social", "criticism", "reformist", "political", "action", "contingent", "historical", "outcome", "voltaire", "particular", "intellectual", "career", "would", "become", "lasting", "contribution", "history", "philosophy", "first", "cause", "galvanize", "new", "program", "diderot", "alembert", "encyclopédie", "first", "volume", "compendium", "definition", "appeared", "1751", "almost", "instantly", "work", "became", "buried", "kind", "scandal", "voltaire", "grown", "accustomed", "voltaire", "saw", "controversy", "new", "call", "action", "joined", "force", "project", "soon", "appearance", "penning", "numerous", "article", "began", "appear", "volume", "5", "1755", "scandal", "continued", "chase", "encyclopédie", "however", "1759", "work", "publication", "privilege", "revoked", "france", "act", "kill", "project", "forced", "illicit", "production", "switzerland", "scandal", "voltaire", "fought", "vigorously", "alongside", "project", "editor", "defend", "work", "fusing", "encyclopédie", "enemy", "particularly", "parisian", "jesuit", "edited", "monthly", "periodical", "journal", "de", "trevoux", "monolithic", "infamy", "devoted", "eradicating", "truth", "light", "world", "framing", "recapitulated", "opponent", "encyclopédie", "began", "speak", "loose", "assemblage", "author", "contributed", "article", "work", "subversive", "coterie", "philosophes", "devoted", "undermining", "legitimate", "social", "moral", "order", "polemic", "crystallized", "grew", "energy", "influence", "voltaire", "embraced", "term", "made", "cause", "formed", "particularly", "close", "tie", "alembert", "began", "generalize", "broad", "program", "enlightenment", "centered", "rallying", "newly", "selfconscious", "philosophes", "term", "often", "used", "synonymously", "encyclopédistes", "toward", "political", "intellectual", "change", "program", "philosophes", "unified", "shared", "philosophy", "commitment", "program", "defending", "philosophie", "perceived", "enemy", "also", "imagined", "activist", "fighting", "eradicate", "error", "superstition", "world", "ongoing", "defense", "encyclopédie", "one", "rallying", "point", "soon", "removal", "jesuitsthe", "great", "enemy", "enlightenment", "philosophes", "proclaimedbecame", "second", "unifying", "cause", "effort", "achieved", "victory", "1763", "soon", "philosophes", "attempting", "infiltrate", "academy", "institution", "knowledge", "france", "one", "climax", "effort", "reached", "1774", "encyclopédiste", "friend", "voltaire", "philosophes", "annerobert", "jacques", "turgot", "named", "controllergeneral", "france", "powerful", "ministerial", "position", "kingdom", "newly", "crowned", "king", "louis", "xvi", "voltaire", "ally", "paved", "way", "victory", "barrage", "writing", "throughout", "1760s", "1770s", "presented", "philosophie", "like", "espoused", "turgot", "agent", "enlightened", "reform", "critic", "prejudicial", "defender", "ossified", "tradition", "voltaire", "bring", "one", "explicitly", "philosophical", "book", "support", "campaign", "dictionnaire", "philosophique", "17641770", "book", "republished", "article", "original", "encyclopédie", "adding", "new", "entry", "conceived", "spirit", "original", "work", "yet", "fully", "understand", "brand", "philosophie", "voltaire", "made", "foundational", "enlightenment", "one", "need", "recognize", "often", "circulated", "fictional", "story", "satire", "poem", "pamphlet", "le", "obviously", "philosophical", "genre", "voltaire", "widely", "known", "text", "instance", "candide", "ou", "l", "optimisme", "first", "published", "1759", "fictional", "story", "wandering", "traveler", "engaged", "set", "farcical", "adventure", "yet", "contained", "text", "serious", "attack", "leibnizian", "philosophy", "one", "many", "way", "mark", "culmination", "voltaire", "decade", "long", "attack", "philosophy", "started", "newton", "war", "philosophie", "à", "la", "voltaire", "also", "came", "form", "political", "activism", "public", "defense", "jean", "calas", "voltaire", "argued", "victim", "despotic", "state", "irrational", "brutal", "judicial", "system", "voltaire", "often", "attached", "philosophical", "reflection", "political", "advocacy", "facilitated", "french", "translation", "cesare", "beccaria", "treatise", "humanitarian", "justice", "penal", "reform", "prefaced", "work", "essay", "justice", "religious", "toleration", "calas", "french", "protestant", "persecuted", "catholic", "monarchy", "public", "philosophic", "campaign", "channeled", "critical", "reason", "direct", "oppositionalist", "way", "perceived", "injustice", "absurdity", "old", "regime", "life", "hallmark", "philosophie", "voltaire", "understood", "term", "17", "voltaire", "philosophe", "icon", "enlightenment", "philosophie", "1778present", "voltaire", "lived", "long", "enough", "see", "longterm", "legacy", "start", "concretize", "ascension", "louis", "xvi", "1774", "appointment", "turgot", "controllergeneral", "french", "establishment", "began", "embrace", "philosophes", "agenda", "new", "way", "critic", "voltaire", "program", "philosophie", "remained", "powerful", "however", "would", "continue", "survive", "necessary", "backdrop", "positive", "image", "enlightenment", "philosophe", "modernizer", "progressive", "reformer", "courageous", "scourge", "traditional", "authority", "voltaire", "bequeathed", "later", "generation", "voltaire", "lifetime", "new", "acceptance", "translated", "final", "return", "paris", "early", "1778", "frail", "sickly", "octogenarian", "voltaire", "welcomed", "city", "hero", "enlightenment", "personified", "statue", "commissioned", "permanent", "shrine", "legacy", "public", "performance", "play", "irène", "performed", "way", "allowed", "author", "celebrated", "national", "hero", "voltaire", "died", "several", "week", "event", "canonization", "initiated", "continued", "right", "present", "western", "philosophy", "profoundly", "shaped", "conception", "philosophe", "program", "enlightenment", "philosophie", "voltaire", "came", "personify", "model", "offered", "philosophe", "critical", "public", "citizen", "advocate", "first", "foremost", "abstruse", "systematic", "thinker", "absolutely", "necessary", "especially", "influential", "subsequent", "development", "european", "philosophy", "also", "influential", "example", "offered", "philosopher", "measuring", "value", "philosophy", "according", "ability", "effect", "social", "change", "respect", "karl", "marx", "famous", "thesis", "philosophy", "aspire", "change", "world", "merely", "interpret", "owes", "little", "debt", "voltaire", "link", "voltaire", "marx", "also", "established", "french", "revolutionary", "tradition", "similarly", "adopted", "voltaire", "one", "founding", "hero", "voltaire", "first", "person", "honored", "reburial", "newly", "created", "pantheon", "great", "men", "france", "new", "revolutionary", "government", "created", "1791", "act", "served", "tribute", "connection", "revolutionary", "saw", "voltaire", "philosophical", "program", "cause", "revolutionary", "modernization", "whole", "similar", "way", "voltaire", "remains", "today", "iconic", "hero", "everyone", "see", "positive", "linkage", "critical", "reason", "political", "resistance", "project", "progressive", "modernizing", "reform", "2", "voltaire", "enlightenment", "philosophy", "voltaire", "philosophical", "legacy", "ultimately", "resides", "much", "practiced", "philosophy", "end", "toward", "directed", "philosophical", "activity", "specific", "doctrine", "original", "idea", "yet", "particular", "philosophical", "position", "took", "way", "used", "wider", "philosophical", "campaign", "champion", "certain", "understanding", "disparaging", "others", "create", "constellation", "appropriately", "called", "voltaire", "enlightenment", "philosophy", "true", "voltaire", "character", "constellation", "best", "described", "set", "intellectual", "stance", "orientation", "rather", "set", "doctrine", "systematically", "defended", "position", "nevertheless", "others", "found", "voltaire", "model", "welloriented", "philosophe", "set", "particular", "philosophical", "position", "appropriate", "stance", "side", "equation", "played", "key", "role", "defining", "enlightenment", "philosophie", "voltaire", "came", "personify", "21", "liberty", "central", "complex", "voltaire", "conception", "liberty", "around", "category", "voltaire", "social", "activism", "relatively", "rare", "excursion", "systematic", "philosophy", "also", "converged", "1734", "wake", "scandal", "triggered", "lettres", "philosophiques", "voltaire", "wrote", "left", "unfinished", "cirey", "traité", "de", "metaphysique", "explored", "question", "human", "freedom", "philosophical", "term", "question", "particularly", "central", "european", "philosophical", "discussion", "time", "voltaire", "work", "explicitly", "referenced", "thinker", "like", "hobbes", "leibniz", "wrestling", "question", "materialism", "determinism", "providential", "purpose", "central", "writing", "socalled", "deist", "figure", "john", "toland", "anthony", "collins", "great", "debate", "samuel", "clarke", "leibniz", "principle", "newtonian", "natural", "philosophy", "also", "influential", "voltaire", "struggled", "understand", "nature", "human", "existence", "ethic", "within", "cosmos", "governed", "rational", "principle", "impersonal", "law", "voltaire", "adopted", "stance", "text", "somewhere", "strict", "determinism", "rationalist", "materialist", "transcendent", "spiritualism", "voluntarism", "contemporary", "christian", "natural", "theologian", "voltaire", "human", "deterministic", "machine", "matter", "motion", "free", "thus", "exists", "human", "also", "natural", "being", "governed", "inexorable", "natural", "law", "ethic", "anchored", "right", "action", "self", "possessed", "natural", "light", "reason", "immanently", "stance", "distanced", "radical", "deist", "like", "toland", "reinforced", "position", "also", "adopting", "elitist", "understanding", "role", "religion", "society", "voltaire", "equipped", "understand", "reason", "could", "find", "proper", "course", "free", "action", "since", "many", "incapable", "selfknowledge", "selfcontrol", "religion", "claimed", "necessary", "guarantor", "social", "order", "stance", "distanced", "voltaire", "republican", "politics", "toland", "materialist", "voltaire", "echoed", "idea", "political", "musing", "remained", "throughout", "life", "liberal", "reformminded", "monarchist", "skeptic", "respect", "republican", "democratic", "idea", "lettres", "philosophiques", "voltaire", "suggested", "radical", "position", "respect", "human", "determinism", "especially", "letter", "locke", "emphasized", "materialist", "reading", "lockean", "soul", "popular", "figure", "radical", "philosophical", "discourse", "reader", "singled", "part", "book", "major", "source", "controversy", "similar", "vein", "materialist", "account", "âme", "soul", "appeared", "volume", "1", "diderot", "alembert", "encyclopédie", "also", "flashpoint", "controversy", "voltaire", "also", "defined", "understanding", "soul", "similar", "term", "dictionnaire", "philosophique", "example", "point", "voltaire", "willingness", "even", "eagerness", "publicly", "defend", "controversial", "view", "even", "private", "considered", "writing", "often", "complicated", "understanding", "public", "polemical", "writing", "insisted", "upon", "case", "one", "often", "see", "voltaire", "defending", "le", "carefully", "reasoned", "position", "complex", "philosophical", "problem", "adopting", "political", "position", "designed", "assert", "conviction", "liberty", "speech", "matter", "topic", "sacred", "violated", "voltaire", "never", "actually", "said", "disagree", "say", "defend", "death", "right", "say", "it", "yet", "myth", "associate", "dictum", "name", "remains", "powerful", "one", "still", "hears", "legacy", "invoked", "redeclaration", "pronouncement", "never", "actually", "declared", "part", "deep", "cultural", "tie", "join", "voltaire", "dictum", "fact", "even", "write", "precise", "word", "capture", "however", "imprecisely", "spirit", "philosophy", "liberty", "voluminous", "correspondence", "especially", "detail", "many", "polemical", "public", "text", "one", "find", "voltaire", "articulating", "view", "intellectual", "civil", "liberty", "make", "unquestioned", "forerunner", "modern", "civil", "libertarianism", "never", "authored", "single", "philosophical", "treatise", "topic", "however", "yet", "memory", "life", "philosophical", "campaign", "influential", "advancing", "idea", "nevertheless", "voltaire", "influence", "palpably", "present", "example", "kant", "famous", "argument", "essay", "enlightenment", "enlightenment", "stem", "free", "public", "use", "critical", "reason", "liberty", "allows", "critical", "debate", "proceed", "untrammeled", "absence", "singular", "text", "anchor", "linkage", "voltaire", "collected", "work", "way", "remove", "unmistakable", "presence", "voltaire", "influence", "upon", "kant", "formulation", "22", "hedonism", "voltaire", "notion", "liberty", "also", "anchored", "hedonistic", "morality", "another", "key", "feature", "voltaire", "enlightenment", "philosophy", "one", "vehicle", "philosophy", "voltaire", "salacious", "poetry", "genre", "reflected", "eroticism", "sexual", "innuendo", "lived", "culture", "libertinism", "important", "feature", "voltaire", "biography", "voltaire", "also", "contributed", "philosophical", "libertinism", "hedonism", "celebration", "moral", "freedom", "sexual", "liberty", "voltaire", "avowed", "hedonism", "became", "central", "feature", "wider", "philosophical", "identity", "since", "libertine", "writing", "conduct", "always", "invoked", "wanted", "indict", "reckless", "subversive", "devoted", "undermining", "legitimate", "social", "order", "voltaire", "refusal", "defer", "charge", "vigor", "opposing", "defense", "libertinism", "used", "also", "injected", "positive", "philosophical", "program", "public", "struggle", "influential", "particular", "cultivation", "happily", "libertine", "persona", "application", "philosophical", "reason", "toward", "moral", "defense", "identity", "often", "widely", "accessible", "vehicle", "poetry", "witty", "prose", "voltaire", "became", "leading", "force", "wider", "enlightenment", "articulation", "morality", "grounded", "positive", "valuation", "personal", "especially", "bodily", "pleasure", "ethic", "rooted", "hedonistic", "calculus", "maximizing", "pleasure", "minimizing", "pain", "also", "advanced", "cause", "sustaining", "unending", "attack", "upon", "repressive", "mind", "antihuman", "demand", "traditional", "christian", "asceticism", "especially", "priestly", "celibacy", "moral", "code", "sexual", "restraint", "bodily", "selfabnegation", "still", "central", "traditional", "moral", "teaching", "day", "hedonistic", "ethic", "also", "crucial", "development", "liberal", "political", "economy", "enlightenment", "voltaire", "applied", "libertinism", "toward", "project", "well", "wake", "scandal", "triggered", "mandeville", "famous", "argument", "fable", "bee", "poem", "remembered", "pursuit", "private", "vice", "namely", "greed", "lead", "public", "benefit", "namely", "economic", "prosperity", "french", "debate", "value", "luxury", "moral", "good", "erupted", "drew", "voltaire", "pen", "1730s", "drafted", "poem", "called", "le", "mondain", "celebrated", "hedonistic", "worldly", "living", "positive", "force", "society", "corrupting", "element", "traditional", "christian", "morality", "held", "essay", "sur", "le", "moeurs", "also", "joined", "enlightenment", "historian", "celebrating", "role", "material", "acquisition", "commerce", "advancing", "progress", "civilization", "adam", "smith", "would", "famously", "make", "similar", "argument", "founding", "tract", "enlightenment", "liberalism", "wealth", "nation", "published", "1776", "voltaire", "certainly", "great", "contributor", "political", "economic", "science", "smith", "practiced", "contribute", "wider", "philosophical", "campaign", "made", "concept", "liberty", "hedonistic", "morality", "central", "work", "widely", "known", "generally", "accepted", "ineradicable", "good", "personal", "philosophical", "liberty", "arguably", "master", "theme", "voltaire", "philosophy", "two", "theme", "closely", "related", "one", "importance", "skepticism", "second", "importance", "empirical", "science", "solvent", "dogmatism", "pernicious", "authority", "engenders", "23", "skepticism", "voltaire", "skepticism", "descended", "directly", "neopyrrhonian", "revival", "renaissance", "owes", "debt", "particular", "montaigne", "whose", "essay", "wedded", "stance", "doubt", "positive", "construction", "self", "grounded", "philosophical", "skepticism", "pierre", "bayle", "skepticism", "equally", "influential", "voltaire", "shared", "forerunner", "separated", "strand", "skepticism", "one", "manifest", "descartes", "insistence", "upon", "value", "skeptical", "position", "right", "final", "complete", "philosophical", "stance", "among", "philosophical", "tendency", "voltaire", "deplored", "fact", "associated", "powerfully", "descartes", "believed", "began", "skepticism", "left", "behind", "name", "positive", "philosophical", "project", "designed", "eradicate", "resolve", "urge", "usually", "led", "production", "voltaire", "liked", "call", "philosophical", "romance", "say", "systematic", "account", "overcome", "doubt", "appealing", "imagination", "need", "coherent", "explanation", "explanation", "voltaire", "argued", "fiction", "philosophy", "philosopher", "need", "recognize", "often", "philosophical", "explanation", "offer", "explanation", "skepticism", "often", "acted", "bulwark", "voltaire", "defense", "liberty", "since", "argued", "authority", "matter", "sacred", "immune", "challenge", "critical", "reason", "voltaire", "view", "religion", "manifest", "private", "writing", "complex", "based", "evidence", "text", "would", "wrong", "call", "voltaire", "atheist", "even", "antichristian", "long", "one", "accepts", "broad", "understanding", "christianity", "entail", "even", "personal", "religious", "view", "subtle", "voltaire", "unwavering", "hostility", "church", "authority", "power", "clergy", "similar", "reason", "also", "grew", "matured", "ever", "hostile", "toward", "sacred", "mystery", "upon", "monarch", "old", "regime", "aristocratic", "society", "based", "authority", "case", "voltaire", "skepticism", "harnessed", "libertarian", "conviction", "continual", "effort", "use", "critical", "reason", "solvent", "superstition", "authority", "anchored", "philosophical", "authority", "romanciers", "descartes", "malebranche", "leibniz", "similarly", "subjected", "critique", "one", "see", "defense", "skepticism", "liberty", "deeply", "held", "opposition", "religiosity", "per", "se", "often", "powerful", "motivator", "voltaire", "perspective", "voltaire", "might", "fruitfully", "compared", "socrates", "another", "founding", "figure", "western", "philosophy", "made", "refusal", "declaim", "systematic", "philosophical", "position", "central", "feature", "philosophical", "identity", "socrates", "repeated", "assertion", "knew", "nothing", "echoed", "voltaire", "insistence", "true", "philosopher", "one", "dare", "know", "courage", "admit", "ignorance", "publicly", "voltaire", "also", "like", "socrates", "public", "critic", "controversialist", "defined", "philosophy", "primarily", "term", "power", "liberate", "individual", "domination", "hand", "authoritarian", "dogmatism", "irrational", "prejudice", "yet", "socrates", "championed", "rigorous", "philosophical", "dialectic", "agent", "emancipation", "voltaire", "saw", "dialectical", "rationalism", "heart", "dogmatism", "sought", "overcome", "voltaire", "often", "used", "satire", "mockery", "wit", "undermine", "alleged", "rigor", "philosophical", "dialectic", "socrates", "saw", "kind", "rhetorical", "word", "play", "essence", "erroneous", "sophism", "sought", "alleviate", "voltaire", "cultivated", "linguistic", "cleverness", "solvent", "false", "deceptive", "dialectic", "anchored", "traditional", "philosophy", "24", "newtonian", "empirical", "science", "acceptance", "ignorance", "rigorous", "skepticism", "often", "demanded", "false", "escape", "found", "sophistical", "knowledgeor", "voltaire", "called", "imaginative", "philosophical", "romancesvoltaire", "offered", "different", "solution", "rigorous", "dialectical", "reasoning", "socrates", "namely", "power", "value", "careful", "empirical", "science", "one", "see", "debt", "voltaire", "owed", "current", "newtonianism", "played", "strong", "role", "launching", "career", "voltaire", "critical", "discourse", "imaginative", "philosophical", "romance", "originated", "fact", "english", "dutch", "newtonian", "many", "expatriate", "french", "huguenot", "developed", "trope", "rhetorical", "weapon", "battle", "leibniz", "european", "cartesian", "challenged", "innovation", "newtonian", "natural", "philosophy", "principia", "mathematica", "1687", "2nd", "rev", "edition", "1713", "newton", "offered", "complete", "mathematical", "empirical", "description", "celestial", "terrestrial", "body", "behaved", "yet", "asked", "explain", "body", "able", "act", "way", "mathematically", "empirically", "demonstrated", "newton", "famously", "replied", "feign", "hypotheses", "perspective", "traditional", "natural", "philosophy", "tantamount", "hand", "waving", "since", "offering", "rigorous", "causal", "account", "nature", "body", "motion", "essence", "branch", "science", "newton", "major", "philosophical", "innovation", "rested", "however", "challenging", "epistemological", "foundation", "assertion", "defense", "newton", "position", "many", "critic", "least", "voltaire", "became", "arguably", "central", "dynamic", "philosophical", "change", "first", "half", "eighteenth", "century", "newtonian", "epistemology", "admitted", "many", "variation", "core", "rested", "new", "skepticism", "validity", "apriori", "rationalist", "account", "nature", "new", "assertion", "brute", "empirical", "fact", "valid", "philosophical", "understanding", "right", "european", "natural", "philosopher", "second", "half", "seventeenth", "century", "thrown", "metaphysics", "physic", "aristotle", "four", "part", "causality", "teleological", "understanding", "body", "motion", "cosmic", "order", "place", "however", "new", "mechanical", "causality", "introduced", "attempted", "explain", "world", "equally", "comprehensive", "term", "mechanism", "inert", "matter", "acting", "direct", "contact", "action", "alone", "approach", "lead", "vortical", "account", "celestial", "mechanic", "view", "held", "material", "body", "swimming", "ethereal", "sea", "whose", "action", "pushed", "pulled", "object", "manner", "observe", "could", "observed", "however", "ethereal", "sea", "agent", "supposedly", "comprehensive", "mechanical", "cosmos", "yet", "rationality", "nevertheless", "dictated", "mechanism", "must", "exist", "since", "without", "philosophy", "would", "returned", "occult", "cause", "aristotelian", "natural", "tendency", "teleological", "principle", "figuring", "pointcontact", "mechanism", "worked", "therefore", "charge", "new", "mechanical", "natural", "philosophy", "late", "seventeenth", "century", "figure", "descartes", "huygens", "leibniz", "established", "scientific", "reputation", "effort", "realize", "goal", "newton", "pointed", "natural", "philosophy", "new", "direction", "offered", "mathematical", "analysis", "anchored", "inescapable", "empirical", "fact", "new", "foundation", "rigorous", "account", "cosmos", "perspective", "great", "error", "aristotelian", "new", "mechanical", "natural", "philosophy", "failure", "adhere", "strictly", "enough", "empirical", "fact", "vortical", "mechanic", "example", "claimed", "matter", "moved", "action", "invisible", "agent", "yet", "newtonian", "began", "argue", "explain", "really", "happening", "imagine", "fiction", "give", "u", "speciously", "satisfactory", "rational", "explanation", "natural", "philosophy", "need", "resist", "allure", "rational", "imaginings", "instead", "deal", "empirically", "provable", "moreover", "newtonian", "argued", "set", "irrefutable", "fact", "explained", "accepting", "brute", "facticity", "truth", "failure", "philosophical", "explanation", "much", "devotion", "appropriate", "rigor", "epistemological", "battle", "became", "especially", "intense", "around", "newton", "theory", "universal", "gravitation", "questioned", "newton", "demonstrated", "irrefutable", "mathematical", "law", "whereby", "body", "appear", "attract", "one", "another", "relation", "mass", "inverse", "relation", "square", "distance", "rigorous", "mathematical", "empirical", "description", "philosophical", "account", "body", "motion", "critic", "leibniz", "said", "since", "mathematical", "description", "thing", "philosophical", "explanation", "newton", "refused", "offer", "explanation", "gravity", "operated", "way", "newtonian", "countered", "phenomenal", "description", "scientifically", "adequate", "long", "grounded", "empirical", "fact", "since", "fact", "yet", "discerned", "explained", "gravity", "work", "scientific", "account", "yet", "possible", "insisted", "enough", "gravity", "operate", "way", "newton", "said", "justification", "accepting", "theory", "mocked", "insisted", "dreaming", "chimera", "like", "celestial", "vortex", "explanation", "phenomenon", "empirical", "evidence", "existed", "support", "theory", "previous", "summary", "describes", "general", "core", "newtonian", "position", "intense", "philosophical", "contest", "first", "decade", "eighteenth", "century", "also", "describes", "voltaire", "stance", "battle", "contribution", "therefore", "centered", "innovation", "within", "familiar", "newtonian", "theme", "rather", "accomplishment", "become", "leading", "evangelist", "new", "newtonian", "epistemology", "consequence", "major", "reason", "widespread", "dissemination", "acceptance", "france", "throughout", "europe", "comparison", "david", "hume", "role", "development", "might", "help", "illuminate", "distinct", "contribution", "hume", "voltaire", "began", "skepticism", "rationalist", "philosophy", "embraced", "newtonian", "criterion", "made", "empirical", "fact", "guarantor", "truth", "philosophy", "yet", "hume", "target", "remained", "traditional", "philosophy", "contribution", "extend", "skepticism", "way", "point", "denying", "feasibility", "transcendental", "philosophy", "argument", "would", "famously", "awake", "kant", "dogmatic", "slumber", "lead", "reconstitution", "transcendental", "philosophy", "new", "term", "voltaire", "different", "fish", "fry", "attachment", "new", "newtonian", "empirical", "scientist", "never", "dilettante", "scientist", "devotion", "form", "natural", "inquiry", "made", "respect", "leading", "philosophical", "advocate", "ideologist", "new", "empiricoscientific", "conception", "philosophy", "newton", "initiated", "voltaire", "many", "eighteenthcentury", "newtonian", "important", "project", "defending", "empirical", "science", "alternative", "traditional", "natural", "philosophy", "involved", "sharing", "hume", "critique", "abstract", "rationalist", "system", "also", "involved", "different", "project", "defending", "empirical", "induction", "experimental", "reasoning", "new", "epistemology", "appropriate", "modern", "enlightened", "philosophy", "particular", "voltaire", "fought", "vigorously", "rationalist", "epistemology", "critic", "used", "challenge", "newtonian", "reasoning", "famous", "conclusion", "candide", "example", "optimism", "philosophical", "chimera", "produced", "dialectical", "reason", "remains", "detached", "brute", "empirical", "fact", "owed", "great", "debt", "newtonian", "conviction", "alternative", "offered", "text", "life", "devoted", "simple", "task", "clear", "tangible", "importantly", "useful", "end", "also", "derived", "utilitarian", "discourse", "newtonian", "also", "used", "justify", "science", "voltaire", "campaign", "behalf", "smallpox", "inoculation", "began", "letter", "topic", "lettres", "philosophiques", "similarly", "grounded", "appeal", "fact", "case", "antidote", "fear", "generated", "logical", "deduction", "seemingly", "sound", "axiomatic", "principle", "voltaire", "public", "campaign", "fact", "deployed", "empirical", "fact", "ultimate", "solvent", "irrational", "prejudice", "blind", "adherence", "preexisting", "understanding", "respect", "philosophy", "manifest", "deeply", "indebted", "epistemological", "conviction", "gleaned", "newtonianism", "25", "toward", "science", "without", "metaphysics", "voltaire", "also", "contributed", "directly", "new", "relationship", "science", "philosophy", "newtonian", "revolution", "made", "central", "enlightenment", "modernity", "especially", "important", "critique", "metaphysics", "argument", "eliminated", "wellordered", "science", "center", "newtonian", "innovation", "natural", "philosophy", "argument", "question", "body", "per", "se", "either", "irrelevant", "distracting", "well", "focused", "natural", "science", "leibniz", "example", "insisted", "physic", "begin", "accurate", "comprehensive", "conception", "nature", "body", "newton", "argued", "character", "body", "irrelevant", "physic", "since", "science", "restrict", "quantified", "description", "empirical", "effect", "resist", "urge", "speculate", "seen", "measured", "removal", "metaphysics", "physic", "central", "overall", "newtonian", "stance", "toward", "science", "one", "fought", "vigorously", "clarify", "distinction", "give", "public", "audience", "voltaire", "battle", "leibnizianism", "1740s", "great", "theater", "voltaire", "work", "regard", "1740", "responding", "du", "châtelet", "effort", "institution", "de", "physique", "reconnect", "metaphysics", "physic", "synthesis", "leibniz", "newton", "voltaire", "made", "opposition", "project", "explicit", "review", "essay", "published", "brief", "revival", "socalled", "vi", "viva", "controversy", "triggered", "du", "châtelet", "treatise", "defending", "empirical", "mechanical", "conception", "body", "force", "defended", "leibniz", "metaphysical", "conception", "thing", "period", "voltaire", "also", "composed", "short", "book", "entitled", "la", "metaphysique", "de", "newton", "publishing", "1740", "implicit", "counterpoint", "châtelet", "institution", "tract", "much", "articulate", "newton", "metaphysics", "celebrate", "fact", "avoided", "practicing", "speculation", "altogether", "also", "accused", "leibniz", "becoming", "deluded", "zeal", "make", "metaphysics", "foundation", "physic", "definitive", "1745", "edition", "éléments", "de", "la", "philosophie", "de", "newton", "voltaire", "also", "appended", "tract", "newton", "metaphysics", "book", "introduction", "thus", "framing", "understanding", "relationship", "metaphysics", "empirical", "science", "direct", "opposition", "châtelet", "leibnizian", "understanding", "also", "added", "personal", "invective", "satire", "position", "indictment", "maupertuis", "1750s", "linking", "maupertuis", "turn", "toward", "metaphysical", "approach", "physic", "1740s", "increasingly", "deluded", "philosophical", "understanding", "authoritarian", "manner", "dealing", "colleague", "critic", "voltaire", "attack", "maupertuis", "crossed", "line", "ad", "hominem", "core", "fierce", "defense", "way", "metaphysical", "reasoning", "occludes", "deludes", "work", "physical", "scientist", "moreover", "extent", "eighteenthcentury", "newtonianism", "provoked", "two", "major", "trend", "later", "philosophy", "first", "reconstitution", "transcendental", "philosophy", "à", "la", "kant", "copernican", "revolution", "relocated", "remains", "metaphysics", "priori", "category", "reason", "second", "marginalization", "metaphysics", "altogether", "celebration", "philosophical", "positivism", "antispeculative", "scientific", "method", "anchored", "voltaire", "seen", "major", "progenitor", "latter", "also", "attaching", "many", "nineteenth", "century", "saw", "voltaire", "protopositivism", "celebrated", "campaign", "eradicate", "priestly", "aristomonarchical", "authority", "debunking", "irrational", "superstition", "appeared", "anchor", "authority", "voltaire", "legacy", "also", "cemented", "alleged", "linkage", "joined", "positivist", "science", "one", "hand", "secularizing", "disenchantment", "dechristianization", "way", "voltaire", "seen", "initiator", "philosophical", "tradition", "run", "auguste", "comte", "charles", "darwin", "karl", "popper", "richard", "dawkins", "twentieth", "century"]}