{"url": "zermelo-set-theory", "title": "Zermelo’s Axiomatization of Set Theory", "authorship": {"year": "Copyright © 2013", "author_text": "Michael Hallett\n<michael.hallett@mcgill.ca>", "author_links": [{"mailto:michael%2ehallett%40mcgill%2eca": "michael.hallett@mcgill.ca"}], "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2013</a> by\n\n<br/>\nMichael Hallett\n&lt;<a href=\"mailto:michael%2ehallett%40mcgill%2eca\"><em>michael<abbr title=\" dot \">.</abbr>hallett<abbr title=\" at \">@</abbr>mcgill<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"}, "pubinfo": ["First published Tue Jul 2, 2013"], "preamble": "\nThe first axiomatisation of set theory was given by Zermelo in his\n1908 paper “Untersuchungen über die Grundlagen der\nMengenlehre, I” (Zermelo 1908b), which became the basis for\nthe modern theory of sets. This entry focuses on the 1908\naxiomatisation; a further entry will consider later axiomatisations of\nset theory in the period 1920–1940, including Zermelo's second\naxiomatisation of 1930.\n", "toc": [{"#Axi": "1. The Axioms"}, {"#BacZerAxi": "2.  The Background to Zermelo's Axiomatisation"}, {"#HilAxiMet": "2.1  Hilbert's Axiomatic Method"}, {"#ProEle": "2.1.1  Programmatic elements"}, {"#ProAnaZerWelOrdTheWOT": "2.1.2  Proof analysis and Zermelo's Well-Ordering Theorem [WOT]"}, {"#WelOrdProWelOrdThe": "2.2  The Well-Ordering Problem and the Well-Ordering Theorem"}, {"#ImpProBefZer": "2.2.1  The importance of the problem before Zermelo"}, {"#Zer190ProWelOrdThe": "2.2.2  Zermelo's 1904 Proof of the Well-Ordering Theorem"}, {"#Obj190Pro": "2.2.3  Objections to the 1904 Proof"}, {"#ZerSecProWOT190": "2.2.4  Zermelo's second proof of the WOT, 1908"}, {"#Axi190WOTPap": "2.2.5  The Axioms of the 1908 WOT Paper"}, {"#MajProZerSys": "3. The Major Problems with Zermelo's System"}, {"#Sep": "3.1  Separation"}, {"#Com": "3.2  Completeness"}, {"#RepOrdMat": "3.2.1  Representing Ordinary Mathematics"}, {"#Ord": "3.2.2  Ordinality"}, {"#Car": "3.2.3  Cardinality"}, {"#Ordinals": "3.2.4  Ordinals"}, {"#FurRea": "4. Further reading"}, {"#Bib": "Bibliography"}, {"#Aca": "Academic Tools"}, {"#Oth": "Other Internet Resources"}, {"#Rel": "Related Entries"}], "main_text": "\n1. The Axioms\nThe introduction to Zermelo's paper makes it clear that set theory is regarded as a fundamental theory:\n\nSet theory is that branch of mathematics whose task is to\n  investigate mathematically the fundamental notions\n  “number”, “order”, and\n  “function”, taking them in their pristine, simple form,\n  and to develop thereby the logical foundations of all of arithmetic\n  and analysis; thus it constitutes an indispensable component of the\n  science of mathematics.\n (1908b: 261)[1]\n\nThis is followed by an acknowledgment that it is necessary to\nreplace the central assumption that we can ‘assign to an\narbitrary logically definable notion a “set”, or\n“class”, as its “extension” ’\n(1908b: 261). Zermelo goes on:\n\nIn solving the problem [this presents] we must, on the one hand,\nrestrict these principles [distilled from the actual operation with\nsets] sufficiently to exclude all contradictions and, on the other,\ntake them sufficiently wide to retain all that is valuable in this\ntheory. (1908b: 261)\n\nThe ‘central assumption’ which Zermelo describes (let\nus call it the Comprehension Principle, or CP) had come to be seen by\nmany as the principle behind the derivation of the set-theoretic\ninconsistencies. Russell (1903: §104) says the following:\n\nPerhaps the best way to state the suggested solution [of the\n  Russell-Zermelo contradiction] is to say that, if a collection of\n  terms can only be defined by a variable propositional function,\n  then, though a class as many may be admitted, a class as one must be\n  denied. We took it as axiomatic that the class as one is to be found\n  wherever there is a class as many; but this axiom need not be\n  universally admitted, and appears to have been the source of the\n  contradiction. By denying it, therefore, the whole difficulty will\n  be overcome.\n\nBut it is by no means clear that ‘the whole difficulty’\nis thereby ‘overcome’. Russell makes a clear\nidentification of the principle he cites (a version of CP) as the\nsource of error, but this does not in the least make it clear what is\nto take its \nplace.[2] \nIn his Grundgesetze (see e.g., Frege\n1903: §146–147) Frege recognises that his (in)famous Law V\nis based on a conversion principle which allows us to assume that for\nany concept (function), there is an object which contains precisely\nthose things which fall under that concept (or for which the function\nreturns the value ‘True’). Law V is then the principle\nwhich says that two such extension objects a, b stemming\nfrom two concepts F, G are the same if, and only\nif, F and G are extensionally equivalent. Frege clearly\nconsiders the ‘conversion’ of concepts to extensions as\nfundamental; he also regards it as widely used in mathematics (even if\nonly implicitly), and thus that he is not ‘doing anything\nnew’ by using such a principle of conversion and the attendant\n‘basic law of logic’, Law V. (The CP follows immediately\nfrom Law V.) Frege was made aware by Russell (1902) that his Law V is\ncontradictory, since Russell's paradox flows easily from it. In the\nAppendix to Grundgesetze (Frege 1903), Frege says this:\n\nHardly anything more unwelcome can befall a scientific writer\n  than to have one of the foundations of his edifice shaken after the\n  work is finished. This is the position into which I was put by a\n  letter from Mr Bertrand Russell as the printing of this volume was\n  nearing completion. The matter concerns my Basic Law (V). I have\n  never concealed from myself that it is not as obvious as the others\n  nor as obvious as must properly be required of a logical\n  law. Indeed, I pointed out this very weakness in the foreword to the\n  first volume, p. VII. I would gladly have dispensed with this\n  foundation if I had known of some substitute for it. Even now, I do\n  not see how arithmetic can be founded scientifically, how the\n  numbers can be apprehended as logical objects and brought under\n  consideration, if it is not—at least\n  conditionally—permissible to pass from a concept to its\n  extension. May I always speak of the extension of a concept, of a\n  class? And if not, how are the exceptions to be recognised? May one\n  always infer from the extension of one concept's coinciding with\n  that of a second that every object falling under the first concept\n  also falls under the latter? These questions arise from Mr Russell's\n  communication. …What is at stake here is not my approach to a\n  foundation in particular, but rather the very possibility of any\n  logical foundation of\n  arithmetic. (p. 253)[3]\n\nThe difficulty could hardly be summed up more succinctly. It was\nthe replacement of assumptions involving the unfettered conversion of\nconcepts to objects which was Zermelo's main task in his\naxiomatisation.\nZermelo's system was based on the presupposition that\n\nSet theory is concerned with a “domain” 𝔅 of\n  individuals, which we shall call simply “objects” and\n  among which are the “sets”. If two symbols, a\n  and b, denote the same object, we write a = b,\n  otherwise\na ≠ b. We say of an\nobject a that it “exists” if it belongs to the\ndomain 𝔅; likewise we say of a class 𝔎 of objects that\n“there exist objects of the class 𝔎” if 𝔅\ncontains at least one individual of this class. (1908b: 262)\n\nGiven this, the one fundamental relation is that of set membership,\n‘ε’ , which allows one to state that an\nobject a belongs to, or is in, a set b, written\n‘a ε \n b’.[4]\n Zermelo then laid down seven axioms which\ngive a partial description of what is to be found in B. These\ncan be described as follows:\n\nExtensionalityThis says roughly that sets are\n  determined by the elements they contain.\nAxiom of Elementary SetsThis asserts (a) the\n  existence of a set which contains no members (denoted\n  ‘0’ by Zermelo, now commonly denoted by\n  ‘∅’); (b) the existence, for any object a,\n  of the singleton set {a} which has a as its sole\n  member; and (c) the existence, for any two\n  objects a, b, of the unordered pair\n  {a, b}, which has just a, b as its\n  members.\nSeparation (Aussonderungsaxiom)This asserts\nthat, for any given set a, and any given ‘definite’\nproperty of elements in 𝔅 (more on this below), one can\n‘separate’ out from a as a set just those elements\nwhich satisfy the given property.\nPower SetThis says that for any set, the collection\nof all subsets of that set is also a set.\nUnionThis says that for any set, the collection of\nthe members of the members of that set also forms a set.\nChoiceThis says that for any set of pairwise\ndisjoint, non-empty sets, there exists a set (which is a subset of the\nunion set to which the given set gives rise) which contains exactly\none member from each member of the given set.\n\nInfinityThis final axiom asserts the existence of an\ninfinitely large set which contains the empty set, and for each\nset a that it contains, also contains the set\n{a}. (Thus, this infinite set must contain ∅, {∅},\n{{∅}}, ….)\n\nWith the inclusion of this last, Zermelo explicitly rejects any\nattempt to prove the existence of an infinite collection from other\nprinciples, as we find in Dedekind (1888: §66), or in Frege via\nthe establishment of what is known as ‘Hume's Principle’.\nThe four central axioms of Zermelo's system are the Axioms of\nInfinity and Power Set, which together show the existence of\nuncountable sets, the Axiom of Choice, to which we will devote some\nspace below, and the Axiom of Separation. This latter allows that any\n‘definite’ property φ does in fact give rise to a set,\nnamely the set of all those things which are already included in some\nset a and which have the property φ, in other words, gives\nrise to a certain subset of a, namely the subset of all the\nφ-things in a. Thus, it follows from this latter that there\nwill generally be many sets giving partial extensions of φ, namely\nthe φ-things in a, the φ-things in b, the\nφ-things in c, and so on. However, there will be no\nguarantee of the existence of a unique extension-set for φ, as, of\ncourse, there is under the CP, namely a = {x :\nφ(x)}.\nZermelo shows that, on the basis of his system, the two central\nparadoxes, that of the greatest set and that of Russell, cannot\narise. In fact, Zermelo proves:\n\nEvery set M possesses at least one\n  subset M0 that is not an element\n  of M. (1908b: 265)\n\nThe proof is an easy modification of the argument for Russell's\nParadox, using the contradiction this time as a reductio. By\nSeparation, let M0 be the subset of M\nconsisting of those elements x of M such\nthat \nx ∉ x. Now either \nM0 ∈ M0\nor M0 ∉ M0. Assume\nthat \nM0 ∈ M0. Since \nM0 is a subset\nof M, this tells us that \nM0 ∈ M. But M0 is then a member of M\nwhich fails to satisfy the condition for belonging\nto M0, showing\nthat \nM0 ∉ M0, which is a\ncontradiction. Hence,\nnecessarily, \nM0 ∉ M0. But now\nif we suppose that M0 were in M,\nthen M0 itself is bound to be\nin M0 by the defining condition of this\nset. Hence, \nM0 ∉ M on pain of\ncontradiction. The argument for the Russell paradox is used here to\nconstructive effect: one person's contradiction is another person's\nreductio. Zermelo comments:\n\nIt follows from the theorem that not all objects x of the\n  domain 𝔅 can be elements of one and the same set; that is,\n  the domain 𝔅 is not itself a set, and this disposes of the\n  “Russell antinomy” so far as we are concerned. (1908b:\n  265) \nFor, in the absence of something like the CP, there is no\noverriding reason to think that there must be a universal\nset.[5]\nBut although this deals with the Russell paradox and the paradox of\nthe universal set, it does not tackle the general consistency of the\nsystem. Zermelo was well aware of this, as is clear from the\nIntroduction to his paper:\n\nI have not yet even been able to prove rigorously that my axioms\n  are “consistent”, though this is certainly very\n  essential; instead I have had to confine myself to pointing out now\n  and then that the “antinomies” discovered so far vanish\n  one and all if the principles here proposed are adopted as a\n  basis. But I hope to have done at least some useful spadework hereby\n  for subsequent investigations in such deeper problems. (1908b:\n  262)\n\nIt should be remarked in passing that Zermelo doesn't deal specifically with the\nBurali-Forti paradox either, for the simple reason that it cannot be properly\nformulated in his system, since it deals either with well-orderings\ngenerally or with the general concept of ordinal number. We will come\nback to this below. However, assuming that the known paradoxes can be\navoided, another question comes to the fore: if the Separation Axiom\nis to be the basic principle for the workaday creation of sets, is it\nadequate? This question, too, will be taken up later.\nThere were attempts at the statement of axioms before Zermelo, both\npublicly and in private\n correspondence.[6] \nIn particular, Cantor, in correspondence\nwith Hilbert and Dedekind in the late 1890s, had endeavoured to\ndescribe some principles of set \nexistence[7] \nwhich he thought were legitimate, and would\nnot give rise to the construction of what he called\n‘inconsistent totalities’, totalities which engender\ncontradictions. (The best known of these totalities were the totality\nof all ordinals and the totality of all cardinals.) These principles\nincluded those of set union and a form of the replacement axiom, as\nwell as principles which seem to guarantee that every cardinal number\nis an aleph, which we call for short the ‘Aleph Hypothesis\n(AH)’.\nDespite this, there are reasons for calling Zermelo's system the\nfirst real axiomatisation of set theory. It is clear above all that\nZermelo's intention was to reveal the fundamental nature of the theory\nof sets and to preserve its achievements, while at the same time\nproviding a general replacement for the CP.\n2.  The Background to Zermelo's Axiomatisation\n2.1  Hilbert's Axiomatic Method\nHilbert's early work on the axiomatic method is an important part\nof the context of Zermelo's axiomatisation. Hilbert developed a\nparticular version of the axiomatic approach to fundamental\nmathematical theories in his work on geometry in the period\n1894–1904 (see Hallett and Majer 2004). This was to be seen as a\ndistinct alternative to what Hilbert called the ‘genetic\napproach’ to mathematics. (For a short, historically informed\ndescription, see Felgner 2010: 169–174.) Ebbinghaus's book on\nZermelo makes it very clear how embedded Zermelo was in the Hilbert\nfoundational circle in the early years of the\ncentury.[8]\n This is not meant to suggest that Zermelo adopted Hilbert's approach\nto the foundations of mathematics in all its aspects. Indeed, Zermelo\ndeveloped his own, distinctive approach to foundational matters which\nwas very different from Hilbert's, something which emerges quite\nclearly from his later work. Nevertheless, there are two elements of\nZermelo's procedure which fit very well with Hilbert's foundational\napproach in the early part of the century. The first element concerns\nwhat might be called the programmatic element of Hilbert's treatment\nof the foundations of mathematics as it emerged in the later 1890s,\nand especially with regard to the notion of mathematical\nexistence. And the second concerns proof analysis, a highly important\npart of Hilbert's work on Euclidean geometry and geometrical systems\ngenerally. These matters are intricate, and cannot be discussed\nadequately here (for fuller discussion, see both Hallett 2008 and\n2010a). But it is important for understanding Zermelo's work fully\nthat a rough account be given.\n2.1.1  Programmatic elements\nFirst, Hilbert adopted the view that a mature presentation of a\nmathematical theory must be given axiomatically. This, he claims,\nrequires several things:\n\nThe postulation of the existence of a domain, of a ‘system\n(or systems) of things’.\n\nThe insistence, however, that nothing is known about those things\nexcept what is expressed in, or can be derived from, a finite list of\naxioms.\nThe requirement, along with this, of finite proofs, which begin\nwith axioms and proceed from these to a conclusion by a ‘finite\nnumber of inferences’ (i.e., acceptable inferential steps).\nThe rather imprecise notion of the ‘completeness’ of\nthe axiomatisation, which involves, loosely, showing that the axioms can prove all\nthat they ‘ought’ to prove.\nThe provision of a consistency proof for these axioms, showing\nthat no contradiction is derivable by a proof constructed in the\nsystem given.\n\nFor one thing, Hilbert was very clear (especially in his\nunpublished lectures on geometry: see Hallett and Majer 2004) that,\nalthough a domain is asserted to ‘exist’, all that is\nknown about the objects in the domain is what is given to us by the\naxioms and what can be derived from these through ‘finite\nproof’. In other words, while a domain is postulated, nothing is\ntaken to be known about the things in it independently of the axioms\nlaid down and what they entail. The basic example was given by\ngeometrical systems of points, lines and planes; although the\ngeometrical domain is made up of these things, nothing can be assumed\nknown about them (in particular no ‘intuitive’ geometrical\nknowledge from whatever source) other than what is given in the axioms\nor which can be derived from them by legitimate inference. (The axioms\nthemselves might sum up, or be derived from, ‘intuitive’\nknowledge, but that is a different matter. And even here it is\nimportant that we can detach the axioms from their intuitive\nmeanings.)\nSecondly, while ‘existence’ of the objects is just a\nmatter (as Zermelo says) of belonging to the domain (a fact which is\nestablished by the axioms or by proofs from those axioms), the\nmathematical existence of the domain itself, and (correspondingly) of\nthe system set out by the axioms, is established only by a consistency\nproof for the axioms. Thus, to take the prime example, the\n‘existence’ of Euclidean geometry (or more accurately\nEuclidean geometries) is shown by the consistency proofs given by\nmeans of analytic \n geometry.[9]\n Thus, the unit of consistency is not the\nconcept nor the individual propositions, but rather the system of\naxioms as a whole, and different systems necessarily give accounts of\ndifferent primitives. The expectation is that when a domain is\naxiomatised, attention will turn (at some point) to a consistency\nproof, and this will deal finally with the question of mathematical\nexistence. In any case, the task of showing existence is a\nmathematical one and there is no further ontological or metaphysical\nmystery to be solved once the axioms are laid down.\nMany aspects of Hilbert's position are summed up in this\npassage from his 1902 lectures on the foundations of geometry: the\naxioms ‘create’ the domains, and the consistency proofs\njustify their existence. As he puts it:\n\nThe things with which mathematics is concerned are\ndefined through axioms, brought into life.\nThe axioms can be taken quite arbitrarily. However, if these axioms\ncontradict each other, then no logical consequences can be drawn from\nthem; the system defined then does not exist for the\nmathematician. (Hilbert 1902: 47 or Hallett and Majer 2004: 563)\n\nThis notion of ‘definition through axioms’, what came\nto be known as the method of ‘implicit definition’, can be\nseen in various writings of Hilbert's from around 1900. His\nattitude to existence is illustrated in the following passage from his\nfamous paper on the axiomatisation of the reals:\n\nThe objections which have been raised against the existence of\n  the totality of all real numbers and infinite sets generally lose\n  all their justification once one has adopted the view stated above\n  [the axiomatic method]. By the set of the real numbers we do not\n  have to imagine something like the totality of all possible laws\n  governing the development of a fundamental series, but rather, as\n  has been set out, a system of things whose mutual relations are\n  given by the finite and closed systems of axioms I–IV [for\n  complete ordered fields] given above, and about which statements\n  only have validity in the case where one can derive them via a\n  finite number of inferences from those axioms. (Hilbert 1900b:\n  184)[10]\n\nThe parallels between this ‘axiomatic method’ of\nHilbert's and Zermelo's axiomatisation of set theory are\nreasonably clear, if not \n exact.[11]\nParticularly clear are the assumption of the existence of a\n‘domain’ 𝔅, the statement of a finite list of\naxioms governing its contents, and the recognition of the requirement\nof a general consistency proof. There's also implicit\nrecognition of the requirements of ‘finite proof’; this\nleads us to the second important aspect of the Hilbertian background,\nnamely proof analysis and the use of the Axiom of Choice.\n2.1.2  Proof analysis and Zermelo's Well-Ordering Theorem [WOT]\nA great deal of Hilbert's work on geometry concerned the analysis\nof proofs, of what can, or cannot, be derived from what. Much of\nHilbert's novel work on geometry involved the clever use of\n(arithmetical) models for geometrical systems to demonstrate a\nsuccession of independence results, which, among other things, often\nshow how finely balanced various central assumptions\nare.[12]\nMoreover, a close reading of Hilbert's work makes it clear that the\ndevelopment of an appropriate axiom system itself goes hand-in-hand\nwith the reconstruction and analysis of proofs.\nOne straightforward kind of proof analysis was designed to reveal\nwhat assumptions there are behind accepted ‘theorems’, and\nthis is clearly pertinent in the case of Zermelo's Axiom of Choice\n(his sixth axiom) and the WOT. What Zermelo's work showed, in effect,\nis that the ‘choice’ principle behind the Axiom is a\nnecessary and sufficient condition for WOT; and he shows this by\nfurnishing a Hilbertian style proof for the theorem, i.e., a\nconclusion which follows from (fairly) clear assumptions by means of a\nfinite number of inferential steps. Indeed, the Axiom is chosen so as\nto make the WOT provable, and it transpired subsequently that it also\nmade provable a vast array of results, mainly (but not solely) in set\ntheory and in set-theoretic algebra. To understand the importance of\nZermelo's work, it's necessary to appreciate the centrality of the\nWOT.\n2.2  The Well-Ordering Problem and the Well-Ordering Theorem\n2.2.1  The importance of the problem before Zermelo\nIn one of the fundamental papers in the genesis of set theory,\nCantor (1883a) isolated the notion of a well-ordering on a collection\nas one of the central conceptual pillars on which number is\nbuilt. Cantor took the view that the notion of a counting number must\nbe based on an underlying ordering of the set of things being counted,\nan ordering in which there is a first element counted, and, following\nany collection of elements counted, there must be a next element\ncounted, assuming that there are elements still uncounted. This kind\nof ordering he called a ‘well-ordering’, which we now\ndefine as a total-ordering with an extra condition, namely that any\nsubset has a least element in the ordering. Cantor recognised that\neach distinct well-ordering of the elements gives rise to a distinct\ncounting number, what he originally called an ‘Anzahl\n[enumeral]’, later an ‘Ordnungszahl [ordinal\nnumber]’, numbers which are conceptually quite different from\ncardinal numbers or powers, meant to express just the size of\ncollections.[13]\nThis distinction is hard to perceive at first sight. Before Cantor and\nthe rise of the modern theory of transfinite numbers, the standard\ncounting numbers were the ordinary finite\nnumbers.[14]\nAnd, crucially, for finite collections, it turns out that any two\norderings of the same underlying elements, which are certainly\nwell-orderings in Cantor's sense, are order-isomorphic, i.e., not\nessentially\n distinct.[15] \nThis means that one can in effect\nidentify a number arrived at by counting (an ordinal number) with the\ncardinal number of the collection counted. Thus, the ordinary natural\nnumbers appear in two guises, and it is possible to determine the size\nof a finite collection directly by counting it. Cantor observed that\nthis ceases to be the case in rather dramatic fashion once one\nconsiders infinite collections; here, the same elements can give rise\nto a large variety of distinct well-orderings.\nNevertheless, Cantor noticed that if one collects together all the\ncountable ordinal numbers, i.e., the numbers representing\nwell-orderings of the set of natural numbers, this collection, which\nCantor called the second number-class (the first being the set of\nnatural numbers), must be of greater cardinality than that of the\ncollection of natural numbers itself. Moreover, this size is the\ncardinal successor to the size of the natural numbers in the very\nclear sense that any infinite subset of the second number-class is\neither of the power of the natural numbers or of the power of the\nwhole class; thus, there can be no size which is strictly\nintermediate. The process generalises: collect together all the\nordinal numbers representing well-orderings of the second number-class\nto form the third number-class, and this must be the immediate\nsuccessor in size to that of the second number-class, and so on. In\nthis way, Cantor could use the ordinal numbers to generate an infinite\nsequence of cardinalities or powers. This sequence was later\n (Cantor 1895) called the aleph-sequence, ℵ0 (the\nsize of the natural numbers), ℵ1 (expressing the\nsize of the second number-class), ℵ2 (expressing the\nsize of the third number-class), and so on. Since the intention was\nthat ordinal numbers could be generated arbitrarily far, then so too,\nit seems, could the alephs.\nThis raises the possibility of reinstating the centrality of the\nordinal numbers as the fundamental numbers even in the case of\ninfinite sets, thus making ordinality the foundation of cardinality\nfor all sets. In work after 1883, Cantor attempted to show that the\nalephs actually represent a scale of infinite cardinal number. For\ninstance, it is shown that the ordinal numbers are comparable, i.e.,\nfor any two ordinal numbers α, β, either \nα < β,\nα = β or \nα > β, a desirable, perhaps\nessential, property of counting numbers. Through this, comparability\ntherefore transfers to the alephs, and Cantor was able to give clear\nand appropriate arithmetical operations of addition, multiplication\nand exponentiation, generalising the corresponding notions for finite\ncollections, and the statement and proof of general laws concerning\nthese.\nIn 1878, Cantor had put forward the hypothesis that there is no\ninfinite power between that of the natural numbers and the\ncontinuum. This became known as Cantor's Continuum Hypothesis\n(CH). With the adumbration of the number classes, CH takes on the form\nthat the continuum has the power of the second number-class, and with\nthe development of the aleph-scale, it assumes the form of a\nconjecture about the exponentiation operation in the generalised\ncardinal arithmetic, for it can be expressed in the form\n2ℵ0 =\nℵ1. The continuum problem more generally\nconstrued is really the problem of where the power of the continuum is\nin the scale of aleph numbers, and the generalised continuum\nhypothesis is the conjecture that taking the power set of an infinite\nset corresponds to moving up just one level in the aleph scale. For\nexample, in 1883, Cantor had assumed (without remark) that the set of\nall real functions has the size of the third number-class. Given the\nCH, this then becomes the conjecture that\n2ℵ1 = ℵ2.\nBut adopting the aleph scale as a framework for infinite\ncardinality depends on significant assumptions. It is clear that any\ncollection in well-ordered form (given that it is represented by an\nordinal) must have an aleph-number representing its size, so clearly\nthe aleph-sequence represents the sizes (or powers as Cantor called\nthem) of all the well-ordered sets. However, can any set be put into\nwell-ordered form? A particular question of this form concerns the\ncontinuum itself: if the continuum is equivalent to the second\nnumber-class, then clearly it can be well-ordered, and indeed this is\na necessary condition for showing that the continuum is represented at\nall in the scale. But can it be well-ordered? More generally, to\nassume that any cardinality is represented in the scale of aleph\nnumbers is to assume in particular that any set can be\nwell-ordered. And to assume that the aleph-sequence is the scale of\ninfinite cardinal number is to assume at the very least that sets\ngenerally can be compared cardinally; i.e., that for any M, N, either\nM ≼ N or \nN ≼ M, COMP for short. But is this\ncorrect?\nWhen introducing the notion of well-ordering in 1883, Cantor\nexpressed his belief that the fact that any set\n(‘manifold’) can be well-ordered is ‘a law of\nthought [Denkgesetz]’, thus putting forward what for convenience\nwe can call the well-ordering hypothesis (WOH):\n\nThe concept of well-ordered set reveals itself as\nfundamental for the theory of manifolds. That it is always possible to\narrange any well-defined set in the form of a well-ordered set is, it\nseems to me, a very basic law of thought, rich in consequences, and\nparticularly remarkable in virtue of its general validity. I will\nreturn to this in a later memoir. (Cantor 1883a or  1932: 169)\n\nCantor says nothing about what it might mean to call the\nwell-ordering hypothesis a ‘law of thought’, and he never\ndid return to this question directly; however, in one form or another,\nthis claim is key. It could be that Cantor at this time considered the\nWOH as something like a logical\nprinciple.[16] This, however, is not\nparticularly clear, especially since the study of formal logic\nadequate for mathematical reasoning was only in its infancy, and the\nset concept itself was new and rather unclearly delimited. Another\nsuggestion is that well-orderability is intrinsic to the way that\n‘well-defined’ sets are either presented or conceived,\ne.g., that it is impossible to think of a collection's being a\nset without at the same time allowing that its elements can be\narranged ‘discretely’ in some way, or even that such\narrangement can be automatically deduced from the\n‘definition’. Thus, if one views sets as necessary for\nmathematics, and one holds that the concept of set itself necessarily\ninvolves the discrete arrangement of the elements of the set, then WOH\nmight appear necessary, too. But all of this is imprecise, not least\nbecause the notion of set itself was imprecise and imprecisely\nformulated. One clear implication of Cantor's remark is that he\nregards the WOH as something which does not require\nproof. Nonetheless, not long after he had stated this, Cantor clearly\nhad doubts both about the well-orderability of the continuum and about\ncardinal comparability (see Moore 1982: 44). All of\nthis suggested that the WOH, and the associated hypothesis that the\nalephs represent the scale of infinite cardinality, do require proof,\nand cannot just be taken as ‘definitional’. Thus, it\nseemed clear that the whole Cantorian project of erecting a scale of\ninfinite size depends at root on the correctness of the WOH.\nWork subsequent to 1884 suggests that Cantor felt the need to\nsupply arguments for well-ordering. For instance (Cantor 1895: 493) to\nshow that every infinite set T has a countable subset (and thus\nthat ℵ0 is the smallest cardinality), Cantor set\nout to prove the existence of a subset of T which is\nwell-ordered like the natural numbers. The key point to observe here\nis that Cantor felt it necessary to exhibit a well-ordered subset\nof T, and did not simply proceed by first assuming (by appeal\nto his ‘Denkgesetz’) that M can be\narranged in well-ordered form. He exhibits such a subset in the\nfollowing way:\n\n\nProof. If one has removed from T a finite number of\n  elements t1, t2,\n  …, tν−1 according to some rule,\n  then the possibility always remains of extracting a further\n  element tν. The set {tν},\n  in which ν denotes an arbitrary finite, cardinal number, is a\n  subset of T with the cardinal number ℵ0,\n  because {tν} ∼ {ν}. (Cantor 1895:\n  493)\n\nIn 1932, Zermelo edited Cantor's collected papers (Cantor 1932),\nand commented on this particular proof as follows:\n\nThe “proof” of Theorem A, which is purely intuitive\n  and logically unsatisfactory, recalls the well-known primitive\n  attempt to arrive at a well-ordering of a given set by successive\n  removal of arbitrary elements. We arrive at a correct proof only\n  when we start from an already well-ordered set, whose smallest\n  transfinite initial segment in fact has the cardinal number\n  ℵ0 sought. (Zermelo in Cantor 1932: 352)\n\nThe second context in which an argument was given was an attempt\nby Cantor (in correspondence first with Hilbert and then Dedekind) to\nshow that every set must have an aleph-number as a\ncardinal.[17] What Cantor attempts to\nshow, in effect, is the following. Assume that Ω represents the\nsequence of all ordinal numbers, and assume (for a reductio argument)\nthat V is a ‘multiplicity’ which is not equivalent\nto any aleph. Then Cantor argues that Ω can be\n‘projected’ into V, in turn showing that V\nmust be what he calls an ‘inconsistent multiplicity’,\ni.e., not a legitimate set. It will follow that all sets have alephs\nas cardinals, since they will always be ‘exhausted’ by\nsuch a projection by some ordinal or other, in which case they will be\ncardinally equivalent to some ordinal\nnumber-class.[18] Zermelo's\ndismissal of this attempted proof is no surprise, given the comments\njust quoted. But he also comments further here exactly on this\n‘projection’:\n\nThe weakness of the proof outlined lies precisely\nhere. It is not proved that the whole series of numbers Ω can be \n“projected into” any multiplicity V which does not\nhave an aleph as a cardinal number, but this is rather taken from a\nsomewhat vague “intuition”. Apparently Cantor imagines the\nnumbers of Ω successively and arbitrarily assigned to elements\nof V in such a way that every element of V is only used\nonce. Either this process must then come to an end, in that all\nelements of V are used up, in which case V would be then\nbe coordinated with an initial segment of the number series, and its\npower consequently an aleph, contrary to assumption; or V would\nremain inexhaustible and would then contain a component equivalent to\nthe whole of Ω, thus an inconsistent component. Here, the\nintuition of time [Zeitanschauung] is being applied to a process which\ngoes beyond all intuition, and a being [Wesen] supposed which can make\nsuccessive arbitrary choices and thereby define a subset V′\nof V which is not definable by the conditions given. (Zermelo in Cantor 1932:\n 451)[19]\n\nIf it really is ‘successive’ selection which is relied\non, then it seems that one must be assuming a subset of instants of\ntime which is well-ordered and which forms a base ordering from which\nthe ‘successive’ selections are made. In short, what is\nreally presupposed is a well-ordered subset of temporal instants which\nacts as the basis for a recursive definition. Even in the case of\ncountable subsets, if the ‘process’ is actually to come to\na conclusion, the ‘being’ presupposed would presumably\nhave to be able to distinguish a (countably) infinite, discrete\nsequence of instants within a finite time, and this assumption is, as\nis well-known, a notoriously controversial one. In the general case,\nthe position is actually worse, for here the question of the\nwell-orderability of the given set depends at the very least on the\nexistence of a well-ordered subset of temporal instants of arbitrarily\nhigh infinite cardinality. This appears to go against the assumption\nthat time is an ordinary continuum, i.e., of cardinality\n2ℵ0, unless of course the power set of\nthe natural numbers itself is too ‘big’ to be counted by\nany ordinal, in which case much of the point of the argument would be\nlost, for one of its aims is presumably to show that the power of the\ncontinuum is somewhere in the\naleph-sequence.[20]\nPart of what is at issue here, at least implicitly, is what\nconstitutes a proof. It seems obvious that if a set is non-empty, then\nit must be possible to ‘choose’ an element from it (i.e.,\nthere must exist an element in it). Indeed, the obviousness of this is\nenshrined in the modern logical calculus by the way the inference\nprinciple of Existential Instantiation (EI) usually works: from\n∃xPx one assumes Pc, where\n‘c’ is a new constant, and reasons on that basis;\nwhatever can be inferred from\nP(c) (as long as it does not itself contain the new constant\n‘c’) is then taken to be inferable from ∃xPx\nalone. Furthermore, it is clear how this extends to finite sets (or\nfinite extensions) by stringing together successive inferential\nsteps. But how can such an inferential procedure be extended to\ninfinite sets, if at all?\nSome evidence of the centrality of WOH is provided by Problem 1 on\nHilbert's list of mathematical problems in his famous lecture to\nthe International Congress of Mathematicians in Paris in 1900. He\nnotes Cantor's conviction of the correctness of CH, and its\n‘great probability’, then goes on to mention another\n‘remarkable assertion’ of Cantor's, namely his\nbelief that the continuum, although not (in its natural order) in\nwell-ordered form, can be rearranged as a well-ordered set. However,\nRussell, writing at roughly the same time, expressed doubts about\nprecisely this:\n\nCantor assumes as an axiom that every class is the field of some\n  well-ordered series, and deduces that all cardinals can be\n  correlated with ordinals …. This assumption seems to me\n  unwarranted, especially in view of the fact that no one has yet\n  succeeded in arranging a class of 2α0\n  terms in a well-ordered series. (Russell 1903: 322–323)\n\nHe goes on:\n\nWe do not know that of any two different cardinal numbers one\nmust be the greater, and it may be that\n2α0 is neither greater nor less that\nα1 and α2 and their successors,\nwhich may be called well-ordered cardinals because they apply to\nwell-ordered series. (Russell 1903:\n 323)[21]\n\nAnd recall that, at the International Congress of Mathematicians in\nHeidelberg in 1904, König had given an apparently convincing\nproof that the continuum cannot be an aleph. König's\nargument, as we know, turned out to contain fatal flaws, but in any\ncase, the confusion it exhibits is\ninstructive.[22]\nIn short, the clear impression in the immediate period leading up\nto Zermelo's work was both that only the WOH would provide a\nsolid foundation on which to build a reasonable notion of infinite\ncardinal number as a proper framework for tackling CH, and that WOH\nrequires justification, that it must become, in effect, the WOT, the\nWO-Theorem. In short, establishing the WOT was closely bound up with\nthe clarification of what it is to count as a set.\n2.2.2  Zermelo's 1904 Proof of the Well-Ordering Theorem\nZermelo's approach to the well-ordering problem took place in\nthree stages. He published a proof of WOT in 1904 (Zermelo 1904, an\nextract from a letter to Hilbert), where he first introduced the\n‘choice’ principle, a principle designed (despite the name\nit has come to bear) to move away from the Cantorian\n‘choosing’ arguments which almost universally preceded\nZermelo's work, and which postulates that arbitrary\n‘choices’ have already been made. This paper produced an\noutcry, to which Zermelo responded by producing a new proof \n(1908a), which again uses the choice principle, but this time\nin a somewhat different form and expressed now explicitly as an\naxiom. The first three pages of this paper give the new proof; this\nwas then followed by seventeen pages which reply in great detail to\nmany of the objections raised against the first proof. These consisted\nin objections to the choice principle itself, and also objections to\nthe unclarity of the underlying assumptions about, and operation with,\nsets used in the proof. This paper was followed just two months later\nby Zermelo's official axiomatisation (1908b), an\naxiomatisation which to a large degree was prefigured in the paper\n(1908a).\nZermelo's 1904 proof can be briefly described.\n\n(1) Let M be an arbitrarily given set, and let M be its power set. Assume given what Zermelo calls a\n‘covering’ of M, i.e., a function γ\nfrom non-empty elements of M to M such that\nγ(X) ∈ X, in other words, what would now be called a choice\nfunction. The argument then shows that such a γ determines a\nunique well-ordering\nof M.[23]\n(2) Using a fixed such γ, Zermelo then defines the so-called\nγ-sets Mγ. These satisfy the following\nconditions:\nMγ ⊆ M;\nMγ is well-ordered by some ordering\n≺ specific to Mγ;\nIf a ∈ Mγ, then a must\ndetermine an initial segment A of Mγ\nunder ≺; but now γ and ≺ must be related in such a\nway that a = γ(M − A), i.e., a is the\n‘distinguished element’ (as Zermelo calls it) of the\ncomplement of A in M.\n\n(3) There clearly are γ sets:\n{m1} is one such, where \nm1 = γ(M) and\nwhere we take the trivial well-ordering. The set\n{m1, m2} is also a γ-set,\nwhere again \nm1 = γ(M),\nm2 = γ(M − {m1}), and\n{m1, m2} is given the ordering\nwhich places m2 after m1. (Note\nthat \n{m1, m2} with the other\nordering would not be a γ-set.) In fact, it is easy to see that\nif \nM′ ⊆ M is to be a γ-set, then\ncondition (2)(c) means that ≺ is uniquely (one is tempted to\nsay, recursively) determined.\n(4) Indeed, following this, Zermelo shows that of any two distinct\nγ-sets, one is identical to an initial segment of the other, and\nthe well-ordering of the latter extends the well-ordering of the\nformer.\n(5) Zermelo now considers the set Lγ,\nwhich is the union taken over all the γ-sets. It is not\ndifficult to see that Lγ itself must be a\nγ-set, indeed, the largest such. By\ndefinition, \nLγ ⊆ M; but Zermelo shows\nthat equality must hold. If not, then\nM − Lγ would be a non-empty subset\nof M, in which case we can consider\nγ(M − Lγ)\n= m1′. Now form\nLγ′ Lγ\n∪ {m1′}, and supply it with the\nwell-ordering which is the same as that in Lγ,\nexcept that we extend it by fixing that\nx ≺ m1′ for any \nx ∈ Lγ. Clearly\nnow Lγ′ is a γ-set, but one which\nproperly extends Lγ, which is a\ncontradiction. Thus \nLγ′ = M, and so M\ncan be well-ordered by the ordering\nof Lγ′.[24]\n\nAs Zermelo points out (p. 516 of his paper), the WOT establishes a\nfirm foundation for the theory of infinite cardinality; in particular,\nit shows, he says, that every set (‘for which the totality of\nits subsets etc. has a sense’) can be considered as a\nwell-ordered set ‘and its power considered as an\naleph’. Later work of Hartogs (see Hartogs 1915) showed that,\nnot only does WOT imply COMP as Zermelo shows, but that COMP itself\nimplies WOT, and thus in turn Zermelo's choice principle. Thus,\nit is not just COMP which is necessary for a reasonable theory of\ninfinite cardinality, but WOT itself. Despite Zermelo's\nendorsement here, the correctness of the hypothesis that the scale of\naleph numbers represents all cardinals (AH, for short) is a more\ncomplicated matter, for it involves the claim that every set is\nactually equivalent to an initial segment of the ordinals, and not\njust well-orderable. In axiomatic frameworks for sets, therefore, the\ntruth of AH depends very much on which ordinals are present as sets in\nthe system.\nThe subsequent work showing the independence of AC from the other\naxioms of set theory vindicates Zermelo's pioneering work; in\nthis respect, it puts Zermelo's revelation of the choice\nprinciple in a similar position as that which Hilbert ascribes to the\nParallel Postulate in Euclid's work. Hilbert claims that Euclid\nmust have realised that to establish certain ‘obvious’\nfacts about triangles, rectangles etc., an entirely new axiom\n(Euclid's Parallel Postulate) was necessary, and moreover that\nGauß was the first mathematician ‘for 2100 years’ to\nsee that Euclid had been right (see Hallett and Majer 2004:261–263 and 343–345).\nThis ‘pragmatic attitude’, which is on display in\nZermelo's second paper on well-ordering from 1908, became, in\neffect, the reigning attitude towards the choice principle: If certain\nproblems are to be solved, then the choice principle must be\nadopted. In 1908, Zermelo brings out this parallel explicitly:\n\nBanishing fundamental facts or problems from science merely\n  because they cannot be dealt with by means of certain prescribed\n  principles would be like forbidding the further extension of the\n  theory of parallels in geometry because the axiom upon which this\n  theory rests has been shown to be unprovable. (Zermelo 1908a:\n  115)\n\nZermelo does not in 1904 call the choice principle an axiom; it\nis, rather, designated a ‘logical principle’. What Zermelo\nhas to say by way of an explanation is very short:\n\nThis logical principle cannot, to be sure, be reduced to a still\n  simpler one, but it is applied without hesitation everywhere in\n  mathematical deduction. (Zermelo 1904: 516)\n\nIt is not clear from this whether he thinks of the choice principle\nas a ‘law of thought’, as the term ‘logical\nprinciple’ might suggest, or whether he thinks it is just\nintrinsic to mathematical reasoning whenever sets are involved, a\nposition suggested by the reference to its application\n‘everywhere in mathematical deduction’. By the time of his\nsecond well-ordering paper of 1908, Zermelo seems to have moved away\nfrom the idea of AC as a ‘logical’ principle in the sense\nof a logical law, and appears to put the emphasis more on the view of\nit as intrinsic to the subject matter; there it appears as Axiom IV,\nand, as we saw, Axiom VI of Zermelo\n 1908b.[25]\n2.2.3  Objections to the 1904 Proof\nThere were three central objections.\n\nObjections to the Choice Principle. \nObjections to Zermelo's general operation with sets, especially well-orderings. \nObjections to impredicative definitions.\n\nLet us briefly deal with these. \n(a) The objections to the choice principle were of two kinds. The\nmain objection was put forward by Borel in 1905 in\nthe Mathematische Annalen (Borel 1905), the journal which\npublished Zermelo's paper, and it is also widely discussed in\ncorrespondence between some leading French mathematicians, and also\npublished in that year in the same Journal (see Hadamard et\nal. 1905). The objection is basically that Zermelo's principle fails\nto specify a ‘law’ or ‘rule’ by which the\nchoices are effected; in other words, the covering used is not\nexplicitly defined, which means that the resulting well-ordering is\nnot explicitly defined either. In a letter to Borel, Hadamard makes it\nclear that the opposition in question is really that between the\nassumption of the existence of an object which is fully described, and\nof the existence of an object which is not fully described (see\nHadamard et al. 1905, esp. 262). In his reply, Zermelo remarks that\nthe inability to describe the choices is why the choice principle is\nin effect an axiom, which has to be added to the other principles. In\neffect, the position is that if one wants to do certain things which,\ne.g., rely on the WOT, then the choice principle is indispensable. His\nposition, to repeat, is like the one that Euclidean geometry takes\ntowards parallels. \n (b) An objection to the choice principle was also put forward by\nPeano. This objection seems to be that since the choice principle\ncannot be proved ‘syllogistically’ (i.e., from the\nprinciples of Peano's Formulario), then it has to be rejected (see\nPeano 1906). (Peano does think, however, that finite versions of the\nchoice principle are provable, relying essentially on repeated\napplications of a version for classes of the basic logical principle\nEI mentioned above (§2.2.1).\nZermelo's reply is the following. Axiom systems like Peano's are\nconstructed so as to be adequate for mathematics; but how does one go\nabout selecting the ‘basic principles’ required? One\ncannot assemble a complete list of adequate principles, says Zermelo,\nwithout careful inspection of actual mathematics and thereby a careful\nassessment of what principles are actually necessary to such a list,\nand such inspection would show that the choice principle is surely one\nsuch; in other words, a selection of principles such as Peano's is\nvery much a post hoc procedure. The reply to Peano is of a piece with\nthe reply to Borel, and recalls strongly the invocation in Zermelo\n(1908b: 261), that it is necessary to distill principles from the\nactual operation with sets. He supports his claim that the choice\nprinciple is necessary by a list of seven problems which ‘in my\nopinion, could not be dealt with at all without the principle of\nchoice’ (Zermelo 1908a:\n 113).[26]\n In particular he points out that the\nprinciple is indispensable for any reasonable theory of infinite\ncardinality, for only it guarantees the right results for infinite\nunions/sums, and in addition is vital for making sense of the very\ndefinition of infinite product. That Peano cannot establish the choice\nprinciple from his principles, says Zermelo, strongly suggests that\nhis list of principles is not ‘complete’ (Zermelo 1908a:\n112). \n (c) Another line of objection, represented in different ways by\nBernstein (Bernstein 1905), Jourdain (Jourdain 1904, 1905b) and Schoenflies (Schoenflies 1905), was that Zermelo's general\noperation with sets in his proof was dangerous and flirts with\nparadox. (See also Hallett 1984, 176–182.) In its imprecise form, the objection is that Zermelo is less\nthan explicit about the principles he uses in 1904, and that he\nemploys procedures which are reminiscent of those used crucially in\nthe generation of the Burali-Forti antinomy, e.g., in showing that if\nthe set\nLγ ≠ M, then it can be extended. \n(What if Lγ is already the collection W?) \n Zermelo's reply is dismissive, but there is something to the\ncriticism. Certainly Zermelo's 1904 proof attempts to show that WOT\ncan be proved while by-passing the general abstract theory of\nwell-ordering and its association with the Cantorian ordinals, and\ntherefore also bypassing the ‘the set W’ (as it was\nwidely known) of all Cantorian ordinals (denoted ‘Ω’\nby Cantor), and consequently the Burali-Forti antinomy. However,\nwhatever Zermelo's intention, there is no explicit attempt to exclude\nthe possibility that Lγ = W and thus the\nsuggestion that antinomy might threaten. Of course, Zermelo, referring\nto critics who ‘base their objections upon the\n“Burali-Forti antinomy” ’, declares that this\nantinomy ‘is without significance for my point of view, since\nthe principles I employed exclude the existence of a set W [of\nall ordinals]’ (Zermelo 1908a: 128, with earlier hints on\n118–119) that the real problem is with the ‘more\nelementary’ Russell antinomy. It is also true that at the end of\nthe 1904 paper, Zermelo states that the argument holds for those\nsets M ‘for which the totality of subsets, and so on, is\nmeaningful’, which, in retrospect is clearly a hint at important\nrestrictions on set formation. Even so, Zermelo's attitude is\nunfair. It could be that the remark about ‘the totality of\nsubsets etc.’ is an indirect reference to difficulties with the\ncomprehension principle, but even so the principle is not repudiated\nexplicitly in the 1904 paper, neither does Zermelo put in its place\nanother principle for the conversion of properties to sets, which is\nwhat the Aussonderungsaxiom of the 1908 axiomatisation\ndoes. Moreover, he does not say that the existence principles on which\nthe proof is based are the only set existence principles, and he does\nnot divorce the proof of the theorem from the Cantorian assumptions\nabout well-ordering and ordinals. Indeed, Zermelo assumes that\n‘every set can be well-ordered’ is equivalent to the\nCantorian ‘every cardinality is an aleph’ (Zermelo 1904:\n141). And despite his later claim (Zermelo 1908a: 119), he does appear\nto use the ordinals and the informal theory of well-ordering in his\ndefinition of γ-sets, where a γ-set is ‘any\nwell-ordered Mγ…’, without any\nspecification of how ‘well-ordered set’ is to be\ndefined. What assurance is there that this can all be reduced to\nZermelo's principles? One important point here is that it had not yet\nbeen shown that all the usual apparatus of set-theoretic mathematics\n(relations, ordering relations, functions, cardinal equivalence\nfunctions, order-isomorphisms, etc.) could be reduced to a few simple\nprinciples of set existence. All of this was to come in the wake of\nZermelo's axiomatisation, and there is little doubt that this line of\ncriticism greatly influenced the shape of the second proof given in\n1908, of which a little more below. \n (d) The last line of objection was to a general feature of the\n1904 proof, which was not changed in the second proof, namely the use\nof what became known as ‘impredicative definition’. An\nimpredicative definition is one which defines an object a by a\nproperty A which itself involves reference, either direct or\nindirect, to all the things with that property, and this must, of\ncourse, include a itself. There is a sense, then, in which the\ndefinition of a involves a circle. Both Russell and\nPoincaré became greatly exercised about this form of\ndefinition, and saw the circle involved as being\n‘vicious’, responsible for all the paradoxes. If one\nthinks of definitions as like construction principles, then indeed\nthey are illegitimate. But if one thinks of them rather as ways of\nsingling out things which are already taken to exist, then they are\nnot illegitimate. In this respect, Zermelo endorses Hilbert's view of\nexistence. To show that some particular thing ‘exists’ is\nto show that it is in 𝔅, i.e., to show by means of a finite\nproof from the axioms that it exists in 𝔅. What\n‘exists’, then, is really a matter of what the axioms,\ntaken as a whole, determine. If the separation, power set and choice\nprinciples are axioms, then for a given M in the domain, there\nwill be choice functions/sets on the subsets of M, consequently\nwell-orderings, and so forth; if these principles are not included as\naxioms, then such demonstrations of existence will not be\nforthcoming. From this point of view, defining within the language\ndeployed is much more like what Zermelo calls\n‘determination’, since definitions, although in a certain\nsense arbitrary, have to be supported by existence proofs, and of\ncourse in general it will turn out that a given extension can be\npicked out by several, distinct ‘determinations’. In\nshort, Zermelo's view is that definitions pick out (or determine)\nobjects from among the others in the domain being axiomatised; they\nare not themselves responsible for showing their existence. In\nthe end, the existence of a domain 𝔅 has to be guaranteed by a\nconsistency proof for the collection of axioms. Precisely this view\nabout impredicative definitions was put forward in Ramsey (1926:\n368–369) and then later in Gödel's 1944 essay on Russell's\nmathematical logic as part of his analysis of the various things which\ncould be meant by Russell's ambiguously stated Vicious Circle\nPrinciple. (See Gödel 1944: 136, 127–128 of the reprinting\nin Gödel 1990. See also Hadamard's letters in Hadamard et\nal. 1905.) To support his view, Zermelo points out that impredicative\ndefinitions are taken as standard in established mathematics,\nparticularly in the way that the least upper bound is defined; witness\nthe Cauchy proof of the Fundamental Theorem of Algebra. Once again,\nZermelo's reply is coloured by the principle of looking at the actual\npractice of mathematics.[27] \n2.2.4  Zermelo's second proof of the WOT, 1908\nAs mentioned, Zermelo published a second proof of the WOT,\nsubmitted to Mathematische Annalen just two weeks before the\nsubmission of his ‘official’ axiomatisation, and published\nin the same volume as that axiomatisation. This proof is too elaborate\nto be described here; a much fuller description can be found in\nHallett (2010b: 94–103), but some brief remarks about it must be\nmade nevertheless. Recall that the purpose of the proof was, in large\npart, to reply to (some of) the criticisms raised in objection to the\n1904 proof, and not least to clarify the status of the choice\nprinciple. \n Suppose M is the set given, and suppose (using Zermelo's\nnotation) that 𝔘M is the set of its subsets\n(‘Untermengen’). The basic procedure in the 1904 proof was\nto single out certain subsets of M and to show that these can\nin effect be ‘chained’ together, starting from modest\nbeginnings (and using the choice function γ); thus we have\n{m1}, where \nm1 = γ(M),\n{m1, m2}, where\nagain \nm1 = γ(M)\nand \nm2 = γ(M −\n{m1}), and so on. In this way, the proof\nshows that one can ‘build up’ to the whole of M\nitself.[28] This\n‘build-up’ is one of the things which provoked scepticism,\nand particularly the step which shows that M itself must be\nembraced by it. In the 1908 proof, the basic idea is to start\nfrom M itself, and consider ‘cutting down’ by the\nelement ‘chosen’ by the choice principle, instead of\nbuilding up. Thus, if one accepts that if M is a legitimate\nset, then so is 𝔘M, and there is not the same danger of\nextending into inconsistent sets, not even the appearance of\ndanger. Again the key thing is to show that the sets defined are in\nfact ‘chained’ together and are in the right way\nexhaustive. \n In the 1904 proof, there are points where it looks as if Zermelo\nis appealing to arbitrary well-orderings, and thus indirectly\narbitrary ordinals. This is avoided in the 1908 proof (as it could\nhave been in the 1904 proof) by focusing on the particular\n‘chain’ which the proof gives rise to. It is this chain\nitself which exhibits the well-ordering. \n In the modern understanding of set theory, to show that there is a\nwell-ordering on M would be to show that there is a set of\nordered pairs of members of M which is a relation satisfying\nthe right properties of a well-ordering relation over M. It is\nwell to remember that Zermelo's task in 1908 was constrained in that he had to\nestablish the existence of a well-ordering using only the\nset-theoretical material available to him. This material did not\ninvolve the general notion of ordinal and cardinal numbers, not even\nthe general notions of relation and function. What Zermelo used,\ntherefore, was the particular relation\na ⊆ b of being a subset,\nand it is important to observe that the chain produced is\nordered by this relation. \n Why would one expect this latter to work? Well, the chain produced\nis naturally a subset well-ordering, for it is both linear and also\nsuch that the intersection of arbitrary elements of members of the\nchain is itself a member of the chain, and thus there is a natural\nsubset-least element for each subset of members of the chain. But the\nwider explanation is hinted at towards the end of Zermelo's\nproof. Suppose a set M is (speaking informally) de facto\nwell-ordered by an ordering relation ≺. Call the set\nℜ≼(a) = {x\n∈ M : a ≼ x} the\n‘remainder [Rest]’ determined by a and the ordering\n≺. Consider now the set of ‘remainders’ given by\nthis ordering, i.e.,\n{ℜ≼(x) : x\n∈ M}. This set is in fact well-ordered by reverse\ninclusion, where the successor remainder to\nℜ≼(a) is just the remainder determined\nby a's successor a′ under ≺, and where\nintersections are taken at the limit elements (the intersection of a\nset of remainders is again a remainder). But not only is this set\nwell-ordered by reverse inclusion, the ordering is isomorphic to the\nordering ≺ on M, that is: \n\na ≺ b if and only if\nℜ≼(b) ⊂\nℜ≼(a).\n\nZermelo's 1908 construction is now meant to define a\n‘remainder set’ directly without detour through some\n≺; the resultant inclusion ordering is then\n‘mirrored’ on M. The key thing is to show that the\nchain of subsets of M picked out really matches M\nitself. But if there were some element a\n∈ M which did not correspond to a remainder\nℜ≼(a), then it must be possible to use\nthe choice function to ‘squeeze’ another remainder into\nthe chain, which would contradict the assumption that all the sets\nwith the appropriate definition are already in the\nchain.[29] We\nhave spoken of functions and relations here. But in fact Zermelo\navoids such talk. He defines M as being\n‘well-ordered’ when each element in M\n‘corresponds’ uniquely to such a ‘remainder’\n(Zermelo 1908a: 111). This shows, says Zermelo, that the theory of\nwell-ordering rests ‘exclusively upon the elementary notions of\nset theory’, and that ‘the uninformed are only too prone\nto look for some mystical meaning behind Cantor's relation\na ≺ b’ (Zermelo 1908a). \n One can be considerably more precise about the relation between\norderings on M and ‘remainder inclusion orderings’\nin 𝔘M. Much of this was worked out in Hessenberg (1906), and\nwas therefore known to Zermelo (Zermelo and Hessenberg were in regular\ncontact), and simplified greatly by Kuratowski in the 1920s. We will\nhave reason to refer to Kuratowski briefly in the next\nsection.[30] \n What about the choice principle? In 1904, this is framed in effect\nas a choice function, whose domain is the non-empty subsets\non M. But in 1908, Zermelo frames it differently: \n Axiom IV. A set S that can be decomposed into a\nset of disjoint parts A, B, C, …, each\ncontaining at least one element, possesses at least one\nsubset S1 having exactly one element in common with\neach of the parts A, B, C, …\nconsidered. (Zermelo 1908a: 110)\n\nIn other words, the choice principle is now cast in a set form, and\nnot in the function form of 1904. \n In the 1908 axiomatisation, the axiom is stated in much the same\nway, but is called there (though not in the well-ordering paper) the\n‘Axiom of Choice’. However, the 1908 paper on WOT does say\nthat the axiom provides a set (the S1) of\n‘simultaneous choices’, to distinguish them from the\n‘successive choices’ used in the pre-Zermelo versions of\nwell-ordering. It is to be noted that in 1921, Zermelo wrote to\nFraenkel in partial repudiation of the designation ‘Axiom of\nChoice’, saying that ‘there is no sense in which my theory\ndeals with a real\n“choice” ’.[31]\n2.2.5  The Axioms of the 1908 WOT Paper\nWhat axioms governing set-existence does Zermelo rely on in Zermelo\n(1908a)? At the start of the paper, Zermelo list two\n‘postulates’ that he explicitly depends on, a version of\nthe separation axiom, and the power set axiom. Later on he lists Axiom\nIV, which, as noted, asserts the existence of a choice set for any set\nof disjoint non-empty sets. In addition to this, Zermelo makes use of\nthe existence of various elementary sets, though he doesn't say\nexactly which principles he relies on. In the axiomatisation which\nfollows two weeks later, Zermelo adopts all these axioms, but adds\nclarification about the elementary sets. He also adds the Axiom of Infinity, to\nguarantee that there are infinite sets, and the Axiom of\nExtensionality, which codifies the assumption that sets are really\ndetermined by their members, and not by the accidental way in which\nthese members are selected. In addition, as we have noted,\nhe now calls the Axiom of Choice by this name. \n\n3. The Major Problems with Zermelo's System\nZermelo's system, although it forms the root of all modern\naxiomatisations of set theory, initially faced various\ndifficulties. These were: \n\nProblems with the Axiom of Choice.\nProblem with the formulation of the Separation Axiom.\nProblems of ‘completeness’, one of Hilbert's important desiderata on the adequacy of an axiom system. Specifically, there were problems representing ordinary mathematics purely set-theoretically, and also problems representing fully the transfinite extension of mathematics which Cantor had pioneered.\n\nThe problems concerning the Axiom of Choice were discussed above;\nwe now discuss the difficulties with the formulation of Separation and\nthose of ‘completeness’.\n3.1  Separation\nThe problem with the Axiom of Separation is not with the\nobviousness of the principle; it seems straightforward to accept that\nif one has a set of objects, one can separate off a subclass of this\nset by specifying a property, and treat this in turn as a set. The\nquestion here is a subtler one, namely that of how to formulate this\nprinciple as an axiom. What means of ‘separating off’ are\nto be accepted? What are allowable as the properties? As a matter of\npractice, we use a language to state the properties, and in informal\nmathematics, this is a mixture of natural language and special\nmathematical language. The Richard Paradox (see Richard 1905 and also\nthe papers of Poincaré 1905, 1906a,b) makes it clear that one\nhas to be careful when defining properties, and that the unregulated\nuse of ‘ordinary language’ can lead to unexpected\ndifficulties.\nZermelo's answer to this, in moving from the system of the second\nwell-ordering paper to the axiomatisation, is to try specifying what\nproperties are to be allowed. He calls the properties to be allowed\n‘definite properties’\n(‘Klassenaussagen’ or ‘propositional\nfunctions’), and states:\n\nA question or assertion 𝔈 is said to be\n“definite” if the fundamental relations of the domain, by\nmeans of the axioms and the universally valid laws of logic, determine\nwithout arbitrariness whether it holds or not. Likewise a\n“propositional function” 𝔈(x), in which the\nvariable term x ranges over all individuals of a\nclass 𝔎, is said to be “definite” if it is definite\nfor each single individual x of the class 𝔎. Thus the\nquestion whether\na ε b or not is always\ndefinite, as is the question whether M\n⊆ N or not.\n\nZermelo asserts that this shows that paradoxes involving the\nnotions of definability (e.g., Richard's) or denotation (König's)\nare avoided, implying that what is crucial is the restriction to the\n‘fundamental relations of the domain’ (so, ε,\n=).\nThe basic problem is that it is not explained by Zermelo what the\nprecise route is from the fundamental relations ε and = to a\ngiven ‘definite property’; it is this which gives rise to\na general doubt that the Separation Axiom is not, in fact, a safe\nreplacement for the comprehension principle (see Fraenkel 1927:\n104). This plays into the hands of those, who, like Poincaré,\nconsider adoption of the Separation Axiom as insufficiently radical in\nthe search for a solution to the paradoxes. Poincaré\nwrites:\n\nMr. Zermelo does not allow himself to consider the set of all the\nobjects which satisfy a certain condition because it seems to him that\nthis set is never closed; that it will always be possible to introduce\nnew objects. On the other hand, he has no scruple in speaking of the\nset of objects which are part of a certain Menge M and which\nalso satisfy a certain condition. It seems to him that one cannot\npossess a Menge without possessing at the same time all its\nelements. Among these elements, he will choose those which satisfy a\ngiven condition, and will be able to make this choice very calmly,\nwithout fear of being disturbed by the introduction of new and\nunforeseen elements, since he already has all these elements in his\nhands. By positing beforehand this Menge M, he has erected an\nenclosing wall which keeps out the intruders who could come from\nwithout. But he does not query whether there could be intruders from\nwithin whom he enclosed inside his wall. (Poincaré 1909: 477;\np. 59 of the English translation)\n\nHere, Poincaré is referring indirectly to his view that the\nparadoxes are due to impredicative set formation, and this of course\nwill be still be possible even with the adoption of the Axiom of\nSeparation.\nThe problem of the lack of clarity in Zermelo's account was\naddressed by Weyl in 1910 (Weyl 1910; see especially p. 113) and then\nagain by Skolem in 1922 (Skolem 1923, p. 139 of the reprint). What\nWeyl and Skolem both proposed, in effect, is that the question of what\n‘definite properties’ are can be solved by taking these to\nbe the properties expressed by 1-place predicate formulas in what we\nnow call first-order logic. In effect, we thus have a recursive\ndefinition which makes the definite properties completely transparent\nby giving each time the precise route from ε, = to the\ndefinite property in question. This does not deal with all aspects of\nPoincaré's worry, but it does make it quite clear what definite\nproperties are, and it does also accord with Zermelo's view that the\nrelations =, ε are at root the only ones\nused.[32]\nFraenkel (1922 and later) took a different approach with a rather\ncomplicated direct axiomatisation of the notion of definite property,\nusing recursive generation from the basic properties giving a notion\nwhich appears to be a subset of the recursively defined first-order\nproperties.\nZermelo accepted none of these approaches, for two reasons. First,\nhe thought that the recursive definitions involved make direct use of\nthe notion of finite number (a fact pointed out by Weyl 1910), which\nit ought to be the business of set theory to explain, not to\npresuppose. Secondly, he became aware that using essentially a\nfirst-order notion condemns the axiomatic system to countable models,\nthe fundamental fact pointed out in Skolem (1923). His own approach\nwas, first, to give a different kind of axiomatisation (see Zermelo\n1929), and then to use (in Zermelo 1930) an essentially second-order\nnotion in characterising the axiom of\nseparation.[33]\n3.2  Completeness\nThere were also problems with the completeness of Zermelo's theory,\nsince there were important theoretical matters with which Zermelo does\nnot deal, either for want of appropriate definitions showing how\ncertain constructions can be represented in a pure theory of sets, or\nbecause the axioms set out in Zermelo's system are not strong\nenough.\n3.2.1  Representing Ordinary Mathematics\nZermelo gives no obvious way of representing much of\n‘ordinary mathematics’, yet it is clear from his opening\nremarks that he regards the task of the theory of sets to stand as the\nfundamental theory which should ‘investigate mathematically the\nfundamental notions “number”, “order”, and\n“function” ’. \n(See §1.)\nThe first obvious question concerns the representation of the\nordinary number systems. The natural numbers are represented by\nZermelo as by ∅, {∅}, {{∅}}, …, and the Axiom\nof Infinity gives us a set of these. Moreover, it seems that, since\nboth the set of natural numbers and the power set axiom are available,\nthere are enough sets to represent the rationals and the reals,\nfunctions on reals etc. What are missing, though, are the details: how\nexactly does one represent the right equivalence classes, sequences\netc.? And assuming that one could define the real numbers, how does\none characterise the field operations on them? In addition, as\nmentioned previously, Zermelo has no natural way of representing\neither the general notions of relation or of function. This means that\nhis presentation of set theory has no natural way of representing\nthose parts of mathematics (like real analysis) in which the general\nnotion of function plays a fundamental part.\nA further difficulty is that the lack of the notion of function\nmakes the general theory of the comparison of sets by size (or indeed\nby order) cumbersome. Zermelo does develop a way of expressing, for\ndisjoint sets a, b, that a is of the same size\nas b, by first defining a ‘product’ of two disjoint\nsets, and then isolating a set of unordered pairs (a certain subset of\nthis product) which ‘maps’ one of the sets one-to-one onto\nthe other. But this is insufficiently general, and does not in any\ncase indicate any way to introduce ‘the’ size\nof a. Russell's method (defining the cardinality of M as\nthe set card(M) = {N : N\n∼ M} (where ‘∼’ means\n‘cardinally equivalent to’) is clearly inappropriate,\nsince with a set a = {b},\ncard(a) (which should be the cardinal number 1) is as big as\nthe universe, and the union set of 1 would indeed be the\nuniversal ‘set’. Over and above this, there is the more\nspecific problem of defining the aleph numbers.\nThe second major difficulty is along the same lines, concerning,\nnot functions, but relations, and thus ordering relations and ordinal\nnumbers. As we have seen\n(in §2.2.4), Zermelo has the\nbeginnings of an answer to this in his second proof of the WOT, for\nthis uses a theory of subset-orderings to represent the underlying\nordering of a set. It turns out that the method given in this\nparticular case suggests the right way to capture the general\nnotion.\n3.2.2  Ordinality\nZermelo's idea (1908a) was pursued by Kuratowski in the 1920s,\nthereby generalising and systematising work, not just of Zermelo, but\nof Hessenberg and Hausdorff too, giving a simple set of necessary and\nsufficient conditions for a subset ordering to represent a linear\nordering. He also argues forcefully that it is in fact undesirable for\nset theory to go beyond this and present a general theory of ordinal\nnumbers:\n\nIn reasoning with transfinite numbers one implicitly uses an\n  axiom asserting their existence; but it is desirable both from the\n  logical and mathematical point of view to pare down the system of\n  axioms employed in demonstrations. Besides, this reduction will free\n  such reasoning from a foreign element, which increases its\n  æsthetic value. (Kuratowski 1922: 77)\n\nThe assumption here is clearly that the (transfinite) numbers will\nhave to be added to set theory as new primitives. Kuratowski however\nundertakes to prove that the transfinite numbers can be dispensed with\nfor a significant class of \n applications.[34]\n Application of the ordinal numbers in\nanalysis, topology, etc. often focuses on some process of definition\nby transfinite recursion over these numbers. Kuratowski succeeds in\nshowing that in a significant class of cases of this kind, the\nordinals can be avoided by using purely set-theoretic methods which\nare reproducible in Zermelo's system. As he notes:\n\nFrom the viewpoint of Zermelo's axiomatic theory of sets, one can\nsay that the method explained here allows us to deduce theorems of a\ncertain well-determined general type directly from Zermelo's axioms,\nthat is to say, without the introduction of any independent,\nsupplementary axiom about the existence of transfinite\nnumbers. (Kuratowski 1922: \n 77)[35]\n\nIt is in this reductionist context that Kuratowski develops his\nvery general theory of maximal inclusion orderings, which shows, in\neffect, that all orderings on a can really be represented as\ninclusion orderings on appropriate subsets of the power set\nof a, thus reducing ordering to Zermelo's primitive relation\nε.\nOne immediate, and quite remarkable, result of this work is that it\nshows how one can define the general notions of relation and function\nin purely set-theoretic terms. It had long been recognised that\nrelations/functions can be conceived as sets of ordered pairs, and\nKuratowski's work now shows how to define the ordered pair\nprimitively. The ordered pair (a, b) can be considered\ninformally as the unordered pair M = {a, b},\ntogether with an ordering relation a < b. Suppose\nthis relation is treated now via the theory of inclusion chains. The\nonly maximal inclusion chains in the power set of M are\n{∅, {a}, {a, b}} and {∅,\n{b}, {a, b}}. Using\nKuratowski's definition of the ordering ‘<’ derived\nfrom a maximal inclusion chain, these chains must then correspond to\nthe orderings a < b and b < a\non {a, b} respectively. If\n∅ is ignored, the resulting chain {{a},\n{a, b}} is thus associated with the\nrelation a < b, and so with the ordered set (pair)\n(a, b). It is then quite natural to define\n(a, b) as {{a},\n{a, b}} (see Kuratowski 1921: 170–171). One\ncan now define the product a\n× b of a and b as the set of all\nordered pairs whose first member is in a and whose second\nmember is in b; relations on a can now be treated as\nsubsets of a × a, and\nfunctions from a to b as certain subsets\nof a × b. Thus, many of\nthe representational problems faced by Zermelo's theory are solved at\na stroke by Kuratowski's work, building as it does on Zermelo's\nown.\n3.2.3  Cardinality\nBut there was a problem concerning cardinality which is independent\nof the problem of definitional reduction. It was pointed out by both\nFraenkel and Skolem in the early 1920s that Zermelo's theory cannot\nprovide an adequate account of cardinality. The axiom of infinity and\nthe power set axiom together allow the creation of sets of\ncardinality ≥ ℵn\nfor each natural number n, but this (in the absence of a result\nshowing that 2ℵ0 >\nℵn for every natural number n) is not\nenough to guarantee a set whose power is ≥\nℵω, and a set of power\nℵω is a natural next step (in the Cantorian\ntheory) after those of power ℵn. Fraenkel\nproposed a remedy to this (as did Skolem independently) by proposing\nwhat was called the Ersetzungsaxiom, the Axiom of Replacement (see\nFraenkel 1922: 231 and Skolem 1923: 225–226). This says,\nroughly, that the ‘functional image’ of a set must itself\nbe a set, thus if a is a set,\nthen {F(x) : x\n∈ a} must also be a set, where\n‘F’ represents a functional correspondence. Such an\naxiom is certainly sufficient; assume that a0 is the\nset of natural numbers {0, 1, 2, …}, and now assume that to\neach number n is associated an an with\npower ℵn. Then according to the replacement\naxiom, a =\n{a0, a1, a2,\n…} must be a set, too. This set is countable, of course, but\n(assuming that the an are all disjoint) the union set of a must have cardinality at\nleast ℵω.\nThe main difficulty with the Replacement Axiom is that of how to\nformulate the notion of a functional correspondence. This was not\nsolved satisfactorily by Fraenkel, but the Weyl/Skolem solution works\nhere, too: a functional correspondence is (in effect) just any\nfirst-order 2-place predicate ϕ(x, y) which\nsatisfies the condition of uniqueness,\ni.e., ∀x, y, z{[ϕ(x, y)\n∧ ϕ(x, z)] → y = z}.\nWith this solution, the Replacement Axiom will be (as required)\nstronger than Zermelo's original Separation Axiom and indeed can\nreplace it; however, in Fraenkel's system, one can prove his version\nof the Replacement Axiom from his version of the Separation Axiom,\nwhich shows that his separate definition of function is not\nsufficiently strong. (For details, see Hallett 1984:\n282–286.)\nZermelo initially had doubts about the Replacement Axiom (see the\nletter to Fraenkel from 1922 published in Ebbinghaus 2007: 137), but\nhe eventually accepted it, and a form of it was included in his new\naxiomatisation published in 1930 (Zermelo 1930). Skolem's formulation\nis the one usually adopted, though it should be noted that von\nNeumann's own formulation is rather different and indeed\nstronger.[36]\n3.2.4  Ordinals\nAlthough Kuratowski's work solved many of the representational\nproblems for Zermelo's theory, and the Replacement Axiom shows how the\nmost obvious cardinality gap can be closed, there still remained the\nissue (Kuratowski's view to one side) of representing accurately the\nfull extent of the theory which Cantor had developed, with the\ntransfinite numbers as fully fledged objects which\n‘mirror’ the size/ordering of sets. Once the ordinal\nnumber-classes are present, the representation of the alephs is not a\nsevere problem, which means that the representation of transfinite\nnumbers amounts to assuring the existence of sufficiently many\ntransfinite ordinal numbers. Indeed, as was stated above, the\nhypothesis that the scale of aleph numbers is sufficient amounts to\nthe claim that any set can be ‘counted’ by some\nordinal. There are then two interrelated problems for the\n‘pure’ theory of sets: one is to show how to define\nordinals as sets in such a way that the natural numbers generalise;\nthe other problem is to make sure that there are enough ordinals to\n‘count’ all the sets.\nThe problem was fully solved by von Neumann in his work on\naxiomatic set theory from the early 1920s. Cantor's fundamental\ntheorems about ordinal numbers, showing that the ordinals are the\nrepresentatives of well-ordered sets, are the theorem that every\nwell-ordered set is order-isomorphic to an initial segment of the\nordinals, and that every ordinal is itself the order-type of the set\nof ordinals which precede it. These results prove crucial in the von\nNeumann treatment. Von Neumann's basic idea was explained by him as\nfollows:\n\nWhat we really wish to do is to take as the basis of our\nconsiderations the proposition: ‘Every ordinal is the type of\nthe set of all ordinals that precede it’. But in order to avoid\nthe vague notion ‘type’, we express it in the form:\n‘Every ordinal is the set of the ordinals that precede\nit’. (von Neumann 1923, p. 347 of the English translation)\n\nAccording to von Neumann's idea, 1 is just {0}, 2 is just {0, 1}, 3\nis just {0, 1, 2} and so on. On this conception, the first transfinite\nordinal ω is just {0, 1, 2, 3, …, n, …},\nand generally it's clear that the immediate successor of any ordinal\nα is just α ∪ {α}. If we\nidentify 0 with ∅, as Zermelo did, then we have available a\nreduction of the general notion of ordinal to pure set theory, where\nthe canonical well-ordering on the von Neumann ordinals is just the\nsubset relation, i.e., α < β just in case α ⊂\nβ, which von Neumann later shows is itself equivalent to saying\nα ∈ β. (See von Neumann 1928, p. 328 of the\nreprinting.) So again, inclusion orderings are fundamental.\nVon Neumann gives a general definition of his ordinals, namely that\na set α is an ordinal number if and only if it is a set ordered\nby inclusion, the inclusion ordering is a well-ordering, and each\nelement ξ in α equals the set of elements in the initial\nsegment of the ordering determined by ξ. This connects directly\nwith Kuratowski's work in the following way. Suppose M is a\nwell-ordered set which is then mirrored by an inclusion\nchain M in the power set of M. Then the first few\nelements of the inclusion chain will be the sets ∅, {a},\n{a, b}, {a, b, c}, …,\nwhere a, b, c, … are the first, second,\nthird …elements in the well-ordering of M. The von\nNeumann ordinal corresponding to M will also be an inclusion\nordering whose first elements will be\n∅, {∅}, {∅, {∅}}, {∅, {∅},\n  {∅, {∅}}}, …\n(in other words, 0, 1, 2, 3…), and we have 0 ⊂ 1 ⊂ 2\n⊂ 3 ⊂… in mirror image of\n∅ ⊂ {a} ⊂ {a, b} \n⊂ {a, b, c}\n⊂ …\nThese von Neumann ordinals had, in effect, been developed before\nvon Neumann's work. The fullest published theory, and closest to the\nmodern account, is to be found in Mirimanoff's work published in 1917\nand 1921 (see Mirimanoff 1917a,b, 1921), though he doesn't take the\nfinal step of identifying the sets he characterises with the ordinals\n(for an account of Mirimanoff's work, see Hallett 1984:\n273–275). It is also clear that Russell, Grelling and Hessenberg\nwere close to von Neumann's general set-theoretic definition of\nordinals. But crucially Zermelo himself developed the von Neumann\nconception of ordinals in the years 1913–1916, (for a full\naccount, see Hallett 1984: 277–280 and Ebbinghaus 2007:\n133–134). Zermelo's idea was evidently well-known to the\nGöttingen mathematicians, and there is an account of it in\nHilbert's lectures ‘Probleme der mathematischen\nLogik’ from 1920,\npp. 12–15.[37]\nDespite all these anticipations, it is still right to ascribe the\ntheory to von Neumann. For it was von Neumann who revealed the extent\nto which a full theory of the ordinals depends on the Axiom of\nReplacement. As he wrote later:\n\nA treatment of ordinal number closely related to mine was known\n  to Zermelo in 1916, as I learned subsequently from a personal\n  communication. Nevertheless, the fundamental theorem, according to\n  which to each well-ordered set there is a similar ordinal, could not\n  be rigorously proved because the replacement axiom was unknown. (von\n  Neumann 1928: 374, n. 2)\n\nThe theorem von Neumann states is the central result of Cantor's\nmentioned here in the second paragraph of this section. As von Neumann goes on to point out\nhere (also p. 374), it is the possibility of definition by transfinite\ninduction which is key, and a rigorous treatment of this requires\nbeing able to prove at each stage in a transfinite inductive process\nthat the collection of functional correlates to a set is itself a set\nwhich can thus act as a new argument at the next stage. It is just\nthis which the replacement axiom guarantees. Once justified,\ndefinition by transfinite induction can be used as the basis for\ncompletely general definitions of the arithmetic operations on ordinal\nnumbers, for the definition of the aleph numbers, and so on. It also\nallows a fairly direct transformation of Zermelo's first (1904) proof\nof the WOT into a proof that every set can be represented by (is\nequipollent with) an ordinal number, which shows that in the Zermelo\nsystem with the Axiom of Replacement added there are enough ordinal\nnumbers.[38]\nIt is thus remarkable that von Neumann's work, designed to show how\nthe transfinite ordinals can be incorporated directly into a pure\ntheory of sets, builds on and coalesces with both Kuratowski's work,\ndesigned to show the dispensability of the theory of transfinite\nordinals, and also the axiomatic extension of Zermelo's theory\nsuggested by Fraenkel and Skolem.\n4. Further reading\nFor a summary of the Cantorian theory as it stood in the early\nyears of the twentieth century, see Young and Young (1906), and the\nmagisterial Hausdorff (1914); for further reading on the development\nof set theory, see the books Ferreiros 1999, Hallett 1984, Hawkins\n1970, and Moore 1982. See also the various papers on the history of\nset theory by Akihiro Kanamori (especially Kanamori 1996, 1997, 2003,\n2004, 2012) and the joint paper with Dreben (Dreben and Kanamori\n1997). For the place of set theory in the development of modern logic,\nsee Mancosu et al., 2009, especially pages 345–352.\nFor an account of the various axiom systems and the role of the\ndifferent axioms, see Fraenkel et al. (1973). For a detailed summary\nof the role of the Axiom of Choice, and insight into the question of\nits status as a logical principle, see Bell (2009).\nThis entry will be supplemented by a further entry on\naxiomatizations of set theory after Zermelo from 1920 to 1940.\n", "bibliography": {"categories": [], "cat_ref_text": {"ref_list": ["Bell, J., 2009, <i>The Axiom of Choice</i>, London: College Publications.", "Benacerraf, P. and H. Putnam (eds.), 1964, <i>Philosophy of Mathematics: Selected Readings</i>, Oxford: Basil Blackwell.", "––– (eds.), 1983, <i>Philosophy of Mathematics: Selected Readings</i>, Second Edition, Cambridge: Cambridge University Press.", "Bernstein, F., 1905, “Über die Reihe der transfiniten Ordnungszahlen”, <i>Mathematische Annalen</i> 60: 187–193.", "Borel, E., 1905, “Quelque remarques sur les principes de la théorie des ensembles”, <i>Mathematische Annalen</i> 60: 194–195.", "Browder, F. (ed.), 1976, <i>Mathematical Developments Arising from the Hilbert Problems</i>, Volume 28 of <i>Proceedings of Symposia in Pure Mathematics</i>, Providence: American Mathematical Society.", "Cantor, G., 1883a, “Ueber unendliche, lineare Punktmannichfaltigkeiten” <i>Mathematische Annalen</i> 21: 545–591. <span class=\"bibliography-comment\">Reprinted in Cantor 1883b and in Cantor 1932:  165–209. English translation in Ewald 1996, Volume 2.</span>", "–––, 1883b, <i>Grundlagen einer allegemeinen Mannigfaltichkeitslehre. Ein mathematisch-philosophischer Versuch in der Lehre des Unendlichen</i>, Leipzig: B. G. Teubner.", "–––, 1895, “Beiträge zur Begründung der transfiniten Mengenlehre, Erster Artikel”, <i>Mathematische Annalen</i> 46: 481–512. <span class=\"bibliography-comment\">Reprinted in Cantor 1932: 282–311. English translation in Cantor 1915.</span>", "–––, 1897, “Beiträge zur Begründung der transfiniten Mengenlehre, Zweiter Artikel”, <i>Mathematische Annalen</i> 49: 207–246. Reprinted in Cantor 1932: 312–351. English translation in Cantor 1915.", "–––, 1915, <i>Contributions to the Founding of the Theory of Transfinite Numbers</i>, La Salle: Open Court. <span class=\"bibliography-comment\">English translation of Cantor 1895, 1897 by Philip E. B. Jourdain.</span>", "–––, 1932, <i>Gesammelte Abhandlungen mathematischen und philosophischen Inhalts, mit eläuternden Anmerkungen sowie mit Ergänzungen aus dem Briefwechsel Cantor-Dedekind herausgegeben von Ernst Zermelo</i>, Berlin: Springer.", "–––, 1991, <i>Georg Cantor: Briefe. Herausgegeben von Herbert Meschkowski</i>, Berlin: Springer", "Dedekind, R., 1888, <i>Was sind und was sollen die Zahlen?</i>, Braunschweig: Vieweg und Sohn. <span class=\"bibliography-comment\">Also reprinted in Dedekind 1932: 335–391; English translation in Ewald 1996:  787–833.</span>", "–––, 1932, <i>Gesammelte mathematische Werke. Band 3. Herausgegeben von Robert Fricke, Emmy Noether and Öystein Ore</i>, Braunschweig: Friedrich Vieweg und Sohn. <span class=\"bibliography-comment\">Reprinted with some omissions by Chelsea Publishing Co., New York, 1969.</span>", "Dreben, B. and A. Kanamori, 1997, “Hilbert and set theory”, <i>Synthese</i>, 110: 77–125.", "Ebbinghaus, H.-D., 2007, <i>Ernst Zermelo: An Approach to His Life and Work</i>, Berlin: Springer.", "–––, 2010, “Introductory note to <em>Über den Begriff von Definitheit in der Axiomatik</em> [Zermelo 1929]”, in Zermelo 2010: 352–357.", "Ewald, W. (ed.), 1996, <i>From Kant to Hilbert</i>, Oxford: Oxford University Press.", "Ewald, W., W. Sieg, and M. Hallett (eds.), 2013, <i>David Hilbert's Lectures on the Foundations of Logic and Arithmetic, 1917–1933</i>, Volume 3 of <i>Hilbert's Lectures on the Foundations of Mathematics and Physics, 1891–1933</i>, Berlin: Springer.", "Felgner, U., 2010, “Introductory note to <em>Untersuchungen über die Grundlagen der Mengenlehre, I</em> [Zermelo 1908b]”, in Zermelo 2010:  160–188.", "Ferreiros, J., 1999, <i>Labyrinth of Thought: A History of Set Theory and its Role in Modern Mathematics</i>, Science Networks Historical Studies, Basel: Birkhäuser. Second Revised Edition, 2007", "Fraenkel, A., Y. Bar-Hillel,  and A. Levy, 1973, <i>Foundations of Set Theory</i>. Amsterdam: North-Holland Publishing.", "Fraenkel, A. A., 1922, “Zu den Grundlagen der Cantor-Zermeloschen Mengenlehre”, <i>Mathematische Annalen</i> 86: 230–237.", "–––, 1927, <i>Zehn Vorlesungen über die Grundlegung der Mengenlehre</i>, Leipzig: B. G. Teubner.", "Frege, G., 1879, <i>Begriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens</i>,  Halle: Louis Nebert. <span class=\"bibliography-comment\">Reprinted in Frege 1964, English\ntranslation in van Heijenoort 1967: 1–82.</span>", "–––, 1893, <i>Grundgesetze der Arithmetik</i>, Band 1, Jena: Hermann Pohle. <span class=\"bibliography-comment\">English translation by Philip Ebert and Marcus Rossberg,  <i>Frege, The Basic Laws of Arithmetic, Derived using Concept-Script</i>, Oxford: Oxford University Press, forthcoming.</span>", "–––, 1903, <i>Grundgesetze der Arithmetik</i>, Band II, Jena: Hermann Pohle. <span class=\"bibliography-comment\">English translation by Philip Ebert and Marcus Rossberg,  <i>Frege, The Basic Laws of Arithmetic, Derived using Concept-Script</i>, Oxford: Oxford University Press, forthcoming.</span>", "–––, 1964, <i>Begriffsschrift und andere Aufsätze. Mit E. Husserls und H. Scholz’ Anmerkungen herausgegeben von Ignacio Angelelli</i>, Darmstadt: Wissenschaftliche Buchgesellschaft.", "Gödel, K., 1944, “Russell's mathematical logic”, in P. A. Schillp (ed.), <i>The Philosophy of Bertrand Russell</i>, pp. 125–153, La Salle: Open Court. \n<span class=\"bibliography-comment\">Reprinted in Benacerraf and Putnam 1964: 211–232; Benacerraf and Putnam 1983: 447–469; and in Gödel 1990:  119–141.</span>", "–––, 1990, <i>Kurt Gödel: Collected Works</i>, Volume 2, edited by Solomon Feferman et al., Oxford: Oxford University Press.", "Haaparanta, L. (ed.), 2009, <i>The Development of Modern Logic</i>, Oxford: Oxford University Press.", "Hadamard, J. et al., 1905, “Cinq letters sur la théorie des ensembles”, <i>Bulletin de la société mathématique de France</i>, 33: 261–273. \n<span class=\"bibliography-comment\">Letters between Baire, Borel, Lebesgue and Hadamard on objections to, and defense of, Zermelo's 1904 proof\nof the well-ordering theorem.</span>", "Hallett, M., 1981, “Russell, Jourdain and ‘limitation of size’”, <i>British Journal for the Philosophy of Science</i>, 32: 381–399.", "–––, 1984, <i>Cantorian Set Theory and Limitation of Size</i>, Oxford: Clarendon Press.", "–––, 2008, “The ‘purity of method’ in Hilbert's <i>Grundlagen der Geometrie</i>”, in P. Mancosu (ed.), <i>The Philosophy of Mathematical Practice</i>, pp. 198–255, Oxford: Clarendon Press.", "–––, 2010a, “Frege and Hilbert”, in M. Potter and T. Ricketts (eds.), <i>The Cambridge Companion to Frege</i>, Cambridge: Cambridge University Press.", "–––, 2010b, “Introductory note to Zermelo's two papers on the well-ordering theorem”, in Zermelo 2010:  80–115.", "Hallett, M. and U. Majer (eds.), 2004, <i>David Hilbert's Lectures on the Foundations of Geometry, 1891–1902</i>, Volume 1 of <i>Hilbert's Lectures on the Foundations of Mathematics and Physics, 1891–1933</i>, Berlin: Springer.", "Hardy, G. H., 1904, “A theorem concerning the infinite cardinal numbers”, <i>Quarterly Journal of Pure and Applied Mathematics</i> 35: 87–94.", "Hartogs, F., 1915, “Über das Problem der Wohlordnung”, <i>Mathematische Annalen</i>, 76: 438–442.", "Harward, A. E., 1905, “On the transfinite numbers”, <i>Philosophical Magazine</i> 10(6): 439–460.", "Hausdorff, F., 1914, <i>Grundzüge der Mengenlehre</i>, Leipzig: Von Veit.", "Hawkins, T., 1970, <i>Lebesgue's Theory of Integration</i>. New York: Blaisdell.\n<span class=\"bibliography-comment\">Reprinted by the Chelsea Publishing Company, New York, 1979.</span>", "van Heijenoort, J. (ed.), 1967, <i>From Frege to Gödel: A Source Book in Mathematical Logic</i>, Cambridge, Massachusetts: Harvard University Press.", "Heinzmann, G., 1986, <i>Poincaré, Russell, Zermelo et Peano. Textes de la discusion (1906–1912) sur les fondements des mathématiques: des antinomies à la prédicativité</i>, Paris: Albert Blanchard.", "Hessenberg, G., 1906, “Grundbegriffe der Mengenlehre”, <i>Abhandlungen der neuen Fries'schen Schule (Neue Folge)</i> 1: 479–706.", "Hilbert, D., 1899, “Grundlagen der Geometrie”, in <i>Festschrift zur Feier der Enthüllung des Gauss-Weber-Denkmals in Göttingen</i>, Leipzig: B. G. Teubner.\n<span class=\"bibliography-comment\">Republished as Chapter 5 in Hallett and Majer 2004.</span>", "–––, 1900a, “Mathematische Probleme”, <i>Nachrichten von der königlichen Gesellschaft der Wissenschaften zu Göttingen, mathematisch-physikalische Klasse</i>, pp. 253–296.\n<span class=\"bibliography-comment\">English translation by Mary Winston Newson, 1902, “Mathematical Problems”  <i>Bulletin of the American Mathematical Society</i> 8: 437–479.</span>", "–––, 1900b, “Über den Zahlbegriff”, <i>Jahresbericht der deutschen Mathematiker-Vereinigung</i> 8: 180–185.\n<span class=\"bibliography-comment\">Reprinted (with small modifications) in Second to Seventh Editions of Hilbert 1899.</span>", "–––, 1902, “Grundlagen der Geometrie”. Ausarbeitung by August Adler for lectures in the Sommersemester of 1902 at the Georg-August Universität, Göttingen. Library of the Mathematisches Institut.\n<span class=\"bibliography-comment\">Published as Chapter 6 in Hallett and Majer 2004.</span>", "–––, 1918, “Axiomatisches Denken”, <i>Mathematische Annalen</i>, 78: 405–415.\n<span class=\"bibliography-comment\">Reprinted in Hilbert 1935: 146–156; English translation in Ewald 1996: volume 2, pp. 1105–1115.</span>", "–––, 1920, “Probleme der mathematischen Logik”, Lecture notes for a course held in the Wintersemester of 1920 at the Georg-August Universität, Göttingen, ausgearbeitet by Moses Schönfinkel and Paul Bernays. Library of the Mathematisches Institut, Universität Göttingen. <span class=\"bibliography-comment\">Published in Ewald et al. 2013, Chapter 2.</span>", "–––, 1935, <i>Gesammelte Abhandlungen, Band 3</i>. Berlin: Julius Springer.", "Jourdain, P. E. B., 1904, “On the transfinite cardinal numbers of well-ordered aggregates”, <i>Philosophical Magazine</i> 7(6): 61–75.", "–––, 1905a, “On a proof that every aggregate can be well-ordered”, <i>Mathematische Annalen</i> 60: 465–470.", "–––, 1905b, “On transfinite numbers of the exponential form”, <i>Philosophical Magazine</i> 9(6): 42–56.", "Kanamori, A., 1996, “The mathematical development of set theory from Cantor to Cohen”, <i>Bulletin of Symbolic Logic</i> 2: 1–71.", "–––, 1997, “The mathematical import of Zermelo's well-ordering theorem”, <i>Bulletin of Symbolic Logic</i> 3: 281–311.", "–––, 2003, “The empty set, the singleton, and the ordered pair”, <i>Bulletin of Symbolic Logic</i> 9: 273–298.", "–––, 2004, “Zermelo and set theory”, <i>Bulletin of Symbolic Logic</i> 10: 487–553.", "–––, 2012, “In praise of replacement”, <i>Bulletin of Symbolic Logic</i>, 18: 46–90.", "Kuratowski, C., 1921, “Sur la notion de l'ordre dans la théorie des ensembles”, <i>Fundamenta Mathematicae</i> 2: 161–171.", "–––, 1922, “Une méthode d'élimination des nombres transfini des raisonnements mathématiques”, <i>Fundamenta Mathematicae</i> 3: 76–108.", "Mancosu, P., 2009, “Measuring the size of infinite collections of natural numbers: was Cantor's theory of infinite number inevitable?”, <i>Review of Symbolic Logic</i> 2: 612–646.", "–––, 2010, <i>The Adventure of Reason: Interplay Between Philosophy of Mathematics and Mathematical Logic, 1900–1940</i>. Oxford: Oxford University Press.", "Mancosu, P., R. Zach,  and C. Badesa,  2009, “The development of mathematical logic from Russell to Tarski, 1900–1935”, in Haaparanta 2009: 318–470.\n<span class=\"bibliography-comment\">Reprinted in Mancosu 2010: 5–119.</span>", "Mirimanoff, D., 1917a, “Les antinomies de Russell et de Burali-Forti et le problème fondamental de la théorie des ensembles”, <i>L'enseignement mathématique</i> 19: 37–52.", "–––, 1917b, “Remarques sur la théorie des ensembles et les antinomies Cantoriennes (I)”, <i>L'enseignement mathématique</i> 19: 208–217.", "–––, 1921, “Remarques sur la théorie des ensembles et les antinomies Cantoriennes (II)”, <i>L'enseignement mathématique</i> 21: 29–52.", "Moore, G., 1976, “Ernst Zemelo, A. E. Harward, and the axiomatisation of set theory”, <i>Historia Mathematica</i> 3: 206–209.", "–––, 1982, <i>Zermelo's Axiom of Choice: Its Origins, Development and Influence</i>. Berlin: Springer.", "Peano, G., 1906, “Additione”, <i>Revista di mathematica</i> 8: 143–157.\n<span class=\"bibliography-comment\">Reprinted in Heinzmann 1986: 106–120.</span>", "Peckhaus, V., 1990, <i>Hilbertprogramm und kritische Philosophie: das Göttinger Modell interdisziplinärer Zusammenarbeit zwischen Mathematik und Philosophie</i>, Volume 7 of <i>Studien zur Wissenschafts- Sozial- und Bildungsgeschichte</i>, Göttingen: Vandenhoek and Ruprecht.", "Poincaré, H., 1905, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 13: 815–835.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 3; and, with these alterations noted, in Heinzmann 1986: 11–34. English translation in Ewald 1996: 1021–1038.</span>", "–––, 1906a, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 14: 17–34.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 3; and, with these alterations noted, in Heinzmann 1986: 35–53. English translation in Ewald 1996: 1038–1052.</span>", "–––, 1906b, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 14: 294–317.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 5; and, with these alterations noted, in Heinzmann 1986: 35–53. English translation in Ewald 1996: 1052–1071.</span>", "–––, 1908, <i>Science et méthode</i>, Paris: Ernst Flammarion.\n<span class=\"bibliography-comment\">English translation in Poincaré 1913b, and retranslated by Francis Maitland as <em>Science and Method,</em> New York: Dover Publications.</span>", "–––, 1909, “Le logique de l'infini”, <i>Revue de métaphysique et de morale</i> 17: 462–482.\n<span class=\"bibliography-comment\">Reprinted in Poincaré 1913a: 7–31.</span>", "–––, 1913a, <i>Dernières Pensées</i>, Paris: Ernest Flammarion.\n<span class=\"bibliography-comment\">English translation published in 1963 as <em>Mathematics and Science: Last Essays,</em> New York: Dover Publications.</span>", "–––, 1913b, <i>The Foundations of Science</i>, New York: Science Press.\n<span class=\"bibliography-comment\">Preface by Poincaré and an Introduction by Josiah Royce. Contains English translation by G. B. Halsted of Poincaré 1908.</span>", "Ramsey, F. P., 1926, “The foundations of mathematics”, <i>Proceedings of the London Mathematical Society</i> 25 (Second Series): 338–384.\n<span class=\"bibliography-comment\">Reprinted in Ramsey 1931: 1–61, and Ramsey 1978: 152–212.</span>", "–––, 1931, <i>The Foundations of Mathematics and Other Logical Essays</i>, R. B. Braithwaite (ed.), London: Routledge and Kegan Paul, London.", "–––, 1978, <i>Foundations: Essays in Philosophy, Logic, Mathematics and Economics</i>, D. H. Mellor (ed.), London: Routledge and Kegan Paul.", "Richard, J., 1905, “Les principes des mathématiques et le problème des ensembles”, <i>Révue général des sciences pures et appliqués</i> 16: 541.\n<span class=\"bibliography-comment\">English translation in van Heijenoort 1967: 142–144.</span>", "Russell, B., 1902, Letter to Frege.\n<span class=\"bibliography-comment\">In Heijenoort 1967: 124–125.</span>", "–––, 1903, <i>The Principles of Mathematics</i>, Volume 1, Cambridge: Cambridge University Press.", "Schoenflies, A., 1905, “Über wohlgeordnete Mengen”, <i>Mathematische Annalen</i> 60: 181–186.", "Skolem, T., 1923, “Einige Bemerkungen zur axiomatischen Begründung der Mengenlehre”, <i>Matimatikerkrongressen i Helsingfors den 4–7 Juli 1922, Den femte skandinaiska matematikerkongressen, redogörelse, 1923</i>, pp. 217–232.\n<span class=\"bibliography-comment\">Reprinted in Skolem 1970: 137–152 which also preserves the original pagination. English translation in Heijenoort 1967: 290–301.</span>", "–––, 1970, <i>Selected Papers in Logic</i>, Oslo: Universitetsforlaget. Edited by Jens Erik Fenstad.", "von Neumann, J., 1923, “Zur Einführung der transfiniten Zahlen”, <i>Acta Litterarum ac Scientiarum Regiæ Universitatis Hungaricæ Francisco-Josephinæ. Sectio Scientiæ-Mathematicæ</i> 1, pp. 199–208.\n<span class=\"bibliography-comment\">Reprinted in von Neumann 1961: 24–33. English translation in van Heijenoort 1967: 346–354.</span>", "–––, 1928, “Über die Definition durch transfinite Induktion und verwandte Fragen der allgemeinen Mengenlehre”, <i>Mathematische Annalen</i> 99: 373–391.\n<span class=\"bibliography-comment\">Reprinted in von Neumann 1961: 320–338.</span>", "–––, 1961, <i>John von Neumann: Collected Works</i>, Volume 1, Oxford: Pergamon Press.", "Weyl, H., 1910, “Über die Definitionen der mathematischen Grundbegriffe”, <i>Mathematisch-naturwissenschaftliche Blätter</i> 7, pp. 93–95, 109–113.\n<span class=\"bibliography-comment\">Reprinted in Weyl 1968, Volume 1, 298–304.</span>", "–––, 1968, <i>Gesammelte Abhandlungen</i>, 4 Volumes, Berlin: Springer.", "Young, W. H. and G. C. Young,  1906, <i>The Theory of Sets of Points</i>, Cambridge: Cambridge University Press.", "Zermelo, E., 1904, “Beweis, daß jede Menge wohlgeordnet werden kann”, <i>Mathematische Annalen</i> 59: 514–516.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 114–119, with a facing-page English translation, and an Introduction by Michael Hallett (2010b). English translation also in van Heijenoort 1967: 139–141.</span>", "–––, 1908a, “Neuer Beweis für die Möglichkeit einer Wohlordnung”, <i>Mathematische Annalen</i> 65: 107–128.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 120–159, with a facing-page English translation, and an Introduction by Michael Hallett (2010b). English translation also in van Heijenoort 1967: 183–198.</span>", "–––, 1908b, “Untersuchungen über die Grundlagen der Mengenlehre, I”, <i>Mathematische Annalen</i> 65: 261–281.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 189–228, with a facing-page English translation, and an Introduction by Ulrich Felgner (2010). English translation also in van Heijenoort 1967: 201–215.</span>", "–––, 1929, “Über den Begriff von Definitheit in der Axiomatik”, <i>Fundamenta Mathematicae</i> 14: 339–344.\n<span class=\"bibliography-comment\">Reprinted with facing-page English translation in Zermelo 2010: 358–367, with an Introduction by Heinz-Dieter Ebbinghaus (2010).</span>", "–––, 1930, “Über Grenzzahlen und Mengenbereiche: Neue Untersuchungen über die Grundlagen der Mengenlehre”, <i>Fundamenta Mathematicae</i> 16: 29–47.\n<span class=\"bibliography-comment\">Reprinted with facing-page English translation in Zermelo 2010: 400–431, with an Introduction by Akihiro Kanamori. English translation also in Ewald 1996, Volume 2, pp. 1219–1233.</span>", "–––, 2010, <i>Collected Works. Volume I: Set Theory, Miscellanea</i>, H.-D. Ebbinghaus and A. Kanamori (eds.), Berlin: Springer."]}, "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<p>Most of the original sources surrounding Zermelo's work were\nwritten in German, and some in French; when translations of these\nworks into English are available, bibliographic information for the\ntranslations follows the citation of the original text.  Similarly for\nolder, relatively inaccessible texts that have been republished in\nmore current works.</p>\n<ul class=\"hanging\">\n<li>Bell, J., 2009, <i>The Axiom of Choice</i>, London: College Publications.</li>\n<li>Benacerraf, P. and H. Putnam (eds.), 1964, <i>Philosophy of Mathematics: Selected Readings</i>, Oxford: Basil Blackwell.</li>\n<li>––– (eds.), 1983, <i>Philosophy of Mathematics: Selected Readings</i>, Second Edition, Cambridge: Cambridge University Press.</li>\n<li>Bernstein, F., 1905, “Über die Reihe der transfiniten Ordnungszahlen”, <i>Mathematische Annalen</i> 60: 187–193.</li>\n<li>Borel, E., 1905, “Quelque remarques sur les principes de la théorie des ensembles”, <i>Mathematische Annalen</i> 60: 194–195.</li>\n<li>Browder, F. (ed.), 1976, <i>Mathematical Developments Arising from the Hilbert Problems</i>, Volume 28 of <i>Proceedings of Symposia in Pure Mathematics</i>, Providence: American Mathematical Society.</li>\n<li>Cantor, G., 1883a, “Ueber unendliche, lineare Punktmannichfaltigkeiten” <i>Mathematische Annalen</i> 21: 545–591. <span class=\"bibliography-comment\">Reprinted in Cantor 1883b and in Cantor 1932:  165–209. English translation in Ewald 1996, Volume 2.</span></li>\n<li>–––, 1883b, <i>Grundlagen einer allegemeinen Mannigfaltichkeitslehre. Ein mathematisch-philosophischer Versuch in der Lehre des Unendlichen</i>, Leipzig: B. G. Teubner.</li>\n<li>–––, 1895, “Beiträge zur Begründung der transfiniten Mengenlehre, Erster Artikel”, <i>Mathematische Annalen</i> 46: 481–512. <span class=\"bibliography-comment\">Reprinted in Cantor 1932: 282–311. English translation in Cantor 1915.</span></li>\n<li>–––, 1897, “Beiträge zur Begründung der transfiniten Mengenlehre, Zweiter Artikel”, <i>Mathematische Annalen</i> 49: 207–246. Reprinted in Cantor 1932: 312–351. English translation in Cantor 1915.</li>\n<li>–––, 1915, <i>Contributions to the Founding of the Theory of Transfinite Numbers</i>, La Salle: Open Court. <span class=\"bibliography-comment\">English translation of Cantor 1895, 1897 by Philip E. B. Jourdain.</span></li>\n<li>–––, 1932, <i>Gesammelte Abhandlungen mathematischen und philosophischen Inhalts, mit eläuternden Anmerkungen sowie mit Ergänzungen aus dem Briefwechsel Cantor-Dedekind herausgegeben von Ernst Zermelo</i>, Berlin: Springer.</li>\n<li>–––, 1991, <i>Georg Cantor: Briefe. Herausgegeben von Herbert Meschkowski</i>, Berlin: Springer</li>\n<li>Dedekind, R., 1888, <i>Was sind und was sollen die Zahlen?</i>, Braunschweig: Vieweg und Sohn. <span class=\"bibliography-comment\">Also reprinted in Dedekind 1932: 335–391; English translation in Ewald 1996:  787–833.</span></li>\n<li>–––, 1932, <i>Gesammelte mathematische Werke. Band 3. Herausgegeben von Robert Fricke, Emmy Noether and Öystein Ore</i>, Braunschweig: Friedrich Vieweg und Sohn. <span class=\"bibliography-comment\">Reprinted with some omissions by Chelsea Publishing Co., New York, 1969.</span></li>\n<li>Dreben, B. and A. Kanamori, 1997, “Hilbert and set theory”, <i>Synthese</i>, 110: 77–125.</li>\n<li>Ebbinghaus, H.-D., 2007, <i>Ernst Zermelo: An Approach to His Life and Work</i>, Berlin: Springer.</li>\n<li>–––, 2010, “Introductory note to <em>Über den Begriff von Definitheit in der Axiomatik</em> [Zermelo 1929]”, in Zermelo 2010: 352–357.</li>\n<li>Ewald, W. (ed.), 1996, <i>From Kant to Hilbert</i>, Oxford: Oxford University Press.</li>\n<li>Ewald, W., W. Sieg, and M. Hallett (eds.), 2013, <i>David Hilbert's Lectures on the Foundations of Logic and Arithmetic, 1917–1933</i>, Volume 3 of <i>Hilbert's Lectures on the Foundations of Mathematics and Physics, 1891–1933</i>, Berlin: Springer.</li>\n<li>Felgner, U., 2010, “Introductory note to <em>Untersuchungen über die Grundlagen der Mengenlehre, I</em> [Zermelo 1908b]”, in Zermelo 2010:  160–188.</li>\n<li>Ferreiros, J., 1999, <i>Labyrinth of Thought: A History of Set Theory and its Role in Modern Mathematics</i>, Science Networks Historical Studies, Basel: Birkhäuser. Second Revised Edition, 2007</li>\n<li>Fraenkel, A., Y. Bar-Hillel,  and A. Levy, 1973, <i>Foundations of Set Theory</i>. Amsterdam: North-Holland Publishing.</li>\n<li>Fraenkel, A. A., 1922, “Zu den Grundlagen der Cantor-Zermeloschen Mengenlehre”, <i>Mathematische Annalen</i> 86: 230–237.</li>\n<li>–––, 1927, <i>Zehn Vorlesungen über die Grundlegung der Mengenlehre</i>, Leipzig: B. G. Teubner.</li>\n<li>Frege, G., 1879, <i>Begriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens</i>,  Halle: Louis Nebert. <span class=\"bibliography-comment\">Reprinted in Frege 1964, English\ntranslation in van Heijenoort 1967: 1–82.</span></li>\n<li>–––, 1893, <i>Grundgesetze der Arithmetik</i>, Band 1, Jena: Hermann Pohle. <span class=\"bibliography-comment\">English translation by Philip Ebert and Marcus Rossberg,  <i>Frege, The Basic Laws of Arithmetic, Derived using Concept-Script</i>, Oxford: Oxford University Press, forthcoming.</span></li>\n<li>–––, 1903, <i>Grundgesetze der Arithmetik</i>, Band II, Jena: Hermann Pohle. <span class=\"bibliography-comment\">English translation by Philip Ebert and Marcus Rossberg,  <i>Frege, The Basic Laws of Arithmetic, Derived using Concept-Script</i>, Oxford: Oxford University Press, forthcoming.</span></li>\n<li>–––, 1964, <i>Begriffsschrift und andere Aufsätze. Mit E. Husserls und H. Scholz’ Anmerkungen herausgegeben von Ignacio Angelelli</i>, Darmstadt: Wissenschaftliche Buchgesellschaft.</li>\n<li>Gödel, K., 1944, “Russell's mathematical logic”, in P. A. Schillp (ed.), <i>The Philosophy of Bertrand Russell</i>, pp. 125–153, La Salle: Open Court. \n<span class=\"bibliography-comment\">Reprinted in Benacerraf and Putnam 1964: 211–232; Benacerraf and Putnam 1983: 447–469; and in Gödel 1990:  119–141.</span></li>\n<li>–––, 1990, <i>Kurt Gödel: Collected Works</i>, Volume 2, edited by Solomon Feferman et al., Oxford: Oxford University Press.</li>\n<li>Haaparanta, L. (ed.), 2009, <i>The Development of Modern Logic</i>, Oxford: Oxford University Press.</li>\n<li>Hadamard, J. et al., 1905, “Cinq letters sur la théorie des ensembles”, <i>Bulletin de la société mathématique de France</i>, 33: 261–273. \n<span class=\"bibliography-comment\">Letters between Baire, Borel, Lebesgue and Hadamard on objections to, and defense of, Zermelo's 1904 proof\nof the well-ordering theorem.</span></li>\n<li>Hallett, M., 1981, “Russell, Jourdain and ‘limitation of size’”, <i>British Journal for the Philosophy of Science</i>, 32: 381–399.</li>\n<li>–––, 1984, <i>Cantorian Set Theory and Limitation of Size</i>, Oxford: Clarendon Press.</li>\n<li>–––, 2008, “The ‘purity of method’ in Hilbert's <i>Grundlagen der Geometrie</i>”, in P. Mancosu (ed.), <i>The Philosophy of Mathematical Practice</i>, pp. 198–255, Oxford: Clarendon Press.</li>\n<li>–––, 2010a, “Frege and Hilbert”, in M. Potter and T. Ricketts (eds.), <i>The Cambridge Companion to Frege</i>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2010b, “Introductory note to Zermelo's two papers on the well-ordering theorem”, in Zermelo 2010:  80–115.</li>\n<li>Hallett, M. and U. Majer (eds.), 2004, <i>David Hilbert's Lectures on the Foundations of Geometry, 1891–1902</i>, Volume 1 of <i>Hilbert's Lectures on the Foundations of Mathematics and Physics, 1891–1933</i>, Berlin: Springer.</li>\n<li>Hardy, G. H., 1904, “A theorem concerning the infinite cardinal numbers”, <i>Quarterly Journal of Pure and Applied Mathematics</i> 35: 87–94.</li>\n<li>Hartogs, F., 1915, “Über das Problem der Wohlordnung”, <i>Mathematische Annalen</i>, 76: 438–442.</li>\n<li>Harward, A. E., 1905, “On the transfinite numbers”, <i>Philosophical Magazine</i> 10(6): 439–460.</li>\n<li>Hausdorff, F., 1914, <i>Grundzüge der Mengenlehre</i>, Leipzig: Von Veit.</li>\n<li>Hawkins, T., 1970, <i>Lebesgue's Theory of Integration</i>. New York: Blaisdell.\n<span class=\"bibliography-comment\">Reprinted by the Chelsea Publishing Company, New York, 1979.</span></li>\n<li>van Heijenoort, J. (ed.), 1967, <i>From Frege to Gödel: A Source Book in Mathematical Logic</i>, Cambridge, Massachusetts: Harvard University Press.</li>\n<li>Heinzmann, G., 1986, <i>Poincaré, Russell, Zermelo et Peano. Textes de la discusion (1906–1912) sur les fondements des mathématiques: des antinomies à la prédicativité</i>, Paris: Albert Blanchard.</li>\n<li>Hessenberg, G., 1906, “Grundbegriffe der Mengenlehre”, <i>Abhandlungen der neuen Fries'schen Schule (Neue Folge)</i> 1: 479–706.</li>\n<li>Hilbert, D., 1899, “Grundlagen der Geometrie”, in <i>Festschrift zur Feier der Enthüllung des Gauss-Weber-Denkmals in Göttingen</i>, Leipzig: B. G. Teubner.\n<span class=\"bibliography-comment\">Republished as Chapter 5 in Hallett and Majer 2004.</span></li>\n<li>–––, 1900a, “Mathematische Probleme”, <i>Nachrichten von der königlichen Gesellschaft der Wissenschaften zu Göttingen, mathematisch-physikalische Klasse</i>, pp. 253–296.\n<span class=\"bibliography-comment\">English translation by Mary Winston Newson, 1902, “Mathematical Problems”  <i>Bulletin of the American Mathematical Society</i> 8: 437–479.</span></li>\n<li>–––, 1900b, “Über den Zahlbegriff”, <i>Jahresbericht der deutschen Mathematiker-Vereinigung</i> 8: 180–185.\n<span class=\"bibliography-comment\">Reprinted (with small modifications) in Second to Seventh Editions of Hilbert 1899.</span></li>\n<li>–––, 1902, “Grundlagen der Geometrie”. Ausarbeitung by August Adler for lectures in the Sommersemester of 1902 at the Georg-August Universität, Göttingen. Library of the Mathematisches Institut.\n<span class=\"bibliography-comment\">Published as Chapter 6 in Hallett and Majer 2004.</span></li>\n<li>–––, 1918, “Axiomatisches Denken”, <i>Mathematische Annalen</i>, 78: 405–415.\n<span class=\"bibliography-comment\">Reprinted in Hilbert 1935: 146–156; English translation in Ewald 1996: volume 2, pp. 1105–1115.</span></li>\n<li>–––, 1920, “Probleme der mathematischen Logik”, Lecture notes for a course held in the Wintersemester of 1920 at the Georg-August Universität, Göttingen, ausgearbeitet by Moses Schönfinkel and Paul Bernays. Library of the Mathematisches Institut, Universität Göttingen. <span class=\"bibliography-comment\">Published in Ewald et al. 2013, Chapter 2.</span></li>\n<li>–––, 1935, <i>Gesammelte Abhandlungen, Band 3</i>. Berlin: Julius Springer.</li>\n<li>Jourdain, P. E. B., 1904, “On the transfinite cardinal numbers of well-ordered aggregates”, <i>Philosophical Magazine</i> 7(6): 61–75.</li>\n<li>–––, 1905a, “On a proof that every aggregate can be well-ordered”, <i>Mathematische Annalen</i> 60: 465–470.</li>\n<li>–––, 1905b, “On transfinite numbers of the exponential form”, <i>Philosophical Magazine</i> 9(6): 42–56.</li>\n<li>Kanamori, A., 1996, “The mathematical development of set theory from Cantor to Cohen”, <i>Bulletin of Symbolic Logic</i> 2: 1–71.</li>\n<li>–––, 1997, “The mathematical import of Zermelo's well-ordering theorem”, <i>Bulletin of Symbolic Logic</i> 3: 281–311.</li>\n<li>–––, 2003, “The empty set, the singleton, and the ordered pair”, <i>Bulletin of Symbolic Logic</i> 9: 273–298.</li>\n<li>–––, 2004, “Zermelo and set theory”, <i>Bulletin of Symbolic Logic</i> 10: 487–553.</li>\n<li>–––, 2012, “In praise of replacement”, <i>Bulletin of Symbolic Logic</i>, 18: 46–90.</li>\n<li>Kuratowski, C., 1921, “Sur la notion de l'ordre dans la théorie des ensembles”, <i>Fundamenta Mathematicae</i> 2: 161–171.</li>\n<li>–––, 1922, “Une méthode d'élimination des nombres transfini des raisonnements mathématiques”, <i>Fundamenta Mathematicae</i> 3: 76–108.</li>\n<li>Mancosu, P., 2009, “Measuring the size of infinite collections of natural numbers: was Cantor's theory of infinite number inevitable?”, <i>Review of Symbolic Logic</i> 2: 612–646.</li>\n<li>–––, 2010, <i>The Adventure of Reason: Interplay Between Philosophy of Mathematics and Mathematical Logic, 1900–1940</i>. Oxford: Oxford University Press.</li>\n<li>Mancosu, P., R. Zach,  and C. Badesa,  2009, “The development of mathematical logic from Russell to Tarski, 1900–1935”, in Haaparanta 2009: 318–470.\n<span class=\"bibliography-comment\">Reprinted in Mancosu 2010: 5–119.</span></li>\n<li>Mirimanoff, D., 1917a, “Les antinomies de Russell et de Burali-Forti et le problème fondamental de la théorie des ensembles”, <i>L'enseignement mathématique</i> 19: 37–52.</li>\n<li>–––, 1917b, “Remarques sur la théorie des ensembles et les antinomies Cantoriennes (I)”, <i>L'enseignement mathématique</i> 19: 208–217.</li>\n<li>–––, 1921, “Remarques sur la théorie des ensembles et les antinomies Cantoriennes (II)”, <i>L'enseignement mathématique</i> 21: 29–52.</li>\n<li>Moore, G., 1976, “Ernst Zemelo, A. E. Harward, and the axiomatisation of set theory”, <i>Historia Mathematica</i> 3: 206–209.</li>\n<li>–––, 1982, <i>Zermelo's Axiom of Choice: Its Origins, Development and Influence</i>. Berlin: Springer.</li>\n<li>Peano, G., 1906, “Additione”, <i>Revista di mathematica</i> 8: 143–157.\n<span class=\"bibliography-comment\">Reprinted in Heinzmann 1986: 106–120.</span></li>\n<li>Peckhaus, V., 1990, <i>Hilbertprogramm und kritische Philosophie: das Göttinger Modell interdisziplinärer Zusammenarbeit zwischen Mathematik und Philosophie</i>, Volume 7 of <i>Studien zur Wissenschafts- Sozial- und Bildungsgeschichte</i>, Göttingen: Vandenhoek and Ruprecht.</li>\n<li>Poincaré, H., 1905, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 13: 815–835.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 3; and, with these alterations noted, in Heinzmann 1986: 11–34. English translation in Ewald 1996: 1021–1038.</span></li>\n<li>–––, 1906a, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 14: 17–34.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 3; and, with these alterations noted, in Heinzmann 1986: 35–53. English translation in Ewald 1996: 1038–1052.</span></li>\n<li>–––, 1906b, “Les mathématiques et la logique”, <i>Revue de métaphysique et de morale</i> 14: 294–317.\n<span class=\"bibliography-comment\">Reprinted with alterations in Poincaré 1908: Part II, Chapter 5; and, with these alterations noted, in Heinzmann 1986: 35–53. English translation in Ewald 1996: 1052–1071.</span></li>\n<li>–––, 1908, <i>Science et méthode</i>, Paris: Ernst Flammarion.\n<span class=\"bibliography-comment\">English translation in Poincaré 1913b, and retranslated by Francis Maitland as <em>Science and Method,</em> New York: Dover Publications.</span></li>\n<li>–––, 1909, “Le logique de l'infini”, <i>Revue de métaphysique et de morale</i> 17: 462–482.\n<span class=\"bibliography-comment\">Reprinted in Poincaré 1913a: 7–31.</span></li>\n<li>–––, 1913a, <i>Dernières Pensées</i>, Paris: Ernest Flammarion.\n<span class=\"bibliography-comment\">English translation published in 1963 as <em>Mathematics and Science: Last Essays,</em> New York: Dover Publications.</span></li>\n<li>–––, 1913b, <i>The Foundations of Science</i>, New York: Science Press.\n<span class=\"bibliography-comment\">Preface by Poincaré and an Introduction by Josiah Royce. Contains English translation by G. B. Halsted of Poincaré 1908.</span></li>\n<li>Ramsey, F. P., 1926, “The foundations of mathematics”, <i>Proceedings of the London Mathematical Society</i> 25 (Second Series): 338–384.\n<span class=\"bibliography-comment\">Reprinted in Ramsey 1931: 1–61, and Ramsey 1978: 152–212.</span></li>\n<li>–––, 1931, <i>The Foundations of Mathematics and Other Logical Essays</i>, R. B. Braithwaite (ed.), London: Routledge and Kegan Paul, London.</li>\n<li>–––, 1978, <i>Foundations: Essays in Philosophy, Logic, Mathematics and Economics</i>, D. H. Mellor (ed.), London: Routledge and Kegan Paul.</li>\n<li>Richard, J., 1905, “Les principes des mathématiques et le problème des ensembles”, <i>Révue général des sciences pures et appliqués</i> 16: 541.\n<span class=\"bibliography-comment\">English translation in van Heijenoort 1967: 142–144.</span></li>\n<li>Russell, B., 1902, Letter to Frege.\n<span class=\"bibliography-comment\">In Heijenoort 1967: 124–125.</span></li>\n<li>–––, 1903, <i>The Principles of Mathematics</i>, Volume 1, Cambridge: Cambridge University Press.</li>\n<li>Schoenflies, A., 1905, “Über wohlgeordnete Mengen”, <i>Mathematische Annalen</i> 60: 181–186.</li>\n<li>Skolem, T., 1923, “Einige Bemerkungen zur axiomatischen Begründung der Mengenlehre”, <i>Matimatikerkrongressen i Helsingfors den 4–7 Juli 1922, Den femte skandinaiska matematikerkongressen, redogörelse, 1923</i>, pp. 217–232.\n<span class=\"bibliography-comment\">Reprinted in Skolem 1970: 137–152 which also preserves the original pagination. English translation in Heijenoort 1967: 290–301.</span></li>\n<li>–––, 1970, <i>Selected Papers in Logic</i>, Oslo: Universitetsforlaget. Edited by Jens Erik Fenstad.</li>\n<li>von Neumann, J., 1923, “Zur Einführung der transfiniten Zahlen”, <i>Acta Litterarum ac Scientiarum Regiæ Universitatis Hungaricæ Francisco-Josephinæ. Sectio Scientiæ-Mathematicæ</i> 1, pp. 199–208.\n<span class=\"bibliography-comment\">Reprinted in von Neumann 1961: 24–33. English translation in van Heijenoort 1967: 346–354.</span></li>\n<li>–––, 1928, “Über die Definition durch transfinite Induktion und verwandte Fragen der allgemeinen Mengenlehre”, <i>Mathematische Annalen</i> 99: 373–391.\n<span class=\"bibliography-comment\">Reprinted in von Neumann 1961: 320–338.</span></li>\n<li>–––, 1961, <i>John von Neumann: Collected Works</i>, Volume 1, Oxford: Pergamon Press.</li>\n<li>Weyl, H., 1910, “Über die Definitionen der mathematischen Grundbegriffe”, <i>Mathematisch-naturwissenschaftliche Blätter</i> 7, pp. 93–95, 109–113.\n<span class=\"bibliography-comment\">Reprinted in Weyl 1968, Volume 1, 298–304.</span></li>\n<li>–––, 1968, <i>Gesammelte Abhandlungen</i>, 4 Volumes, Berlin: Springer.</li>\n<li>Young, W. H. and G. C. Young,  1906, <i>The Theory of Sets of Points</i>, Cambridge: Cambridge University Press.</li>\n<li>Zermelo, E., 1904, “Beweis, daß jede Menge wohlgeordnet werden kann”, <i>Mathematische Annalen</i> 59: 514–516.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 114–119, with a facing-page English translation, and an Introduction by Michael Hallett (2010b). English translation also in van Heijenoort 1967: 139–141.</span></li>\n<li>–––, 1908a, “Neuer Beweis für die Möglichkeit einer Wohlordnung”, <i>Mathematische Annalen</i> 65: 107–128.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 120–159, with a facing-page English translation, and an Introduction by Michael Hallett (2010b). English translation also in van Heijenoort 1967: 183–198.</span></li>\n<li>–––, 1908b, “Untersuchungen über die Grundlagen der Mengenlehre, I”, <i>Mathematische Annalen</i> 65: 261–281.\n<span class=\"bibliography-comment\">Reprinted in Zermelo 2010: 189–228, with a facing-page English translation, and an Introduction by Ulrich Felgner (2010). English translation also in van Heijenoort 1967: 201–215.</span></li>\n<li>–––, 1929, “Über den Begriff von Definitheit in der Axiomatik”, <i>Fundamenta Mathematicae</i> 14: 339–344.\n<span class=\"bibliography-comment\">Reprinted with facing-page English translation in Zermelo 2010: 358–367, with an Introduction by Heinz-Dieter Ebbinghaus (2010).</span></li>\n<li>–––, 1930, “Über Grenzzahlen und Mengenbereiche: Neue Untersuchungen über die Grundlagen der Mengenlehre”, <i>Fundamenta Mathematicae</i> 16: 29–47.\n<span class=\"bibliography-comment\">Reprinted with facing-page English translation in Zermelo 2010: 400–431, with an Introduction by Akihiro Kanamori. English translation also in Ewald 1996, Volume 2, pp. 1219–1233.</span></li>\n<li>–––, 2010, <i>Collected Works. Volume I: Set Theory, Miscellanea</i>, H.-D. Ebbinghaus and A. Kanamori (eds.), Berlin: Springer.</li>\n</ul>\n</div>"}, "related_entries": {"entry_list": ["Russell’s paradox", "set theory", "set theory: alternative axiomatic theories", "set theory: early development"], "entry_link": [{"../russell-paradox/": "Russell’s paradox"}, {"../set-theory/": "set theory"}, {"../settheory-alternative/": "set theory: alternative axiomatic theories"}, {"../settheory-early/": "set theory: early development"}]}, "academic_tools": {"listed_text": ["<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=zermelo-set-theory\" target=\"other\">How to cite this entry</a>.", "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>", "<a href=\"https://leibniz.stanford.edu/friends/preview/zermelo-set-theory/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.", "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>", "<a href=\"https://www.inphoproject.org/entity?sep=zermelo-set-theory&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).", "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>", "<a href=\"http://philpapers.org/sep/zermelo-set-theory/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."], "listed_links": [{"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=zermelo-set-theory": "How to cite this entry"}, {"https://leibniz.stanford.edu/friends/preview/zermelo-set-theory/": "Preview the PDF version of this entry"}, {"https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"}, {"https://www.inphoproject.org/entity?sep=zermelo-set-theory&redirect=True": "Look up topics and thinkers related to this entry"}, {"http://philpapers.org/sep/zermelo-set-theory/": "Enhanced bibliography for this entry"}, {"http://philpapers.org/": "PhilPapers"}]}, "other_internet_resources": {"listed_text": [], "listed_links": []}, "tokenized_text": ["1", "axiom", "introduction", "zermelo", "s", "paper", "make", "clear", "set", "theory", "regarded", "fundamental", "theory", "set", "theory", "branch", "mathematics", "whose", "task", "investigate", "mathematically", "fundamental", "notion", "number", "order", "function", "taking", "pristine", "simple", "form", "develop", "thereby", "logical", "foundation", "arithmetic", "analysis", "thus", "constitutes", "indispensable", "component", "science", "mathematics", "1908b", "261", "1", "followed", "acknowledgment", "necessary", "replace", "central", "assumption", "assign", "arbitrary", "logically", "definable", "notion", "set", "class", "extension", "1908b", "261", "zermelo", "go", "solving", "problem", "present", "must", "one", "hand", "restrict", "principle", "distilled", "actual", "operation", "set", "sufficiently", "exclude", "contradiction", "take", "sufficiently", "wide", "retain", "valuable", "theory", "1908b", "261", "central", "assumption", "zermelo", "describes", "let", "u", "call", "comprehension", "principle", "cp", "come", "seen", "many", "principle", "behind", "derivation", "settheoretic", "inconsistency", "russell", "1903", "104", "say", "following", "perhaps", "best", "way", "state", "suggested", "solution", "russellzermelo", "contradiction", "say", "collection", "term", "defined", "variable", "propositional", "function", "though", "class", "many", "may", "admitted", "class", "one", "must", "denied", "took", "axiomatic", "class", "one", "found", "wherever", "class", "many", "axiom", "need", "universally", "admitted", "appears", "source", "contradiction", "denying", "therefore", "whole", "difficulty", "overcome", "mean", "clear", "whole", "difficulty", "thereby", "overcome", "russell", "make", "clear", "identification", "principle", "cite", "version", "cp", "source", "error", "least", "make", "clear", "take", "place", "2", "grundgesetze", "see", "eg", "frege", "1903", "146147", "frege", "recognises", "famous", "law", "v", "based", "conversion", "principle", "allows", "u", "assume", "concept", "function", "object", "contains", "precisely", "thing", "fall", "concept", "function", "return", "value", "true", "law", "v", "principle", "say", "two", "extension", "object", "b", "stemming", "two", "concept", "f", "g", "f", "g", "extensionally", "equivalent", "frege", "clearly", "considers", "conversion", "concept", "extension", "fundamental", "also", "regard", "widely", "used", "mathematics", "even", "implicitly", "thus", "anything", "new", "using", "principle", "conversion", "attendant", "basic", "law", "logic", "law", "v", "cp", "follows", "immediately", "law", "v", "frege", "made", "aware", "russell", "1902", "law", "v", "contradictory", "since", "russell", "s", "paradox", "flow", "easily", "appendix", "grundgesetze", "frege", "1903", "frege", "say", "hardly", "anything", "unwelcome", "befall", "scientific", "writer", "one", "foundation", "edifice", "shaken", "work", "finished", "position", "put", "letter", "mr", "bertrand", "russell", "printing", "volume", "nearing", "completion", "matter", "concern", "basic", "law", "v", "never", "concealed", "obvious", "others", "obvious", "must", "properly", "required", "logical", "law", "indeed", "pointed", "weakness", "foreword", "first", "volume", "p", "vii", "would", "gladly", "dispensed", "foundation", "known", "substitute", "even", "see", "arithmetic", "founded", "scientifically", "number", "apprehended", "logical", "object", "brought", "consideration", "notat", "least", "conditionallypermissible", "pas", "concept", "extension", "may", "always", "speak", "extension", "concept", "class", "exception", "recognised", "may", "one", "always", "infer", "extension", "one", "concept", "s", "coinciding", "second", "every", "object", "falling", "first", "concept", "also", "fall", "latter", "question", "arise", "mr", "russell", "s", "communication", "what", "stake", "approach", "foundation", "particular", "rather", "possibility", "logical", "foundation", "arithmetic", "p", "253", "3", "difficulty", "could", "hardly", "summed", "succinctly", "replacement", "assumption", "involving", "unfettered", "conversion", "concept", "object", "zermelo", "s", "main", "task", "axiomatisation", "zermelo", "s", "system", "based", "presupposition", "set", "theory", "concerned", "domain", "𝔅", "individual", "shall", "call", "simply", "object", "among", "set", "two", "symbol", "b", "denote", "object", "write", "b", "otherwise", "b", "say", "object", "exists", "belongs", "domain", "𝔅", "likewise", "say", "class", "𝔎", "object", "exist", "object", "class", "𝔎", "𝔅", "contains", "least", "one", "individual", "class", "1908b", "262", "given", "one", "fundamental", "relation", "set", "membership", "ε", "allows", "one", "state", "object", "belongs", "set", "b", "written", "ε", "b", "4", "zermelo", "laid", "seven", "axiom", "give", "partial", "description", "found", "b", "described", "follows", "extensionalitythis", "say", "roughly", "set", "determined", "element", "contain", "axiom", "elementary", "setsthis", "asserts", "existence", "set", "contains", "member", "denoted", "0", "zermelo", "commonly", "denoted", "b", "existence", "object", "singleton", "set", "sole", "member", "c", "existence", "two", "object", "b", "unordered", "pair", "b", "b", "member", "separation", "aussonderungsaxiom", "asserts", "given", "set", "given", "definite", "property", "element", "𝔅", "one", "separate", "set", "element", "satisfy", "given", "property", "power", "setthis", "say", "set", "collection", "subset", "set", "also", "set", "unionthis", "say", "set", "collection", "member", "member", "set", "also", "form", "set", "choicethis", "say", "set", "pairwise", "disjoint", "nonempty", "set", "exists", "set", "subset", "union", "set", "given", "set", "give", "rise", "contains", "exactly", "one", "member", "member", "given", "set", "infinitythis", "final", "axiom", "asserts", "existence", "infinitely", "large", "set", "contains", "empty", "set", "set", "contains", "also", "contains", "set", "thus", "infinite", "set", "must", "contain", "inclusion", "last", "zermelo", "explicitly", "reject", "attempt", "prove", "existence", "infinite", "collection", "principle", "find", "dedekind", "1888", "66", "frege", "via", "establishment", "known", "hume", "s", "principle", "four", "central", "axiom", "zermelo", "s", "system", "axiom", "infinity", "power", "set", "together", "show", "existence", "uncountable", "set", "axiom", "choice", "devote", "space", "axiom", "separation", "latter", "allows", "definite", "property", "φ", "fact", "give", "rise", "set", "namely", "set", "thing", "already", "included", "set", "property", "φ", "word", "give", "rise", "certain", "subset", "namely", "subset", "φthings", "a", "thus", "follows", "latter", "generally", "many", "set", "giving", "partial", "extension", "φ", "namely", "φthings", "φthings", "b", "φthings", "c", "however", "guarantee", "existence", "unique", "extensionset", "φ", "course", "cp", "namely", "x", "φ", "x", "zermelo", "show", "basis", "system", "two", "central", "paradox", "greatest", "set", "russell", "arise", "fact", "zermelo", "prof", "every", "set", "posse", "least", "one", "subset", "m0", "element", "m", "1908b", "265", "proof", "easy", "modification", "argument", "russell", "s", "paradox", "using", "contradiction", "time", "reductio", "separation", "let", "m0", "subset", "consisting", "element", "x", "x", "x", "either", "m0", "m0", "m0", "m0", "assume", "m0", "m0", "since", "m0", "subset", "tell", "u", "m0", "m", "m0", "member", "fails", "satisfy", "condition", "belonging", "m0", "showing", "m0", "m0", "contradiction", "hence", "necessarily", "m0", "m0", "suppose", "m0", "m0", "bound", "m0", "defining", "condition", "set", "hence", "m0", "pain", "contradiction", "argument", "russell", "paradox", "used", "constructive", "effect", "one", "person", "s", "contradiction", "another", "person", "s", "reductio", "zermelo", "comment", "follows", "theorem", "object", "x", "domain", "𝔅", "element", "one", "set", "domain", "𝔅", "set", "disposes", "russell", "antinomy", "far", "concerned", "1908b", "265", "absence", "something", "like", "cp", "overriding", "reason", "think", "must", "universal", "set", "5", "although", "deal", "russell", "paradox", "paradox", "universal", "set", "tackle", "general", "consistency", "system", "zermelo", "well", "aware", "clear", "introduction", "paper", "yet", "even", "able", "prove", "rigorously", "axiom", "consistent", "though", "certainly", "essential", "instead", "confine", "pointing", "antinomy", "discovered", "far", "vanish", "one", "principle", "proposed", "adopted", "basis", "hope", "done", "least", "useful", "spadework", "hereby", "subsequent", "investigation", "deeper", "problem", "1908b", "262", "remarked", "passing", "zermelo", "nt", "deal", "specifically", "buraliforti", "paradox", "either", "simple", "reason", "properly", "formulated", "system", "since", "deal", "either", "wellorderings", "generally", "general", "concept", "ordinal", "number", "come", "back", "however", "assuming", "known", "paradox", "avoided", "another", "question", "come", "fore", "separation", "axiom", "basic", "principle", "workaday", "creation", "set", "adequate", "question", "taken", "later", "attempt", "statement", "axiom", "zermelo", "publicly", "private", "correspondence", "6", "particular", "cantor", "correspondence", "hilbert", "dedekind", "late", "1890s", "endeavoured", "describe", "principle", "set", "existence", "7", "thought", "legitimate", "would", "give", "rise", "construction", "called", "inconsistent", "totality", "totality", "engender", "contradiction", "best", "known", "totality", "totality", "ordinal", "totality", "cardinal", "principle", "included", "set", "union", "form", "replacement", "axiom", "well", "principle", "seem", "guarantee", "every", "cardinal", "number", "aleph", "call", "short", "aleph", "hypothesis", "ah", "despite", "reason", "calling", "zermelo", "s", "system", "first", "real", "axiomatisation", "set", "theory", "clear", "zermelo", "s", "intention", "reveal", "fundamental", "nature", "theory", "set", "preserve", "achievement", "time", "providing", "general", "replacement", "cp", "2", "background", "zermelo", "s", "axiomatisation", "21", "hilbert", "s", "axiomatic", "method", "hilbert", "s", "early", "work", "axiomatic", "method", "important", "part", "context", "zermelo", "s", "axiomatisation", "hilbert", "developed", "particular", "version", "axiomatic", "approach", "fundamental", "mathematical", "theory", "work", "geometry", "period", "18941904", "see", "hallett", "majer", "2004", "seen", "distinct", "alternative", "hilbert", "called", "genetic", "approach", "mathematics", "short", "historically", "informed", "description", "see", "felgner", "2010", "169174", "ebbinghaus", "s", "book", "zermelo", "make", "clear", "embedded", "zermelo", "hilbert", "foundational", "circle", "early", "year", "century", "8", "meant", "suggest", "zermelo", "adopted", "hilbert", "s", "approach", "foundation", "mathematics", "aspect", "indeed", "zermelo", "developed", "distinctive", "approach", "foundational", "matter", "different", "hilbert", "s", "something", "emerges", "quite", "clearly", "later", "work", "nevertheless", "two", "element", "zermelo", "s", "procedure", "fit", "well", "hilbert", "s", "foundational", "approach", "early", "part", "century", "first", "element", "concern", "might", "called", "programmatic", "element", "hilbert", "s", "treatment", "foundation", "mathematics", "emerged", "later", "1890s", "especially", "regard", "notion", "mathematical", "existence", "second", "concern", "proof", "analysis", "highly", "important", "part", "hilbert", "s", "work", "euclidean", "geometry", "geometrical", "system", "generally", "matter", "intricate", "discussed", "adequately", "fuller", "discussion", "see", "hallett", "2008", "2010a", "important", "understanding", "zermelo", "s", "work", "fully", "rough", "account", "given", "211", "programmatic", "element", "first", "hilbert", "adopted", "view", "mature", "presentation", "mathematical", "theory", "must", "given", "axiomatically", "claim", "requires", "several", "thing", "postulation", "existence", "domain", "system", "system", "thing", "insistence", "however", "nothing", "known", "thing", "except", "expressed", "derived", "finite", "list", "axiom", "requirement", "along", "finite", "proof", "begin", "axiom", "proceed", "conclusion", "finite", "number", "inference", "ie", "acceptable", "inferential", "step", "rather", "imprecise", "notion", "completeness", "axiomatisation", "involves", "loosely", "showing", "axiom", "prove", "ought", "prove", "provision", "consistency", "proof", "axiom", "showing", "contradiction", "derivable", "proof", "constructed", "system", "given", "one", "thing", "hilbert", "clear", "especially", "unpublished", "lecture", "geometry", "see", "hallett", "majer", "2004", "although", "domain", "asserted", "exist", "known", "object", "domain", "given", "u", "axiom", "derived", "finite", "proof", "word", "domain", "postulated", "nothing", "taken", "known", "thing", "independently", "axiom", "laid", "entail", "basic", "example", "given", "geometrical", "system", "point", "line", "plane", "although", "geometrical", "domain", "made", "thing", "nothing", "assumed", "known", "particular", "intuitive", "geometrical", "knowledge", "whatever", "source", "given", "axiom", "derived", "legitimate", "inference", "axiom", "might", "sum", "derived", "intuitive", "knowledge", "different", "matter", "even", "important", "detach", "axiom", "intuitive", "meaning", "secondly", "existence", "object", "matter", "zermelo", "say", "belonging", "domain", "fact", "established", "axiom", "proof", "axiom", "mathematical", "existence", "domain", "correspondingly", "system", "set", "axiom", "established", "consistency", "proof", "axiom", "thus", "take", "prime", "example", "existence", "euclidean", "geometry", "accurately", "euclidean", "geometry", "shown", "consistency", "proof", "given", "mean", "analytic", "geometry", "9", "thus", "unit", "consistency", "concept", "individual", "proposition", "rather", "system", "axiom", "whole", "different", "system", "necessarily", "give", "account", "different", "primitive", "expectation", "domain", "axiomatised", "attention", "turn", "point", "consistency", "proof", "deal", "finally", "question", "mathematical", "existence", "case", "task", "showing", "existence", "mathematical", "one", "ontological", "metaphysical", "mystery", "solved", "axiom", "laid", "many", "aspect", "hilbert", "s", "position", "summed", "passage", "1902", "lecture", "foundation", "geometry", "axiom", "create", "domain", "consistency", "proof", "justify", "existence", "put", "thing", "mathematics", "concerned", "defined", "axiom", "brought", "life", "axiom", "taken", "quite", "arbitrarily", "however", "axiom", "contradict", "logical", "consequence", "drawn", "system", "defined", "exist", "mathematician", "hilbert", "1902", "47", "hallett", "majer", "2004", "563", "notion", "definition", "axiom", "came", "known", "method", "implicit", "definition", "seen", "various", "writing", "hilbert", "s", "around", "1900", "attitude", "existence", "illustrated", "following", "passage", "famous", "paper", "axiomatisation", "real", "objection", "raised", "existence", "totality", "real", "number", "infinite", "set", "generally", "lose", "justification", "one", "adopted", "view", "stated", "axiomatic", "method", "set", "real", "number", "imagine", "something", "like", "totality", "possible", "law", "governing", "development", "fundamental", "series", "rather", "set", "system", "thing", "whose", "mutual", "relation", "given", "finite", "closed", "system", "axiom", "iiv", "complete", "ordered", "field", "given", "statement", "validity", "case", "one", "derive", "via", "finite", "number", "inference", "axiom", "hilbert", "1900b", "184", "10", "parallel", "axiomatic", "method", "hilbert", "s", "zermelo", "s", "axiomatisation", "set", "theory", "reasonably", "clear", "exact", "11", "particularly", "clear", "assumption", "existence", "domain", "𝔅", "statement", "finite", "list", "axiom", "governing", "content", "recognition", "requirement", "general", "consistency", "proof", "s", "also", "implicit", "recognition", "requirement", "finite", "proof", "lead", "u", "second", "important", "aspect", "hilbertian", "background", "namely", "proof", "analysis", "use", "axiom", "choice", "212", "proof", "analysis", "zermelo", "s", "wellordering", "theorem", "wot", "great", "deal", "hilbert", "s", "work", "geometry", "concerned", "analysis", "proof", "derived", "much", "hilbert", "s", "novel", "work", "geometry", "involved", "clever", "use", "arithmetical", "model", "geometrical", "system", "demonstrate", "succession", "independence", "result", "among", "thing", "often", "show", "finely", "balanced", "various", "central", "assumption", "12", "moreover", "close", "reading", "hilbert", "s", "work", "make", "clear", "development", "appropriate", "axiom", "system", "go", "handinhand", "reconstruction", "analysis", "proof", "one", "straightforward", "kind", "proof", "analysis", "designed", "reveal", "assumption", "behind", "accepted", "theorem", "clearly", "pertinent", "case", "zermelo", "s", "axiom", "choice", "sixth", "axiom", "wot", "zermelo", "s", "work", "showed", "effect", "choice", "principle", "behind", "axiom", "necessary", "sufficient", "condition", "wot", "show", "furnishing", "hilbertian", "style", "proof", "theorem", "ie", "conclusion", "follows", "fairly", "clear", "assumption", "mean", "finite", "number", "inferential", "step", "indeed", "axiom", "chosen", "make", "wot", "provable", "transpired", "subsequently", "also", "made", "provable", "vast", "array", "result", "mainly", "solely", "set", "theory", "settheoretic", "algebra", "understand", "importance", "zermelo", "s", "work", "s", "necessary", "appreciate", "centrality", "wot", "22", "wellordering", "problem", "wellordering", "theorem", "221", "importance", "problem", "zermelo", "one", "fundamental", "paper", "genesis", "set", "theory", "cantor", "1883a", "isolated", "notion", "wellordering", "collection", "one", "central", "conceptual", "pillar", "number", "built", "cantor", "took", "view", "notion", "counting", "number", "must", "based", "underlying", "ordering", "set", "thing", "counted", "ordering", "first", "element", "counted", "following", "collection", "element", "counted", "must", "next", "element", "counted", "assuming", "element", "still", "uncounted", "kind", "ordering", "called", "wellordering", "define", "totalordering", "extra", "condition", "namely", "subset", "least", "element", "ordering", "cantor", "recognised", "distinct", "wellordering", "element", "give", "rise", "distinct", "counting", "number", "originally", "called", "anzahl", "enumeral", "later", "ordnungszahl", "ordinal", "number", "number", "conceptually", "quite", "different", "cardinal", "number", "power", "meant", "express", "size", "collection", "13", "distinction", "hard", "perceive", "first", "sight", "cantor", "rise", "modern", "theory", "transfinite", "number", "standard", "counting", "number", "ordinary", "finite", "number", "14", "crucially", "finite", "collection", "turn", "two", "ordering", "underlying", "element", "certainly", "wellorderings", "cantor", "s", "sense", "orderisomorphic", "ie", "essentially", "distinct", "15", "mean", "one", "effect", "identify", "number", "arrived", "counting", "ordinal", "number", "cardinal", "number", "collection", "counted", "thus", "ordinary", "natural", "number", "appear", "two", "guise", "possible", "determine", "size", "finite", "collection", "directly", "counting", "cantor", "observed", "cease", "case", "rather", "dramatic", "fashion", "one", "considers", "infinite", "collection", "element", "give", "rise", "large", "variety", "distinct", "wellorderings", "nevertheless", "cantor", "noticed", "one", "collect", "together", "countable", "ordinal", "number", "ie", "number", "representing", "wellorderings", "set", "natural", "number", "collection", "cantor", "called", "second", "numberclass", "first", "set", "natural", "number", "must", "greater", "cardinality", "collection", "natural", "number", "moreover", "size", "cardinal", "successor", "size", "natural", "number", "clear", "sense", "infinite", "subset", "second", "numberclass", "either", "power", "natural", "number", "power", "whole", "class", "thus", "size", "strictly", "intermediate", "process", "generalises", "collect", "together", "ordinal", "number", "representing", "wellorderings", "second", "numberclass", "form", "third", "numberclass", "must", "immediate", "successor", "size", "second", "numberclass", "way", "cantor", "could", "use", "ordinal", "number", "generate", "infinite", "sequence", "cardinality", "power", "sequence", "later", "cantor", "1895", "called", "alephsequence", "ℵ0", "size", "natural", "number", "ℵ1", "expressing", "size", "second", "numberclass", "ℵ2", "expressing", "size", "third", "numberclass", "since", "intention", "ordinal", "number", "could", "generated", "arbitrarily", "far", "seems", "could", "aleph", "raise", "possibility", "reinstating", "centrality", "ordinal", "number", "fundamental", "number", "even", "case", "infinite", "set", "thus", "making", "ordinality", "foundation", "cardinality", "set", "work", "1883", "cantor", "attempted", "show", "aleph", "actually", "represent", "scale", "infinite", "cardinal", "number", "instance", "shown", "ordinal", "number", "comparable", "ie", "two", "ordinal", "number", "α", "β", "either", "α", "β", "α", "β", "α", "β", "desirable", "perhaps", "essential", "property", "counting", "number", "comparability", "therefore", "transfer", "aleph", "cantor", "able", "give", "clear", "appropriate", "arithmetical", "operation", "addition", "multiplication", "exponentiation", "generalising", "corresponding", "notion", "finite", "collection", "statement", "proof", "general", "law", "concerning", "1878", "cantor", "put", "forward", "hypothesis", "infinite", "power", "natural", "number", "continuum", "became", "known", "cantor", "s", "continuum", "hypothesis", "ch", "adumbration", "number", "class", "ch", "take", "form", "continuum", "power", "second", "numberclass", "development", "alephscale", "assumes", "form", "conjecture", "exponentiation", "operation", "generalised", "cardinal", "arithmetic", "expressed", "form", "2ℵ0", "ℵ1", "continuum", "problem", "generally", "construed", "really", "problem", "power", "continuum", "scale", "aleph", "number", "generalised", "continuum", "hypothesis", "conjecture", "taking", "power", "set", "infinite", "set", "corresponds", "moving", "one", "level", "aleph", "scale", "example", "1883", "cantor", "assumed", "without", "remark", "set", "real", "function", "size", "third", "numberclass", "given", "ch", "becomes", "conjecture", "2ℵ1", "ℵ2", "adopting", "aleph", "scale", "framework", "infinite", "cardinality", "depends", "significant", "assumption", "clear", "collection", "wellordered", "form", "given", "represented", "ordinal", "must", "alephnumber", "representing", "size", "clearly", "alephsequence", "represents", "size", "power", "cantor", "called", "wellordered", "set", "however", "set", "put", "wellordered", "form", "particular", "question", "form", "concern", "continuum", "continuum", "equivalent", "second", "numberclass", "clearly", "wellordered", "indeed", "necessary", "condition", "showing", "continuum", "represented", "scale", "wellordered", "generally", "assume", "cardinality", "represented", "scale", "aleph", "number", "assume", "particular", "set", "wellordered", "assume", "alephsequence", "scale", "infinite", "cardinal", "number", "assume", "least", "set", "generally", "compared", "cardinally", "ie", "n", "either", "n", "n", "comp", "short", "correct", "introducing", "notion", "wellordering", "1883", "cantor", "expressed", "belief", "fact", "set", "manifold", "wellordered", "law", "thought", "denkgesetz", "thus", "putting", "forward", "convenience", "call", "wellordering", "hypothesis", "woh", "concept", "wellordered", "set", "reveals", "fundamental", "theory", "manifold", "always", "possible", "arrange", "welldefined", "set", "form", "wellordered", "set", "seems", "basic", "law", "thought", "rich", "consequence", "particularly", "remarkable", "virtue", "general", "validity", "return", "later", "memoir", "cantor", "1883a", "1932", "169", "cantor", "say", "nothing", "might", "mean", "call", "wellordering", "hypothesis", "law", "thought", "never", "return", "question", "directly", "however", "one", "form", "another", "claim", "key", "could", "cantor", "time", "considered", "woh", "something", "like", "logical", "principle", "16", "however", "particularly", "clear", "especially", "since", "study", "formal", "logic", "adequate", "mathematical", "reasoning", "infancy", "set", "concept", "new", "rather", "unclearly", "delimited", "another", "suggestion", "wellorderability", "intrinsic", "way", "welldefined", "set", "either", "presented", "conceived", "eg", "impossible", "think", "collection", "s", "set", "without", "time", "allowing", "element", "arranged", "discretely", "way", "even", "arrangement", "automatically", "deduced", "definition", "thus", "one", "view", "set", "necessary", "mathematics", "one", "hold", "concept", "set", "necessarily", "involves", "discrete", "arrangement", "element", "set", "woh", "might", "appear", "necessary", "imprecise", "least", "notion", "set", "imprecise", "imprecisely", "formulated", "one", "clear", "implication", "cantor", "s", "remark", "regard", "woh", "something", "require", "proof", "nonetheless", "long", "stated", "cantor", "clearly", "doubt", "wellorderability", "continuum", "cardinal", "comparability", "see", "moore", "1982", "44", "suggested", "woh", "associated", "hypothesis", "aleph", "represent", "scale", "infinite", "cardinality", "require", "proof", "taken", "definitional", "thus", "seemed", "clear", "whole", "cantorian", "project", "erecting", "scale", "infinite", "size", "depends", "root", "correctness", "woh", "work", "subsequent", "1884", "suggests", "cantor", "felt", "need", "supply", "argument", "wellordering", "instance", "cantor", "1895", "493", "show", "every", "infinite", "set", "countable", "subset", "thus", "ℵ0", "smallest", "cardinality", "cantor", "set", "prove", "existence", "subset", "wellordered", "like", "natural", "number", "key", "point", "observe", "cantor", "felt", "necessary", "exhibit", "wellordered", "subset", "simply", "proceed", "first", "assuming", "appeal", "denkgesetz", "arranged", "wellordered", "form", "exhibit", "subset", "following", "way", "proof", "one", "removed", "finite", "number", "element", "t1", "t2", "tν1", "according", "rule", "possibility", "always", "remains", "extracting", "element", "tν", "set", "tν", "ν", "denotes", "arbitrary", "finite", "cardinal", "number", "subset", "cardinal", "number", "ℵ0", "tν", "ν", "cantor", "1895", "493", "1932", "zermelo", "edited", "cantor", "s", "collected", "paper", "cantor", "1932", "commented", "particular", "proof", "follows", "proof", "theorem", "purely", "intuitive", "logically", "unsatisfactory", "recall", "wellknown", "primitive", "attempt", "arrive", "wellordering", "given", "set", "successive", "removal", "arbitrary", "element", "arrive", "correct", "proof", "start", "already", "wellordered", "set", "whose", "smallest", "transfinite", "initial", "segment", "fact", "cardinal", "number", "ℵ0", "sought", "zermelo", "cantor", "1932", "352", "second", "context", "argument", "given", "attempt", "cantor", "correspondence", "first", "hilbert", "dedekind", "show", "every", "set", "must", "alephnumber", "cardinal", "17", "cantor", "attempt", "show", "effect", "following", "assume", "ω", "represents", "sequence", "ordinal", "number", "assume", "reductio", "argument", "v", "multiplicity", "equivalent", "aleph", "cantor", "argues", "ω", "projected", "v", "turn", "showing", "v", "must", "call", "inconsistent", "multiplicity", "ie", "legitimate", "set", "follow", "set", "aleph", "cardinal", "since", "always", "exhausted", "projection", "ordinal", "case", "cardinally", "equivalent", "ordinal", "numberclass", "18", "zermelo", "s", "dismissal", "attempted", "proof", "surprise", "given", "comment", "quoted", "also", "comment", "exactly", "projection", "weakness", "proof", "outlined", "lie", "precisely", "proved", "whole", "series", "number", "ω", "projected", "multiplicity", "v", "aleph", "cardinal", "number", "rather", "taken", "somewhat", "vague", "intuition", "apparently", "cantor", "imago", "number", "ω", "successively", "arbitrarily", "assigned", "element", "v", "way", "every", "element", "v", "used", "either", "process", "must", "come", "end", "element", "v", "used", "case", "v", "would", "coordinated", "initial", "segment", "number", "series", "power", "consequently", "aleph", "contrary", "assumption", "v", "would", "remain", "inexhaustible", "would", "contain", "component", "equivalent", "whole", "ω", "thus", "inconsistent", "component", "intuition", "time", "zeitanschauung", "applied", "process", "go", "beyond", "intuition", "wesen", "supposed", "make", "successive", "arbitrary", "choice", "thereby", "define", "subset", "v", "v", "definable", "condition", "given", "zermelo", "cantor", "1932", "451", "19", "really", "successive", "selection", "relied", "seems", "one", "must", "assuming", "subset", "instant", "time", "wellordered", "form", "base", "ordering", "successive", "selection", "made", "short", "really", "presupposed", "wellordered", "subset", "temporal", "instant", "act", "basis", "recursive", "definition", "even", "case", "countable", "subset", "process", "actually", "come", "conclusion", "presupposed", "would", "presumably", "able", "distinguish", "countably", "infinite", "discrete", "sequence", "instant", "within", "finite", "time", "assumption", "wellknown", "notoriously", "controversial", "one", "general", "case", "position", "actually", "worse", "question", "wellorderability", "given", "set", "depends", "least", "existence", "wellordered", "subset", "temporal", "instant", "arbitrarily", "high", "infinite", "cardinality", "appears", "go", "assumption", "time", "ordinary", "continuum", "ie", "cardinality", "2ℵ0", "unless", "course", "power", "set", "natural", "number", "big", "counted", "ordinal", "case", "much", "point", "argument", "would", "lost", "one", "aim", "presumably", "show", "power", "continuum", "somewhere", "alephsequence", "20", "part", "issue", "least", "implicitly", "constitutes", "proof", "seems", "obvious", "set", "nonempty", "must", "possible", "choose", "element", "ie", "must", "exist", "element", "indeed", "obviousness", "enshrined", "modern", "logical", "calculus", "way", "inference", "principle", "existential", "instantiation", "ei", "usually", "work", "xpx", "one", "assumes", "pc", "c", "new", "constant", "reason", "basis", "whatever", "inferred", "p", "c", "long", "contain", "new", "constant", "c", "taken", "inferable", "xpx", "alone", "furthermore", "clear", "extends", "finite", "set", "finite", "extension", "stringing", "together", "successive", "inferential", "step", "inferential", "procedure", "extended", "infinite", "set", "evidence", "centrality", "woh", "provided", "problem", "1", "hilbert", "s", "list", "mathematical", "problem", "famous", "lecture", "international", "congress", "mathematician", "paris", "1900", "note", "cantor", "s", "conviction", "correctness", "ch", "great", "probability", "go", "mention", "another", "remarkable", "assertion", "cantor", "s", "namely", "belief", "continuum", "although", "natural", "order", "wellordered", "form", "rearranged", "wellordered", "set", "however", "russell", "writing", "roughly", "time", "expressed", "doubt", "precisely", "cantor", "assumes", "axiom", "every", "class", "field", "wellordered", "series", "deduces", "cardinal", "correlated", "ordinal", "assumption", "seems", "unwarranted", "especially", "view", "fact", "one", "yet", "succeeded", "arranging", "class", "2α0", "term", "wellordered", "series", "russell", "1903", "322323", "go", "know", "two", "different", "cardinal", "number", "one", "must", "greater", "may", "2α0", "neither", "greater", "le", "α1", "α2", "successor", "may", "called", "wellordered", "cardinal", "apply", "wellordered", "series", "russell", "1903", "323", "21", "recall", "international", "congress", "mathematician", "heidelberg", "1904", "könig", "given", "apparently", "convincing", "proof", "continuum", "aleph", "könig", "s", "argument", "know", "turned", "contain", "fatal", "flaw", "case", "confusion", "exhibit", "instructive", "22", "short", "clear", "impression", "immediate", "period", "leading", "zermelo", "s", "work", "woh", "would", "provide", "solid", "foundation", "build", "reasonable", "notion", "infinite", "cardinal", "number", "proper", "framework", "tackling", "ch", "woh", "requires", "justification", "must", "become", "effect", "wot", "wotheorem", "short", "establishing", "wot", "closely", "bound", "clarification", "count", "set", "222", "zermelo", "s", "1904", "proof", "wellordering", "theorem", "zermelo", "s", "approach", "wellordering", "problem", "took", "place", "three", "stage", "published", "proof", "wot", "1904", "zermelo", "1904", "extract", "letter", "hilbert", "first", "introduced", "choice", "principle", "principle", "designed", "despite", "name", "come", "bear", "move", "away", "cantorian", "choosing", "argument", "almost", "universally", "preceded", "zermelo", "s", "work", "postulate", "arbitrary", "choice", "already", "made", "paper", "produced", "outcry", "zermelo", "responded", "producing", "new", "proof", "1908a", "us", "choice", "principle", "time", "somewhat", "different", "form", "expressed", "explicitly", "axiom", "first", "three", "page", "paper", "give", "new", "proof", "followed", "seventeen", "page", "reply", "great", "detail", "many", "objection", "raised", "first", "proof", "consisted", "objection", "choice", "principle", "also", "objection", "unclarity", "underlying", "assumption", "operation", "set", "used", "proof", "paper", "followed", "two", "month", "later", "zermelo", "s", "official", "axiomatisation", "1908b", "axiomatisation", "large", "degree", "prefigured", "paper", "1908a", "zermelo", "s", "1904", "proof", "briefly", "described", "1", "let", "arbitrarily", "given", "set", "let", "power", "set", "assume", "given", "zermelo", "call", "covering", "ie", "function", "γ", "nonempty", "element", "γ", "x", "x", "word", "would", "called", "choice", "function", "argument", "show", "γ", "determines", "unique", "wellordering", "m", "23", "2", "using", "fixed", "γ", "zermelo", "defines", "socalled", "γsets", "mγ", "satisfy", "following", "condition", "mγ", "mγ", "wellordered", "ordering", "specific", "mγ", "mγ", "must", "determine", "initial", "segment", "mγ", "γ", "must", "related", "way", "γ", "ie", "distinguished", "element", "zermelo", "call", "complement", "m", "3", "clearly", "γ", "set", "m1", "one", "m1", "γ", "take", "trivial", "wellordering", "set", "m1", "m2", "also", "γset", "m1", "γ", "m2", "γ", "m1", "m1", "m2", "given", "ordering", "place", "m2", "m1", "note", "m1", "m2", "ordering", "would", "γset", "fact", "easy", "see", "m", "γset", "condition", "2", "c", "mean", "uniquely", "one", "tempted", "say", "recursively", "determined", "4", "indeed", "following", "zermelo", "show", "two", "distinct", "γsets", "one", "identical", "initial", "segment", "wellordering", "latter", "extends", "wellordering", "former", "5", "zermelo", "considers", "set", "lγ", "union", "taken", "γsets", "difficult", "see", "lγ", "must", "γset", "indeed", "largest", "definition", "lγ", "zermelo", "show", "equality", "must", "hold", "lγ", "would", "nonempty", "subset", "case", "consider", "γ", "lγ", "m1", "form", "lγ", "lγ", "m1", "supply", "wellordering", "lγ", "except", "extend", "fixing", "x", "m1", "x", "lγ", "clearly", "lγ", "γset", "one", "properly", "extends", "lγ", "contradiction", "thus", "lγ", "wellordered", "ordering", "lγ", "24", "zermelo", "point", "p", "516", "paper", "wot", "establishes", "firm", "foundation", "theory", "infinite", "cardinality", "particular", "show", "say", "every", "set", "totality", "subset", "etc", "sense", "considered", "wellordered", "set", "power", "considered", "aleph", "later", "work", "hartogs", "see", "hartogs", "1915", "showed", "wot", "imply", "comp", "zermelo", "show", "comp", "implies", "wot", "thus", "turn", "zermelo", "s", "choice", "principle", "thus", "comp", "necessary", "reasonable", "theory", "infinite", "cardinality", "wot", "despite", "zermelo", "s", "endorsement", "correctness", "hypothesis", "scale", "aleph", "number", "represents", "cardinal", "ah", "short", "complicated", "matter", "involves", "claim", "every", "set", "actually", "equivalent", "initial", "segment", "ordinal", "wellorderable", "axiomatic", "framework", "set", "therefore", "truth", "ah", "depends", "much", "ordinal", "present", "set", "system", "subsequent", "work", "showing", "independence", "ac", "axiom", "set", "theory", "vindicates", "zermelo", "s", "pioneering", "work", "respect", "put", "zermelo", "s", "revelation", "choice", "principle", "similar", "position", "hilbert", "ascribes", "parallel", "postulate", "euclid", "s", "work", "hilbert", "claim", "euclid", "must", "realised", "establish", "certain", "obvious", "fact", "triangle", "rectangle", "etc", "entirely", "new", "axiom", "euclid", "s", "parallel", "postulate", "necessary", "moreover", "gauß", "first", "mathematician", "2100", "year", "see", "euclid", "right", "see", "hallett", "majer", "2004261263", "343345", "pragmatic", "attitude", "display", "zermelo", "s", "second", "paper", "wellordering", "1908", "became", "effect", "reigning", "attitude", "towards", "choice", "principle", "certain", "problem", "solved", "choice", "principle", "must", "adopted", "1908", "zermelo", "brings", "parallel", "explicitly", "banishing", "fundamental", "fact", "problem", "science", "merely", "dealt", "mean", "certain", "prescribed", "principle", "would", "like", "forbidding", "extension", "theory", "parallel", "geometry", "axiom", "upon", "theory", "rest", "shown", "unprovable", "zermelo", "1908a", "115", "zermelo", "1904", "call", "choice", "principle", "axiom", "rather", "designated", "logical", "principle", "zermelo", "say", "way", "explanation", "short", "logical", "principle", "sure", "reduced", "still", "simpler", "one", "applied", "without", "hesitation", "everywhere", "mathematical", "deduction", "zermelo", "1904", "516", "clear", "whether", "think", "choice", "principle", "law", "thought", "term", "logical", "principle", "might", "suggest", "whether", "think", "intrinsic", "mathematical", "reasoning", "whenever", "set", "involved", "position", "suggested", "reference", "application", "everywhere", "mathematical", "deduction", "time", "second", "wellordering", "paper", "1908", "zermelo", "seems", "moved", "away", "idea", "ac", "logical", "principle", "sense", "logical", "law", "appears", "put", "emphasis", "view", "intrinsic", "subject", "matter", "appears", "axiom", "iv", "saw", "axiom", "vi", "zermelo", "1908b", "25", "223", "objection", "1904", "proof", "three", "central", "objection", "objection", "choice", "principle", "objection", "zermelo", "s", "general", "operation", "set", "especially", "wellorderings", "objection", "impredicative", "definition", "let", "u", "briefly", "deal", "objection", "choice", "principle", "two", "kind", "main", "objection", "put", "forward", "borel", "1905", "mathematische", "annalen", "borel", "1905", "journal", "published", "zermelo", "s", "paper", "also", "widely", "discussed", "correspondence", "leading", "french", "mathematician", "also", "published", "year", "journal", "see", "hadamard", "et", "al", "1905", "objection", "basically", "zermelo", "s", "principle", "fails", "specify", "law", "rule", "choice", "effected", "word", "covering", "used", "explicitly", "defined", "mean", "resulting", "wellordering", "explicitly", "defined", "either", "letter", "borel", "hadamard", "make", "clear", "opposition", "question", "really", "assumption", "existence", "object", "fully", "described", "existence", "object", "fully", "described", "see", "hadamard", "et", "al", "1905", "esp", "262", "reply", "zermelo", "remark", "inability", "describe", "choice", "choice", "principle", "effect", "axiom", "added", "principle", "effect", "position", "one", "want", "certain", "thing", "eg", "rely", "wot", "choice", "principle", "indispensable", "position", "repeat", "like", "one", "euclidean", "geometry", "take", "towards", "parallel", "b", "objection", "choice", "principle", "also", "put", "forward", "peano", "objection", "seems", "since", "choice", "principle", "proved", "syllogistically", "ie", "principle", "peano", "s", "formulario", "rejected", "see", "peano", "1906", "peano", "think", "however", "finite", "version", "choice", "principle", "provable", "relying", "essentially", "repeated", "application", "version", "class", "basic", "logical", "principle", "ei", "mentioned", "221", "zermelo", "s", "reply", "following", "axiom", "system", "like", "peano", "s", "constructed", "adequate", "mathematics", "one", "go", "selecting", "basic", "principle", "required", "one", "assemble", "complete", "list", "adequate", "principle", "say", "zermelo", "without", "careful", "inspection", "actual", "mathematics", "thereby", "careful", "assessment", "principle", "actually", "necessary", "list", "inspection", "would", "show", "choice", "principle", "surely", "one", "word", "selection", "principle", "peano", "s", "much", "post", "hoc", "procedure", "reply", "peano", "piece", "reply", "borel", "recall", "strongly", "invocation", "zermelo", "1908b", "261", "necessary", "distill", "principle", "actual", "operation", "set", "support", "claim", "choice", "principle", "necessary", "list", "seven", "problem", "opinion", "could", "dealt", "without", "principle", "choice", "zermelo", "1908a", "113", "26", "particular", "point", "principle", "indispensable", "reasonable", "theory", "infinite", "cardinality", "guarantee", "right", "result", "infinite", "unionssums", "addition", "vital", "making", "sense", "definition", "infinite", "product", "peano", "establish", "choice", "principle", "principle", "say", "zermelo", "strongly", "suggests", "list", "principle", "complete", "zermelo", "1908a", "112", "c", "another", "line", "objection", "represented", "different", "way", "bernstein", "bernstein", "1905", "jourdain", "jourdain", "1904", "1905b", "schoenflies", "schoenflies", "1905", "zermelo", "s", "general", "operation", "set", "proof", "dangerous", "flirt", "paradox", "see", "also", "hallett", "1984", "176182", "imprecise", "form", "objection", "zermelo", "le", "explicit", "principle", "us", "1904", "employ", "procedure", "reminiscent", "used", "crucially", "generation", "buraliforti", "antinomy", "eg", "showing", "set", "lγ", "extended", "lγ", "already", "collection", "w", "zermelo", "s", "reply", "dismissive", "something", "criticism", "certainly", "zermelo", "s", "1904", "proof", "attempt", "show", "wot", "proved", "bypassing", "general", "abstract", "theory", "wellordering", "association", "cantorian", "ordinal", "therefore", "also", "bypassing", "set", "w", "widely", "known", "cantorian", "ordinal", "denoted", "ω", "cantor", "consequently", "buraliforti", "antinomy", "however", "whatever", "zermelo", "s", "intention", "explicit", "attempt", "exclude", "possibility", "lγ", "w", "thus", "suggestion", "antinomy", "might", "threaten", "course", "zermelo", "referring", "critic", "base", "objection", "upon", "buraliforti", "antinomy", "declares", "antinomy", "without", "significance", "point", "view", "since", "principle", "employed", "exclude", "existence", "set", "w", "ordinal", "zermelo", "1908a", "128", "earlier", "hint", "118119", "real", "problem", "elementary", "russell", "antinomy", "also", "true", "end", "1904", "paper", "zermelo", "state", "argument", "hold", "set", "totality", "subset", "meaningful", "retrospect", "clearly", "hint", "important", "restriction", "set", "formation", "even", "zermelo", "s", "attitude", "unfair", "could", "remark", "totality", "subset", "etc", "indirect", "reference", "difficulty", "comprehension", "principle", "even", "principle", "repudiated", "explicitly", "1904", "paper", "neither", "zermelo", "put", "place", "another", "principle", "conversion", "property", "set", "aussonderungsaxiom", "1908", "axiomatisation", "moreover", "say", "existence", "principle", "proof", "based", "set", "existence", "principle", "divorce", "proof", "theorem", "cantorian", "assumption", "wellordering", "ordinal", "indeed", "zermelo", "assumes", "every", "set", "wellordered", "equivalent", "cantorian", "every", "cardinality", "aleph", "zermelo", "1904", "141", "despite", "later", "claim", "zermelo", "1908a", "119", "appear", "use", "ordinal", "informal", "theory", "wellordering", "definition", "γsets", "γset", "wellordered", "mγ", "without", "specification", "wellordered", "set", "defined", "assurance", "reduced", "zermelo", "s", "principle", "one", "important", "point", "yet", "shown", "usual", "apparatus", "settheoretic", "mathematics", "relation", "ordering", "relation", "function", "cardinal", "equivalence", "function", "orderisomorphisms", "etc", "could", "reduced", "simple", "principle", "set", "existence", "come", "wake", "zermelo", "s", "axiomatisation", "little", "doubt", "line", "criticism", "greatly", "influenced", "shape", "second", "proof", "given", "1908", "little", "last", "line", "objection", "general", "feature", "1904", "proof", "changed", "second", "proof", "namely", "use", "became", "known", "impredicative", "definition", "impredicative", "definition", "one", "defines", "object", "property", "involves", "reference", "either", "direct", "indirect", "thing", "property", "must", "course", "include", "sense", "definition", "involves", "circle", "russell", "poincaré", "became", "greatly", "exercised", "form", "definition", "saw", "circle", "involved", "vicious", "responsible", "paradox", "one", "think", "definition", "like", "construction", "principle", "indeed", "illegitimate", "one", "think", "rather", "way", "singling", "thing", "already", "taken", "exist", "illegitimate", "respect", "zermelo", "endorses", "hilbert", "s", "view", "existence", "show", "particular", "thing", "exists", "show", "𝔅", "ie", "show", "mean", "finite", "proof", "axiom", "exists", "𝔅", "exists", "really", "matter", "axiom", "taken", "whole", "determine", "separation", "power", "set", "choice", "principle", "axiom", "given", "domain", "choice", "functionssets", "subset", "consequently", "wellorderings", "forth", "principle", "included", "axiom", "demonstration", "existence", "forthcoming", "point", "view", "defining", "within", "language", "deployed", "much", "like", "zermelo", "call", "determination", "since", "definition", "although", "certain", "sense", "arbitrary", "supported", "existence", "proof", "course", "general", "turn", "given", "extension", "picked", "several", "distinct", "determination", "short", "zermelo", "s", "view", "definition", "pick", "determine", "object", "among", "others", "domain", "axiomatised", "responsible", "showing", "existence", "end", "existence", "domain", "𝔅", "guaranteed", "consistency", "proof", "collection", "axiom", "precisely", "view", "impredicative", "definition", "put", "forward", "ramsey", "1926", "368369", "later", "gödel", "s", "1944", "essay", "russell", "s", "mathematical", "logic", "part", "analysis", "various", "thing", "could", "meant", "russell", "s", "ambiguously", "stated", "vicious", "circle", "principle", "see", "gödel", "1944", "136", "127128", "reprinting", "gödel", "1990", "see", "also", "hadamard", "s", "letter", "hadamard", "et", "al", "1905", "support", "view", "zermelo", "point", "impredicative", "definition", "taken", "standard", "established", "mathematics", "particularly", "way", "least", "upper", "bound", "defined", "witness", "cauchy", "proof", "fundamental", "theorem", "algebra", "zermelo", "s", "reply", "coloured", "principle", "looking", "actual", "practice", "mathematics", "27", "224", "zermelo", "s", "second", "proof", "wot", "1908", "mentioned", "zermelo", "published", "second", "proof", "wot", "submitted", "mathematische", "annalen", "two", "week", "submission", "official", "axiomatisation", "published", "volume", "axiomatisation", "proof", "elaborate", "described", "much", "fuller", "description", "found", "hallett", "2010b", "94103", "brief", "remark", "must", "made", "nevertheless", "recall", "purpose", "proof", "large", "part", "reply", "criticism", "raised", "objection", "1904", "proof", "least", "clarify", "status", "choice", "principle", "suppose", "set", "given", "suppose", "using", "zermelo", "s", "notation", "𝔘m", "set", "subset", "untermengen", "basic", "procedure", "1904", "proof", "single", "certain", "subset", "show", "effect", "chained", "together", "starting", "modest", "beginning", "using", "choice", "function", "γ", "thus", "m1", "m1", "γ", "m1", "m2", "m1", "γ", "m2", "γ", "m1", "way", "proof", "show", "one", "build", "whole", "28", "buildup", "one", "thing", "provoked", "scepticism", "particularly", "step", "show", "must", "embraced", "1908", "proof", "basic", "idea", "start", "consider", "cutting", "element", "chosen", "choice", "principle", "instead", "building", "thus", "one", "accepts", "legitimate", "set", "𝔘m", "danger", "extending", "inconsistent", "set", "even", "appearance", "danger", "key", "thing", "show", "set", "defined", "fact", "chained", "together", "right", "way", "exhaustive", "1904", "proof", "point", "look", "zermelo", "appealing", "arbitrary", "wellorderings", "thus", "indirectly", "arbitrary", "ordinal", "avoided", "1908", "proof", "could", "1904", "proof", "focusing", "particular", "chain", "proof", "give", "rise", "chain", "exhibit", "wellordering", "modern", "understanding", "set", "theory", "show", "wellordering", "would", "show", "set", "ordered", "pair", "member", "relation", "satisfying", "right", "property", "wellordering", "relation", "m", "well", "remember", "zermelo", "s", "task", "1908", "constrained", "establish", "existence", "wellordering", "using", "settheoretical", "material", "available", "material", "involve", "general", "notion", "ordinal", "cardinal", "number", "even", "general", "notion", "relation", "function", "zermelo", "used", "therefore", "particular", "relation", "b", "subset", "important", "observe", "chain", "produced", "ordered", "relation", "would", "one", "expect", "latter", "work", "well", "chain", "produced", "naturally", "subset", "wellordering", "linear", "also", "intersection", "arbitrary", "element", "member", "chain", "member", "chain", "thus", "natural", "subsetleast", "element", "subset", "member", "chain", "wider", "explanation", "hinted", "towards", "end", "zermelo", "s", "proof", "suppose", "set", "speaking", "informally", "de", "facto", "wellordered", "ordering", "relation", "call", "set", "ℜ", "x", "x", "remainder", "rest", "determined", "ordering", "consider", "set", "remainder", "given", "ordering", "ie", "ℜ", "x", "x", "set", "fact", "wellordered", "reverse", "inclusion", "successor", "remainder", "ℜ", "remainder", "determined", "s", "successor", "a", "intersection", "taken", "limit", "element", "intersection", "set", "remainder", "remainder", "set", "wellordered", "reverse", "inclusion", "ordering", "isomorphic", "ordering", "b", "ℜ", "b", "ℜ", "zermelo", "s", "1908", "construction", "meant", "define", "remainder", "set", "directly", "without", "detour", "resultant", "inclusion", "ordering", "mirrored", "m", "key", "thing", "show", "chain", "subset", "picked", "really", "match", "element", "correspond", "remainder", "ℜ", "must", "possible", "use", "choice", "function", "squeeze", "another", "remainder", "chain", "would", "contradict", "assumption", "set", "appropriate", "definition", "already", "chain", "29", "spoken", "function", "relation", "fact", "zermelo", "avoids", "talk", "defines", "wellordered", "element", "corresponds", "uniquely", "remainder", "zermelo", "1908a", "111", "show", "say", "zermelo", "theory", "wellordering", "rest", "exclusively", "upon", "elementary", "notion", "set", "theory", "uninformed", "prone", "look", "mystical", "meaning", "behind", "cantor", "s", "relation", "b", "zermelo", "1908a", "one", "considerably", "precise", "relation", "ordering", "remainder", "inclusion", "ordering", "𝔘m", "much", "worked", "hessenberg", "1906", "therefore", "known", "zermelo", "zermelo", "hessenberg", "regular", "contact", "simplified", "greatly", "kuratowski", "1920s", "reason", "refer", "kuratowski", "briefly", "next", "section", "30", "choice", "principle", "1904", "framed", "effect", "choice", "function", "whose", "domain", "nonempty", "subset", "m", "1908", "zermelo", "frame", "differently", "axiom", "iv", "set", "decomposed", "set", "disjoint", "part", "b", "c", "containing", "least", "one", "element", "posse", "least", "one", "subset", "s1", "exactly", "one", "element", "common", "part", "b", "c", "considered", "zermelo", "1908a", "110", "word", "choice", "principle", "cast", "set", "form", "function", "form", "1904", "1908", "axiomatisation", "axiom", "stated", "much", "way", "called", "though", "wellordering", "paper", "axiom", "choice", "however", "1908", "paper", "wot", "say", "axiom", "provides", "set", "s1", "simultaneous", "choice", "distinguish", "successive", "choice", "used", "prezermelo", "version", "wellordering", "noted", "1921", "zermelo", "wrote", "fraenkel", "partial", "repudiation", "designation", "axiom", "choice", "saying", "sense", "theory", "deal", "real", "choice", "31", "225", "axiom", "1908", "wot", "paper", "axiom", "governing", "setexistence", "zermelo", "rely", "zermelo", "1908a", "start", "paper", "zermelo", "list", "two", "postulate", "explicitly", "depends", "version", "separation", "axiom", "power", "set", "axiom", "later", "list", "axiom", "iv", "noted", "asserts", "existence", "choice", "set", "set", "disjoint", "nonempty", "set", "addition", "zermelo", "make", "use", "existence", "various", "elementary", "set", "though", "nt", "say", "exactly", "principle", "relies", "axiomatisation", "follows", "two", "week", "later", "zermelo", "adopts", "axiom", "add", "clarification", "elementary", "set", "also", "add", "axiom", "infinity", "guarantee", "infinite", "set", "axiom", "extensionality", "codifies", "assumption", "set", "really", "determined", "member", "accidental", "way", "member", "selected", "addition", "noted", "call", "axiom", "choice", "name", "3", "major", "problem", "zermelo", "s", "system", "zermelo", "s", "system", "although", "form", "root", "modern", "axiomatisations", "set", "theory", "initially", "faced", "various", "difficulty", "problem", "axiom", "choice", "problem", "formulation", "separation", "axiom", "problem", "completeness", "one", "hilbert", "s", "important", "desideratum", "adequacy", "axiom", "system", "specifically", "problem", "representing", "ordinary", "mathematics", "purely", "settheoretically", "also", "problem", "representing", "fully", "transfinite", "extension", "mathematics", "cantor", "pioneered", "problem", "concerning", "axiom", "choice", "discussed", "discus", "difficulty", "formulation", "separation", "completeness", "31", "separation", "problem", "axiom", "separation", "obviousness", "principle", "seems", "straightforward", "accept", "one", "set", "object", "one", "separate", "subclass", "set", "specifying", "property", "treat", "turn", "set", "question", "subtler", "one", "namely", "formulate", "principle", "axiom", "mean", "separating", "accepted", "allowable", "property", "matter", "practice", "use", "language", "state", "property", "informal", "mathematics", "mixture", "natural", "language", "special", "mathematical", "language", "richard", "paradox", "see", "richard", "1905", "also", "paper", "poincaré", "1905", "1906a", "b", "make", "clear", "one", "careful", "defining", "property", "unregulated", "use", "ordinary", "language", "lead", "unexpected", "difficulty", "zermelo", "s", "answer", "moving", "system", "second", "wellordering", "paper", "axiomatisation", "try", "specifying", "property", "allowed", "call", "property", "allowed", "definite", "property", "klassenaussagen", "propositional", "function", "state", "question", "assertion", "𝔈", "said", "definite", "fundamental", "relation", "domain", "mean", "axiom", "universally", "valid", "law", "logic", "determine", "without", "arbitrariness", "whether", "hold", "likewise", "propositional", "function", "𝔈", "x", "variable", "term", "x", "range", "individual", "class", "𝔎", "said", "definite", "definite", "single", "individual", "x", "class", "𝔎", "thus", "question", "whether", "ε", "b", "always", "definite", "question", "whether", "n", "zermelo", "asserts", "show", "paradox", "involving", "notion", "definability", "eg", "richard", "s", "denotation", "könig", "s", "avoided", "implying", "crucial", "restriction", "fundamental", "relation", "domain", "ε", "basic", "problem", "explained", "zermelo", "precise", "route", "fundamental", "relation", "ε", "given", "definite", "property", "give", "rise", "general", "doubt", "separation", "axiom", "fact", "safe", "replacement", "comprehension", "principle", "see", "fraenkel", "1927", "104", "play", "hand", "like", "poincaré", "consider", "adoption", "separation", "axiom", "insufficiently", "radical", "search", "solution", "paradox", "poincaré", "writes", "mr", "zermelo", "allow", "consider", "set", "object", "satisfy", "certain", "condition", "seems", "set", "never", "closed", "always", "possible", "introduce", "new", "object", "hand", "scruple", "speaking", "set", "object", "part", "certain", "menge", "also", "satisfy", "certain", "condition", "seems", "one", "posse", "menge", "without", "possessing", "time", "element", "among", "element", "choose", "satisfy", "given", "condition", "able", "make", "choice", "calmly", "without", "fear", "disturbed", "introduction", "new", "unforeseen", "element", "since", "already", "element", "hand", "positing", "beforehand", "menge", "erected", "enclosing", "wall", "keep", "intruder", "could", "come", "without", "query", "whether", "could", "intruder", "within", "enclosed", "inside", "wall", "poincaré", "1909", "477", "p", "59", "english", "translation", "poincaré", "referring", "indirectly", "view", "paradox", "due", "impredicative", "set", "formation", "course", "still", "possible", "even", "adoption", "axiom", "separation", "problem", "lack", "clarity", "zermelo", "s", "account", "addressed", "weyl", "1910", "weyl", "1910", "see", "especially", "p", "113", "skolem", "1922", "skolem", "1923", "p", "139", "reprint", "weyl", "skolem", "proposed", "effect", "question", "definite", "property", "solved", "taking", "property", "expressed", "1place", "predicate", "formula", "call", "firstorder", "logic", "effect", "thus", "recursive", "definition", "make", "definite", "property", "completely", "transparent", "giving", "time", "precise", "route", "ε", "definite", "property", "question", "deal", "aspect", "poincaré", "s", "worry", "make", "quite", "clear", "definite", "property", "also", "accord", "zermelo", "s", "view", "relation", "ε", "root", "one", "used", "32", "fraenkel", "1922", "later", "took", "different", "approach", "rather", "complicated", "direct", "axiomatisation", "notion", "definite", "property", "using", "recursive", "generation", "basic", "property", "giving", "notion", "appears", "subset", "recursively", "defined", "firstorder", "property", "zermelo", "accepted", "none", "approach", "two", "reason", "first", "thought", "recursive", "definition", "involved", "make", "direct", "use", "notion", "finite", "number", "fact", "pointed", "weyl", "1910", "ought", "business", "set", "theory", "explain", "presuppose", "secondly", "became", "aware", "using", "essentially", "firstorder", "notion", "condemns", "axiomatic", "system", "countable", "model", "fundamental", "fact", "pointed", "skolem", "1923", "approach", "first", "give", "different", "kind", "axiomatisation", "see", "zermelo", "1929", "use", "zermelo", "1930", "essentially", "secondorder", "notion", "characterising", "axiom", "separation", "33", "32", "completeness", "also", "problem", "completeness", "zermelo", "s", "theory", "since", "important", "theoretical", "matter", "zermelo", "deal", "either", "want", "appropriate", "definition", "showing", "certain", "construction", "represented", "pure", "theory", "set", "axiom", "set", "zermelo", "s", "system", "strong", "enough", "321", "representing", "ordinary", "mathematics", "zermelo", "give", "obvious", "way", "representing", "much", "ordinary", "mathematics", "yet", "clear", "opening", "remark", "regard", "task", "theory", "set", "stand", "fundamental", "theory", "investigate", "mathematically", "fundamental", "notion", "number", "order", "function", "see", "1", "first", "obvious", "question", "concern", "representation", "ordinary", "number", "system", "natural", "number", "represented", "zermelo", "axiom", "infinity", "give", "u", "set", "moreover", "seems", "since", "set", "natural", "number", "power", "set", "axiom", "available", "enough", "set", "represent", "rational", "real", "function", "real", "etc", "missing", "though", "detail", "exactly", "one", "represent", "right", "equivalence", "class", "sequence", "etc", "assuming", "one", "could", "define", "real", "number", "one", "characterise", "field", "operation", "addition", "mentioned", "previously", "zermelo", "natural", "way", "representing", "either", "general", "notion", "relation", "function", "mean", "presentation", "set", "theory", "natural", "way", "representing", "part", "mathematics", "like", "real", "analysis", "general", "notion", "function", "play", "fundamental", "part", "difficulty", "lack", "notion", "function", "make", "general", "theory", "comparison", "set", "size", "indeed", "order", "cumbersome", "zermelo", "develop", "way", "expressing", "disjoint", "set", "b", "size", "b", "first", "defining", "product", "two", "disjoint", "set", "isolating", "set", "unordered", "pair", "certain", "subset", "product", "map", "one", "set", "onetoone", "onto", "insufficiently", "general", "case", "indicate", "way", "introduce", "size", "a", "russell", "s", "method", "defining", "cardinality", "set", "card", "n", "n", "mean", "cardinally", "equivalent", "clearly", "inappropriate", "since", "set", "b", "card", "cardinal", "number", "1", "big", "universe", "union", "set", "1", "would", "indeed", "universal", "set", "specific", "problem", "defining", "aleph", "number", "second", "major", "difficulty", "along", "line", "concerning", "function", "relation", "thus", "ordering", "relation", "ordinal", "number", "seen", "224", "zermelo", "beginning", "answer", "second", "proof", "wot", "us", "theory", "subsetorderings", "represent", "underlying", "ordering", "set", "turn", "method", "given", "particular", "case", "suggests", "right", "way", "capture", "general", "notion", "322", "ordinality", "zermelo", "s", "idea", "1908a", "pursued", "kuratowski", "1920s", "thereby", "generalising", "systematising", "work", "zermelo", "hessenberg", "hausdorff", "giving", "simple", "set", "necessary", "sufficient", "condition", "subset", "ordering", "represent", "linear", "ordering", "also", "argues", "forcefully", "fact", "undesirable", "set", "theory", "go", "beyond", "present", "general", "theory", "ordinal", "number", "reasoning", "transfinite", "number", "one", "implicitly", "us", "axiom", "asserting", "existence", "desirable", "logical", "mathematical", "point", "view", "pare", "system", "axiom", "employed", "demonstration", "besides", "reduction", "free", "reasoning", "foreign", "element", "increase", "æsthetic", "value", "kuratowski", "1922", "77", "assumption", "clearly", "transfinite", "number", "added", "set", "theory", "new", "primitive", "kuratowski", "however", "undertakes", "prove", "transfinite", "number", "dispensed", "significant", "class", "application", "34", "application", "ordinal", "number", "analysis", "topology", "etc", "often", "focus", "process", "definition", "transfinite", "recursion", "number", "kuratowski", "succeeds", "showing", "significant", "class", "case", "kind", "ordinal", "avoided", "using", "purely", "settheoretic", "method", "reproducible", "zermelo", "s", "system", "note", "viewpoint", "zermelo", "s", "axiomatic", "theory", "set", "one", "say", "method", "explained", "allows", "u", "deduce", "theorem", "certain", "welldetermined", "general", "type", "directly", "zermelo", "s", "axiom", "say", "without", "introduction", "independent", "supplementary", "axiom", "existence", "transfinite", "number", "kuratowski", "1922", "77", "35", "reductionist", "context", "kuratowski", "develops", "general", "theory", "maximal", "inclusion", "ordering", "show", "effect", "ordering", "really", "represented", "inclusion", "ordering", "appropriate", "subset", "power", "set", "thus", "reducing", "ordering", "zermelo", "s", "primitive", "relation", "ε", "one", "immediate", "quite", "remarkable", "result", "work", "show", "one", "define", "general", "notion", "relation", "function", "purely", "settheoretic", "term", "long", "recognised", "relationsfunctions", "conceived", "set", "ordered", "pair", "kuratowski", "s", "work", "show", "define", "ordered", "pair", "primitively", "ordered", "pair", "b", "considered", "informally", "unordered", "pair", "b", "together", "ordering", "relation", "b", "suppose", "relation", "treated", "via", "theory", "inclusion", "chain", "maximal", "inclusion", "chain", "power", "set", "b", "b", "b", "using", "kuratowski", "s", "definition", "ordering", "derived", "maximal", "inclusion", "chain", "chain", "must", "correspond", "ordering", "b", "b", "b", "respectively", "ignored", "resulting", "chain", "b", "thus", "associated", "relation", "b", "ordered", "set", "pair", "b", "quite", "natural", "define", "b", "b", "see", "kuratowski", "1921", "170171", "one", "define", "product", "b", "b", "set", "ordered", "pair", "whose", "first", "member", "whose", "second", "member", "b", "relation", "treated", "subset", "function", "b", "certain", "subset", "b", "thus", "many", "representational", "problem", "faced", "zermelo", "s", "theory", "solved", "stroke", "kuratowski", "s", "work", "building", "zermelo", "s", "323", "cardinality", "problem", "concerning", "cardinality", "independent", "problem", "definitional", "reduction", "pointed", "fraenkel", "skolem", "early", "1920s", "zermelo", "s", "theory", "provide", "adequate", "account", "cardinality", "axiom", "infinity", "power", "set", "axiom", "together", "allow", "creation", "set", "cardinality", "ℵn", "natural", "number", "n", "absence", "result", "showing", "2ℵ0", "ℵn", "every", "natural", "number", "n", "enough", "guarantee", "set", "whose", "power", "ℵω", "set", "power", "ℵω", "natural", "next", "step", "cantorian", "theory", "power", "ℵn", "fraenkel", "proposed", "remedy", "skolem", "independently", "proposing", "called", "ersetzungsaxiom", "axiom", "replacement", "see", "fraenkel", "1922", "231", "skolem", "1923", "225226", "say", "roughly", "functional", "image", "set", "must", "set", "thus", "set", "f", "x", "x", "must", "also", "set", "f", "represents", "functional", "correspondence", "axiom", "certainly", "sufficient", "assume", "a0", "set", "natural", "number", "0", "1", "2", "assume", "number", "n", "associated", "power", "ℵn", "according", "replacement", "axiom", "a0", "a1", "a2", "must", "set", "set", "countable", "course", "assuming", "disjoint", "union", "set", "must", "cardinality", "least", "ℵω", "main", "difficulty", "replacement", "axiom", "formulate", "notion", "functional", "correspondence", "solved", "satisfactorily", "fraenkel", "weylskolem", "solution", "work", "functional", "correspondence", "effect", "firstorder", "2place", "predicate", "ϕ", "x", "satisfies", "condition", "uniqueness", "ie", "x", "z", "ϕ", "x", "ϕ", "x", "z", "z", "solution", "replacement", "axiom", "required", "stronger", "zermelo", "s", "original", "separation", "axiom", "indeed", "replace", "however", "fraenkel", "s", "system", "one", "prove", "version", "replacement", "axiom", "version", "separation", "axiom", "show", "separate", "definition", "function", "sufficiently", "strong", "detail", "see", "hallett", "1984", "282286", "zermelo", "initially", "doubt", "replacement", "axiom", "see", "letter", "fraenkel", "1922", "published", "ebbinghaus", "2007", "137", "eventually", "accepted", "form", "included", "new", "axiomatisation", "published", "1930", "zermelo", "1930", "skolem", "s", "formulation", "one", "usually", "adopted", "though", "noted", "von", "neumann", "s", "formulation", "rather", "different", "indeed", "stronger", "36", "324", "ordinal", "although", "kuratowski", "s", "work", "solved", "many", "representational", "problem", "zermelo", "s", "theory", "replacement", "axiom", "show", "obvious", "cardinality", "gap", "closed", "still", "remained", "issue", "kuratowski", "s", "view", "one", "side", "representing", "accurately", "full", "extent", "theory", "cantor", "developed", "transfinite", "number", "fully", "fledged", "object", "mirror", "sizeordering", "set", "ordinal", "numberclasses", "present", "representation", "aleph", "severe", "problem", "mean", "representation", "transfinite", "number", "amount", "assuring", "existence", "sufficiently", "many", "transfinite", "ordinal", "number", "indeed", "stated", "hypothesis", "scale", "aleph", "number", "sufficient", "amount", "claim", "set", "counted", "ordinal", "two", "interrelated", "problem", "pure", "theory", "set", "one", "show", "define", "ordinal", "set", "way", "natural", "number", "generalise", "problem", "make", "sure", "enough", "ordinal", "count", "set", "problem", "fully", "solved", "von", "neumann", "work", "axiomatic", "set", "theory", "early", "1920s", "cantor", "s", "fundamental", "theorem", "ordinal", "number", "showing", "ordinal", "representative", "wellordered", "set", "theorem", "every", "wellordered", "set", "orderisomorphic", "initial", "segment", "ordinal", "every", "ordinal", "ordertype", "set", "ordinal", "precede", "result", "prove", "crucial", "von", "neumann", "treatment", "von", "neumann", "s", "basic", "idea", "explained", "follows", "really", "wish", "take", "basis", "consideration", "proposition", "every", "ordinal", "type", "set", "ordinal", "precede", "order", "avoid", "vague", "notion", "type", "express", "form", "every", "ordinal", "set", "ordinal", "precede", "von", "neumann", "1923", "p", "347", "english", "translation", "according", "von", "neumann", "s", "idea", "1", "0", "2", "0", "1", "3", "0", "1", "2", "conception", "first", "transfinite", "ordinal", "ω", "0", "1", "2", "3", "n", "generally", "s", "clear", "immediate", "successor", "ordinal", "α", "α", "α", "identify", "0", "zermelo", "available", "reduction", "general", "notion", "ordinal", "pure", "set", "theory", "canonical", "wellordering", "von", "neumann", "ordinal", "subset", "relation", "ie", "α", "β", "case", "α", "β", "von", "neumann", "later", "show", "equivalent", "saying", "α", "β", "see", "von", "neumann", "1928", "p", "328", "reprinting", "inclusion", "ordering", "fundamental", "von", "neumann", "give", "general", "definition", "ordinal", "namely", "set", "α", "ordinal", "number", "set", "ordered", "inclusion", "inclusion", "ordering", "wellordering", "element", "ξ", "α", "equal", "set", "element", "initial", "segment", "ordering", "determined", "ξ", "connects", "directly", "kuratowski", "s", "work", "following", "way", "suppose", "wellordered", "set", "mirrored", "inclusion", "chain", "power", "set", "m", "first", "element", "inclusion", "chain", "set", "b", "b", "c", "b", "c", "first", "second", "third", "elements", "wellordering", "m", "von", "neumann", "ordinal", "corresponding", "also", "inclusion", "ordering", "whose", "first", "element", "word", "0", "1", "2", "3", "0", "1", "2", "3", "mirror", "image", "b", "b", "c", "von", "neumann", "ordinal", "effect", "developed", "von", "neumann", "s", "work", "fullest", "published", "theory", "closest", "modern", "account", "found", "mirimanoff", "s", "work", "published", "1917", "1921", "see", "mirimanoff", "1917a", "b", "1921", "though", "nt", "take", "final", "step", "identifying", "set", "characterises", "ordinal", "account", "mirimanoff", "s", "work", "see", "hallett", "1984", "273275", "also", "clear", "russell", "grelling", "hessenberg", "close", "von", "neumann", "s", "general", "settheoretic", "definition", "ordinal", "crucially", "zermelo", "developed", "von", "neumann", "conception", "ordinal", "year", "19131916", "full", "account", "see", "hallett", "1984", "277280", "ebbinghaus", "2007", "133134", "zermelo", "s", "idea", "evidently", "wellknown", "göttingen", "mathematician", "account", "hilbert", "s", "lecture", "probleme", "der", "mathematischen", "logik", "1920", "pp", "1215", "37", "despite", "anticipation", "still", "right", "ascribe", "theory", "von", "neumann", "von", "neumann", "revealed", "extent", "full", "theory", "ordinal", "depends", "axiom", "replacement", "wrote", "later", "treatment", "ordinal", "number", "closely", "related", "mine", "known", "zermelo", "1916", "learned", "subsequently", "personal", "communication", "nevertheless", "fundamental", "theorem", "according", "wellordered", "set", "similar", "ordinal", "could", "rigorously", "proved", "replacement", "axiom", "unknown", "von", "neumann", "1928", "374", "n", "2", "theorem", "von", "neumann", "state", "central", "result", "cantor", "s", "mentioned", "second", "paragraph", "section", "von", "neumann", "go", "point", "also", "p", "374", "possibility", "definition", "transfinite", "induction", "key", "rigorous", "treatment", "requires", "able", "prove", "stage", "transfinite", "inductive", "process", "collection", "functional", "correlate", "set", "set", "thus", "act", "new", "argument", "next", "stage", "replacement", "axiom", "guarantee", "justified", "definition", "transfinite", "induction", "used", "basis", "completely", "general", "definition", "arithmetic", "operation", "ordinal", "number", "definition", "aleph", "number", "also", "allows", "fairly", "direct", "transformation", "zermelo", "s", "first", "1904", "proof", "wot", "proof", "every", "set", "represented", "equipollent", "ordinal", "number", "show", "zermelo", "system", "axiom", "replacement", "added", "enough", "ordinal", "number", "38", "thus", "remarkable", "von", "neumann", "s", "work", "designed", "show", "transfinite", "ordinal", "incorporated", "directly", "pure", "theory", "set", "build", "coalesces", "kuratowski", "s", "work", "designed", "show", "dispensability", "theory", "transfinite", "ordinal", "also", "axiomatic", "extension", "zermelo", "s", "theory", "suggested", "fraenkel", "skolem", "4", "reading", "summary", "cantorian", "theory", "stood", "early", "year", "twentieth", "century", "see", "young", "young", "1906", "magisterial", "hausdorff", "1914", "reading", "development", "set", "theory", "see", "book", "ferreiros", "1999", "hallett", "1984", "hawkins", "1970", "moore", "1982", "see", "also", "various", "paper", "history", "set", "theory", "akihiro", "kanamori", "especially", "kanamori", "1996", "1997", "2003", "2004", "2012", "joint", "paper", "dreben", "dreben", "kanamori", "1997", "place", "set", "theory", "development", "modern", "logic", "see", "mancosu", "et", "al", "2009", "especially", "page", "345352", "account", "various", "axiom", "system", "role", "different", "axiom", "see", "fraenkel", "et", "al", "1973", "detailed", "summary", "role", "axiom", "choice", "insight", "question", "status", "logical", "principle", "see", "bell", "2009", "entry", "supplemented", "entry", "axiomatizations", "set", "theory", "zermelo", "1920", "1940"]}